[
  {
    "text": "Company won't hire any minorities I am a white male who is an upper-middle manager at a regionally successful business in the Pacific Northwest (300+ employees on the payroll). After getting a graduate degree (combined with some Covid layoffs), I have been making strides at work and have received two promotions in the last four years. Approximately two weeks ago I got invited to be a member of a resume review board for selecting new interns and employees. This is the first time I have been a member of such a board.\n\nThings were pretty banal and repetitive at first until we arrived to a frankly over-qualified candidate who was African American. I voted that we bring this guy on but the other people I was on the board with disagreed. They said that they couldn't bring in any more African American employees until more diversity coordinators for the company were hired. I asked what the hell that had to do with anything and they said they didn't want to open up the company to \"liability for any lawsuits\" so they had to acquire more diversity resources before they could hire any minority candidates. The head of the board also stated that this directive came from the Owner/CEO. Completely disgusted, I stormed out of the meeting.\n\nThe head of HR was also a member of this meeting so I have no real avenue for filing a complaint other than via the Oregon BOLI. I have been completely socially isolated at work since this incident and anticipate I am on the verge of being fired. What do I do in this situation??",
    "title": "Company won't hire any minorities",
    "subreddit": "jobs",
    "timestamp": 1696993994,
    "score": 396,
    "keyword": "african manager"
  },
  {
    "text": "I've been in my new job for a month now For 4 months, interview after interview that I thought went well I got nothing but rejection.. the one time the interview was going poorly, everything I said, the guy turned into a negative.. \n\nI eventually said to him \"Mike, I know this isn't going well, I don't always interview well, but I promise you, if you decide to go with me, you won't regret it, I am a good worker and a hard worker\" \n\nHe admitted it wasn't going well, but he invited me back for a 2 hour working interview, to see if I really was any good, they then invited me back on a day when I had a different interview, I told them I couldn't make it, but was available amy other time.. they told me they couldn't do another time, so I let them know that as much as I wanted to work there, I had made a commitment and I really hope they could find another time. Otherwise I understand. They found another time.. \n\nI showed up for the working interview with the guy who would be manager (not the one who interviewed me who was the companies MD) and was told they had asked me to come for an interview for a job that was already offered to someone else, BUT they did have another role I might be good for. So I went to meet with that manager, we talked briefly and she was lovely, told me Mike raved about me (which I was very surprised about since he seemed to really not like me or my interview at all) and they offered me the job later that day.. I have been there a month now and its been fantastic!! Other than Mike firing me because my rugby team I support (springboks, I'm from zimbabwe living in the UK) beat the English team by one point.. I was actually talking to the other south african guy in the office and the boss walked past us and said \"shit really does stick together doesn't it\" which we all laughed at.. \n\nI genuinely enjoy working there.. my trainer, supervisor, manager all the way up to Mike the MD are fantastic.. I really feel valued, even in my low down position. \n\nI was unemployed for 4 months, it was the most stressful time of my life, but my wife was my rock, she kept us going through it all, through a house move, a city move, over 2 hours from the last place, all of it.. (house move unrelated to job loss, the landlords sold the house, we had plenty of notice, that was all fine) but we had nowhere to move to especially since I didn't know where I would he working.. eventually we decided on a place near our friends and god son, they put us up for 2 weeks while we finalised on the new place, everything just slotted together..\n\nSorry for the ramble, I just wanted to let this all out..",
    "title": "I've been in my new job for a month now",
    "subreddit": "jobs",
    "timestamp": 1699483528,
    "score": 8,
    "keyword": "african manager"
  },
  {
    "text": "Saying \"Catch a Bubble\" is now racist... At least according to my school's admin. A bunch of Kindergarten and first grade teachers were told that in a meeting. The teachers were completely confused because they've been saying it for years and asked for an explanation, but of course admin was not able to explain any of their reasoning behind it. One teacher (white woman) was specifically told that she \"doesn't understand the culture of the children (title one school, mostly African American)\" to which she reminded them that she is engaged to a black man and has a mixed race child. They didn't respond to that either and basically the teachers were told if they are ever heard saying it again, they would be fired. \n\nI tried searching this claim and found something about how it's equivalent to telling kids to \"shut up\", but even that seems like a stretch. Nothing about how it's racist. \n\nAnyone else ever heard this?\n\nEDIT:\nTo clarify: I don't think it's racist. I'm just curious if anyone has dealt with something similar with that phrase or another management skill with their admins trying to be \"white saviors\". Also can't believe that of all the issues my school should be dealing with, this seems to be the focus right now. We literally had a child bring bullets into the building last week and that's being completely covered up.",
    "title": "Saying \"Catch a Bubble\" is now racist...",
    "subreddit": "Teachers",
    "timestamp": 1697473897,
    "score": 3972,
    "keyword": "african manager"
  },
  {
    "text": "38(M) looking for a career change, any advice? 38(M) that has worked hard to get where I am today as a hotel General Manager. I am originally from South Africa and first came to the states in 2009 working in F&B throughout the country on an H2B visa. Got my green card in 2016 through sponsorship through my old job and I became a US citizen in June. I currently work as a General Manager of a 91 room full service hotel in Long Island New York, but to be honest I am tired of NY and have had enough of the hospitality industry. I make good money ($155,000 annually but have realized that isn’t even that good in NY) I am married to another South African (we both got sponsored our green cards through the same company and met in the states) and have 10 month old twin boys, but family life is something that has really become important to both of us. My wife and myself have had the discussion multiple times about getting out of NY and me finding a job that has a better work life balance. We don’t have any personal commitment to NY such as relatives etc. so we are open to move anywhere and my wife is in catering sales so it will be easier for her to just carry on with her career path. I’m at a cross roads with my career because I have gotten to a point in the hospitality industry where I am burnt out and just over the industry. \nI have extensive F&B knowledge and hotel experience with managing P&L’s, leading large teams up to 250 people, managing costs and driving revenue and have a diploma in hotel management, F&B management and culinary arts. \nSo this is where I need some advice.\n\nWhat industries can I use my General Manager skills in? (Not really looking to get into sales) \n\nIs it unrealistic for me to push for my current pay grade in a different industry?\n\nAny recommendations on states to consider where the cost of living is better than NY (I understand the cost of living is not what it used to be just trying to get a better understanding of where I should be looking, also spent a lot of time traveling up and down the east cost for work when I was on the visa, lived in Florida, New York and Maine.) \nWhat would the pay scale be in other states to be in line with my NY salary.\n\nCan anyone recommend some recruiters who I can connect with ?\n\nThanks to everyone that can help me figure some of this stuff out.",
    "title": "38(M) looking for a career change, any advice?",
    "subreddit": "careerguidance",
    "timestamp": 1693796247,
    "score": 9,
    "keyword": "african manager"
  },
  {
    "text": "What would you do in my position? Never thought I'd be in this position. I recently (about 3 months ago) took a job as a warehouse manager and was working on filling a vacant position. Did my usual thing interviewing multiple candidates, putting them in order of most qualified, etc. Once I made my decision I pulled the trigger on the top candidate, made an offer and scheduled a start time. Now things get bad. The candidate was a no show and of course my boss called first thing asking what happened and I just assumed that the candidate had a change of heart or better offer (I have a message out to the candidate to find out but haven't heard yet). So my boss asks: \"do you have someone in your back pocket\". I proudly reply that in fact I do, the second person on my list. I start going over his qualifications (just like the first candidate he was perfectly suited to the job), then my boss abruptly stops me and asks his name. (I'm still cringing even thinking of this) I tell him his name and my boss immediately asks if it's a black person. I was literally taken aback and it took me a few seconds to answer his question to which I replied \"yes, he is African American\", and in the the background I could clearly hear his wife (and co-owner) gasp and give the ughhh sound. After that the tone of the conversation completely changed and I was in a kind of state of shock (like how am I involved in something like this). My boss never explicitly said not to hire the candidate, but instructed me to keep looking.\n\nI have been in management for 10 years but this is my first for a \"family owned business\" and never have been in this position. I have been around racism within the ranks of workers and demonstrated that I absolutely will not put up with it even going as far to terminate employment but never the boss. What you do in my position? Thanks.",
    "title": "What would you do in my position?",
    "subreddit": "careerguidance",
    "timestamp": 1701699522,
    "score": 2,
    "keyword": "african manager"
  },
  {
    "text": "What To Do With My Unemployed Father? Unemployment Advice\n\nI am a South African son with a 57 year old, unemployed father. He lost his job several years ago and I have noticed how he has slowly started dying from boredom. He cannot seem to find a job with his qualifications. He was a workshop manager for a company that closed down. \n\nI need advice on what to do to help him. He enjoys nature and working with his hands a lot, not so much people. What careers or hobbies can he look into with the little qualifications and lots of experience (40+ years) he has? \n\nIt's difficult to watch your father slowly degrade because of boredom, which is understandable since he's been in the house for 7 years now... Feel free to ask any questions.",
    "title": "What To Do With My Unemployed Father?",
    "subreddit": "careerguidance",
    "timestamp": 1688157841,
    "score": 0,
    "keyword": "african manager"
  },
  {
    "text": "How do ask for a raise at my 1 year review after I took over essentially all responsibilities at a startup? I'm (31f) coming up on 1 year at my new job and could use some advice for my annual review, which I plan on asking for a raise based on my unexpected additional responsibilities.\n\nFor some background, the startup I work for is a remote US-based \"child\" company that middle-mans the sales, project management, and customer service of the North America accounts for our South African based \"parent\" company. The parent company is a global supplier of manufacturing equipment, where my company is the direct agent for their North America business that works on commission. \n\nWe are currently a team of 3 people - CEO, sales engineer, and traveling maintenance. The company started only a few months before I joined where I was originally hired as the sales engineer, but upon starting my role I quickly and unexpectedly also took over all the following: project management, data entry, customer service, parts orders, US customs importing/exporting, marketing (coordination with 3rd party), accounting, administration, literally you name it and I do it. \n\nThe intent was to grow our team over time to fulfill these other job duties, but I've yet to see any traction on that. I was hired early enough to help set up this company in ways such as build our database, create shared folders, set up accounts like DHL/UPS, etc. I never signed up to take over the company. As you can imagine, over time this became beyond overwhelming and I'm spread super thin. \n\nI report to the CEO, who owns another business that is very successful, which actually invests in and funds my company. He also plays the role of \"stay at home dad of 2 toddlers\" and just recently announced the twins are on the way. Of course, his hands are full so there's been a lack of support and guidance on his end.\n\nI'm a firm believer in and stick to a work life balance of at least 45 hours per week (I work through every lunch) with the regular log on/off an extra 30-60 mins early/late as necessary. I even work on bank holidays that we get off so I can keep on top of things, and I've also worked a couple of Saturdays after a week long travel for work just to catch up.\n\nWith my one-year review next week, I want to ask for a raise but having a hard time wrapping my head around it. The problem is we haven't broke even yet because I simply can't make sales my primary focus. At least my boss has acknowledged this many times and stated \"you do everything\" and isn't upset about it because I'm keeping this boat afloat. But until this past month, he's now pushed hard on shifting my focus to sales because \"we need money\". But there's no one else to backfill, and I want a raise before he does eventually hire someone who is just pulling money from the pot. \n\nDo I need relief from all this? Yes. Do I want to focus on sales? Yes. But I'm conflicted because then how do I answer the phone to take care of our existing customers, and project manage the on-going projects, or complete paperwork for our shipment that just arrived in customs, and literally everything that sponatneously happens on a daily basis that requires immediate attention.\n\nThis is becoming somewhat discouraging and unmotivating. I'm usually an upbeat, driven employee, but now I'm burnt out to the core and have a hard time waking up in the morning. I do love my job, I'm learning so much and killing it. I actually also love the parent company too. \n\nAnd just for the cherry on top in case you couldn't tell, I am diagnosed ADHD (have been for 15 years), so my brain is everywhere and I need guidance y'all - TIA!",
    "title": "How do ask for a raise at my 1 year review after I took over essentially all responsibilities at a startup?",
    "subreddit": "careerguidance",
    "timestamp": 1699558303,
    "score": 0,
    "keyword": "african manager"
  },
  {
    "text": "Career choice: accounting Job progression  example of what I will be seeking .\n!!!!!what issues and critiques are needed to make with this?!!!!!!\n\n4 year degree in accounting ( bba ) \n\nInternships senior year or junior year  to land entry level job \n- with some people \n-  can u do internships first then apply for the cpa \n- internships sophomore- senior year \n- government internships \n- industry intership like big 4 \n\nEntry  level  job with 0-3 yrs ( associate)\n- look on LinkedIn \n- connections through  some people \n- refined resume \n- good communication skills \n\nSenior associate ( 4-6 years) \nmost likely 5th year  looking for the promotion \n\n\nManager 7-9 years of experience\n ^^^Total almost 10 yrs ^^^^ to qualify for this position \n\n\nPartner after being manager with a some good years like 3 good years \n\n!!!!!! I'm African american  !!!!!!\nI live in michigan",
    "title": "Career choice: accounting",
    "subreddit": "Accounting",
    "timestamp": 1698194120,
    "score": 1,
    "keyword": "african manager"
  },
  {
    "text": "Health PSA for my ladies I recently talked to my aunt about my baby cousin (gen Z) who has been having health issues for a while. She and my aunt have both been overweight all their lives and have a tough time managing their weight. I have medical background so they come to me sometimes with concerns. \n\nMy aunt told me that when my cousin was in high school, she was worried for her because she would bleed for almost two weeks. Her cycle would come about every three weeks but would last so long it almost seemed like she only had about a week between each cycle. \n\nThey took her to the hospital and the (white male) doctor told her that is was “normal for African women” to bleed longer and that her weight was probably the cause. He offered no tests or follow ups and she felt he basically dismissed it as “black women are fat, that makes them bleed more.” Thankfully they never went back to him, but she also never went in for a second opinion. \n\nWhen I found out I called my cousin and asked her about this. She told me that some of her friends experience the same thing and it’s so painful that most days she’s in bed and had to drop a college course because she was missing too many days.\n\nThis is NOT normal. No matter your body type. This is akin to hemorrhaging.\n\nI urged her to go see a gyno asap. Thankfully they did as soon as they could and they found MULTIPLE CYSTS on her fallopian tubes that have grown past average size and was close to rupturing. They also found scaring inside her uterus that is being investigated. \n\nThe doctor said that if she had let it go for a couple more years, she would have had to have a hysterectomy…she’s only 23. If the doctor would have caught it while she was young, she would have been able to possibly have them removed and she wouldn’t be experiencing so much bleeding and pain.\n\nIf a doctors “advice” doesn’t sit well with you, ALWAYS seek a second opinion. Don’t just brush it off. Please ♥️",
    "title": "Health PSA for my ladies",
    "subreddit": "blackladies",
    "timestamp": 1701370795,
    "score": 118,
    "keyword": "african manager"
  },
  {
    "text": "Advice for Taking care of my hair from scratch Hi guys,\n\nI hope you are doing well. I'm going to start my natural hair care journey and instead of me posting pictures of my hair I'm going to ask you guys some general questions and see if anyone can guide me to some youtubers, tiktokers, instagrammers, etc or just give me some advice.\n\nI've been wearing a turban and want to start showing my hair. Right now I'm just in a cycle where I keep cutting off my hair cause I get frustrated and wear my turban. I'm also embarrassed cause my hairline is bad and I'm East African so we know I have a big forehead lol. \n\nI know that I want to buy Jamaican castor oil and hair grow serums to fix my hair line. I'm thinking of also just cutting my hair off completely and making it all small and even. ' I've been using kitchen scissors to just cut my hair off and keep it manageable so I can put it under my turban. I don't know if I should just cut it this time properly with my kitchen scissors or buy a buzzer hair cutter so I can cut it properly. \n\nI just don't know what to do when my hair grows out. Long term I do want to get it braided. But as of right now I don't know day to day what to do with it. Right now I'm just washing my hair with shampoo and then using conditioner. I do this once every other day. \n\nOverall my questions are:\n\n\\- Should I buy a razor so I can completely cut my hair short and make it even, or would I be able to achieve the same effect by still using my kitchen scissors?  \n\n\\-  How are you guys taking care of your hair day to day?  Like I know I don't have the type of hair type where I can just quickly comb it and go. Do you guys have any youtubers or anyone you are getting advice from?  I would say my hair type is 4a-4b?\n\n\\-  Has anyone had any success in fixing their hair lines? I remember there was a hair serum that went viral on twitter back in the day I think it was from an Asian ( Japanese?) brand. I'm sure I have it saved somewhere in my photo album but I'm curious if anyone has any serums that have worked for them?\n\nThank you :)",
    "title": "Advice for Taking care of my hair from scratch",
    "subreddit": "blackladies",
    "timestamp": 1678745896,
    "score": 3,
    "keyword": "african manager"
  },
  {
    "text": "Men also cry: The silent scourge of men sexually abused by spouses  \n\nJohn\\* never saw it coming. After what he initially assumed was yet another routine visit to the office of the human resources manager, he was in for a rude shock. “Due to the ongoing restructuring, we regret to tell you that you are among….” His mind went blank at some point.\n\nHe had served as head of the Audit Department in a beverages company based in Nairobi for seven years. His service was being obliterated by the terse message, the kind of news any breadwinner dreads.\n\nBut that was just the beginning of his pangs of distress. In the days and weeks that followed, John’s marital world started to crumble.\n\nThe solid moral ground he had trod on for a decade was slowly shifting. His wife, who had now assumed the role of a provider started to despise him. Stripped of all dignity, John sank into alcoholism and substance abuse.\n\nThe worst was yet to come. “My wife started to demand unrealistic sexual acts that I was not comfortable with,” he says. “She even told our two children that I did not just lose my secular job but that I was not of much use in ‘many other areas as well. They are teenagers and could fill in the gaps. I felt humiliated.”\n\nWhen we think of sexual assault, we think of women being victims. True, there are more reported cases of sexual violence against women than men. However, the newly released Kenya Demographic and Health Survey 2022 had a curious statistic that pointed to sexual violence against married men.\n\nIn a rare disclosure, the report stated that 63 per cent of the married men who had confessed to being victims of sexual violence had suffered at the hands of their marriage mates. Another 32 per cent who had confessed to similar experiences blamed their former wives or intimate partners.\n\nSuch information is not to be taken lightly since the document is one of the most important reports in the country that informs government policy and provides the “benchmark statistics on demographic profiles and healthcare status of households in the implementation of the Medium-Term Plan IV (MTP IV) and the country’s economic blueprint, Vision 2030”.\n\n&#x200B;\n\n&#x200B;\n\n \n\nOne expert in marital behaviour says it must have taken these men the courage of an ox to come out and confess to having been sexually assaulted by their wives or past partners.\n\nWhy though have men become victims of sexual violence? While the report did not state the form that such violence takes, there are indicators as to the reasons why it happens.\n\nAccording to Cherly Mwangi, a counselling psychologist with Kidsalive Kenya, any change in a man’s social-economic status can be a fertile breeding ground for sexual violence from his wife. She offers extensive insight as to why some men suffer in silence and why society has little remedy for men undergoing sexual violence from their mates.\n\nSome of the men, she says could have undergone what is referred to as Adverse childhood experiences (ACES) that bring out the different kinds of traumas that a child undergoes before the age of 18 and the likelihood of normalising sexual abuse in a relationship.\n\nSadly, society might downplay how all forms of abuse shape the kind of adult a boy becomes and the relationships that he will commit to.\n\nBut in the case of men such as John mentioned at the outset, a family head who cannot provide adequately for his family becomes a special target for sexual manipulation by his spouse.\n\n“A man is defined by his job,” she says. “Once he loses his source of income, his status goes with it. His ego becomes fragile and women know how to take advantage of this especially if they are financially stable. A man will be forced to bend the knee so that he can survive and you will find some will blackmail the man even into engaging in coercive sexual fantasies just so he can continue enjoying the privileges in that house.”\n\n&#x200B;\n\n&#x200B;\n\n \n\nMwangi says personality disorders can also create a narcissistic spouse who will use manipulation and gaslighting to get the man to do what she wants. This will include verbal and emotional abuse that leaves a shell of a man, merely existing and easy to manipulate. Such a man will do that which he would normally not have done in his right state of mind.\n\nThen there is alcohol and substance abuse that has made a lot of men fall into the hands of women they had sworn they will not engage sexually with. “Under the influence, the man becomes vulnerable and there are women who already know which buttons to press, making it difficult for a man to resist. It is always followed with regret and self-loathing on the part of the man and many have even been infected with STIs or trapped with unwanted pregnancies,” says Mwangi.\n\nStill, how much does it take for a man to acknowledge that he is being sexually abused by his wife? Again, Mwangi has several perceptions that make men coy and keep such matters under wraps. \n\nMwangi says that society has conditioned men not to speak about such pain. And even when such matters are reported, little action is taken since sexual assault on a man, unlike the physical evidence deduced in a case of a sexually-abused woman, is difficult to prove.\n\nUsually, the emotional and psychological torture a man experiences after being sexually abused, especially by a spouse has led many to depression and even death.\n\n“Come on! Does society even acknowledge a man can be raped by a woman? There is the shame that comes with sexual abuse, the stigma. Do we even have GBV desks for sexually abused men? Forget those whose manhood is chopped off,” she says.\n\nShe adds: “There are no safe spaces for the African man to be vulnerable, no support system for him to even speak about their real emotions let alone sexual abuse in a relationship. A man’s ego is not just bruised but shattered, affecting intimacy, sexual performance and future relationships. He loses his voice completely and when he mentions it to his ‘boys’, they laugh or ridicule him.”\n\nWhile men may stay in their cocoons, the solution, Mwangi says is to create a safe space for men to open up and stop minimising their trauma.\n\n\"Abuse is abuse, and once a man has pointed out they are abused believe them,\" she says. \"If he chooses to confide in you, that will determine if he will find healing or choose to suffer in silence.\"\n\n&#x200B;\n\n&#x200B;\n\n[https://www.standardmedia.co.ke/entertainment/lifestyle/article/2001476801/men-also-cry-the-silent-scourge-of-men-sexually-abused-by-spouses](https://www.standardmedia.co.ke/entertainment/lifestyle/article/2001476801/men-also-cry-the-silent-scourge-of-men-sexually-abused-by-spouses)",
    "title": "Men also cry: The silent scourge of men sexually abused by spouses",
    "subreddit": "MensRights",
    "timestamp": 1689278076,
    "score": 77,
    "keyword": "african manager"
  }
]