[
  {
    "text": "Will I be able to get a job with a bad reference? I have a strong feeling that I have a bad reference holding me back from obtaining employment. I plan to do a reference checking service to see if that’s the case. And if they are I plan to take legal action. \n\nHowever, I’m an African American female so I don't have a lot of fire power, just being realistic. But before I do: can I get a job with a bad reference? How can I overcome a bad reference? Is it a good idea to apply for jobs with a bad reference?\n\nI’ve made mistakes in my life.\n\n\nEdit: here’s the whole story.\n\nI’m in NYC. I work in healthcare.\n\nJust because there’s laws doesn’t mean employers [about references and such] follow them. Example: The 2nd to last employer never sent me my lady check after they fired me. Then lied and stopped my unemployment. Thats illegal. That’s a different story though.\n\nFor this post: I worked in a small office so there’s no HR department. When I left they told me I couldn’t use them as a reference, which I don’t. I left without two weeks notice after the doctor told me I should I find some place else to work if I couldn’t get along with this drugged out, racist coworker. I tried everything I could to mediate the situation. So I agreed and I left. However, I put them on my resume as work history. I think I’m going to remove them.\n\nI think employers are calling them after my interviews and given that there’s no HR just the office manager, she is giving unfavorable references. \n\nWhy do I think this? When I was interviewing (I’ll explain) I had no problem getting interviews. I usually got to schedule a minimum of 2 per week. The interviews seem to go stellar but then I don’t hear back. I’ve even tried reaching out and the interviewer is always “busy” doing something — a meeting, running late, etc. Or they’ll “call [me] back”I’ve tried asking on different days. \n\nNow I was only interviewing for 2 months and managed to land a per diem job in a medical office (it was sorta not what I applied for either but that’s another story). I felt like I went on about 25+ interviews in that time period, but maybe I’m being spoiled given the short period of time I was actively searching. \n\nHowever, at my current job I only have hours when someone is on vacation, calls out, etc. So it’s not consistent. I use DoorDash and Postmates to make up for it. Why am I staying?i was hoping it would become full-time but I don’t seen that happening anytime soon. \n\nI’m working on building a professional image by solving some personal problems like having reliable transportation before I start searching again; hence why I’m also going to do a reference check.\n\nSorry that was long.",
    "title": "Will I be able to get a job with a bad reference?",
    "subreddit": "jobs",
    "timestamp": 1566220941,
    "score": 9,
    "keyword": "african manager"
  },
  {
    "text": "Which type of professional jobs might I apply for given all of my \"diverse and global\" ( i.e. all over the place) education and experience? I have a BA degree in Philosophy from an American university...a State School...(that was a mistake but it is what it is..)\n\nI also have a Certificate in Supervisory Management from a local college in the US.\n\nI'm a current MBA student at a decent university in Africa. But I had to come back to the US because I didn't have enough money to pay for fees and support myself there at the same time. I'm doing International Business...and/or Operations Management. \n\nIn the U.S., I've worked as a Security Guard for 2 years. I've worked in the Events Industry (Sporting events and concerts mostly) for 2 years, I've worked at a Veterinary Hospital for 6 months, Walmart and other odd customer service jobs for like another combined 2 years...\n\nI did a 3 month internship as an office clerk way back when..\n\nI went back to Africa and did odd jobs there as I was pursuing my MBA...but nothing official. Was part of starting a local investment firm, worked on the farm, did a couple waiting jobs...(paid work isn't exactly easy to come by in Africa...).\n\nI've also started 2 different businesses in my time...beyond the investment firm. One was a business dealing with fixing, unlocking, trading phones and other old electronics. And the other was a basic renovation of old/thrown away stuff off craigslist (or wherever)...buffing it up, and re-listing and delivering it to whoever. Just side hustles..but I set up business names too.. \n\nBut I'm back in the US and my current job isn't great either...I work at a nursing home..(As in, you take what you can get lol)\n\nI'm kind of all over the place, I know...but at the end of the day...I am educated and I do have working experience. So, perhaps I might be able to put it all together and make more than 28k/year? I'm 28 years old so I'm getting tired of not having money...\n\nOr do I just go get a cdl and drive a truck around? At least I can get like 50k a year...seems like a waste though, in terms of \"career development\"...but money is money. But, as far as a professional job is concerned...might I fit in anywhere (and make, you know...more than a couple dollars over minimum wage..?) Because, those are the only jobs I can get right now it seems, nothing professional, because I don't have a focused skill set or education...\n\nWhat type of professional jobs might I be looking at with my \"global\" experience, and education? I'm a year away from my MBA...after which I was thinking I might slowly pursue a PhD as I settle down somewhere...(I like to learn lol...)\n\nI'm a dual citizen E.African and American...biracial, bi-cultural, bilingual (swahili and english..) with plenty of life experience on both continents...\n\nAnd my life long dream is to somehow contribute to longevity and aging research (gerontology...) but perhaps not strictly scientifically. I'm not much of a scientist or one for strict regimentation or guidelines (clearly...), but I suspect I could eventually be of some value to that field using my own unique set of skills and talents. As in, I'm not useless....\n\nBut, of more immediate concern is the \"getting decent money\" aspect of it all as well as getting better professional experience....\n\nHelp me!",
    "title": "Which type of professional jobs might I apply for given all of my \"diverse and global\" ( i.e. all over the place) education and experience?",
    "subreddit": "jobs",
    "timestamp": 1553320502,
    "score": 7,
    "keyword": "african manager"
  },
  {
    "text": "Advice on what job to pursue when I arrive to USA. I am moving to America to be with my fiance, whom I will marry. However, I am concerned over what jobs to pursue when I arrive there (specifically the state of Nevada).\n I am a South African with a Bachelor in environmental management (which is pretty much useless in my experience), I also have a Post Graduate Certificate in Education with a CELTA and TEFL.\n I have been working as a english teacher in South Korea, but I don't know if that will help me.\nI was thinking of picking up any booming trade, but in all honesty my biggest fear is suffering from unemployment in Nevada (considering my portfolio is more tailored to teaching in Asia). \nDoes anyone have any advice or reassurances for my situation",
    "title": "Advice on what job to pursue when I arrive to USA.",
    "subreddit": "jobs",
    "timestamp": 1574572384,
    "score": 1,
    "keyword": "african manager"
  },
  {
    "text": "AMA: We are the Asclepius Snakebite Foundation (ASF), a team of snakebite experts working to address the global snakebite crisis and provide you with the right information to manage these patients. Ask us anything! **This AMA is over. Thanks for coming by!**\n\nHello everyone! Snakebite season is upon us again so it seemed like a great opportunity to set up another AMA for the reddit medical community on an unusual topic that tends to generate a lot of interest.\n\nWe are the [Asclepius Snakebite Foundation (ASF)](http://www.snakebitefoundation.org), an international 501(c)3 non-profit organization led by many of the world experts in snakebite medicine that is dedicated to reducing the more than 138,000 deaths and 500,000 permanent disabilities caused by snakebite envenoming worldwide every year. We travel to the regions with the highest number of envenomations and work alongside local partners to save lives and limbs through a combination of research, treatment, and training. We have brought a few of our medical specialists here to answer any questions about snakes, snakebites, snakebite treatment, antivenoms, venoms, or whatever else comes up. We are here dispel some of the pervasive myths/misconceptions about snakebites and provide you with the right information about what to actually do for these patients, so ask us anything that interests you about the topic and we will do our best to give you a good answer.\n\nSince we all work shifts and assume many of you do as well, this AMA will run for 36 hours or so and three of our medical experts will be available to answer questions during that time:\n\n* Jordan Benjamin is a herpetologist, snakebite researcher, and wilderness paramedic with over 10 years of experience wrangling venomous snakes and treating snakebite patients in remote health centers and villages throughout sub-Saharan Africa. He is one of the leading experts on assessment, diagnosis, treatment, and prolonged field care of snakebites and other envenomations in remote and austere environments. Jordan is the founder of ASF and will be answering as u/snakebitefoundation\n* Dr. Ben Abo is an emergency medicine & EMS physician, paramedic, clinical assistant professor of emergency medicine at the University of Florida, and the medical director of the elite Venom One and Venom Two response teams of Miami-Dade Fire Rescue and Lake County Fire Rescue. These teams make up the only national-level antivenom bank in the United States. He is widely known for his [fabulous hair](https://www.medscape.com/viewarticle/910583), which some believe give him special powers such as the ability to [jump in front of a speeding train to pull a seizing patient off the subway tracks in NYC](https://nypost.com/2013/06/21/miami-doctor-a-lifesaver-after-pulling-man-suffering-seizure-from-village-trains-path/).  Ben is a co-founder of ASF and will be answering questions as u/venom1doc\n* Dr. Nick Brandehoff is an emergency medicine physician, medical toxicologist, and assistant clinical professor of the department of emergency medicine and division of toxicology at the University of California San Francisco-Fresno program. Nick completed his tox fellowship at the Rocky Mountain Poison and Drug Center and has extensive experience in both the laboratory  and clinical management sides of the venom world, and he leads the envenomation working group for the American Academy of Clinical Toxicology. Nick is a co-founder of ASF and will be answering questions as u/ToxDoc10\n\nThe three of us will be in Guinea next month to set up a rural snakebite clinic and launch a big study into neurotoxic snakebites by African cobras and mambas, which should be a blast! If you want to learn more about our team you can [check out the bio page on our website](https://www.snakebitefoundation.org/teamsnakebite).\n\nOnce again, we aren't selling anything and don’t have a specific agenda other than raising awareness for the snakebite crisis worldwide and educating people about snakes and snakebites. We are looking forward to talking with all of you!\n\n&#x200B;\n\nSincerely,\n\nTeam Snakebite\n\n&#x200B;\n\nPS - to kick things off, we highly recommend you [read this article we wrote about what to do if you are bitten by a snake in the middle of nowhere far from medical care](https://www.snakebitefoundation.org/blog/2018/9/6/how-to-survive-a-snakebite-in-the-wilderness) as this is one of the questions that always comes up first!\n\nPPS - follow us on twitter for updates on what we are doing [@Snakebite\\_911](https://twitter.com/Snakebite_911)\n\nhttps://i.redd.it/mei2hgxruc631.png",
    "title": "AMA: We are the Asclepius Snakebite Foundation (ASF), a team of snakebite experts working to address the global snakebite crisis and provide you with the right information to manage these patients. Ask us anything!",
    "subreddit": "medicine",
    "timestamp": 1561405842,
    "score": 88,
    "keyword": "african manager"
  },
  {
    "text": "UPDATE to \"I work with the stinkiest nurse I've ever met and I'm straight up not having a good time. Need help\" I posted [this](https://www.reddit.com/r/Nurse/comments/dshncv/i_work_with_the_stinkiest_nurse_ive_ever_met_and/) last week about the extremely stinky nurse I work with (edit: I just realized I made the original post in r/nurse instead of here by accident, hope crossposts are ok). \n\n(**tl;dr of original post:** this day shift nurse now works on my unit and I (night shift) get report from her 3x/week. She wreaked of B.O stronger and mightier than I have ever known the likes of in my life and it lingers long after she leaves) \n\nThere was some really funny and some genuinely helpful feedback on that thread and I didn't have time to respond, but I got a little update tonight and thought I'd share.\n\nThe BO stench has not improved even slightly (think it's getting worse) and it is genuinely super hard to be around this woman (I'll call her Brittany). I have to hold my breath when I count narcs with her, and I've noticed other people around her doing the same.\n\nTonight I finally caved and brought it up with the night shift supervisor. The supervisor told me that she's aware of the issue and that Brittany has been approached regarding this. She was asked to do something about her B.O and she refused, stating that it was against her religion/culture to wear deodorant. So management dropped the issue and she's been doing her thang ever since.\n\nBrittany is originally from an African country, I think she has been in the US for maybe 10 years. I don't have any info on what religion/culture she is that prohibits this, and I'm kind of torn on where I stand on it I guess? I'm quite familiar with Africa; I did the peace corps there and spent a significant amount of time in countries quite close to where Brittany is from. So while I don't know about *her* specific country/culture, I am very familiar with how wide the culture gap is between African countries and the US. I know that religious beliefs can hold a ton of weight in these communities and I understand/want to respect her ability to stay true to that side of herself.\n\nBut...while I feel like a total asshole saying this...part of me also thinks that her employment at my facility requires *some* cultural adaptation on this issue. If it's to the point that she is stinking up entire rooms and leaving them stinky for up to 30 mins after she leaves, to the point that people have to hold their breath around her and patients avoid approaching her, that affects all of us. Especially given that she works in the healthcare field, I feel like there's an expectation to meet some basic hygiene standards. She works days, so she interacts with doctors, family members, upper management, and state surveyors that don't know about her culture/religious beliefs and I imagine the B.O doesn't leave a very good impression.\n\nAll this to say, management dropped it but they have been getting more complaints lately as it's been getting worse. I'm a floor nurse so it's out of my hands now, but I'm curious about the hypothetical: what *can* you do in this situation? Have any of you guys had similar things happen to you before? I'd love to hear more info if you guys know about any cultures/religions that practice this. I want to be open minded and hear different viewpoints. I wonder if there is some kind of a compromise/middle ground...like maybe if she is against deodorant specifically she could use alternative methods to take care of the BO?\n\n **tl;dr** stinky nurse (Brittany) has received complaints and management stepped in to confront her about it. They asked her to wear deodorant... she said no, because it goes against her religious/culture beliefs (she's from an African country). What are your thoughts/ideas for solutions to this?",
    "title": "UPDATE to \"I work with the stinkiest nurse I've ever met and I'm straight up not having a good time. Need help\"",
    "subreddit": "nursing",
    "timestamp": 1573481476,
    "score": 27,
    "keyword": "african manager"
  },
  {
    "text": "My co-teacher is lazy, very critical of my teaching, as well as demeaning to the students...... (RANT) This is my first year teaching high school level curriculum. While rewarding it can be difficult, my school is extremely unorganized. A week and a half into school I had no books for my students, missing desk, I haven't gotten any IEP's, and a co-teacher placed in my class without notice. The periods are long 2 hours. We are suppose to split the teaching equally (1 hour a piece). However, he does nothing..... He posts on the smart-board a \"do now\", doesn't go over the instructions, and sits down fanning himself the entire period. The \"do now\" usually takes about 10-15 mins at most, when the students are finish he says you can go ahead. For the entire hour and 45 mins, he sits there. He offers no classroom assistance, he offers no help with classroom management, NOTHING. Some days he doesn't even do the \"do now\" with the students, he plays a game for 10 mins, or simply does nothing. This wouldn't annoy me as much if he didn't criticize my teaching style when class is over. \"I would have done this...\" \"You should teach this....\" \"I didn't like that you did that....\" I think to myself why at no point does he step in to teach? \n\n&#x200B;\n\nSadly, he has very poor vocal reading skills, which makes it hard for him to teach when I implore him to do so. He keeps saying repeatedly 90% of the students in my district are special needs. His exact words are \"Most of these kids are special needs or slow.\" Which is extremely false..... And I am not sure where he is getting these numbers from. When kids are disrespectful he says that is simply their culture..... I had to say excuse me..... He went on to say \"It's their African american culture, they are special education, and they are rude.\" I want to coin him as racist but know it will be hard to push that when he is African born in France. I am not sure what to do. I am currently in my classroom, upset, and not wanting to go into the class with that man. As a woman born in the city, and afro-latina my mother being African American I am offended. What should I do.\n\n&#x200B;\n\nSorry for the grammar errors, I am a bit upset on my break.",
    "title": "My co-teacher is lazy, very critical of my teaching, as well as demeaning to the students...... (RANT)",
    "subreddit": "Teachers",
    "timestamp": 1569247496,
    "score": 6,
    "keyword": "african manager"
  },
  {
    "text": "Is it normal for an assessment test to require a third party organization manage your webcam??? Test got terminated for no reason Im a new recent graduate in CS and I've been earnestly trying to find a job and I finally landed in a place where I can start doing the interview process. The first step is a assessment. I dont know what this employer does with this assessment because they said I will start training super soon. Its an entry level software dev position and they are doing training etc. BTW my recruiter STRAIGHT GARBAGE. I emailed him countless times to get more info never a single response like WTF? But i digress. First part that I've never done for an assessment is for the webcam to be accessed by a third party company. Welp f it i need this job. During the test it told me image violation meaning my face some how wasnt in frame. Im like \"Wtf my face is right here\" so i put a book under my laptop on my lap so its level with my face. While taking it my laptop began to slide off my leg and i accidentally touched the mouse pad of my laptop. My cursor was at the top of the browser and click......... I get a window violation and my test is terminated. This is not only frustrating asf but i have anxiety taking these sort of test. Also im a new grad where tf you learn about j2ee. Where do we learn to use enterprise software??? I've used different frameworks and code things from scratch. J2ee wasnt event apart of the job description. \n\nThe company I just applied as I recently learned today is a very discriminatory place. The place laid off all 30+ new hires that were african american. Dont believe?? find the review and i have friends who went to this place. They graduated in may did the whole training and did good got hired on and after a few weeks all african american employees fired for no reason. A lot of them know their ish so wtf?? In new york its the same type reviews. I may have strayed a bullet idk. \n\nTLDR: Why are some recruiters so bad? I cant get a single response at all from the one who recruited me. I messaged on linkedin and via my gmail. Did all of you have to do the same webcam thing? I dont like it one bit :/ . What is an effective course for j2ee since this assessment was based on that? Are all entry level software engineer test like this?\n\n\nFOR THOSE WHO DONT BELEIEVE HERE IS A REVIEW About this company. If your in my state you probably seen it if you researched the company.   ->\n\n \"This is the worst dicriminative place to work. Turns out their management team is the worst deceiving lying manipulative (Chonia Ballard, Karthic) unprofessional clueless individuals who know nothing about  insurance claims. They would train new hires to process 40 claims a day for commercial and government payors. What stood out to me the most was how they house their native Indians on one side and my black folks on the other side like a slave plantation. I witness Chonia mistreat and displace several of her own black people for this Indian guy (Karthic). Then turn around and laid off all 30 new hires who were all black African American aside from the Mexican and Caucasian woman who quit the second week of training.\"",
    "title": "Is it normal for an assessment test to require a third party organization manage your webcam??? Test got terminated for no reason",
    "subreddit": "cscareerquestions",
    "timestamp": 1568602437,
    "score": 0,
    "keyword": "african manager"
  },
  {
    "text": "It just hit me that I may never get a job in STEM and I feel sick to my stomach. It just hit me: I may never be given a chance because I may NEVER be looked at as competent. I don’t know how I should feel about this. Being in this field has been a dream for me, but what if I can’t even make it happen? \n\nHere’s the thing, most of my managers have been black men/women and of course, I feel good for that because it seems like I’ve been given a chance BECAUSE of that. But in trying to move forward, I don’t think anyone will *believe in me* enough to say “Hey, let’s hire her.” Hell, I don’t think I can even get a job interview because of my name (“African American sounding”) though I have gotten a few video interview opportunities and emails about potentially being hired.\n\nI’ve got 2 degrees, one in computer science and one in german, I’ve been a leader in several clubs, had a couple of internships… I don’t want this to hurt so badly but it kind of does. \n\nAny words of encouragement or similar stories? I don’t want to fail, a job is everything to me and I’m about to graduate.",
    "title": "It just hit me that I may never get a job in STEM and I feel sick to my stomach.",
    "subreddit": "blackladies",
    "timestamp": 1551721867,
    "score": 54,
    "keyword": "african manager"
  },
  {
    "text": "TEFL Industry Woes Edit2: Thank you ladies! I appreciate the advice and contacts. I apologize for the negativity... I’m heartbroken and I realize I’ll need more resilience if I want to get anywhere with my job hunting. This post is my experience throughout the year when applying to TEFL jobs. I have other skills and I’m willing to pursue other things. I just wish the feedback I was getting from recruiters was less critical of things I can’t do anything about. I can stomach a wig and slight changes to my appearance to get my foot in the door. It just breaks my heart. It really brings me down and I tend to stay there. This post is my self-esteem taking another knock. Again, I apologize for the negative loathing. I’m not giving up! I want this! \n\nI wish I wasn’t black, so I could have an easier go at getting into the TEFL industry. \n\nToday, I had an interview with a recruiter and I needed to wear a wig over my hair because my afro puff was too big. Like I got there all dolled up and beautiful (can confirm I was cute AF because the manager even loved my hair... she was all up in it! Touching and everything).\n\nI love Asian countries but am I willing to continue to sell myself like this? No... it’s disheartening to have to keep up an appearance I don’t even like. I don’t like make-up (I have severe psoriasis flare ups), I don’t like weaves or wigs and I cannot bring myself to accept them. It took Chris Rock’s docie to make me appreciate my natural hair but it seems I’ll have to put it away for a decent job. \n\nMy options are very limited given the ever increasing unemployment rate in South Africa. I really would love to teach overseas but at this rate, I’m likely to give up on the whole recruitment process. I wish I was a white South African woman or a very white passing coloured woman (not derogatory in SA, it’s an official name for the mulato race). \n\nIt feels like there is no real place where my race doesn’t matter or is actually beneficial to me.\n\nEdit: I realize that just because I keep having bad experiences, it does not mean the whole industry is bad... neither is South Africa completely bad. However as a young black woman in South Africa I am tired of being black... I don’t want this life experience anymore. I don’t want to be this race anymore. I understand why women bleach their skin... I get the Eurocentric hair and make-up trends... it’s easier to just fit in.",
    "title": "TEFL Industry Woes",
    "subreddit": "blackladies",
    "timestamp": 1573141580,
    "score": 13,
    "keyword": "african manager"
  },
  {
    "text": "Black History Month: Baseball Managers, Coaches, and Executives In memory of his passing today, my selection for today's topic is baseball managers, coaches, and executives, and specifically Frank Robinson.  Mr. Robinson was actually born in my hometown of Beaumont, Texas and during his career won two MVP awards and one World Series.  In 1975, he made history as the first African-American to be named of a major league club, when he was named as manager of the Cleveland Indians (while still playing!!!).  Mr. Robinson passed away on Thursday, February 8, 2019.  Rest in peace with the ancestors Mr. Robinson.",
    "title": "Black History Month: Baseball Managers, Coaches, and Executives",
    "subreddit": "blackladies",
    "timestamp": 1549605375,
    "score": 12,
    "keyword": "african manager"
  }
]