[
  {
    "text": "How to stop this Ok, I'm not a teacher by trade, I spent 50+ years in the HVAC industry. I'm a 62 year old white male and I'm working in a high school that is largely African American I am teaching their HVAC program. I came to this last October when the former teacher retired and asked if I'd be interested. After thinking about it I decided that I really liked the idea of being able to mentor young students and helping those who had no designs on attending college, and were looking for a good way to support their lives at the next level. \n\nMostly this has been the case, the students are generally great and responsive. However..... I have a few students that I cannot get to stop being disruptive, they refuse to pay attention and get out of their seats, they talk constantly. This is bad enough for a normal class and tough for teachers who have gone to college and trained to handle these situations. These traits can be deadly in my lab if they do not pay attention they can electricity themselves or others, there is the possibility of exposure to liquid refrigerant, explosions due to the natural gas furnace that we work on and so on. The administration is supportive, but how many red slip referrals can I give trying to get my point across to these kids before someone gets seriously injured. \n\nMy second issue and the reason why I have my demographic and those of the school is their use of the N word. They state that they're using it would seem a at the end and not the r, personally I do not see the difference and it bothers me greatly. My question here is do I die on this hill, or turn my head and try to not let it bother me. I've brought in a coach at the high school and the principal to talk to them about how this word should be offensive to them, bit it fits in one ear and out the other. \n\nI'm not sure that I'll get the right answer here, and not sure that I'm really expecting one, but it did give me a place to vent and to try to work things out. Thank you for reading this far.",
    "title": "How to stop this",
    "subreddit": "Teachers",
    "timestamp": 1693552665,
    "score": 26,
    "keyword": "african principal"
  },
  {
    "text": "Falsely accused and reported to TEA I received an email this past weekend from an unknown parent informing my principal and I that last week during a field trip with my students, she witnessed me yelling at African American students multiple times. She “implored” my principal to take action and alluded to my actions being racially motivated. \n\nI had several adult chaperones on that field trip so I reached out to each one to ask if they ever witnessed me raising my voice at a student and to please let me know if this is something I may have done so I could learn from this. Literally every single parent replied that I never yelled at anyone, that I was actually soft spoken, and my students were all so well behaved that raising my voice was never necessary, and they were impressed with how everything went. \n\nWith permission from my principal, I replied to the parent thanking her for bringing this to our attention, that I was not dismissing her claims, but I was confused with what she saw because I don’t recall that happening nor did my chaperones. I asked that we meet so I could gain better clarity and grow from this as well. She replied angrily in all caps that she knows what she saw, knew what shirt color I was wearing, and that she didn’t want me to reply anymore. She also recommended I read a book on racial trauma because yelling at African American kids can cause trauma when it is done by another race. \n\nBy now, I was heated and I probably shouldn’t have replied, but I did. I removed the names of the parents on the screenshots and sent them all to her. I said it is apparent that she does not want to meet in person, I do not know her intentions, so this would be my last correspondence with her. \n\nShe replied, “Did you just say you don’t know my intentions? Your behavior is ridiculous!” Then said she would make a formal complaint to my state’s education agency (she CC’d the complaints email), my superintendent, as well as my principal. \n\nMy principal and I called the chief of schools together to inform her. She said that these things happen all the time and that they would handle it. I’m afraid this parent is going to continue to harass me. I contacted my union for advice on how to proceed, but I guess I’m coming to you all for some comfort and advice as well. Maybe similar stories to help me get through this?",
    "title": "Falsely accused and reported to TEA",
    "subreddit": "Teachers",
    "timestamp": 1680131191,
    "score": 17,
    "keyword": "african principal"
  },
  {
    "text": "District Decision I don’t know if I need advice or a place to vent.\n\nI am a middle school teacher at a Title 1 school. We were “graciously blessed” this year with a problematic student who is on his 3rd strike in our district. He has a long rap sheet of behavior issues from two other middle schools and the district transferred him to our school thinking a small K-8 environment would be better for him.\n\nObviously this isn’t the case. He’s had behavioral issues since the first day of school with all of us middle school teachers. He uses lewd and foul language and causes a lot of micro aggressions that make most of the other students annoyed and slightly fearful with him. It’s basically like “who will he pick on today?”. We have documented so much of his behavior but have received so much pushback from the DO about him. \n\nI’ve been extremely patient with him all year even though I dislike him immensely. However, today was my final straw.\n\nHe recently got a buzz cut and wanted to hide it and chose a durag to cover it with. Mind you this kid has specifically targeted our African American students and will casually use the N word to describe them and others. The middle school  teachers told the principal that we will not allow him to wear it in our classes and he made such a big deal about it that admin asked the district and they ok’d it. \n\nIt completely undermined us as teachers and is allowing this racist student to get away with cultural appropriation. He has no respect for the African American culture and is enjoying wearing it to cause drama. He called me racist because I don’t think it’s right he can wear that. I am so over this kid and no matter what we say or do they keep bending over backwards for him. \n\nI am at a loss of how I navigate the rest of the year with this student. I have lost what little respect I have for my administration and for the district. I almost want to leak this situation to a newspaper and see what happens.",
    "title": "District Decision",
    "subreddit": "Teachers",
    "timestamp": 1699388643,
    "score": 6,
    "keyword": "african principal"
  },
  {
    "text": "If you weren’t tied down, would you try teaching at an international school in South East Asia? I’m working as an AP biology teacher at an international school and it’s been one of the best choices when looking at being a local teacher. \n\nA lot of our own countries don’t seem to respect us, so why not leave (again, if you don’t have anything tying you down - also, a lot of the schools here pay for your flights to the country and all of the visa documents). \n\nFor additional context. I’m South African and I probably make more than a high school principal in my home country despite being just a subject teacher and in my early 30s",
    "title": "If you weren’t tied down, would you try teaching at an international school in South East Asia?",
    "subreddit": "Teachers",
    "timestamp": 1687664224,
    "score": 3,
    "keyword": "african principal"
  }
]