[
  {
    "text": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me So I started a new job. I'm a teacher (technically curriculum director but just a fancy title for writing repots while teaching) . My second day my supervisor held a meeting to yell at us all for not replying to his text message. I just sat there to gauge how everyone reacts. No one said anything. I have been here now 2 months and he is not a nice person.\n\nThings he doesn't like or respect: women, Asian people, African people, or his own wife (he jokingly called her an uneducated hillbilly)\n\nHe told me yesterday he paid for my time so he can text me whenever he feels like it after I told him to not text me at home about work stuff. He cannot fire me as he needs to provide proof to HR that I did something illegal or neglected my work as I am under contract for the next year and a half. \n\nI do not like him and just want to annoy him so much that he avoids me like the plague cause I am not quitting this job because I like everything about it but him. Also forgot to mention, principal is on autopilot, so going to her is no good. Any good ideas?",
    "title": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me",
    "subreddit": "jobs",
    "timestamp": 1614441321,
    "score": 3,
    "keyword": "african principal"
  },
  {
    "text": "Finally hit my first major road block First year agricultural teacher here. So far, year has been mostly smooth with both lesson planning and dealing with students. I only had like 1 student who grinded my nerves really bad. Admin is great in terms of support and letting me have freedom.\n\nLast two weeks have been fucking hell.\n\nHomecoming week was a disaster. Fights every day, TPing every night. And not just TPing, which I'm personally fine with, but going in groups of 100 students, yelling and swearing into teachers houses and the houses of their neighbors. Going in long trains of vehicles, running lights/stop signs. \n\nAnd then on Friday, in another teacher's class my FFA president turned around to an African American student and told her to turn that N-word music off. Teacher was not in the room but it was caught in a tik-tok. \n\nSo, after consulting other ag teachers and my admin, I met with the mom and kid and said he could either step down from the officer team or be removed from FFA. My Constitution doesn't allow me to remove from the officer team, but I can revoke membership so I had to do that workaround. \n\nMom flipped me off with the principal sitting right there and has sent 2 nasty emails to me/admin. Not even at me, complaining about admin and the former ag teacher. \n\nAnd it hit me, this is probably the first time there's been an actual consequence for something like this. Last week a group of football players was taken to the police station and they all played homecoming. This kid didn't even get hit with a suspension or anything. \n\nNow I'm avoiding going out in this small town because I don't want any contact/confrontation with the family unless admin is present.\n\nNo accountability, no consequences until me. Ridiculous. And now they're gaslighting me and I'm starting to feel like I did something wrong somehow.",
    "title": "Finally hit my first major road block",
    "subreddit": "Teachers",
    "timestamp": 1633204346,
    "score": 45,
    "keyword": "african principal"
  },
  {
    "text": "New student teacher noticing potential racism with cooperating teacher and needs advice Hi everyone,\n\nSo my fiancée just finished her first week of student teaching for her master’s program, and is assigned to kindergarten. She loves her students and has a good relationship with her cooperating teacher, who has been teaching for 5 years and went through the same program.\n\nHowever, my fiancée has noticed that her cooperating teacher appears to treat the one African-American boy in the class more harshly than the others, who are mostly white and Latina. The little boy had a rough first day—as can be expected for a kindergartner on their first day—and from then on, she has described him as “defiant”; which she hasn’t described any other student as. My fiancée has a good relationship with all of the students and says that he’s really sweet, really smart, and has been no more defiant than any other student.\n\nToday, he apparently swept some plastic fruit toys off of a kitchen counter toy—the cooperating teacher claimed as he was looking her in the eyes—and she grabbed him by the upper arm and forcefully sat him in the timeout chair. My fiancée thinks she seems to be overly scrutinizing him—not in an obvious way but in what seems like an insidious, possibly subconscious way.\n\nMy fiancée questions whether her newness to teaching and proclivity for leniency might be clouding her thoughts but it’s gnawing at her—especially given the effects of the pandemic on kids and this having been the kindergartners’ first week of school ever.\n\nShe doesn’t feel like she can tell the program professors or directors because they’re still close to the cooperating teacher, and doesn’t want to overstep with the elementary school principal and staff. She also doesn’t know whether it’s appropriate to bring it up with the parents or with the cooperating teacher—especially as the cooperating teacher is the main person determining her grades.\n\nHas anyone dealt with anything similar, or does anyone have any advice? \n\nThank you so much!",
    "title": "New student teacher noticing potential racism with cooperating teacher and needs advice",
    "subreddit": "Teachers",
    "timestamp": 1630106255,
    "score": 8,
    "keyword": "african principal"
  },
  {
    "text": "Urgent! I need to make a decision by tomorrow… I received two job offers. I place a description of each offer  below. Which one would you pick? I think it’s worth mentioning that I have two small kids. We can manage the pay cut. However, I have the itch to buy a new car and home…lol\n\nStride-At Risk/Credit Recovery Teacher\n\nSalary 41,000_\nRemote 9-5 (M-F)_\nChildcare possible can be cut to part-time _\nAt Risk Teacher/Credit Recovery- this requires minimum prep_\nNeed to learn new learning  management system_\nSchool start in early Aug. for teachers _\nLarge classes _\nOpportunity for growth- I landed the job fairly easy. I spoke to the principal about growth. I see where people moved up within a year. They offer tuition assistance for masters. \n\n\n\nNorthshore High-Social Studies Teacher\nSalary 64,000_\n6:50-3:00 (M-F)_\nMust change child care to a place closer to the job or will talk to current daycare about dropping my kids off sooner😩_\nPreps are African American Studies and Psychology AP. Interested in the subjects but never taught  them. _\nNeed to learn new learning management system_ \nSchool start July 28 for teachers_\nLarge classes_\nOpportunity for growth- I interviewed before submitting my application. A former co worker sang praises about me to his principal. The principal forwarded my info to Northshore. I feel that if I do a great job more doors will open",
    "title": "Urgent! I need to make a decision by tomorrow…",
    "subreddit": "Teachers",
    "timestamp": 1625981119,
    "score": 5,
    "keyword": "african principal"
  }
]