[
  {
    "text": "What can my mom do? Alright Reddit.. I've had several throwaways and small accounts, but I've never actually posted before. I'm really banking on some helpful advice here. \n\nMy mom graduated from college with a Bachelor's Degree in Biology, but she stayed home with my siblings and I while we were really young. When we were kids, she went back to school to obtain a Master's Degree in Science Education, and she started teaching high school Chemistry. She taught at her first school for a few years, but her contract wasn't renewed because she had run afoul of the head principal (not giving school board member's children grades they didn't deserve, not passing star athletes who didn't put in the work, and disciplining a girl for acting belligerent and skipping class, who in turn went to said principal and accused my mother of being racist and only disliking her because she was African American). \n\nShe found a new job for the next school year at a smaller school district teaching Advanced Biology and Environmental Science, and even though it was a smaller school (the previous high school had been a huge intercity school) her salary went up by about 10k per year. She taught there for 1 full year, and is in her second year at this high school. \n\nHowever, yesterday she was told that because the school can't pass a levy (it's a very small blue collar area who doesn't value education too much) her and a few other newer teachers are being let go and absorbed for the following year. She is still getting payed through the summer, and she's going to finish up the year, but she won't have a job after that. \n\nWe're not going to be without an income as my dad is a police officer and I'm moving out of my parents house when college is finished, but my question is what are her options? \n\nShe put so much into teaching and loves making a difference in her kids' lives, and she's a very good teacher. She's just tired of looking for a new job every couple of years, and anyone who is a teacher knows how hard jobs are to come by. She is a very smart woman, but she doesn't know what else she can do besides teaching. \n\nIs there any type of profession that those degrees can matter in besides teaching? I'm not sure what else to ask but if you guys could take a second and give whatever advice you have, no matter how small. I just want my mom to be happy and I feel bad that she keeps getting screwed by the education system. \n\nI appreciate everything you guys have to offer.",
    "title": "What can my mom do?",
    "subreddit": "careerguidance",
    "timestamp": 1490301586,
    "score": 19,
    "keyword": "african principal"
  }
]