[
  {
    "text": "It’s my cake day, *itches. I don’t know, I’m just thrilled to have survived this far.  Got my multistate licenses approved. Moving to Georgia to work maternity after years of wanting to help with the lack of care ESPECIALLY for African American women.  And now I’m doing it.  I will be hands on with my patients in a low income, high minority area to give these women the love and care they DESERVE.  (Their pain is VALID.  If they say something isn’t right we INVESTIGATE WHY.  I hope my diligence saves lives).  This whole mission started by making friends with the CEO of “Femly” who is a young beautiful black woman who lost her first baby and nearly her life because she was ignored and now makes wholly organic feminine products.\n\nAnyway.  It’s my cake day.  I survived the first year and landed exactly where I wanted.  Yay!",
    "title": "It’s my cake day, *itches.",
    "subreddit": "nursing",
    "timestamp": 1616394174,
    "score": 19,
    "keyword": "african ceo"
  },
  {
    "text": "Shall I take this internship ? (As a high-schooler) Hey Reddit ! So I applied for this internship in my country and I got accepted as a highschooler which is not common at all, I think. The CEO sounded friendly, he said the internship could be done remotely and the timing is very flexible, however they expect me to work 7hours a day average for 2 months, and unpaid. This could be a great opportunity for me to learn, because I never dealt with big code bases, all I did was some small projects. But thinking that I would work 7hours/day average on summer just overwhelms me, I think 7 hours would probably take out an entire day, no beach, no going out etc ... maybe I'm exaggerating idk.\nWhat do you think ? Shall I go for it ?\n\nEdit : I'm in a north african developping country and getting internships is hard here due to the lack of technical startups",
    "title": "Shall I take this internship ? (As a high-schooler)",
    "subreddit": "cscareerquestions",
    "timestamp": 1615969706,
    "score": 0,
    "keyword": "african ceo"
  }
]