[
  {
    "text": "Company won't hire any minorities I am a white male who is an upper-middle manager at a regionally successful business in the Pacific Northwest (300+ employees on the payroll). After getting a graduate degree (combined with some Covid layoffs), I have been making strides at work and have received two promotions in the last four years. Approximately two weeks ago I got invited to be a member of a resume review board for selecting new interns and employees. This is the first time I have been a member of such a board.\n\nThings were pretty banal and repetitive at first until we arrived to a frankly over-qualified candidate who was African American. I voted that we bring this guy on but the other people I was on the board with disagreed. They said that they couldn't bring in any more African American employees until more diversity coordinators for the company were hired. I asked what the hell that had to do with anything and they said they didn't want to open up the company to \"liability for any lawsuits\" so they had to acquire more diversity resources before they could hire any minority candidates. The head of the board also stated that this directive came from the Owner/CEO. Completely disgusted, I stormed out of the meeting.\n\nThe head of HR was also a member of this meeting so I have no real avenue for filing a complaint other than via the Oregon BOLI. I have been completely socially isolated at work since this incident and anticipate I am on the verge of being fired. What do I do in this situation??",
    "title": "Company won't hire any minorities",
    "subreddit": "jobs",
    "timestamp": 1696993994,
    "score": 396,
    "keyword": "african ceo"
  },
  {
    "text": "How do ask for a raise at my 1 year review after I took over essentially all responsibilities at a startup? I'm (31f) coming up on 1 year at my new job and could use some advice for my annual review, which I plan on asking for a raise based on my unexpected additional responsibilities.\n\nFor some background, the startup I work for is a remote US-based \"child\" company that middle-mans the sales, project management, and customer service of the North America accounts for our South African based \"parent\" company. The parent company is a global supplier of manufacturing equipment, where my company is the direct agent for their North America business that works on commission. \n\nWe are currently a team of 3 people - CEO, sales engineer, and traveling maintenance. The company started only a few months before I joined where I was originally hired as the sales engineer, but upon starting my role I quickly and unexpectedly also took over all the following: project management, data entry, customer service, parts orders, US customs importing/exporting, marketing (coordination with 3rd party), accounting, administration, literally you name it and I do it. \n\nThe intent was to grow our team over time to fulfill these other job duties, but I've yet to see any traction on that. I was hired early enough to help set up this company in ways such as build our database, create shared folders, set up accounts like DHL/UPS, etc. I never signed up to take over the company. As you can imagine, over time this became beyond overwhelming and I'm spread super thin. \n\nI report to the CEO, who owns another business that is very successful, which actually invests in and funds my company. He also plays the role of \"stay at home dad of 2 toddlers\" and just recently announced the twins are on the way. Of course, his hands are full so there's been a lack of support and guidance on his end.\n\nI'm a firm believer in and stick to a work life balance of at least 45 hours per week (I work through every lunch) with the regular log on/off an extra 30-60 mins early/late as necessary. I even work on bank holidays that we get off so I can keep on top of things, and I've also worked a couple of Saturdays after a week long travel for work just to catch up.\n\nWith my one-year review next week, I want to ask for a raise but having a hard time wrapping my head around it. The problem is we haven't broke even yet because I simply can't make sales my primary focus. At least my boss has acknowledged this many times and stated \"you do everything\" and isn't upset about it because I'm keeping this boat afloat. But until this past month, he's now pushed hard on shifting my focus to sales because \"we need money\". But there's no one else to backfill, and I want a raise before he does eventually hire someone who is just pulling money from the pot. \n\nDo I need relief from all this? Yes. Do I want to focus on sales? Yes. But I'm conflicted because then how do I answer the phone to take care of our existing customers, and project manage the on-going projects, or complete paperwork for our shipment that just arrived in customs, and literally everything that sponatneously happens on a daily basis that requires immediate attention.\n\nThis is becoming somewhat discouraging and unmotivating. I'm usually an upbeat, driven employee, but now I'm burnt out to the core and have a hard time waking up in the morning. I do love my job, I'm learning so much and killing it. I actually also love the parent company too. \n\nAnd just for the cherry on top in case you couldn't tell, I am diagnosed ADHD (have been for 15 years), so my brain is everywhere and I need guidance y'all - TIA!",
    "title": "How do ask for a raise at my 1 year review after I took over essentially all responsibilities at a startup?",
    "subreddit": "careerguidance",
    "timestamp": 1699558303,
    "score": 0,
    "keyword": "african ceo"
  }
]