[
  {
    "text": "Meet 'Black Girl Magic,' The 19 African-American Women Elected As Judges In Texas",
    "title": "Meet 'Black Girl Magic,' The 19 African-American Women Elected As Judges In Texas",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1556649117,
    "score": 1,
    "keyword": "african judge"
  },
  {
    "text": "Are these bans on abortion a precursor to something more? Voter Suppression. I'm certain that we have all seen that in the bill that was passed in Alabama that miscarriages are criminalized as well as abortions. The bill doesn't go into effect immediately, and judges would individually dictate what is or what isn't criminal about each case of a miscarriage if Woman in question was brought to court.\n\nThis concerns me. I'm a bi-racial man(28) of African decent. While I am not completely versed in women's rights issues I do pay attention to those of racial discrimination and those of \"criminals\". I'm certain that everyone in the US is aware of the civil rights movement so I won't go into that. I'm concerned because if women can be made felons for the tragedy of having a miscarriage then those women would effectively lose the right to vote. We saw in 2013 that the Supreme court did away with key components to the Voting Rights Act that protected citizens from racial discrimination.\n\nIn many states where felons are able to vote only after completing their parole/probation, community service, paying fines. Failure to pay these fines can add interest to the original fine. Felons already have a difficult time attaining employment, and maintaining that employment is part of their parole. That interest can increase by over 100%, making those in parole unable to ever finish their sentence and attain the right to vote again.\n\nI can't say for certain, but I just have a gut feeling that ontop of the religious right trying to implent their beliefs as law. That this just the beginning of a round about way to control who and who cannot vote in our country.",
    "title": "Are these bans on abortion a precursor to something more? Voter Suppression.",
    "subreddit": "Feminism",
    "timestamp": 1558296100,
    "score": 4,
    "keyword": "african judge"
  }
]