[
  {
    "text": "Are dreads, braids, and cornrows appropriate for a corporate job As an African-American, I find it very discriminatory that hiring recruiters and supervisors may judge me just because I want to style my hair, a different way. We have people who don’t even keep their hair a certain length getting jobs yet if I decide to get dreads as a black person, my chances of getting hired or decreased. I had a teacher a long time ago in high school, who was very old, tell me that my hair wasn’t appropriate for the job I wanted, which was accounting at the time. I’m wondering what other people think about this because this is a topic that’s been on my mind for a few years now as I’m about to graduate. What does everyone think I would like to know as many opinions as possible. Especially if you’re a recruiter or supervisor.",
    "title": "Are dreads, braids, and cornrows appropriate for a corporate job",
    "subreddit": "jobs",
    "timestamp": 1682666793,
    "score": 900,
    "keyword": "african judge"
  },
  {
    "text": "Do you think the kill the boer song should be forbidden by the South African Judges? Why or why not?",
    "title": "Do you think the kill the boer song should be forbidden by the South African Judges? Why or why not?",
    "subreddit": "AskReddit",
    "timestamp": 1690839896,
    "score": 2,
    "keyword": "african judge"
  },
  {
    "text": "Black Americans Kidnapped in Matamoros There were four african americans kidnapped in the state of Matamoros Mexico. Two have perished. One person is seriously injured. The news did not have any updated information on the state of each of the victims. One was a mother of six. The reports conflict on if they were there for medical or cosmetic procedure. Before yall judge and say it was for BBL there are alot of cosmetic procedures especially those with debilitating ones. Also, alot of americans travel to border states for low cost medical and dental care.\n\nI found this to be unsettling. I had traveled once to Juarez. I would never go again. The people are not freindly and will not make eye contact. I felt like a ghost. I wanted to go outside and scream, but you can not because it is too dangerous. Idk, I just wanted to say yall stay out of Mexico. Even Cancun has a level 3 state department advisory. Thoughts?\n\nUpdate to Story: Five people were allegedly involved in the hit and were turned over to police. The cartel had issued an offical apology and asked for society to remain calm.\n\nThought:\nI have never seen a police department issue an offical apology. Like Wtf yall.",
    "title": "Black Americans Kidnapped in Matamoros",
    "subreddit": "blackladies",
    "timestamp": 1678214886,
    "score": 298,
    "keyword": "african judge"
  }
]