[
  {
    "text": "What are your thoughts on why there aren’t many African American teachers. Black teachers only make up 7 % of public school educators across the nation. Black males is even lower. Each year more and more black teachers are leaving the profession due to reasons ranging from feeling “pigeonholed” into only serving black students, being pressured into being the unofficial disciplinarian of students of color, to feeling ostracized by their administration and colleagues. These are ALL things I faced as an African American teacher my first couple years of teaching and had I remained at the school where I was, I would have most likely left the profession as well, but like most teachers, the students kept me motivated to keep going. My last year there our school had a “ Black History Month” Assembly which ONLY focused on the achievement African-Americans have made in sports and music. When I spoke to my principal about it she told me she didn’t feel offended and that neither should I. SHE as a white woman was not offended so ME as a black man shouldn’t. Now, at my current school things are much better as I feel valued and appreciated as a staff member and as an individual, but we ALL have a long way to go.",
    "title": "What are your thoughts on why there aren’t many African American teachers.",
    "subreddit": "Teachers",
    "timestamp": 1553136932,
    "score": 60,
    "keyword": "african principal"
  },
  {
    "text": "Well that's an ...interesting choice for a victory speech So I'm a school resource officer (cop in a school, only deal with actual criminal stuff, also kind of a backup nurse) at a let's say \"disadvantaged\" school in a large metropolitan area. \n\nSo we recently had the end of year meeting which for me usually just means I clean out my office, hang out with some of the teachers, and then go home early. This school the principal had food at the traditional end of year meeting so I sat in on part of it and it was shall we say unusual. \n\nShe opened by saying \"we made it\" and then quickly transitioned to \"when it got back to me that people were speaking about me behind my back it felt like getting raped\" (let's ignore the fact that she emailed my captain to complain about me going easy on the kids instead of talking to me or my lieutenant and focus on the \"y'all raped me\" comment. All I'll say is it's a good thing I had my sunglasses on because there was some eyerolling) \n\nThen it translated into complaining about Christmas because it was the only time people were nice to each other\n\nThen she told a lovely story about how she almost didn't hire a teacher because she was white (principal is African american, the students are almost all African american so I get what she was getting at but holy shit) but was glad because that teacher had done well\n\nThen she went on an anti union rant because it made it hard to fire low performers.\n\nThen she told us to take care of ourselves but not use sick days\n\nThen she told us not to eat meat\n\nThen I stepped out to take a call from my lieutenant. \n\nBut yeah a far cry from the traditional \"good job, here's what worked, here's what we're doing next year\"",
    "title": "Well that's an ...interesting choice for a victory speech",
    "subreddit": "Teachers",
    "timestamp": 1559840306,
    "score": 51,
    "keyword": "african principal"
  },
  {
    "text": "How can two schools be so different... nevermind I know.... Rant ahead warning....\n\nSo I teach at different schools within our county. I teach 4th-12th grade, one school/grade per day. So yesterday was one of our middle school's 8th grade, tomorrow will be a different elementary school's 5th grade and so on. There are 3 school systems in our tiny county. We can't have a consolidated school because football is king, but that's another rant. Most of our graduating classes have 50-60 kids. Its stupid. \n\nSo School A as we'll call it is in what's known as the redneck, backwoods part of my county. School B is in the county seat, highest population, least poverty, etc. School C is divided between low economic conditions and your average medium family income households. Also, this school is known for its ratio of African American to White students being almost 50/50 whereas our other schools are predominately white. \n\nSo here we go. I absolutely HATE going to School B. HATE. I leave almost in tears some days because the students are extremely disrespectful. I'm lucky if I get half my lesson completed because I spend the majority of my time telling some kids to shut their mouths and listen while trying to catch other's up because they are so far behind. I'm only speaking about School B's middle school here, as their elementary and high school are much better. There are 8th graders here that don't know their mom's name, or their address, or their birthday. What's even worse, the teachers stay in their classrooms while I come in to do my lesson. They say this is a normal day. \n\nSchool A. School A gets ridiculed throughout our county because they are the redneck country hillbilly folk. Let me tell you what, those are the BEST behaved students I've ever dealt with. Not only are they respectful, they are brilliant. They can interact with you as a teacher. They ask meaningful questions. You can joke with them during a lesson and immediately pull them right back in to listening and paying attention. We do so much fun stuff with this school, they make my job worth it. \n\nSchool C. Poor School C gets beat up on by the rest of the county with a lot of racism. School B hates School C because they always beat them in sports. What School B isn't realizing is they are also whipping their butts with test scores. People ask me if I feel safe going to teach at School C. Yeah? While these kids aren't the angels that School A is, they are most definitely a pleasure to work with. I have to call them out for being chatty a couple times, never anything major, and usually they are chatting about something we're learning.\n\nI love my county. But I hate my county. Football is king, kids will be held back grade levels to play football more. The football families could care less about education or teaching right and wrong. However, I often find it humorous when I look at my program where all my after school/most active kids outside the classroom are redneck backwoods hillbillys and our African American kids from bad situations. They get along with each other just fine until School B kids show up. I love using my program to break social norms, especially here in the deep south. \n\nYou may be wondering how School B can be allowed to act that way? Their administration is terrible. The principal there lets them get away with anything. I once had a kid stand up and spit in the face of the kid sitting next to him. I sent him to the principal, she sent him right back and his only punishment was \"don't do that again.\"\n\nI will now step off my soapbox of cluttered thoughts.",
    "title": "How can two schools be so different... nevermind I know....",
    "subreddit": "Teachers",
    "timestamp": 1568737780,
    "score": 12,
    "keyword": "african principal"
  }
]