[
  {
    "text": "CVS Interview, What just happened? About a week ago, my wife got a phone call from a very enthusiastic manager at CVS to interview as a pharmacist. She told her all these great goodies about the job and how she loves to work with new Graduates and her excitement over my wife's experiences. She said she is especially happy wifey has an RN degree too. She stated she is excited to see her and the interview will be more or less to determine if my wife is willing to hit the ground rolling aka (more of a formality).\n\n&nbsp;\n\nA few days later the district manager calls my wife apologizing about how enthusiastic the manager was stating that she skipped the normal interview process by calling her first, that he has to call and do a pre-interview and then assign her to a manager/region but she jumped the gun; so he has a lengthy interview with her and he is happy to go ahead with the onsite, saying in his career he has had only 10 candidates out of hundreds that had her dual degree. \n\n&nbsp;\n\nToday she went in for the interview, the manager sees my wife and my wife says her whole body language changed, warmness and excitement went out the window, just cold stoic conversations. The manager said she wanted someone with nursing experience, not someone who just went straight from nursing to college (?), the wife said she has over 4 years of working in various departments (per her resume). \nThe interviewer then said she is looking for specific skills (no elaboration), the wife said she has the basics related to the position from her rotations, and that the interviewer had been previously expressed preference of her being a new grad.\n\n&nbsp;\n\nThe interviewer then went on to give her potential negatives on how involving the position is (things she knows) suggesting it might not be something she might want. The wife replied that she's more than up for it. \n\nThe interview ended with \"we will see if we want you for another onsite interview\". \n\n&nbsp;\n\nWhat hurt me the most is when my wife called me really depressed and almost in tears asking me if this went sideways because she was black? Her name sounds Japanese (we are African) and most time people are surprised that the name and voice do not match perceived appearance. \n\n&nbsp;\n\nI refuse to believe that this is a reason, I just need help wrapping my head around all this. How did things go so sideways? I always tell my wife to add these people on LinkedIn so that there are no surprises. This is just gut wrenching sad. \n\n&nbsp;\n\n**TLDR:** Warm exciting phone interview goes cold on meeting my wife in person.",
    "title": "CVS Interview, What just happened?",
    "subreddit": "jobs",
    "timestamp": 1491334385,
    "score": 8,
    "keyword": "african manager"
  },
  {
    "text": "Any words of wisdom? So I am working at a sporting goods store that has a sandwich shop inside and have been working this job for two years. My supervisor has only been in my department for one year and she has tried to put me down if I don't have enough time to finish stuff and it is left to be finished the next day. She has done some other stuff like going off for 45 minutes to an hour without telling us where she is going and not doing her job 's responsibilities. She has also denied one of my coworkers medical- necessarily breaks that she has a doctor's note for. The thing is that she has done the running off and not doing her job when she was in her previous department. \n\nNow I've notice when my manager does the sechduling, he only schedules me one day a week to work with her, and it has been usually Saturdays, if I work that is. I also work in other departments when they usually need the extra man power.  I have also applied for other positions within the store and one is under the same manager but different department. \n\nNow I have been told that our manager and the store manager is aware of the stuff that she is doing and are planning on having a meeting with her, but I know that she has lied to get herself out of trouble before. And she has also told another coworker that if she is fired she will pull the race card (she's african-american). So what I am asking is that should I report this to my company's hotline  or just wait it out?\n\nEDIT: I have should have added I love my job and the people I work with it is just that I shouldn't have to go in to work worrying that if I slip up just once, I'm going to get reprimanded for a simple mistake, that she has made too.",
    "title": "Any words of wisdom?",
    "subreddit": "jobs",
    "timestamp": 1494725546,
    "score": 0,
    "keyword": "african manager"
  },
  {
    "text": "[Southern USA] [Kindergarten] - Please help with class management! Throwaway account, because I'm paranoid of someone in my school finding me. Also posted in /r/ECEProfessionals \n\nI am a second-year teacher at a rural, 90% African American school in the southern United States. I'm having issues with classroom management. Last year, my assistant was very strong- she basically ran my whole classroom. Whenever the kids were being too loud, she'd sternly redirect them to pay attention. Sometimes she even yelled, but it worked. I am not a confrontational person and her methods worked, so I ran with it. She was African American, and told me that her ways were effective because the kids saw her as a mom/grandma figure and respected her. I believe this to be true. However, she has retired and I have a new assistant- an older white lady who is not as strong of a personality.\n\nIn this community, the norm is for children to be scolded/punished for doing wrong things. The ways that some of the other teachers talk to their students align to this method of child-rearing, because culturally they are similar to their students (again, the kids see the teacher as a mom/grandma). I should mention here that I am white. I have been told by the other kinder teacher (and several other friends within the school) that if I spoke to the kids the way the other teachers might, I would be in trouble because \"Black people don't want to see their kids yelled at by a white teacher\". That is a direct quote, please don't call me a racist or tell me that race doesn't matter.\n\nThe issue is that I cannot get the kids to stay quiet or pay attention, even if I raise my voice (which I hate to do). I also feel like they are goofing off when we are supposed to be working. My kids are turning in absolute crap- I know they are capable of better work. When I try to get them to be quiet, they still talk or play at their tables and do half-assed work. I would love to be able to allow them to whisper at their tables about what we are doing (and generally work together in teams), but it seems like the majority of them are always off-task. I try to plan active activities/group work/movement into our day. I also allow them to talk during breakfast and snack.\n\nWe have a school-wide management system using a 'green, yellow, red' behavior chart. If a kid misbehaves, I'll warn them. If they repeat, I'll change their color. I've thought about starting some kind of token-based economy, but at this point I'm not sure they'd be quiet or attentive long enough for me to tell them about it.\nI've tried all the positive behavior things we learn in college, like highlighting kids that are doing what is expected, etc. We made our class rules together. All the positive/reinforcing/'let's talk about your choices' stuff doesn't work. Changing their colors doesn't work. Having them practice walking in the hallway quietly (because we can't seem to do that correctly, either) doesn't work. None of it seems to work. I'm frustrated and upset and not sure what else to do. Any advice would be greatly appreciated.",
    "title": "[Southern USA] [Kindergarten] - Please help with class management!",
    "subreddit": "Teachers",
    "timestamp": 1504303176,
    "score": 11,
    "keyword": "african manager"
  },
  {
    "text": "Tried making a joke at work, did I come across racist? \nI just started my job, I love it. It's in a field I've wanted to work in for a long time. The hours are flexible and the pay isn't bad. The people so far are nice enough and I get along really well with my manager. \n\nThe other day I saw the ceo of the company at a restaurant and I excitedly posted on a group chat that he was behind me at the restaurant. Someone asked where I was. I thought it'd be funny if I said the most unlikely restaurant he'd be at, and I named a cheap local fried chicken chain. I didn't get much response after that. \n\nThe next day I felt like my manager was kind of avoiding me and it dawned on me this weekend that perhaps I came across as racist. Most of my coworkers are African American, and I'm not [I'm Asian]. \n\nWas it racist of me to post that? Or am I over analyzing the situation? I would hate for things to be awkward at work given how great things are going. I know the rule is for jokes at work is, if you have to ask yourself if it's inappropriate, then it probably is. I really had no racist intent but I feel bad. What do you think? And what should I do about it?\n\nTL;DR made a joke on group chat, worried I came off racist, wondering what to do",
    "title": "Tried making a joke at work, did I come across racist?",
    "subreddit": "careerguidance",
    "timestamp": 1505103705,
    "score": 1,
    "keyword": "african manager"
  },
  {
    "text": "How do I know if I should quit my job as a junior developer? I'm a junior dev at a startup in New York. When I joined the company I didn't have any experience or a degree but even with that in mind, I'd still say my knowledge of Ruby/RoR at least was *approaching* that of a mid-level developer. The only company that would give me a job at the time primarily use Golang, which I sorta knew but not really. I told them this and they said it'd be cool and that I could work on one or two minor Ruby projects and do some customer support (everyone at the company was expected to do this back then) before eventually progressing to a mid-level role and working on Go code.\n\nSo it's been six months now and I feel that while my understanding of Go and the technologies my company specializes in have improved, they haven't improved anywhere near fast enough. There wasn't really much of a dev team when I joined (it was just me, another junior developer, a contractor and our CEO alongside less technical members of senior management). The CEO left the country a few months ago and now works from home but even when he was around, he was often pretty much doing his own thing and we were left to our own devices much of the time. Even now that they've hired more experienced staff, I still feel like I'm not getting the level of support I need. I don't expect anyone to teach me Go and I try not ask questions about it unless it becomes a blocker. But often when I raise a question about the way in which our core product functions in the company's Slack channel, I'm either ignored, forced to make do with the fact that nobody in my time zone understands the code well enough to know the answer, given answers that confuse more than help or, on rare occasions, belittled for not knowing the answer already even though everyone knows how much the existing documentation sucks. As a result, I often feel overwhelmed by the support side of my role and even on days where there are barely any user queries, I'm plagued by issues with the build environment that nobody can ever help me with or assigned confusing tasks that seemingly no one understands. I don't even really get to code all that much and often just feel more like an overpaid application support engineer than a developer.\n\nI don't know if this is all just growing pains and if I should just keep at it or if this really is a bad environment for me. Even though I feel really lonely most of the time (most of the other developers work from home in different states and I actually don't have that much in common with any of them - I'm the only African American and one of only three women in the company, I'm the only developer who doesn't either have a CS degree or 5 years+ of experience, etc.), I do actually really like the people I work with. At the same time, I worry that I might be being taken advantage of, which just tends to happen to me a lot in general. I've considered leaving but I'm also conscious of the fact that almost none of the code I've worked on in the last six months has been made public so, to a potential employer, I'd look as though I were in the same position as I was back when I was looking for a job six months ago.\n\nAny thoughts?",
    "title": "How do I know if I should quit my job as a junior developer?",
    "subreddit": "cscareerquestions",
    "timestamp": 1492625457,
    "score": 2,
    "keyword": "african manager"
  },
  {
    "text": "Angry Letter I Wrote 2 Years Ago I can’t help but to think the only real reason I can’t seem to get any type of  production artist/ graphic design/ or screen printing position is because I’m a young black female. I usually hate throwing the race card in but I don’t know where else to turn. Never mind the fact that I have the degree required for these companies in the first place. It’s strange how every time I contact these companies when I see that there is a new space open they’re either “too busy” to take a minute to talk to me or the position has been filled. I polish my resume and cover letter well and because my name isn’t ethnic sounding I usually get asked to come in for an interview (Why is that still a thing in 2015?) Professionally dressed and well spoken. Only to keep getting turned down because I’m not the blonde Brittany stereotype that was assumed on paper.\n \nI can’t even seem to get a position at art retail stores. I don’t seem to fit the mostly white male hipster vibe most of them seem to have. When asked how I could contribute to the sales I explained how I do my own illustration and how I can give others that come into the store my own input on supplies and materials. Even left business cards at the end of the interview but I either get told that I’m too over qualified or too under qualified and don’t get the position. Most of the yelp reviews of one art supply store in particular was saying how most the sales associates don’t even know their products at all. \n\nThe summer between my junior and senior year of college I had applied to an AC Moore where the hiring manger was an alumni of the school I was going to and saw how qualified I was but did I get hired nope! I went back a few weeks later to pick up supplies for a watercolor painting I wanted to do and I happened to pick up a sheet of Arches cold press watercolor paper that didn’t have a code bar. The red haired girl ringing me up got confused and to this day that statement still rings in my head as she asked her co-workers “How much is this poster board?” I was done literally just done right then and there. I didn’t get hired but this girl who does not even know the difference between watercolor paper and poster board got hired probably solely on her looks alone.\n\nSame thing goes for all those companies that turned me down. One screen printing place had a manager that told me that he couldn’t hire me because he couldn’t afford to pay me. (But he sure as hell paid for a damn chiropractor the same day he let me go and spent half the day shooting hoops smh). Not all young black people like myself are the way Fox News likes to portray us; most of us have goals and aspirations outside of twerking or being labeled “thugs”\n\nI’m not “right” for those jobs but I sure as hell was qualified to waste seven months of my life working in a burger joint. Not once I did have the energy to even do my illustration pick up a pencil or paintbrush because of that dead end low paying barely making it job. Didn’t learn any new pen and ink styles I wanted to further develop but I was pretty damn good at salting fries all day. I was tired all the time and at 22 to 23 years old I should have all the energy in the world but I didn’t. In fact when my manger let me go he had just hired his brother as a line cook despite him not shaving his Santa beard and working the grill (nasty) must be nice.\n\nSo now I’m back to square one once more trying to hopefully get employed again soon. But right now my main focus is trying to get new artwork done since I spent the past year just kind of drifting because of financial worries. I have lost sight of this is something that I love and it’s not a job it’s me building a career. I still dream of being a children’s book illustrator and I’m not ready to throw in the towel just yet. In fact I want to strive to be the very first African American woman to win the Caldecott Medal. That the type of quality illustration I want to be making and if I ever get to that level they’ll be the ones sorry for overlooking me.",
    "title": "Angry Letter I Wrote 2 Years Ago",
    "subreddit": "blackladies",
    "timestamp": 1498281014,
    "score": 14,
    "keyword": "african manager"
  },
  {
    "text": "TIL that current Dodgers manager Dave Roberts is of Asian descent, being born in Okinawa, Japan to a Japanese mother (and an African American father)",
    "title": "TIL that current Dodgers manager Dave Roberts is of Asian descent, being born in Okinawa, Japan to a Japanese mother (and an African American father)",
    "subreddit": "asianamerican",
    "timestamp": 1508996295,
    "score": 78,
    "keyword": "african manager"
  }
]