[
  {
    "text": "Experienced a ton of sexism and racism in South Korea and need to vent You'd think this was a more appropriate post for the country's sub but, having read so many ~~white men~~ people there apologize for racism, I thought the sexism aspect would at least be appropriate here. **TL:DR at the bottom.**\n\nIt's probably my fault for not reading up on the 'bad' aspects of Korean culture, but I don't know many people who look for those things before visiting a country that has a modern-looking society. Being half Asian the racism and sexism I receive from my mother's homeland is minimal and tolerable. At 5'8\" I stand out. My plain features, brown skin and lankiness draw judgement because 'mixies' are meant to be pale and have more Anglo features. My bad. \n\nAnyway, my stay in Hong Kong and Taiwan was dope. So much to see and so much good food to eat! Shopping was cheaper than back home. Nice. The last leg was South Korea, the source of my mother's beloved K-Dramas and my opportunity to see snow for the first time. What I actually experienced was the opposite of dope. \n\nIt started as I got off of the plane. By far I was the tallest woman there. I stood near the exit and three people approached from behind whispering. I turn around to face my friend and the group glances at me with an audible sigh 'oh, negro'. It was a shock to hear someone refer disdainfully, out loud, to a person as negro. I wondered if they were seeing people who had dark skin or were African (American) around. When there was no person with brown skin other than myself close by I jumped to the conclusion that they might be talking about me and judged based on my features - big lips, booty and wide-ish nose. I dismissed it as me imagining things. \n\nThe next day I was in Meyongdong, a big tourist area, near my hotel. We rushed about and it was packed with stylish people and all the cheap makeup and street food we wanted. As I got bored I tuned in to the crowd around me. So, FYI, the locals LOVE to stare and make comments about foreigners in Hangul, and if they really want to speak their mind a descriptor or two in English as you walk by. By the time I made it back to the hotel I'd been called Japanese (called, not asked) and Chinese and Americano (anyone who can speak English) and... ni**er, once. I saw an African family on a train later with such miserable looks on their faces that I wondered if they were getting the same treatment.  \n\nNow sexism and internalized-mysogyny. Going in I knew Korea has impossibly high beauty standards and I was not exempt from judgement; not that I could hide given I was taller than most people as well as having brown skin. I believe women did not like that I was tall and thin as that is a huge ideal and the vast majority are smaller than 5'8\". Two other girlfriends who were with me have typical Asian height and features and were mostly ignored. Men especially didn't like that I was tall. Contrary to reports, Korean men did not appear any taller to me than other Asian men. So while women laughed as I walked by and grabbed their boyfriends to drag them further away, men got aggressive, like intentional shoves in crowds and 'tch-ing' as they would walk past. Old men turned around after seeing me as I approached. If I stood next to them in a crowd they'd move elsewhere. A kid walked by and called me a giant monster as his parents smirked. It was bewildering how frequent and constant this behavior was. Almost everyone I walked past was laughing or giving dirty looks. Even people some distance away. Christ. By the end of my 2nd day I tired of what was happening and concluded this was top of the range sexism and racism. [I Googled this shit and found that I wasn't alone and the issue is swept under the rug.](http://ireport.cnn.com/docs/DOC-1221602) [Open discrimination is not legislated against and foreigners complaints are dismissed](http://www.koreaobserver.com/nearly-all-foreigners-victim-of-discrimination-in-seoul-29001/). Great. Also found out that speaking English when not white invites scorn for being a snob and 'better' than Koreans, which they mocked me for too. Another layer of bullshit to deal with.\n\nOn the 4th day I had enough and stayed in my hotel. It was great tbh, but my travel companions who had typical Asian appearances thought I was crazy. I was fine with watching action movies all day instead of looking at the ground to try in an attempt to hide myself.\n\nBy the 7th day I was willing to face the music and go on the DMZ tour, which was amazing, then I had dinner and it was back to the bullshit. I decided to go out for the remaining couple of days anyway as I had recharged my spirit staying in the hotel and wanted to see what I could, which was a bad decision. I only remembered Gangnam was the capital of superficiality once I saw all the plastic surgery ads in the train station. Walking around there the laughs were louder and the men yelling 'You're a big girl!' was just enough evidence for my friends to start believing me. \n\nBy the end I was emotionally worn down. I was happy my flight was early morning but the abuse from other Korean travelers continued until I got off the plane in Singapore. The biggest irony was sitting in the departure lounge as a Korean woman walked past with a bag that said 'RACISM' with a cross through it. If I weren't so demoralized I would've laughed. \n\n**TL:DR - Beware of rampant, open, sexism and racism in Korea, and by all means do not be brown, tall and female. People defend Korea's nationalist monoculture and say 'you just have to deal with it' but you'd think there'd at least be some tiny courtesy to keep the racist and sexist comments quieter. Even sadder is that it's being taught to children. I don't hate Korea, it's a beautiful country, but I wish their culture did not foster so much ignorance. For *anyone* visiting there you'll need something tougher than thick skin.**",
    "title": "Experienced a ton of sexism and racism in South Korea and need to vent",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1484496487,
    "score": 4,
    "keyword": "african judge"
  },
  {
    "text": "Why I Teach History (7th grade) I’m pretty routinely asked why I bother teaching.  Specifically, people almost always ask why I chose to teach Middle School History.  After all, it is in the past and the kids don’t really care any way.  To try and get to the bottom of that question, I gave an alternative prompt on our most recent large test.  It was inspired but stories from a long-time family friend’s favorite teacher.  The kids, if they wanted to, could write about “What they learned in 7th Grade World History.”  This isn’t supposed to be a humblebrag or back-patting session.  I was just so amazed by what some of my students wrote that I want to share it with all of you.  This is why teachers teach.\n\n\n\n**What I learned in 7th Grade World History – By an anonymous student who has been quiet all year.**\n\n\n   I learned a lot more in 7th grade history than just numbers and dates.  I learned how to think deeper about things, I learned more about why you shouldn’t judge someone by their race, and I learned that history happens all the time.\n\n\n   In 7th grade history, I learned to think deeper.  In the past, I never really thought about the meaning of some of the holidays or why history matters, but now I know that they actually have an important meaning.  I’ve also been way more interested in history.  I want to know about everything, especially when my parents are talking about stuff.\n\n\n   I learned a lot more about why people shouldn’t judge others by the color of their skin.  I learned that it is about more than because its racist and wrong, its also because were all equal.  No one is superior.  Some may think the Europeans are better and smarter than the Meso-Americans but that’s not true because the Meso-Americans also have amazing buildings and creations, such as temples and floating gardens.\n\n\n   History happens all the time.  I used to think that history was just people that changed the world but history also happens in my own life. History is being made everyday, even when we don’t know that it is.  There are also different types of history, such as personal history, world history, and even Internet history.  We probably see a piece of history everyday and we don’t even know it.\n\n\n   In 7th grade history, I’ve learned that you should think deeper, don’t judge people by their looks, and history is being made everyday.  History is importance because it teaches us what to do and what not do do.  It shows up past mistakes so we know to not repeat them.  Therefore, I have a lot more in 7th grade history than just dates\n\n\n\n**What I learned in 7th Grade World History – By an anonymous student who now comes during break to talk about history.**\n\n7th grade World History was one of the most importance experiences of my life.  This class taught me many things that I will remember forever.  It taught me how working hard has it’s benefits, how you should always think about things more carefully, and most importantly, it taught me one of the most important concepts that everyone should learn.\n\nIn this class, the teacher would always push us to do better and always made sure we were doing our best work.  At the beginning of the school year, I found this annoying because I didn’t think I would benefit from it.  I just thought the teacher was too strict about the quality of work.  Now I realize the benefits of this.  It will help me throughout the rest of my life because most things in life, especially when you get a job, need you to do your best and work your hardest to be successful.\n\nThe teacher also taught me the importance of thinking carefully about things.  He taught me this by tricking our classes to see if we would notice he was lying.  Almost every time I fell for his tricks and this taught me to think more closely about things.  Thinking more closely about things will help my everyday life just like always working my hardest will.\n\nLastly, this class taught me about why we care about African civilizations.  This was an important lesson because it showed me how biased our opinions of West African cultures are because they are influenced by European ideas.  This concept will help me educate others on this topic because many do not realize this.  It is the most important thing that I have learned so far in my school career.  Many others need to learn this too.\n\nThis year in 7th grade was very important to me.  It taught me so many important lessons that I will remember forever.  It taught me the importance of thinking closely and working my hardest.  It also taught me about why our opinions on the African cultures are biased and the importance of learning and teaching their true story.  This class will help me in so many ways for years to come.\n\n\n\n\n\n**What I learned in 7th Grade World History – An Anonymous student that sent 10-20 emails to me over the last two quarters, trying to solve the question of “Why we care?” with no points involved.**\n\n\n\nLearning of the Meso-American and African societies is part of the seventh grade standards, but it is often not told the way it really happened.  The takeover and destruction of these civilizations probes the importance of history and the complexity of people and their actions in history.  The reasons the horrendous actions of the Europeans are still accepted are guilt and faulty reasoning, the lack of purely good and bad people, and bias/lack of enthusiasm in history today.  The repetition of these issues in other situations, even slightly, happens over and over in history and the modern day.\n\n\n\nWhen the Europeans arrived and encountered Meso American or African civilizations, they were quick to declare superiority.  Their first reaction to the confusion of the other people was to assume that they were stupid and had no culture.  When it became apparent that they could use these people to their own advantage, they decided that the best way to relieve the guilt was to make the non-Europeans inhuman.  This creates the illusion that killing and enslaving people was much less cruel than it should be, as they were not people at all.  This idea is used over and over again by thousands of people.  Essentially making the victims of evil actions into people who shouldn’t be seen as victims, thus the actions are no longer evil.  It is seen in history and it is seen now, and being aware of it gives one the ability to properly understand the actions of others.\n\n\n\nThat being said, most who cover up what they are doing do not think they need to cover it up.  Most people legitimately believe that what they are doing is for the greater good, including the Europeans when doing their pillaging.  King Leopold infamously believed that what he was doing benefited the Africans.  It goes to show that humans are never purposely trying to be bad.  Even if they are aware of their cruel actions, they believe that their reasons are good and that what they are doing is just.  There is no such thing as a purely good or purely evil person.\n\n\n\nThe true story of the enslavement and slaughter of the Meso-Americans and the West Africans is often quieted or ignored for the same reasons as displayed above: guilt, excuses, and the honest belief that what the Europeans did was okay.  Without seeing every side of this incredibly complex story, one would be just as ignorant as the Europeans.  It is important to try as hard as possible to become unbiased and open-minded.  This sentiment applies to everything in life.  Surrounding oneself with diverse opinions and views of the world is the fastest way to eliminate ignorance.  One can’t just listen to whoever’s voice is the loudest.\n\n\n\nThe reason why we care about the Meso-American and African civilizations is complex on its own, but it connects to outside issues and the entirety of human nature.  It teaches one how to be an intelligent, less biased member of our society and most significantly, how important history is to achieve this.",
    "title": "Why I Teach History (7th grade)",
    "subreddit": "Teachers",
    "timestamp": 1496599461,
    "score": 123,
    "keyword": "african judge"
  },
  {
    "text": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts https://sanfrancisco.cbslocal.com/2017/11/30/judge-suspensions-ok-albany-high-students-racist-posts/\n\nSAN FRANCISCO (AP) — An East Bay school district acted properly when it suspended five students who “liked” or commented on racist images on another student’s Instagram account that included nooses drawn around the necks of a black student and coach and comparisons of African-American women and students to gorillas, a judge has ruled.\n\nThe case raised thorny questions about how strictly schools can regulate student speech and whether “likes” on social media should be treated similarly to the original posts.\n\nU.S. District Judge James Donato said in his decision late Wednesday the five students contributed to disruption at Albany High School in the San Francisco Bay Area.\n\nThe judge rejected arguments that the Albany Unified School District violated the students’ free speech rights because the offensive posts were on a private account and made off campus.\n\nDonato said the accounts’ followers were mainly Albany High School students. The posts pictured students and school employees and created a risk of substantial disruption at the school, the judge said.\n\n“These cases establish that students have the right to be free of online posts that denigrate their race, ethnicity or physical appearance, or threaten violence,” he said. “They have an equivalent right to enjoy an education in a civil, secure, and safe school environment.”\n\nAn attorney for three of the students had no immediate comment. An attorney for the other two, Darryl Yorkey, said “liking” images does not necessarily express approval.\n\n“I think the judge took an opinion that many of us do in the older generations in assuming that a ‘like’ on its face is just that, ‘I like it, I approve of it,'” he said.\n\nHe said many of the students who were suspended over the images were Asian and were just trying to shock each other.\n\n“Taken out of that context, it definitely looks really bad,” he said. He did not immediately know whether his clients would appeal Donato’s ruling.\n\nA phone message left with the school district seeking comment on the ruling was not immediately returned.\n\nA male student identified in court documents only as “C.E.” created the account in November 2016 and posted on it over the next several months.\n\nOne post showed a screenshot of a female African American student that she had captioned, “I wanna go back to the old way.”\n\nC.E. juxtaposed an image on the student’s post of a white man beating a black slave hung by his hands, according to Donato’s ruling.\n\nSchool officials learned about the account in March. They called in mental health counselors to help calm students and contacted police over concerns references to lynching, nooses and the Ku Klux Klan in the posts could constitute threats of violence, Donato said.\n\nC.E. was suspended and later expelled. Donato upheld his discipline as well on Wednesday.\n\nBut the judge said the district went too far when it disciplined two other students. One followed the account but appeared to have done nothing else and the other commented that the account was “racism solely directed at black people” with an emoji of a laughing face, the judge said.\n\nThe judge overturned their suspensions.",
    "title": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts",
    "subreddit": "blackladies",
    "timestamp": 1512146276,
    "score": 27,
    "keyword": "african judge"
  }
]