[
  {
    "text": "Tried making a joke at work, did I come across racist? \nI just started my job, I love it. It's in a field I've wanted to work in for a long time. The hours are flexible and the pay isn't bad. The people so far are nice enough and I get along really well with my manager. \n\nThe other day I saw the ceo of the company at a restaurant and I excitedly posted on a group chat that he was behind me at the restaurant. Someone asked where I was. I thought it'd be funny if I said the most unlikely restaurant he'd be at, and I named a cheap local fried chicken chain. I didn't get much response after that. \n\nThe next day I felt like my manager was kind of avoiding me and it dawned on me this weekend that perhaps I came across as racist. Most of my coworkers are African American, and I'm not [I'm Asian]. \n\nWas it racist of me to post that? Or am I over analyzing the situation? I would hate for things to be awkward at work given how great things are going. I know the rule is for jokes at work is, if you have to ask yourself if it's inappropriate, then it probably is. I really had no racist intent but I feel bad. What do you think? And what should I do about it?\n\nTL;DR made a joke on group chat, worried I came off racist, wondering what to do",
    "title": "Tried making a joke at work, did I come across racist?",
    "subreddit": "careerguidance",
    "timestamp": 1505103705,
    "score": 1,
    "keyword": "african ceo"
  },
  {
    "text": "How do I know if I should quit my job as a junior developer? I'm a junior dev at a startup in New York. When I joined the company I didn't have any experience or a degree but even with that in mind, I'd still say my knowledge of Ruby/RoR at least was *approaching* that of a mid-level developer. The only company that would give me a job at the time primarily use Golang, which I sorta knew but not really. I told them this and they said it'd be cool and that I could work on one or two minor Ruby projects and do some customer support (everyone at the company was expected to do this back then) before eventually progressing to a mid-level role and working on Go code.\n\nSo it's been six months now and I feel that while my understanding of Go and the technologies my company specializes in have improved, they haven't improved anywhere near fast enough. There wasn't really much of a dev team when I joined (it was just me, another junior developer, a contractor and our CEO alongside less technical members of senior management). The CEO left the country a few months ago and now works from home but even when he was around, he was often pretty much doing his own thing and we were left to our own devices much of the time. Even now that they've hired more experienced staff, I still feel like I'm not getting the level of support I need. I don't expect anyone to teach me Go and I try not ask questions about it unless it becomes a blocker. But often when I raise a question about the way in which our core product functions in the company's Slack channel, I'm either ignored, forced to make do with the fact that nobody in my time zone understands the code well enough to know the answer, given answers that confuse more than help or, on rare occasions, belittled for not knowing the answer already even though everyone knows how much the existing documentation sucks. As a result, I often feel overwhelmed by the support side of my role and even on days where there are barely any user queries, I'm plagued by issues with the build environment that nobody can ever help me with or assigned confusing tasks that seemingly no one understands. I don't even really get to code all that much and often just feel more like an overpaid application support engineer than a developer.\n\nI don't know if this is all just growing pains and if I should just keep at it or if this really is a bad environment for me. Even though I feel really lonely most of the time (most of the other developers work from home in different states and I actually don't have that much in common with any of them - I'm the only African American and one of only three women in the company, I'm the only developer who doesn't either have a CS degree or 5 years+ of experience, etc.), I do actually really like the people I work with. At the same time, I worry that I might be being taken advantage of, which just tends to happen to me a lot in general. I've considered leaving but I'm also conscious of the fact that almost none of the code I've worked on in the last six months has been made public so, to a potential employer, I'd look as though I were in the same position as I was back when I was looking for a job six months ago.\n\nAny thoughts?",
    "title": "How do I know if I should quit my job as a junior developer?",
    "subreddit": "cscareerquestions",
    "timestamp": 1492625457,
    "score": 2,
    "keyword": "african ceo"
  },
  {
    "text": "There Are Only 23 Black Owned Banks Left in America > Black-Owned Banks Hit Their Peak a Century Ago \n\n> In late 19th and early 20th century, 57 black-owned charter banks entered the system\n\n> Black-owned banks arose and flourished in a period when African-Americans were kept out of other financial institutions, both overtly and through practices that effectively walled off their neighborhoods from other banks.\n\n> The sector hit a peak in the late 19th and early 20th century, a period when 57 black-owned banks and credit unions existed. \n\n> Six CEOs of black-owned banks locked themselves in a New Orleans conference room for more than a day in late 2016. Surrounded by papers, drawing boards and PowerPoints, the group strategized ways to reverse a trend 15 years in the making: the decline of their own banking sector.\n\n> The number of black-owned banks operating in the U.S. has been dropping steadily for the past 15 years and fell to 23 this year, the lowest level in recent history, according to the Federal Deposit Insurance Corp. That has left many African-American communities short of access to capital and traditional financial services, according to some banking experts.\n\n> “We have a crisis among black banks,” said Doyle Mitchell, CEO of Washington-based Industrial Bank. “We met…to save the industry. To save ourselves.”\n\n> The 2008 recession hit the black banking sector especially hard, and if the current rate of closures of about two a year, as well as the industry-wide reluctance or inability to start banks, continues, black-owned banks could disappear entirely within the next eight to 12 years.\n\n> The trend is worrisome to some analysts who argue fewer banks serving low-income, minority groups could expand “financial deserts”—communities with few or no banking institutions—and increase the likelihood that black and Hispanic communities could become susceptible to redlining, a discriminatory practice that excludes poorer minority areas from financial services.\n\n> “These banks are banks that serve relatively poor neighborhoods,” said Russell Kashian, an economics professor who studies black-owned banks. “There are neighborhoods that if…the black-owned bank isn’t there, nobody is there.”\n\n> Most black-owned banks typically have a few branches in one city, although one of the category’s largest players, New Orleans-based Liberty Bank, has a multistate presence. Such banks comprise just a sliver of the overall U.S. financial sector, with collective assets of $5.5 billion, versus $16.3 trillion in the industry overall.\n\n> As a result, some economists question the significance of the sector’s decline. “Size-wise they’ve been small,” said Nicholas Lash, a business professor at Loyola University Chicago who studies minority banking. “So their total impact on black communities can’t be very, very large.”\n\n> Yet those who live in communities that have been served by black-owned banks say the impact there, both practical and psychological, is deeply felt. The most recent example is in Chicago, where Illinois state regulators in January closed Seaway Bank & Trust, determining that its financial health had so deteriorated that pumping in more money couldn’t save it.\n\n> “It was like air coming out of a balloon,” said Bob Fioretti, a former Chicago alderman who was previously involved in raising money to keep Seaway open. “People were deflated. Seaway was a standing icon of the community.”\n\n> Seaway, formerly Chicago’s largest black-owned bank, helped anchor the famed black business community on the city’s South Side.\n\n> Claire Adams, a former board president of a South Side Chicago housing community that was one of the first businesses to use Seaway when it opened in 1965, said she now fears that with fewer small, community banks in her part of the city, payday lenders and check-cashing institutions, which often charge exorbitant rates and fees, would be many African-Americans’ only nearby banking option.\n\n> “The only thing that’s left are these predatory institutions,” Ms. Adams said.\n\n> In some areas of the South Side, Seaway was the first bank some African-Americans had access to, making it a symbol of black enterprise and economic development, patrons say. Many speak of the bank with admiration, often mentioning a program that allowed children to open a bank account with a small amount of money.\n\n> “I [could go to] Chase or something…but I like Seaway,” said Nell Robinson, who has used Seaway for more than two decades. “Seaway was here before Chase. It’s a black bank [and], we have to pull our people up.”\n\n> With such concerns in mind, members of the South Side’s religious community raised more than $100,000 in deposits for Seaway in 2016. But the effort wasn’t enough. Seaway was sold to the State Bank of Texas, then sold again to North Carolina-based Self-Help Credit Union.\n\n> A prolonged period of low interest rates and intense competition, as bigger banks slowly move into underserved areas, have combined to contribute to the black banking sector’s decline, even after the recession’s end. Now a practical concern in Chicago and elsewhere is that, even if bigger institutions step in, they won’t be as accommodating in lending to black-owned businesses.\n\n> A survey of entrepreneurs by the U.S. Census Bureau in 2014 found that 47% of black business owners had gotten the full amount of funding requested from banks, credit unions or other financial institutions, compared with 76% of whites.\n\n> That survey also showed fear of rejection was the top reason cited by black business owners who chose not to seek needed capital at all.\n\n> “When I have an applicant that comes into my bank and comes into XYZ large bank, and they’re on the edges, there are things that I can understand and appreciate about their situation that XYZ large bank won’t, and that makes the difference,” Mr. Mitchell, of Industrial Bank, said.\n\nI feel like we have to do whatever we can to keep these financial institutions alive man. Some of these banks & credit unions have been serving us and our communities since before integration. No way we should let them down now by continuing to take our business to people who don't care about or respect us. \n\nI have an account w/ Industrial Bank here in DC which is black owned in fact it was my very first bank account ever. My parents are the reason for this, and I'm proud to say I still do business with them to this day.",
    "title": "There Are Only 23 Black Owned Banks Left in America",
    "subreddit": "blackladies",
    "timestamp": 1503677750,
    "score": 84,
    "keyword": "african ceo"
  }
]