[
  {
    "text": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me So I started a new job. I'm a teacher (technically curriculum director but just a fancy title for writing repots while teaching) . My second day my supervisor held a meeting to yell at us all for not replying to his text message. I just sat there to gauge how everyone reacts. No one said anything. I have been here now 2 months and he is not a nice person.\n\nThings he doesn't like or respect: women, Asian people, African people, or his own wife (he jokingly called her an uneducated hillbilly)\n\nHe told me yesterday he paid for my time so he can text me whenever he feels like it after I told him to not text me at home about work stuff. He cannot fire me as he needs to provide proof to HR that I did something illegal or neglected my work as I am under contract for the next year and a half. \n\nI do not like him and just want to annoy him so much that he avoids me like the plague cause I am not quitting this job because I like everything about it but him. Also forgot to mention, principal is on autopilot, so going to her is no good. Any good ideas?",
    "title": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me",
    "subreddit": "jobs",
    "timestamp": 1614441321,
    "score": 3,
    "keyword": "african director"
  },
  {
    "text": "New student teacher noticing potential racism with cooperating teacher and needs advice Hi everyone,\n\nSo my fiancée just finished her first week of student teaching for her master’s program, and is assigned to kindergarten. She loves her students and has a good relationship with her cooperating teacher, who has been teaching for 5 years and went through the same program.\n\nHowever, my fiancée has noticed that her cooperating teacher appears to treat the one African-American boy in the class more harshly than the others, who are mostly white and Latina. The little boy had a rough first day—as can be expected for a kindergartner on their first day—and from then on, she has described him as “defiant”; which she hasn’t described any other student as. My fiancée has a good relationship with all of the students and says that he’s really sweet, really smart, and has been no more defiant than any other student.\n\nToday, he apparently swept some plastic fruit toys off of a kitchen counter toy—the cooperating teacher claimed as he was looking her in the eyes—and she grabbed him by the upper arm and forcefully sat him in the timeout chair. My fiancée thinks she seems to be overly scrutinizing him—not in an obvious way but in what seems like an insidious, possibly subconscious way.\n\nMy fiancée questions whether her newness to teaching and proclivity for leniency might be clouding her thoughts but it’s gnawing at her—especially given the effects of the pandemic on kids and this having been the kindergartners’ first week of school ever.\n\nShe doesn’t feel like she can tell the program professors or directors because they’re still close to the cooperating teacher, and doesn’t want to overstep with the elementary school principal and staff. She also doesn’t know whether it’s appropriate to bring it up with the parents or with the cooperating teacher—especially as the cooperating teacher is the main person determining her grades.\n\nHas anyone dealt with anything similar, or does anyone have any advice? \n\nThank you so much!",
    "title": "New student teacher noticing potential racism with cooperating teacher and needs advice",
    "subreddit": "Teachers",
    "timestamp": 1630106255,
    "score": 7,
    "keyword": "african director"
  },
  {
    "text": "Should I join this startup? I'm a 3+ years experienced Software Engineer and have been working currently in my 2nd company from last 1.2 years. I'm fed up of my current job because although they are paying me well but there's nothing to learn here. The The quality of work is really bad here and quantity is also less. Also, whatever work I've done, I feel a lot like being undervalued and underestimated in this organization. My team lead is also a bit like dictator who doesn't want to listen to any suggestion and just want to hear \"YES SIR\" everytime. I've been sitting idle in my office because of very less work and that too of low quality and have just been doing either freelancing work or job preparation in my office time.\n\nThen, I got in touch with the 12+ years experienced manager of my previous organization who left that organization and joined a new company (say startup) belonging to his friend. Although his startup has headquarters in Dubai and they have also been operating in some African country from last 15 years. But they just launched a development centre in India last year and my previous manager has become the director of that centre and has been expanding his team last year. He asked me last year to consider joining his organization full time or can consider part-time freelancing. I rejected the idea of full time but has been freelancing from last 6 months for him and TBH, I didn't learn that much in my current organization in these 1.2 years and learned a lot in freelancing work in these 6 months . He still ask me to consider joining him full time and promised me a better pay and better work. He told me that their products are highly scalable and has been used by millions of users in African countries. He further told me that he is having a lack of resources and some of the candidates which he selected ran away after getting a better package ( by using his offer) from other companies.\n\nAlthough I want to join him but there are 2 doubts in my mind:\n\n1. He is Muslim and I observed that 90% (or even more) of the employees in his organization are Muslims. I'm a Hindu and my father (who is an extreme Hindu) warned me not to trust such organization as according to him, I being a minority, can fall prey to something bad when the office will be opened after lockdown.\n2. I'm not sure whether he will pay my salary on time or not as the India development centre has just opened.\n\nSo, I'm confused whether I should join his organization or not. What will you guys suggest?  Please don't consider me as having anything against Muslims. It's just that I find this slightly awkward.",
    "title": "Should I join this startup?",
    "subreddit": "cscareerquestions",
    "timestamp": 1622223739,
    "score": 4,
    "keyword": "african director"
  },
  {
    "text": "This was just sent to the entire US team at PwC.  \n\nDear friends and colleagues,\n\nUnfortunately, today is my last day at the firm. Many of you have reached out to me over the past few months, but I have not responded to your notes. This is not because I have fallen out of our friendship, but because I have lost faith in what our firm stands for. And here is why. Our firm discriminated against me by repeatedly denying me a promotion because I am a Black woman who was not born in the US. When I complained about this discrimination, the firm retaliated against me which culminated in my termination today. I have shared my story below and hope you will take the time to read it.   \n\nAbout 12 months ago, as our country and the world experienced a social movement and reckoning over racism, our leaders seized every opportunity to tell us that they were rallying behind the end of race discrimination, in particular in the workplace. At the same time, however, they were also denying me the promotion to Director for the third time because of my race, color, national origin, and sex.\n\nThe Partners and Directors team that helped me prepare my case worked with me to escalate this injustice at top levels of our firm. Every single leader - FS Diversity & Inclusion Leader, FS Leader, Strategy& Leader and a few more - chose to look the other way and protect the other few Partners who had been using untruthful facts to misrepresent my performance and relationships with clients during CRTs in May 2019, November 2019, and May 2020.\n\nBehind the façade of its outward messaging regarding diversity, inclusion, and antidiscrimination, PwC fosters a work culture that stifles the development of Black, female, and non-native born employees, preventing them from achieving promotions and advancing within the Firm. This comes as no surprise when we look at the composition of the PwC leadership team, which fosters a discriminatory culture.\n\n* The U.S. leadership team, comprised of 19 members, is staffed with only one Black woman and two Black men. \n* The U.S. Board of Partners, comprised of 22 members, has only one Black man among its members. \n* As for Strategy&, there is only one Black man and not a single woman amongst 23 global leaders. \n\nAren’t we religiously telling our clients that effective diversity and inclusion starts at the top? Aren’t we telling our executive clients that they have to walk the talk to lead real cultural change? So why is it that we keep talking the talk and placing our “efforts” in programs that do not drive any real change in the status of Black people at this firm?  As someone who specializes in culture and gives this very advice to our clients, I find myself unable to escape this dissonance between what I tell them to do and what I know PwC has failed to do internally.\n\nAs of the third discriminatory denial of my promotion, I was the only Black left within FS Strategy&’s non-leadership team. As one Partner put it at the time “you are the last one standing”. Why is it that being Black at this firm has to be a constant uphill battle to prove that you deserve your seat? Why is it that I have had to consistently wait 1-2 more years on average to get the acknowledgements and promotions that my peers have gotten, when I keep bringing stellar performance reviews into CRTs?\n\nThis is to say that discrimination has been a reality for me for a long time, and has simply reached the point where my constant optimism can no longer make sense out of it. It has been a toxic force that does everything it can to:\n\n* Take away your dignity\n* Make you feel weak\n* Portray you as a poor performer and third-class consultant\n* Prevent you from bringing your authentic self to work; it’s not enough to be a great team player and high performer, you have to put “who you are” to the side - remind me what D&I is again?!\n* Push you out of the firm, because not even our leaders would stand up to do the right thing\n\nDuring the May 2020 social movement, one Partner reached out to me, after being summoned to, saying “(Name removed), I read Maya Angelou’s Caged Bird”. What?! To every non-Black Partner and staff at this firm, we do not need you to tell us about the Black stories or authors that you’re reading or the Black friends that you have or the African countries you have visited. What we need is for you to demonstrate true empathy when you see unfairness being done to a Black employee. STAND up, SPEAK up, CALL out. Call out colleagues on the offenses they’re perpetrating. I would not be in this position, feeling I must speak up and call out PwC’s hypocrisy to all of you, if the Partners in the CRT room had spoken up and called out their peers when they saw them derail the process for my CRT reviews which led to a biased outcome.\n\nThat offenders rarely get held accountable goes beyond the fact that our Partners and leaders sadly do not speak up when they should. The Firm continuously protects those offenders, leaving more Black, female, and other minority employees at their mercy. How, you may wonder? Go take a look at the contract PwC made you sign.\n\nPwC forces employees to sign binding arbitration agreements that rob them of their ability to have their day in court and to publicly call out PwC’s discriminatory, retaliatory, and other unlawful conduct. As a result, it is no surprise that PwC makes little to no change to its policies, procedures, and practices despite the multiple cases that have been filed for discrimination and retaliation. \n\nI will leave you with this. Sexual harassment used to be hidden under such “keep it secret” arbitration agreements until the MeToo movement. Many leading companies, including Google and PwC, excluded it from the arbitration agreement as a result of social pressure. This being said, Google also excluded “Race Discrimination” from its arbitration agreements, recognizing how much hiding discrimination at work behind the veil of confidential arbitration hindered the career advancement of Black employees. Why is it that our firm, a leader in its own territory, claiming to be a leader for our cross-industry national and global clients, cannot take the same simple step when it comes to ending racism and discrimination in the workplace? How much longer would our leaders turn away from doing the right thing to protect themselves if they knew they could be held publicly accountable? When will they finally do something that actually moves the needle and makes this firm a place where Black and other minorities don’t have to do three times more to prove their worth?\n\nDear colleagues and friends, I have enjoyed working with many of you and wish you the best of luck. Hopefully we can stay in touch.  \n\nIn good hope,\n\n(Name removed)\n\n—————-\nUPDATE - Ethics & Compliance has responded:\n\nEvening all--\n\nI am writing about an email which you may have received today from a former PwC US employee regarding her time at the firm that was sent to an internal distribution list. We are aware of the former employee’s concerns and we are addressing them.  Please know we take all allegations of firm policy violations seriously. \n\nOut of respect for the privacy of all parties involved, we are unable to discuss specific details of this matter.  However, we continue to encourage our employees to raise any concerns that they may have by speaking with a member of our People team or by contacting our confidential Ethics HelpLine, anonymously if preferred. PwC strictly prohibits retaliation against anyone for raising concerns in good faith.\n\nIf you have any questions regarding this matter, please contact the Ethics HelpLine.  Thank you.",
    "title": "This was just sent to the entire US team at PwC.",
    "subreddit": "Accounting",
    "timestamp": 1627334457,
    "score": 1568,
    "keyword": "african director"
  },
  {
    "text": "This was just sent to the entire US team at PWC Dear friends and colleagues,\n\nUnfortunately, today is my last day at the firm. Many of you have reached out to me over the past few months, but I have not responded to your notes. This is not because I have fallen out of our friendship, but because I have lost faith in what our firm stands for. And here is why. Our firm discriminated against me by repeatedly denying me a promotion because I am a Black woman who was not born in the US. When I complained about this discrimination, the firm retaliated against me which culminated in my termination today. I have shared my story below and hope you will take the time to read it.   \n\nAbout 12 months ago, as our country and the world experienced a social movement and reckoning over racism, our leaders seized every opportunity to tell us that they were rallying behind the end of race discrimination, in particular in the workplace. At the same time, however, they were also denying me the promotion to Director for the third time because of my race, color, national origin, and sex.\n\nThe Partners and Directors team that helped me prepare my case worked with me to escalate this injustice at top levels of our firm. Every single leader - FS Diversity & Inclusion Leader, FS Leader, Strategy& Leader and a few more - chose to look the other way and protect the other few Partners who had been using untruthful facts to misrepresent my performance and relationships with clients during CRTs in May 2019, November 2019, and May 2020.\n\nBehind the façade of its outward messaging regarding diversity, inclusion, and antidiscrimination, PwC fosters a work culture that stifles the development of Black, female, and non-native born employees, preventing them from achieving promotions and advancing within the Firm. This comes as no surprise when we look at the composition of the PwC leadership team, which fosters a discriminatory culture.\n\nThe U.S. leadership team, comprised of 19 members, is staffed with only one Black woman and two Black men. \n\nThe U.S. Board of Partners, comprised of 22 members, has only one Black man among its members. \n\nAs for Strategy&, there is only one Black man and not a single woman amongst 23 global leaders. \n\nAren’t we religiously telling our clients that effective diversity and inclusion starts at the top? Aren’t we telling our executive clients that they have to walk the talk to lead real cultural change? So why is it that we keep talking the talk and placing our “efforts” in programs that do not drive any real change in the status of Black people at this firm?  As someone who specializes in culture and gives this very advice to our clients, I find myself unable to escape this dissonance between what I tell them to do and what I know PwC has failed to do internally.\n\nAs of the third discriminatory denial of my promotion, I was the only Black left within FS Strategy&’s non-leadership team. As one Partner put it at the time “you are the last one standing”. Why is it that being Black at this firm has to be a constant uphill battle to prove that you deserve your seat? Why is it that I have had to consistently wait 1-2 more years on average to get the acknowledgements and promotions that my peers have gotten, when I keep bringing stellar performance reviews into CRTs?\n\nThis is to say that discrimination has been a reality for me for a long time, and has simply reached the point where my constant optimism can no longer make sense out of it. It has been a toxic force that does everything it can to:\n\nTake away your dignity\n\nMake you feel weak\n\nPortray you as a poor performer and third-class consultant\n\nPrevent you from bringing your authentic self to work; it’s not enough to be a great team player and high performer, you have to put “who you are” to the side - remind me what D&I is again?!\n\nPush you out of the firm, because not even our leaders would stand up to do the right thing\n\nDuring the May 2020 social movement, one Partner reached out to me, after being summoned to, saying “(Name removed), I read Maya Angelou’s Caged Bird”. What?! To every non-Black Partner and staff at this firm, we do not need you to tell us about the Black stories or authors that you’re reading or the Black friends that you have or the African countries you have visited. What we need is for you to demonstrate true empathy when you see unfairness being done to a Black employee. STAND up, SPEAK up, CALL out. Call out colleagues on the offenses they’re perpetrating. I would not be in this position, feeling I must speak up and call out PwC’s hypocrisy to all of you, if the Partners in the CRT room had spoken up and called out their peers when they saw them derail the process for my CRT reviews which led to a biased outcome.\n\nThat offenders rarely get held accountable goes beyond the fact that our Partners and leaders sadly do not speak up when they should. The Firm continuously protects those offenders, leaving more Black, female, and other minority employees at their mercy. How, you may wonder? Go take a look at the contract PwC made you sign.\n\nPwC forces employees to sign binding arbitration agreements that rob them of their ability to have their day in court and to publicly call out PwC’s discriminatory, retaliatory, and other unlawful conduct. As a result, it is no surprise that PwC makes little to no change to its policies, procedures, and practices despite the multiple cases that have been filed for discrimination and retaliation. \n\nI will leave you with this. Sexual harassment used to be hidden under such “keep it secret” arbitration agreements until the MeToo movement. Many leading companies, including Google and PwC, excluded it from the arbitration agreement as a result of social pressure. This being said, Google also excluded “Race Discrimination” from its arbitration agreements, recognizing how much hiding discrimination at work behind the veil of confidential arbitration hindered the career advancement of Black employees. Why is it that our firm, a leader in its own territory, claiming to be a leader for our cross-industry national and global clients, cannot take the same simple step when it comes to ending racism and discrimination in the workplace? How much longer would our leaders turn away from doing the right thing to protect themselves if they knew they could be held publicly accountable? When will they finally do something that actually moves the needle and makes this firm a place where Black and other minorities don’t have to do three times more to prove their worth?\n\nDear colleagues and friends, I have enjoyed working with many of you and wish you the best of luck. Hopefully we can stay in touch.  \n\nIn good hope,\n\n(Name removed)",
    "title": "This was just sent to the entire US team at PWC",
    "subreddit": "consulting",
    "timestamp": 1627343458,
    "score": 1246,
    "keyword": "african director"
  },
  {
    "text": "African Mirror Podcast - African Film Festival (African female directors and stories)",
    "title": "African Mirror Podcast - African Film Festival (African female directors and stories)",
    "subreddit": "blackladies",
    "timestamp": 1611366783,
    "score": 7,
    "keyword": "african director"
  },
  {
    "text": "Johnnetta B. Cole (84) & Tiffany D. Loftin (32) have an amazing intergenerational conversation https://www.facebook.com/watch/?v=516562173062841\n\n- Dr. Johnnetta Betsch Cole is an American anthropologist, educator, museum director, and college president. Cole was the first female African-American president of Spelman College, a historically black college, serving from 1987 to 1997. She was president of Bennett College from 2002 to 2007. During 2009–2017 she was Director of the Smithsonian Institution's National Museum of African Art.\n\n- Tiffany Dena Loftin was the National Director of the NAACP Youth & College Division at the NAACP.  She was appointed by President Barack Obama to serve on the White House Initiative on Educational Excellence for African Americans in Higher Education",
    "title": "Johnnetta B. Cole (84) & Tiffany D. Loftin (32) have an amazing intergenerational conversation",
    "subreddit": "blackladies",
    "timestamp": 1619671246,
    "score": 4,
    "keyword": "african director"
  }
]