[
  {
    "text": "Officially left toxic, racist workplace! Yesterday was my last day. I finally made my escape.\n\nFor the past two years, I was working at a company writing software. I was hired as a junior, however I was given the responsibilities of a senior. But it was a step up from my previous job. And the work that I was doing was actually very interesting. It wasn't anything I dreamed of doing. However there were two issues with the company.\n\nFirst, my boss only hired his friends, so outside of me, everyone was really close. This really created a toxic work environment as everyone was willing to fall on their sword and die for the company. They would work really long hours. 60-70 hours a week. But for them it was just hanging out with the friends. The other issue is that they were practically of one mindset. Which brings me to issue number 2.\n\nRacism and racially insensitive comments ran rampant. All the way from my coworkers, to HR, to the CEO himself, I've received comments that I was uncomfortable with. I'm a black guy, and I would love to say that I felt safe in my work environment, but I didn't. And I remember the time I first felt uncomfortable at work.\n\nThe CEO was with me one day and asked me what my ethnicity was. So I told him that my family came from the Caribbean. Word for word, he said to me \"Oh nice. You're one of the good ones, like my wife.\" It was very confusing, because I've met his wife before and she was black. So the fact that he said \"good ones\" was a strange. Then he continued to say \"You guys aren't like the black trash we see on the streets.\"\n\nAt that moment, I knew I had to go. The comments began to flow in. Using the N-Word because they were \"friends with black people\". The constant criticism for getting any food that wasn't American. My least favorite was \"The only reason I'd have black kids is because they would be so good at manual labor.\"\n\nSo I searched and I searched and I saved up money in case I needed to flee the scene without having a job first. But I finally got an offer. I put in my notice and they fought and fought to keep me, but my last day was yesterday. They're still calling me to see if they can work something out now, because I put them in a really bad bind with my project. I was the sole developer of the company and the software is projected to be a multi million dollar product. But they deserve every ounce of the bind they're in.\n\nI think the moral of this story and what I hope everyone takes away from this is you don't have to put with bad people. Neither do you have to feel sorry for them. Take care of yourself and beware of toxic environments.",
    "title": "Officially left toxic, racist workplace!",
    "subreddit": "jobs",
    "timestamp": 1567092853,
    "score": 9,
    "keyword": "american ceo"
  },
  {
    "text": "Leaving an up and coming start up ... Am I in the wrong and do I owe them anything? Bit of a long one so I'll TLDR.\n\n&#x200B;\n\n**Basically I'm wondering if owe my current company anything before I leave? I'm worried about my reputation being tarnished. I'm also worried about leaving what could be a very successful company.**\n\n&#x200B;\n\nSo I'm posting this on a throwaway account as I do not want my current employer to know I may be looking to leave their company.\n\n&#x200B;\n\nAnyway, to give you an overview of my situation, I recently emigrated to a new country and was lucky to get hired by a start-up company (four people including myself, two owners and my supervisor) who had opened the previous year and were offering a Premium European product for sale in our city.\n\n&#x200B;\n\nMy skill set is in high demand in the city I've moved to and my employment experience is of particular value to this company as I have experience dealing with their product and the software necessary to sell it. They snatched me up after a trio of interviews and have been training me and paying me ever since.\n\n&#x200B;\n\nAnyway, I've been working with them for the last two years and have had quite a successful run so far.\n\n&#x200B;\n\n1. I've increased my salary from 40k to 55k.\n2. I've developed my knowledge of the product and software to a point where I am now the most knowledgeable in the company.\n3. I've made a couple of trips back to Europe on the company's dime to visit their facilities.\n4. I've also won two awards with them (however there is drama surrounding one of them that I'm not happy about).\n\n&#x200B;\n\nSounds great right? Well it is ... most of the time, but there are a few things that have been bothering me since I first started ...\n\n&#x200B;\n\n1. I'm the only person in our company that is literate with our software system which means that a lot of the responsibility falls on me to produce content for sale to our city and purchase from Europe ... meaning I can often be overworked and expected to stay longer hours in order to produce the necessary content for time sensitive projects. This can also spill over into my days off when the company needs me.\n2. I'm the only native English speak in our company and while the rest of the staff do speak it, I'm often left out of day to day conversations unless I'm specifically involved from the get go. This also applies to our sub-contractor so it can be very annoying to communicate with them at times.\n3. When there is an issue (which there have been a few, I'm still learning the ins and outs of our industry, I'm the only one using our software and I'm often pulled in 10 different ways each day) its not received well. Sometimes its accepted and addressed and we move on, but often it is dragged out, complained about, criticized and hammered until I'm left feeling like crap. According to the owners, it doesnt really matter what the source of the problem is ... I'm the point of contact between us and Europe and therefore it is up to me to identify and fix any problems before they actually arise.\n4. The company is coming up on its three year anniversary and is experiencing some of the typical start-up pains. To put it bluntly, they are not making enough money. Our owner's spent aggressively (and i would argue prematurely) on a new store front and marketing campaigns and is now passing this pressure onto myself and my supervisor.\n5. Finally, I have to mention this ... one of the 'owners' is a total dick and has the biggest ego I've ever come across. I honestly dont know how other people interact with him. I cannot stand him. He treats EVERYBODY including our CEO like they are less than him. He straight up lies to our clientele about our product and services and then expects somebody else to fix it. He treats other people in our industry like they work for him and are not from another company altogether. The thought of working with him, or worse working under him, for the rest of my career is not appealing to me at all.\n\n&#x200B;\n\nI've recently been contacted by a locally owned company who has a similar system to the one I'm using now only its from a North American supplier. They are interested in hiring me for a unique role that sounds more to my liking than the one I am currently in. I've only spoken to them briefly however they have already piqued my interest and I've already arranged to explore this opportunity further.\n\nAssuming it is what I think it is, I may end up moving to this new opportunity. I'm worried about how this will be received by my current employer and am worried about giving myself a bad reputation by jumping ship (our industry is very small in the city I'm in). My reasons are ...\n\n&#x200B;\n\n1. The company has invested time and money into training me for this specific role and I'd essentially be upping and taking that somewhere else.\n2. I'm leaving the company at a critical point and it could end up being one of the final nails in its coffin.\n3. When I negotiated my pay with them, I mentioned that I was interested in building my career with them and that I could see myself with them for a very long time.\n4. I feel guilty about dropping this on them with two weeks notice as I do not think they would be expecting anything like this.\n\n&#x200B;\n\nI guess I'm looking for advice on my current work situation and the possibility of leaving my current employer. Do I owe them anything other than my two weeks notice?\n\n&#x200B;\n\nFor anybody else who stuck it out with a new start-up, how did it pay off? Were you left in a very strong position once the company established itself or were you left high and dry when it failed? I'd be very curious to hear your experience.\n\n&#x200B;\n\nThank you for taking the time to read this I know its a bit of a wall!",
    "title": "Leaving an up and coming start up ... Am I in the wrong and do I owe them anything?",
    "subreddit": "jobs",
    "timestamp": 1552522067,
    "score": 5,
    "keyword": "american ceo"
  },
  {
    "text": "Miserable at somewhat new job (The 50% raise not worth it) Hello all:\n\nAmerican here.  28y/o, Engineering manager for a pharmaceutical company.  Live in the middle of nowhere for work.  For clarity, it's the sort of town where every adult in town works at the same place.  Racism in the area and towns nearby is the most extreme I've ever seen in my life in the US (I've literally seen non-whites coworkers have people walk up to them at the gas station filling up their gas and scream racial profanities in their face).  \n\n&#x200B;\n\nWork/life balance is close to null because of the lack of things to do where I live. Good pay, decent insurance, vacation time is lacking (only 10 days, which accrue over the course of the year).   Mornings start at 3:45 in the morning and I'm lucky if I'm home by 8pm.\n\n&#x200B;\n\nTook this job last December for a 50% raise in pay after leaving a business where the CEO was openly committing fraud and I was retaliated against for speaking up against him.  The wife and I agreed we could use the money.  It has NOT been worth it.  I seriously considered handing in my 2 weeks today and moving the F out of here.\n\n&#x200B;\n\nPS: The wife equally hates this place too; mainly because as a Latina who happens to have dark skin, and due to the racism here, she does not feel safe living here.  We drive 4 hours every weekend to visit my parents in order to get away from here.  \n\n&#x200B;\n\nWife is INSISTENT that we move to her home country, Colombia, as every job I've managed to land after college have been typically in places where she has been miserable living due to lack of diversity, things to do, and unwelcoming people, amongst other things. I.E., it's been nearly impossible landing jobs in the bigger cities.  However, I'd have to give up a near 6 figure salary for the equivalent of $20,000 to $30,000 a year, and we still have 22k in student loan debt to finish paying off.\n\n&#x200B;\n\nReddit: any advice?",
    "title": "Miserable at somewhat new job (The 50% raise not worth it)",
    "subreddit": "jobs",
    "timestamp": 1563413583,
    "score": 3,
    "keyword": "american ceo"
  },
  {
    "text": "Odd interview questions have me second guessing if to take up the job, if offered. I went to an interview yesterday where the CEO of the company (small company) interviewed each candidate. It was a very weird interview. I was asked if I had kids, if I was single, commented in me being young and with so much education (having a master's at 25 doesn't seem uncommon to me but I might be wrong) and was told I shouldn't keep pursuing a higher degree.\n\nMy friends are telling me to not take the job if they offer it as I already have a job. But the pay is great and in line with what I studied (Biology). Unlike my current retail job. Are the questions I was asked really that bad to not even consider it? I don't know if i'm simply overthinking it.\n\nUpdate: So I got hired and quit on day 2. The employer is literally an older american that came to my island (american territory) to pick up much younger educated girls to take them to the states. The day was filled with innapropriate comments/suggestions, hovering and trying to get some physical contact. I hate that I can't report him (already spoke with a lawyer). But lesson learned never accepting a job offer where an interviewer questions & emphasizes on your age, relationship status & if you have any children. Back to job hunting.",
    "title": "Odd interview questions have me second guessing if to take up the job, if offered.",
    "subreddit": "jobs",
    "timestamp": 1574172372,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "Need to rant, this the only sub that will probably understand Tl;dr at the bottom, on phone so formatting is ya know\n\nThis is going to be rant about how much I hate Gaurdians to elder adults\n\nSo, I've had this patient on my unit for over 5 months, but she has been in the hospital all together for close to 7 now. We'll call her J.\n\nStory is, J was brought to our E.R. after 2 days of laying on the side unconscious. She had alcohol and meth in her system, and she was diagnosed with an anoxic brain injury, spent a few weeks in the ICU, was intubated, in a coma and all that jazz for about 3 weeks. She was then down graded to another floor where they couldn't handle her, so they sent her to us.\n\nMy unit is different than most due to the fact that we have 22 beds with cameras and 2 people that monitor the camera 24/7, and a runner to go to jumpy, high fall risk patients.\n\nSo she comes to our floor in need of a camera since she was mentally drunk all day every day. She would literally ask every 10 minutes or so for a new vodka-water, she was drinking PITCHERS of water. But over about a month of her being there, when asking for her drink we'd tell her no, but suggest a Sprite, juice etc instead and she was happy with it. \n\nIn all this she needed guardianship and still needs placement. See, she in not American shes Scandinavian of some sort, she has a brother close to 500 miles away and the rest over of her family back home. None of which that has the ability to care for her.  \n\nSo we get her a guardian, and ope, doesnt look like shes a legal US citizen so they are dealing with that before we can get her placement, and funding to pay for said placement, also shes only in her mid 50's so theres that too.\n\nThis poor woman, about 3 months ago went from being A&Ox1 to A&O 3.5 I would say, it takes her about a week for her short term to remember most thing-this is important. \n\nSo about 2 months ago, a nurse and CNA brought her a coat, and would walk with her outside and sit with her and let her enjoy some fresh air. It was usually only for 5-20 minutes, but it was something.\n\nWell one day Ms. J decided she wanted to go out and left, she was gone maybe 10 minutes, but got lost coming back to the unit (ok to be fair ever visitors who've been coming for weeks still get loss). But she goes to the ER admitting desk and asks for help back. After that the guardian said she absolutely can not go outside anymore.\n\nThis is where I get pissed off. J has now been cooped up in the hospital for half a year, the guardian NEVER COMES, never makes sure she has any toiletries, and never talks to the patient. We have a therapy guard that's locked and suppose to be for pt use that we cnat even take her too. A garden that part of our raised funded and the other half come from donations. Donations from when a mass shooting happened in my city in 2016, at a music festival, that my hospital got slammed with victims, even though we are not trauma. \n\nThis woman has loss all her spirit. She does nothing but sleep and pick at her food. She'll barely shower, and she barely smiles. Shes been medically cleared for months now and shes a walkie-talkie so she doesnt get as much TLC, she has literally 0 meds. \n\nThe other day (Friday) I walked in, she was so pale, eyes dark/slightly sunken in according to my friend that was taking care of her, she begged to take her outside and since it's an upper management issue, there is literally nothing she can do. And the guardian doesnt care (shes hardly ever reachable by phone) . \n\nWe plan on going up to our CEO tomorrow and talk to him. This poor woman is treated worse than a  Prisoner, and it's not right! So that's were we are currently.\n\nThanks for the read.\n\nTl;dr- pt has been in the hospital for over a year, public guardian doesnt want her going outside under any circumstance. Patient is now a pale, human ball of depression.\n\nEdit: she is allowed to walk the halls of the unit, but that's only 2 hallways in a V shape and only one small single window at the end of each, But she does t bother anymore. If anyone has any ideas on how to help or advocate for her, please let me know.",
    "title": "Need to rant, this the only sub that will probably understand",
    "subreddit": "nursing",
    "timestamp": 1556513348,
    "score": 21,
    "keyword": "american ceo"
  },
  {
    "text": "A list of sketchy companies to steer clear of Based off of the [post](https://www.reddit.com/r/cscareerquestions/comments/clyzla/dont_fall_for_scams_because_youre_desperate_for/) that I made a couple days ago, here's a list of shady companies that you might want to be aware of. Some of these are straight up scams and others are companies with questionable practices. Feel free to comment any others that you'd like for me to add on.\n\n* [Hire Experts Solution](https://www.glassdoor.com/Reviews/Hire-Experts-Solution-Reviews-E2110471.htm) \\- a full on scam that asks you to pay a $800 deposit for a \"training course\".\n* [Talent Path](https://www.glassdoor.com/Reviews/Talent-Path-Reviews-E2394237.htm)\n* [FDM](https://www.glassdoor.com/Reviews/FDM-Group-Reviews-E234827.htm) \\-  serfdom like contracting company but good if you have bad luck getting employment\n* [TechField](https://www.glassdoor.com/Reviews/Employee-Review-TechField-RVW20206497.htm) \\- has lots of ethics issues when it comes to your contract with them.\n* [Smoothstack](https://www.reddit.com/r/cscareerquestions/comments/9vphcx/is_smoothstack_a_revatureesque_scam/) \\- the OP from the post I linked gave a pretty good description of their shadiness: \" you make $8 an hour during the 3 month program and can be fired for any reason after having to move out to the DC area, and after the 3 months you aren't actually guaranteed employment anywhere. The other big red flag is the complete lack of info about them online outside of their own site/social media and a fishy glassdoor review. \"\n* [Quintrix](https://www.reddit.com/r/cscareerquestions/comments/9er3u7/anyone_had_any_experience_with_quintrix_solutions/) \\- a company based where interviews have left to dead ends? there isn't too much info out there about this one so it's hard to determine its credibility.\n* [Cogent Infotech](https://www.glassdoor.com/Reviews/Employee-Review-Cogent-Infotech-Corp-RVW20036149.htm) \\- there's a truck load of issues going on at this place, take a look at the first review in the Glassdoor link that I provided.\n* [Numero Data](https://www.glassdoor.com/Reviews/Numero-Data-Reviews-E1567453.htm)\n* [Miracle software systems](https://www.glassdoor.com/Reviews/Employee-Review-Miracle-Software-Systems-RVW18793098.htm) \\- a company with a lot of H1b abuse.\n* [Sollers college](https://www.yelp.com/biz/sollers-college-edison) \\- not a company but an \"educational institution\" that asks for 20% of your income at your first job.\n* [Revature](https://www.reddit.com/r/cscareerquestions/comments/5w0w6a/is_the_company_revature_a_scam_or_questionable/de6hya7?utm_source=share&utm_medium=web2x) \\- extremely shitty work pay policies, take a look at the linked comment for more details.\n* [Cybercoders](https://www.reddit.com/r/recruitinghell/comments/9nksci/no_cybercoders_just_no/) \\- a hiring agency that is apparently a legit company but incredibly spammy and doesn't actually do what they promise to.\n* [Aspiritech](https://www.glassdoor.com/Reviews/Aspiritech-Reviews-E929169.htm) \\- \"It markets itself as a pro-autism workplace, especially for placing QA jobs, but it treats them worse than the \"normies\" of the company. They don't get 401k or other benefits that non-autistic employees get and get paid much lower, at $12/hr, for QA work. Unpaid training phase and this training doesn't guarantee a job. \" (info. from u/ExitTheDonut).\n* [Credible Behavioral Health Software](https://www.glassdoor.com/Reviews/Credible-Behavioral-Health-Software-Reviews-E771852.htm) \\- a company with serious management issues, employees are overworked and fired easily.\n* [Empowr](https://www.glassdoor.com/Reviews/empowr-Reviews-E769591.htm)\\-  u/Mr_Gobble_Gobble details their experience with the company here: \"As part of the interviewing process the recruiter (which is some low level dev or marketing person) pushes that you should read the [CEO's book](https://www.amazon.com/America-Idea-American-Dream-Everyone/dp/B079345936) to understand the company and do well in the interview when you meet with the CEO. Well the only way to read it is to purchase it so... they make some money off of devs going through the interview process. The book itself is laughably awful and suggests that terrorism can be defeated by, you guessed it, Empowr. \"\n* [Perficient](https://www.reddit.com/r/jobs/comments/79zkj2/has_anyone_worked_for_perficient_inc_office/) \\- as per u/wavyhairedsamurai: \"\\[they\\] do a similar 2-year contract with forced relocation and a payment of $10,000 if you leave the company during that time.\" , the Reddit post I've linked provide information that makes they sound a lot like a scam as well (you have to pay shipping fees to have equipment shipped to you). \n* [KGS group](https://ca.indeed.com/cmp/Kgs-Group/reviews) \\-   \"Like that hire experts solution they have you pay $700 for a course as well.\" - from u/AirNSpace \n\n\\*\\*Disclaimer: don't take this post as an exhaustive list of all shady companies, I'm providing this info. so that people can make more informed decisions. Some commenters have mentioned that certain companies like Revature or Aspiritech might not be that bad but I would recommend thoroughly researching any company that contacts you before you proceed with interviews.\\*\\*\n\nAlso a special thanks to u/Ya_mike, u/strikefreedompilot, u/binarySearch_recurse,  u/csthrowawayquestion and  u/thetapasbalu for providing the names of these companies and information used to make this post. \\*\\*I decided to stop adding in other users in case this list gets obscenely long.",
    "title": "A list of sketchy companies to steer clear of",
    "subreddit": "cscareerquestions",
    "timestamp": 1565463169,
    "score": 377,
    "keyword": "american ceo"
  },
  {
    "text": "Is it easy to find a contract work oversea (Vietnam) with a Computer Science degree from North America (Canada)? I was an international student. I'm a worker now. Every time I went back home (Vietnam), I always wanted to stay with my family and wish I had not chose to come to Canada. I know I can just move back but I really do not want to come back with nothing. I graduated with a diploma (Nanotechnology System, making anything related to semiconductor or thin film) from NAIT, which probably is useless when apply for job in Vietnam (because Vietnam is a developing country which does not really care much about nanotechnology), and I am currently working and applying for PR. I work as a Laboratory Technician at a start-up company at the university. The CEO has stated very clearly that he will eventually sell the company. However, the perspective may change but no one can really tell the future.  The company treated me well with good Healthcare plan, company stock option plan, free lunch, team building activities, free snack, compromised vacation days (can go up to a month of vacation), salary increases yearly to match inflation. However, I did not expect the job to be very repetitive and mindless. Sometimes, what I did all day was staring at a machine. Since all I did was just following engineers' orders, and did repetitive lab works, I'm not sure what I will get from this job when the company is sold. I guess I will just enjoy a Comp-Sci book while waiting by the machine.\n\nI really miss home and I'm thinking of going back to school for a Computer-Science degree when I got my PR (pernament resident, after getting PR school will be cheaper for me). I believe having a Computer-Science degree can help me find contract work that will pay me North America salary when I'm living in my low income country. I will be living like a King but also I will have enough money to support my family and even extras for saving. However, I heard that you don't actually need a Computer-Science degree to find contract work. Some people would say they only need certain tech certificates, or a portfolio that shows you can code. However, I did some research and I agree with the people who says that tech certificates will get out of date very quickly because programming language (and technology) are always changing, therefore learning the theory from Computer Science degree will get you further. I also read an [article](https://gizmodo.com/ceo-of-ibm-says-hiring-based-on-skills-instead-of-colle-1831977815?utm_source=gizmodo_facebook&utm_campaign=socialflow_gizmodo_facebook&utm_medium=socialflow&fbclid=IwAR2xt_vU2wBV-SyRBv30ciH57_Ngmg517izdWNVm3NP2WjumnZV7jSkn0wQ) this morning saying some companies now are hiring based on skills instead of degree. Is that a norm tech companies created to hire people with no degree to pay them less but still get the work done? Which is the best way to get contract work? Can anyone help me debunk the controversy around Computer-Science degree vs Tech Certificate?\n\n&#x200B;\n\nCan you tell me your successful/unsuccessful stories of finding contract work oversea with a North American degree in Computer-Science? What are the projects you have involved? How long does it usually take you to work on a project? Do you have to work in a team even it's contract work?\n\n&#x200B;\n\nSo I have two plans for the next 5 years:\n\n1. Get PR then earn a Computer-Science degree then Canadian citizenship and go home for good.\n2. Learn coding on my own, create a portfolio, get Canadian citizenship and go home for good.\n\nThanks, guys!",
    "title": "Is it easy to find a contract work oversea (Vietnam) with a Computer Science degree from North America (Canada)?",
    "subreddit": "cscareerquestions",
    "timestamp": 1548266079,
    "score": 2,
    "keyword": "american ceo"
  },
  {
    "text": "Wayfair CEO (South Asian) Refuses to Stop Furnishing Concentration Camps [Wayfair CEO Refuses to Stop Furnishing Concentration Camps](https://gizmodo.com/wayfair-ceo-refuses-to-stop-furnishing-concentration-ca-1835850790)\n\n&#x200B;\n\nThis is an unexpected, but substantial entry, into Disgrasian of the Year.\n\nAAPI's should NEVER be on the side of concentration camps.  I don't give a fuck.  If there has to be one goddamn rule that all Asian-Americans have to follow, \"Fuck concentration camps\" is a contender.",
    "title": "Wayfair CEO (South Asian) Refuses to Stop Furnishing Concentration Camps",
    "subreddit": "asianamerican",
    "timestamp": 1561509898,
    "score": 102,
    "keyword": "american ceo"
  },
  {
    "text": "Seibo Shen from tech to Cannabis entrepreneur to Happy Asian Male Hello everyone! My name is Seibo Shen and I found this sub reddit based on a recommendation from a friend.  A little bit about myself, I graduated with a degree in Asian American studies from UCLA in 2000, I worked as a stuntman then became a law school drop out before working for 5 tech companies that had successful exits. I am currently the CEO of Hanu Labs, a cannabis hardware company in California and I am very focused on mental health in the Asian American community. \n\nOver the last twenty years, I've seen my Asian peers become quite successful but something always seemed to be missing. Whether they were just following their parents dream, or just didn't like what they did, there was something that wasn't fulfilling about our lives. I know I went through that as I worked for company after company that had successful exits, only to find myself temporarily excited and then it would be back to the grind. \n\nI looked for a lot of resources that would talk about taboo topics in the Asian community but couldn't find too many. Because of this, we (Brandon Chien, sex coach) started a podcast called the Happy Asian Males where we discuss various topics including mental health, human optimization, vulnerability, and even dive into topics like psychedelics and what they can do for Asians. I'd love to hear your feedback on what we are doing and hopefully you find it a positive contribution to the Asian community.\n\n[https://podcasts.apple.com/us/podcast/ham-episode-27-mental-health/id1272938949?i=1000408183336](https://podcasts.apple.com/us/podcast/ham-episode-27-mental-health/id1272938949?i=1000408183336)",
    "title": "Seibo Shen from tech to Cannabis entrepreneur to Happy Asian Male",
    "subreddit": "asianamerican",
    "timestamp": 1567003341,
    "score": 3,
    "keyword": "american ceo"
  },
  {
    "text": "One brave young man takes on gender inequality at USC  \n\nMisandry—the hatred of men—has been a staple of my polemical writing  for more than fifteen years. I felt a special obligation to hammer away  at gender myths such as intimate partner violence (women are about [as likely as men](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) to initiate violence against their partners as men), false sexual allegations (a [disturbing percentage](https://medium.com/t/@jimpreston_36730/how-many-rape-accusations-are-false-f52e4c675f2a) of such allegations) and demonstrable [bias against fathers](https://theccf.ca/ideology-and-dysfunction-in-family-law/)  in family court, because male journalists who dared to write  sympathetically about men and/or critically about women put their  careers in jeopardy (no exaggeration), and most had learned to keep *shtumm* in this domain.\n\nThat  situation has been changing slowly but steadily. Some men have decided  they aren’t going to spend their lives in rhetorical purdah on the  subject of their own cultural dhimmitude, and have been stepping up to  the plate, whatever the personal cost. The university campus is home to  the feminist commissariat—and it’s a brave man who dares to stick his  head above that formidable parapet. Because the cost of doing so can be  high.\n\nThis is the story of one such activist who paid a price,  which only fueled his resistance efforts, and which in turn inspired  others, in reversing a decades-long erosion of men’s rights on campus.\n\nIn  a meeting held in June, 2017, Kursat Christoff Pekgoz was pressured by  his academic director at the University of Southern California into  terminating his PhD degree in English Literature on what Pekgoz  considered spurious and unprecedented grounds, accompanied by “many  threats and irrational exaggerations” (the meeting was recorded).  His  contract was not renewed and his funding was cut off. This is extremely  uncommon. In fact, Pekgoz is unaware of any other PhD student being  denied a doctoral degree in English Literature \\[at USC\\].\n\nThe real  reason for his PhD termination, Pekgoz alleges, is his history of gender  activism via a series of Title IX complaints against a number of  universities, such as Rutgers, [Northeastern](http://ncfm.org/wp-content/uploads/2018/08/NCFM-Title-IX-complaint-Northeastern-University.pdf) and Georgetown, to which he added [one against USC](https://docs.wixstatic.com/ugd/ea7b71_0c223159779e4beaaea809873f2504a7.pdf) at the end of May. As he [told a PJ Media reporter](https://pjmedia.com/trending/ph-d-student-files-federal-complaint-says-usc-retaliated-against-his-pro-men-title-ix-activism/), “They all know that I am a Title IX activist for men, with strong libertarian/conservative views.” \n\nTitle  IX’s language is very plain. It prohibits any institution from funding,  sponsoring, or listing gender-discriminatory programs and initiatives,  so for example, even listing a woman-only scholarship or placing an  employment ad specifying only women need apply runs counter to Title IX,  though such breaches happen all the time. Title IX also prohibits  discrimination in terms of counselling or health benefits. That should  mean that both men and women are treated with equal objectivity and  respect when, say, sexual-assault allegations come up for assessment.  But universities have [not covered themselves in glory](https://helpsaveoursons.com/category/fighting-back/), to say the least, on that front. \n\nIndeed,  motivation for Pekgoz’s robust activism arose in part from a Title IX  complaint against him for sexual harassment. In response, he went on  offence with a forceful and persuasive [counter-charge](https://docs.wixstatic.com/ugd/ea7b71_16c1692eab8844218afdb2b419622827.pdf)  that his accuser had in fact sexually assaulted him (it’s worth  reading, because it offers a formidable sample of the kind of meticulous  research and annotation Pekgoz applies to every single thing he says  and writes. It does not seem to leave much wriggle room for his accuser,  and I think any objective reader would come away from it with,  minimally, doubts as to the accuser’s credibility.) \n\nIn 2018  Pekgoz complained to the Department of Education’s Office of Civil  Rights (OCR) about both USC and Yale University, prompting an  investigation into both schools’ women-only scholarships and programs,  such as a USC Women in Science and engineering group that excludes  males.\n\nLast January, Pekgoz and two former lawyers (not affiliated with Harvard University) filed a Title IX [complaint with the OCR against Harvard](https://docs.wixstatic.com/ugd/ea7b71_85533d99ee0748ac813ca937735a4f94.pdf),  in which they rebut the received wisdom of female victimhood with an  abundance of impeccably-sourced evidence demonstrating the various ways  in which men are discriminated against in society and on campus.  Notably, “the overwhelming majority of all persons sanctioned under  Title IX theory are male. However, there is good evidence that men and  women experience sexual victimization at equal rates and the majority of  male victims [report female perpetrators](https://www.sciencedirect.com/science/article/abs/pii/S1752928X11001569). The majority of Title IX administrators are women.”\n\nAlso in the Harvard complaint is a reference to Supreme Court prohibitions against male-gender discrimination. In [*Mississippi University for Women v. Hogan*,](https://www.britannica.com/topic/Mississippi-University-for-Women-v-Hogan)  for example, the Supreme Court held that denying male admission to  nursing courses was impermissible under the Equal Protection Clause of  the Fourteenth Amendment. They wrote that a sex classification must be  “…determined through reasoned analysis rather than through the  mechanical application of traditional, often inaccurate, assumptions  about the proper roles of men and women. … Thus, if the statutory  objective is to exclude or ‘protect’ members of one gender because they  are presumed to suffer from an inherent handicap or to be innately  inferior, the objective itself is illegitimate.” This statement would  seem to undermine the reflexive argument adduced by feminists that  affirmative action for women is still necessary because of historic  disadvantage or because there are more *Fortune 500* male CEOs than women.\n\nThe  most interesting complaint to the OCR, because it reveals the distance  the men’s rights movement has come from its first tentative and atomized  beginnings two decades ago, is the one led by Pekgoz [against Cornell University](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed) in February, which Pekgoz described in an  [interview with *Campus Reform*](https://www.campusreform.org/?ID=11853) as “one of the worst in the nation” for anti-male bias. \n\nThe  document contains a “list of exclusionary programs” at Cornell, such as  the lack of a Men’s Resource Center to balance the women’s Center, or a  Men’s Health Center to balance the Iris Cantor Women’s Health Center.  Likewise – even though “men are twice as likely to have heart attacks  through life than women” – there is a women’s Heart Program, but none  for men.\n\nBut the list itself, while interesting, is not what is  most significant about the Cornell complaint. Rather it is the public  support for the complaint amongst Pekgoz’s colleagues and from many  respected public intellectuals, such as American Enterprise Institute  scholar and feminist critic [Christina Hoff Summers](https://www.aei.org/author/christina-hoff-sommers/),  that lend unusual moral weight to its claims. More than 185 professors,  scholars and activists signed on to it, including Canada’s own Jordan  B. Peterson, arguably the most recognizable and inspirational spokesman  for gender equality in the world today. Peterson referenced Title IX’s  long association with women’s rights succinctly: “what’s sauce for the  goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*  that he had signed the complaint because it “addresses a fundamental  unfairness in contemporary America, centred in our colleges and  universities” and because “it shows that exclusionary practices create a  hostile environment” for men, some caused by an “animus against males  perpetrated by feminist ideology.” Lawrence Alexander, a law professor  at the University of San Diego, told *Campus Reform* that he signed because “its allegations are true and even understated.”\n\nSuch  public affirmation on men’s behalf by high-status academics in  prestigious institutions represents something like a tipping point in  the gender wars, it seems to me. Margaret C. Valois, a Virginia-based  Title IX attorney who specializes in defending accused male students  filed a similar Title IX complaint against Tulane University and [obtained a win](http://www.aei.org/publication/successful-title-ix-complaint-forces-tulane-university-to-end-gender-discrimination/)  recently. Valois, Pekgoz and another aggressive veteran in the battle  for gender equality, Professor Mark Perry of the University of  Michigan-Flint, are profiled by anti-feminist Canadian vlogger Janice  Fiamengo, a signatory to the Cornell complaint, in [Episode 94 of her popular Fiamengo File](https://inclip.top/studiobrule/aLDRY3qCkmjIuoI/will-2019-be-the-year-of-mra-lawsuits-tff-episode-94.html) series, titled “Will 2019 Be the Year of MRA Lawsuits?”\n\nWill  it? It does seem that we are at a pivotal moment—that there is a  powerful current of social unease, running just below the still  hegemonically feminist surface, with the unfettered misandry that  pervades our culture. In Pekgoz’s Harvard complaint, for example, he  notes that whenever the Department of education investigates an  institution for anti-male discrimination, public attitudes on the issue  are on the side of men: “\\[A\\]ccording to a recent poll conducted by  YouGov, 69% of all Americans believe that men face discrimination to  some extent. 74% of men believe that such discrimination occurs, while  63% of women agree that men face some degree of discrimination.”\n\nFiamengo points to what she ([and I](http://www.barbarakay.ca/articles/view/1297)) consider radical feminism’s shark-jumping moment, the publication in the *Washington Post* of Northeastern University academic Suzanna Danuta Walters’s odiously misandric June, 2018 article, “[Why can’t we hate men](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html)?” which earned her a [Title IX complaint](https://www.campusreform.org/?ID=11249) filed by the National Coalition for Men [(NCFM).](https://ncfm.org/)  Walters doubtless expected her screed would find the passive acceptance  such anti-male rants often have done in the past, but was clearly  startled by the fierce blowback she received.\n\nA final word about  Kursat Christoff Pekgoz. I don’t know him personally, but from his  history, I would say that the USC Literature department picked the wrong  guy to tangle with when they forced him out of his PhD program. This is  a young man, now 30-something, who comes from Turkey, a land where they  play political hardball, and backing the wrong horse can earn you  something worse than a Twitter mobbing. He learned about activism in  what we might call an “unsafe space.”\n\nPekgoz’s [*curriculum vitae*](https://www.kursatchristoffpekgoz.com/)  informs us that In Turkey Pekgoz went out on potentially dangerous  political limbs. He took part in the Republic protests of 2007 against  fundamentalist Islam, as well as a protest against Islamist hate speech  targeting Armenian and Jewish minorities in 2009, amongst other forays.  He advocated against electoral fraud by the Islamist regime. He taught *pro bono* for an anti-Islamist organization that seeks to eliminate illiteracy among young women in Ankara (real feminism in action). \n\nAll  this speaks to character. For relentless discipline and determination  in achieving goals, add this salient fact: As a long-distance swimmer,  Pekgoz has covered 11,000 m in the open sea, with the best speed of  5,000 m in 130 minutes. This is in seawater with a temperature of 17C.  Don’t look to such a man to truckle to latte-sipping ideologues  trafficking in gender injustice. Ever.\n\nAccording to his bio,  Pekgoz has “perfect pitch.” He means musically, of course. But it may be  the case that he has perfect cultural pitch as well.\n\n&#x200B;\n\n[https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/](https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/)",
    "title": "One brave young man takes on gender inequality at USC",
    "subreddit": "MensRights",
    "timestamp": 1569207365,
    "score": 187,
    "keyword": "american ceo"
  },
  {
    "text": "Atheist and progressive leader David Silverman gives an interview after being falsely accused of sexual assault. Describe how false accusations destroyed his life. Realizes a lot of MRA talking points. Worth the 50 minutes watch.  [https://www.youtube.com/watch?v=H7DXu059K9Q](https://www.youtube.com/watch?v=H7DXu059K9Q) \n\nSummary\n\n1. Got fired from his job as CEO of AMerican atheists after 2 false sexual assault accusations\n2. His life got destroyed. Had to set up a gofundme account just to survive since no atheism org would hire him\n3. Still identifies like an \"egalitarian feminist\"\n4. Reached a number of MRA conclussions like\n   1. the fact the they simply treated him like another rapist man without looking at any of the evidence\n   2. the fact that his friends told him that even if he hadnt sexually assaulted those women he still deserved to have his life destroyed because he cheated on his wife.\n   3. that all his friends\n   4. that a lot of feminists hate men.\n\nWorth the 50 min watch\n\nAlso longer interview with another interviewer here\n\n [https://www.youtube.com/watch?v=H7DXu059K9Q](https://www.youtube.com/watch?v=H7DXu059K9Q)",
    "title": "Atheist and progressive leader David Silverman gives an interview after being falsely accused of sexual assault. Describe how false accusations destroyed his life. Realizes a lot of MRA talking points. Worth the 50 minutes watch.",
    "subreddit": "MensRights",
    "timestamp": 1569504929,
    "score": 47,
    "keyword": "american ceo"
  },
  {
    "text": "Why do so many incompetent men become leaders? | Tomas Chamorro-Premuzic | TEDx University of Nevada [https://www.youtube.com/watch?v=zeAEFEXvcBg](https://www.youtube.com/watch?v=zeAEFEXvcBg)\n\n&#x200B;\n\nWarning: virulent male-bashing. \"The question we should be asking is not why there aren't more women leaders, but why so many incompetent men become leaders.\" Well, if you haven't seen many women leaders, you can't know how frequently they can be incompetent, can you?\n\n&#x200B;\n\nThe kicker: He's from Argentina and tries to weave a nice little joke into the talk. \"One of the best investments you can make in your life is to buy an Argentine for what he's worth and sell him for what he thinks he's worth.\" He thinks he can't crack this joke back home because Argentines are apparently just not self-aware enough to find it funny.\n\n&#x200B;\n\nYoutube blurb:\n\n>There is a pathological mismatch between the qualities that seduce us in a leader and those that are needed to be an effective leader. Based on research on the psychology of leadership, Chamorro-Premuzic shows that if leaders were selected on competence rather than confidence, humility rather than charisma, and integrity rather than narcissism, we would not just end up with more competent leaders, but also more women leaders. In fact, he argues, the main obstacle preventing competent women from becoming leaders is the lack of career obstacles for incompetent men. \n\n&#x200B;\n\n>Dr. Tomas Chamorro-Premuzic is an international authority in psychological profiling, talent management, leadership development, and people analytics. He is the Chief Talent Scientist at Manpower Group, co-founder and CEO of DeeperSignals and Metaprofiling, and Professor of Business Psychology at both University College London, and Columbia University. He has previously held academic positions at New York University and the London School of Economics, and lectured at Harvard Business School, Stanford Business School, London Business School, Johns Hopkins, IMD, and INSEAD, as well as being the CEO at Hogan Assessment Systems. Dr. Tomas has published 10 books and over 150 scientific papers, making him one of the most prolific social scientists of his generation. His work has received awards by the American Psychological Association and the Society for Industrial-Organizational Psychology, to which he is a Fellow.",
    "title": "Why do so many incompetent men become leaders? | Tomas Chamorro-Premuzic | TEDx University of Nevada",
    "subreddit": "MensRights",
    "timestamp": 1555280795,
    "score": 5,
    "keyword": "american ceo"
  }
]