[
  {
    "text": "Just offered a contract job overseas, I need some advice I'm in pharmacy and on a whim, I applied to a contract gig in Iraq for a year. They contacted me and would like to take me on, and I'm considering accepting but I need to bounce the facts off someone first.\n\nFirst of all I'm a young female American, single, no kids and no ties to anything here currently. This would be on a compound with a heavy military presence, lodging and meals are provided for and there is a stipend for travel to get over there and also for leave. I will need to get my Visa set up which the company also assists with.  The pay is really good.  Not so good I doubt its validity, but a good deal more than i make now.\n\nI'll be speaking to the medical director on Tuesday. What sorts of questions do I need to ask? Is this safe for me? Does anyone have experience with this sort of situation? I've never been to the middle east but I know it can pose a bit of a risk for an American white girl like me. It seems like the sort of adventure I would like to embark on, but I want to be smart about all this.\n\nThanks ahead of time!!",
    "title": "Just offered a contract job overseas, I need some advice",
    "subreddit": "jobs",
    "timestamp": 1556294890,
    "score": 9,
    "keyword": "american director"
  },
  {
    "text": "Non-Americans, what are some must-see movies from your country and what are some directors you recommend?",
    "title": "Non-Americans, what are some must-see movies from your country and what are some directors you recommend?",
    "subreddit": "AskReddit",
    "timestamp": 1572310511,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "Hearing from women with endometriosis: the disorder that leads to decades of pain, dismissmal, and misdiagnosis Endometriosis is a disorder where the endometrial tissue– tissue similar to that of the uterus lining– appears in other parts of your body, usually in the pelvic region, but could spread as high as your lungs. An estimated one in ten American women have endo, however, many women remain undiagnosed or so this is a very low-balled statistic.\n\nOn average, it takes a decade to finally get a diagnosis. That’s a long time to deal with chronic pain, being dismissed, and the stress of it all. There is currently no cause or cure, leaving many in the dark about what’s going on with their bodies.\n\nI'm a producer for Empowered Health, a podcast focused on navigating women's health, we just released our first endometriosis episode.\n\nIn preparation for this episode, we asked members of an endometriosis-focused Facebook group, Nancy’s Nook, if they had experience with their pain being dismissed. As a result, our inbox was flooded with dozens of women’s stories of being disregarded by doctors, suffering infertility, missing important events due to unbearable discomfort, stress from years of misdiagnosis or no diagnosis at all, and having everyone from bosses to partners to friends not taking them seriously. Besides the physical effects, endometriosis has affected their work, relationships, social life, and left a huge psychological toll after years of being considered “overdramatic” to menstrual cramps.\n\nWe hear from a handful of women with endometriosis who have been pretty much gaslit by the medical community for their pain being in their head– women even told us that during the battle to get diagnosed, doctors have suggested they see a therapist. It’s heartbreaking that doctors dismiss these women as unstable and just needing to talk instead of being on their team and believing how they feel.\n\nAlong with getting firsthand accounts from women, we talk to experts who are trying to improve this sphere that has been desperately in need of good doctors and researchers. Dr. Stacey Missmer, the scientific director of the Boston Center of Endometriosis, has been looking at how endometriosis spreads, diagnosing it, the different types, and all the different facets of the disorder for over two decades. At the BCE, she oversees a longitudinal study on females over the age of seven who haven’t hit menopause, looking at approaches to the diagnosis and care and finding the best treatment of teens and women.\n\nA huge problem in the care aspect is that there is a very limited number of doctors who know how to do a laparoscopic excision surgery well, if at all. We talk to one of the most sought after excision surgeons in the country, Dr. Ken Sinervo of the Center for Endometriosis Care, on what the fundamental problems practitioners keep repeating in treatment and how to know if your surgeon is inept to treat your endometriosis.\n\nFar too many have suffered from endometriosis without getting proper care. Since the disorder is tied to menstruation, it is heavily stigmatized, as are most menstrual issues. We want to change that and by providing good information on the disorder and emphasize how important it is to advocate for how you feel. Figured this group might be interested in what they has to say surrounding the topic, links to listen:\n\n[APPLE PODCASTS](https://podcasts.apple.com/us/podcast/ep-18-opening-up-about-endometriosis/id1452440833?i=1000445026655) | [SPOTIFY](https://open.spotify.com/episode/14uEMH1zt496ZFDenFr7TK) | [GOOGLE PLAY](https://play.google.com/music/m/Drvntfik4haor2gf5utivcz6t4i?t=Ep_18_Opening_up_about_endometriosis-Empowered_Health) | [STITCHER](https://www.stitcher.com/podcast/empowered-health/e/62718300?autoplay=true) | [LUMINARY](https://luminarypodcasts.com/listen/emily-kumler-469/empowered-health/ep-19-opening-up-about-endometriosis/46f12fb5-8e60-43a2-9b19-746c9bb99852) | [OVERCAST](https://overcast.fm/+Quxlj2Yk8) | [WEBSITE](https://empoweredhealthshow.com/ep-12-punished-for/)",
    "title": "Hearing from women with endometriosis: the disorder that leads to decades of pain, dismissmal, and misdiagnosis",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1563824223,
    "score": 13,
    "keyword": "american director"
  },
  {
    "text": "High heels = Professional? I just remembered this story because I came across a tweet I sent out about it, and thought the people in this sub may get the same chuckle out of it that I did.\n\n&#x200B;\n\nFor context, I work for a school that is based/built around a soccer developmental academy (DA). For those that don't know, DAs are intended to essentially fast track youth soccer players to college programs, professional careers, and possibly their country's national team. The schedules for DAs can be problematic with the traditional American high school (lots of travel = lots of school missed), so the program was designed to be flexible with the players while they travel. The staff is very small, only 6 people, and we all work within the same room; one large classroom with desks for staff as well as the students. We do work under a major club here in the U.S., so we have to dress some semblance of professional when we come to work. It's also important to note that, aside from the program director, I am the only woman on staff.\n\n&#x200B;\n\nI started the job last summer,  so there was no students around. One day, one coworker made a comment about high heels. This is roughly how our subsequent exchange went: \n\nCoworker (C): (something like he saw something somewhere about heels being bad, I can't remember exactly) \n\nMe: \"Oh, yeah, high heels can actually be terrible for you. Your feet are usually at a really weird angle, and it can cause leg joint/back issues, or aggravate any preexisting issues. I have issues with my knee, hip, and back from playing soccer, so I have to space out when I wear heels, cause it can sometimes put me in a decent amount of pain.\"\n\nC: \"But... how can you dress professionally without wearing heels...?\"\n\nMe: (I turn around and look at another coworker, whose desk is on the other side of mine, wondering if the dude is serious, he just looks back at me like he has no idea what to say) \"Uh, you know flats exist right?\"\n\nAfter this, he just kinda looked at me like he was beyond confused; he also told me he didn't think any flats out there were considered professional. This guy literally had no idea that women can dress professionally without wearing heels. I told my other two coworkers who weren't in the room at the time (I don't chat casually with our director much, since she has her own office) about it, and they were both dumbfounded. \n\n&#x200B;\n\n**I obviously don't mean to bash the guy with no opportunity to defend himself**, but it just blew my mind a bit to find out that ideal/belief is still out there. He has since left to work at a different school, and a coworker and I have turned it into an inside joke that we use any time we have to dress nicer than normal, but it still baffles me today. \n\nHas anyone else encountered something like this?",
    "title": "High heels = Professional?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1546900591,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Scrubs or Professional clothes ? I am an attending physician, hospitalist. In my hospital, almost all of the medical specialty docs wear professional clothes and most of the surgical specialty / ER docs wear scrubs. In addition to that, almost anyone else who works in my hospital, is in scrubs. However, all of my colleagues wear professional clothes - you know, pant-shirt, blouse-skirts etc. I do that too, but I like to wear scrubs. Now, my director (leader of the hospitalist program, aka, my boss) is a 40-ish female physician and feels STRONGLY against scrubs. She says that you are not a moonlighter or a resident and shouldn't wear scrubs, and in extreme cases, if you have to, please wear a white coat on top of it. Everytime she sees me wearing scrubs, she shows such genuine surprise and remarks about it. Kind of unnerving.\n\n&#x200B;\n\nNow here is what I think about scrubs :-\n\n\\- they are super comfortable\n\n\\- its a hassle to make sure clothes are clean, ironed and ready, every morning, especially with a 7 am - 7 pm schedule, not to mention the pain to mix and match styles and colors\n\n\\- they are super professional for the type of work I do , FFS, I am not wearing a bikini thong while seeing a patient\n\n\\- they are issued by the hospital, if it was so wrong, the hospital would just stop issuing scrubs to me\n\n\\- I dont see a point walking into an infection with my $100-200 worth of professional clothes\n\n\\- almost ALL other countries, anyone who works in a hospital, is MANDATED to wear scrubs (aka hospital supplied clothes), I dont understand the American obsession of dressing up like a car salesman\n\n\\- my job is 100% clinical ( well 20% clinical and 80% computer typing), I dont have ANY managerial or administrative duties and its 100 % inpatient. I am dressing for the job\n\n\\- I tried to look up my hospital official policies, but so far, no luck. I guess we are just expected to dress up professionally.\n\n&#x200B;\n\nI want to know how to deal with the situation. I have expressed my desire to wear scrubs multiple times, but she just doesnt get it. In the back of my mind, I want to say that unless you tell me I will be fired or disciplined for wearing scrubs, I will continue to wear them, But honestly I would never want it to escalate it to this level.\n\n&#x200B;\n\nSo, what should i do ?\n\nShould i talk to the director ?\n\nShould I just give up and start dressing up like a car salesman ?\n\nIs there a middle ground ?\n\n&#x200B;\n\nEdit : I am a guy, I dont know how a few commenters assumed that i am a woman. \n\n&#x200B;",
    "title": "Scrubs or Professional clothes ?",
    "subreddit": "medicine",
    "timestamp": 1553524591,
    "score": 338,
    "keyword": "american director"
  },
  {
    "text": "AMA: We are the Asclepius Snakebite Foundation (ASF), a team of snakebite experts working to address the global snakebite crisis and provide you with the right information to manage these patients. Ask us anything! **This AMA is over. Thanks for coming by!**\n\nHello everyone! Snakebite season is upon us again so it seemed like a great opportunity to set up another AMA for the reddit medical community on an unusual topic that tends to generate a lot of interest.\n\nWe are the [Asclepius Snakebite Foundation (ASF)](http://www.snakebitefoundation.org), an international 501(c)3 non-profit organization led by many of the world experts in snakebite medicine that is dedicated to reducing the more than 138,000 deaths and 500,000 permanent disabilities caused by snakebite envenoming worldwide every year. We travel to the regions with the highest number of envenomations and work alongside local partners to save lives and limbs through a combination of research, treatment, and training. We have brought a few of our medical specialists here to answer any questions about snakes, snakebites, snakebite treatment, antivenoms, venoms, or whatever else comes up. We are here dispel some of the pervasive myths/misconceptions about snakebites and provide you with the right information about what to actually do for these patients, so ask us anything that interests you about the topic and we will do our best to give you a good answer.\n\nSince we all work shifts and assume many of you do as well, this AMA will run for 36 hours or so and three of our medical experts will be available to answer questions during that time:\n\n* Jordan Benjamin is a herpetologist, snakebite researcher, and wilderness paramedic with over 10 years of experience wrangling venomous snakes and treating snakebite patients in remote health centers and villages throughout sub-Saharan Africa. He is one of the leading experts on assessment, diagnosis, treatment, and prolonged field care of snakebites and other envenomations in remote and austere environments. Jordan is the founder of ASF and will be answering as u/snakebitefoundation\n* Dr. Ben Abo is an emergency medicine & EMS physician, paramedic, clinical assistant professor of emergency medicine at the University of Florida, and the medical director of the elite Venom One and Venom Two response teams of Miami-Dade Fire Rescue and Lake County Fire Rescue. These teams make up the only national-level antivenom bank in the United States. He is widely known for his [fabulous hair](https://www.medscape.com/viewarticle/910583), which some believe give him special powers such as the ability to [jump in front of a speeding train to pull a seizing patient off the subway tracks in NYC](https://nypost.com/2013/06/21/miami-doctor-a-lifesaver-after-pulling-man-suffering-seizure-from-village-trains-path/).  Ben is a co-founder of ASF and will be answering questions as u/venom1doc\n* Dr. Nick Brandehoff is an emergency medicine physician, medical toxicologist, and assistant clinical professor of the department of emergency medicine and division of toxicology at the University of California San Francisco-Fresno program. Nick completed his tox fellowship at the Rocky Mountain Poison and Drug Center and has extensive experience in both the laboratory  and clinical management sides of the venom world, and he leads the envenomation working group for the American Academy of Clinical Toxicology. Nick is a co-founder of ASF and will be answering questions as u/ToxDoc10\n\nThe three of us will be in Guinea next month to set up a rural snakebite clinic and launch a big study into neurotoxic snakebites by African cobras and mambas, which should be a blast! If you want to learn more about our team you can [check out the bio page on our website](https://www.snakebitefoundation.org/teamsnakebite).\n\nOnce again, we aren't selling anything and don’t have a specific agenda other than raising awareness for the snakebite crisis worldwide and educating people about snakes and snakebites. We are looking forward to talking with all of you!\n\n&#x200B;\n\nSincerely,\n\nTeam Snakebite\n\n&#x200B;\n\nPS - to kick things off, we highly recommend you [read this article we wrote about what to do if you are bitten by a snake in the middle of nowhere far from medical care](https://www.snakebitefoundation.org/blog/2018/9/6/how-to-survive-a-snakebite-in-the-wilderness) as this is one of the questions that always comes up first!\n\nPPS - follow us on twitter for updates on what we are doing [@Snakebite\\_911](https://twitter.com/Snakebite_911)\n\nhttps://i.redd.it/mei2hgxruc631.png",
    "title": "AMA: We are the Asclepius Snakebite Foundation (ASF), a team of snakebite experts working to address the global snakebite crisis and provide you with the right information to manage these patients. Ask us anything!",
    "subreddit": "medicine",
    "timestamp": 1561405842,
    "score": 92,
    "keyword": "american director"
  },
  {
    "text": "Opportunities for Teachers to Leave the Classroom I have noticed that many teachers create posts that state that they want to leave the classroom. In these posts, the teachers ask for help and advice from individuals in this sub for where new career opportunities can be found. These posts either receive no replies or vague answers such as \"many companies want former teachers in their HR departments. Good luck!\". The most insulting replies to these posts are the examples of former teachers who talk about how happy they are in their new careers without providing any information about their new careers; almost as a way of ensuring that their secret is protected so that other teachers continue to suffer in the classroom. To further insult teachers who want to leave the classroom, some users even (seriously?) recommend teachers to work in museums or at summer camps. Yeah...a teacher who makes $40,000 per year is going to work at a summer camp that pays minimum wage or in a museum that pays closer to $22,000 per year. It is despicable, ridiculous, rude, and borderline absurd to respond to in such a way to a teacher who wants to leave the classroom. As a current district administrator, I am embarrassed by most of the users in this sub who refuse to help the teachers who want to leave the classroom. I know from first hand experience that the worst districts are districts where teachers continue to teach who believe that there is no other way out of the classroom. To some of you in this sub, I realize that you think others should suffer in the classroom since you are currently suffering, but you need to end your gate-keeping elitism and help others who need a way out of the classroom. For these individuals, does it bother you that you feel as if you are stuck in a classroom while other teachers leave the profession to pursue career opportunities more in line with what they want out of life? You should be ashamed, and you should know that you are the type of person who I would never allow to teach in my own school district. This is the type of attitude that we need to eliminate in our already frail public education system.\n\n&#x200B;\n\nThis post is intended to help teachers who want to leave the classroom. I want to provide SPECIFIC careers that teachers can explore so that they can leave the classroom and find happiness in other education related fields. I encourage the high quality educators in this sub to reply with other REALISTIC job opportunities for teachers who want to leave the classroom.\n\n&#x200B;\n\n\\- State Department of Education: A department of education for a particular state typically contains hundreds of different jobs for teachers who want to work directly with the state's commissioner of education to improve education in the state. Although you may not be qualified for each and every job, some of these positions are associated with curriculum and design, assessment, and/or administration. Please check your state's department of education website to be on the look out for possible job opportunities.\n\n&#x200B;\n\n\\- Teacher Union: Almost all states and school districts are associated with an official teacher union or teacher association that functions as a union. Please be on the look out for job postings for your state's teacher union or the National Education Association.\n\n&#x200B;\n\n\\- Assessment Development: Harcourt Educational Measurement, CTB McGraw-Hill, Riverside Publishing (a Houghton Mifflin company), NCS Pearson, The Educational Testing Service, The College Board, American Institutes of Research, Albert.io are always looking for individuals to develop curriculum or write assessment questions for different testing programs. If you are interested in standardized testing, please check out the homepage for each listed company to determine if there is a job opening for you.\n\n&#x200B;\n\n\\- Professional Development Companies: The National Mathematics and Science Initiative (NMSI), Kagan Publishing, The College Board, and other professional development companies are always looking for individuals to lead seminars and training sessions across the nation. Why not look into becoming a professional development designing or trainer so that you may travel the world?\n\n&#x200B;\n\n\\- Adjunct Teaching: Although the fiscal compensation is not quite as good as being a classroom teacher, you can still live comfortably if you can teach 5-6 classes each semester. Based on my experience and the experience of my colleagues, teaching college is much easier than teaching in the classroom.\n\n&#x200B;\n\n\\- Policy Development: Your state government and the federal government are always on the lookout for individuals who are interested in developing or promoting particular educational policies. Does this mean that you may have to become a lobbyist? Yes. However, it could still be a fun job without the challenges of dealing with unruly 9th graders.\n\n&#x200B;\n\n\\- Science Equipment Companies: PASCO, Vernier, Flinn Scientific, and similar science equipment providers love for former science educators to join their teams to conduct training sessions, create videos, and/or provide support to teachers who have questions about different devices that can be used to collect scientific data. Why not see what these companies have to offer?\n\n&#x200B;\n\n\\- Local 4-H Directors: This may not initially seem to be a part of a traditional career trajectory in the field of education, but I have family members who have left the classroom to become directors of local 4-H organizations. They currently make at or above the amount of money that teachers make in my district, and they really do seem to enjoy their jobs.\n\n&#x200B;\n\nAs I think of more job opportunities, I will add the information to the already existing list. However, for now, this main post should provide a great jumping off point for teachers who want to explore different avenues outside of the classroom. I continue to remain bewildered that I even had to create this post due to the fact that most users in this sub, up to this point, have been very unhelpful to teachers who want to leave the profession.",
    "title": "Opportunities for Teachers to Leave the Classroom",
    "subreddit": "Teachers",
    "timestamp": 1561403842,
    "score": 1258,
    "keyword": "american director"
  },
  {
    "text": "The Burden of Being an Unmarried, Childless Teacher in 2019 America I’ve been teaching for eleven years. I absolutely love it. I’ve taught in three different districts with three very different types of students and families. I currently teach in a school in a small town in the American Midwest. We’re one of only two schools in the county.  Because of this, we have this weird small-town mentality, but with mid-size numbers. We should have a curriculum director,  but a principal can do it. We should have an assistant principal at the elementary level, but why when they’re just little kids? There is so much pressure on everyone all the time to do all the things. But more pressure is put on those of us who don’t have children. \n\nOP, why are you stressed, it’s not like you have children at home. OP, can’t you stay and do this duty? Do you want to run to the store after school for x, y, and z, my kid has dance. Why do you care if the meeting ends on time, you’re just going to go home to your cats. You’re not tired you don’t even have kids. OP, you’re really hard to get ahold of over the summer I had some things I wanted to discuss with you. I studiously avoided phone calls, texts and emails from my admin because I’m off contract during summer and anything they needed to talk to me about could wait until August. \n\nYes. I’m going home to my cats-unashamedly. I’m going to binge watch my show this evening because I don’t have to take a kid to dance. Yes, I traveled around the country this summer. Is my time not as valuable because I don’t have small humans of my own to take care of at this point in my life?  I’ve been in a long-distance relationship for over a year-but to them I’m single since I don’t have to take his dinner out to him in the field. \n\nThe guilt put on us by this district is unreal. Because I’ve taught for eleven years I’ve learned to say no, but the guilt is still there a tiny little bit. I’m getting really good at ignoring it, but it’s still really frustrating to hear those things. I’m stubborn and I don’t do things I don’t want to do, but it’s hearing those things that just sends me through the roof.  \n\nI guess I just want them to respect my time and life choices just as much as I respect theirs.\n\nEdit to add: I’m not against having children and do want them some day. I’m just annoyed with the overall attitude towards those of us who don’t have them in my school system.",
    "title": "The Burden of Being an Unmarried, Childless Teacher in 2019 America",
    "subreddit": "Teachers",
    "timestamp": 1576213390,
    "score": 146,
    "keyword": "american director"
  },
  {
    "text": "I filed a grievance report; admin told me to “not be so uptight” Update: I talked to the district the school is umbrellaed under, and nothing can be done that is not fiscally involved.\n\nSo, my next move is to go with a legal intervention. Still working out the kinks, but after ANOTHER call-out about my pregnancy in front of the ENTIRE teaching staff, I’m done and I don’t care about my employment. I can’t teach and be discriminated against. \n\nThanks for all the comments. \n\nOriginal:\n\nOk, I’m braving this because I just read another post about admin so here goes:\n\nI felt particularly targeted after kicking a student out of my class (who, by the way, isn’t even on my roster) for saying he “hates Americans” (btw, he’s a white American) then got on his knees to apologize in an accent. I knew he was making a scene so I kicked him out.\n\nMy admin had an office staff member and a counselor interview me a total of three times TWO WEEKS after the incident. Also, I had to be in a meeting with the student with another staff member present to mediated the conversation. (I’m a 5’3” petite female and the 17 year old male student is 6’2”). \n\nSo, pissed off at all this attention, I contacted one of the administrators who asked for me to be interviewed and she blew me off, saying I “traumatized” the student with my “hostility”. \n\nThen, I filed a grievance report, stating the unfair treatment I have had when the same student has been freed of any consequences for insulting and belittling me in front of other students. \n\nFor my follow up, my HR representative and Director of the school spoke to me for two hours, saying I was petty for filing the report, staff and students don’t like me, and I’m being “inappropriate” and “too uptight”.  They also blamed my age and my pregnancy (currently 10 weeks; I announced it early on) for my “heightened sensitivity”. For the student, they said he won’t be punished and that I was the one in trouble for causing him stress. They even threatened my job if I don’t “ease up”. (At-will employment at a charter school).\n\nA few coworkers came up and gave me encouraging words, but there’s got to be some next step, like going to the district, for that kind of treatment. Honestly, I’m at a loss of words. Just wanted to throw all that out there.\n\nEdit: I’m not unionized.",
    "title": "I filed a grievance report; admin told me to “not be so uptight”",
    "subreddit": "Teachers",
    "timestamp": 1572568534,
    "score": 11,
    "keyword": "american director"
  },
  {
    "text": "Autobiography of An American Teacher I've gotten a lot of messages from people interested in DoDEA because I had mentioned I was a DoDEA teacher and that I'd be happy to offer advice about the system. It seemed like the dream job at the time. I got to live overseas and have my house paid for. Well I realized that while DoDEA may still be a good option for some teachers, the system is fundamentally flawed and run by corrupt administrators. There are good principals who squeak by as some of my friends will mention that they've had good principals. I, myself, had enjoyed working with the first principal I had while student teaching with DoDEA. I even liked working with this last set of administrators, but once they realized that I would have the audacity to show video evidence and academic research to them, along with my own personal reasons for having a horse shoe seating arrangement, they began their retaliation. It continued on and on, until finally they terminated me. I've had dozens of students and parents message me trying to figure out what happened and apparently they told my students that I quit. They've also left me stranded in the country and refused to pay for my flight home or to ship my belongings. They also cut off my rent payments, so I am paying for this house and everything else out of pocket, while not receiving a salary. I thought my situation was bad, but then I heard far worse horror stories than mine as DoDEA teachers from around the world began to private message me. I heard from one teacher about a union representative who after being given power of attorney, had stolen items from this teacher. Another teacher told me she was terminated after they found out she had terminal cancer, leaving her without pay or health insurance. Another teacher told me she was falsely accused of child molestation to silence her and nothing was found on her after the investigation. Another was falsely accused of child abuse.  I've heard from multiple teachers who were a few months before retirement and then the school looked for a technicality to terminate them. I've heard from someone who works at HQ that when she spoke out, they began retaliating against her as well. The stress was so bad that she had an actual hole in her stomach due to the stress. I've also heard of multiple other teachers being hospitalized due to stress.\n\n&#x200B;\n\nI used to think micromanagement and wasteful spending were some of the worst problems in education, but I've realized there is far worse. I won't post the link here because I don't want to get in trouble for advertising something, but I would highly encourage you to read \"Autobiography of an American Teacher\" by D.J. Wright. Someone told me about her book after I first started having my own issues. She's a current teacher for the same school system, but she fears she'll be terminated soon as a form of retaliation. But termination would hardly be the worst form of retaliation she's received since she's been literally forced to teach in a classroom leaking chemical fumes, that caused her and her students to vomit blood. If I had read her story prior to my own experience, I might not believe she was telling the truth. But after seeing how low some of these administrators will stoop and also after finding out that the director of DoDEA once bankrupted Providence Rhode Island Schools and then fired all 1,926 teachers simultaneously, it became hard not to believe her. We're expected to save drowning children while we are gagged, and have our feet and hands bound. I can no longer take any advice in education seriously if the root problems are not solved first. D.J.'s book \"Autobiography of an American Teacher\" does not have many reviews at the moment, but I hope to get her book better known. She apparently published it just this past fall, but I had only heard of it this April. These problems are huge and the administrators have been too good at silencing us. I know a lot of the teachers in this subreddit have their own horror stories, so I'd hope they would give her book a shot and alert others of the reality of not only what's going on in DoDEA, but American education in general. Scratch that, education globally, since I've heard these issues extend far beyond American education.",
    "title": "Autobiography of An American Teacher",
    "subreddit": "Teachers",
    "timestamp": 1556814831,
    "score": 3,
    "keyword": "american director"
  },
  {
    "text": "Working at an independent school seems awesome. Am I missing something? Hi reddit,\n\n&#x200B;\n\nI just graduated from high school a couple of months ago. I've always been the kind of kid who has his \"head in the clouds,\" in terms of the future. During school I was too busy learning, playing sports, applying to colleges and socializing to develop a clear answer to the universal question, \"so what do you want to *be*?*\"* I fantasized about a million ideas ranging from being an asteroid-mining entrepreneur turned altruistic politician to starting my own clothing company.\n\n Anyway, growing up I -- unlike my parents -- never worried about my career. In the back of my mind, I had a solid, comfortable backup plan: work at the school I went to or a similar place. For context, I went to a small independent prep school that was good but not famous (i.e a fairly typical country day school).\n\nMost of my parents' friends are doctors. They went to school for 10+ years, have only 2 or 3 weeks of vacation a year, work long hours doing very high-stress work and have to spend a fortune if they'd like to send their kids to a private school. It seems like the other professionals I know (engineers, lawyers, sales people, etc.) either have tenuous job security or do incredibly boring, unfulfilling work. \n\n&#x200B;\n\nOn the other hand, from my perspective, my teachers -- even though they sometimes seemed burned out -- have a *great* lifestyle compared to other adults I know. First off, they have life-long job security. I hear about layoffs in engineering and the corporate world but I don't think any teacher at my school has been let go barring a scandal. Some faculty leave for a different school or switch to a non-classroom position (e.g admissions or administration) but they universally stay in independent education for decades. Their school-age kids come to campus with them and, I believe, have highly subsidized (if not free) tuition, something which would otherwise cost 30-40k. They have long vacations, eat nice food for free in the dining hall and can have further education funded by the school. We have a small dorm and the faculty dorm parents get free accommodation. Many of my teachers, though sometimes frustrated by the demands of the job and mundane duties, overall seemed happy and intellectually stimulated.\n\n&#x200B;\n\nI totally acknowledge that the job is really hard work and I respect all that my teachers did. They spent hours grading, meeting with students, dealing with disciplinary cases, driving to sports games, etc. A teacher once pointed out that, while we relished a post-junior year rafting trip, for the chaperones it was real work that meant organizing the trip and spending time away from family. Point taken. I also understand that the salaries are much lower than other jobs. Glassdoor lists a 60k salary which -- to my 18 yr old mind -- seems pretty good considering the free tuition/childcare, free food and paid vacation. Through pro-publica's non-profit explorer, I looked at my school and other similar schools: most of the senior staff (assistant head of school, director of admission, director of athletics, director of upper school) were paid about 150k. The headmaster salaries were usually in the 300-500k range (not to mention a free house), although getting to that point is obviously difficult. \n\n&#x200B;\n\n On balance working at an independent school seems like a great option. The faculty get exposure to academics, sports and clubs, have a community, and are somewhat cocooned from the off-campus world. Is there a huge catch I'm missing? Are the jobs impossible to get? Am I just naive?\n\nP.S: I know most American schools are not small private prep schools and that teachers at other types of schools may face totally different circumstances.",
    "title": "Working at an independent school seems awesome. Am I missing something?",
    "subreddit": "Teachers",
    "timestamp": 1565370616,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S. Hey all! I’m a producer for Empowered Health, a new podcast that is aiming to demystify women’s health.\n\nWe just put out the first episode of our two-part series on the maternal mortality crisis. Episode one explores how race plays a role in this crisis– it becomes clear our culture isn't doing enough to protect black mothers. Black women are three to four times more likely than non-Hispanic white women to die during childbirth. That’s even after adjusting for socioeconomic factors, like education and income.\n\nAs more than one researcher said to us, the birthing crisis is the canary in the coal mine of women's health. It is a problem of women not being listened to, not being respected and being disempowered during a time in life when they should feel entitled to good care and a personal feeling of empowerment, feeling full of feminine power and purpose.\n\nDr. Neel Shah, the director of the Delivery Decisions Initiative at Ariadne Labs, breaks down how medical students are trained to be biased and how that contributes to this problem. Fatima Dainkeh of YWCABoston helps us understand actually talking to black mothers is a good place to start and that a day-long workshop on bias isn't going to cut it. Midwife Ebony Marcelle shares how she's shaped her care model to better serve African American mothers. And, Dr. Mary-Ann Etiebet, the executive director of Merck for Mothers, looks at the global initiative she heads working to integrating the voices of black women into maternal mortality and morbidity.  \nFigured this group might be interested in this episode, here's the link:  \n\n[https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392](https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392)\n\n(links to other streaming platforms on our website www.empoweredhealthshow.com)",
    "title": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S.",
    "subreddit": "blackladies",
    "timestamp": 1555987676,
    "score": 31,
    "keyword": "american director"
  },
  {
    "text": "'Edge Of Tomorrow 2': Asian American organization asks director Doug Liman not to whitewash sequel",
    "title": "'Edge Of Tomorrow 2': Asian American organization asks director Doug Liman not to whitewash sequel",
    "subreddit": "asianamerican",
    "timestamp": 1569585529,
    "score": 110,
    "keyword": "american director"
  },
  {
    "text": "Anybody ever felt the fear of being stereotyped? I was browsing through New York Times yesterday and I came across this [article](https://www.nytimes.com/2019/03/17/us/college-admissions-students.html). Karen Ge's experience especially rang a bell within me. \n\nIt reminded me of my own experience of being an Asian-American violinist, even though I wasn't as accomplished as Ge was with math.  Music has always been my passion and a core part of my identity, but yet at the same time, I grappled with insecurities. On one hand, I feared that I wasn't good enough (common concern among all musicians), and on the other hand, I feared about getting stereotyped. I worried about being viewed as the typical Asian nerd who plays the violin, coming off as emotionless and passive. I worried about my parents being perceived as aggressive \"tiger parents\" who mercilessly forced their daughter (which they never did)\n\nWhen I visited a college in Minnesota for a music audition last year, I felt internal pressure not to appear too nervous so I don't accidentally come off as that robotic asian being flanked by her tiger parents. I smiled and chatted with the music directors, act super friendly and interested, trying to wash away my uneasiness. \n\nAnybody else went through something similar?",
    "title": "Anybody ever felt the fear of being stereotyped?",
    "subreddit": "asianamerican",
    "timestamp": 1552969626,
    "score": 33,
    "keyword": "american director"
  },
  {
    "text": "Chinese-American director Wayne Wang talks about his latest film focusing on Korean-American family",
    "title": "Chinese-American director Wayne Wang talks about his latest film focusing on Korean-American family",
    "subreddit": "asianamerican",
    "timestamp": 1571054874,
    "score": 29,
    "keyword": "american director"
  },
  {
    "text": "Korean-American director Kogonada on the town that inspired his debut feature (starring John Cho) and the need for more Asian-American male leads",
    "title": "Korean-American director Kogonada on the town that inspired his debut feature (starring John Cho) and the need for more Asian-American male leads",
    "subreddit": "asianamerican",
    "timestamp": 1562636823,
    "score": 16,
    "keyword": "american director"
  },
  {
    "text": "Director dreams of day films aren’t labelled Asian-American",
    "title": "Director dreams of day films aren’t labelled Asian-American",
    "subreddit": "asianamerican",
    "timestamp": 1564749889,
    "score": 14,
    "keyword": "american director"
  },
  {
    "text": "Maui-born director to spearhead the first Boba-American entry into the Marvel Bobamatic Universe",
    "title": "Maui-born director to spearhead the first Boba-American entry into the Marvel Bobamatic Universe",
    "subreddit": "asianamerican",
    "timestamp": 1554137353,
    "score": 6,
    "keyword": "american director"
  },
  {
    "text": "Interview: KEFF | (New Bloom editor Brian Hioe interviewed KEFF, a Taiwanese-American writer, director, musician, and artist, on his recent film The Secret Lives of Asians at Night)",
    "title": "Interview: KEFF | (New Bloom editor Brian Hioe interviewed KEFF, a Taiwanese-American writer, director, musician, and artist, on his recent film The Secret Lives of Asians at Night)",
    "subreddit": "asianamerican",
    "timestamp": 1576346321,
    "score": 3,
    "keyword": "american director"
  },
  {
    "text": "99 Days to First-Ever Asian American Feature VR Experience & Theatrical Release – November 15, 2019 **Maybe pioneer in VR rather than kill ourselves trying to get into Hollywood?**\n\n***Brooklyn — August 8, 2019 —*** The first Asian American feature-length VR experience, XIMBI XOMBIX releases globally in theaters and the VR Web on November 15th, 2019, along with the “XXX” soundtrack album.\n\nSays  director Sand O’Man, the self-proclaimed American Ozu of VR, “As the money humans chase conventional strategies of ultra-expensive quality, cgi and star-power, the people hunger for live-action adult stories using the new immersive technology, which is more akin to real-time theater, a medium since even ancient times.”\n\n**Domestic & International Acclaim**  \nDrawing  on post-colonial themes and the raw edges of grunge, K-pop and reggae, Sand O’Man presents a rugged social commentary on the smart stupidity of popular culture, blending digital formats from 8K to 720p, including rarely seen 360º angles. After picking up awards at international film festivals in Europe, *Ximbi XombiX* returns to release on American soil at commercial cinema’s global epicenter, Los Angeles. Hoffstot Sound & Pictures has decided for the web version to be exclusively VR, available worldwide.\n\n*Ximbi XombiX*  grew grassroots credibility via its Kickstarter campaign as a Staff  Pick in 2015, launched along with the demo soundtrack album ‘Simbi\\_Xombiez!’ Of the movie, “I appreciated all moments and scenes for different reasons,” said one enthusiastic audience member attending KAFFNY’s theatrical premiere at Brooklyn’s Made in NY Media Center.\n\n***Ximbi XombiX*** **Availability**  \nA special theatrical version of the movie shall release at the intersection of independent, studio & foreign cinema, Laemmle Music Hall theater in Beverly Hills, Los Angeles. Audiences shall receive a Special Gift. Limited Edition T-shirts, VR Head-Mounted Displays (HMDs), Movie&Music Thumbdrives shall be available for purchase, with discounted rates for audiences, mailing list subscribers, and ÜR Key members.\n\nThe VR experience releases on the worldwide Web for free download, day & date of the theatrical run, by tapping into Über Reality® at [www.URtheater.com](http://www.urtheater.com/). ÜR Key member exclusives are available with purchase of “XXX” soundtrack album or Sand O’Man fan badge on ujomusic.com, using only Ethereum, also releasing November 15.\n\n**Trailer & Soundtrack:**  \n[www.URtheater.com](http://www.urtheater.com/)\n\n**Tickets:**  \n[www.Laemmle.com](http://www.laemmle.com/)",
    "title": "99 Days to First-Ever Asian American Feature VR Experience & Theatrical Release – November 15, 2019",
    "subreddit": "asianamerican",
    "timestamp": 1565286474,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "Rutgers Releases Comprehensive Report on How Cultural Factors Affect Chinese Americans' Health *Rutgers researchers publish 17 studies on elder abuse, cognitive function, psychological well-being, social relationships, and health behaviors among more than 3,000 Chinese Americans aged 60 and older*\n\nSince 2011, the Population Study of Chinese Elderly in Chicago (PINE), the most extensive epidemiological cohort study of Chinese older adults in the United States, has revealed critical health disparities among the growing Chinese American population. \n\nIn the current issue of the *Journal of the American Geriatrics Society(JAGS)*,[17 new research papers](https://onlinelibrary.wiley.com/toc/15325415/2019/67/S3)from the PINE Study present an unprecedented exploration of cultural factors concerning Chinese Americans' health. The papers also draw data from the Filial Piety Study, a study of the PINE Study participants' adult children. The resulting research provides comprehensive, multigenerational insight into the lives of Chinese Americans.\n\n\"Despite the size and substantial growth of the Chinese American community, quality health data on this vulnerable population remains critically inadequate,\" said [XinQi Dong](http://ihhcpar.rutgers.edu/faculty_staff/xinqi-dong-md-mph/), director of [Rutgers University's Institute for Health, Health Care Policy and Aging Research](http://ihhcpar.rutgers.edu/)and the lead researcher of the PINE and PIETY studies. \"This collection of *JAGS*articles helps provide the context and understanding necessary to improve the health of Asian populations through education, research, advocacy, policy, and sustainable community engagement and promote greater health equity among all minority groups.\"  \n\nFor the PINE Study, researchers looked at more than 3,000 Chinese Americans aged 60 and older to better understand their current experiences, offer solutions for improving the research participation of minority older adults, and reduce health disparities. \n\nThe Filial Piety Study assessed the health and well-being of 548 PINE Study participants' adult children aged 21 and older. The study revealed widespread psychological and social stressors associated with the growing problems of caregiving distress and burden and intergenerational conflict among the Chinese American adult community.\n\n\"While preliminary research indicates marked disparities concerning Chinese Americans' health and well-being, numerous factors prevent quality research from being conducted and disseminated,” said Dong. Barriers to research include a reluctance by Chinese Americans to participate in federally-sponsored activities, linguistic and cultural barriers, a lack of federal funding, and the tendency of federal-level health researchers to aggregate data of diverse Asian groups under the same racial category. \n\nResearchers must also contend with the \"model minority\" myth – the perception that U.S. Asians are generally economically prosperous and healthy, and enjoy active social and familial relationships.\n\nThe articles — organized into the themes of data collection methods, elder abuse, cognitive function, psychological well-being, social relationships, and health behaviors — navigate the many challenges to studying this vulnerable population and address the insufficiency of health and wellness data.\n\nThe first article discusses methods of data collection, detailing how researchers used a custom web application to conduct in-person, native-language surveys of participants. The application not only helped overcome some of the barriers in health disparity research but also improved participation and retention.\n\nFour articles addressing elder abuse examine the risk factors and consequences of violence across the life course. The articles explain the link between elder abuse — psychological abuse, physical abuse, caregiver neglect, and financial exploitation — and\n\npoor physical and mental health, chronic pain, greater use of healthcare services, and increased risk of mortality among older Chinese Americans. \n\nFour articles that investigate cognitive function in the context of immigration, psychological distress, social engagement, and oral health are the first of their kind in the U.S. Chinese population. The articles emphasize the need for further study of this population’s cognitive function later in life.\n\nThree articles explore how the psychological well-being of Chinese older adults relates to physical health over time. The researchers establish a link between depressive symptoms and comorbid health conditions and demonstrate the need for emphasized screening for depression risk factors and the development of intervention strategies to proactively prevent the onset of disability.\n\nThree articles address older Chinese immigrants' social relationships, exploring the impact of family relationships on health and wellness, filial obligations and caregiving burdens, and social engagement. \n\nTwo articles analyze patterns of health behaviors among Chinese older adults to understand potential predictors and consequences of specific health behaviors.\n\n**Key findings**:\n\n* Abuse is prevalent in the Chinese American community, with 11.4% of study respondents reporting child abuse, 6.5% reporting intimate partner violence, and 15.2% reporting elder abuse.\n* Individuals with a history of child abuse were four times likelier to experience intimate partner violence and psychological elder abuse. \n* A history of psychological, intimate partner violence correlates with eight times the risk of re-experiencing psychological abuse as older adults.\n* Intimate partner violence was associated with five to eight times the risk for psychological elder abuse, six to nine times the risk for physical/sexual abuse, and three times the risk for financial exploitation.\n* Individuals with a history of childhood physical/sexual abuse experienced two times the risk of re-experiencing physical/sexual intimate partner violence. Those with a history of physical/sexual intimate partner violence faced nine times higher risks of re-experiencing physical/sexual elder abuse.\n* All subtypes of elder abuse were associated with a substantially increased risk of 1-, 3-, and 4-year mortality.  \n* 41.5% of Asian Americans reported not receiving annual oral health examinations, which links to decreased quality of life, depression, hypertension, poor cognition, and cognitive decline.\n* Approximately 50% and 54% of U.S. Chinese older adults experience various levels of functional disability and depressive symptoms, respectively.\n* Comorbid depression is associated with a six-fold higher likelihood of functional disability, a 70% increase in overall medical costs, and a 2.4-fold increase in mortality than those without depression.\n* More than 84% of Chinese American study participants had one or more chronic medical conditions, and more than 60% had two or more.\n* 25% of older Chinese men are current smokers compared with only 8.8% among the general US population aged 65 and older.\n\n\"A growth rate almost four times higher than that of the overall U.S. older adult population necessitates a thorough understanding of older Chinese Americans' health needs,\" said Dong. This research will help promote healthy aging adequately, prevent health disparities, and inform the development of culturally sensitive healthcare.\"\n\n**About Rutgers Institute for Health, Health Care Policy and Aging Research**  \n[Rutgers Institute for Health, Health Care Policy and Aging Research](http://ihhcpar.rutgers.edu/)advances health and well-being through meaningful, rigorous and impactful research in the critical areas of behavioral health, health services, health disparities, health policy, health economics, pharmacoepidemiology, and aging research. \n\nSince its 1985 founding, the Institute has become nationally renowned for interdisciplinary and translational research. The Institute's 57,000 square foot facilities are home to six members elected to the National Academy of Medicine and 150 members representing over 30 schools, institutes, and units with adjunct members from 29 national and international universities.",
    "title": "Rutgers Releases Comprehensive Report on How Cultural Factors Affect Chinese Americans' Health",
    "subreddit": "asianamerican",
    "timestamp": 1565624304,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "History of feminism the way they don't want us to know! This is the speech the Cambridge feminists did not want anyone to hear. Its Elizabeth Hobson's speech from the Justice 4 Men & Boys event yesterday. Published with her permission.\n\nHello and welcome to The History of Feminism, I want to make two disclosures before I begin: firstly, that this lecture will concentrate on the Western world – particularly the Anglosphere. I am not suggesting that, that’s where feminism’s boundaries reside or denying its existence elsewhere but it does start here and here is where my real expertise lie. And secondly: this may come as a surprise to you but I am not a feminist. I am an ex-feminist but after studying the movement, I struggle to see how any reasonable person could know what I now know and be anything other than opposed to it. I’d like to thank the powers that be at Cambridge University for refusing to bow to pressure from the mob and allowing these talks to go ahead and I’d like to condemn the emotional reasoning of those who would have stopped them. The purpose of further education is not to make people feel comfortable, it’s to challenge preconceived ideas and to build the capacity to meet challenging concepts head on and to grow from those experiences. Universities should be arenas wherein students build resilience, tolerance and dignity but increasingly activists are subverting these spaces to feed anxiety, black and white thinking and hysteria within their communities which is harmful to the search for truth that they should be engaged in – and harmful to the individuals that they claim to want to protect (including themselves). So, finally, thank you to everyone sitting here now: to those who’ve come in support of our work, those here out of curiosity, and especially to anyone who’s expecting to be offended, yet intending to engage because that shows some strength of character!   \n\nBefore I get stuck into the recorded history of feminism, I need to take a moment to illuminate the biological roots of the movement. Human beings are a gynocentric species – this means that we prioritize the needs and well-being of women over men. This is an evolved instinct that came about as a result of women being the limiting factor in reproduction – ie. women have a much lower ceiling on how many offspring they can physically produce – and in small communities that are subsisting this makes them highly important because they potentially hold the key to whether or not the collective will survive at all. This is why we traditionally send only men to war, this is why we have the “women and children first” Birkenhead Drill, this is why people are more likely to put themselves at risk to save a woman in danger than a man – and it’s why we have feminism. Feminism has taken our gynocentrism and weaponized it. \n\nMen’s role in this evolutionary sense is to act as a genetic filter – both to mitigate gene replication errors (ie. Preventing less successful combinations multiplying by barring many men from reproducing) and to produce and retain genetic recombinations that enhance the fitness of offspring. To these ends, male fitness is constantly policed to ensure that women’s standards are met before they gain sexual access – which is why far fewer men than women reproduce.  Because the pay-off of carrying particularly successful genes is so much greater for men (women will likely have the opportunity to reproduce if their fitness is moderate, men may well not), evolution gambles with male genes. This results in very different bell curves for men and women in terms of IQ and physical and psychological health, with men being over-represented at either end of the distribution (particularly intelligent/healthy or unintelligent/unhealthy) and women clustering around the middle. Feminists focus on the apex of male achievement to prove that men enjoy greater success than women (whilst ignoring the biological reasons that catapult a minority of men to the stratosphere) and on the acts of the most malevolent minority of men to generalize their patterns of behavior as emblematic of masculinity (whilst ignoring the fact that the very demographics that preoccupy them show that what is emblematic of masculinity is actually variability).  \n\nSo, human beings have always valued women more than men and been more critical of men than women. These were necessary instincts in tribal communities but they have been manipulated to privilege women to the point of dysfunction – and this began with the development of proto-feminism, which arose in the late Middle Ages. Queen consort of France and England, Eleanor of Acquitaine spearheaded a movement within her court to subvert the chivalric code (which had traditionally governed relations between knights and lords and the general public) to regulate the behavior of men towards women. These women initiated a system of romantic feudalism wherein noble men were under irresistible pressure to identify a lady as midons (my lord) and to submit to her will and delicately accept any scorn that his midons saw fit to extend to him. Eleanor established Courts of Love in which she and her noble women would administer “justice” in romantic disputes. Not only may many men in particular recognize this state of gender relations – but the modus operandi that Eleanor and co used to achieve their supremacy is entirely familiar: they generalised about all men based on the poor behaviour of a minority, asserting that women needed protection from men’s violations, and they pushed forward a narrative of women’s moral superiority, justifying female dictatorship. Within 200 years, Eleanors’ ideas had spread and saturated throughout Europe and throughout the class system. \n\nLa féminisme proper was born in the revolutionary France of the late eighteenth century – the political force first, the term around half a century later. In 1791, Olympe de Gouges published The Declaration of the Rights of Woman and the Female Citizen in response to the Declaration of the Rights of Man and of the Citizen. By publishing this document, de Gouges hoped to expose the limitations of the French Revolution in the recognition of women’s rights and to initiate changes in the Declaration of the Rights of Man to include sex equality. De Gouges opened her Declaration with the quote, \"Man, are you capable of being fair? A woman is asking: at least you will allow her that right. Tell me? What gave you the sovereign right to oppress my sex?\" [close quote]. In the preamble, de Gouges mirrors The Declaration of the Rights of Man, explaining that women, just as men, are guaranteed natural, inalienable, sacred rights - and that political institutions are instituted with the purpose of protecting these natural rights. She closes the preamble by declaring that \"the sex that is superior in beauty as it is in courage during the pains of childbirth recognizes and declares, in the presence and under the auspices of the Supreme Being, the following Rights of Woman and the Female Citizen.\" [close quote]. She was one of a small number of women beheaded for treason during the revolution. \n\nCharles Fourier is credited with having originated the word \"féminisme\" in 1837. A founder of utopian socialism and a slightly later supporter of women's rights, he believed that all jobs should be open on the basis of skill and aptitude rather than sex segregated and that traditional marriage could potentially hurt woman's rights as human beings, he himself never married. Fourier is believed to have influenced Karl Marx who argued as early as 1844, in his Economic and Philosophical Manuscripts, that women’s position in society could be used as a measure of the development of society as a whole. In The Communist Manifesto, Marx and Friedrich Engels celebrated the dissolution of the bourgeois family, with an erosion of the status of the father already taking effect as women entered the workforce. This, they believed, would lead to “a higher form of the family” in which women would be the true equals of men. Several years ago, at a FiLiA debate I heard Sheila Rowbotham explain that nobody could understand feminism without reading this book. International Women’s Day itself, has Bolshevik roots. Clara ‘The Grandmother of German Communism’ Zetkin and Rosa Luxemburg, at the Socialist Internationale in 1910, advocated for a Women’s Day but the date was not set in stone till 1921 when the USSR officially adopted March 8th which was selected to commemorate a specific date that led to the Russian Revolution. Specifically, a 1917 workers strike at a weapons factory in Petrograd. The women workers strike that modern feminists claim was the inspiration for International Women’s Day did not start until March 9th. \n\nMoving to the United States, in the pioneering Declaration of Sentiments from Seneca Falls in 1848 (generally taken as the seminal text of the first wave of feminism - though I would argue that it’s actually the second after de Gouges declaration) the claim was made that “The history of mankind is a history of repeated injuries and usurpations on the part of man toward woman, having in direct object the establishment of an absolute tyranny over her.” This is not justified by the history – of men risking their lives both in work and war to provide for and protect women, their families and their homes. Granted, the text highlights a series of injustices that women were subject to, however such a claim remains myopic and misleading. Under coverture legislation for example, while husbands did become the legal owner of all family assets, in reality, this came with responsibilities, and wives were not left entirely devoid of rights – their rights were simply different. Husbands could be criminalised for failure to keep their families as well as he could reasonably be expected, wives’ permission was required to sell any houses owned by the family – and actually if a member of a man’s household ran up debts, he was legally responsible for their repayment. Yes, women deserved to be granted various rights – but so did men, who did not deserve the derision they received from first wave feminists (including Christabel Pankhurst who notably explained in her 1913 book The Great Scourge, that men were “little more than carriers of venereal disease”). Furthermore, in his 1913 volume ‘The Fraud of Feminism’, Ernest Belfort Bax identified “two distinct sides” to feminism: an “articulate political and economic side embracing demands for so-called rights”, legitimately – and “a sentimental side which insists on an accentuation of privileges and immunities”. There is no mention in The Declaration of Sentiments (or any first wave texts) of the privileges and immunities enjoyed by women, nor any injustices faced by men.  \nThe women’s suffrage movement in the U.S. was tainted by racism. Although an African-American abolitionist, Frederick Douglas, did take to the stage at Seneca Falls – no African-American women are believed to have been present. Furthermore, feminist heroines like Elizabeth Cady Staton who organized the meeting at Seneca Falls and was a co-author of the declaration embraced her racism explicitly, characterising black men as inherently inclined towards rape, throughout her career. She also argued vehemently against the 15thAmendment (that would extend the vote to African-American men), claiming that it would degrade women to follow black men into the franchise.\n\nThe Women’s Social and Political Union – or Suffragettes – in the U.K. were not afflicted by racism. They actually took pride in the strength of support for women’s suffrage throughout the British Empire. The night before the coronation of George V in 1917, a demonstration was held to demand the right for women to vote, which featured an “Empire Pageant” featuring representatives from India, Australia, New Zealand, South Africa and the West Indies – and Indian Princess, Sophia Duleep Singh, was a major donor. They were not, however, devoid of bigotry – and I don’t just mean towards men – British Suffragettes held a special contempt for the working classes. Not only did they fail to rally behind the truly progressive call for universal suffrage, preferring to campaign for women to be able to vote “on the same terms as men” (ie. with property qualifications) but they embarked on a campaign of terrorism that may have hurt some middle and upper-class opponents (or insufficiently active supporters) financially but would put working class lives in both direct and indirect danger. They smashed shop windows and burned or bombed 17 industrial premises, including a lino factory, a laundry, woodyards and freight yards. They also targeted the café at Kew Gardens with an arson attack – destroying a business that was owned and staffed by women and destroying their livelihoods in a pre-Welfare State society. When the proprietor went to the WSPU to complain, she was told that she was taking ‘too personal a view of the matter’ and that the staff would no doubt be glad that they had lent support to the women’s cause.  96 homes were targeted. One was that of the Chancellor of the Exchequer, Lloyd George, which was empty under renovation. The bomb exploded just before his builders were due to start work so narrowly avoided injuring them, it did however destroy tools which were provided by the men themselves – who may well have ended up on the streets or in the workhouse as a result of their loss. Other houses – though the Suffragettes insisted that they only targeted them when empty – actually contained staff who were put at risk. Sulphuric acid and phosphorus in letter bombs caused a number of postmen to suffer severe lung damage and/or burns. A bomb planted outside the Bank of England would, if it had not been defused by a policeman, have gone off in a busy commercial area mid-afternoon. A bomb at Lime Street station, Liverpool, was packed with nuts and bolts to maximise harm. A bomb containing 24 cartridges of gunpowder was placed in the toilets of a theatre to go off during a matinee performance. The congregation at St John’s, Smith Square, had to put out a bomb containing 5½lb of gunpowder. Another bomb was chucked into a full Territorial Army barracks. The jockey whose horse ran over Emily Davison at Epsom in 1913 (Herbert Jones) suffered flashbacks to the event throughout his life until he committed suicide in 1951. The idea of these women as noble heroines is an outrage to any right-thinking person – and the idea that their terrorism led to the extension of the vote is implausible. They dropped their suffrage campaign entirely with the onset of WW1 (and a £20,000 grant from the government) and embarked upon their white feather campaign, for which they have further blood on their hands. Universal suffrage was won by quietly committed lobbying from the suffragist movement – and the sacrifice of so many working-class men in the war.\n\nTo understand the evolution of feminism from first to second wave, we need to look at the birth of critical theory. Critical theory emerged from the intellectual collective known as The Frankfurt School. They began their mission in 1923 with the establishment of the Institute for Social Research at the University of Frankfurt. Initially, founder Felix Weil and director Carl Grunberg, along with fellow orthodox Marxists, tasked themselves with making Marxism a viable alternative economic system to rival capitalism but from 1930 under, new director, Max Horkheimer the focus shifted to an examination of the culture out of which Capitalism flourishes, in order to subvert it to accommodate Marxism. Thus critical theory was established. The group moved its activities to the U.S. in 1933, in response to the rise of Hitler, to become associated with the University of Columbia in New York. Here, Erich Fromm pioneered the marriage of Marxist theory with Freudian theory and characterised the family (which they rightly identified as the building blocks of Capitalism) as repressive and pathological. Herbert Marcuse’s Eros and Civilization was published in 1955 in which a society based on free love and no work that liberated the human natures (that he felt were being repressed by Capitalist society) was proposed. This book was a major channel through which neo-Marxist ideas fed into various liberation movements in the 1960s, including of course feminism. Of feminism, Marcuse claimed that “the Women’s Liberation Movement is perhaps the most important and potentially the most radical political movement that we have.” Marcuse’s sentiments were echoed by Shulamith Firestone, founder of the Redstockings collective, who published The Dialectic of Sex in 1970, another utopian (or dystopian, depending on your perspective) radical classic that argued that the domination of men as a ‘sex-class’ over women as a ‘sex class’ (or “underclass”) was based in biology which needed to be overcome through advances in medical science that would liberate women from the “barbaric” practise of childbirth. She held the nuclear family, which she labelled a tyranny, in contempt and advocated for rationally constructed non-permanent bonding relationships between people who voluntarily undertook their upbringing in which “the dependence of the child on the mother (and vice versa) would give way to a greatly shortened dependence on a small group of others in general”. Kate Millet’s sister recollected a consciousness raising group that she attended with Kate in the New York of 1969 that opened with a back-and-forth recitation:\n\n“Why are we here today?”\n\n“To make revolution”\n\n“What kind of revolution?”\n\n“The Cultural revolution\" \n\n“And how do we make Cultural Revolution?”\n\n“By destroying the American family”\n\n“How do we destroy the family?”\n\n“By destroying the American Patriarch\"\n\n… it goes on, but you get the gist! Feminism became the leading vanguard in the subversion and desecration of a comparatively decent, prosperous civilisation. Their battle in this culture war was the decimation of the family and they would achieve victory in that battle by destroying men – a process they would enact by attrition of the esteem in which men were held, their identities and eventually their rights. \nA host of extreme misandrists poured forth bile during this period, thinkers like:  \n\n• Andrea Dworkin (“Under patriarchy, every woman’s son is her potential betrayer and also the inevitable rapist or exploiter of another woman.”),\n\n• Catherine Mackinnon (“Male sexuality is apparently activated by violence against women and expresses itself in violence against women to a significant extent.”),\n\n• Valerie Solanas (“to call a man an animal is to flatter him”),\n\n• Robin Morgan (“I feel that 'man-hating' is an honourable and viable political act”)\n\n•  Germaine Greer (“Men are the enemy”),\n\n• Shulamith Firestone (“all men are selfish, brutal and inconsiderate”) \n\nMarilyn French (“All men are rapists and that’s all they are”).\nHowever, I think it’s well worth looking at the more apparently benign representatives of the movement and unpicking what they had to say. In 1970, Irina Dunn coined the phrase “A woman needs a man like a fish needs a bicycle”, which was popularised later by Gloria Steinem. Referring to whom, I ask? To the countless generations of men who had endured the dirtiest, most dangerous and thankless labour to support their families? To their relatively recent male ancestors who fought for women’s suffrage (such as Jeremy Bentham and Henry Fawcett) and the elected representatives who would ensure such legislation passed (such as John Stuart Mill, whose male constituents elected him on a platform including female suffrage)? To their fathers who may well have participated in World War Two to protect their societies and families? To their brothers? Friends? Lovers? I believe Gloria Steinem had many of those – and was supported morally and financially by a number of them too. It may sound cute and catchy but it’s both contemptibly narcissistic nonsense and reprehensibly offensive.\n\nSecond wave feminism saw campaigns for equal pay which was realised in 1963 with The Equal Pay Act in the U.S. and in 1970 in the U.K. with our Equal Pay Act. It is, of course, entirely fair to legislate against malicious sex discrimination but, as we can see from the landmark case that led to Barbara Castle implementing the U.K.’s Equal Pay Act, the nature of the acts is far more expansive, responding not to simply the same jobs but to “work of an equal value”. The Ford Dagenham machinists strike in 1968 followed a re-grading exercise by Ford who classified sewing seat covers for cars (predominantly performed by women) as less skilled than jobs on the production line (largely done by men), resulting in a fifteen per cent pay disparity – and the court to which the case was referred found in Ford’s favour. There was no sex discrimination in this famous case, simply fair pay for different roles, but feminist activism continues to force the hands of employers not to make rational economic gradings but to ensure that men and women go home with increasingly similar pay packets regardless of relevant factors, and hey it has almost certainly led to less pay for Patriarchs, weakening their ability to provide for their families and putting stress on their relationships so it’s a win-win for feminism.\n\nSecond wave feminists also fought for access to contraceptive pills and abortions. The pill entered the U.S. market in 1960 but it wasn’t until 1972 there that it was made available to single women and, previously being at the discretion of individual medical practitioners in the U.K., it was incorporated into the National Health Service by Barbara Castle in 1974. This has led to far greater choice for women in terms of life paths, more sexual freedom and better physical health outcomes – and yet some have experienced a historically new pressure to be sexually active and a corresponding ennui in response to their sex lives, whether they believe they’re lacking or they fail to find meaning in casual sex. Abortion was legalized in 1967 in Scotland, England and Wales and found to be a constitutional right in 1973 in the U.S. There has always been a proportion of women who have killed their babies, bodies of new-borns believed to have been suffocated at birth have often been found behind Roman villas and prior to the act women turned to untrained practitioners who would administer folk-medicines or insert knitting needles into the womb through the cervix and obviously medicalised abortion up to a certain point is more humane for both the unborn child and the mother – and far safer for the latter. However, the callousness with which feminist activists typically have and still do approach the subject shows no concern for the sanctity of human life and precious little for the psychological well-being of the women who are told that expelling a “clump of cells” is a liberating act that will have no deleterious impact on her whatsoever (yet alone any sympathy for the men involved).\nA concerted struggle, on the part of radical feminists, began against pornography during the second wave. Feminist campaigners like Andrea Dworkin and Catherine Mackinnon joined forces with the religious right to raise concerns about trafficking and coercion in the industry and claimed that men’s consumption of porn led to increased risk of sexual assault and rape for women in free societies, as well as diminishing their capacity to be viewed as full human beings. In the U.S., several states enacted local ordinances that intended to treat porn as a violation of women’s civil rights and to allow women who believe they have been harmed by porn to seek damages in civil courts. The Dworkin-Mackinnon Ordinances were opposed as a threat to women’s freedoms by sex-positive feminists such as Camille Paglia and Wendy McElroy and were eventually shot down as violations of the First Amendment.\n\n The third wave of feminism emerged in the 1990s. It is characterised by intersectionality. Rebecca Walker, one of the founders, explained that “Feminism, in order to stay relevant, had to become about more than gender equality.” In an effort to be more inclusive, third wavers have embraced the grievances of – well, anyone who will identify straight white men as the problem. With literally no “rights” to be won, feminism became increasingly navel gazing – or more specifically a little lower – and obsessed over the minutiae of female existence in the modern Western world, finding oppression and abuse everywhere – from the make-up aisle to the bedroom. On university campuses posters were going up with the Ms. magazine study statistic that one in four college women was the victim of rape or attempted rape. This feminist lie was concocted by Dr Mary Koss who broadened the definition beyond any reasonable limit and in defiance of the 73% of her apparent “victims” who did not classify their experiences as rape. Take Back the Night Marches were growing, with participants chanting “2, 4, 6, 8, No More Date Rape” and giving emotional monologues about mistreatment at the hands of men. A moral panic was underway that still resonates darkly today. If Paglia, McElroy and their sex positive cohort thought that they had won the war for the hearts and minds of liberated young women in the 1980s, they were to be dramatically disproven just a decade later by an anxious and vulnerable generation of feminists. \nIn 1993, the Duluth Model was created in Duluth, Minnesota, founded by Ellen Pence (not, I believe related to Mike but certainly a good reason for his rule…). Used in all U.S. states (although recently seriously weakened by Donald Trump) as well as 17 other countries (including the U.K.), The Duluth Model is a gendered theory based on feminist beliefs. It contends that men’s violence towards women is based on a sense of entitlement arising from being part of the privileged ‘sex-class’ in a Patriarchy. Moreover, it expands the definition of domestic violence to include all manner of behaviours – from threatening to leave her or commit suicide to displaying weapons to making her feel guilty to making big decisions to giving her an allowance… It’s a mix of both clearly abusive behaviours and behaviours that exist in a very grey area that could conceivably be part of fairly healthy relationships. There is very little room left in Duluth Model theory or indeed the agencies that employ it for male victims of domestic violence, especially where it’s perpetrated by women, and it is a recognised phenomenon to see male victims end up in Duluth-inspired abuser intervention programmes that teach them that their masculinity is problematic. Erin Pizzey (founder of the first U.K. women’s shelter) describes the lead up to such instances using the acronym: DARVO. It stands for ‘Deny, Attack, and Reverse Victim and Offender’, she says that “A particular trait of women abusers when confronted with their behaviour, for example by the police, is to turn the tables on their victim by claiming to be the victim themselves.”… A police force informed by Duluth, of course, is inclined to believe her.\n\nAnd now a new wave of feminism appears to be quickening, with a schism between older third wavers and a new generation. Rene Denfield writes that current feminists “promote a new status for women: that of the victim” while Naomi Wolf laments that a substantial segment of modern feminism is devoted to victimhood. \n\nIn recent decades feminists have successfully promoted the idea of 'Believing the victim,' in cases of alleged violence, harassment or sexual misconduct against women - regardless of available evidence. In the words of Lena Dunham: “Things women don’t lie about: rape.” This subjective reasoning has led to campus rape trials in kangaroo courts across the U.S., Australia and Canada (they’ve been advocated for here in the U.K., but remain to be implemented, although the Varsity student newspaper informs me that they’re under serious consideration here at Cambridge now). They are governed by amateurs with inadequate legal training, who are given licence to assess innocence or guilt with a balance of probabilities standard of adjudication. With this trend we are witnessing a move away from the longstanding legal principle of ‘innocent till proven guilty’ and toward the dangerous principle of ‘guilty till proven innocent’ – paving the way for the systematic ruination of innocent lives. And the current state of affairs is not enough for some feminists who want to see men, not guilty till proven innocent but guilty upon accusation. Julie Lalonde, an “expert” brought into Ottawa University during the hysteria around a rape allegation (that proved false) to tackle the institutions “rape culture” believes that \"Every time we see a high-profile sexual assault trial result in an acquittal, it sends women back 50 years\" [end quote] and Emily Lindin tweeted that “I'm actually not at all concerned about innocent men losing their jobs over false sexual assault/harassment allegations.” \n\nUnder feminist Director of Public Prosecutions, Alison Saunders the U.K.’s Criminal Prosecution Service became embroiled in a scandal wherein targets set for rape and sexual assault prosecutions encouraged police forces to withhold exonerating evidence from courts. Innocent men were incarcerated, that’s a fact – and as a rule, their victimisers have retained anonymity and avoided their own well-deserved sentences for perjury.\n\nThe #MeToo movement has proven itself to be a malevolent witch-hunt, with a body count. A prime example of feminist aggression into the lives of non-feminist men and women who do not need feminism to dictate acceptable behaviour, at best it can only serve to diminish the romance, comedy and beauty (as well as some discomfort and tragedy) – in other words the colour – from our lives. As Camille Paglia pointed out, “Leaving sex to the feminists is like letting your dog vacation at the taxidermist.” At worst it serves to destroy men (professionally, personally, legally, or even totally). In August 2018, Brendan O’Neil counted four suicides as a result of #MeToo allegations – Benny Frederickson, head of a Stockholm arts centre, Carl Sargeant and an unnamed Labour party activist and Jill Messick, a movie producer, who killed herself as a result of harassment she received for defending Harvey Weinstein. Since then I have counted another four: Swaroop Raj, a Noida technician from India, American skating champion John Coughlin, Arghya Basu, filmmaker, and Armando Vega Gil, Mexican rockstar, who committed suicide after an anonymous woman claimed that he told her he would like to teach her to kiss when she was 13 and he was 50. I have no doubt that there are many that we have missed.   \nAnd the climate of everyday misandry pouring forth from feminists is relentless, Suzanna Danuta Walters asked “Why Can’t We Hate Men?... We have every right to hate you.”, a segment on ABC’S ‘Tonightly with Tom Ballard’ programme featured women sarcastically “thanking” men – in general – for drugging and raping women, Laurie Penny announced (in response to the Capital Gazette massacre) that “We must not allow our society to be held hostage to white male fragility any longer” and Barack Obama complained that “Men have been getting on my nerves lately... I just think brothers, what’s wrong with you guys? What’s wrong with us? I mean we’re violent, we’re bullying...”. Chidera Eggerue aka The Slumflower tweeted that “If men are committing suicide because they can’t cry, how’s it my concern?” Most fourth wave feminists though like to cover their misandry with platitudes about wanting to liberate men from the toxic expectations society places on them. They live in this alternate reality wherein uninhibited male aggression and violence are pardoned by the mantra “boys will be boys” and wherein “violence as a means of defending [pride] is glamorized.” Fourth wave feminists are unconcerned with truth however, their goal is power. The power to penalise the most successful men in order to privilege women (quotas and other forms of discrimination) and the power to demonise men collectively in order to defend and extend the ability of women to destroy men in general – along with the power to silence any men or women that dare to oppose their baseless narratives.\n\nRegardless of whether a behaviour is innocuous or women engage in equivalent behaviour, if a man does anything, feminists oppose it. In the last few years, snappy feminist portmanteaus such as manspreading, mansplaining and manteruppting have proliferated and become ubiquitous in their use. The aim is to shame, silence and bludgeon men into compliance. \n\nMasculinity as a whole is utterly vilified and demonized in our societies. The endeavour can begin at school, intensifies in university – and in the workplace increasingly, and reaches a tragic crescendo in family courts where men are denied access to their children who would bring such critically important meaning to their lives and be the ultimate expression of their masculinity. There is a gender justice gap for those convicted of crimes. Sex discrimination in the U.K. criminal justice system has a long history: e.g. flogging as a punishment for female criminals was banned in 1820 but continued for men until 1967 – that’s 147 years! Presently, men account for around 95% of the total prison population despite only committing 3.4 times more crimes than women. Factors that explain this disparity include: a greater percentage of convicted men being sentenced to prison, men being given longer sentences on average than women, women being paroled earlier than men (despite being more likely to be disciplined for bad behaviour whilst incarcerated) and women being more likely to have mitigating factors (such as age, dependents, lack of previous relevant convictions and the appearance of genuine remorse) applied to their sentences. And yet, feminist activists (such as Women in Prisons, Baroness Corston and Julie Bindel) have committed themselves to widening the gender justice gap – enabled by sentimental authorities. Our Tory government has committed itself to taking a rehabilitative approach when dealing with women offenders, which I think is great, but the voices of our male offenders (as well as the experts on effective justice) are utterly ignored when they raise the question: “What about the men?” \n\nThe cultural obsession with the gender pay gap is being driven by disingenuous authoritarian feminists with no regard for personal choice, meritocracy or human well-being. The focus is exclusively on the mythical glass-ceiling with no interest paid to the fate of those men employed in the glass-cellar dangerous and dirty jobs that women don’t want, who are increasingly at risk of unemployment due to automation, and/or the ever-present risks of workplace injury and death. Quotas are being used by many organisations which discriminate against men, sometimes caucasian men specifically. This is not only immoral in that it unfairly disadvantages individuals but also frankly stupid with the potential to impair the functioning of sectors rejecting meritocracy and therefore the economy and society in general. Moreover, the clunky way in which the government has demanded that businesses publish their “gender pay gap statistics” may ultimately lead to men being chosen over women for the kind of minimum wage jobs that very few do out of choice. “Equal pay” is being acquired for women performing even dissimilar roles to male counterparts, regardless of relevant facts such as: whether they work fewer hours. For example, the BBC’s former China editor Carrie Gracie was awarded £280,000 in back pay to bring her earnings in line with Jon Sopel, the North America editor, despite the fact that his job was more intensive and he was on air significantly more than her. She has donated her pay-out to The Fawcett Society. There are also several battles raging to secure equal pay for (mainly female) supermarket store workers as (mainly male) warehouse workers. An Asda spokesman clarified (in response to coverage consistently suggesting otherwise) that ““At Asda, hourly paid colleagues doing the same job in the same location are paid the same. Men and women doing the same job in our retail stores are paid the same. Men and women doing the same job in our distribution centres are paid the same. Pay rates in stores differ from pay rates in distribution centres for legitimate reasons” [end quote]. Differences in comfort, exertion and safety in the roles have been labelled entirely illegitimate reasons to offer different levels of pay to workers in the coverage of the stories, and the Court of Appeal agreed earlier this year and ruled against Asda.\n\nNow, the U.K. is facing the extension of hate crime legislation to include the charge of misogyny. In line with current hate crime legislation, the charge will require no evidence of hateful motivations but rather be governed by the perception of the victim or any witnesses involved. This shameful waste of police time will offer another avenue for malicious women to use the law to harm innocent men; as well as diverting precious resources from the fight against actual crime. And do not think that these “crimes” will not be acted upon by sensible officers, a perception of indifference from the police in such instances will be treated (as it is with current hate crimes) as “secondary victimisation”, with Greater Manchester Police clarifying that action will be taken against police accused of indifference towards “victims” and “whether or not it is reasonable for them to perceive it that way is immaterial” [end quote]. \n\nIn the interests of nuance, I accept that there have been and are individuals who identify as feminist who don’t fit into the negative description of the movement that I’ve just given. There are feminists who want equal rights for men and women, equal treatment, choices, opportunities. Feminists who have compassion for men and value them. But what impact have they really had on the trajectory and achievements of the movement? They’ve been marginalised heretics pleading intelligently and rationally but essentially ineffectually with their hysterical peers. While their hysterical peers have been lobbying our institutions irresponsibly and illogically but consistently successfully for policies and procedures that are damaging our societies.  \n\nFeminism, though once it was at least partially in practice, is now “progressive” in name only. Feminists don’t look around at our wonderful civilisation with gratitude and awe and want only to extend and protect the liberal values that have brought us here. Feminists look at our civilisation with anger and malice and want to burn it to the ground, rending our liberal values assunder, and to remake it in their own image. And feminists understand that “Power is in tearing human minds to pieces and putting them together again in shapes of your own choosing”, as Orwell explained through O’Brien in 1984, that’s why the epicentre of feminist indoctrination is in the education system where young and malleable minds proliferate to be manipulated by feminist historiography. Thankfully, we non-feminist women and men are studying and expressing our findings and more and more individuals are learning to see through the feminist narrative. I look forward to a post-feminist future.",
    "title": "History of feminism the way they don't want us to know!",
    "subreddit": "MensRights",
    "timestamp": 1558867022,
    "score": 392,
    "keyword": "american director"
  },
  {
    "text": "One brave young man takes on gender inequality at USC  \n\nMisandry—the hatred of men—has been a staple of my polemical writing  for more than fifteen years. I felt a special obligation to hammer away  at gender myths such as intimate partner violence (women are about [as likely as men](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) to initiate violence against their partners as men), false sexual allegations (a [disturbing percentage](https://medium.com/t/@jimpreston_36730/how-many-rape-accusations-are-false-f52e4c675f2a) of such allegations) and demonstrable [bias against fathers](https://theccf.ca/ideology-and-dysfunction-in-family-law/)  in family court, because male journalists who dared to write  sympathetically about men and/or critically about women put their  careers in jeopardy (no exaggeration), and most had learned to keep *shtumm* in this domain.\n\nThat  situation has been changing slowly but steadily. Some men have decided  they aren’t going to spend their lives in rhetorical purdah on the  subject of their own cultural dhimmitude, and have been stepping up to  the plate, whatever the personal cost. The university campus is home to  the feminist commissariat—and it’s a brave man who dares to stick his  head above that formidable parapet. Because the cost of doing so can be  high.\n\nThis is the story of one such activist who paid a price,  which only fueled his resistance efforts, and which in turn inspired  others, in reversing a decades-long erosion of men’s rights on campus.\n\nIn  a meeting held in June, 2017, Kursat Christoff Pekgoz was pressured by  his academic director at the University of Southern California into  terminating his PhD degree in English Literature on what Pekgoz  considered spurious and unprecedented grounds, accompanied by “many  threats and irrational exaggerations” (the meeting was recorded).  His  contract was not renewed and his funding was cut off. This is extremely  uncommon. In fact, Pekgoz is unaware of any other PhD student being  denied a doctoral degree in English Literature \\[at USC\\].\n\nThe real  reason for his PhD termination, Pekgoz alleges, is his history of gender  activism via a series of Title IX complaints against a number of  universities, such as Rutgers, [Northeastern](http://ncfm.org/wp-content/uploads/2018/08/NCFM-Title-IX-complaint-Northeastern-University.pdf) and Georgetown, to which he added [one against USC](https://docs.wixstatic.com/ugd/ea7b71_0c223159779e4beaaea809873f2504a7.pdf) at the end of May. As he [told a PJ Media reporter](https://pjmedia.com/trending/ph-d-student-files-federal-complaint-says-usc-retaliated-against-his-pro-men-title-ix-activism/), “They all know that I am a Title IX activist for men, with strong libertarian/conservative views.” \n\nTitle  IX’s language is very plain. It prohibits any institution from funding,  sponsoring, or listing gender-discriminatory programs and initiatives,  so for example, even listing a woman-only scholarship or placing an  employment ad specifying only women need apply runs counter to Title IX,  though such breaches happen all the time. Title IX also prohibits  discrimination in terms of counselling or health benefits. That should  mean that both men and women are treated with equal objectivity and  respect when, say, sexual-assault allegations come up for assessment.  But universities have [not covered themselves in glory](https://helpsaveoursons.com/category/fighting-back/), to say the least, on that front. \n\nIndeed,  motivation for Pekgoz’s robust activism arose in part from a Title IX  complaint against him for sexual harassment. In response, he went on  offence with a forceful and persuasive [counter-charge](https://docs.wixstatic.com/ugd/ea7b71_16c1692eab8844218afdb2b419622827.pdf)  that his accuser had in fact sexually assaulted him (it’s worth  reading, because it offers a formidable sample of the kind of meticulous  research and annotation Pekgoz applies to every single thing he says  and writes. It does not seem to leave much wriggle room for his accuser,  and I think any objective reader would come away from it with,  minimally, doubts as to the accuser’s credibility.) \n\nIn 2018  Pekgoz complained to the Department of Education’s Office of Civil  Rights (OCR) about both USC and Yale University, prompting an  investigation into both schools’ women-only scholarships and programs,  such as a USC Women in Science and engineering group that excludes  males.\n\nLast January, Pekgoz and two former lawyers (not affiliated with Harvard University) filed a Title IX [complaint with the OCR against Harvard](https://docs.wixstatic.com/ugd/ea7b71_85533d99ee0748ac813ca937735a4f94.pdf),  in which they rebut the received wisdom of female victimhood with an  abundance of impeccably-sourced evidence demonstrating the various ways  in which men are discriminated against in society and on campus.  Notably, “the overwhelming majority of all persons sanctioned under  Title IX theory are male. However, there is good evidence that men and  women experience sexual victimization at equal rates and the majority of  male victims [report female perpetrators](https://www.sciencedirect.com/science/article/abs/pii/S1752928X11001569). The majority of Title IX administrators are women.”\n\nAlso in the Harvard complaint is a reference to Supreme Court prohibitions against male-gender discrimination. In [*Mississippi University for Women v. Hogan*,](https://www.britannica.com/topic/Mississippi-University-for-Women-v-Hogan)  for example, the Supreme Court held that denying male admission to  nursing courses was impermissible under the Equal Protection Clause of  the Fourteenth Amendment. They wrote that a sex classification must be  “…determined through reasoned analysis rather than through the  mechanical application of traditional, often inaccurate, assumptions  about the proper roles of men and women. … Thus, if the statutory  objective is to exclude or ‘protect’ members of one gender because they  are presumed to suffer from an inherent handicap or to be innately  inferior, the objective itself is illegitimate.” This statement would  seem to undermine the reflexive argument adduced by feminists that  affirmative action for women is still necessary because of historic  disadvantage or because there are more *Fortune 500* male CEOs than women.\n\nThe  most interesting complaint to the OCR, because it reveals the distance  the men’s rights movement has come from its first tentative and atomized  beginnings two decades ago, is the one led by Pekgoz [against Cornell University](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed) in February, which Pekgoz described in an  [interview with *Campus Reform*](https://www.campusreform.org/?ID=11853) as “one of the worst in the nation” for anti-male bias. \n\nThe  document contains a “list of exclusionary programs” at Cornell, such as  the lack of a Men’s Resource Center to balance the women’s Center, or a  Men’s Health Center to balance the Iris Cantor Women’s Health Center.  Likewise – even though “men are twice as likely to have heart attacks  through life than women” – there is a women’s Heart Program, but none  for men.\n\nBut the list itself, while interesting, is not what is  most significant about the Cornell complaint. Rather it is the public  support for the complaint amongst Pekgoz’s colleagues and from many  respected public intellectuals, such as American Enterprise Institute  scholar and feminist critic [Christina Hoff Summers](https://www.aei.org/author/christina-hoff-sommers/),  that lend unusual moral weight to its claims. More than 185 professors,  scholars and activists signed on to it, including Canada’s own Jordan  B. Peterson, arguably the most recognizable and inspirational spokesman  for gender equality in the world today. Peterson referenced Title IX’s  long association with women’s rights succinctly: “what’s sauce for the  goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*  that he had signed the complaint because it “addresses a fundamental  unfairness in contemporary America, centred in our colleges and  universities” and because “it shows that exclusionary practices create a  hostile environment” for men, some caused by an “animus against males  perpetrated by feminist ideology.” Lawrence Alexander, a law professor  at the University of San Diego, told *Campus Reform* that he signed because “its allegations are true and even understated.”\n\nSuch  public affirmation on men’s behalf by high-status academics in  prestigious institutions represents something like a tipping point in  the gender wars, it seems to me. Margaret C. Valois, a Virginia-based  Title IX attorney who specializes in defending accused male students  filed a similar Title IX complaint against Tulane University and [obtained a win](http://www.aei.org/publication/successful-title-ix-complaint-forces-tulane-university-to-end-gender-discrimination/)  recently. Valois, Pekgoz and another aggressive veteran in the battle  for gender equality, Professor Mark Perry of the University of  Michigan-Flint, are profiled by anti-feminist Canadian vlogger Janice  Fiamengo, a signatory to the Cornell complaint, in [Episode 94 of her popular Fiamengo File](https://inclip.top/studiobrule/aLDRY3qCkmjIuoI/will-2019-be-the-year-of-mra-lawsuits-tff-episode-94.html) series, titled “Will 2019 Be the Year of MRA Lawsuits?”\n\nWill  it? It does seem that we are at a pivotal moment—that there is a  powerful current of social unease, running just below the still  hegemonically feminist surface, with the unfettered misandry that  pervades our culture. In Pekgoz’s Harvard complaint, for example, he  notes that whenever the Department of education investigates an  institution for anti-male discrimination, public attitudes on the issue  are on the side of men: “\\[A\\]ccording to a recent poll conducted by  YouGov, 69% of all Americans believe that men face discrimination to  some extent. 74% of men believe that such discrimination occurs, while  63% of women agree that men face some degree of discrimination.”\n\nFiamengo points to what she ([and I](http://www.barbarakay.ca/articles/view/1297)) consider radical feminism’s shark-jumping moment, the publication in the *Washington Post* of Northeastern University academic Suzanna Danuta Walters’s odiously misandric June, 2018 article, “[Why can’t we hate men](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html)?” which earned her a [Title IX complaint](https://www.campusreform.org/?ID=11249) filed by the National Coalition for Men [(NCFM).](https://ncfm.org/)  Walters doubtless expected her screed would find the passive acceptance  such anti-male rants often have done in the past, but was clearly  startled by the fierce blowback she received.\n\nA final word about  Kursat Christoff Pekgoz. I don’t know him personally, but from his  history, I would say that the USC Literature department picked the wrong  guy to tangle with when they forced him out of his PhD program. This is  a young man, now 30-something, who comes from Turkey, a land where they  play political hardball, and backing the wrong horse can earn you  something worse than a Twitter mobbing. He learned about activism in  what we might call an “unsafe space.”\n\nPekgoz’s [*curriculum vitae*](https://www.kursatchristoffpekgoz.com/)  informs us that In Turkey Pekgoz went out on potentially dangerous  political limbs. He took part in the Republic protests of 2007 against  fundamentalist Islam, as well as a protest against Islamist hate speech  targeting Armenian and Jewish minorities in 2009, amongst other forays.  He advocated against electoral fraud by the Islamist regime. He taught *pro bono* for an anti-Islamist organization that seeks to eliminate illiteracy among young women in Ankara (real feminism in action). \n\nAll  this speaks to character. For relentless discipline and determination  in achieving goals, add this salient fact: As a long-distance swimmer,  Pekgoz has covered 11,000 m in the open sea, with the best speed of  5,000 m in 130 minutes. This is in seawater with a temperature of 17C.  Don’t look to such a man to truckle to latte-sipping ideologues  trafficking in gender injustice. Ever.\n\nAccording to his bio,  Pekgoz has “perfect pitch.” He means musically, of course. But it may be  the case that he has perfect cultural pitch as well.\n\n&#x200B;\n\n[https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/](https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/)",
    "title": "One brave young man takes on gender inequality at USC",
    "subreddit": "MensRights",
    "timestamp": 1569207365,
    "score": 194,
    "keyword": "american director"
  },
  {
    "text": "EXCLUSIVE: Jordan Peterson, Dozens of Academics Attack Ivy League Anti-male Bias  \n\nArticle Here: [https://www.campusreform.org/?ID=11853](https://www.campusreform.org/?ID=11853)\n\n* USC  Ph.D. student Kursat Christoff Pekgoz  has targeted Yale University and  his own school for alleged anti-male  discrimination. Now, he's going  after Cornell.\n* A  Title IX  complaint cites the existence of women-only centers and  scholarships on  campus, but notes that there are no men-only  counterparts.\n* Some BIG names, such as Professor Jordan B. Peterson and scholar Christina Hoff Sommers, have signed onto the complaint.\n\nJordan   Peterson, a Canadian psychology professor signed onto a Title IX legal   complaint against Ivy League school Cornell University claiming   anti-male bias.\n\nUniversity of Southern California Ph.D. student  [Kursat Christoff Pekgoz](https://www.kursatchristoffpekgoz.com/)  filed the complaint and more than 185  professors, scholars, and  activists signed onto it. The complaint  alleges instances of anti-male  bias by Cornell, according to documents  obtained by *Campus Reform*. \n\n\"What's sauce for the goose is sauce for the gander\"   \n\nThe   28-page-long document, which was sent to the Department of Justice and   the Department of Education's Office for Civil Rights, includes a  “List  of Exclusionary Programs” at Cornell. Pekgoz claims these  programs  discriminate against men. The complaint is predicated mainly  on the fact  that there are no male-only programs at Cornell, compared  to a  significant number of university-sponsored female-only programs.\n\n[\\[RELATED: Ed Department investigating anti-male discrimination at Yale\\]](https://www.campusreform.org/?ID=10899)\n\n“There   are no male-only programs operative at Cornell University which can   balance the female-only programs listed herein,” the complaint states.   For example, the complaint includes the Cornell Women’s Resource Center   as alleged evidence of anti-male bias, alleges that the center violates   Title IX, and states that there is not an equivalent “Men’s Resource   Center” at Cornell. Additionally, the complaint takes issue with the   Iris Cantor Women’s Health Center, stating that there is no comparable   Men’s Health Center at the university.\n\n“There  is no equivalent  program at Cornell University which focuses on the  cardiological needs  of men. This is despite the fact that men are twice  more likely to have  heart attacks through life than women. Also, men  are more susceptible to  heart diseases than women,\" the complaint says,  referencing Weill  Cornell Medicine, which it says funds or endorses  the Women's Heart  Program. \n\nPekgoz’s  complaint also alleges that Cornell violates  Title IX by endorsing 390  scholarships on its website, all of which are  only open to women.\n\n“There  is no rational basis for this  endorsement,” the complaint says. “Title  IX prohibits an institution  from even listing external programs which  are discriminatory. The  overall effect is clearly discriminatory, given  the massive number of  female-only scholarships endorsed for the female  majority.”\n\nIf the  Department of  Education's Office of Civil Rights thinks the complaint  has any merit,  it will open a formal investigation into the school.\n\n[\\[RELATED: Harvard creates a ‘hostile environment against men,’ complaint says\\]](https://wwwt2.campusreform.org/?ID=11826)\n\nThis is not the first Title IX complaint that the USC Ph.D. student has filed, however.\n\nIn 2017 and 2018, Pekgoz filed Title IX complaints against the [University of Southern California](https://www.campusreform.org/?ID=10931&&fb_comment_id=1728003297291768_1728026087289489) and [Yale](https://www.campusreform.org/?ID=10899), respectively, both of which were investigated by the OCR and reported by *Campus Reform*.\n\nIn an interview with *Campus Reform*, Pekgoz said that Cornell “is one of \\[the\\] worst in the nation” when it comes to anti-male bias.\n\n“In   addition to bias against men in Title IX hearings, there is enormous   bias against men in terms of scholarships and initiatives, as the   complaint has highlighted,” the Ph.D. student stated. Pekgoz said that   the Cornell case differs from others because it has many influential   signatories. He said he believes the complaint will be investigated by   the OCR.\n\n“OCR has to abide by its own  principles and precedents.  The complaint is consistent with past OCR  precedent, the plain language  of the Code of Federal Regulations, and  Supreme Court doctrine,\" Pekgoz  said.\n\n[Jordan Peterson](http://home.psych.utoronto.ca/staff/undergrad.htm), a professor at the University of Toronto and a signatory on the complaint, commented on the complaint, telling *Campus Reform,* simply, “what's sauce for the goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*   that he, too, signed the complaint because it addresses a major issue   in higher education: “I signed it because \\[the complaint\\] addresses a   fundamental unfairness in contemporary America centered in our colleges   and universities. The complaint is an extraordinarily well   thought-through and cogent explanation of the problem of discrimination   against males in higher education in general and at Cornell University   in particular.”\n\nWood also signed the  complaint because “it shows  that exclusionary practices create a  hostile environment” for males and  that some are caused by an “animus  against males perpetrated by feminist  ideology.”\n\n[\\[RELATED: UT makes student reflect on ‘masculinity’ as punishment\\]](https://www.campusreform.org/?ID=11139)\n\n[Lawrence Alexander](http://www.sandiego.edu/academics/meet-our-faculty/biography.php?profile_id=2577), a professor of law at the University of San Diego, told *Campus Reform* that he signed the complaint because its “allegations are true and even understated.”\n\nMany other prominent figures signed the complaint, including think tank scholars from the American Enterprise Institute and [Peter Boghossian](https://www.pdx.edu/philosophy/peter-boghossian),   a professor at Portland State University who duped an academic journal   into publishing an article claiming that dog parks are “petri dishes  for  canine ‘rape culture,’ ” as previously reported by *Campus Reform*.\n\nGeorge Leef, director of research at the James G. Martin Center, also signed the Cornell Title IX complaint. He told *Campus Reform,* “I think the complaint against discrimination based on sex is meritorious.\"\n\nWarren Farrell, Ph.D. recipient and author of “The Boy Crisis” confirmed to *Campus Reform*   that he signed the complaint because he believes in equality: “I   believe that academic integrity includes understanding men and women   equally...When only one sex wins, both sexes lose.”\n\nA Cornell spokesman declined to comment on the complaint. \n\nComplaint narrative here: [https://www.scribd.com/document/399202262/Coalition-Complaint#from\\_embed](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed)",
    "title": "EXCLUSIVE: Jordan Peterson, Dozens of Academics Attack Ivy League Anti-male Bias",
    "subreddit": "MensRights",
    "timestamp": 1549911068,
    "score": 35,
    "keyword": "american director"
  },
  {
    "text": "Masculinity under siege in schools, politics, online | Article in The Australian newspaper outlines the feminist war on men &#x200B;\n\n# Masculinity under siege in schools, politics, online📷[KEVIN DONNELLY](https://www.theaustralian.com.au/author/Kevin+Donnelly)\n\n* 12:00AM JUNE 28, 2019\n* [206 *COMMENTS*](https://www.theaustralian.com.au/commentary/masculinity-under-siege-in-schools-politics-online/news-story/7d0c3c50317c07b2198136f95c593bd7)\n\nIs there a crisis in masculinity? Based on an article by the American Jordan Black, “Masculinity in Menopause: The Emasculating Effects of Fatherlessness and Feminism”, the answer is yes.\n\nBlack highlights how, across the Western world, falling levels of testosterone and low sperm counts are contributing to significant changes in how masculinity is defined. Add the impact of so many boys raised without fathers and the global #MeToo movement that gives the impression that all men are inherently violent and misogynist, and it should not surprise that Black concludes: “We are not making men like we used to; in fact, we are not making them at all.”\n\nThe same is happening here, where similar forces are at work undermining masculinity and radically redefining what constitutes manhood. As Bettina Arndt says in her book *#MenToo*, men are unfairly demonised and attacked by radical feminists more intent on winning gender wars than peacefully coexisting.\n\nEven to suggest men’s rights are being undermined is to incur the wrath of the sisterhood. Victorian Women’s Trust executive director Mary Crooks wrote this week in Nine’s *The Age* and *The Sydney Morning Herald* newspapers: “Men’s ‘rights’ are about treating women as inferior; objectifying them by denying them any personhood. Men’s ‘rights’ are about being able to stalk, harass or abuse women online, on the streets, in the home or at work.”\n\nAnother example of this fatwa against men is how every time a woman is attacked or murdered the response is to blame all men and to suggest that violence occurs only because society is patriarchal and misogynist.\n\nAfter last month’s horrendous murder of Courtney Herron in a Melbourne park late at night, Victorian Premier Daniel Andrews said women travelling alone should be safe regardless of where they were or what the hour, and that crimes such as this were “most likely about the behaviour of men”.\n\nVictoria Police Assistant Commissioner Luke Cornelius mirrored the Premier’s views. He said: “This is about men’s behaviour. It’s not about women’s behaviour” — implying that, instead of the act being perpetrated by one demented evil soul, all men were implicated.\n\nWhen detailing the death of masculinity, Black also says the US education system is guilty of “encouraging feminine behaviour for both genders”.\n\nFeminist Camille Paglia makes the same point when she bemoans “the plight of physically active boys in a public school system dominated by female teachers”.\n\nThe Australian school system also disadvantages boys as a result of the feminisation of the curriculum. Research suggests boys, compared with girls, need greater structure and discipline to learn, especially in relation to learning to read, where the absence of a phonics and phonemic awareness approach puts them at risk.\n\nToday’s approach to education is more about “care, share and grow”, where teachers facilitate and students self-direct, manage their own learning and where competition is shunned. It’s an approach that favours girls.\n\nNot surprisingly, girls out­perform boys in reading as measured by the National Assessment Program — Literacy and Numeracy, and achieve stronger Year 12 results as measured by the Australian Tertiary Admission Rank. It’s also true that material such as the gender-fluidity Safe Schools program and the Respectful Relationships program being implemented in Australia disadvantage boys, as both present a negative and biased view of masculinity and manhood.\n\nThe view of boys and men presented is one that implies masculinity is inherently violent against women and that Western societies such as ours are patriarchal ones in which women are ­oppressed and treated as second-class citizens.\n\nVictoria’s Royal Commission into Family Violence reported that 25 per cent of family violence victims were men but the Respectful Relationships program implies it is only women who are at risk.\n\nStudents also are never told that such is the way the law now operates that men often are assumed to be the guilty party.\n\nAnother example of how the curriculum has been feminised is the way school programs present traditional male characteristics such as fortitude, courage, physical strength and mateship as negatives instead of being worthwhile.\n\nEven worse, many schools ban physically active and risky playground activities and behaviour, and it’s not unusual for primary schools to ban boys wearing ­superhero costumes on the basis that play-acting reinforces ­negative and potentially violent behaviour.\n\nMore radical feminists go as far as saying traditional male qualities lead to what *The Age* journalist Anna Prytz describes as a “man box”, a situation where men are constrained because they mistakenly believe they should be “unemotional, hyper-sexual, physically tough, stoic and in ­control”.\n\nInstead of accepting the feminist argument that the characteristics that typically define men are toxic, Black argues in favour of what he describes as “virtuous masculinity”. Paglia makes a similar point, arguing that feminists guilty of misandry should learn to respect and admire positive masculine qualities.\n\n*Kevin Donnelly is a senior research fellow at the Australian Catholic University.*",
    "title": "Masculinity under siege in schools, politics, online | Article in The Australian newspaper outlines the feminist war on men",
    "subreddit": "MensRights",
    "timestamp": 1561738940,
    "score": 28,
    "keyword": "american director"
  },
  {
    "text": "New Series Amsterdam Ave. created by two women of color Hey everyone! Wanted to share the new Dutch American series I co-created, [Amsterdam Ave.](https://www.amsterdamave-theseries.com/) The show was created by a strong team of female filmmakers including female writers, producers, director, cinematographer, and 90% female crew in Holland and NYC, and we'll be releasing episodes weekly every Thursday. It follows an American aspiring Indian American DJ in NYC and a Dutch Surinamese aspiring actress in Amsterdam who switch places to become expats and follow their dreams abroad. If you like it, please subscribe for updates when the others are released!\n\nEpisode 1: [https://youtu.be/aeRAKZut-QI](https://youtu.be/aeRAKZut-QI)\n\nEpisode 2: [https://youtu.be/Wv8yfVFTa0c](https://youtu.be/Wv8yfVFTa0c)",
    "title": "New Series Amsterdam Ave. created by two women of color",
    "subreddit": "Feminism",
    "timestamp": 1573854748,
    "score": 3,
    "keyword": "american director"
  }
]