[
  {
    "text": "Company won't hire any minorities I am a white male who is an upper-middle manager at a regionally successful business in the Pacific Northwest (300+ employees on the payroll). After getting a graduate degree (combined with some Covid layoffs), I have been making strides at work and have received two promotions in the last four years. Approximately two weeks ago I got invited to be a member of a resume review board for selecting new interns and employees. This is the first time I have been a member of such a board.\n\nThings were pretty banal and repetitive at first until we arrived to a frankly over-qualified candidate who was African American. I voted that we bring this guy on but the other people I was on the board with disagreed. They said that they couldn't bring in any more African American employees until more diversity coordinators for the company were hired. I asked what the hell that had to do with anything and they said they didn't want to open up the company to \"liability for any lawsuits\" so they had to acquire more diversity resources before they could hire any minority candidates. The head of the board also stated that this directive came from the Owner/CEO. Completely disgusted, I stormed out of the meeting.\n\nThe head of HR was also a member of this meeting so I have no real avenue for filing a complaint other than via the Oregon BOLI. I have been completely socially isolated at work since this incident and anticipate I am on the verge of being fired. What do I do in this situation??",
    "title": "Company won't hire any minorities",
    "subreddit": "jobs",
    "timestamp": 1696993994,
    "score": 400,
    "keyword": "american ceo"
  },
  {
    "text": "How do I start over at 35 in software engineering? My background: I graduated in STEM from a well-known North American university and currently living on the West Coast. Upon graduation, I immediately started a SaaS start-up with a close friend. I serve as the CTO and my friend CEO. I self-learnt web development and developed the product all by myself for a few years before we raised enough money to hire more employees. Gradually, I transitioned towards a leadership role rather than coding. I'd be responsible for hiring senior devs and managers, participating in high-level product decisions, and generally help everyone solve problems in coding, UX/UI, delivery processes. I am still coding once in a while, but I don't have enough time to get really deep into anything new. After a little more than a decade, we grew it to a sizeable company of around 50 people and recently sold it to a large investment firm.\n\nThe parent firm already signalled that they wanted us gone ASAP so they could install their own management. I also think it's a good time for me to move on to a new venture anyway. But I'm having a hard time deciding what to do next. My whole adult life has always been with my start-up and I don't think I've ever applied for any full-time job before, besides a few internships in college. I will list a few thoughts here hoping someone could help me process them.\n\n\\- My earn-out from the sale was decent and enough to sustain myself for quite awhile, but it's nowhere near enough to live comfortably while being unemployed.\n\n\\- My friend already wanted to jump on a new start-up with me. But tbh, the ideas of sleepless nights and financial uncertainties don't appeal to me as much now as in my 20s. In the case I do start a new start-up, I want to invest my own money this time instead of raising VC money. So I need to conserve my fund.\n\n\\- I can apply for a smaller role in another firm, maybe a senior software dev? This allows me less stress responsibility-wise while still having a decent pay so I don't have to eat into my fund. It also gives me time to develop myself technically and find ideas for my next startup. But does it look bad that a CTO's next job is going backward to a dev role?\n\n\\- I can also do a lateral move to a management role in another firm. Maybe a VP or Director of Engineering? This will obviously make the job-search process more rigorous and the job itself will be quite stressful again. But the pay will be much better and it will look better on my resume.\n\n\\- I can also go back to school? Maybe a Master in AI or ML. I never had a chance to study properly in university because of money. I had to take random courses to work and graduated very early. Also going back to school is a good excuse to have some gap years in my resume while starting a new start-up.\n\n\\- I've always been a more product-focused CTO rather than a technical one. I've always considered coding a tool to solve problems, and learned them as I needed. I think I lack deep understanding of many programming disciplines such as languages, best practices, Dev Op, etc... I only knew what to use to solve what problems come my way. I'm good at understanding business needs and develop the right products, and lead people to collaborate on them. Knowing this, I'm not sure which role will suit me in the \"real\" world.\n\nI'm open to advice and criticism. Please feel free to let me know what you think, good or bad (:",
    "title": "How do I start over at 35 in software engineering?",
    "subreddit": "jobs",
    "timestamp": 1703139957,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "I was able to find opportunity in America I came to this country in 2007 with 2 suitcases to get a degree at a Mid Western state university, with the intention of moving back home once completed. Finished a BsC in business majoring in Operations and Finance.  After 11 years I finally feel I've got a piece of the American dream.  \n\n\n2012 - First job as an analyst paying $43k, I had a visa waiver for this job thought he OPT part of my degree. I thought I was rich but lived paycheck to paycheck.\n\n2013 - started at $46k, finished at $51k - no bonus. Company did sponsor my H1b.\n\n2014 - 2% merit increase finished the year at $52k - no bonus\n\n2015 - promoted made $57k - no bonus\n\n2016 - promoted made $63k - $50 bonus one month. Also received Greencard and got married.\n\n2017 - no merit increase left company to move to Nashville for $72k - got paid $7k signing/moving bonus and got paid full year bonus of another $7k after only working there for 7 months.\n\n2018 - contacted about a job in Texas, interviewed and told them my number was $90k for various reasons. Came back with $80k - insulting. Countered with $100k and they came back with $90k and a $10k signing bonus. Told my current company I was leaving but would like to finish out the year. They were cool.\n\n2019 - moved to Texas, in March I received a payment into my bank account from my old company. They paid out my full bonus despite me not being eligible. Fuckin A, that is how you treat your employees.\n\n2020 - COVID, took a 20% pay cut, but was back paid 4 months later. Company CEO said it was out of the goodness of his heart......BULLSHIT, it was a requirement for taking a $4m forgivable PPP loan.\n\n2021 - promoted to $105k year and a $10,500 bonus. Merit increase to $118k.\n\n2022 - promoted to lead a larger team $135k year plus 15% bonus, received partial bonus of $12,300.\n\n2023 - merit increase to $139k year, lost job due to reorg in May. Interviewed over the next 3 months at 7 companies (about 35 applications in total). Landed a job at a Fortune 10 company $155k year, 25% bonus ($39k) and another $50k annually in RSUs vested over 3 years.  \n\n\nBeen an interesting and rewarding time living here, knowing literally no one when I first came. Thinking about citizenship eventually.  \n\n\n&#x200B;",
    "title": "I was able to find opportunity in America",
    "subreddit": "jobs",
    "timestamp": 1701141133,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "How to work your way up to CEO at a large American company?",
    "title": "How to work your way up to CEO at a large American company?",
    "subreddit": "AskReddit",
    "timestamp": 1701233106,
    "score": 3,
    "keyword": "american ceo"
  },
  {
    "text": "International Conference Fat Shaming Obese women like me typically have thick skins (no pun intended), and this story illustrates one more reason, ladies, to stay unflappable.\n\nLast week, I was at an international conference of airline professionals: Decision makers for airlines, aircraft manufacturers, Ministry representatives from various countries, and regional executives were in attendance. I work for a company that manufactures a futuristic aircraft, which is why I was there, and one of our competitors was there as well.\n\nThis is important to the story: There are several factors used to calculate how much it costs to operate an aircraft. Two of these factors are average passenger weight and luggage weight. As an example, an airline might figure every seat is occupied by a 220 lbs passenger and every bag weighs 50 lbs - which is why you're only allowed to check a bag that weighs 50 lbs or less. If you want to know more, IM me.\n\nDuring a discussion panel, our competitor was making some pretty outlandish claims, so during the Q&A session, I raised my hand. The camera was trained on me as I held the microphone and (trying not to think about all of the people around the world watching the live stream) asked a question regarding their plan to overcome some of their aircraft's performance factors.\n\nThat's when it happened. This (unsurprisingly) American white man, instead of answering my question, made a joke about 'how we all know that the weight of passengers can vary greatly' thereby impacting aircraft performance. Much of the audience laughed. I (compartmentalized) kept my face neutral. \n\nHad I been a man, I assure you that the 'passenger weight' factor, out of all of the other factors that could impact aircraft performance, would not have been used to try to detract the audience from a glaring flaw in his claims about his product's performance, as everyone in that room knew that the passenger weight factor is the same for every seat.\n\nBut because I stood my ground and didn't (die of humiliation / burst into tears / get red faced and offended) acknowledge his slight at me, he was forced to address the question. So, I got to make my point and he got to look like a total asshole, and then I executed my follow up question with grace, and his answer further illustrated that his claims were unrealistic. I replied only with, \"How interesting. Thank you,\" and sat down.\n\nNo, he couldn't make a jab at my company's product, or the operating environment, or my CEO. He had to make a personal attack on the fat older woman who had the audacity to challenge him. And when his diversion tactic didn't work, he had to admit some hard truths in front of all of these people.\n\nAnd I get to deal with my shame and humiliation in private.\n\nStay frosty, ladies.",
    "title": "International Conference Fat Shaming",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1699707420,
    "score": 304,
    "keyword": "american ceo"
  },
  {
    "text": "You are Justified. Good evening - I recently made the huge mistake of taking a house supervisor job at one of the bigger local hospitals in my area. What I've seen since doing so has truly disgusted me, so I wanted to post here to let you know:\n\nYour hate for administration is justified.\n\nThey do not care about you.\n\nThey do not care about your ratios and will openly joke and laugh about nurses who try to enforce contract limits.\n\nThere is no magic number - no census - that will satisfy the executive suite.  They are truly insatiable.  You cannot win.\n\nThey absolutely want to gaslight you into thinking your assignment/general staffing isn't so bad.  They will do anything they can to pressure you into thinking you're weak or lazy for wanting your floor to be safe.\n\nAmerican healthcare is legitimately evil.  There is no other word for it.\n\n---------------------------------------------\n\nExact quotes from leadership meetings (you're going to think I'm being hyperbolic. I'm not):\n\n\"Well, nurses care about people so how can we use that to get them to take more patients?\"\n\n\"We're short 16 nurses?  How many sick calls? 3? Well, there you go. They'll blame us but they're assholes who won't show up to work.\"\n\n\"If they complain about taking an admission, tell them to start thinking of these people as numbers, and to start thinking of them as people. That will shut them up.  Say 'what if it was your grandma? wouldn't you want them to be on the floor'?\"\n\n\"I don't care how many boarders there are in the ED.  I don't care if the ICU is out of physical beds. I don't want to hear any of these negative little bitch things.  It's one more patient. There is always room for one more. It's just one more\"\n\n\"All I ever about from the psych ward is 'acuity this and acuity that' like it's so dangerous. I don't want 'acuity' to become the newest buzzword that gets them out of taking patients\"\n\n----------------------------------------------\n\nYour ADO (admission despite objection - or whatever similar unsafe staffing reports - you file are never reviewed.  They don't matter at all.\n\nThere is no reasoning with anybody at the Director level.  Our CEO has set this really harcore objective that we will take every Direct Admit that our Beds department can find. Every single morning, we review every DA call that came in. It doesn't matter if we took in 5 or 30... we skip right past the accepts and review every single denial.  We have had an ED with 40+... 16 boarders for over 30 hours... every nurse working with a ratio of 7+:1... and if we turn down a single DA, we all get ripped up for it. Since our Beds dept is a group who sits in the basement and never provides pt care... it has created a system where they'll just actually accept anything because it's easier than getting punished for not doing so.  It's so toxic, haha.  The whole place is just a bunch of people who can't stand each other.\n\nAnyway, not trying to turn this into a venting session.... I just wanted to share how it really is.  And I work for a place with a reputation for being \"nice and community focused\".\n\nYou will be told over and over again that it isn't so bad. That you need to get over it. That you need to toughen up.\n\nNo.  You are straight being used and manipulated for profit.  It isn't right, and nobody is winning but the executives.\n\nIn our hospitals, falls and sentinel events are way up... patient satisfaction is plummeting.  None of it matters.  I was asked by a Director to investigate why there had been so many falls on our med/surg floor... I said \"well, probably because we have three nurses for 30 patients\" he said \"I can't take that to the board.  I need you to find out why they aren't being trained properly.\"\n\nIt's bad. It's worse than you think.\n\nEstablish unions.  If you're already in a union STRIKE AND FIGHT BACK.  There is nobody looking out for you.  You need to help yourselves.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
    "title": "You are Justified.",
    "subreddit": "nursing",
    "timestamp": 1702784064,
    "score": 403,
    "keyword": "american ceo"
  },
  {
    "text": "The Daily Podcast by NYT releases ep: 1 of 5. “The Retrievals”. Yale Fertility Clinic Nurse diverted Fentanyl by switching many vials with NS. Hundreds of women suffered horrific pain during egg retrieval. I just finished listening to the first hour long podcast that interviewed several of the victims (patients) who suffered horrific pain after being given NS instead of Fentanyl for their IVF egg retrieval by a Yale Fertility Nurse and I’m in tears. \n\nFirst. If any of these victims ever read this we (Nurses everywhere) are deeply sorry, disturbed, and outraged by what happened to you. I’m livid that a Nurse whom you and the medical team at Yale IVF trusted could’ve knowingly caused this needless physical and emotional suffering. I don’t know the outcome yet, but I simply wanted to validate your experience and offer support. This \nex-Nurse must be held accountable if she isn’t already. \n\n*I’m also furious that diversion training/education is a failure in large institutions such as this. How did no one pick up on a pattern of abnormal responses to sedation and real time reports from patients sooner? How didn’t they switch to another narcotic when the same patients came back over and over for procedures requesting something different for pain( they could’ve trialed anything else) given they were receiving so many complaints of severe pain during and post procedure?!*\n\nI understand that due to the opioid epidemic the healthcare industry has almost reversed our stance on pain as the 5th vital sign, out of fear of over medicating, and contributing to addiction. However we are overlooking and missing some very serious issues in our field because we are blinded (and jaded) by the heroin/fentanyl crisis. \n\nWe also need to close the loop here and point out how Hospital Administration, CEO’s and board members directly contribute to the worsening working conditions inside most US healthcare systems. \n\nWe have no pathway or protections for whistleblowers in our highly abusive industry. Nursing staff is rampantly in unsafe working conditions and indoctrinated to believe “that’s just healthcare”. We usually start young, and are traditionally a working class professions that has been plagued with and divided by Right Wing conspiracies and agendas. We need to raise the standard and pay to retain quality, properly trained staff. We have lost so much during the pandemic and things seem to be getting worse. \n\nMore if these things will happen if US society continues to run healthcare this way. Nurses need to be listened to by the media and elected officials. Hospitals have and will threaten us, we are afraid to pea speak publicly. This is the only place I feel safe from retaliation. We need the public’s help to fix this slowly imploding cesspool we call American Healthcare Systems.",
    "title": "The Daily Podcast by NYT releases ep: 1 of 5. “The Retrievals”. Yale Fertility Clinic Nurse diverted Fentanyl by switching many vials with NS. Hundreds of women suffered horrific pain during egg retrieval.",
    "subreddit": "nursing",
    "timestamp": 1688508662,
    "score": 8,
    "keyword": "american ceo"
  },
  {
    "text": "I now understand why so many are choosing to drop out of the workforce. I now understand why so many people have decided to exit the work force voluntarily. They are tired of being told false promises and working their butt off just to be paid what a homeless person makes holding up a sign. The fact that the minimum wage is still 7.25 an hour should warrant a national worker strike. This number is totally unacceptable, unethical and unsustainable. We have so many that are working homeless people clocking into their jobs giving it their all just to sleep in a parking lot. How exciting. The American dream died and greed has killed it. Meanwhile boomers get to retire early we probably won't be able to retire at all. We all know it's wrong and because we know it is wrong it will fester in our subconscious making every day of remedial labor more dull and depressing. How can anyone be content with being paid 400x less than the CEO of the company they work for? If they consider your labor so valueless than why work for them at all?\n\nPeople in their 20's are losing. Society has utterly failed them. They butter us up with school and feed us false promises in the educational system. \"Get good grades!\" \"Go to college!\" \"Get a good job!\" \"Buy a house!\" \"Start a family!\" etc. Just for these same people to be hit with the biggest reality check they have ever seen once they reach the age of adulthood. We thrust these young people out into the world with false expectations and once reality comes crashing down they fall into a pit of depression. Depressed that they are most likely never going to make enough to own a home. Depressed that they will never be able to retire. Depressed that they will never be able to comfortably start a family. Depressed that their workplace will never treat them with respect. Depressed that they live paycheck to paycheck and are always on the brink of homelessness. What do we expect of these people? To be content as third class citizens within a two tier system? While the ultra mega rich buy up their 300th house the average working man can barely afford rent? Is this really a position anyone would be content with in the richest country to ever exist? The numbers speak for themselves. We are dealing with a massive worker shortage and for good reason. People are no longer putting up with long hours, low pay, and over-productivity. \n\nSociety can not function without the working class. However, society would function perfectly fine without the CEO's and the wall street speculators. We need more people to \"drop out\" of the work force and go on strike. Let these corporations shoot themselves in the foot. We need more unions, more quiet quitters, and more disobedience. This has become a class war. I was just driving past a Ford factory and the entire work force was on strike at 11pm at night! Teach these companies that the real power lies within the people. If a company does not pay over 20 dollars an hour NO ONE should work for that company. We need to make it so low pay is completely unacceptable within our society. If you are at a job interview and the employer tells you the job only pays 15 dollars an hour you should walk out of the interview immediately. If an employer is making you work long hours with low pay give that employer an ultimatum. Either you pay me a living wage or you find someone else to work. You'd be surprised how much these companies are pulling in daily. The management class are all driving 100,000 dollar cars meanwhile those that do the majority of the labor can only afford to take a bus. Society has grown a subconscious resentment towards the upper classes over the years. Items have tripled in price yet we are still getting paid the same wages. These corporations want us to fend for ourselves while at the same time expecting unending loyalty towards them. You break your back and in return you can buy cheap food to sustain yourself and maybe if you are lucky you can buy a studio apartment and a car. You won't be able to afford healthcare. You won't be able to afford dental. You won't be able to eat healthy. You won't be able to save in case of an emergency. They are working us towards our death and we don't even know it. This is modern day slavery but instead of a whip they hand you a credit card. In return they get your soul. Complete obedience is the only definition of a \"good worker\" in this society. Good luck trying to call off to spend time with your family. In America it is perfectly legal to give ZERO PTO hours a year. You will work yourself to death in such a system, just in time for your retirement. What a lovely exchange. In return for dedicating 50 years of your life for this company you will be rewarded with back pain, health issues, and an early death. The shareholders are laughing all the way to the bank thinking about how much money they are making off of everyone else's suffering. They will say \"People just don't want to work anymore!\" but what they are really saying is that people do not want to live in an exploitative system that treats them like dirt and does not give them the necessity's of a quality life. People are wising up.",
    "title": "I now understand why so many are choosing to drop out of the workforce.",
    "subreddit": "WorkReform",
    "timestamp": 1694879223,
    "score": 901,
    "keyword": "american ceo"
  },
  {
    "text": "JPMorgan CEO Jaime Dimon claims that Americans are on an economic \"sugar high\" even as 39% of Americans struggle to pay their bills Article:\n\nhttps://fortune.com/2023/09/26/jamie-dimon-jpmorgan-ceo-the-fed-interest-rates-7-percent-soft-hard-landing-recession/\n\n39% source:\n\nhttps://stephensemler.substack.com/p/evaluating-human-security-conditions",
    "title": "JPMorgan CEO Jaime Dimon claims that Americans are on an economic \"sugar high\" even as 39% of Americans struggle to pay their bills",
    "subreddit": "WorkReform",
    "timestamp": 1695761892,
    "score": 802,
    "keyword": "american ceo"
  },
  {
    "text": "American Airlines gives CEO Robert Isom bonus following post-pandemic travel surge Isom, who took the job in March 2022, is getting a promotion bonus of $2.75 million.\n\n [**American Airlines**](https://www.dallasnews.com/topic/american-airlines/) CEO Robert Isom is getting a bonus after a “successful post-pandemic transformation” and taking the helm of one of the largest airlines in the world last year, [**according to a regulatory filing on Thursday**](https://chrome-extension//efaidnbmnnnibpcajpcglclefindmkaj/https://americanairlines.gcs-web.com/static-files/864c8d44-2d68-46d5-b194-f1077a88c52f).\n\nIsom, who stepped into the job in March 2022, is getting a $2.75 million bonus and $8.25 million worth of restricted stock grants aimed at incentivizing the CEO to keep the company performing during his tenure.\n\n Isom is making a base salary of $1.3 million along with a $2.6 million potential bonus and a long-term incentive grant of $11.25 million. Isom’s total compensation was $4.89 million in 2022, about $115,000 less than he made in 2021 when he was the company’s president.\n\nAlso getting a pay bump at American is Stephen Johnson, vice chair and chief strategy officer to reflect his expanded roles over the airline’s regional carriers and cargo business, according to the filing.\n\n Johnson, who took the job in May, will get a base salary of $850,000, a target cash incentive opportunity of $1.2 million and a long-term incentive grant of $3.68 million. He is also getting a one-time grant of 181,554 restricted stock units. Johnson previously had a base salary of $500,000.\n\nBeginning Sept. 20, Isom, Johnson and David Seymour, chief operating officer at American, all enter restrictive covenant agreements and severance agreements, as well. Johnson made $3.49 million last year, while chief operating officer David Seymour made $3.17 million in total compensation in 2022.\n\n [**Southwest Airlines**](https://www.dallasnews.com/place/20be97be-55fe-dd09-4a58-bc78e7479c4f/southwest-airlines/) CEO Bob Jordan received a 75% pay and compensation increase in his first year on the job, a year that ended in an[ **epic debacle as the carrier’s operations melted down during the holidays**](https://www.dallasnews.com/business/airlines/2022/12/29/southwest-airlines-hopes-restore-its-full-flight-schedule-by-friday/). He made $5.33 million in total compensation for 2022 which was [**below the $9 million in total pay, stock awards and other benefits he could have potentially earned for the year,**](https://www.dallasnews.com/business/airlines/2022/02/07/southwest-airlines-new-ceo-bob-jordan-gets-pay-raise-increased-bonus-potential/) but higher than the $3.05 million he made the year before when he was the executive vice president of corporate services,[ **according to regulatory filings from April.**](https://otp.tools.investis.com/clients/us/southwest/SEC/sec-show.aspx?FilingId=16549584&Cik=0000092380&Type=PDF&hasPdf=1)",
    "title": "American Airlines gives CEO Robert Isom bonus following post-pandemic travel surge",
    "subreddit": "WorkReform",
    "timestamp": 1695345249,
    "score": 223,
    "keyword": "american ceo"
  },
  {
    "text": "We need to form a national union. We need to form a national union. Imagine if we shut this country down for days and bring the economy to a halt. Only then would the CEO's realize how useless they are. The combined might of the working class can give us everything we have been asking for and more. No one should be working 80 hour weeks and living paycheck to paycheck. No one should be living without healthcare. No one should be living without dental treatment. No one should be unable to feed their family. No one should be unable to afford retirement. No one should be working while homeless. If one worker is suffering we are all suffering. That is the mindset we have to have in order to win. They pit one worker against the other. That is how they have gained an unfathomable amount of power.\n\nUnions should be in serious talks with unions across the country right now. The UAW is hoping to kickstart a chain reaction that will uplift the vast majority of workers around the country. We need to look at their courage and find it within ourselves to fight for what is right. Lets fight for our children's right to a fair wage and a bright future. Lets fight for the right to make an honest living again and bring back the American dream. Have we truly become so domesticated that we no longer see value in getting our fair share? We are expected to put our heads down and take it. Day after day while the ultra rich run off with the loot and you are left scrounging month to month in order to pay for basic necessities. It is time for the working class to fight back. We need to organize on a national level and enact a general strike that will bring a livable minimum wage. Something we haven't had since the 50's.\n\nWe need a minimum wage that adjust every year to match inflation. A decent apartment cost 2000 dollars when 10 years ago it was no more than 700 dollars. Yet our wages have barely increased. You used to be able to go to the grocery store comfortably with only 50 dollars in your pocket. Now you would need to spend 200 dollars to buy a weeks worth of groceries. We are quiet literally being starved to death. The longer this pattern continues the worse it will get. While the CEO class buys up all the property and trades housing like baseball cards the rest of us will have to forgo the idea of ever owning a home. We are no longer the greatest country in the world. We are slaves by choice. We go to our crappy jobs every day never rising up against our corporate masters. They laugh in our faces when we ask for a decent living and see us as sub human animals unworthy of human rights. What they don't know is the spirit of the American laborer is the most important aspect of this country and this country wouldn't be anything without us. The reason they are able to buy a fancy yacht is because the working class put their blood, sweat and tears into building it. While all the CEO class does is gamble on the stock market. Creating nothing of value yet somehow we are all under the illusion that they are more important than us. The lowest worker produces more value than the highest rated CEO. Every second of your time and your labor has an inconceivable amount of value. The least you could be rewarded with is a livable wage and the right to live healthy.\n\nI hope more unions join in on the fun. F these corporations and CEO's. F them like they have been Fing us for the last 50 years. Shut them all down. Greed has utterly destroyed this country and has left it unrecognizable and a shell of it's former self. Once the CEO class is unable to put food on the table due to not being able to get anyone to make the food for him, then maybe they will start listening. Boycott CEO's, boycott corporations, boycott enemies to the working class. The consumer has a role to play in this as well. If a company is not willing to pay a living wage than they should not be able to stay in business. Either play ball or die. Eat the rich like they have been eating us. Billions of dollars in bailouts to corporations yet no one is willing to bailout the American worker when we are in need. When we ask uncle Sam for a helping hand uncle Sam spits in our faces. When a corporation ask for a helping hand Uncle Sam gladly gives it whatever it needs with no strings attached. That has become the way of this country. The power dynamic is clear and apparent. Think congress will give you what you want? Think again. There hasn't been a minimum wage increase in 15+years. A homeless man makes more than the federal minimum wage. Yet nothing is ever done because our elected officials don't answer to us. They answer to the 1 percent. Lobbyist have taken everything from us. Our retirement, our pensions, our living standard, our healthcare, our dental. Nothing is off limits.\n\nYou know what you need to do.\n\n&#x200B;",
    "title": "We need to form a national union.",
    "subreddit": "WorkReform",
    "timestamp": 1695497988,
    "score": 218,
    "keyword": "american ceo"
  },
  {
    "text": "American Workers are Brainwashed. This is why so many Americans are so unsatisfied with their jobs. In no other country do we see the kind of suicide, depression and mental health issues that we see in the good ol' USA. From the moment we enter kindergarten until the moment we die we are being subconsciously conditioned to be mindless robots for the ownership class. Our mental health is put on the backburner for better grades. We sit down, shut up and work for 8 hours a day take a 30 minute lunch then go home and work in our \"Free time\". This is nothing more that brainwashing propaganda to get future workers accepting unpaid labor, long hours and blind obedience. The more you work the more your creativity is drained out of you. Your passions slowly disappear and your friends are seen more as a burden than a necessity. The only thing that matters is work. Your ability to progress in life is totally dependent on your ability to impress authority figures with your blind work ethic. \n\nSo you graduate and now you put what you have learned to the test. I am not talking about what you learned in your books and homework. I am talking about the patterns and habits that have been engrained in you for the last 12 years. When you enter the work force you will obediently be pulling double shifts and working endlessly to please the ownership class. The more your owners are happy the better you are suppose to feel regardless of your mental health, regardless of your social life, and regardless of your physical wellbeing. The only thing that matters is making your owners happy and hopefully getting a better \"Grade\" so you can progress in life. Hoping for that raise or maybe that new position. Begging for scraps from your boss and grabbing at crumbs all while the CEO buys a new yacht with the fruit of your labor. This is an unnatural social dynamic so it had to be conditioned into the minds of American workers from their conception. Public schooling is nothing more than a brainwashing centers created by billionaires to make you an obedient slave for your designated corporate overlords for the next 2/3rds of your life.",
    "title": "American Workers are Brainwashed.",
    "subreddit": "WorkReform",
    "timestamp": 1676714431,
    "score": 197,
    "keyword": "american ceo"
  },
  {
    "text": "One Year Later... a new business owner's journey to being a desirable and fair employer. Hi Folks.\n\nAbout a year ago I started my own business, and I came to this sub to solicit ideas on how to make my business one that treats its employees differently than the average American business.\n\nPrior thread here:  [https://www.reddit.com/r/WorkReform/comments/unt8j9/as\\_a\\_founder\\_at\\_a\\_new\\_company\\_what\\_are\\_some/](https://www.reddit.com/r/WorkReform/comments/unt8j9/as_a_founder_at_a_new_company_what_are_some/)\n\nBackground:\n\nI was fired for no cause from a media production agency last March because the executives at the top didn't value the people on the front lines.  In a company of 44, 10 were let go in one day because the CEO spent more than $330,000 out of the company coffers on paying off his house.\n\nWe found this out because our sales call recording software wasn't partitioned correctly and all executive calls were available to our remaining colleagues, who promptly rifled through them and heard all sorts of great things about how the executive level \"didn't give a fuck\" about removing 25% of the company in one swift blow.\n\nI founded my own agency the next day, and resolved that I would never be so cavalier about other peoples' employment when I ran the show.\n\n&#x200B;\n\nHow it's going:\n\nMy business is pushing towards $400,000 a year in revenue.  Along the way I've worked with incredible contractors, including a friend of mine I've known for 15 years.\n\nThis is now his full time job aside from a few supplemental gigs he takes on every few weeks (Some of our weeks are busier than others).\n\nDue to our success, we've been able to institute a mandatory $30 an hour minimum wage for all folks working with us here.  As we grow over the next few months, the goal is to move that to $35 an hour for all positions.  My personal take home as CEO and founder current remains locked to my team's.  I do take a few small profit distributions ($1-3K per quarter) as an additional perk.\n\n&#x200B;\n\nSo many of you gave incredible advice on benefits last year, and I cannot thank you enough for telling me the amazing ways to share the success of the business with others.\n\nBased on your input, we codified the following core company values to ensure my business was a place that not only helped me but focused on OTHERS as well.  (These were brought to everyone who works with me to workshop them and make sure that they were values that the team could get behind 100%)\n\nThey are: \n\n1. Act with Integrity -  Doing the Right Thing is Always the Right Thing.\n2. Fight It Out - We Defend our Ideas Passionately,  but Not Blindly.  \n3. Prosper Together -  The Company Works for All of Us — Not Just Those in Charge.\n4. Take Measured Risks - Both Data and Heart Gets the Best results\n5. Build Business on Relationships -  Be an Agency Customers Never Want to Leave\n\n&#x200B;\n\nNumber 3 is one that REALLY stuck out with me based on my past experiences and the feedback I got here last year.  Thank you for helping me keep my business success grounded and working for both me and the folks that work with me.\n\nAs soon as it is feasible, we are enacting the following:\n\nMoving contractors who work full time hours into the actual \"employee\" category.\n\nFinding Healthcare, Dental, and Vision coverage for those employees\n\nEnacting a 4 weeks mandatory vacation policy, with tracking to ensure it is taken in ways that benefit both the worker and the business (not just taking a month off whenever)\n\nProfit sharing (I have no idea what this will look like, but quarterly sounds great right now!)\n\nHoliday Season Bonuses\\* (We were able to give our team some wonderful financial gifts this year based on their level of involvement with the company, but I'd prefer this be something more than just a few hundred or a few thousand bucks haphazardly written out)\n\n $1000 Home office conversion stipend\n\n$50/ month Internet use/cell data stipend\n\n&#x200B;\n\nThere are many other perks I've been looking at (mat/pat/adopt leave, cost of living and inflation adjustments and more) and have placed on a 1,3,5,10 year Vision/Traction organizer (VTO) and plan to implement to take care of the team, but that's a little far down the road for what I can see with the resources I have at hand.\n\n&#x200B;\n\nI would like to ask this sub, are there NEW types of compensation, benefits, perks, and other ways to make work better for folks that I've missed?  I'd love to stay current on what I can offer my team down the road that not only helps to value them, but makes my company a place where people want to work.\n\n&#x200B;\n\nAlso, what do you think of the way things have developed so far?\n\nWe've had no capital to work with from day 1 and the company was founded on the last $26 of disposable income in my pocket.  Everything that's happened has been a result of the team's hard work, and I'd like to continue to make sure they are appreciated financially and are fulfilled in what they do every day.\n\n&#x200B;\n\nYour help is tremendously appreciated.  Thank you all for continuing to advocate for sensible reform on work and for helping me make a better workplace for the people who trust me with their employment.\n\n&#x200B;\n\nP.S. European folks, I want to hear from you especially with what works in your countries!",
    "title": "One Year Later... a new business owner's journey to being a desirable and fair employer.",
    "subreddit": "WorkReform",
    "timestamp": 1676422845,
    "score": 157,
    "keyword": "american ceo"
  },
  {
    "text": "Discussion about the 32 hour work week. I'm actually really curious on Americans opinion of this idea and the bill that's been recently proposed. \n\nMy mom for example, hates it, thinks it's for the weak and lazy. And that it'll cause economic collapse. \n\nShe works 7 days a week in a factory as a supervisor and is pretty conservative. She works around 80 to 90 hours a week year round. And if she gets a rare off day, she sleeps the whole day. \n\nThis is how everyone should be. And she indeed has said the rich and wealthy \"earned every bit of it\" and I wouldn't be surprised if she actually thinks the CEO works 380 times harder than an assembly line worker. \n\nI'm a student, and also work full time in a factory, this is nearly impossible. I work 6 days a week pretty often and barely get my homework done on my 1 day off. \n\n*everyone* I know, all they do is brag who's working the most hours or is the hardest worker. They all work lame production jobs at factories and that's all they talk about, who works more. \n\nI'm all for a 32 hour work week. If the week was reduced to that amount, I highly doubt factory jobs that regularly work 70 to 90 hours a week would just shut their doors down, it'd either decrease your toil by a small amount, or just get you 8 hours extra overtime pay. \n\nI've gotten into arguments with tons of users on here who claim that the 32 hour work week will put 60% of Americans into poverty and will kill millions. \"60% of Americans live paycheck to paycheck, a 32 hour work week is a pro corporate bill to cut everyone hours\". \n\nSure. I highly doubt that. And don't think the intention of a 32 hour work week is to reduce Americans into poverty. And instead of looking at it as a time freeing bill. They claim its going to destroy the working class. \n\nFor one, if 60% of families started starving, there'd be revolution. \n\nThat's fine with me. Revolution sounds great. \n\nAt the very least, if it passed, and it made things worse, it'd be an opportunity to negotiate and fight for higher wages with the reduced hours. \n\nThing is, if we just keep saying \"no keep it the same!\" You start to sound regressive and conservative. Cause we've been doing things the same for a while and it's not helping. \n\nReducing the work week is NOT regressive, the last thing corporations want is for people to work less. \n\nAnyway, what are your thoughts?",
    "title": "Discussion about the 32 hour work week.",
    "subreddit": "WorkReform",
    "timestamp": 1679417798,
    "score": 126,
    "keyword": "american ceo"
  },
  {
    "text": "Why do people are always angry at CEOs but never at other top earners? I just wonder why CEOs are mostly are being frown about, when personally I dont get it how in our society person kicking the ball could be earning same amount as 3000 average Americans. That just sounds insane. Musicians and actors, same story.",
    "title": "Why do people are always angry at CEOs but never at other top earners?",
    "subreddit": "WorkReform",
    "timestamp": 1694411660,
    "score": 121,
    "keyword": "american ceo"
  },
  {
    "text": "If things don't change soon this country might not survive the next decade. America is centuries behind the rest of the world when it comes to workers rights. We have put up with this nonsense time and time again. we continue on and on with this neo-slavery model of the rat race. Humans are no longer longer seen as humans with emotions, differences, aspirations, character, families and community's but rather a tool for corporations to exploit. America is designed to make you go crazy. It may not be now, it may not be 20 years from now. But if you continue to put up with the 80 hour week model a lot of us endure you will go crazy at some point.\n\nThe most minuscule medical diagnosis could set you back thousands of dollars. It is at this stage you realize the hospital is not your friend. At your weakest moment you will be given a bill which will mean you will have to put extra hours in at the office. So you finally graduate school, and you think your position in life will finally change but again...you are handed a bill which of course means you will have to put in extra hours at the office.\n\nSo decades pass and you think you finally see the light at the end of the tunnel but suddenly your rent goes up by a few hundred dollars. You must yet again...put more hours...in...the....office.\n\nNo matter how much you work no matter how hard you try the slightest inconvenience or mistake can set you back years if not decades. The American dream of vast acres of land to be explored and tamed to your liking is over. If you are lucky you will be able to sign up for a 30 year loan with 5% interest rates on a 500,000 dollar home somewhere moderately safe. But most of us will have to settle with room mates and the unlucky ones might have to sleep in their car or a motel. We have an entire generation of men, woman, and children with almost zero stability from month to month. Our future is uncertain and we are at the mercy of those with more power, more resources and more connections. \n\nIt is the equivalent of joining a game of monopoly at the tail end of the game and being told \"Pull yourself up by the bootstraps! You can win if you just put your mind to it!\" Those that are very lucky might be able to buy a plot or two but the vast majority of us will go completely bankrupt with nothing to show for it...just as the game intended. \n\nAnother thing that people forget is that as we dedicate more and more of our lives to our jobs the less social, family and community ties we will have. Hanging out with friends becomes increasingly more difficult. setting aside time for a family event becomes impossible. Having time to meet your neighbors or spending a few minutes to chat with people in your community becomes a chore. A lot of us are simply hanging by a thread if hanging by anything at all. Every second counts in todays world of hustle culture. You spend 8 hours sleeping in preparation for work in the morning. Then you spend a further hour in the morning preparing yourself for work. Then you spend another hour driving to work. Then you spend a further 8 or more hours at work. then another hour driving home in high stress rush hour traffic. If you are lucky you might get a couple of hours at the end of your day to do as you please. But in the end you will never really enjoy it because in the back of your mind you know you are going to have to go through the same anxiety riddled scenario the very next day. \n\nIn an ideal world people wouldn't fear waking up in the morning. People would look up to their boss as a leader and the worker would be comfortable traveling from point A to point B without fearing death. Commuting to work should be paid by the company you are working for. If they cannot afford to transport workers to their job then they should be paying enough taxes to build the appropriate public transportation.  America has become Disney Land for the rich and an open air prison for the poor. You have to pay 2000 dollars or more for a drivable car just to get to work when that money could go to a stable non stress inducing transportation system. Nearly 70 percent of drivers have driving anxiety. Why is so much of our life dedicated to something that makes us scared and fearful? Humans weren't meant to drive 2 ton vehicles going 70 miles per hour. For those of us that do not feel comfortable doing so there should be alternate options. People that are incapable of driving shouldn't be cut off from the rest of their community and forced to walk hours at a time to get needed jobs/services. If you live in Michigan you would know it is a city built for cars, not people and it is a nerve wrecking nightmare. The only construction that is taking place here is for cars never for humans. The roads are also undrivable filled with massive potholes that can disintegrate your car in an instant, and you will have to spend thousands on maintenance. so yeah...fun right?\n\nI do not know how much longer the American worker will continue to take these unfair conditions. Most people do not have anyone to talk to because we have dedicated our lives to work instead of each other. There should be a 25 dollar minimum wage to compensate for all the things I just mentioned. Workers should not be spending half their income on housing and the other half on transportation. We need to start demanding those in charge start designing a livable society that doesn't require being in the top 1 percent to enjoy. How has our standard of living fallen so far since the 50's...I'll tell you why. Mismanagement, inequality, bad planning and corporate greed. Why should the people in charge care about the roads when they can just use their 2 million dollar helicopter to  take them to their 8th mega mansion? Meanwhile the ones that work under them are walking tens of miles to work because unfortunately owning a car is becoming increasingly unaffordable to many.\n\nThe commoners have had enough. Mental wellbeing is at an all time low. You can not have a functioning society with this many problems being swept under the rug. This is the first time in American history the new generation will grow up poorer than the old generation. Wealth is usually passed on but this time there just isn't anything left to pass on... The only positive thing I can say about what is happening here is that it may be a lesson for future generations to prevent this from ever happening again. People are just starting to wise up to the absolute chaos that is this so called \"economy\" that slowly sucks the life out of you day by day and you are expected to sell a piece of your soul every time you head in to work. So enjoy your freedom. The freedom to be at the mercy of your boss. The freedom to be at the mercy of your landlord. The freedom to go bankrupt at the slightest medical inconvenience. The freedom to drive a 2 ton vehicle on highly convoluted and overcrowded roads. The freedom to lease your labor to a corporation and never own your own creations. The freedom to be paid an unlivable wage that guarantees poverty. The freedom to give up family, friendships and community in favor of meeting deadlines. The freedom to pay exorbitant bills to multi billion dollar companies that see you as a resource. The freedom to delay retirement a few decades because you have been working your whole life and still own nothing. The freedom to \"buy\" a house by signing a 30 year loan. The freedom to go to school and be buried in student loan debt. The freedom to work your entire life for a company expecting a promotion just for them to replace you with a robot at the drop of a hat. The American dream is just that a dream. It's time to enter the real world and address the problems we have been ignoring since the 60's\n\n1. Provided food and housing for all that work full time (No one should be working and homeless)\n2. Safe, accessible, and low cost public transportation for morning commutes. (People should not be forced to drive just to go to their local grocery store)\n3. Equal distribution of corporate resources/profits amongst the workers.  (Workers should each be given a percentage of the profits made by a corporation. Workers should not be doing all the work and be given a tiny percentile of profits)\n4. Public healthcare system that is affordable (Anyone who is working should be able to be healthy while they work. No one should be working while unable to afford care for their bodies)\n5. A realistic and fair way to achieve the American dream (Start family/House/College)\n6. Give all workers a voice in their company's. (Democratize work force. Everyone gets to vote, disagree, or agree to workforce policies)\n7. Minimum wage of 25 dollars an hour adjusted each year for inflation ( Every year workers will be paid a livable wage no one should be working 10 dollars an hour while their CEO is making 10 million)\n8. Better safety protocols in the workplace (People shouldn't put their health/safety at risk just to meet insane quotas)\n9. Guaranteed vacation for at least 1 month out of the year. (We should be working to live not living to work)\n10. Transparent hiring practices (The current method of hiring is shameful and disgraceful to the worker. No one should have to show up to 5 interviews and take 2 hour long test just to not even land the job. Hiring should be transparent for the applicant. If you are denied for \"Having too much experience\" or \"Not having enough experience\" The employer must compensate you for wasted time. This will give more of an incentive for companies to actually hire applicants rather than just waste 100 applicants time just to hire no one. The requirements for the position should be listed beforehand and if the applicant meets all those requirements and still isn't hired the employer should give reasons why. If they can't give a valid reason they should compensate you for wasted time. The current job market has completely alienated job seekers. it's time to put an end to companies lying about high wages to applicants on the job flyer just for them to show up to an interview and being told they would only be paid 8 dollars an hour. In a fair market this would be seen as fraud and false advertising. But because we care so little about workers companies are allowed to get away with this unbelievable behavior. And they wonder why no one wants to work?)\n\nThat is it. I hope that some of you took in what I have said. After years of suffering on dirt poor wages and living in the rat race I am finally starting to see it for what is really is. A scam. Everything is designed to funnel money out of the workers pockets, pull the roof from over the workers head, and take food out of the workers mouth. If you think working will make you happy you haven't been paying attention for the last 50 years. The worker is being hit from all sides and it is up to us to stand up as a class and say enough is enough. The alternative is to keep living as indentured servants to your chosen bank or corporation. Is that truly a life you'd like to live? To die of old age knowing you wasted so much on so little? At your final moments you look back on all the years wasted trying to keep up with the never ending expectations and demands put on you by our unequal economy. Having the rug pulled right from under you before your last breath. You realize it was all a scam. The American dream is just a dream. All the real world experiences you missed out on to chase the imaginary label of \"success\" but at the cost of your fulfillment, wellbeing and mental stability. Your boss doesn't show up to your funeral. Neither does your land lord, manager, banker, insurance agent, CEO, bill collector, etc. The only ones that show up is your friends and family that you've been ignoring all your life, chasing a lie. You are buried shortly after and the company that you worked for, for 50 years quickly replaces you with no mention of your disappearance. Ready to start the process all over again with the next sucker. The exploiters laugh knowing that you died owning nothing all while their wealth expanded exponentially. This is a fair system... but only to those at the top of the scheme. And you let them do it.",
    "title": "If things don't change soon this country might not survive the next decade.",
    "subreddit": "WorkReform",
    "timestamp": 1678521369,
    "score": 118,
    "keyword": "american ceo"
  },
  {
    "text": "CEO's Now Earn 272 Times the Average Worker's Pay  CEO compensation in 2022 was significantly higher than workers' pay, continuing the pay disparity trend in the last decade. This has increased strikes and labor actions demanding better pay and conditions. According to the AFL-CIO's annual Executive Paywatch report, CEO paychecks have increased by an average of $5 million over the last decade, reaching an average compensation of $16.7 million in 2022. In contrast, workers earn 272 times less than their CEOs, suggesting that an average worker would need five lifetimes to match a CEO's earnings. The report also revealed that the largest pay ratio was found in the communication services sector, where CEOs earn 508 times more than workers. These findings come amid slowing wage growth for workers, even as inflation persists. Meanwhile, predictions of a 'richcession' have proven false, with the wealthiest Americans maintaining a larger share of wealth. \n\n[https://www.msn.com/en-us/money/companies/ceos-now-earn-272-times-the-average-worker-s-pay/vi-AA1eOp4t?ocid=socialshare&pc=U531&cvid=5bc717661fe84007a520c5e3be30e267&ei=21](https://www.msn.com/en-us/money/companies/ceos-now-earn-272-times-the-average-worker-s-pay/vi-AA1eOp4t?ocid=socialshare&pc=U531&cvid=5bc717661fe84007a520c5e3be30e267&ei=21)",
    "title": "CEO's Now Earn 272 Times the Average Worker's Pay",
    "subreddit": "WorkReform",
    "timestamp": 1691210540,
    "score": 71,
    "keyword": "american ceo"
  },
  {
    "text": "Blind loyalty to your boss, the corporation and the system must be stopped. I have noticed a pattern within American culture. A culture which revolves around blind praise of anyone who has and the blatant disrespect of those without. A homeless man sleeping in his car while working full time will be treated like a speck of dirt and the millionaire who made his fortunes from inheritance and the stock trade will be treated as some sort of deity.\n\nWe do not live in a fair society. We are not all equal. We are not moral and we are not just. It is all based on those who have and those who do not have. A baby that is born to a parent who is working two jobs to pay rent will not be given the same opportunity's as someone who was born inside an elite household in a position of privilege and excess. Even the most basic concepts of health and nourishment are not guaranteed. Healthcare, dental, housing, free time and travel are all classified as a luxury.\n\nThe argument of \"Just get a better job\" is null and void in a substantial amount of cases. At some point the responsibility falls on regulatory powers to do the right thing and make sure living beings contributing in a society are not being exploited. We have millions of people who are simply stuck in poverty due to their inability to get ahead mostly due to their constant struggle to obtain basic needs such as healthcare. If a person has been injured on the job or experiences a mental illness is it not mandatory that those needs are addressed so that individual can re-engage within the work force? It is my belief that the reason we are seeing large fragments of our society living in tents and on the streets is because these people have been utterly forgotten and the burden being put on the worker has reached a breaking point. in an endless cycle of trauma and pain there it is no wonder so many are hopeless.\n\nWhy do we regard the people who continue to exploit these people and leave them in such a tired state? The CEO did this to them. Yet we worship them as super-heroes. Jeff-bezos is a name everyone knows and everyone reveres yet no one knows the name of the man who was left dead because Amazon didn't pay him enough to afford basic medical care and ended up dying in the streets because he couldn't pay his rent. We need a list of those names right now. economic warfare is being waged on the people to continue this cycle is nothing more than guaranteed self destruction. It may not happen now. It may not happen 50 years from now. But eventually we will wake up one day and look to our left and look to our right and we will all have nothing and be subjugated in totality by those that have everything. The land, the housing, the healthcare, industry, food, safety and security will be treated as another \"Luxury\".\n\nWhen will we as a people put our foot down and demand that we no longer are treated as second class citizens? How many people do you know who own land? How many people do you know who own a house? How many people do you know who have adequate healthcare, dental care and if they chose to could support a family of four? If you are under 30 then the answer is practically no one. Think about it. Here you are struggling to survive working 40 hours of your life a week with your blood, sweat and tears and you are not even given a shovelful of land. You are expected to sit down and shup up in the hopes that maybe 40 years down the line you will be able to buy a place to live at old age. Black rock has no problem swallowing up the fruits of your labor to gobble up as much of your communal space as it possibly can. In the end you get poorer. You own less. You get shafted. There is zero benefit to this system and it is no longer even fit for basic survival. No one in their right mind could sustain their life for a prolonged period of time on 7 dollars an hour. You will eventually either lose your mind or destroy your body attempting to do so. But somehow this is seen as normal in our country to knowingly give the OK to paid self-annihilation.\n\nJust a few decades ago you could easily pay a worker a living wage, a roof over their head, land, healthcare, benefits and a pension but now it seems as if getting these companies to give anything at all beyond a simple paycheck and leaving the worker to fend for themselves is next to impossible. Our generation has never experienced the American dream. We have always been exploited by industries, corporations, and debters. Your quality of life as a worker is seen as an after thought. I have no doubt the people who make the decesions in this country have no problem utterly defiling the vision it was built on. There was once the American...living on open land free to do as the American wished while maintaining and owning ideas, property and having ties to a family. None of which are possible now for pretty much everyone. Now you work yourself to death until you alienate yourself from your family and friends. Or you decide to go the route of \"sticking with family\" and inevitably ending up broke and with nothing. None of these values are guaranteed and are actually pretty rare in the grand scheme of things. I urge all of us to take this into account when promoting a Darwinistic narrative on success instead of just blind luck, power and privilege. If you think there is anything American about the way the \"free\" market is now you have been living under a bridge. No pun intended.\n\nI just don't get it. The only people who would even argue against these points are the people who would stand to lose their god like status in society from any reform being generated. People have been shouting for 15 dollar minimum wage for the last 15 years and they are treated as radicals. When realistically 15 dollars an hour is far far too generous on the ownership elite. I'd say 30 dollars would be a fair start. I love it how they have no problem raising rent but god forgive us if we raise the wages of hard working people by a couple of dollars. Sickening.",
    "title": "Blind loyalty to your boss, the corporation and the system must be stopped.",
    "subreddit": "WorkReform",
    "timestamp": 1673888510,
    "score": 36,
    "keyword": "american ceo"
  },
  {
    "text": "Drafted A Letter to Congress to Update the WARNING Act hello all, long time lurker and first time poster.\n\nFirst, I’d like to say that I am not a writer. Nor do I know much about politics or any type of political science matters, but last week several of my friends lost their jobs. Listening to them the last few days and what they are going through made me realize how little employees are protected, particularly when layoffs begin to happen en masse across several industries that share the same talent pool.\n\nIn talking with my partner, they gave me some basic background on how our friends were being protected underneath the WARN act. When I started to read up on it, I learned that it was introduced in 1988 and has had very little updates since then. After talking with my friends, I felt that Congress should be addressing this act and introducing new requirements against corporations. Below is a draft of what I was thinking about sending to my representatives. I appreciate any level constructive feedback. I 100% know that this is a *pipe dream* to get Congress to do something but I wanted to try to do something.  If anyone likes it as is, please feel free to take it and send to your representative.\n\n**DRAFT - 1.1 - Updated 1/24/2023**\n\nDear \\[Member of Congress\\],\n\n<IF PERSONALLY AFFECTED BY LAYOFFS, I recommend input a personal paragraph on your layoff experience>\n\nI am writing to you today to ask for your help in updating the Worker Adjustment and Retraining Notification Act to include five new provisions. As you know, the current act has been in place since 1988 and has not been updated with the times. This lack of modernizing the act has resulted in a number of issues due to no longer representing the American workforce and job market. U.S. Rep. Joe Courtney, who serves on the House Education and Labor Committee, said in a written statement, “I believe that there are places where the current WARN Act could be improved to ensure that the intent of the original law is met.\" Now is the time for Congress to protect the US workers.\n\nIn light of recent economic events and with more than 60,000 individuals being laid off within 72 hours from companies such as Amazon, Google, Meta, Twitter, Microsoft, Spotify, and more; it is even more important that we update the WARN Act to provide workers with the protections they deserve so that future layoffs ensure those affected have a better chance than those today.\n\nIn order to update the act to better serve those affected by layoffs, I am requesting five new provisions be added.\n\nThe first provision would stop mass layoffs from happening at once across several companies and require delayed timing of layoffs in similar fields which reduces the flooding of the job market and allows for the current available options to be true opportunities for those looking for new jobs.\n\nThe second provision would prevent CEOs and board members from any form of compensation such as bonuses or incentive payouts for two years. This would ensure that executives are held accountable for the decisions they make which could potentially harm the livelihood of many people.\n\nThe third provision would require that a company reduce salaries of CEOs and leadership if the CEO to worker pay ratio is more than 100 to 1 to reduce the “greedflation” that has risen in the United States. The reduced salary amount would be applied to employees that would be affected by the potential layoff. Allowing for potential economic stability to the lowest-earning employee more at risk of loss of quality of life. This allows the beloved “trickle down” economics that capitalist industry supports so much to be put into practice.\n\nThe fourth provision should be an evaluation of company profits and its unit labor costs, and if the labor costs is lower than 60%, a requirement that the corporation must adjust their costs to a minimum of 60% before layoffs can be notified under the WARN act. Additionally, if a corporation refuses to comply to this, a windfall tax be applied against all corporate profits under the previous and current year of the layoff.\n\nThe fifth provision should be that corporations that offer stock to employees be required to fulfill the stock options fully for the year that employee is laid off. Several corporations use stock options as a means to bolster employee compensation packages with a potential higher salary through stocks. During layoffs, those shares are often taken back or unfilled to the employee due to not vesting in time before final employment date.\n\nThese proposed provisions are supported by numerous economic studies that show that layoffs have long-term, negative economic consequences. For example, a 2017 study by the National Bureau of Economic Research found that “mass layoffs have a large and persistent negative impact on wages and employment of those who are laid off as well as on average wages in the affected area.” Another study from the Economic Policy Institute found that “layoffs can have long-term negative impacts on workers’ career trajectories, and can contribute to the increasing inequality of wages in the United States.” A more recent article \"What Companies Still Get Wrong About Layoffs by Sandra J. Sucher and Marilyn Morgan Westner\" featured in Harvard Business Review highlights and supports the need for the WARN act provision updates.\n\nIt is clear that the WARN Act needs to be updated in order to provide workers with the protections they deserve. I urge you to consider my proposed updates and take action to ensure that American workers are provided with the economic security they need.\n\nSincerely, \\[Your name\\]",
    "title": "Drafted A Letter to Congress to Update the WARNING Act",
    "subreddit": "WorkReform",
    "timestamp": 1674513242,
    "score": 31,
    "keyword": "american ceo"
  },
  {
    "text": "How do you get workers more involved with there union? This is a copy and pasted post I made on another sub but also fits here and I'd like some advice. \n\nWhat do you do when workers won't actually put in effort for things that can improve their lives?\n\nRecently we formed a union at my work place.\n\nA little bit of detail, there is a neutrality agreement. So to start a union it's as simple as getting a majority of workers to sign a union card. \n\nThis company has been union busting since I started here. \n\nAnyway, we got the majority of people to sign a card. Well, when we had these little bargaining surveys they basically asked questions about things you want the bargaining committee to address. \n\nFor those who don't know, unions are supposed to be democracies, where people vote for a committee to address these issues. \n\nSo we also had surveys, to get an idea of the issues the majority of workers want addressed.\n\nUgh, I work here and have worked here for years and these people are so lazy they won't even take 5 minutes to fill out a survey. \n\nOK, you have issues you want addressed in the workplace? Yes. OK fill out this survey and explain the issues. \n\n\"Ugh I don't have time\" \n\n\" ew it asks if I'm on government assistance, you know that's for lazy people right! \" \n\nAnd I'll explain that it asks that to see if your wages are high enough to, you know, exist. And they're like \"well people who live off the gubberment are weak, lazy and entitled and-\" \n\nNeed I go on? Then they throw the survey away lol. \n\nI actually am starting to think the working class in America is so brainwashed they love being oppressed. \n\nDon't wanna work 90 hours a week? Haha, lazy. \n\nDude I'm in college and have been called \"lazy\" for not wanting to work tons of overtime so I can study. And I'm literally in school just to move up in the company. To be specific I want to be a technician in maintenance. \n\n\"Oh you want a better life? Well.... you do realize that's weak and lazy.... right? \" \n\nAnd people on here didn't believe me, they said I was making up what these people say. I posted on my profile a guy from a notorious factory in my town, he's in the UAW and he said and I quote, \"If you're not willing to work 12 hours a day 7 days a week, you're entitled, weak, and lazy\". It was on a Facebook post. He is not the only one. I'm not in the UAW but shame on him and the people who support him. I work in a different plant. \n\nThis is the working class in America. Back breaking work is honorable. Being tired and exhausted all the time is good! \n\nAnyway, man, we now are having the election for a bargaining committee. And I just simply went around asking people if they voted. You had literally 48 hours to vote. \n\nHardly anyone voted. \n\nHow are you going to sign a union card and then when it comes time to participate in worker democracy, just keep whining how you don't have time? Then call everyone who struggles weak and lazy for not working 90 hours a week? \n\nI'm ashamed of being a working class American. The weak and lazy ones are the CEOs and shareholders. Who profit off the labor of those who actually toil. \n\nHow do you even begin a working class movement if nobody wants to be involved cause exploitation is \"good, honorable, right, and godly\"? \n\nHow do you argue, or even convince people who are obsessed with being exploited?",
    "title": "How do you get workers more involved with there union?",
    "subreddit": "WorkReform",
    "timestamp": 1680370389,
    "score": 11,
    "keyword": "american ceo"
  },
  {
    "text": "How do you long-term recover from a botched FBI investigation that ruined your career and your reputation? I’m 57 y.o. male, empty nester living in a fairly typical American metro area. My wife and I currently make right at $200K a year, with my salary around $130K and my wife's at 70K. We have two grown daughters and two grandkids, each of our daughters married with one child. I am the oldest of four siblings, one of of whom live nearby. I have an earned doctorate in a field I no longer am involved with.\n\nTen years ago, I was forcefully removed from my dream career by a botched multi-year FBI investigation that was widely publicized and ruined my name in my industry. At the time it occurred, I was on a rocket ship upward, making $220K a year, about to be able to name my own price and become a true leader in my small, but active field. As a result of the investigation (which played out in the media) I was fired and also headed to prison before the authorities realized it wasn’t correct and quit it with me, dropping all charges. But the reputational damage was done (Google is not my friend) and I had to completely start over. My wife and I lost our savings through the process and went into deep debt, borrowing a bunch of money from family to pay attorneys fees and to relocate. It's now been ten years and although, between the two of us, we've made up 80% to 90% of the annual income we used to make, we still have very little in savings. Our debt load is still right around $100K in federal student loans (about $150K in consumer debt and lawyer's fees paid off) and we are long-term renters, having completely missed the real estate boom during Covid due to lack of funds for a down payment. Ironically, I will get a somewhat solid pension from my former life, but it doesn't kick in for another three years and we already realize all we'll be able to do with it is keep working, continue to pay down debt and save, save, save for multiple years after that.\n\nAfter bumbling and stumbling through the first couple of years after the immediate crisis passed (relocating to a different region, getting help from my extended family), I had dropped so far down the ladder that I was doing door-to-door sales. I had applied for 500+ jobs, to no avail (see above about google). Finally, a good guy I'd met offered me a junior sales position at his small pest control company, which had me doing cold calls and door-to-door sales. I got lucky one day and knocked on the door of a man who was an executive for a light manufacturing company (eight factories across US) and he was looking for a corporate purchaser/buyer. It was a private company - no board to impress, and - after getting to know me - he was able to convince the owner to hire me. I was grateful for the position, even though the person I replaced didn't even have an associate's degree and the pay was $65,000 a year. I was just thrilled to find a \"spot.\" I was determined to make it work. \n\nI've now been with that company seven years and have been able to show my boss (now the CEO) and the owner that I have a lot to offer. My salary has doubled and they've given me wider responsibility over the years (I am now in charge of much of the HR function for the company - the hiring and onboarding, along with the purchasing). The problem is, bluntly speaking, I find little value in my job and don't enjoy it. It's a terrible fit for me - the only reason I do well in it is because it's extremely easy. I'm a people person but all I do most days is answer email and fill out purchase orders. I do enjoy the HR function, but it's probably only 20% of my position. 80% is doing a job that - if they posted it on Indeed - would require only a HS diploma. I don't enjoy going to work, and liken it to getting grounded to my room to do homework all day, every day. I literally go into my office, shut my door and do paperwork until it's time to go home. I used to have a staff of hundreds of folks, now zero people report to me and I do paperwork all day. I know it sounds like whining, but the reality of it for me is quite difficult.\n\nBut, as they now pay me a solid salary and, as I have no significant savings and a ton of debt, I just keep getting up and going to work. And this has been going on for YEARS. I’m 57 now and have basically sleep-walked through my professional life the past seven years - ever since I turned 50. All of my younger siblings (I'm the oldest of four) have now zoomed past me financially and professionally and just shake their head about my sleep-walking - \"get your shit together, bro\" is a line I hear fairly regularly.  I’d love to quit and do a “third” career, but very gun shy and probably suffering a lot of PTSD (and depression) regarding professional risk.\n\n\nI feel I have so much more to offer. I don't want to continue sleep walking. I want to WAKE UP and get into a professional endeavor that I enjoy, contributes to the community and pays well - I want to utilize my skills the way I'd spent 25 years preparing and then accomplishing. I know a big piece of the advice coming is \"life sucks, just keep going\" and also \"well, if it's that bad, quit everything and trust yourself to try starting over again.\" I guess what I am looking for is something in the middle (aren't we all?)  **I’d love some advice.** Thanks.",
    "title": "How do you long-term recover from a botched FBI investigation that ruined your career and your reputation?",
    "subreddit": "careerguidance",
    "timestamp": 1702399892,
    "score": 176,
    "keyword": "american ceo"
  },
  {
    "text": "Quit and Travel or Secure a New Role and Sacrifice Travel? Am I too naive? Hi all,\n\nI currently work as a Senior Ecommerce Manager at a high achieving small business. I run the whole E-Commerce Department and consistently deliver results exceeding goals set by our CEO. The pay is good and my salary is currently at $80,000 plus a $20,000 guaranteed bonus at the end of the year. I get around 15% raises annually, for the past 3 years.\n\nI have become very unhappy with the job recently because I work 9-12 hours a day, have a micromanaging colleague, and no remote option with only 7 vacation days. The culture is very traditional and Eastern. It is toxic. I am the only American in this Taiwanese company.\n\nI have decided I want to quit. My plan is to quit next year by January 1st, 2024. Here is my dilemma - \n\n1. I will eventually need a new role. I have heard quitting a role without a new role lined up hurts your leverage in finding a new role. Also, the job market for E-Commerce is not good right now. There are a low amount of roles I am interested in on Indeed/Linkedin, and the pay is low.\n2. I need to see the world within the next year (this is something I planned since I was 21, and I am 26 now). I want to spend 2-3 months traveling Europe and Asia. However, finding a new job will likely take away my option to travel. \n3. I would like my new role to have higher compensation than my current role. But if I quit my job, I have a lower chance of this.\n4. I have a somewhat aggressive personal net worth goal to achieve by age 30, and the time value of my income is important to me.\n\nShould I quit my job and travel the world? Or should I find a new role before quitting my job, risking my option to travel the world? \n\nIs there any solution that can address the majority of my concerns? or am I simply being delusional? I am open to ideas as I am still somewhat young and want to learn from people with more life experience.\n\nThank you all in advance.",
    "title": "Quit and Travel or Secure a New Role and Sacrifice Travel? Am I too naive?",
    "subreddit": "careerguidance",
    "timestamp": 1690162592,
    "score": 3,
    "keyword": "american ceo"
  },
  {
    "text": "Full time career or Travel? I got this new job at a lab that pays decent which I do need that can lead me to a “career”. However I’m not sure if I’m ready for the so called professional or adult world yet. I’m only in my early 20’s. I don’t really have a undergraduate or graduate degree, only a 2 year associate at most. I’m not sure what I really want to do in my life.\n\nI do know that I enjoy traveling. Im not talking once a year type of travel for 7 days. I’m talking staying in two countries for 3 months each and heading back to the states for the remaining 6 months. So how could I do a “career” anyways if I’m constantly on the move? I plan on trying out this gig for a year to see where it goes and save as much as I can before I set out. I’m single, no debt other than a car and student loans. I plan on selling my car anyways if I follow through with travel. No kids. I have a partner but overseas rn where I’m hoping to visit soon.\n\nI’m just not sure. I’m not really a big fan of the American workforce and how the system is ran here. Yes, anywhere but here when it comes to work. I’ve noticed other countries just treat a job as a job and not people competing over who can out-slave each other for a big corporation where the CEO’s makes 10x the amount us normal workers do. \n\nAnyone that travels for a living that can give me pointers? Not sure if it’s the right place for this post.",
    "title": "Full time career or Travel?",
    "subreddit": "careerguidance",
    "timestamp": 1690851001,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "Following my Dream or Loyalty? A Job/Startup Dilemma X2 Hey Reddit, ever been in a weird moral pickle? Like those 'who to save' questions? That's me right now. I’m from Mexico and moved to Canada for new opportunities. Started off working in a restaurant, then got lucky and landed an engineering role. My current boss, also from Mexico, is a great and awesome guy. He saw something in me, even when I was missing a driver’s license and American visa required for the job.\\\n\nWe clicked, and he decided to wait for me to sort out my driver's license, the visa still in progress. He’s been a real mentor, patient, and he knows his stuff. The job’s good, especially as a newcomer to Canada. But here's the thing **-From the beginning I was searching to get into the startup world. It's a key piece to accomplishing my DREAM.**\\\n\nTherefore while working, I started a little startup side project – because why not, right? Then, while searching for a mentoring session during a coffee chat with a startup CEO, I got offered a job in his company instead of just the mentoring session I was searching for. I didn’t see that coming!  This role would be using all my skills in mechatronics, not just bits and pieces like my current job.\\\n\nI decided to go for it but now feel kinda bad. My boss has been amazing, and I've only been with the company for 8 months. I don’t feel that good of leaving that soon **But the startup... it’s exactly what I've been dreaming about, and I think opportunities like this don’t come back to often.** What do you think? Stick with the loyalty to my boss, or chase the dream taking this opportunity?\\",
    "title": "Following my Dream or Loyalty? A Job/Startup Dilemma X2",
    "subreddit": "careerguidance",
    "timestamp": 1703712708,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "Willing to work for less but difficulty finding global remote job Hi,\n\nI recently moved to Asia a few months ago for personal reasons and will be here for up to 2 years. I have 3 YOE now and in the US worked at a large F500 company and a mid sized tech startup working in data eng and web dev.\n\nI tried working in the country I live in but the work culture and pay has been terrible, even for those with foreign CEO. Long hours, bad dev practices, extremely boring work. I worked at first startup for 4 months and currently am at new one for a month. I have heard from many in the industry here that it does not get much better unless I can make it into senior roles at top tech companies here. Unfortunately I am not at that level yet. \n\nI went from making base 125k in the states to less than 40k here based on current exchange rate. It is standard for industry and I found out I was actually paid more than many of my senior colleagues.\n\nI am not an exceptional dev, but I consider myself okay enough. I pick up things quick and I can get things done. My leetcoding skills are middling, generally can solve up to not too difficult mediums.\n\nMy resume is okay and have generally gotten good callback rates for normal jobs in my current country and the US. It never has been much trouble finding *A* job in the US or here locally, but hard finding a good job locally. I don’t think any fully remote global job has given me an interview besides one that rejected me after recruiter call lol. One that was partially global remote (okay with my country at least) rejected me for not enough front end experience for a fullstack role as it turned out they were a bit more front end oriented and I have basic front end skills compared to back end.\n\n—\n\nI am wondering, is there a good way I can offer my services to companies as a contractor or full remote dev even for cheap? I remember at both my US jobs our team having trouble with off shore devs especially in terms of communication and coding standards. I wonder if I could bring some value here as “off shore” but basically an American dev.\n\nMy salary requirements would not be high - even 40k base would be sufficient for me if work environment and WLB is good. That salary is enough to live a comfortable life where I’m at.\n\nI also maintain a US presence so I have US banking, mailing address, etc. and I visit the US for about 2 months every year.\n\n—\n\nAll else fails, and I am at my wit’s end with working at local companies here, I am considering just joining any company for the two months I am in the US and try to VPN or ask about working a bit abroad.\n\nAssuming around my old salary, even 3 months of working would be equivalent to basically and entire year of working in my home country.\n\nThe drawback being if I’m caught VPNing or am forced to quit, it may burn a bridge or look bad in my job history. Idk if it would be better to just treat the next year as a “sabbatical”.\n\nThanks for reading thus far even if no advice is available.",
    "title": "Willing to work for less but difficulty finding global remote job",
    "subreddit": "cscareerquestions",
    "timestamp": 1672724862,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "How do you navigate a toxic workplace? I posted on here before, about how in my first week, A co-worker that found a new job in the company subtly warned me away from this job and to not stop looking for a better one.\n\nEveryone said “maybe he is jealous”, “ignore him he’s bitter”, etc. \n\nWell he was right. \n\nI’ve only been here 3 months but 1/2 of the team either quit/retired/transferred. \n\n - The deadline are super unrealistic. (How do I average 50 tickets daily but you get mad when you assign me 127 tickets and I can’t complete all of them).\n\n - my co-workers are high-key rude and act irritated when I ask any sort of questions. \n\n - I’ve had other IT jobs, but this is the 1st one where I literally don’t want to get out of bed in the morning and get anxious just thinking about work.\n\n - I was hired on as hybrid and the CEO is pushing for full-time in office now\n\nI want to quit so bad but:\n\n - the benefits and pay are great. \n\n - they’ll pay for my masters degree and if I leave within two years I have to pay it all back.\n\n - I had a hard time landing this role in the 1st place.\n\n - if I can last 1 year exactly, I can apply for other roles in the company and pray that it’s not as toxic as my current one.\n\nMy manager is heavily biased to the other team members (they’re Indian and I’m American) and I only see her for our weekly 5-minute chats. Which she bails out on most of the time.\n\nI found a very nice cybersecurity internship (technically in my last semester but school is online) that I would love to apply for, but I have a hard time justifying to myself switching from a permanent position when I have rent and bills to pay, to getting something temporary only for my happiness.\n\nThoughts? I need some advice.",
    "title": "How do you navigate a toxic workplace?",
    "subreddit": "cscareerquestions",
    "timestamp": 1678378707,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "I think I need mentoring. Here is my situation and story so far, what do you think? **Hopefully this is the right place. I've seen mentoring posts on here before so I'm assuming it is.**\n\n#I need some advice. Do any of you guys/girls want to be my mentor? \n\n\nI'm not a typical CS grad at I have a bit more experience than most, or I went to university late depending on which way you're looking at, if no one here wants to mentor me where would be a good place to look for a mentor? \n\nAny advice is appreciated and I don't mind if the American guys and girls but word of advice I am UK based and as you can tell the UK salaries are very different to the American ones. Ideally UK devs/admins I assume would be best to answer my question. But... \n\nI'm open to mentors anywhere in the world who can guide me on remote work for oversea work, if any of you guys/girls have experience in navigating the International remote work Arena I will be more than happy to listen to your advice. \n\nI just need to be in a position where I can get lots of training and learn as much stuff as I can. \n\nThanks :) here is some stuff I assume? A mentor might want to know? If not fire what ever questions you got in the comments and I'll get back to you. \n\n\n##Career Goals and Interests:\n\nI have a unexplainable passion for computer science and technical things. My main goal in life is to continually improve and master my craft, with the ultimate goal of becoming the goto guy and give back and mentor others. While money is a factor, it is not my primary motivator; my focus is on personal growth which luckily falls under professional growth, continuous learning, and improvement. \n\nI am particularly interested in the following areas:\n\n- Machine Learning \n- Full Stack Development \n- Embedded Design \n- UI/UX Design \n- Programming/Scripting \n- Security \n- Linux Administration\n- Cloud engineering\n- Networking Hardware & Software Defined \n- Containerization \n- DevOps Workflow\n- Compliance Standards \n- Electronics\n\n##Skill Level and Technical Competency:\n\nCurrently, I am in my mid-30s and have been engrossed in programming, security, networking, Linux and web dev since my early teens. This lifelong hobby has allowed me to develop a broad set of skills and competencies across various areas of computer science. I also been officially diagnosed high-functioning form of autism, which I believe has fueled my drive to continually learn about my passion. Any period devoid of learning computer, electronics, or STEM-related subjects leaves me feeling depressed. Before my teens my passion was electronics and radios. \n\nFrom my early teenage years to my current age, I've accumulated a wealth of knowledge in various facets of computer science. Despite failing high school and college, I've continued to pursue my passion. My professional journey began as an administrator for a architecture company which used only OSX systems, but the 2008 recession cost me my job. Despite having programming experience and even doing programming work for my previous company, my lack of formal education made job hunting challenging. This lasted for 5 years until I decided to return to university as a mature student. Four years later, I graduated with a degree in computer science. I then attempted a master's in artificial intelligence, but the poor course structure led to me and many others failing.\n\nRegarding my technical competency, I would rate myself above average for most science graduates, given my extensive hands-on experience before university. I also began a CCNA qualification, but this was interrupted when the company providing the course was shut down due to fraudulent activities.\n\n##Current Employment:\n\nI am currently working in a role I took out of necessity, as a \"Network Support Technician\". My daily tasks revolve around Linux terminal operations. Initially, my job was to provide system support calls, maintain computing systems, monitor IT, and manage the IT assets database. However, several red flags were evident from the beginning, such as the lack of tests for the software, non-existent DevOps flow, zero documentation, and absence of mentorship or training.\n\nDespite the numerous challenges, I have managed to introduce IT operations, containerized all our live servers, and set up an in-house AI server, trained our own AI spam filters, compiled the frontend & backend of our pbx from source code. I've also implemented new security measures for our live systems, among many other responsibilities.\n\nHowever, the company's biggest problems stem from its CEO and the head of IT, both stuck with outdated methodologies. The CEO, who also serves as the main front-end developer, refuses to use tools like UML diagrams and has no system for tracking issues, and states there is no point in using any software development methodologys. My direct boss, a long-serving Java developer, seems content with the status quo and uninterested in pushing boundaries or adopting modern practices. This is not me at all I'm constantly trying to learn and push myself because I didn't choose this career because of the money or any other reason other than it chose me. \n\nIt's my passion and watching them treat it in such a way that I feel it doesn't get the respect it deserves just upsets me the most. I'm too passionate and care too much a about our staff, clients and mostly my love for the topic to watch my bosses carry out tasks incorrectly and are too stubborn to learn how to do it correctly. \n\nAs you can imagine this work environment is incredibly frustrating for me, as I am committed to my field not just as a job, but as a lifestyle and passion. I believe they are undermining the company's potential, and it's challenging for me to witness this. I am looking forward to finding a better path with a mentor's guidance.\n\n##Learning Style\n\nAs a visual person with a knack for programming, I appreciate the value of practice over just reading or watching tutorials. Given my dyslexia, especially with letters and numbers, I prefer watching tutorials to reading them. When it comes to coding, I've got it down pretty well.\n\n##Strengths and Weaknesses\n\nMy knowledge and experience in Python stand out among my strengths, yet I've been using C the longest as it was my first language. I'm also improving in Elixir and have comfort levels in a range of other languages including C/C++, Ruby, Assembly X86, PHP, Javascript, Perl, Java, Bash, HTML, Typescript, CSS, Haskell and Erlang. My skills include frontend frameworks like React, Svelte, Qwik, and Vue, along with backend tools like Spring, Django, Flask, Phoenix and Node. I've even worked with webservers like CGI, Apache & Nginx. Despite my breadth of knowledge, I often feel like a jack of all trades and master of none.\n\n##Motivation and Drive\n\nMy drive for this work is hard to explain - it feels inherent, I've had it since birth, I just need to know how things work, before she's of 10 my main passions in life were electronics and radios such as ham radio, but at the age of 10 when my parents got our second computer my mother let me take apart the first one. when I attempted put it back together to my surprise, it worked! that was the start of my career. It would be nice to had have money at the end of the month. But this is my passion, my lifestyle I love it so it's all about learning for me. There's also something deeply satisfying about working hard to acquire the knowledge which can bring my ideas to life, to create and design. \n\n##Work Habits and Time Management\n\nI struggle with prioritizing my workload. My tasks as an IT admin are varied, from setting up networks to troubleshooting user issues, creating a PHP JWT token backend for a WordPress blog or teaching junior developers. I enjoy the variety but sometimes it's overwhelming. I aspire to specialize rather than dabbling in everything. I feel that I have so much work from different areas such as networking or compiling a kernel to get a certain feature working or to roll out security upgrades or to writing AI classify problems that it's so much work I can't finish it all because I get interrupted because at the end of the day I'm still the go-to support guy and one phone call could completely take me off track from doing and I end up not going back to my original task because that support generates new ones. \n\n##Professional Aspirations\n\nI'd love to maintain a technical role which I specialise in while exploring product development for a friend's entrepreneurial venture. If we can generate enough income, I'd consider leaving my current job that pays £29k annually, which I had to fight for, was 27k originally. I'm interested in a devops role, but my applications have been rejected so far. I'm hoping a mentor could help guide me on this. I'd appreciate a workplace that invests in my training, recognizing my passion and commitment.  \n\nIn the UK, currently there is no way at all I can afford a house or even a 1 bedroom flat earning as little as I am, and I don't even live in a big city, I can't even make it through the whole month without running out of money the third of the way through. When you're pushing 40 and reality starts setting in and all of the hard work you put in since a teenager hasn't paid off as much as I planned has put me in a position where I will literally do anything to get to a position that earns me enough to afford a house and live comfortably, to be blunt I'm not a good looking, fit, attractive guy therefore I have no one to split a mortgage with so I really need to aim for a career where I can afford a house by myself. \n\nIt's tough pill to swallow trying to accept I was naive enough to believe that more knowledge you held and a large passion for learning would equate to more money earned. I'm not sure I can ever accept it, it just seems like some people are lucky?\n\n\n##Networking Skills and Professional Connections\n\nI maintain profiles on LinkedIn, GitHub, CodeSpace, CodePen, and StackBlitz, although I tend to redesign and iterate on my projects. Recently, I've connected with like-minded individuals at a local Hackspace, including Javascript developers and retired computer science professors.\n\n##Personal Challenges\n\nMy physical health sometimes impacts my work, with a slipped disc causing slight mobility issues (foot droop), but the stiffness acquired from sleeping means it takes me a while to get up and make the pain go away. and occasional gout flare-ups. Despite these, I push through. My fairly recently diagnosed high functioning autism, ADHD, and OCD seem to fuel my focus and determination, but my dyslexia creates challenges, particularly when reading documentation.",
    "title": "I think I need mentoring. Here is my situation and story so far, what do you think?",
    "subreddit": "cscareerquestions",
    "timestamp": 1687687497,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "unconventional job search techniques... Technique #1:Running Facebook ads advertising myself to work. Target: software engineers, web developers, CTOs, CEOs in several American cities. CTA: set up a 15-minute chat on Calendly.\n\nResults: 135 Link Clicks, $113 = 84 cents/click, 0 appointments scheduled.\n\nNot recommended.\n\ndm for that Calendly link if you'd care to critique it...",
    "title": "unconventional job search techniques...",
    "subreddit": "cscareerquestions",
    "timestamp": 1698782955,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "We Should Be More Concerned About Palestine... I know a lotta y’all not gon like me for this. I can just sense it. I feel like y’all might eat me up for this one too but I’m gonna say it anyway. \n\nThe way the black community—at least from what I’ve seen in America—is being so non-chalant about what’s happening in Palestine right now and it is really breaking my soul. In my opinion, we should be more vocal. And before you jump down my throat, let me say this: I *get* that a lot of us do not feel like we should have a social responsibility to “care” or be involved with non-black people’s political issues, I do. I get that we are *tired*. I get that we feel that we shouldn’t be the superheroes of every single non-black issue out there in the world because our emotional labor is already relied upon without ever giving us our just due back or giving us credit, *I get that*. \n\nHowever, I feel that this situation is unique. Not only is it unique, but it is also a literal genocide. A literal ethnic cleansing. I could never turn a blind eye to something like that. I say it’s unique to us because the Palestinian struggle has been similar to our own (I’m not saying it’s the *same*). And historically, the Palestinians have had black people’s backs in terms of our right to freedom and self-determination. I just listened to a talk with Angela Davis on Sunday where she said that Palestinians supported her while she was in jail. The Black Panthers stood with the Palestinians. As did Malcolm X, Martin Luther King Jr., James Baldwin, Toni Morrison, Audre Lorde, June Jordan, Nelson Mandela. And not just in the past, but as recently as 2020, during the George Floyd protests, Palestinians were teaching how to get tear gas out of our eyes. They painted a mural of George Floyd in Gaza (I believe it was Gaza, I may have to fact check on that). \n\nI don’t see how anyone could look at these videos of dead and mutilated babies, children with no parents, people fainting, people being blasted to bits, screaming out for god to save them and not feel anything? I don’t see how you can say “it’s not my problem” when it literally is because YOUR tax dollars are funding it, and YOUR elected officials are providing weapons and getting involved in the mix. And we are way more involved with Israel than we realize. Produce, shoes, printers, fast food...either sourced directly from or funding Israel. \n\nPlus, Afro-Palestinians exist. We are out there. I’m watching videos of people in Gaza and I’m literally seeing Afro-Palestinians in the videos. Afro-Palestinians are also in Jerusalem. There are documentaries about them. So black people are not removed entirely from the situation at all. We are out there and they’re here in America. My friend is Afro-Palestinian for Pete’s sake. So it’s very fucked up to say “not my problem.” What if the black non-Americans said that to us during Black Lives Matter? I’m sure some did, but how would you feel?\n\nAnd before you come at me with the whataboutism, yes, I agree, why don’t we also talk about Sudan and Haiti? I’ve seen black people come onto these Palestinians’ live streams and say what about Sudan and Haiti and I think it’s extremely disrespectful. If a Palestinian did that to us, we would be pissed. And why don’t we ask ourselves that? Why haven’t we made any noise for Sudan and Haiti? Because I BARELY see any creators talking about it. All I see on tik tok live streams with black people are conversations about body count, and who should pay for a date, and interracial dating. Never anything about what’s going on with black people in the world today. \n\nAnyways, eat me up. I know some might not agree.\n\nEDIT: excuse any typos please, I’m trying to get them all, but my tablet has weird autocorrect and I may not see them all\n\n2nd EDIT:\n\nI should say this. It’s crazy that we can be so apathetic about a literal ethnic cleansing. If we become so desensitized to this ethnic cleansing, this genocide, then what will happen once they come for us? If we show our government, if we show the world that we are okay with this, that we can simply turn a blind eye to it, then who’s to say it won’t happen to us next? Because you *know* how vulnerable we are as a population. There should never be a time where we take a stance of neutrality to genocide. Not ever. Because I guarantee you if they can do it to them, they will do it to us—in some places they already are doing it to us as some have pointed out in the comments. It should not be that hard to say: “I do not condone violence. I do not condone genocide.” But for some reason we find ourselves trapped in the false sense of stability that America brings to us. We love to sit in our privilege here and say if it’s not on my doorstep then it’s got nothing to do with me. But no one has ever heard of complicity. We are complicit. We pay for this. Our elected officials make decisions in our names. We are complicit and much more involved than we like to realize. We are supporting white supremacy, just under a different name and to a different brand of folks. And to me, that sounds like hypocrisy. I do not accept white supremacy in *any* of its forms. No matter what name it falls under. I do not support colonialism. Now how that make sense if I say I am neutral to white supremacy? But I’m black? Come on mane. Make that make sense. \n\nEDIT 3:\n\nSomeone asked me to post numbers to call for actions. \n\nHere are some of them:\n\n[White House Comment Line](https://www.instagram.com/p/CyzK48RRPbG/?igshid=MzRlODBiNWFlZA==)\nThis one is open Tues - Thurs, 11AM - 3PM EST. \n\n[Tell Congress Ceasefire Now](https://www.jewishvoiceforpeace.org/resource/call-congress-support-ceasefire/?fbclid=PAAaYvFphm9UDi9v3TiQreAVxgZqSuyXPuCLRFgcWoAhtqKxf5Pp4RJ-CeoQg_aem_AYk1oeqKcP2Oojq6EB1jN4qWPmlSSjkQgBMWFx4GJmSunN3XKZ82uHv1l1IhZ_fL1T8)\nThis one is by Jewish Voice for Peace. It calls for you and you leave a voicemail mail using the script to your representative. Takes less than 5 minutes.\n\n[Email Your Congress Member](https://www.jewishvoiceforpeace.org/resource/email-congress-support-ceasefire/)\nThis one is also done by Jewish Voice for Peace. Literally about 2 minutes.",
    "title": "We Should Be More Concerned About Palestine...",
    "subreddit": "blackladies",
    "timestamp": 1698290869,
    "score": 423,
    "keyword": "american ceo"
  },
  {
    "text": "Bain CEO: Breaking the Bamboo Ceiling “MBB” (McKinsey, BCG, Bain) are the three elite consulting firms that are highly sought after for recruitment at the top MBA programs. \n\nBain & Company’s worldwide managing partner and CEO is [Manny Maceda](https://www.bain.com/our-team/manny-maceda/), who is Filipino American.\n\nA rare example of an AAPI rising to the top in a prestigious global company.",
    "title": "Bain CEO: Breaking the Bamboo Ceiling",
    "subreddit": "asianamerican",
    "timestamp": 1685921928,
    "score": 80,
    "keyword": "american ceo"
  },
  {
    "text": "Does the glass ceiling not apply to South Asians? I am Chinese American and have a lot of friends/family who are the same. Many of them are the kind of people who studied hard, went to good schools, work hard and have jobs at big tech companies where they make good money. From what I've heard Asians dominate many tech industries.\n\nHowever it seems like there is a glass ceiling and you rarely see Asian CEO at these companies which the exception of South Asians. If you just look at the US biggest companies #2 Microsoft and #3 Google have Indian CEO's and #5 Berkshire Hathaway it is likely Warren Buffet will be replaced by Ajit Jain who is Indian American. The CEO of Twitter is Indian American and Google just promoted an Indian American to run YouTube.\n\nI have a lot of respect for Indians and some of my best friends are Indian American. Indians are 1% of US population and Asians are 8%. Just curious why it seems like they can pass the glass ceiling while the rest of us cannot.",
    "title": "Does the glass ceiling not apply to South Asians?",
    "subreddit": "asianamerican",
    "timestamp": 1676577327,
    "score": 27,
    "keyword": "american ceo"
  },
  {
    "text": "Women did influence politics before suffrage, and the government did rely on their opinions, and people worried suffrage would prevent them from influencing the government. It wasn't simply men who created society's rules. Here's some information: Many feminists like to argue that any problem men face is caused by themselves because \"but the government who creates these laws are all men!!!1\". The problem is only 1% of men are in the government, and they blame men for their suffering based off what the top 1% of men do (the apex fallacy). They also assume all social norms, which often aren't created by the government, were created by men, which is just false. The problem is, men could only vote in early United States if they owned property, which only 3% did, and women were never property or forbidden to own property, contrary to what feminists say. In fact, universal suffrage wasn't given to men until around the mid-19th century in America, and the reason they only gave it to men wasn't due to hatred of women, but because men served in the military, and military rights and voting rights overlapped. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), in virtually all countries, men were originally not given universal suffrage until some point in time, and usually they gave women the right to vote simultaneously or somewhat later. If they originally only gave men the right, it's because men served in the military.\n\n**Many women opposed the right to vote, and many men supported it.**\n\n[Many people don't realize that many women were against the right to vote and only a minority originally supported it](https://web.archive.org/web/20210420082758/http://www.societyforhistoryeducation.org/pdfs/M15_Miller.pdf). Hell, many pro-suffragists were men. Why did people oppose the right to vote? A few reasons and it wasn't exactly because people thought women belong in the kitchen:\n\n1. People thought the world of politics was too dangerous for women, and were very protective of women and didn't care if men got harmed.\n2. People thought it would be a slippery slope and lead to Jim Crow laws being abolished and allowing blacks or immigrants to vote. In fact, the fact that people of color could technically vote is a big reason why suffragists wanted the right to vote in the first place.\n3. People believed women would influence laws more if they couldn't vote, and believed allowing them to vote would make it harder for them to influence the government and laws. In fact, women's opinions often did influence the government and their laws historically.\n\n**Women did influence the government, society's norms and rules, and laws, and people worried allowing them to vote would prevent that. Many laws are even in favor of women.**\n\nContrary to what feminists think, laws weren't created based strictly on the opinions of men. Only 1% of men worked for the government, and they usually made laws based on what they thought was best for the land or its people, but not for men. Totalitarian leaders might be all about themselves, but certainly not men either. Women's opinions mattered a lot to men. [In fact](https://presidentlincoln.illinois.gov/Blog/Posts/141/Abraham-Lincoln/2021/8/Lincolns-avoided-duel/blog-post/), [Abraham Lincoln](https://www.battlefields.org/learn/articles/abraham-lincolns-duel) even used female pen names pretending to be a woman to attack political rivals, including James Shields.\n\nAlongside speaking against recent policy decisions made by Shields, Lincoln implied that his opponent was weird and unpopular with women.\n\n>*\"His very features, in the ecstatic agony of his soul, spoke audibly and distinctly – 'Dear girls, it is distressing, but I cannot marry you all. Too well I know how much you suffer; but do, do remember, it is not my fault that I am so handsome and so interesting.’”* \\-- Rebecca (Abraham Lincoln)\n\nLincoln's wife also wrote several letters against Shield under a female penname. Lincoln apparently consulted with her about his letters to make them sound like a woman wrote them. What does this mean? Women were seen as pure and moral compared to men, so their voices mattered a lot in politics, and because they couldn't vote, they were seen as fair and reasonable. **This is why women often opposed the right to vote, because they worried it would prevent them from being influential in politics.** If the 1800s were so patriarchal, why would he have used a female penname to pretend that a man was unpopular with women to destroy that man's career?\n\n[Moreover](https://daily.jstor.org/women-against-womens-suffrage/), Catharine Beecher, an advocate for women’s education and economic advancement, argued that women were most effective when they united to press their fathers, brothers, and husbands for reforms in terms that rose above intense partisan politics. Using anecdotal evidence, she pointed to her sister, Harriet Beecher Stowe, whose [*Uncle Tom’s Cabin*](https://daily.jstor.org/frederick-douglass-feud-over-uncle-toms-cabin/) had contributed to anti-slavery sentiment in the country, selling quickly before the Civil War and humanizing enslaved black people. It changed American's views of enslavement at the time, especially in the North. Another example was the women’s clubs that fought for pure food laws, [compulsory schooling](https://daily.jstor.org/why-would-parents-oppose-compulsory-education/), and other reforms that were easily framed in terms of maternal care.\n\n[Women influenced politics in many other ways, too](https://americanhistory.si.edu/blog/5-ways-women-influenced-politics-they-got-vote). In the 1800s, men and women flirted at political rallies and met their potential spouse. Politically-charged women charmed men into supporting certain political views, especially first-time male voters. In his new book *The Virgin Vote*, Smithsonian political history curator Jon Grinspan explains that women even \"turned down marriage proposals specifically because of a young man's political affiliations.\" These actions pressured husbands and suitors to vote in favor of a woman's views.\n\nCarry Nation, a female leader in the Temperance movement, used to use hatchets to smash saloons. Churches and theaters paid her to against alcohol. In the Victorian era, if a man smashed alcohols, he'd be stabbed, but men were chivalrous towards women and refused to harm her. Many people laughed at her, but respected her integrity for her beliefs anyway. Carry's radical approach helped launch the Temperance movement into mainstream American politics.\n\nHell, [even in Saudi Arabia](https://web.archive.org/web/20131109094735/https://www.theguardian.com/commentisfree/2013/nov/02/saudi-protest-driving-ban-not-popular), almost 80% of women were against the right to drive, and believed it'd create sexual harassment of women and give men the ability to betray or cheat on their wives. Usually, these laws were created to be overprotective of women, which is benevolent sexism, not \"misogyny\" (which means hatred). Laws changed a few years ago about this, but you can see that many laws in these countries are based off of overprotection of women and benevolent sexism, not hostile sexism (which is the sexism feminists THINK is the norm but is not). In fact, in Saudi Arabia, they are one of the happiest nations and women there were happier than men, and didn't consider themselves oppressed at all.\n\n**Laws might be created a small top percent of men, but they aren't created for men.**\n\nWe have the Office on Women's Health, Office for Research on Women's Health, etc. (even though men die a lot more than women), Violence Against Women Act (even though men are just as likely to be victims of domestic abuse and more likely to be victims of crime or murder), laws in other countries that seem \"misogynistic\" but are really about social norms or even overprotection of women, the [criminal justice system going easier on women and law enforcement going harsher on men](https://www.reddit.com/r/MensRights/comments/xyl5wb/comment/jj676ln/?context=3), tons of battered women's shelters but none for men, more funding and research for breast cancer than prostate cancer even though prostate cancer is just as common and deadly, a draft for men but not women, alimony, a women's bureau to protect working women but no bureau for men even almost all workplace deaths are men and way more men die at work each year than men who ever become CEOs, affirmative action for women even though women are more likely to make it to college, etc.\n\nYes, the government is mostly men, but they don't make these rules for men. In fact, the reason men were involved in the world of politics through government and voting but not women is because people thought if men were the ones fighting for our country at war, they'd be the ones who work in the government or vote, not due to hatred of women. The fact that men were the ones involved directly in politics that way is why it says all men are created equal instead of all humans, not because people didn't view women as human.",
    "title": "Women did influence politics before suffrage, and the government did rely on their opinions, and people worried suffrage would prevent them from influencing the government. It wasn't simply men who created society's rules. Here's some information:",
    "subreddit": "MensRights",
    "timestamp": 1690392635,
    "score": 116,
    "keyword": "american ceo"
  },
  {
    "text": "New Podcast Episode: Journalism Icon Cindi Leive on \"Brenda Starr\" and Women in Media [The Meteor CEO](https://wearethemeteor.com/) and former Glamour and Self editor-in-chief Cindi Leive joins host Sabrina Cartan in the Shire to geek out about women journalists through the lens Brenda Starr, Reporter, an iconic comic strip that ran from 1940 to 2011. A cultural critic and one of the most celebrated women in American media, Cindi shares teen memories of being a Bruce Springsteen and Eurythmics fangirl in the early 1980s, and how her love of the fashionable, no-nonsense Brenda Starr influenced her career. Together, Cindi and Sabrina explore gender in the workplace, women's authorship, and what's changed (or hasn't) since Brenda Starr's heyday. \n\nCindi connects all of this to her current work at The Meteor, a media company she co-founded with a group of journalists, artists, filmmakers, and media leaders who believe in the power of words, images, and stories to advance gender and racial justice and equity—and transform the world. During Leive’s 16 years at Glamour, she grew the brand’s audience to a record 20 million across print and digital, and built barrier-breaking initiatives like Women of the Year (the country’s preeminent event showcasing women), #PoweredByWomen (a global movement supporting female photographers), #The51Million (about women and politics) and more. \n\nAs a journalist, she has interviewed Presidents Barack Obama, Joe Biden, and George W. Bush, First Ladies Laura Bush and Michelle Obama, Secretary Hillary Clinton, Senator John McCain, and personalities ranging from Jennifer Lawrence to Angelina Jolie. She also founded The Girl Project to support girls’ education, making Glamour the first women’s media brand with a nonprofit initiative.\n\nFollow and support The Meteor's mission: https://wearethemeteor.com/ https://www.instagram.com/themeteor/",
    "title": "New Podcast Episode: Journalism Icon Cindi Leive on \"Brenda Starr\" and Women in Media",
    "subreddit": "Feminism",
    "timestamp": 1676847730,
    "score": 2,
    "keyword": "american ceo"
  }
]