[
  {
    "text": "Should I quit my BA job after 3 months? I'm a recent college grad who just started my job as a Business Analyst three months ago. Right now I'm ready to quit.\n\n\n&nbsp;\n\n\n\nI've always been interested in using technology to solve business problems, so when I saw this role initially I thought it was a great fit for me. The job description spoke of gathering business requirements, business process analysis and improvement, and consulting on the best ways to implement our software. The company is an a very narrow industry (it licenses software for a very specific and complex manufacturing process). We have the American rights for this software that is based out of Europe.   \n\n\n\n\n&nbsp;\n\n\nHere's the problem: I've done none of those things since I was hired. This company is extremely small (~10 people in the office) and I've quickly discovered that my supervisor and management in general is far too overwhelmed to involve me in anything even remotely important. There always seems to be a \"crisis\" with our clients, and this is largely due to the product. It's terrible software, but it's the only one of its kind and our company rides their monopoly like nothing else. \n\n\n\n&nbsp;\n\n\nI was supposed to receive full training to learn this industry and get involved, but my supervisor always seems to run into problems with clients and never has the time to sit down with me and show me the ropes. This cycle repeats over and over; I've never been trained properly, so I can't help my supervisor. My supervisor can't train me because they're always too busy putting out fires and managing our clients.\n\n\n\n&nbsp;\n\n\nNow, I've tried my hardest to teach myself, but this is an industry where you have to know extremely specialized and complicated manufacturing processes. I'm not an engineer by any means, and recognize my own limitations here. I'm getting extremely frustrated with this lack of understanding. \n\n\n&nbsp;\n\n\nSo, the net result is that I've been stuck with meaningless jobs - data entry, sending emails to schedule meetings for my boss, cleaning up the kitchen... all of which are tasks that have nothing remotely to do with my job. I spent the entire day today manually checking items off a spreadsheet from a budget for 2014. When I tried to automate it, my boss got upset and told me that wasn't the \"proper company method\". The results were IDENTICAL and yet he still wouldn't allow me to automate. It's almost as if they're filling my days with useless tasks on purpose to keep me \"busy\" and occupied, when I know that my time could be put to so much better use.\n\n\n&nbsp;\n\n\nI've tried speaking to my supervisor about this multiple times and have told him that I simply don't have enough work to do, and have practically begged him to give me more work or training so I can get involved with clients.\n \n\n\n&nbsp;\n\n\nThe salary is also below average, but I was looking for a job for months after I graduated and took this one because I thought it was manageable. My supervisor has said on many occasions that the CEO will pay me more when I can show that I've \"demonstrated value\", but they aren't giving me any opportunities to do so and I am restricted from creating my own. He's talking about 4-5 year timelines when I feel like I should be doing a lot more now.\n\n\n\n&nbsp;\n\n\n\nI'm willing to work hard for this, but I feel like I'm hitting the ceiling already and it's barely been 3 months. I can't continue to work at their pace doing meaningless administrative jobs for the next few years. I don't want to throw my career away by leaving too early, nor do I have a new job lined up yet. I am considering starting to look again.\n\n\n\n\n&nbsp;\n\n\n**TL;DR: BA job hasn't turned out at all like I expected. No training from Boss and finding it difficult to see how I can get more involved when they don't have time to work with me. Considering leaving for something better.**\n\n&nbsp;\n\n**Update: Had a meeting with my boss and the CEO on Friday last week, they apologized and promised more work for me. Today my entire day was spent doing customer support helping a new user go through the user manual and set up the program. This was NOT what I signed up for. Strongly considering leaving now.**",
    "title": "Should I quit my BA job after 3 months?",
    "subreddit": "jobs",
    "timestamp": 1483582891,
    "score": 3,
    "keyword": "american ceo"
  },
  {
    "text": "I was 2nd choice for a company, but they might hire me after 2 months? I'm an American, who moved abroad to a new city with no job lined up and I've been interviewing at a lot of places. I didn't like most of them, but there was one that I really fell in love with. I was referred to it by a friend I met here.\n\nThey had five rounds (initial screen, case study, interview with team leader, interview with branch leaders, interview with CEO).\nI think the fifth \"round\" is more of a formality, and once you finished round 4, you're chosen for the job.\n\nI finished round 4, but I was informed that I was a very very close 2nd place for the role. They said they really liked me and they definitely want to bring me onboard, but someone else who was a bit more qualified got the role. They said they might open up a new position after the summer and it sounded like I could automatically have it offered to me.\n\nI researched this company a LOT, and I have no doubts that they'll open up more positions in the near future. And I absolutely love what they do, what the role is, every employee I've met during this process. The team manager e-mailed me herself, and it definitely wasn't one of those \"we'll keep your CV on file and contact you blah blah\" bullshit e-mails. I really do think there's something for me at their company and a position could definitely open up for me.\n\nMy problem is, what do I do until then? I'm sending out applications to other companies, but frankly, they all seem less exciting than this company, not to mention much more corporate. Money is starting to get a bit tight, and I'm not legally allowed to work unless a company sponsors me.\n\nI really think this company will open up a new position that I can fill, but should I trust that? If another company offers me a position, should I accept knowing that I'd enjoy it way less? I should note that I have a time limit because of my VISA.\n\nWould love to hear your take on all this :)\nThanks in advance Redditors",
    "title": "I was 2nd choice for a company, but they might hire me after 2 months?",
    "subreddit": "jobs",
    "timestamp": 1499457203,
    "score": 2,
    "keyword": "american ceo"
  },
  {
    "text": "Had a terrible week at work, is the problem me or the environment? I've been in my current job for 6 months and it's had its ups and downs, though recently it has been mostly down. To add some context, it's my first serious job and I'm pretty young compared to all of my colleagues, I'd say that out of 20 staff only 1 or 2 are less than 10 years old than me. My boss seems constantly stressed as he's also the owner of the company and my role has very vague boundaries, I taking incoming calls and process orders which don't always occupy my 9-5, so my colleagues hand me work daily that they can't/don't want to do. The hierarchy is also vague as we have a manager who is constantly usurped by the CEO who spends most of the time in our office. I'm often seen as a rank below the other staff thanks to the nature of my role and probably my age.\n\nAnyway, in the last week, I've been called a \"poof\" (equivalent of \"fag\" for American readers) and had continuous jokes about me being a domestic abuse victim. All this was said in front of about 8 members of staff and multiple people took part. On top of this, my boss is a complete jerk and is consistently rude to me, going so far as to threaten me with destruction of my property (phone, bag, etc), \"throwing me out the window\" and firing me if I didn't perform a particular task correctly. He'll invent rules just for me and will get angry if I point out the same behaviour around the office. Literally everything I say to him comes back to hurt me and, even though my manager assures me the opposite, I honestly believe he dislikes me.\n\nAfter I complained about what was said this week, they handed me a \"letter of consent\" (i.e. a written warning) about breaking some of the rules I explained above too often. Also, my 6 month probation has been extended to 9 months. I'm basically miserable at the moment and it's the second time I've been this low in the last month or so thanks to this job. I'm not sure what my next step should be.",
    "title": "Had a terrible week at work, is the problem me or the environment?",
    "subreddit": "jobs",
    "timestamp": 1511036743,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "why are American Indians not known for their success while Indian Americans (from India) are known for math skills and becoming CEO's of the best companies?",
    "title": "why are American Indians not known for their success while Indian Americans (from India) are known for math skills and becoming CEO's of the best companies?",
    "subreddit": "AskReddit",
    "timestamp": 1511731066,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "How do you feel where you hear the statistic that only 15% of American men are 6' or over yet almost 60% of America CEOs are?",
    "title": "How do you feel where you hear the statistic that only 15% of American men are 6' or over yet almost 60% of America CEOs are?",
    "subreddit": "AskReddit",
    "timestamp": 1492484176,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "22 - Should I quit my first BA job after 3 months? I'm a recent college grad who just started my job as a Business Analyst three months ago. Right now I'm ready to quit.\n\n\n&nbsp;\n\n\n\nI've always been interested in using technology to solve business problems, so when I saw this role initially I thought it was a great fit for me. The job description spoke of gathering business requirements, business process analysis and improvement, and consulting on the best ways to implement our software. The company is an a very narrow industry (it licenses software for a very specific and complex manufacturing process). We have the American rights for this software that is based out of Europe.   \n\n\n\n\n&nbsp;\n\n\nHere's the problem: I've done none of those things since I was hired. This company is extremely small (~10 people in the office) and I've quickly discovered that my supervisor and management in general is far too overwhelmed to involve me in anything even remotely important. There always seems to be a \"crisis\" with our clients, and this is largely due to the product. It's terrible software, but it's the only one of its kind and our company rides their monopoly like nothing else. \n\n\n\n&nbsp;\n\n\nI was supposed to receive full training to learn this industry and get involved, but my supervisor always seems to run into problems with clients and never has the time to sit down with me and show me the ropes. This cycle repeats over and over; I've never been trained properly, so I can't help my supervisor. My supervisor can't train me because they're always too busy putting out fires and managing our clients.\n\n\n\n&nbsp;\n\n\nNow, I've tried my hardest to teach myself, but this is an industry where you have to know extremely specialized and complicated manufacturing processes. I'm not an engineer by any means, and recognize my own limitations here. I'm getting extremely frustrated with this lack of understanding. \n\n\n&nbsp;\n\n\nSo, the net result is that I've been stuck with meaningless jobs - data entry, sending emails to schedule meetings for my boss, cleaning up the kitchen... all of which are tasks that have nothing remotely to do with my job. I spent the entire day today manually checking items off a spreadsheet from a budget for 2014. When I tried to automate it, my boss got upset and told me that wasn't the \"proper company method\". The results were IDENTICAL and yet he still wouldn't allow me to automate. It's almost as if they're filling my days with useless tasks on purpose to keep me \"busy\" and occupied, when I know that my time could be put to so much better use.\n\n\n&nbsp;\n\n\nI've tried speaking to my supervisor about this multiple times and have told him that I simply don't have enough work to do, and have practically begged him to give me more work or training so I can get involved with clients.\n \n\n\n&nbsp;\n\n\nThe salary is also below average, but I was looking for a job for months after I graduated and took this one because I thought it was manageable. My supervisor has said on many occasions that the CEO will pay me more when I can show that I've \"demonstrated value\", but they aren't giving me any opportunities to do so and I am restricted from creating my own. He's talking about 4-5 year timelines when I feel like I should be doing a lot more now.\n\n\n\n&nbsp;\n\n\n\nI'm willing to work hard for this, but I feel like I'm hitting the ceiling already and it's barely been 3 months. I can't continue to work at their pace doing meaningless administrative jobs for the next few years. I don't want to throw my career away by leaving too early, nor do I have a new job lined up yet. I am considering starting to look again.\n\n\n\n\n&nbsp;\n\nI had a meeting with my boss and the CEO on Friday last week, they apologized and promised more work for me. Today my entire day was spent doing customer support helping a new user go through the user manual and set up the program. This was NOT what I signed up for. Would appreciate any advice or guidance. Thanks. \n\n&nbsp;\n\n\n**TL;DR: BA job hasn't turned out at all like I expected. No training from Boss and finding it difficult to see how I can get more involved when they don't have time to work with me. Considering leaving for something better.**\n\n&nbsp;",
    "title": "22 - Should I quit my first BA job after 3 months?",
    "subreddit": "careerguidance",
    "timestamp": 1484007635,
    "score": 3,
    "keyword": "american ceo"
  },
  {
    "text": "Tried making a joke at work, did I come across racist? \nI just started my job, I love it. It's in a field I've wanted to work in for a long time. The hours are flexible and the pay isn't bad. The people so far are nice enough and I get along really well with my manager. \n\nThe other day I saw the ceo of the company at a restaurant and I excitedly posted on a group chat that he was behind me at the restaurant. Someone asked where I was. I thought it'd be funny if I said the most unlikely restaurant he'd be at, and I named a cheap local fried chicken chain. I didn't get much response after that. \n\nThe next day I felt like my manager was kind of avoiding me and it dawned on me this weekend that perhaps I came across as racist. Most of my coworkers are African American, and I'm not [I'm Asian]. \n\nWas it racist of me to post that? Or am I over analyzing the situation? I would hate for things to be awkward at work given how great things are going. I know the rule is for jokes at work is, if you have to ask yourself if it's inappropriate, then it probably is. I really had no racist intent but I feel bad. What do you think? And what should I do about it?\n\nTL;DR made a joke on group chat, worried I came off racist, wondering what to do",
    "title": "Tried making a joke at work, did I come across racist?",
    "subreddit": "careerguidance",
    "timestamp": 1505103705,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "How do I know if I should quit my job as a junior developer? I'm a junior dev at a startup in New York. When I joined the company I didn't have any experience or a degree but even with that in mind, I'd still say my knowledge of Ruby/RoR at least was *approaching* that of a mid-level developer. The only company that would give me a job at the time primarily use Golang, which I sorta knew but not really. I told them this and they said it'd be cool and that I could work on one or two minor Ruby projects and do some customer support (everyone at the company was expected to do this back then) before eventually progressing to a mid-level role and working on Go code.\n\nSo it's been six months now and I feel that while my understanding of Go and the technologies my company specializes in have improved, they haven't improved anywhere near fast enough. There wasn't really much of a dev team when I joined (it was just me, another junior developer, a contractor and our CEO alongside less technical members of senior management). The CEO left the country a few months ago and now works from home but even when he was around, he was often pretty much doing his own thing and we were left to our own devices much of the time. Even now that they've hired more experienced staff, I still feel like I'm not getting the level of support I need. I don't expect anyone to teach me Go and I try not ask questions about it unless it becomes a blocker. But often when I raise a question about the way in which our core product functions in the company's Slack channel, I'm either ignored, forced to make do with the fact that nobody in my time zone understands the code well enough to know the answer, given answers that confuse more than help or, on rare occasions, belittled for not knowing the answer already even though everyone knows how much the existing documentation sucks. As a result, I often feel overwhelmed by the support side of my role and even on days where there are barely any user queries, I'm plagued by issues with the build environment that nobody can ever help me with or assigned confusing tasks that seemingly no one understands. I don't even really get to code all that much and often just feel more like an overpaid application support engineer than a developer.\n\nI don't know if this is all just growing pains and if I should just keep at it or if this really is a bad environment for me. Even though I feel really lonely most of the time (most of the other developers work from home in different states and I actually don't have that much in common with any of them - I'm the only African American and one of only three women in the company, I'm the only developer who doesn't either have a CS degree or 5 years+ of experience, etc.), I do actually really like the people I work with. At the same time, I worry that I might be being taken advantage of, which just tends to happen to me a lot in general. I've considered leaving but I'm also conscious of the fact that almost none of the code I've worked on in the last six months has been made public so, to a potential employer, I'd look as though I were in the same position as I was back when I was looking for a job six months ago.\n\nAny thoughts?",
    "title": "How do I know if I should quit my job as a junior developer?",
    "subreddit": "cscareerquestions",
    "timestamp": 1492625457,
    "score": 2,
    "keyword": "american ceo"
  },
  {
    "text": "Traveling to India as a cs career American born and raised but descent from Indian origin.\nIve always had a dream when I pick up a cs career to be able to travel back and forth. I had an engineer father (mechanical) who was able to travel to china when he worked for one company. We have a neighbor who works for apple, goes to china alot.\nWith software so deeply rooted between india and the united states, are there opportunities for non ceo's and high level management but regular programmers to travel?",
    "title": "Traveling to India as a cs career",
    "subreddit": "cscareerquestions",
    "timestamp": 1510723707,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "Immigration and CS jobs I live in Canada (although I'm not Canadian) and I had hopes of going to Cali for FT because lets face it, California or Washington (maybe NYC) are the only places where software engineers actually make money. Salaries are low in Canada, ~60k US after conversion. Why is the general consensus that immigrants steal US citizens' jobs? Tech is dominated by Asians, and although they may be \"American,\" they really aren't (they moved there some time). Google's CEO is Indian, Microsoft, Adobe, .... The simple reason I would like to move to USA is because of $$$. Period. What are your thoughts on this topic?",
    "title": "Immigration and CS jobs",
    "subreddit": "cscareerquestions",
    "timestamp": 1493281639,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "The CEO of consulting giant Accenture's North American business talks about innovation, jobs and business under Trump",
    "title": "The CEO of consulting giant Accenture's North American business talks about innovation, jobs and business under Trump",
    "subreddit": "consulting",
    "timestamp": 1487401141,
    "score": 11,
    "keyword": "american ceo"
  },
  {
    "text": "There Are Only 23 Black Owned Banks Left in America > Black-Owned Banks Hit Their Peak a Century Ago \n\n> In late 19th and early 20th century, 57 black-owned charter banks entered the system\n\n> Black-owned banks arose and flourished in a period when African-Americans were kept out of other financial institutions, both overtly and through practices that effectively walled off their neighborhoods from other banks.\n\n> The sector hit a peak in the late 19th and early 20th century, a period when 57 black-owned banks and credit unions existed. \n\n> Six CEOs of black-owned banks locked themselves in a New Orleans conference room for more than a day in late 2016. Surrounded by papers, drawing boards and PowerPoints, the group strategized ways to reverse a trend 15 years in the making: the decline of their own banking sector.\n\n> The number of black-owned banks operating in the U.S. has been dropping steadily for the past 15 years and fell to 23 this year, the lowest level in recent history, according to the Federal Deposit Insurance Corp. That has left many African-American communities short of access to capital and traditional financial services, according to some banking experts.\n\n> “We have a crisis among black banks,” said Doyle Mitchell, CEO of Washington-based Industrial Bank. “We met…to save the industry. To save ourselves.”\n\n> The 2008 recession hit the black banking sector especially hard, and if the current rate of closures of about two a year, as well as the industry-wide reluctance or inability to start banks, continues, black-owned banks could disappear entirely within the next eight to 12 years.\n\n> The trend is worrisome to some analysts who argue fewer banks serving low-income, minority groups could expand “financial deserts”—communities with few or no banking institutions—and increase the likelihood that black and Hispanic communities could become susceptible to redlining, a discriminatory practice that excludes poorer minority areas from financial services.\n\n> “These banks are banks that serve relatively poor neighborhoods,” said Russell Kashian, an economics professor who studies black-owned banks. “There are neighborhoods that if…the black-owned bank isn’t there, nobody is there.”\n\n> Most black-owned banks typically have a few branches in one city, although one of the category’s largest players, New Orleans-based Liberty Bank, has a multistate presence. Such banks comprise just a sliver of the overall U.S. financial sector, with collective assets of $5.5 billion, versus $16.3 trillion in the industry overall.\n\n> As a result, some economists question the significance of the sector’s decline. “Size-wise they’ve been small,” said Nicholas Lash, a business professor at Loyola University Chicago who studies minority banking. “So their total impact on black communities can’t be very, very large.”\n\n> Yet those who live in communities that have been served by black-owned banks say the impact there, both practical and psychological, is deeply felt. The most recent example is in Chicago, where Illinois state regulators in January closed Seaway Bank & Trust, determining that its financial health had so deteriorated that pumping in more money couldn’t save it.\n\n> “It was like air coming out of a balloon,” said Bob Fioretti, a former Chicago alderman who was previously involved in raising money to keep Seaway open. “People were deflated. Seaway was a standing icon of the community.”\n\n> Seaway, formerly Chicago’s largest black-owned bank, helped anchor the famed black business community on the city’s South Side.\n\n> Claire Adams, a former board president of a South Side Chicago housing community that was one of the first businesses to use Seaway when it opened in 1965, said she now fears that with fewer small, community banks in her part of the city, payday lenders and check-cashing institutions, which often charge exorbitant rates and fees, would be many African-Americans’ only nearby banking option.\n\n> “The only thing that’s left are these predatory institutions,” Ms. Adams said.\n\n> In some areas of the South Side, Seaway was the first bank some African-Americans had access to, making it a symbol of black enterprise and economic development, patrons say. Many speak of the bank with admiration, often mentioning a program that allowed children to open a bank account with a small amount of money.\n\n> “I [could go to] Chase or something…but I like Seaway,” said Nell Robinson, who has used Seaway for more than two decades. “Seaway was here before Chase. It’s a black bank [and], we have to pull our people up.”\n\n> With such concerns in mind, members of the South Side’s religious community raised more than $100,000 in deposits for Seaway in 2016. But the effort wasn’t enough. Seaway was sold to the State Bank of Texas, then sold again to North Carolina-based Self-Help Credit Union.\n\n> A prolonged period of low interest rates and intense competition, as bigger banks slowly move into underserved areas, have combined to contribute to the black banking sector’s decline, even after the recession’s end. Now a practical concern in Chicago and elsewhere is that, even if bigger institutions step in, they won’t be as accommodating in lending to black-owned businesses.\n\n> A survey of entrepreneurs by the U.S. Census Bureau in 2014 found that 47% of black business owners had gotten the full amount of funding requested from banks, credit unions or other financial institutions, compared with 76% of whites.\n\n> That survey also showed fear of rejection was the top reason cited by black business owners who chose not to seek needed capital at all.\n\n> “When I have an applicant that comes into my bank and comes into XYZ large bank, and they’re on the edges, there are things that I can understand and appreciate about their situation that XYZ large bank won’t, and that makes the difference,” Mr. Mitchell, of Industrial Bank, said.\n\nI feel like we have to do whatever we can to keep these financial institutions alive man. Some of these banks & credit unions have been serving us and our communities since before integration. No way we should let them down now by continuing to take our business to people who don't care about or respect us. \n\nI have an account w/ Industrial Bank here in DC which is black owned in fact it was my very first bank account ever. My parents are the reason for this, and I'm proud to say I still do business with them to this day.",
    "title": "There Are Only 23 Black Owned Banks Left in America",
    "subreddit": "blackladies",
    "timestamp": 1503677750,
    "score": 83,
    "keyword": "american ceo"
  },
  {
    "text": "Despite what you might have heard, Asian American CEOs are the exception, not the norm",
    "title": "Despite what you might have heard, Asian American CEOs are the exception, not the norm",
    "subreddit": "asianamerican",
    "timestamp": 1508417677,
    "score": 24,
    "keyword": "american ceo"
  },
  {
    "text": "You are Equal: I'm sorry Here is my response to the \"you are not equal, I'm sorry\" letter.  First, the letter in it's entirety, followed by my reply.\n\n\"Say Thank You\n\nSay thank you. Say thank you to the women who gave you a voice. Say thank you to the women who were arrested and imprisoned and beaten and gassed for you to have a voice. Say thank you to the women who refused to back down, to the women who fought tirelessly to give you a voice. Say thank you to the women who put their lives on hold, who –lucky for you — did not have “better things to do” than to march and protest and rally for your voice. So you don’t feel like a “second class citizen.” So you get to feel “equal.”\n\nThank Susan B. Anthony and Alice Paul for your right to vote.\n\nThank Elizabeth Stanton for your right to work.\n\nThank Maud Wood Park for your prenatal care and your identity outside of your husband.\n\nThank Rose Schneiderman for your humane working conditions.\n\nThank Eleanor Roosevelt and Molly Dewson for your ability to work in politics and affect policy.\n\nThank Margaret Sanger for your legal birth control.\n\nThank Carol Downer for your reproductive healthcare rights.\n\nThank Sarah Muller for your equal education.\n\nThank Ruth Bader Ginsburg, Shannon Turner, Gloria Steinem, Zelda Kingoff Nordlinger, Rosa Parks, Angela Davis, Malika Saada Saar, Wagatwe Wanjuki, Ida B. Wells, Malala Yousafzai. Thank your mother, your grandmother, your great-grandmother who did not have half of the rights you have now.\n\nYou can make your own choices, speak and be heard, vote, work, control your body, defend yourself, defend your family, because of the women who marched. You did nothing to earn those rights. You were born into those rights. You did nothing, but you reap the benefits of women, strong women, women who fought misogyny and pushed through patriarchy and fought for you. And you sit on your pedestal, a pedestal you are fortunate enough to have, and type. A keyboard warrior. A fighter for complacency. An acceptor of what you were given. A denier of facts. Wrapped up in your delusion of equality.\n\nYou are not equal. Even if you feel like you are. You still make less than a man for doing the same work. You make less as a CEO, as an athlete, as an actress, as a doctor. You make less in government, in the tech industry, in healthcare.\n\nYou still don’t have full rights over your own body. Men are still debating over your uterus. Over your prenatal care. Over your choices.\n\nYou still have to pay taxes for your basic sanitary needs.\n\nYou still have to carry mace when walking alone at night. You still have to prove to the court why you were drunk on the night you were raped. You still have to justify your behavior when a man forces himself on you.\n\nYou still don’t have paid (or even unpaid) maternity leave. You still have to go back to work while your body is broken. While you silently suffer from postpartum depression.\n\nYou still have to fight to breastfeed in public. You still have to prove to other women it’s your right to do so. You still offend others with your breasts.\n\nYou are still objectified. You are still catcalled. You are still sexualized. You are still told you’re too skinny or you’re too fat. You’re still told you’re too old or too young. You’re applauded when you “age gracefully.” You’re still told men age “better.” You’re still told to dress like a lady. You are still judged on your outfit instead of what’s in your head. What brand bag you have still matters more than your college degree.\n\nYou are still being abused by your husband, by your boyfriend. You’re still being murdered by your partners. Being beaten by your soulmate.\n\nYou are still worse off if you are a woman of color, a gay woman, a transgender woman. You are still harassed, belittled, dehumanized.\n\nYour daughters are still told they are beautiful before they are told they are smart. Your daughters are still told to behave even though “boys will be boys.” Your daughters are still told boys pull hair or pinch them because they like them.\n\nYou are not equal. Your daughters are not equal. You are still systemically oppressed.\n\nEstonia allows parents to take up to three years of leave, fully paid for the first 435 days. United States has no policy requiring maternity leave.\n\nSingapore’s women feel safe walking alone at night. American women do not.\n\nNew Zealand’s women have the smallest gender gap in wages, at 5.6%. United States’ pay gap is 20%.\n\nIceland has the highest number of women CEOs, at 44%. United States is at 4.0%.\n\nThe United States ranks at 45 for women’s equality. Behind Rwanda, Cuba, Philippines, Jamaica.\n\nBut I get it. You don’t want to admit it. You don’t want to be a victim. You think feminism is a dirty word. You think it’s not classy to fight for equality. You hate the word pussy. Unless of course you use it to call a man who isn’t up to your standard of manhood. You know the type of man that “allows” “his” woman to do whatever she damn well pleases. I get it. You believe feminists are emotional, irrational, unreasonable. Why aren’t women just satisfied with their lives, right? You get what you get and you don’t get upset, right?\n\nI get it. You want to feel empowered. You don’t want to believe you’re oppressed. Because that would mean you are indeed a “second-class citizen.” You don’t want to feel like one. I get it. But don’t worry. I will walk for you. I will walk for your daughter. And your daughter’s daughter. And maybe you will still believe the world did not change. You will believe you’ve always had the rights you have today. And that’s okay. Because women who actually care and support other women don’t care what you think about them. They care about their future and the future of the women who come after them.\n\nOpen your eyes. Open them wide. Because I’m here to tell you, along with millions of other women that you are not equal. Our equality is an illusion. A feel-good sleight of hand. A trick of the mind. I’m sorry to tell you, but you are not equal. And neither are your daughters.\n\nBut don’t worry. We will walk for you. We will fight for you. We will stand up for you. And one day you will actually be equal, instead of just feeling like you are.\"\n\n\n------------------------\n\n\nMy reply: \n\n\nI think you misunderstand the concept of \"equality\". \n\nEquality means that nobody is inherently considered to be better than someone else because of superficial qualities. It means that we have laws to prevent someone from using those superficial qualities as a basis for making decisions regarding opportunity. \n\nLet's examine your complaints one by one:\n\nYou list over a dozen women who should be thanked for fighting for the rights that women have today. Which, is all the same rights as men have (plus a few more). \nThen you double back and say basically that you can pretend that you have equal rights, but you're a fool denying all the work done by those before you.  So...  look more closely at that. The *ACCOMPLISHMENTS* of those women are what earned you equal rights. Yes. Say THANK YOU. Say it often and mean it, because you have equal rights. today. right now. You do. \n\nImmediately you plummet into the wage gap myth. Let's use some tired cliche' obvious answers of why this is stupid. \n1. If I could pay a team of primarily women approx. 75% of what I would pay an equivalent group of men, why would I not hire primarily women and save up to 25% on my largest expense as a business owner, human resources?\n2. The differences in pay between men and women in the sighted fields is normally on the level of 5 or 6 cents to the dollar. an amount easily attributed to a variety of things, but certainly not solely determined by sexism. I'll grant you that it is possible it is a factor, but if I were a betting man I'd wager an argument could be made to show sexism acounts for less than 1% of the discrepancy. \n3. Let's factor in the wages paid for jobs likely to harm or kill you. An industry happily left to men, who make up over 95% of workplace deaths. This means that jobs likely to harm or kill you are likely at least 90% men. Meaning that when you have no education, and you need to make good money, risking your life will earn you more money. Add to this the understanding that girls and women graduate high school and college in greater numbers than boys and men. \n4. young childless women, in their mid 20s, are out-earning their male counterparts. \n\nWomen aren't treated poorly in the workplace as a commonality. They gravitate towards different fields of work. There are anti discrimination laws, if someone is violating those laws, report them. use social media, expose them. Believe me, the world is watching, and very few of them would want to miss out on a chance to support a woman fighting oppression.\n\nYou go on to complain about men discussing your uterus, and your body...  So, what you mean is that men elected by a population of voters made up of men and women, where at least half don't vote, decide details of laws surrounding abortion and reproductive rights. \nCurrently you have the federal right to seek an abortion. You have literally hundreds of birth control options, ranging from hormonal daily pills, to semi monthly injections, implants, non-hormonal options...  etc. Many/most of these options are covered by health care, by law. Men have one option: condoms. Besides condoms men are told to either accept the risk of sex, or not have it at all. \nIf I meet a girl, she says \"I'm on birth control injections, and I would abort as soon as I found out if something happened anyway, I'm totally not interested in having kids at this point in my life.\". We have sex that night. we see each other another few times, and it kinda fizzles out. 4 weeks later she calls me and says \"I'm pregnant, and I know I said I would abort but I'm keeping it. It's yours\", you have no choice in the matter. You are now legally accountable for that kid for 18 years. \nIf you put that sort of lack of choice upon women, suddenly it sounds like the worst thing ever. Imagine, if a man could say \"fuck no, you're having this child, I'll take custody, and you pay me monthly to raise it, I know I agreed that abortion was what we would do if birth control failed, but I actually want a kid now, so you'll have it and I'll take it, and you help pay for it, and you can see it on weekends if you want.\"  no. If you said \"Well if you don't like the concept of being forced to have a child if you get pregnant, then don't have sex\".  This is literally the choice men have. We can trust a woman at her word, and then she can change her mind and we are legally responsible for that kid. This is not equality, not at all. when the suggestion of the \"financial abortion\" is made, that a man can tell a woman \"I will not raise a child with you, I am opting out legally from raising this child or ever having a right to be in this child's life\" you have to release that man from being a legal parent. This would have to occur within a time frame during pregnancy the same as a biological abortion. This allows women their choice of being single parents, or aborting in the case that they decided to keep an accidental pregnancy. This allows men to be held to their word, as well as women to be held to theirs. This allows equality of choice, and reproductive rights.  \nI also wonder where feminism is on helping to promote Vasalgel, which would greatly reduce the rate of accidental pregnancy in the first place, and give men a powerful option for birth control methods, putting them a step closer to women in terms of this right. \n\nTaxes on \"basic sanitary needs\".  you are talking about equality to men, right? we pay taxes on our basic sanitary needs all the time. razors and toilet paper and tissues, and talcum powders, and deoderants...  of course we pay taxes on those items. If you have a complaint that items like sanitary goods shouldnt be taxed, that is fine, I probably would support that. But I don't see how you believe that is an issue of inequality to men. \n\nThe letter talks after this about having to \"justify their actions after a man forces himself on them\" right. you have to recount exactly how it happened to the police, who will investigate the incident. You have to explain to police when there is a potential element of consent involved that you had clearly communicated you were not consenting, and how you did that. So the police will ask you detailed questions all about the incident so they can do their job as best as possible. You giving a strong account of an event will help your case. the police are trying to help you.  this is not inequality. If I am attacked by someone, and I break their nose and jaw defending myself, and yet I'm untouched claiming to have been attacked, I'm going to have some detailed explanations to make, aren't I? and here I am the victim, being interrogated!? Yes. Because your story is a very important element of the incident. \n\nYou follow this by mentioning that women don't have paid maternity leave. Do men have paid paternity leave? \nOh...  women in other countries have it, gotcha, Because this was supposed to be about how you're not equal to men, wasn't it? Sure, work to get paid maternity leave, work to get all the things you believe would improve out society. But don't claim it is a factor of inequality. Because it's just something you want the government to regulate about business, and you cannot simply stuff socialist concepts down people's throat without a spoonfull of oppression to make it slide down a little easier. This again is not an inequality, and I've yet to see an actual right you lack that men have. \n\nThe next topic is breastfeeding. I don't really know if there are any laws preventing this, but I'm fairly sure that most laws allow for it, making an exclusion to indecency laws for breastfeeding in public. I think people who give others a hard time for this are shitty people. It isn't something men do though, so it's not an inequality, it's also (to my knowledge) not regulated as being illegal. So it's mainly social pressure and commentary that is being complained about. Again, not a right being denied to women that is granted to men. If women want to urge the law to let them be topless as it does in various parts of the country, go for it. Just don't expect men to stop looking at tittys. That's never going to happen. \n\nThe next part discusses social pressures and criticisms of things like appearance and then references being judged for the brand of high end hand bag she carries rather than her degree.....  by who? BY WHO!? I don't know any men who would know the brand of the handbag, but they might judge you by your degree. A degree she is more likely to have than a man, on average, by the way.  You are judged differently from men on your appearance? probably. But if you believe men aren't objectified you're crazy. If you think men aren't catcalled you're crazy. You simply can't see what your feminist lenses filter out. This is not inequality. There is no law that can prevent how people see other people. and your depiction of judgement for the high end handbag over the college degree just stinks of your inability to see just how insane your privilege theory really is. \n\nNext up is spousal abuse and rape, followed by the privilege stack listing off people worse off than white men.  Let's take them one at a time. The deluth model makes sure men are arrested when they are the abused. The lack of men's shelters helps to ensure that there are no resources for men to get themselves and their children out of abusive homes. If they go to the CPS, they may lose their children all together, because of the lack of understanding of abused men in our society. You ignore half of the abuse sufferers because of their gender, and act like women are the ones who are invisible. Just google \"men's shelter closes\" and read.  That's feminism. that's your equality. You want to know a little nugget of info that should help you understand how much you don't understand this situation? Lesbian couples have the highest rates of spousal abuse. \n\nFollowing this you compare the USA to various other nations. \n\nSingapore, Estonia, Iceland, New Zealand. You understand that your request for equality is all over the map, you want to have the benefits of socialist systems for yourself, but you also idolize what some of the least diverse nations on the planet are able to do by being a strongly nationalist society. They have some of the most strict immigration laws in the world, while america remains to have one of the most permissive. None of this has any bearing on your equality to American men. \n\nThe next paragraph essentially creates a straw man out of the sort of person who would claim to be on equal footing to men in America. The author essentially paints a picture of a woman who says she isn't a victim, and doesn't see the world through the feminist lens. Then scoffs at this straw man, claiming she get's it. It's because these sort of women cannot bear to understand their victimized place in society, that these women who don't walk around feeling the victimhood of womanhood are simply too weak to handle the realities of our world, and their place in it. The existence of successful women, and the individuals who are doing well in life are tossed aside, with the explanation that just because a woman can make patriarchy work for her doesn't mean she isn't still oppressed... Right. It's amazing how the writer of this article can start off the list thanking all those who won her the equal rights she enjoys today, turn around and deny the equal rights she has, and then list off a bunch of factors that have nothing to do with equality, simply are issues feminism/some women have with modern society or government policy in America. Though not one can be held up as a right other citizens have that they are denied. Not one can be listed as a \"human right\" and not one can be looked at as anything more than a first world complaint when compared to what women around the world deal with. \n\nShe ends the list having never sighted one thing men have that women don't, but that she will keep fighting to make she she gets those equal rights, because even though you might feel equal in your life, you really aren't because you're eyes aren't opened, and focused through the feminist lens to see how horribly you have it.  \n\n\nHere is a list of rights women have that men do not: \n\nWomen are able to register to vote without a social contract of selective military service. Men may not register to vote without selective service registration. Failure to register for the selective service may result in fines or jail time. \n\nWomen have the only legal control grated over reproductive rights. Men have the option to use birth control or abstain from sex in order to control their reproductive rights. \n\nWomen in the USA aren't allowed to have part of their genitals removed at birth. Male genital mutilation is considered normal in the USA.\n\nIn several states, men cannot be \"raped\" by a woman. Rape is only considered to be penetrated, but being forced to penetrate is not called rape. Further, you'll notice when a little boy is raped by a woman, they call it an affair, or sex, but not rape. \n\nAnway, that's about it. Legally we are pretty much on equal ground. So when you discuss the issues, call it what it is. You are fighting for womens rights, and women's issues. But not equality. You thanked the women in the first part of your letter who gave you that. Maybe stop shitting all over their work by claiming it didn't accomplish all that it has. You have all the legal rights of men in your nation, and then some.",
    "title": "You are Equal: I'm sorry",
    "subreddit": "MensRights",
    "timestamp": 1485362231,
    "score": 12,
    "keyword": "american ceo"
  }
]