[
  {
    "text": "[office politics] coworker backstabbing me I got out of an engineering school October 2016. I am NOT American (Europe). I got my first job in August 2017. \n\nI am part of a small team of highly qualified people. We are 8 :\n\n•\tThe boss\n\n•\tMe\n\n•\tThe boss’ secretary\n\n•\tAn old guy (50)\n\n•\tAnother young guy (26, same age as me)\n\n•\tA regular guy (40)\n\nAll those people are directors. They have corporate positions which means they are in charge of one aspect for all the factories of the Group (about 100 factories throughout the world). \n\nFor instance one of these guy is in charge of maintenance while the other is in charge of industrial performance. \n\nI work in a team with the old guy, let’s call him “fucker” (name changed to protect identity, although I got the feeling you would recognize him easily with this new name). \n\nWe work together on one huge project which is about quality management. He is officially the one in charge. \n\nSo fucker works on industrial performance and on this project. I was recruited to handle this project and the many more projects concerning quality management that will arise in the future. So this project is tremendously important to me. \n\nHere is the problem \n\n**first** he takes credit for all MY work. I work like hell, I send him what I did, and then he sends it to the boss without ever mentioning my name or what I did. \n\n**second** I have the feeling he tries to “erase” me. For instance I asked him to tell me when he would call our boss to discuss the project advancement. He did it without me (teamwork anyone?). So it’s like he is the only one working on this project. All the work I do is invisible because he takes credit for my work and I don’t even take part into project advancement discussions. \n\nI WANNA KILL THAT MOTH..\n\n**sigh**\n\nYeah. \n\nWorst thing is he is very nice and I always have a great time with him but he harms me behind my back. \n\nMy goal is to show my boss that I work hard on this project. Because right now he must be thinking I do nothing at all. \n\nI am only hired for ONE YEAR. This is a great opportunity for me and I don’t want to fuck this up. \n\nPLEASE HELP I’M LOST",
    "title": "[office politics] coworker backstabbing me",
    "subreddit": "jobs",
    "timestamp": 1510747814,
    "score": 6,
    "keyword": "american director"
  },
  {
    "text": "'Dream' job but academically underqualified, could I approach the employer for work experience/internship? Having just come out of University (UK) I'm left with the typical 'I have no idea what I want to do with my life' situation. I have committed to take the next year out from education to explore potential career paths and travel, hopefully with the goal of trying several different jobs through work experience to help form an idea of what I will enjoy. Recently, a psychological non-profit foundation, for which I have taken a keen interest in their work, has opened up a job opportunity (scientific assistant to the director) that almost perfectly fits my interests and skill sets (requires use of indesign/photoshop and academic writing background), yet I am under qualified for the role (requires a postgraduate degree in the field - so a clear tier above what I can provide). In light of this and having achieved the highest classification of UK degree (1st class honors in Psychology, GPA ~3.65 – not sure if this is good by American standards?) I feel that I could still contribute to the organization whilst also being a useful avenue to direct my interests, further reading and career path options. Is there ever a situation where I could request a sort of work experience or internship per say or am I simply being very ignorant to the realities of the world of work and wasting their time?  \n\nIf I should reach out and contact them has anyone got any advice on how to appropriately go about it?\n\nThanks a lot for your time!\n\ntldr; just out of university with a 1st in Psychology, taking the year out, interesting job for non-profit organization with similar skill set to mine but underqualified, can/should I enquire about some form of work experience.",
    "title": "'Dream' job but academically underqualified, could I approach the employer for work experience/internship?",
    "subreddit": "jobs",
    "timestamp": 1500319627,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear. Hi everyone. I don't really have anyone to bare my heart to right now. I want to send this out to the universe and see what comes back. I would love to hear your perspectives.. whatever corner of the world you're in.. whatever life path you've walked. I really appreciate all your voices and Reddit so so much. I'll try to keep it condensed and simple. \n\nI dated a narcissist for eight months. He was incredibly cruel and selfish but hooked me with rare very special moments of revealing a deeply hurt.. damaged.. wholesome.. helplessly pure childlike heart. He would verbally and emotionally abuse me but sometimes with time, he would realize how hurtful or selfish his actions were. With sincere tears in his eyes he would apologize and express that he's learning and wants to change.. express that his cruel actions and words are purely from ignorance because even his own mother never showed him any love, open-heartedness, gentleness, morals. \n\nIt doesn't come as a surprise.. he experienced a horribly abusive heartbreaking childhood. He used that excuse almost always. And being an empath.. my heart opened and poured for him, I wanted to love him more. Help him see all women aren't money hungry and out to lie and cheat. Show him it's okay to open and be vulnerable. My upbringing wasn't perfect either. I honestly felt we were both \"breaking\" our cycles of hurt from the abuse and neglect our parents created. (My family was very poor growing up and my father abandoned my mother, sister and I when I was 12.) He always said such amazing things about growing old together.. building character through experience.. being there for eachother.. building a life and family together that's strong and confident (him) but sensitive giving and loving (me). He would say I am the best person he's ever met with character he values most above anything. That I have changed his life forever in all aspects of his life.. work. And I was learning a lot about patience, understanding, and forgiveness. No relationship is flawless and flatlined. I appreciate and value rolling with the punches of life. Struggle is what makes you grow.. its what broadens and builds your mind and heart, I love that. And I love the idea of a life partner who is down to walk the sometimes mountainous path of life with you. I appreciate open-mindedness and the will to adapt. Effort is so beautiful. Anyway.. I honestly believed we could awaken together.. Live more and more with awareness.. and mindfulness.. and learn together. But I was wrong. He would do things like tell me his ex was exceptionally beautiful.. she was a professional model.. but I'm pretty. His other ex is very smart. But I'm definitely not smart. I'm talented and creative. But not smart because my brain is not wired to be a coder or engineer. This is one of the most painful parts. I stayed with a man who fought me and defended himself for the right to call me stupid.. many times. He would tell me my problems are trivial.. that he doesn't care about my pleasure.. several times he would fuck me and just roll over. I would silently cry in the dark and masturbate next to him as he snored. We fought so many times about our sex life. It was always selfish and only about him. There were times I would be very ill or very drunk and he would just go ahead and fuck me.. even when I'm barely conscious. I would just lie there in the fetal position. He said that was one of the great things about me.. \"I never left him wanting.\" He was so proud that he's slept with 120 women. He told me I was the first one he gave eye contact with when having sex. And he said he typically didn't kiss the girls he'd sleep with. That I have no idea how much he's changed. I brought this up so many times.. that I want to make love.. sex should be us sharing how we feel physically.. it's about both of us..and he just didn't care. He would say sometimes sex is just carnal and sometimes he needs to be a man and take it. It's just about him. I never once orgasmed in the 8 months we dated. He never tried. It was always for him. He went down on me maybe 3 times in 8 months. He blamed it on me. He said some women aren't confident or comfortable orgasming in front of people. He would say some girls orgasmed as soon as he put his dick in them. Typing this out I know it sounds fucking heartbreaking and pathetic. I know. If I heard all this from my sister or if my future daughter were telling me all this... I would be utterly mortified and devastated for them. Sometimes it's very hard to see unobstructed reality when you're struggling in the middle of everything. He would fall asleep after I drove 22 miles to talk about how he's hurt me as I am crying next to him in his bed. He once dropped me on the side of the road with all my luggage to take an uber home after a road trip when I said I wanted to go back to my apartment, not his. \n\nHe has a very unhealthy relationship with sex. He was once over 500 pounds but with sheer will.. starving and lifting he lost 230lbs. From age 30 to 35 he overcompensated by \"fucking and conquering as many women as possible doing whatever it takes to make them comfortable\" His greatest fantasy is rape. He would often tell me his greatest \"id\" fantasy is to kick down a door like a Viking and violently rape a wife as his defenseless smaller frightened husband is forced to watch in horror. (My ex is 6'5) He used to \"jokingly\" say rape victims often orgasm because in a subconscious level they loved it. He would joke and say 50 shades of grey is about him.. and there's a reason why that franchise is insanely popular. Women love and want to be raped on a cave man level. He absolutely lovess the new Westworld for how brutal and fetishized rape, pleasures, violence, dominance, and indulgence is. He would often say when he looks around and thinks about it.. his character and life is similar to most leaders. The greatest leaders he knows arent emotional, overly caring, sensitive, \"squishy\" or giving. Superstar singers.. athletes.. businessmen like Steve jobs.. world famous video game designers.. they all have one thing in common. They \"lick the earth\" as he would put it.. and they dont hold back their id-driven desires. That is the source of their greatness and inspiration, especially as an artist. Being a sensitive \"squishy\" ..That all seemed so empty to me. \n\nHis dream is to have a line of hundreds of women waiting their turn to be fucked.. he impregnates them and doesn't take care of the babies. \"Like a Viking king\" He often said sex is a need. If he doesn't have sex in two weeks everyone starts to look like meat. He doesn't care. Men and women alike. I tried to understand the root of this manifestation. It was horrifying to hear but in all these stories.. all I saw was this nerdy obese kid who was ignored all of his life... a guy who was so ignored that he lost his virginity to a prostitute... this poor 7 year old boy who would be locked in his room for days by his horrible stepfather. His cries ignored by his cold mother to ensure her loans are paid by this new man. It all screamed suffering and heartbreak. Especially because I personally know several women who have experienced rape and I have been volunteering with The Rape Foundation for several years. I really tried not to judge. How can you.. life is crazy and sometimes devastating and sometimes you dealt difficult cards.. like your parents. And humans are capable of such cruelty.. a lot of times they genuinely think they're doing the right thing. We also got into many painful fights about his views on having children and marriage. He said he would absolutely test the blood of his babies. That was a deal breaker. I would explain how hurtful that is. He would say its not about me. It's statistics. Women will lie and have men financially support children that are not theirs. (This is what his mother did to his stepfather. When his stepfather found out. He began to abuse my ex from a very young age.) He also said 80% of women initiate divorce for the payday. So if marriage was a deal breaker he would consider \"many types of arrangements\" with the help of his lawyers. \n\nAnyway.. 8 months we dated. He made me cry 1-3 times a week. But when things were good we were both adventurous.. incredibly playful.. tender.. driven.. and affectionate. We both love similar music and movies. He would sing to me.. we loved going on long drives and talking about life.. this existence.. our hopes and dreams. We are both class clowns. But one thing was rawly clear. We were cut from different cloths. He's a big tall trump loving white guy from Texas who always lived in a big house.. no student loans.. went to art school.. atheist.. first job was after college for a video game company.. etc. I'm a Korean American from the east coast who was raised by a struggling single immigrant mother.. have had at least one job since high school.. lived in my car in NYC.. put myself through college thus have student debt (this was a big issue for us.. he said for him to even consider marrying me.. I would have to get rid of my debt. I'm the first one in my family to go to college).. insatiably curious about spirituality.. religions.. philosophy, the human condition. I am such a sensitive giving tender hopeless romantic easily hurt squishy. And he's just a confident iron fist, force. His mother and the rest of his family believe vulnerability and feelings equal weakness. A few times he was very vulnurable and shared how when he get married and starts a family, he plans to stay away from his family because they are all a very certain way. \"poverty mentality\" is what he would call it. He would share how his mom never cared.. and still doesnt care about his problems when he tries to open up to her. One time when he dumped me he said.. his mother is so strong she has never cried ever in his life. And I cry all the time. He would resent her for her hard coldness but I don't think he's aware of how attached and proud he is of her. He'd laugh and say \"my mom is a tempest. Shes the boss of the house, what she says goes, she gets her way, she's dominant she's fierce. She's a force.\" He would express how the other girlfriends he introduced to his mom were shredded apart and would end in tears going up against such an intimidating woman. I see right thru all that. His mom holds a tremendous amount of guilt. He never once talked to her about how her abandoned him while his step father would abuse him and lock him up. For days he would sleep on a bare mattress.. starve..  and go to the bathroom in the room. He said he became obese because of this feeling of having absolutely no control and not knowing when he'll eat again. It's so heartbreaking. When he got older his step dad and mom sent him away to a military school for delinquent kids. He would be locked in his dorm for days as well. He would beat kids up and created a group of friends that he \"protected\". Multiple times he told me about a very feminine kid who would massage him in exchange for his protection. My ex would explain if they locked him up in his dorm for a few more weeks he would have absolutely fucked that feminine kid. My gut tells me he did a lot at that school that he'll probably never tell anyone. \n\nI see thru all this. He and his mom have taught eachother to pretend like nothing happened. This is their way of comforting eachother.. pretending like it went away. As a woman.. as a super sensitive aware woman.. I know she's holding a lot of guilt and sadness. She's created such a tough persona she can't get herself to let it out. People will live a lifetime running from feeling. \n\nMy ex is incredibly charismatic to his coworkers and he's loved and well known at work. Many shy guys at his video game company idolize him and his ability to sleep with many women. He's this fearless jokester who is \"untouchable\". He is very proud of the fact that he hit the \"jackpot\" being born a tall white confident man. He has absolutely no one he's responsible for except for himself. Im very close to my mother and sister and when my parents divorced I pretty much stepped up and felt responsible for keeping the three of us together. Since high school I started to help financially support our family. He couldn't understand that. He'd simply say it's very good of me. \n\nAnyway..\nWe are such opposites and we knew this from day one. I was WAY too giving. I paid for amazing vacations because he had never snowboarded.. snowboarding was my life from middle school to college. I always drove to his place in Santa Monica (22 miles away from my place and my work.) I always planned amazing adventures.. things he's never done in LA. He surprised me with a candle lit dinner once. The first three times we ever went out to dinner was my idea and I treated him. He used to say I am the balance and light that will melt the ice and softened the thorns around his heart. I remember one time he was just in awe. He didn't own any plates or cups so we went to target and I got him some essentials. He said he had never been treated or cared like this. In the beginning, he did hand draw me pictures of me which was really touching. He had flowers sent to my work. Once after we fought and once after I stayed with him while he got a gal stone removed. He used to say he had never spent money like this for anyone. He used to never even buy girls drinks before taking them home. So many times I told him. I don't care about the money spent. Pick a dandelion for me. Let's share a mcdonalds apple pie on the beach. It's the thought care and effort that is so special. He just never got it. \n\nHonestly as the days pass and I continue to practice Shambhala meditation, contemplation and mindfulness.. I see I was YEARNING for that strong eternal male energy love... the love of an unconditionally loving caring father that I never had. He broke my heart 1-3 times a week for 8 months, honestly my heart and gut knew it was very wrong. But my yearning to fall in love.. to GIVE the love I hope to receive.. and the yearning to settle down blinded me. I gave the love that I wish to receive. Even though my ex didn't deserve it. The biggest lesson I am walking away with is why did I stay for so long. That's where I am going to learn and grow from. That's where my self love needs to focus on. Believing in someone.. believing in hope.. believing in good and forgiveness are all wonderful things but there needs to be an unbreakable boundary where my self respect and self worth isn't brutalized. And I need to have self love and strength to walk away. For good. Even when they're crying, apologizing, explaining, or making the most beautiful promises. \n\nThe very last week we spoke. I texted him in the morning after fighting the night before. He bit my head off about bothering him at work. I went silent after that. After several hours he emailed me explaining he fucked up and when he gets emotionally overwhelmed he doesn't know how to deal. He said he loved me.. loved what we've built.. that I am a ray of sunshine he has been able to capture and he will never give up. He said he was going to come over that night to fix things. \n\nI was so exhausted and broken.. I couldn't get myself to respond. I just didn't get it. Me caring.. me reaching out being affectionate.. texting him to see if he's okay.. all of that to him was nothing but an annoyance and a horrible burden. If you have so many excuses against it.. and so much aggression and aversion against it... why be in it? How can I apologize and be sorry for burdening you with my affection? Poisoning your life with my love? \n\nAfter getting no response for 5 hours he texted me. \"Actually I'm not coming tonight. I'm seeing other people.\" That was it. After a few days. I emailed him a couple times that I deserve a proper phone call break up. He unblocked my number and finally called me. Immediately he just unloaded his anger. He blamed everything on me. He said I have a personality disorder and as my friend he was begging me to get help. That everything was in my head and that I cry for no reason. He said he knew from the first week of dating that I was the problem but he felt bad for me and was tired of hopping from one girl to another so he stayed with me for 8 months. He said he is tall.. confident and white.. he makes a shit ton of money and he loves his life. He said \"I simply have TOO MANY choices.. our connection wasn't special at all and I will love again\" He said he had already fucked someone new and she is \"very sweet\". He went on a date with someone and \"she is fucking awesome\". I stayed on the phone as he said every single thing a hurt desperate person would say to try to convince himself that's he's okay.. he's in control.. he's not hurt.. and he's right and strong. \n\nWe often talked about the five love languages. He always said he only needs physical touch. And I need all five which he thought was crazy. I stayed on the phone with him as he described all the reasons why this new stranger he slept with was better than me. How her only love language is touch as well. He emailed me on Monday saying he will never give up, and by Thursday he had slept with someone new. As I listened to all this.. it finally clicked in my heart. That was it. All the hope and forgiveness and empty promises broke in me. He finally cut the remaining karmic tie between us. This was never about me. I was never going to make this guy happy and we were never going to work. All this horrible cruelty he was yelling into the phone... was his internal dialogue convincing himself that he is right, he is okay, he not hurt, he is not responsible. Having no control.. or being accountable for selfish hurtful actions causes him to lash out. He has such a fear of feeling things.. of getting hurt.. or having no control that he rather live a surface level life and cushion himself with yes people and agreeable circumstances that make his life easy and unchallenging in anyway. Control everything.\n\nThat, believe it or not is the shortish summary of my last 10 months. There are so many other examples and details but I have a feeling you guys get the picture. \n\nSo here I am today. It's been an up and down road to healing. Today my close friend sent me articles on the toxic relationship between empaths and narcissists. I am SHOCKED how accurate and to the T these articles capture our relationship. Our relationship was EXACTLY like how these articles explain it. Honestly... I wish fate would send these articles to him.. I even contemplated having my fiend or my sister email them to him. Is it wrong of me to care about his happiness and growth? Care about him opening his eyes to the destruction he's creating? Is it wrong of me that I don't violently hate him? I feel sad FOR him. I feel no need for relief by cursing him and saying cruel things. I have no need to fill any voids by sleeping with people and saying \"OH I am SO over him. OH he was horrible and I can do better.\" Life is vast and life is crazy. How can I condemn and judge anyone? That's just not me. You can't control certain cards you're dealt... like your upbringing. But you DO have the choice in how you live on from these experiences. That is what I do choose to examine. I wish him bravery and strength.. I wish that for anybody and everybody. I wish that for myself too! I'm working on it everyday. Strength to see myself and life without any veils. See my actions without any self deception. (Deception like cushioning your ego.. focusing on blame which is so empty and pointless.) Fear from not knowing what's gonna happen.. fear of having no control.. it's instinct to protect yourself. Your ego will protect itself with all kinds of destructive momentary relief (empty sex, alcohol, saying mean things to people and putting others down, etc.) I wanna see things for what they truly are. Be brave enough and have the wisdom to walk away when you know it's wrong and not meant for you. \n\nIs it wrong of me to hope that he'll learn the true root of happiness? It's not money or sex with hundreds of beautiful women. Or telling yourself how confident and awesome you are. How many people know you. (From the years of isolation.. all he did is draw alone in his room. Now he is a somewhat well known video game artist and director at a major video game company in LA.)\n\nLiving a full life is about living awake.. how much you open yourself to the world. How much you give and share. Vulnerability is true bravery and strength. Not cushioning your life with ease and agreeableness. But I realized.. who am I to force a lesson on anyone. Who am I to \"make\" someone wake up or realize things. Even if he were to have a.. \"shit.. now I see\" moment.. it takes consistent drive and desire to be awake and mindful... it takes time to change your habits. I just wanted to know what you guys think. Thank you for reading. I may be hurt and heartbroken but I am SO thankful for this experience. I think these lessons have really opened my eyes and I'm coming out stronger and a lot wiser. You definitely can be too open... too giving.. and too forgiving. \n\nhttps://dailyoccupation.com/2017/03/14/toxic-attraction-empath-narcissist/\n\nhttps://www.psychologytoday.com/blog/sense-and-sensitivity/201201/the-highly-sensitive-person-and-the-narcissist?amp\n\nAs the time passes I rawly see how completely lost I became. I lost myself and completely forgot who I am and what I'm worth. I became a deeply desperate and sad person. Everyday I yearned for the small crumbs of kindness and affection he would strategically give me.. especially in the form of verbal affirmation: telling me I'm the love of his life and he will never give up. But then check me by ogling and comment on women's bodies while we're out.. and keep me down on myself and insecure. He is truly manipulative with his words which in this world can take you far. It's rewarded. He was always very proud that he could get what he wanted.. especially with women. I also rawly see that how you treat and speak to others is a true reflection of how you treat and speak to yourself internally. If someone is so easily and freely able to be sooo mean and cruel to another living breathing FEELING human.. how is their internal dialogue with themselves and their self worth? \n\nThank you so much for the wonderful comments and messages. I cannot express how moved I am. Its even more special because we are all anonymous strangers yet we are all so interconnected in how we feel and the hardships we face. I am so thankful. I choose to take this painful experience and life lesson and continue to explore myself.. love myself... open myself to others.. and love. \n\nHe texted and emailed me a few weeks ago. He wrote:\n\nText:\nIt's been hard without you. I hope you're okay.\n\nEmail: \nIt's been hard without you. I hope you're okay. Sorry for how things went down. \n\nI couldn't respond.",
    "title": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1498231430,
    "score": 12,
    "keyword": "american director"
  },
  {
    "text": "If you're looking for a career change and always wanted to work a think tank..... The Center for American Progress is hiring an Education Policy Analyst.  Center for American Progress is a left-leaning organization, one of the few liberal advocacy groups with money.  \n\nI have no association with CAP, but I look there occasionally because I daydream about writing policy papers.\n\nhttps://www.americanprogress.org/about/jobs/296835/policy-analystsenior-policy-analyst-education/\n\nfrom the posting:\n\n\"Summary\n\nAmerican Progress has an immediate opening for an Education Policy Analyst/Senior Policy Analyst. The analyst will work under the direction of the Vice President for Education Policy and the Managing Director for Education Policy on a variety of education policy issues, such as teachers and principals; standards, assessments, and accountability; the science of learning; and education innovation.\n\nResponsibilities:\n\n* Conduct policy research and synthesize extant knowledge.\n* Write and edit accessible letters, memos, columns, briefs, and reports.\n* Elicit and provide feedback on written materials.\n* Assist in the coordination and planning of meetings and events.\n* Identify, recruit, and monitor contractors.\n* Interface formally and informally with media, external groups, and policymakers.\n* Perform other duties as assigned.\n\nQualifications and requirements:\n\n* At least three years (policy analyst) or seven years (senior policy analyst) of relevant work experience.\n* Advanced degree in a social-science discipline, public policy, or education (preferred for policy analyst, required for senior policy analyst).\n* Proven expertise in aspects of federal or state education policy.\n* Robust understanding of local education policy or practice.\n* Excellent writing and editing skills.\n* Strong ability to conceptualize problems.\n* Strong ability to manipulate and analyze data.\n* Strong ability to formulate policy recommendations.\n* Ability to work under pressure and tight deadlines in a fast-paced environment.\n* Ability to initiate projects and balance multiple projects at once.\n* Strong interpersonal skills and ability to work well on a team.\n* Knowledge of federal policymaking and budget processes.\n* Commitment to the organization’s mission and goals.\n\n\nThis position is part of a bargaining unit represented by IFPTE Local 70.\"",
    "title": "If you're looking for a career change and always wanted to work a think tank.....",
    "subreddit": "Teachers",
    "timestamp": 1492432686,
    "score": 0,
    "keyword": "american director"
  },
  {
    "text": "How to deal with a Pro-Trump client? Aware that being Pro-Trump is a democratic choice. The problem is that all day they are quoting Fox News level of reasoning: \n\nTrump is not against muslims, but he just wants to know who they are and wants them to stop killing Americans every day. \n\nHe should golf every weekend because he needs a clear mind to make important decisions.\n\nClimate change is made up to take away energy jobs from America.\n\nObama's kids lived in the white house surrounded by top secret stuff, so why can't trump's family get the same information. \n\nThe biggest problem is that these are educated Senior Directors at a large institution. I want to correct them, but I just nod along. Should I try to engage in a dialogue, or just put my head down and keep working?",
    "title": "How to deal with a Pro-Trump client?",
    "subreddit": "consulting",
    "timestamp": 1496895054,
    "score": 11,
    "keyword": "american director"
  },
  {
    "text": "Kino Lorber’s “Pioneers of African-American Cinema” box set is now available to stream on Netflix: 20 films made by groundbreaking African American directors for black audiences from 1915 to 1946",
    "title": "Kino Lorber’s “Pioneers of African-American Cinema” box set is now available to stream on Netflix: 20 films made by groundbreaking African American directors for black audiences from 1915 to 1946",
    "subreddit": "blackladies",
    "timestamp": 1486486770,
    "score": 23,
    "keyword": "american director"
  },
  {
    "text": "We're Justin Chon and David So. Ask us anything! **Justin**:  Hey im Justin Chon. I was he asian kid in twilight, jeff chang in 21 and over, and sonny from revenge of the green dragons among other films. Im going to be on an abc show called DECEPTION.\n\nIm a graduate of USC business school but somehow ended becoming an actor/writer/director.\n\nMy new film GOOK is set during the 1st day of the 1992 LA RIOTS and is about the friendship between a 10 year old black girl and 2 korean american brothers.\n\nYou may also recognize my co star David So. He is a youtuber but now i consider him an actor.\n\nOur movie, GOOK, opens in most major cities at REGAL CINEMAS. AUGUST 25TH!!!!!\nASK US ANYTHINGGGGG!!!!\n\n**Proof**: https://twitter.com/justinchon/status/884487502299398144\n\nhttps://twitter.com/davidsocomedy/status/884488440997335040\n\nhttp://i.imgur.com/OwHeuIT.jpg\n\n~~**UPDATE**: Thanks everyone! We're going to take a break, but we should be back on around 8 pm (pacific time) or so. Feel free to keep asking us questions!~~\n\n**UPDATE #2** Hey im terribly sorry. I got caught up with some family stuff that needed attention so wasnt able to hop back on. I'll try continuing answering questions tomorrow. If not, ill probably do another one of these in August, closer to the release date  -JC",
    "title": "We're Justin Chon and David So. Ask us anything!",
    "subreddit": "asianamerican",
    "timestamp": 1499711831,
    "score": 217,
    "keyword": "american director"
  },
  {
    "text": "Telling our own stories, and our short film 'Ella\" Hi there,\n\nMy name is Dan Chen, and I'm a director and cinematographer. You may have seen a post about our film \"Ella\" a few weeks ago, when we had just launched our Kickstarter. I'm happy to announce that we've reached our funding goal, and we're going full steam ahead!\n\nIn recent years, I recall a conversation I had with several other friends who work in film. We came to the conclusion that any American movie with an Asian protagonist would most likely be categorized as an \"Asian\" movie, or a special interest film.\n\n\"What if I wanted to make something like Dazed and Confused, but the main characters just so happen to be Asian American?\"\n\n\"It's still going to be an Asian movie.\"\n\nThe question stayed with me. Maybe I hadn't fully embraced my own race and identity yet. But I didn't want to make a special interest movie. I just wanted to make a movie.\n\nIt took a lot of inspiration to get to making \"Ella.\" Part of it was seeing artistic, successful minority representation in media, with projects like Master of None and Moonlight paving the way. Another factor was my friend Doug Kim, a producer on our short, writing and starring in a pilot we worked on together, which dealt with his real struggles as an Asian American actor in a courageous and comedic way. Finally, I realized that any character driven story needs to take race into consideration, just as it should explore sex, class, age, and other very real factors that affect who we are and who we become.\n\nIn my view, we can't wait for Hollywood to cast Asian Americans in an interesting, complex way, although putting pressure on them can certainly make them reconsider their actions. We need more Asian creators, just as we need more black creators, more Hispanic creators, and most obviously, more women of all kinds in Hollywood. Because these creators will understand the importance and significance of representation.\n\nPlus they'd have experiences and perspectives that we haven't seen yet. That's not just good social justice... that's good entertainment.\n\nSo this short film is my humble contribution (and if all goes well, the first of many contributions). I'd love support, critique, or sharing if you dig the project. We're currently going for our first stretch goal which would afford us the opportunity to hire a great casting director to help us find our second lead, who'd play a fourteen year old Chinese boy who's seeking acceptance in his small Midwestern town.\n\n[Ella, a new coming of age story in the Midwest](https://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid)\n\nI'm glad to be a subscriber to the community, and look forward to sharing more dialogues and upvotes with ya'll.\n\ncheers,\nDan",
    "title": "Telling our own stories, and our short film 'Ella\"",
    "subreddit": "asianamerican",
    "timestamp": 1490220529,
    "score": 25,
    "keyword": "american director"
  },
  {
    "text": "ELLA - independent short film about Asian Americans in the midwest! Hey, my name is Douglas Kim, I'm a writer/producer living in Los Angeles.\n\nI'm producing a short film of a coming of age story that takes place in small town America.  The film follows the unlikely bond between Abe, a high school recluse and Ella, a charismatic college dropout, as they navigate the streets and social groups of their community.\n\nThe film features a notable Asian TV actor (Nichole Bloom of NBC's \"Superstore\"), offers a new setting for an Asian American story, and follows Asian characters who are integrated in their community, going through universal struggles while dealing with their outsider status in subtle but real ways.\n\nThe film will use an experimental, one-of-a-kind, camera rig that allows for a digital IMAX image.\n\nWith the success of Moonlight and other independent films, it's my belief that film is the way Asian Americans become normalized in America, where we can be seen as Americans pursuing our own version of the American dream.  I think we can accomplish that and more with our film.\n\n\nhttps://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid\n\nWould love it if you can support and share our vision!\n\n\nmore from the director, Dan Chen:\n\nNichole Bloom and Dan Chen have been friends since they attended USC. After Nichole’s successful climb into American television, and Dan’s online awards for his short films (danchen.co), the two decided to collaborate once more on a character-driven project with the intention of festival recognition, online release, and a proof-of-concept for universal Asian American stories.\n\nDan, on the film’s story: “The underlying theme is one of “selling out,” as Abe distances himself from Ella to fit in with new kids he’s met. As an outsider, can he only fit in by submitting to the dominant views of his peers? Or is there a way he can stay loyal to his loved ones, without being left out of the larger community? The film’s story is character-driven and specific, but acts as a metaphor for the Asian American experience. Do we stay in our place, assimilate, or somehow find a third way of being?”\n\nThe camera rig was built by cinematographer Philips Shum, who has shot music videos featuring Diddy, Schoolboy Q, and Drake. It uses the principal of 35mm lens adapters, while increasing the size to accommodate a 56mm x 56mm frame, to create a low-budget solution for an IMAX field of view.\n\nElla is to be produced by Eric Cook and Douglas Kim with Evidence Films, Varient Entertainment, and Justice Tech Industries attached.",
    "title": "ELLA - independent short film about Asian Americans in the midwest!",
    "subreddit": "asianamerican",
    "timestamp": 1488496011,
    "score": 23,
    "keyword": "american director"
  },
  {
    "text": "From The Archives (2003) - \"The Greater Outrage for Female Victims of Governments' Brutality Perpetuates Risk to Both Sexes\" **The Greater Outrage for Female Victims of Governments' Brutality Perpetuates Risk to Both Sexes**\n\n©2003 Jerry A. Boggs\n\nNothing, it seems, provokes the international community’s outrage more than the atrocities and lesser abuses that governments direct at women and girls.\n\nAmnesty International sounds [this alarm](https://web.archive.org/web/20061112150604/http://web.amnesty.org/library/Index/ENGACT770021996?open&of=ENG-373): “...[G]overnments have continued to inflict sexual, physical, and other psychological violence against women with impunity ... In recent years, the horrific stories of rape in Bosnia-Herzegovina and the mass rape by the military and the militia in Rwanda have shown how particularly vulnerable women are in conflicts – how they are often singled out for human rights violations which are not inflicted on men and how assault on a woman’s body is used as a weapon of war.”\n\nIn a speech to the First Ladies' Conference on Domestic Violence in San Salvador in 1998, feminist politician [Hillary Clinton said](https://web.archive.org/web/20061028234519/http://clinton3.nara.gov:80/WH/EOP/First_Lady/html/generalspeeches/1998/19981117.html), “Women have always been the primary victims of war. Women lose their husbands, their fathers, their sons in combat. Women often have to flee from the only homes they have ever known. Women are often the refugees from conflict and sometimes, more frequently in today's warfare, victims. Women are often left with the responsibility, alone, of raising the children.”\n\nUnited Nations Secretary-General Kofi Annan, at the March 1999 Inter-Agency Videoconference for a World Free of Violence against Women, [lamented](https://web.archive.org/web/20080325035702/http://www.scienceblog.com:80/community/older/archives/L/1999/A/un990269.html), “Violence against women is perhaps the most shameful human rights violation. And, it is perhaps the most pervasive.\"\n\nAnd so it goes, up and down the international community, from human rights groups and heads of state, to organized feminists and the mainstream media – all regularly and rightly deploring governments’ savaging of females.\n\nYet when it comes to the inhumane treatment of noncombatant men and boys, nearly everyone seems to have incurred a severe case of laryngitis. By expressing little or no outrage for male victims of government barbarity — or altogether denying there are male victims, as Amnesty often seems to do — the international community does worse than merely expose an antimale bias that gainsays its own long-running plea for equal treatment of the sexes. It also helps perpetuate state-directed brutality against both men and women.\n\nPerhaps before one can even be willing to hear how a greater outrage over anti-female violence could possibly perpetuate this violence, one must be disaffected of the feminist-and-media-driven notion that females are overwhelmingly the marks for governments’ enormities. One must be convinced that men, including non-combatant men, are marked at least as much and that an equal outrage for male victims is therefore justified.\n\nEnter Adam Jones. He is executive director of the Canadian-based human rights group, [Gendercide Watch](http://www.gendercide.org/), and professor of international studies at the Center for Research and Training in Economics in Mexico City. Defining “gendercide” as gender-selective mass killings, Jones has amassed considerable documentation and published scholarly works showing that non-combatant males are subjected to atrocities and mistreatments comparable to, and in many cases worse than, those dealt females.\n\nNon-combatant men, says Jones, “have been and continue to be the most frequent targets of mass killing and genocidal slaughter, as well as a host of lesser atrocities and abuses. The mass killing of males, particularly of ‘battle-age’ men, has roots deep in the history of conflict between human communities. Despite this prevalence of gendercide against males...the subject has received almost no attention across a wide range of policy areas, humanitarian initiatives, and academic disciplines. We at Gendercide Watch feel it is one of the great taboos of the contemporary age, and must be ignored no longer.”\n\n(Jones puts “battle-age” in quotation marks “to problematize a term that rolls off the tongue too easily. The ‘battle-age’ construction implicitly assumes that if a male is of an age that renders him liable to military conscription and combat, his entire identity should be so defined. This renders the analyst complicit with those who would subordinate the destiny of ‘battle age’ males to this outside demand – akin to defining women by their capacity to be raped, and suggesting as well that ‘battle-age’ men are ‘asking for it.’ With this equation of males and combatants completed, the analyst or policymaker can move to the final stage of effacing all non-combatant males from the policy and analytical equation, a phenomenon that is also commonplace.”)\n\nJones’ Gendercide.org is rich in examples of widely ignored gendercides against males. Some from the 20th century are:\n\n* Kosovo, 1999: “Although the Milosevic regime's genocidal assault on Kosovar society swept up all other sectors of the population, killing many and expelling hundreds of thousands, the most systematic and severe atrocities were inflicted disproportionately upon non-combatant men.”\n\n* Srebrenica (Bosnia), 1995: “The long-term success of ethnic cleansing depended on killing off the Muslim men, without whom the population's women and children would have no means of returning.”\n\n* Rwanda, 1994: “[After the massacre] Rwanda became a country of women. It is currently estimated that 70 per cent of the population is female and that 50 per cent of all households are headed by women.” \n\n* Iraq, 1988, 1990-91: During the 1990-91 Gulf War, though officials and the media decried Iraqi troops’ abuse of Kuwaiti and foreign women, little was said of the broader Iraqi system of detention, torture, and execution of tens of thousands of Kuwaitis who were nearly all male. The Iraqi regime’s postwar attack on the Shia “marsh Arabs” in southern Iraq appears to have been highly gender-specific. A Middle East Watch researcher explained, “The troops are arresting all males over 15 and taking them to Radwaniyeh [prison camp]. They’re never seen again.” Thousands are estimated to have died, often after horrific torture. In 1988, during the suppression of rebellious Iraqi Kurds, Middle East Watch reported instances in which men and boys among the captured villagers were executed on the spot. Many tens of thousands of Kurdish males disappeared. The organization suspects that most of them, if not all, were murdered by Iraqi security forces.\n\n* Delhi, 1984: In “Delhi: Gangster Rule,” Madhu Kishwar reports on the 1984 anti-Sikh rioting in New Delhi following the assassination of Indira Gandhi: “The nature of the attacks confirm [sic] that there was a deliberate plan to kill as many Sikh men as possible, hence nothing was left to chance. That also explains why in almost all cases, after hitting or stabbing, the victims were doused with kerosene or petrol and burnt, so as to leave no possibility of their surviving. Between October 31 and November 4, more than 2,500 men were murdered in different parts of Delhi, according to several careful unofficial estimates. There have been very few cases of women being killed except when they got trapped in houses which were set on fire. Almost all the women interviewed described how men and young boys were special targets. When women tried to protect the men of their families, they were given a few blows and were forcibly separated from the men. Even when they clung to the men, trying to save them, they were hardly ever attacked the way men were. I have not yet heard of a case of a woman being assaulted and then burnt to death by the mob.”\n\n* Bangladesh, 1971 (then East Pakistan): In February of that year, the generals of West Pakistan decided to crush the Awami League, which had demanded regional autonomy for East Pakistan and an end to military rule. “Kill three million of them,” said President Yahya Khan at the February conference, “and the rest will eat out of our hands.” At the end of this brutal campaign, 80 percent of the estimated 3 million lives taken in the systematic mass killings were males, many of them adolescent boys.\n\n* World War II, 1941-42: During Operation Barbarossa in just eight months of 1941-42. Invading German armies killed approximately 2.8 million Soviet PoWs through starvation, exposure, and summary execution. “This little-known gendercide,” says Adam Jones, “vies with the genocide in Rwanda as the most concentrated mass killing in human history.” Adam Jones classifies this as a gendercide because “PoW did not just mean men who had seen military service. Nazi policy was explicitly that all men between 15 and 65 were to be taken to PoW camps.”\n\n* Armenia, 1915: According to Jones as interviewed in March 2000 by the Ottawa Citizen’s Christina Spencer, “The first step of that brutal terror was the disarming of conscript Armenian soldiers in the Turkish army. They were turned into pack animals, ‘driven by the whips and bayonets of the Turks into the mountains.’ The weak were left to die or were shot. Next, civilian males were taken from their towns and slaughtered. At this point, the rest of the population -- women, children, the elderly -- were deported.”\n\n\n||\n|:------:|\n|Forty million Soviet men were killed between 1914 and 1945. Some families lost every man in the family: dad, son, brother, uncle. Yet a headline in Parade, the largest-selling weekly magazine in the world, reads “Short End of the Stick” with the article explaining Soviet women are getting the short end of the stick because they are stuck with factory and street-cleaner positions. In Bosnia, the civil war has wiped out men so disproportionately that only 30% of the Bosnian population are men. Do headlines tell us, “War leaves Bosnia with 30% Men”? No. Parade’s headline reads, “Women Look to Gain Power in Bosnia.” The focus on the sacrifice made by men as a gender was not only ignored, but Bosnia has specifically been used as an example of the type of war in which both sexes are killed equally. When there’s a story about a man being killed, the focus is not on the sacrifice of men, but of their role. We discover the sacrifice of men as a gender only when it is needed to help us understand the new burdens on women. — ***The Myth of Male Power***, by [Warren Farrell](https://web.archive.org/web/20071107132658/http://mensnewsdaily.com:80/archive/f/farrell/farrell_5.htm)|\n\n**Adam Jones** also tackles military conscription as a gender-selective abuse. Though sexual slavery of females is easily seen as such an abuse, conscription is not. But Jones says it is “a variant, perhaps the most destructive one, of forced labour, an institution that has led to millions of overwhelmingly male deaths throughout history.” More than 36 million military men died in the last century’s top 20 wars alone. Even today the Russian Army, according to Gendercide Watch, “remains a death-trap for conscripted men – though not at the hands of a foreign invader. As many as 10,000 soldiers die each year from hazing, assaults, murder, and suicide.” In Afghanistan in 2001, because the media blitzed us with reports – justifiably so – on how the Taliban oppressed Afghan women, hardly anyone learned how life was for Afghan soldiers. In pre-Taliban times, when Afghan women enjoyed many rights, war still took a heavy toll on the men. Of Afghanistan’s conflict with the Soviets that began in 1979, Tamim Ansary, a writer in San Francisco, said in a Salon article: “The refugees in Pakistan, those millions who lived in the squalid camps that spawned the Taliban, were mostly the women and children of the men who stayed in the country to fight the Soviets and die like ants.” Ansary omitted the fact that the vast majority of these males, many in their teens, fought because they were forced to do so, and that the requirement to risk dying “like ants” was not thrust upon females. The later advent of the Taliban and its oppression of Afghan women did not mean that males no longer had to worry about war, about being killed or horribly maimed in battle. For some Afghan men, their fate came earlier than expected from their own government, as when Taliban forces, preparing for their war with America, began conducting house-to-house searches for recruits. “Some recruits who refused to join up,” said the Washington Post citing a defector, “were shot....”\n\n||\n|:------:|\n|\"...[I]f they [warring tribes] couldn't recruit able-bodied young boys, they simply kidnapped them. Most of the recruits were 12, 13, 14 years old, but some were young as 6.\" —*Wray Herbert, U.S. News & World Report, December 29, 2004*|\n\nTo better appreciate the gender dimension in military conscription, consider that some countries engaging in guerrilla warfare conscript boys young as six! In Sierra Leone in 1999, says Carol Bellamy, executive director of the UN Children’s Fund, seven-year-olds were among the 2,000 child soldiers who were under arms. Boys are often abducted from their homes, beaten, and told, “You either fight or we will kill you.” The humanitarian group Save The Children estimates that more than 1.5 million child soldiers – virtually all boys, by my estimate – have been killed in conflicts from Bosnia-Herzegovina to Kashmir from 1985 to 1995. Consider next that although often desperate for soldiers, the countries that recruit young boys rarely recruit, say, 15-to-17-year-old girls, who are much bigger and stronger than 7-year-old boys, emotionally as well as physically, and hence more combat-capable and militarily useful. ([The Coalition to Stop the Use of Child Soldiers](https://web.archive.org/web/20061103001657/http://www.child-soldiers.org:80/) says, “In many countries, girls too are used as soldiers, though generally in much smaller numbers than boys.”) The reasons for the conscription of boys undoubtedly include chivalry and the convenience of same-sex armies. But perhaps above all, the nations using boy soldiers may suspect that if in the name of gender equality they equally conscripted girls, the number of people around the world decrying the use of child soldiers — and the efforts to rescue the children — would surge a hundred fold and possibly deprive them of a valuable resource.\n\nStill another broadly ignored government brutality that targets males, as Jones indicates, is the forced labor of civilians. “Throughout history and continuing in modern times,” he wrote in an April 2001 letter to the International Labour Organization (ILO), “the practice of forced labour has overwhelmingly targeted adult able-bodied men, leading to millions if not tens of millions of deaths. Despite this grim record, the ILO’s Forced Labour Convention designates one group and one group only as legitimate targets for forced labour [stress added]: these same adult able-bodied men. Article 11 of the Convention states that ‘Only adult able-bodied males who are of an apparent age of not less than 18 and not more than 45 years may be called upon for forced or compulsory labour,’ so long as ‘ they are physically fit for the work required and the conditions under which it is to be carried out’ and ‘the number of adult able-bodied men indispensable for family and social life’ is allowed to remain in communities targeted for forced labour. In addition, the ILO states that both the forced labour involved in military conscription and the use of prison labour are acceptable under the terms of the Convention. Both of these institutions, of course, target males close to 100 percent of the time.” As just one example of forced male labor, the International Committee of the Red Cross charged that during the Bosnian war, hundreds of people in Serb-held areas were “being forced into what amounts to slave labor in dozens of towns and villages....” The forced laborers were, “for the most part, Croatian and Muslim civilian men.”\n\n||\n|:------:|\n|Imagine the international community’s outrage if the ILO Forced Labour Convention designated only able-bodied females as legitimate targets for forced labor.|\n\nOn rare occasion forced laborers are women. Even then they are luckier than the men. Addressing the enslaving of black Christians in Sudan by Arab militias, newspaper columnist Walter Williams wrote, “They shoot the men and enslave the women and children.” His topic, like that of many who opine on Sudan’s troubles, was slavery. It was not the greater atrocity of men being killed. This atrocity he brought up only once, in passing. He then quickly returned our attention to the women and children. It isn’t difficult to guess what would have been his topic — or how much more vociferous would be the media and feminists — were the Arab militias enslaving the men and children and shooting the women.\n\nAn anti-female atrocity, one that is widely deplored by the media and thus made well known to the world, is “honor” killings or disfigurings of women who disgrace their families. This violence, while not state-directed, is still ignored by police often enough to be deemed virtually government-sanctioned. Covering the topic for ABC television’s “20/20” in January 1999, correspondent Diane Sawyer intoned somberly, “In Jordan alone, a quarter of all the homicides are honor killings, an average of 25 women at least every year.”\n\nThe male counterpart to honor killings is the “blood feud.” It is rarely mentioned in the media and is therefore almost unheard of. It is even more ignored by governments than honor killings of women.\n\nThe institution of the blood feud, dating to the 15th century and extant in the Balkans, Sicily, and Corsica, was established for the purpose of “cleansing honor.” Offenses to honor include calling a man a liar and insulting a man’s wife. Offenses are paid for, and honor cleansed, says Noel Malcolm, author of Kosovo: A Short History, “by killing any male member of the family of the original offender, and the spilt blood of that victim then cries out to its own family for purification.”\n\nThe blood feud has always exempted females, since killing a woman is considered an extreme violation of a man's personal honor. “The strongest taboo of all concerned the murder of women,” says Malcolm, “and any woman could walk through raging gunfire in the knowledge that she would never be shot at.” Conceivably, assuming Malcolm’s definitions of the blood feud and the “strongest taboo” are correct, a woman could kill a man in another family, then, to avenge his death, that family would kill not her but a male in her family! How quickly would the international community stop ignoring blood feuds if they permitted a man to kill a woman in another family, then, to avenge her death, permitted that family to kill not him but a woman in his family?\n\nSince the collapse of the Soviet Empire, blood feuds have returned full-throttle in Albania, where reconciliation attempts have seen limited success. “Every year,” says Adam Jones, “at least a thousand men and boys die in blood-feud killings in Albania alone; the lives of tens of thousands more are spent in isolation and perpetual fear.” Yet, in covering honor killings, ABC’s “20/20” kept its millions of viewers in the dark about blood feuds and about the vastly larger number of murdered males. It left them to feel outraged only at the “average of at least 25 honor killings of women each year in Jordan alone.” Apparently to “20/20's” staff, the murder of 25 women is more outrageous – and more news-worthy – than a thousand murdered men and boys.\n\nFurther exemplifying their greater mistreatment of males, governments often punish males more severely than females for the same violations of law. This was true of Afghanistan’s Taliban government, though the mainstream media painted the opposite picture with their exclusive focus on that government’s oppression of women. The Taliban’s penal code required that males be punished for violations by females. In December 2001, a Detroit-area television station ran a story about an Afghan woman who defied the Taliban by operating a school. When Taliban troops discovered her, they beat her father.\n\n||\n|:------:|\n|When an Afghan man or any other man must endure brutality as well as shame for the religiously “inappropriate” or “illegal” behavior of his family members, we can better understand why he so strongly “wants to control\" his children and his wife: from his view, it makes more sense for them to be oppressed than for him to be both oppressed and brutalized, especially if for a while after being beaten he is unable to work and support them.|\n\nThe Taliban’s penal code also mandated that males be arrested for many other “violations.” “While a woman can be beaten if her face accidentally shows from under her head-to-toe covering,” writes gender expert Cathy Young, author of Ceasefire! Why Women and Men Must Join Forces to Achieve True Equality, “a man can be beaten if his beard isn't long enough. While a woman who commits adultery faces execution, the same fate awaits her male lover.” Men were punished even if they didn’t break a certain “rule.” Taliban forces systematically detained and executed male civilians in north-central Afghanistan to deter communities from cooperating with opposition forces. According to one report, Taliban troops were repeatedly described as rounding up unarmed men and boys from their homes and work sites and shooting them in the head. There were no reports of females being shot in the head to deter communities from violating the “Don’t cooperate” rule. Such punishments of Afghan males, unlike those of Afghan females, somehow failed to get a lot of coverage in the mainstream media, especially national television, the sole source of news for a huge number of Americans.\n\nSocial researcher Warren Farrell, author of the riveting [Father and Child Reunion](https://www.amazon.com/Father-Child-Reunion-Bring-Children/dp/0615223931), tells of the 1990 Associated Press story about Bobby Sherrill, who worked in Kuwait. When Sherrill returned to the United States, he was arrested, handcuffed, and taken before a magistrate. He had failed to pay full child support for ninety days. The reason? While he was in Kuwait, Iraq invaded the country and he was kidnapped and taken hostage for three months, during which his father paid some but not all of the support. This explanation failed to impress the magistrate, and he demanded an immediate cash payment. Because Sherrill did not have it on him at the time, he was jailed. (There must be an unwritten law somewhere that requires non-custodial fathers to always carry with them a large sum of cash.)\n\nWhat if Sherrill had been a woman? It is extremely difficult for me to believe she would have been treated so unmercifully for being unable to pay child support as a result of her being kidnapped, being held hostage for three months, and having no cash on her when arrested. Few magistrates would have had the will to jail her under such circumstances and risk incurring the public’s wrath, especially feminists’ wrath. Cathy Young would appear to agree. In Ceasefire! she writes: “There is a deeply entrenched habit in our legal system and our culture of treating female offenders more leniently....” If it were male offenders who were treated more leniently, no doubt many in the media and feminist circles would describe the situation for female offenders as an atrocity. Yet because it is men who are treated less leniently, little is said of it and few people realize that even in the United States, which is often called the world’s most civilized nation, mostly men are denied the civilized part by their government.\n\nCathy Young serves up another example of more severe male punishment: “When American teenager Michael Fay was sentenced [in 1994] to be caned for spray-painting cars in Singapore, the public debate centered on whether harsh penalties were too high a price to pay for public order. The fact that caning is imposed only on men was barely noticed. What if a teenage girl were to be whipped for a petty offense in a country where this penalty was reserved for females? Wouldn’t women’s groups, politicians, and the media have treated this as an outrage against women?” Young apparently thinks yes, for she wrote earlier in a Detroit News column, “...[I]t’s a fact that violence against women shocks us far more than violence against men.”\n\nAnd it is this fact — which is the worst sexism — along with stepped-up feminist pressure to end violence against women worldwide, that has influenced the international community to protest anti-female atrocities and abuses to the point that, as Adam Jones says of Canada’s female-focused mobilizing efforts around ex-Yugoslavia, “one could forget any other category of victim exists.”\n\n**While** the international community’s outrage mostly for female victims intends well, it helps perpetuate governments’ brutality against both males and females for the following reasons:\n\nFirst, there is little evidence to support feminists’ claim in recent years that the greater outcry for female victims has resulted in rape and sexual slavery being taken seriously as war crimes. Cathy Young wrote in September 1996: “‘It's about women and children being tortured and murdered,’ said a Court TV ad for the war crimes trial dealing with the horrors in the former Yugoslavia. Earlier this month, women's rights activists at the 7th International Forum of the Association for Women in Development in Washington, D.C., said the atrocities against women in the Balkans might not have happened if rape and sexual slavery had been taken seriously as war crimes after World War II. Let's look at what has happened to Bosnian men. Time after time, Serb troops would separate the adult men from the women and children, load them onto buses and take them to concentration camps. Many men were subjected to horrible tortures, even forced to sexually mutilate each other. Thousands were massacred. That such crimes were taken seriously after World War II apparently did little to deter the perpetrators.”\n\nAs long as the international community’s outrage is mostly for female victims, some warring groups may think eradicating males will more or less be tolerated if care is taken to safeguard females. But in reality, waging war on males while trying not to harm females is somewhat akin to dynamiting a garden in a vain attempt to kill the weeds but not the vegetables. As stated, women are often beaten or killed for trying to impede warriors’ all-important objective of slaughtering men and boys. Sometimes women simply have the misfortune of being in the path of marauding troops whose respect for life has been traumatized out of them because they have been, Jones says, “brutalized and indoctrinated into committing atrocious and genocidal acts against civilian populations or disarmed enemy forces.” They are not unlike the U.S. troops who in the Vietnam War massacred 300 My Lai villagers, including infants. Such hardened soldiers, realizing they have already committed war crimes against non-combatant males and that their own lives can be violently concluded at any moment, may only sneer at threats of prosecution for committing war crimes against females. Some of them, perhaps having learned of the international community’s demand for treating the sexes equally, may also have learned of the international community’s unequal concern for male victims of governments’ barbarity. Perhaps they are inwardly offended and angered by the hypocrisy and sexism – as a lot of female soldiers surely would be if the concern were mostly for males. “Why should I care for others,” they may think, “when no one cares for me?” Horrible as it is to contemplate, some soldiers may be embittered enough to react to warnings to tread carefully around females in the same defiant manner in which recalcitrants react to “Keep off the grass” signs.\n\n||\n|:------:|\n|“In large part, the atrocities of war are committed as a response to the fear men feel. Terror and humiliation are the combustible fuels of rage.” — Patricia Pearson, *When She Was Bad*, p. 53 hardcover|\n\nHistorically, warring nations and tribes have attacked the enemy’s civilian population as a strategy to terrorize and demoralize. The idea is that if an attack on civilians is massive and shocking enough, an enemy nation might lose its will to fight and surrender, either on its own or under pressure from its citizens. One such attack is the mass sexual assault of women. It often succeeds in terrorizing and demoralizing because, to repeat Cathy Young, violence against women shocks us far more than violence against men. Thus, the more we protest only atrocities against women, suggesting that this violence is more psychologically damaging to a nation, the more we signal that, as Amnesty International puts it, “assault on a woman’s body [can be] used as a weapon of war.” It is true that were the outrage for male victims and female victims equalized tomorrow, the strategic value of assaulting women might not change for some time; the media- and feminist-fueled construct of women as helpless, vulnerable, and deserving special protection — like children — is simply too ingrained in everyone’s psyche. But the international community’s current trend of denouncing only or mostly the atrocities against females can, in the eyes of some warring nations, only help sustain the value of those atrocities.\n\nThe lesser outrage for male victims (it’s lesser largely because for many people “man as victim,” like “woman as victimizer,” is repellent) tends to reinforce – and may in part stem from – the view of males as disposable. Many of us see males this way, explains Warren Farrell, “because we have learned that the more effectively we prepare men to sacrifice themselves, the more we feel protected.” This need for protection, along with the need of a nation to show its will to fight and defend itself from aggressors, may cause many people to think men should be considered disposable. But this view of males carries a significant downside that seems to be rarely thought out. For every aggressive nation or group that “men are disposable” unnerves, it may prompt one or two others to prematurely reject non-violent methods of resolving conflict, and to choose war, setting in motion the atrocities that claim many lives of both males and females.\n\n||\n|:------|\n| [Warren Farrell](https://web.archive.org/web/20060622214727/http://mensnewsdaily.com:80/archive/f/farrell/farrell_1.htm): There is something about women’s role that is also never mentioned. Can you figure it out? Women not sacrificing their lives in war is never discussed as female privilege, as matriarchy.|\n||\n|We saw in the Canadian study of newspapers discussed above how violence against women was portrayed disproportionately to men’s, and was personalized even as men’s was at best a cold statistic.|\n||\n|Here’s why this bias hurts women....|\n||\n|When only women’s suffering is personalized, it motivates us to rescue the woman and assume the cause must be the man. So in problems like domestic violence we blame the man and ignore the male-female dance that leads to both sexes battering each other equally.|\n||\n|This hurts women because, when the man feels he is the assumed cause, he becomes resistant to counseling. He experiences the counseling as identical to his wife – unable to hear him. To him, the counseling is now part of the problem. No, it’s worse than that. Hope disappears, and cynicism appears. And it doesn’t stop there.... He feels both his wife and the system are ganging up against him. Now it’s him against the world, and that’s the set up for mass killings followed by a suicide, which is, and will remain, the male style until men become no more or less worthy as victims than women.|\n\n**Human** rights groups, feminists, the mainstream media, and UN Secretary-General Kofi Annan must cease, as Prof. Adam Jones puts it, “hierarchizing human suffering” to the extent that, for example, “the mass rape of women is privileged over the mass slaughter of (non-combatant) men.” Politicians such as Sen. Hillary Clinton must understand that women do not become war's primary victims by surviving genocides and being driven away from their homes to squalid camps where they have the hope, however dim, of rescue and restoration. War's primary victims are, and have always been, the men who are killed — the husbands, fathers, and sons of the women whose lives generally are spared.\n\nThe international community must express an equal outrage for male victims of atrocities and other abuses. It is a matter not only of honoring true gender equality, but of curbing governments’ brutality against both sexes. As the nuclear age advances, it may also be a matter of preserving our very existence.\n\n***[posted Wednesday, 17 December 2003](https://web.archive.org/web/20061029083745/http://battlinbog.blog-city.com/governments_violence_against_the_sexes.htm)***",
    "title": "From The Archives (2003) - \"The Greater Outrage for Female Victims of Governments' Brutality Perpetuates Risk to Both Sexes\"",
    "subreddit": "MensRights",
    "timestamp": 1495710751,
    "score": 9,
    "keyword": "american director"
  }
]