[
  {
    "text": "South Carolina introduces bill suggesting teachers serve up to 20 years in prison for allowing gender non-conforming behavior in their class. (Anti-LGBT) https://www.scstatehouse.gov/sess124_2021-2022/bills/4047.htm\n\n (C)    A person who violates this section is guilty of a felony and, upon conviction, must be imprisoned not more than twenty years.\n\n    Section 44-139-30.        A nurse, counselor, teacher, principal, or other administrative official at a public or private school attended by a minor is prohibited from doing either of the following:\n\n    (1)    encouraging or coercing a minor to withhold from the minor's parent or legal guardian the fact that the minor's perception of the minor's gender or sex is inconsistent with the minor's sex; and\n\n    (2)    withholding from a minor's parent or legal guardian information related to a minor's perception that the minor's gender or sex is inconsistent with the minor's sex.\n\n\nThis is pure insanity from the anti-lgbt American right.",
    "title": "South Carolina introduces bill suggesting teachers serve up to 20 years in prison for allowing gender non-conforming behavior in their class. (Anti-LGBT)",
    "subreddit": "Teachers",
    "timestamp": 1618931684,
    "score": 659,
    "keyword": "american principal"
  },
  {
    "text": "Apparently I’m a woke, cancel culture, white supremacist who is attempting to subvert children’s education because of my beliefs.. Or so a mom and dad told me today because I said that I don’t feel comfortable having my kindergartners wear pilgrim and “Indian” headdresses for our Thanksgiving class feast. \n\nNow I consistently said Native American but they were adamant that they were Indians. We were having a normal parent/teacher conference and I had to get my principal to come in because they were so heated and the dad kept leaning over the table closer and closer to where I was sitting while raising his voice and demanding to know what else I am going to cancel this year. \n\nProbably didn’t help that it was obvious that my principal was trying hard not to laugh or roll his eyes when the mom went off on him because he told her “history is written by the winner” and that I have no responsibility to teach pilgrims/Native Americans and Thanksgiving because it’s not in the curriculum. Thank god for him having my back because I was ready to lose my crap when the parents both said they think I’m going to treat their child badly because of what they said. Uh, your child is six and not an entitled, butt-hurt jerk who freaks out when she doesn’t get her way, so no worries, I’ll love her like I always have because with parents like you, she’s gonna need as many kind, compassionate people in her life as she can get. \n\nNineteen years I’ve been teaching and this is the most insanity I’ve ever had to deal with. What is wrong with people?!?",
    "title": "Apparently I’m a woke, cancel culture, white supremacist who is attempting to subvert children’s education because of my beliefs..",
    "subreddit": "Teachers",
    "timestamp": 1636420509,
    "score": 388,
    "keyword": "american principal"
  },
  {
    "text": "Are there other careers that make you feel like a failure if you don’t love or aren’t passionate about it? Or is that unique to teaching? Like many in this community, I’ve never believed that teachers have to be passionate to be effective. I’ve never been passionate about education. It’s been a means to an end for me, while also being a job that I do often get a sense of satisfaction from. I’m by no means a great teacher. I’m probably thoroughly average. I have good rapport with my students and get along with nearly everyone. I think most would say they like my class, but few would probably say it’s their favorite. \n\nI think what bothers me is having to *fake* the passion — at least around administrators. It’s exhausting. We have a new head principal starting next year, which is causing some anxiety among the staff. And I think that’s where a lot of mine is coming from as well. This feeling that I need to impress her with how much I love being a teacher. Except that I don’t love it and know I can’t/don’t want to fake it to some high level. \n\nAnyways, this got me thinking about other careers... does this external pressure to be *passionate* about one’s job exist elsewhere to the degree it does in education? Is it a uniquely American *work* thing — not unique to just teaching? This capitalist idea of living to work?\n\nSorry for rambling!",
    "title": "Are there other careers that make you feel like a failure if you don’t love or aren’t passionate about it? Or is that unique to teaching?",
    "subreddit": "Teachers",
    "timestamp": 1620481657,
    "score": 277,
    "keyword": "american principal"
  },
  {
    "text": "Finally hit my first major road block First year agricultural teacher here. So far, year has been mostly smooth with both lesson planning and dealing with students. I only had like 1 student who grinded my nerves really bad. Admin is great in terms of support and letting me have freedom.\n\nLast two weeks have been fucking hell.\n\nHomecoming week was a disaster. Fights every day, TPing every night. And not just TPing, which I'm personally fine with, but going in groups of 100 students, yelling and swearing into teachers houses and the houses of their neighbors. Going in long trains of vehicles, running lights/stop signs. \n\nAnd then on Friday, in another teacher's class my FFA president turned around to an African American student and told her to turn that N-word music off. Teacher was not in the room but it was caught in a tik-tok. \n\nSo, after consulting other ag teachers and my admin, I met with the mom and kid and said he could either step down from the officer team or be removed from FFA. My Constitution doesn't allow me to remove from the officer team, but I can revoke membership so I had to do that workaround. \n\nMom flipped me off with the principal sitting right there and has sent 2 nasty emails to me/admin. Not even at me, complaining about admin and the former ag teacher. \n\nAnd it hit me, this is probably the first time there's been an actual consequence for something like this. Last week a group of football players was taken to the police station and they all played homecoming. This kid didn't even get hit with a suspension or anything. \n\nNow I'm avoiding going out in this small town because I don't want any contact/confrontation with the family unless admin is present.\n\nNo accountability, no consequences until me. Ridiculous. And now they're gaslighting me and I'm starting to feel like I did something wrong somehow.",
    "title": "Finally hit my first major road block",
    "subreddit": "Teachers",
    "timestamp": 1633204346,
    "score": 46,
    "keyword": "american principal"
  },
  {
    "text": "Compulsory Patriotism in Florida now... yay So at our staff meeting today it was revealed that we had to select a week in September for \"Freedom Week\"  as stated in the memorandum they gave us :  The Florida Department of Education calls on all public schools to observe American Founder's Month and Celebrate Freedom Week in September. Throughout this month, we reflect on the contributions of the Founding Fathers to the individual liberty, unalienable rights and equal opportunity woven into the fabric of our Nation. \n\nDuring Celebrate Freedom Week, all social studies classes in each school district shall dedicate at least three hours to an in-depth study of the intent, meaning and importance of the Declaration of Independence. Moreover, at the beginning of each school day or in homeroom during celebrate Freedom Week, public school principals and teachers shall conduct an oral recitation by students of the following words from the Declaration of Independence: \" We hold these truths to be self evident, that all men...  deriving their just powers from the consent of the governed\", \n\nThis was sent through FLDOE  attached to a proclamation from the Executive Office of the Governor. \n\n&#x200B;\n\nSo next week we are to enforce our students  participation via a compulsory activity that celebrates individual freedoms...\n\n&#x200B;\n\nSometimes the irony in Education amuses me to no end.",
    "title": "Compulsory Patriotism in Florida now... yay",
    "subreddit": "Teachers",
    "timestamp": 1631810018,
    "score": 40,
    "keyword": "american principal"
  },
  {
    "text": "Coming Full Circle / Le Cordon Bleu & the Public School System I'm a dual certified teacher with 17 years as an elementary teacher and 14 years and counting in Culinary Arts. Despite having lived and worked in two different warzones as an expatriate teacher in the international American schools, nothing in my 31 years of experience could have prepared me for the past year. In reading the posts on this board, I have seen many complaints about lax district attendance requirements for virtual education and hybrid. I have also seen a growing number of posts about administrative pressure to inflate grades given how abysmally some students have become during the current crisis.\n\nWhile I have not had any first experience with grade inflation at my school, in an effort to \"improve\" our attendance rates, my district has unintentionally undermined our virtual instruction. Per district policy, we are required to mark students present if any one of the following conditions were met.\n\n1. The student attended your virtual class. (It doesn't matter if the student just logged in and then logged out without bothering to stay for instruction. The mere fact that he or she even bothered to log on counts towards attendance credit for that student's class.)\n2. The student didn't log into your virtual class but did log onto Canvas which is our instructional support platform where we keep all student lessons and assignments. If a student logged into Canvas on the day you had your virtual class, that student will be marked as present.\n3. If the student sends his or her teacher an email on the day you had a virtual class, that student will be marked present.\n\nThe students aren't stupid. A lot of them have milked the system and my attendance rate has dropped to the point where I only have 1-2 students out of a class of 16 who bother to attend any of my virtual classes.\n\nConcurrent with the bad attendance has been the growing failure of students to complete any of my assignments. At least 40% of my students are failing. Some haven't even logged onto Canvas in two months.\n\nI think there are a lot of parallels between what's been happening in many of our public school systems and what happened to the American division of the Le Cordon Bleu culinary schools.\n\nIn France, Le Cordon Bleu is a widely respected and venerated culinary school that was first opened in 1895. Throughout the last 126 years, a succession of great chefs have taught the next generation of culinarians whose ranks have included the likes of Julia Childs, Giada De Laurentiis, and Mario Batali\n\nIn 2000 Le Cordon Bleu entered into a partnership with Career Education Corp. (CEC), a company that bought up private vocational schools in the United States.  Instead of adopting the Le Cordon Bleu curriculum and standards, the CEC slapped the Le Cordon Bleu logo on their culinary uniforms and campus signage. When the American division first opened, these schools included the Southern California School of Culinary Arts of Pasadena, California; the Western Culinary Institute of Portland, Oregon; the International Culinary Academy of Pittsburgh, Pennsylvania; the Scottsdale Culinary institute of Scottsdale, Arizona; and the Midwest Culinary Academy of Mendota Heights, Minnesota. In time, the American maintained and operated 16 schools. Trading upon the Le Cordon Bleu name, at the height of their popularity these schools generated an annual net revenue of some $100 million dollars.\n\nAs a 2003 Le Cordon Bleu graduate, I had the dubious distinction of watching this school begin its slow decline almost from the moment it first opened its doors. After having burned out as an elementary teachers after 17 years in the profession, I cashed out my Texas Teacher Retirement account to pay for my tuition at the Texas Culinary Academy in Austin. I was 40 years old at the time. My father still insists that I was having a mid-life crisis.\n\nMy class had about forty students. While most of the students were recent high school graduates, our very oldest classmate was in his 50's, though a life of hard living had made him look a decade older. I was the 2nd oldest student in the class. There were also a handful of students in their 30's. The ranks of the older students included a registered nurse, a veteran who had mustered out after 20 years in the service, a pastor, a computer engineer, and a restaurant line cook.\n\nOur school uniforms consisted of white culinary jackets with the Le Cordon Bleu logo emblazoned over the left chest. We also wore herring bone black and white cook trousers, black socks, and close toed non-skid shoes, along with a white skull cap. In addition to our textbook, we were each issued a black tool kit that included a complete knife set.\n\nAlthough the CEC had published and distributed a set of student handbooks that outlined the school rules and expectations, these standards were rarely applied. In theory, students who were late to class should have been barred from attendance and made to attend a Saturday makeup session. In reality, none of the chef instructors seemed to care if students were as much as 30 minutes late.\n\nStudents were expected to come to class wearing clean uniforms. In reality, some students came to class wearing jackets that were stained with ingredients that had been used during the previous day. One student even showed up wearing sandals with black socks. The chef instructor let this student stay even though his clothing was a health code safety violation.\n\nA lot of the younger students didn't bother doing their reading assignments or their written homework. Many of these didn't even bother to take notes in class before we went to the kitchen for our hands-on production lessons.\n\nSince most culinary classes teach students in cooperative learning groups of 3-4, the older students banded together into two groups out of vested self interest. We did this because we had work ethics and standards. We read the assignments. We completed the written homework. We also took notes.\n\nDuring our lab time in the kitchen, many of the younger students would disappear for extended smoke breaks of 30 minutes or longer. They wouldn't help with production. They wouldn't help with cleaning the kitchen. Since we were working in cooperative groups, each group shared a common grade. Those of us who were responsible didn't think that these other students deserved to share our grade since they made no contributions to our group effort.\n\nAt the end of our course of study, as part of our graduation requirement we were expected to complete a three month externship under the supervision of a chef or a kitchen manager. Students who had been allowed to develop slovenly habits and to show up late for class had a rude awakening when they tried to act the same way in the commercial food service.\n\nEven though the Le Cordon Bleu schools were still relatively new, by the time I got to my externship, it was hard finding anyone who would take me. The Texas Culinary Academy had already developed a dismal reputation among most of the area restaurants. Students were late to work. Students were improperly attired. Students thought they could get away with 30 minute smoke breaks. Those students who hadn't paid attention in class and who had not assisted in the kitchen were quite out of their depth and lacked the basic skills that a culinary extern should have had.\n\nI was lucky. I eventually found a placement with a boutique hotel that had an attached French restaurant. I completed my externship without problems and graduated with honors. As with nearly anything else in life, what I got out of the program reflected what I had put into it. I went on to work in the food service for five years before returning to education as the chef instructor of a high school Culinary Arts program.\n\nI was successful. A lot of my former classmates were not. Since Le Cordon Bleu did not hold their students to high standards, their reputation suffered. In time, student externs could not find placements. Le Cordon Bleu graduates could not find jobs.  In 2015, CEC tried to sell their schools but the Le Cordon Bleu label was so badly tarnished in the United States that they wound up announcing their pending closure. No new enrollments were accepted after January of 2016. The last classes graduated in September of 2017.\n\nLe Cordon Bleu is an example of what can happen when you don't enforce high expectations regarding attendance, student participation, and grades.\n\nI started teaching in 1982 before President George Bush's No Child Left Behind Act ushered in accountability testing. For those of you who are old enough to recall what teaching was like BEFORE accountability testing you may remember that some schools and some districts had similar lax standards.\n\nBefore accountability testing, elementary students were often \"socially promoted.\" It didn't matter that these students were failing and had cruddy attendance. During my first elementary teaching job in a Title I district on the south Texas border, my principal told me that kids who were retained would suffer worse from the emotional trauma of being left behind than if they were promoted with \"a few\" academic deficiencies.\n\nAlthough I was a novice teacher at the time, I remember thinking that my 5th grade students were 2-3 grade levels deficient in both reading and math. If the principal thought that these were \"a few\" academic deficiencies, I couldn't help wondering what a glaring deficiency might have looked like.\n\nThe problem with having lax standards was that some schools were graduating students who were functional illiterates. Back in 1977, the U.S. Office of Education estimated that an estimated 23 MILLION American adults were functional illiterates who lacked the ability to read restaurant menus and train schedules.\n\nIn 1976, a student named [Peter W. sued the San Francisco Unified School District](https://core.ac.uk/download/pdf/217048241.pdf) because they had graduated him even though he was only on a 5th grade reading level and had failed several grades. The plaintiff alleged that in failing to properly educate him, he had been relegated to a life of manual labor since this was all that he was qualified to do. The trial court dismissed the complaint. This was subsequently upheld upon appeal because Peter W's failure of educational achievement was not accepted by the court as an \"injury: within the meaning of tort law.\n\nAnother lawsuit followed. In 1976 [Edward Donohue](https://www.nytimes.com/1977/02/20/archives/a-graduate-who-says-he-cant-read-saying-he-is-functionally.html) was graduated even though he couldn't read at all. In 1977, he sued his former school for \"educational malpractice.\"\n\nHis lawsuit alleged that even though he had failed all of his classes during his junior year (except for woodshop), he was socially promoted and became a senior. He was even placed in a senior English class despite having failed English as a junior.\n\nDoes any of this sound familiar to our current education climate?\n\nThe teachers at Mr. Donohue's former high school said that there was an unofficial rule that said that they could not fail more than 15% of their students. Instead of actually educating their students, there was pressure from the building administration to graduate students as a way of getting rid of them.\n\nI  wish I could say that Edward Donohue had a fortuitous outcome to his lawsuit. I am sorry to say that he did not. In 1977 in [Donohue v Copiague Unified School District](https://www.leagle.com/decision/197948747ny2d4401440), the court found in favor of the district. The summary statement alluded to, \"the practical impossibility of proving that the alleged malpractice of the teacher proximately caused the learning deficiency of the plaintiff student. Factors such as the student's attitude, motivation, temperament, past experience and home environment may all play an essential and immeasurable role in learning. Indeed as the majority observes proximate cause might 'be difficult, if not impossible, to prove'.\"\n\nIt wasn't until 1981 ([Hoffman v. Board of Education](https://scholarlycommons.law.hofstra.edu/cgi/viewcontent.cgi?article=1427&context=hlr)) that a plaintiff was (partially) successful in pursuing an educational malpractice lawsuit. Daniel Hoffman was a student in the New York City Schools. At the age of five the school district placed him in a class for the mentally retarded. He remained in this class for the next 12 years despite the fact that a school psychologist had insisted that he wasn't retarded but instead suffered from a low self image. Although the court awarded the plaintiff $500,000 in damages, this judgement was reversed upon appeal and the case was dismissed.\n\nThe reality for all of us is that this isn't 1976, 1977, or 1981. It's 2021 and the times have changed.\n\nIn 2016,  a high school graduate Jamarria Hall joined a class action lawsuit with six former students in suing the Detroit public schools because the district was graduating students who were illiterate. As a junior and later a senior Mr. Hall alleged that his English teachers taught him using 3rd and 4th grade level books.  His attorney alleged that his former school was literally falling apart and lacked certified teachers and up-to-date textbooks. It argued that conditions were so appalling that in one instance an 8th grade student took the initiative to teach math to his classmates for a month after his teacher quit and the school was unable to find a replacement.\n\nIn May of 2020, after four long years of legal battles, the Detroit Public Schools settled and agreed to pay the seven former students a total of $7 million to settle this education malpractice claim. In settling they have also created a legal precedent for future education malpractice claims.\n\nThe implications of this recent case should be clear. School districts may successfully be sued for educational malpractice. While school administrators seek short term relief by having teachers inflate grades so as to appease the school board and angry parents, if these practices were to continue, it could have serious legal implications in the years to come.\n\nNot to detract from the validity of anything that I have said, but this is also why teachers should belong to a union. Most unions offer legal representation and liability coverage as part of their benefits.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\nEdited: I graduated from Le Cordon Bleu, Texas Culinary Academy in 2003, not 2001. That was a typo which has since been corrected. Since it was quite late at night (or early in the morning depending upon your perspective), I also corrected some grammatical mistakes.",
    "title": "Coming Full Circle / Le Cordon Bleu & the Public School System",
    "subreddit": "Teachers",
    "timestamp": 1617261744,
    "score": 28,
    "keyword": "american principal"
  },
  {
    "text": "Student is REALLY into nazis I have a new student who keeps to himself apart from a couple other quiet kids. Over the past couple weeks he has been sticking around after class to show me pieces of his nazi memorabilia collection (a coin, jacket with patches, a lighter) and he recently asked me if our library has a copy of Mein Kampf.\n\nI talked to our counselor and principal as I view these as potential warning signs, but they both told me there’s nothing we can do as it’s nothing illegal.\n\nShould I be concerned? Is there any move here? Just make him watch American History X???",
    "title": "Student is REALLY into nazis",
    "subreddit": "Teachers",
    "timestamp": 1633319833,
    "score": 18,
    "keyword": "american principal"
  },
  {
    "text": "New student teacher noticing potential racism with cooperating teacher and needs advice Hi everyone,\n\nSo my fiancée just finished her first week of student teaching for her master’s program, and is assigned to kindergarten. She loves her students and has a good relationship with her cooperating teacher, who has been teaching for 5 years and went through the same program.\n\nHowever, my fiancée has noticed that her cooperating teacher appears to treat the one African-American boy in the class more harshly than the others, who are mostly white and Latina. The little boy had a rough first day—as can be expected for a kindergartner on their first day—and from then on, she has described him as “defiant”; which she hasn’t described any other student as. My fiancée has a good relationship with all of the students and says that he’s really sweet, really smart, and has been no more defiant than any other student.\n\nToday, he apparently swept some plastic fruit toys off of a kitchen counter toy—the cooperating teacher claimed as he was looking her in the eyes—and she grabbed him by the upper arm and forcefully sat him in the timeout chair. My fiancée thinks she seems to be overly scrutinizing him—not in an obvious way but in what seems like an insidious, possibly subconscious way.\n\nMy fiancée questions whether her newness to teaching and proclivity for leniency might be clouding her thoughts but it’s gnawing at her—especially given the effects of the pandemic on kids and this having been the kindergartners’ first week of school ever.\n\nShe doesn’t feel like she can tell the program professors or directors because they’re still close to the cooperating teacher, and doesn’t want to overstep with the elementary school principal and staff. She also doesn’t know whether it’s appropriate to bring it up with the parents or with the cooperating teacher—especially as the cooperating teacher is the main person determining her grades.\n\nHas anyone dealt with anything similar, or does anyone have any advice? \n\nThank you so much!",
    "title": "New student teacher noticing potential racism with cooperating teacher and needs advice",
    "subreddit": "Teachers",
    "timestamp": 1630106255,
    "score": 8,
    "keyword": "american principal"
  },
  {
    "text": "3 Questions that have been bothering me as a Student Teacher I’ve been loving student teaching. I’m at a super small school in my home state of Iowa, and we currently have no one out because of COVID (but we do have kids getting the craps, unfortunately.) By this summer I should be graduated, and hopefully by fall I’ll be teaching. But I have a million different questions going through my mind and I was wondering if some of you might give me insight to three big ones?\n\nThe last few weeks, politicians have been pushing for legislation in Iowa that I feel shows that Iowa is not headed in the right direction. Countless anti-trans bills, vouchers were just approved so public schools will lose funding to private schools, and now republicans have introduced legislation that would take away funding from a school if they taught about 1619 (looking at how slavery has affected modern American life.) As a gay man, I can guarantee you Iowa doesn’t have much to offer me either. With all this in mind, I’ve been thinking of different scenarios in which I could “escape.”\n\n1) **What does it exactly mean when a state has reciprocity with mine?** Iowa has reciprocity with Illinois for example; that means I won’t need to take any additional “Praxis” tests, right? Unlike Minnesota, I’d need to take more tests :/\n\n2) **Does it look bad if a first year teacher goes out of state?** I’m interested in living in a bigger town to see what it’s like (Chicago, New York), but at the same time, if a principal hears it’s my first year, and I’m away from home, are they less likely to hire me? My CT said no, but I also know she hates the idea of being out of Iowa, so I wanted the opinion of someone that has tried leaving their home state.\n\n3) **To teachers that live in big towns like Chicago/New York, how do you afford it?!?!** I grew up & was raised in poverty. I had to do some forms for financial aid today so I could pay my Bill for the semester, and in doing so I found out my parents only have $45 in the bank. My Dad only made $9,000 last year, too. I dream of escaping Iowa and finally being happy, living on my own and discovering my own community. But I feel trapped here, because I don’t know how I would manage it since being poor is all I’ve ever known.\n\nI’m the first one in my family to graduate from college. It feels surreal. And I know people say teachers are underpaid, but even if I was paid $20,000 a year, that’s way more than my Dad makes in an average year.. Right now I have around $10,000 saved due to working non stop this last summer combined with savings, but I know that would go **super** fast in a bigger town. How do you all do it?\n\nThere wouldn’t happen to be a guide on how to escape Iowa, would there be? A part of me wonders if I shouldn’t just teach in Iowa close to a big town for a few years and then move away. I’m not sure. Well, I appreciate you if you read this far. I appreciate any advice for any questions too!",
    "title": "3 Questions that have been bothering me as a Student Teacher",
    "subreddit": "Teachers",
    "timestamp": 1612335945,
    "score": 5,
    "keyword": "american principal"
  },
  {
    "text": "I really want to resign because I have bigger fish to fry I have been a teacher for five years. I have certifications in physical science and technical education.\n\nI started making content for youtube and tik tok recently. The point of this content was ultimately criticism of current educational paradigms. My school called me into the principal's office and the liaison for the district's attorney told me to stop making and sharing content that is disparaging of teachers, education or school districts. At the time I was enjoying a modicum of virality (100 followers per hour) on my tik tok account and that was driving traffic to youtube.\n\nThe unfortunate part is that any momentum I was enjoying is gone and I don't like being told what I can and cannot say.\n\nThe point of my life is ultimately education reform and I intend to completely overturn and re-evaluate what it means to have school. I'm currently writing a book called Why School Sucks and What We Can Do About It, so not being allowed to state or explain the problems with American public education reads to me as my school administration shooting me in the foot with my goals and what I want for my life.\n\nI am struggling with the decision to resign. \n\nI haven't submitted any paperwork or a letter of resignation but I am just so sad all the time at school. COVID and the nature of hybrid learning is making things so much worse. The lack of engagement just makes me feel like I'm not getting anything done or accomplishing anything. I think I could just do so much more on social media and through alternative revenue streams.\n\nI don't really know what I want from this post other than validation. My administration is not particularly interested in validating my feelings or checking on me or understanding my point of view. \n\nI've been seeing so many teachers here and on tik tok and other social media resigning in droves after this year. And that is troubling, because ultimately the kids will suffer, but I just feel like I can do so much more outside of the four walls of my classroom.\n\nThe four walls are just stifling and I need to spread my wings, cliche though it is.",
    "title": "I really want to resign because I have bigger fish to fry",
    "subreddit": "Teachers",
    "timestamp": 1614396555,
    "score": 4,
    "keyword": "american principal"
  },
  {
    "text": "Urgent! I need to make a decision by tomorrow… I received two job offers. I place a description of each offer  below. Which one would you pick? I think it’s worth mentioning that I have two small kids. We can manage the pay cut. However, I have the itch to buy a new car and home…lol\n\nStride-At Risk/Credit Recovery Teacher\n\nSalary 41,000_\nRemote 9-5 (M-F)_\nChildcare possible can be cut to part-time _\nAt Risk Teacher/Credit Recovery- this requires minimum prep_\nNeed to learn new learning  management system_\nSchool start in early Aug. for teachers _\nLarge classes _\nOpportunity for growth- I landed the job fairly easy. I spoke to the principal about growth. I see where people moved up within a year. They offer tuition assistance for masters. \n\n\n\nNorthshore High-Social Studies Teacher\nSalary 64,000_\n6:50-3:00 (M-F)_\nMust change child care to a place closer to the job or will talk to current daycare about dropping my kids off sooner😩_\nPreps are African American Studies and Psychology AP. Interested in the subjects but never taught  them. _\nNeed to learn new learning management system_ \nSchool start July 28 for teachers_\nLarge classes_\nOpportunity for growth- I interviewed before submitting my application. A former co worker sang praises about me to his principal. The principal forwarded my info to Northshore. I feel that if I do a great job more doors will open",
    "title": "Urgent! I need to make a decision by tomorrow…",
    "subreddit": "Teachers",
    "timestamp": 1625981119,
    "score": 3,
    "keyword": "american principal"
  },
  {
    "text": "What to do with life? This is a bit of a weird question but it feels right to ask it here first. \n\nFor context I am still young, just graduated university, and landed a very good starting offer at a highly sought-after tech company. I have a new sense of stability - I am not constantly worried about doing Leetcode or applying to companies, I don't have to constantly read the news hunting for a new prestigious startup I could be working for, I'm not obsessively scrolling through Linkedin for a potential opportunity and the list goes on. Overall - I no longer am doing a lot of the tiring and time-consuming things I was trying to get that \"goal\" offer. \n\nThe problem? I feel empty almost. \n\nIt's been weird trying to affirm to myself that this newfound free time I spend on myself isn't being wasted but I'm slowly acclimating. I've hit that \"target\" I've had since middle school and I'm sorta lost now. \n\nWhat do I fill my time with? (Both technically with new things to learn to progress my career and personal life things)\n\nFirst - What is the next step of technical learning to progress my career? I want to grow as a technical developer, maybe become a principal developer in a few years ... reach a CTO level position, and either run development at a company or leave and join a startup as a CTO/Founding Developer (something like that). What do I start doing to hit that goat? I've seen people say to start with AWS Cloud Practioner, Systems Design, Distributed Systems but insight from experienced people would be great.\n\nSecond - What are new things I can do for fun? I do have hobbies currently: I like sports, love to cook, enjoy a wide variety of TV Media from American to Japanese and Korean. What new things can I explore?\n\nI also hope this post can help other students but STEM ones particularly. I've noticed a lot of us have devoted so much of our lives to landing that Facebook or Stripe offer new grad (or whatever is trending now) that we don't know what to do after we've achieved it.",
    "title": "What to do with life?",
    "subreddit": "cscareerquestions",
    "timestamp": 1632214675,
    "score": 3,
    "keyword": "american principal"
  }
]