[
  {
    "text": "You have commited a great crime and about to be judged via trial by combat. You are allowed to choose from 4 random fighters, an English, a French, a Russian and an American. You know nothing else about them and they won't be revealed until the fight. Who would you choose to decide your fate? Why?",
    "title": "You have commited a great crime and about to be judged via trial by combat. You are allowed to choose from 4 random fighters, an English, a French, a Russian and an American. You know nothing else about them and they won't be revealed until the fight. Who would you choose to decide your fate? Why?",
    "subreddit": "AskReddit",
    "timestamp": 1573242531,
    "score": 6,
    "keyword": "american judge"
  },
  {
    "text": "If there was an American version of The Great British Bake Off, who would make the best judges?",
    "title": "If there was an American version of The Great British Bake Off, who would make the best judges?",
    "subreddit": "AskReddit",
    "timestamp": 1569721590,
    "score": 3,
    "keyword": "american judge"
  },
  {
    "text": "Those who have tried out for American Idol, The Voice or any other singing show, is your first audition with the judges we see on TV? I wanna hear about your audition?",
    "title": "Those who have tried out for American Idol, The Voice or any other singing show, is your first audition with the judges we see on TV? I wanna hear about your audition?",
    "subreddit": "AskReddit",
    "timestamp": 1553484144,
    "score": 2,
    "keyword": "american judge"
  },
  {
    "text": "What are some American child-rearing habits that confuse or are judged by other countries?",
    "title": "What are some American child-rearing habits that confuse or are judged by other countries?",
    "subreddit": "AskReddit",
    "timestamp": 1574706390,
    "score": 2,
    "keyword": "american judge"
  },
  {
    "text": "British people of reddit: do u ever judge American tourists when u hear their voice?",
    "title": "British people of reddit: do u ever judge American tourists when u hear their voice?",
    "subreddit": "AskReddit",
    "timestamp": 1556834236,
    "score": 2,
    "keyword": "american judge"
  },
  {
    "text": "I lost my beloved MawMaw (Grandmother) 4 years ago today. I want to share the story of her extraordinary life of giving 0 fucks about anything besides her loved ones and her own happiness. (VERY long, sorry) My grandmother's name was Virginia but everyone called her Jenny. She was born in 1930 and lived through the Great Depression with her 3 sisters and parents. At one point they all lived in a cave in the mountains (we're in Appalachia). Her father would hitch onto coal trains and ride them for miles, throwing a bit of coal off the train here and there and then walk home, picking up the coal so his family wouldn't freeze. \n\nUnfortunately, my great grandmother turned to prostitution to support the family (with the awareness of my great grandfather). My mawmaw lived through all of this and told these stories not as the traumatic experiences they were but through the lens of how fiercely her parents loved her, that they'd go to that extent to care for her and her siblings. \n\nShe eloped with a nice fella from the Navy who shipped off to Asia for awhile. They had my oldest aunt together and she loved him very much. He died at age 21 of a random brain aneurysm in the kitchen while my mawmaw watched, holding my baby aunt. She grabbed a package of diapers and never went back to that house again. Though she had many men after that, she would always cry over her first husband. She was barely 20 when he died.\n\nShe jumped into the workforce with gusto and did a bit of everything. She owned a restaurant for decades, back when females didn't open new businesses in small rural towns. She was indeed a wonderful cook and introduced me to frog legs, escargot, and pig's brains! I openly wept in a cafe in Paris a few years ago when I saw that escargot and frog legs were on the fixed menu... like she was there with me (oh and here's the tears again). \n\nI digress. She worked hard for everything she had but boy, she loved men, lol. She was absolutely unabashed that she always wanted a man in her life and she had many. Remember this is the late 50's or so in a very small Bible belt town! When she was 30, she gave birth to my mother. My biological grandfather was 18 but had to lie and say he was 21 on the birth certificate since their age difference was illegal back then. They had a second child together a year or two later, my only uncle and her last child. She never married my biological grandfather and this was in the early 60's! \n\nShe had difficulties being a mother. She loved all of us very fiercely but at age 32 she found herself alone with an 11 year old, a toddler and a newborn. My great grandmother ended up raising my uncle in the next state over. My oldest aunt helped a lot with my mom but she was left to her own devices a lot too, since Mawmaw was working full time, usually overtime, to support them. \n\nShe remarried when my aunts were teenagers (except my eldest; she had already married by then!). This was the man who was my only living 'grandfather', who passed about 2 years before my mawmaw. He lived a hard life, was a Navy vet, but was very compassionate and kind to me all throughout my life. They had a turbulent relationship but did truly love each other. \n\nMawMaw is into her 80's now and had been living in one of my aunt's properties. They were making arrangements for her to live in an assisted living apartment facility (you have your own apartment with your own things, they just  keep staff on hand to help people out who are elderly or mentally disabled). Arrangements stopped when we found out that she had eloped again! She married a man 15 years younger than her!! We asked why the rush and she said \"You have to take happiness as it comes, especially when you're old. I want my last years to be happy\". \n\nAnd they were. I had lived abroad for years but had moved back a couple of years before her death. She had health issues all through her life so she was in and out of hospital a lot. I remember being in my mid 20's and my now ex husband was being neglectful and abusive (though I didn't exactly say the last part.. just said \"He's not being good to me.\"). I was selfish enough to ask MawMaw for advice. Even though she was in the hospital, she told me that my happiness is worth more than ANY man, and that a person can never give up hope. \"Look at me laying in this hospital bed\", she said. \"Doctors have given me up for dead for over a decade (true) and I still have hope because I know that nothing in life lasts forever, good or bad. The only way you can ruin your life is to give up hope.\"\n\nWhat an extraordinary woman she was. She was a wife, a widow, a business owner, a mother and grandmother. A woman long before her time, who chose to live for herself and loved ones, disregarding the opinions of others. \n\nShe LOVED events and even set up a small banquet hall in her house (before she moved to my aunt's property) and would constantly host dinners and events. She LOVED parties, cooking, and people. She also loved holidays, especially Christmas. She put those crazy decorators on TV to shame! \n\nShe was a Christian woman, particularly near the end, but she didn't judge my sister's best friend for being gay or me for marrying a non-white, non-American man. After she died we learned that when she was younger and more able, she'd fix meals for older people and people she knew were hard up, though she never had much money herself. \n\nBut one of my very favorite things about her was that, even though she had money and health issues throughout her life, she was HAPPY. Every single time I saw or spoke to her she had something nice to stay about the day, even if it was just looking at a pretty dress or something on her favorite channel, QVC (lol). As someone with Major Depressive Disorder, that's something I really wish I could do.\n\nShe always gave the best advice. I'd sell my soul for just an hour with her now... God I miss her. But I'm so glad that I had her. I need an ounce or two of her strength just about now. \n\nIf anyone read all of this, I thank you from the bottom of my heart. \n\nRest in peace, MawMaw Jenny. Until we meet again  <3",
    "title": "I lost my beloved MawMaw (Grandmother) 4 years ago today. I want to share the story of her extraordinary life of giving 0 fucks about anything besides her loved ones and her own happiness. (VERY long, sorry)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1553175916,
    "score": 16,
    "keyword": "american judge"
  },
  {
    "text": "Meet 'Black Girl Magic,' The 19 African-American Women Elected As Judges In Texas",
    "title": "Meet 'Black Girl Magic,' The 19 African-American Women Elected As Judges In Texas",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1556649117,
    "score": 1,
    "keyword": "american judge"
  },
  {
    "text": "(Part 2) What it's like to have an abortion. And no, I'm not a whore. But even if I were a whore, why should it matter? (original post link at the end)\n\n​\n\nFirstly:\n\nI want to thank everyone for the overwhelming amount of positive responses, personal stories, supportive messages, ect in regards to my original post. To the people that made throw away accounts so they could feel free to share their stories, I commend and support you. I see you and I hear you. Your stories are valid and need to be heard because young men and women need strong support systems.\n\nThe reason I chose my title is because in the US, abortion is a huge taboo. A common misconception that I have **witnessed** people say is, \"only whores would need an abortion\" or \"keep your legs closed\". My caveat at the end, and post is not meant to cast judgement, but to simply give the middle finger to this ludicrous stereotype. It doesn't matter why, or who, or what.\n\n**My abortion, and every woman's for that matter, is valid. This is just my story.**\n\n​\n\n...\n\n​\n\nFor those accusing me of \"**click-bait**\" because I didn't go into details on the procedure itself on my OG post, this thread is for you. My abortion was literally no big deal and summed up in two sentences. My post was meant to be rhetorical.\n\n​\n\n**THE ANSWER TO:** ***what it's like to have an abortion*** **is in the thousands of comments, private messages, death threats, and hate I received. Sharing my experience somehow turned into some sort of debate. If he can walk away, why can't I?? Strangers are very quick to judge me & other women in our personal choices that have no implication on them. When casting this hate towards me, you not only are judging me, but countless women around you. According to the 2017 American Journal of Public health analysis, nearly 1 in 4 women will have an abortion. If this taboo is so common, why do we continue to deal with this privately instead of asking for support from those around us?? I call bullshit.**\n\nSo yes, **I am your sister, your friend, your coworker, your caretaker, your daughter, your mother, etc.**\n\n**I am someone you know.**\n\n​\n\nThe process:\n\nI live in the southern US, also known as \"***the bible belt***\". Abortions aren't easily accessed in my state. I walked out of planned parenthood with the fresh pregnancy news and some pamphlets with my options. The first thing I see are a man and woman assembling their pick up signs. They were actually quite nice and told me to head over to their building called, \"her choice\" for some counseling. So I did..\n\nI cried silently the entire time. The building should have been named, \"not her choice\". The \"counselor\" told me a mountain of lies: I would never be able to live with myself after this, that women that go through abortion are mentally irreversibly damaged, etc.. They gave me a lunch baggie with guilt pamphlets, a baby figurine the size of a jelly bean, and some prenatal vitamins. They pushed me into scheduling an ultrasound appointment, which coincidentally landed on my 23rd birthday. \"You get to see your baby on your birthday!\", said the clerk. I left crying.\n\nI called my ex and let him know what was going on. He said he supported me regardless, but preferred the abortion route.\n\nA few days later I called planned parenthood's hotline. They set me up with a appointment a state away. They required me to bring someone with me that could drive.\n\nAt planned parenthood I waited over an hour past my appointment time. They did an ultrasound and gave me the option to see it. I agreed and kept the print out. It didn't look like the tiny baby figurine that ***Her Choice*** had given me.\n\nI had a short exam. They took some blood, and I was taken to a private room for counseling. I watched an educational video and afterwards the staff member explained it fully. One pill would be taken right then to stop the fertilized cell growth, and the other would be taken the next day to have a period.\n\nThey asked if I was safe, if the abortion was against my will, etc. They watched me swallow the first pill and sent me on my merry way with a baggie of pills for the next day.. Including some pain meds in case the cramping was bad.\n\nI was very car sick most of the way home. The next day I drank a lot of water, ate, and took my pills as instructed. I immediately felt drowsy. Within a few hours I started my period. I bled A LOT. A hot shower was really soothing. I fell in and out of consciousness.. I think because of the medication?..\n\nI did not see anything that looked remotely like a baby, or baby parts, etc. It was exactly like a heavy period. What made it different, was there were a ton of **LARGE** blood clots.\n\nThe bleeding lasted for maybe two weeks. I was instructed to have a follow up ultrasound to be sure everything was ok.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n​\n\nAbortion cost: $500, and an infinite amount of unsolicited opinions.\n\n​\n\nTwo years later:\n\nI did experience a hormone imbalance for awhile. I experienced some hair loss and hormone related acne. My dermatologist hooked me up with some meds and I'm back to myself. I would make the same choice again. I did not go through a depression. I have no guilt and its not something that ever crosses my mind. I am a really happy person and I think as long as you stay true to yourself, this doesn't have to be this terrible thing that many people think it is. After I went through this, and even while I was contemplating, many women I knew came out of the woodwork. People I was friends with, that I never expected, family members, told me about their abortion experience.\n\nMy closest family/friends knew that I was pregnant. I told them that I had a miscarriage. Medically or naturally makes no difference: a miscarriage is a miscarriage. They were supportive and probably would have been supportive either way. My mother would check in on me daily.\n\nIt's really important to have people that you can rely on, because while the abortion procedure wasn't that big of a deal, strangers like to make it one.\n\nPlease support and love each other.\n\noriginal post link: [https://www.reddit.com/r/TwoXChromosomes/comments/akncij/what\\_its\\_like\\_to\\_have\\_an\\_abortion\\_and\\_no\\_im\\_not\\_a/](https://www.reddit.com/r/TwoXChromosomes/comments/akncij/what_its_like_to_have_an_abortion_and_no_im_not_a/)",
    "title": "(Part 2) What it's like to have an abortion. And no, I'm not a whore.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549373083,
    "score": 0,
    "keyword": "american judge"
  },
  {
    "text": "Can we talk about the difference in salary between the US and Europe? The fact that developers in the USA earn much more than their European counterparts is a topic that comes up often on this sub.\n\n&#x200B;\n\nAs a junior developer over in Europe I was astonished when I first found out that a starting salary for a developer in SF or NYC can be $70k - $90k, whilst in Copenhagen (where I live) you'd be lucky to get $40 -  $50k! And we pay more taxes!\n\n&#x200B;\n\nThis sent down a spiral that I think many young European developers on this sub go down on how to get a job and move to the US for the big $$$. However whilst doing research, reading in this sub and talking to my friends in tech in the states I realized that just comparing the two salaries is a very inaccurate way of looking at things.\n\n&#x200B;\n\nHere's a few of the benefits that I didn't really know were available to me that probably wouldn't be available to someone in the states:\n\n&#x200B;\n\n* My first full time job in tech i was given a company standard 30 days of paid holiday a year - not including public holidays\n* If I got my girlfriend pregnant (please god no!) between her and myself we could share 400+ paid days of paternal/maternal leave. Children's daycare is also free or heavily subsidized.\n* Healthcare is basically free\n* University is free\n\n&#x200B;\n\nI'm not bashing America by saying this, or saying I personally favor one system or another, but I think a lot of the time developers look solely at the number next to their paycheck as a way of judging if an opportunity is worth it. I bet a lot of American developers are wary of coming to Europe for work because of the lower salary, and lots of Europeans just want to go states simply because of it.\n\n&#x200B;\n\nEdit:\n\n&#x200B;\n\nA lot of people seem to misunderstanding what I meant by the benefits I listed. I'm aware that there are some top tier tech companies in the US that offer all of those benefits plus more. But that's exactly my point: \"some\". In Europe those are basic aspects of every single working person's package. If I have kids I know that no matter if they want to study chemical engineering or Russian art from the 18th century they will have support.",
    "title": "Can we talk about the difference in salary between the US and Europe?",
    "subreddit": "cscareerquestions",
    "timestamp": 1559389641,
    "score": 798,
    "keyword": "american judge"
  },
  {
    "text": "Change from relatively comfortable job to a new startup **Current job**: I work for a medium-sized (\\~60 employees) remote-first startup since August 2018 (about 5 months). The job initially was more sales-related. Even though negotiations is still a big part of the role, I also spend my time doing data analysis (due my skills with Python, Excel and SQL), automating processes (also, due tech skills), finding solutions to improve the quality of the service of the company and even contributing to the company's code base. I really enjoy this variety of tasks, and to be honest, I enjoy more doing these other tasks than the sales/negotiations ones. \n\nThis is an North-American company, while I'm based in South America. So, in terms of compensation, it's quite low for USA-standards (around USD 16k/year). I'm also work as a contractor, which means, no social security or anything. My cost of living in my city is about USD12k/year (I live very frugally), so I can still save some money with my current salary.   \nOverall, I'm pretty happy with the job itself. The company culture is great, it's very horizontal, C-level guys are very accessible. Also, there is the unlimited-vacations policy and a very flexible working schedule. And the best of all: autonomy. ZERO micromanagement. I independently work on whatever I judge that can produce the best results to the company.\n\nA better salary wouldn't hurt though. Besides moving to a manager position, I don't see my salary growing in the future in my current position. It is reasonably easy to move horizontally to a developer position, get a bit of experience and have a growth in salary (and maybe job satisfaction as well, as I enjoy coding). Having experience as developer might give me chances to get another job in the future, which tends to be better paid as well.  \nNote: I'm 25 years old, and this is my first job after college (went to business school)\n\n&#x200B;\n\n**For the future:** I have reasonably solid skills as developer and data analyst. I enjoy studying machine learning and web development. However, I have no professional experience, which puts me in a catch-22 situation to find a junior tech position. Having some development experience would be very helpful for my career in the future, and I can probably land a pretty good job with a much better pay. For instance, I consider USD40k-60k/year a very interesting salary and it doesn't seems to be that hard to achieve it with a couple years of development experience under the belt.   \nI might receive an offer from a small (also remote) startup (I'm going to be the 6th employee) to work as a Junior Fullstack Developer. The salary would be almost 50% higher (\\~USD24k/year). I would be the 4th member of the development team, which seems to be an amazing learning opportunity to get experienced with modern technologies and receive mentorship from more experienced developers.\n\nThat's seems to be very nice, at least in theory. It's impossible to know how the job will actually be in terms of company culture, work-life balance and general satisfaction (which is all pretty good in my current position).   \nThis startup is a remote position as well. As bonus point, one of the Senior Devs lives in my city, which means we might collaborate in person sometimes (that's neat). \n\n&#x200B;\n\nIt would be a risky change, but the benefits might be good as well. I consider myself well-liked in my current job, and I'd leave the company in good terms. However, I'm not sure if it would be possible to go back.  As I strongly prefer working remote, getting a third job in case this new one fails might not be possible very quickly. Also, a remote Junior Developer position is not easy to find as well, so it might be a good opportunity.\n\n&#x200B;\n\nI need some advice on this. Do you think this change worth it? If I stay in my current job, since I have tech skills and I'm doing several tasks that my other teammates cannot do by themselves, should I ask for a raise? What would you do in my place?  \n\n\n&#x200B;",
    "title": "Change from relatively comfortable job to a new startup",
    "subreddit": "cscareerquestions",
    "timestamp": 1547904976,
    "score": 2,
    "keyword": "american judge"
  },
  {
    "text": "Why is Cardozo so famous? It seems that whenever we read one of his opinions in class, the professor simply discusses how he misapplied a particular doctrine, was unclear in conveying his reasoning, etc. There is always something wrong with what he did. Why is it that he became, and remains, one of the most famous judges in American jurisprudence? Is it simply because he was the chief justice of the NY Court of Appeals during the early 1900s, when the court was arguably the most influential court in the country (at least with respect to tort law)? Or was the NYCOP so influential because of Cardozo?",
    "title": "Why is Cardozo so famous?",
    "subreddit": "LawSchool",
    "timestamp": 1576558441,
    "score": 22,
    "keyword": "american judge"
  },
  {
    "text": "What do you guys think about Judge Tammy Kemp? I'm not American , but I was horrified by Botham Jean's MURDER. The whole world is aware of the injustice and brutality of American police. We are aware that most often than not the police get off lightly. We know the historical terror America has inflicted on Black Americans. So when that homicidal lunatic was found guilty of MURDER , I was so relieved. However , the sentencing portion came up and I was flabbergasted. 10 years (probably eligible for parole in 5 years) is just not enough for blatant , non negotiable brazen murder of an innocent man eating ice cream in his house.\n\nNow I understand the power of forgiveness , and it's no ones place to judge the family forgiving that murderer. What I don't get is Judge Kemp's behaviour. Is that normal , for a judge to hug and give bibles out to the convicted? This woman has been found out as a racist, gun toting lunatic who was more concerned about losing her job than killing someone. Why on Earth did the judge do that , what message is she sending out to the world, racist would-be killers and most importantly to black people? Especially as a black woman judge, why did she feel it was her place to give mercy to this woman?!?\n\nEvery news outlet is framing this as a \"generous display of mercy' and the it's \"so beautiful'. Well, it's left a very bitter taste in my mouth and makes me feel there was no justice for Botham....",
    "title": "What do you guys think about Judge Tammy Kemp?",
    "subreddit": "blackladies",
    "timestamp": 1570101072,
    "score": 39,
    "keyword": "american judge"
  },
  {
    "text": "Judge blocks Trump immigration rule, calls it 'repugnant to American Dream'",
    "title": "Judge blocks Trump immigration rule, calls it 'repugnant to American Dream'",
    "subreddit": "asianamerican",
    "timestamp": 1570884109,
    "score": 147,
    "keyword": "american judge"
  },
  {
    "text": "'Welcome to the beginning of the fascist takeover': Asian-American judge was suspended without pay for making anti-Trump comments online and in court",
    "title": "'Welcome to the beginning of the fascist takeover': Asian-American judge was suspended without pay for making anti-Trump comments online and in court",
    "subreddit": "asianamerican",
    "timestamp": 1558931458,
    "score": 44,
    "keyword": "american judge"
  },
  {
    "text": "Harvard announces high admittance of Asian Americans as judge weighs affirmative action",
    "title": "Harvard announces high admittance of Asian Americans as judge weighs affirmative action",
    "subreddit": "asianamerican",
    "timestamp": 1554472085,
    "score": 32,
    "keyword": "american judge"
  },
  {
    "text": "The Many Sins of College Admissions: Jeannie Suk Gersen writes about the conclusion to the court ruling on Harvard University’s use of race in admissions, which alleged that the school discriminated against Asian-American applicants, from the federal judge Allison Burroughs.",
    "title": "The Many Sins of College Admissions: Jeannie Suk Gersen writes about the conclusion to the court ruling on Harvard University’s use of race in admissions, which alleged that the school discriminated against Asian-American applicants, from the federal judge Allison Burroughs.",
    "subreddit": "asianamerican",
    "timestamp": 1570552134,
    "score": 23,
    "keyword": "american judge"
  },
  {
    "text": "Introducing Baked! The Musical – An All Asian Musical @ Chicago Musical Theatre Festival Hello friends!\n\nFor the last several years, my good friend and co-writer Jordan Liu and I have been writing a musical that features an **all Asian cast!** I'm really happy to share that it was recently accepted to the Chicago Musical Theatre Festival, where it was selected by a panel of judges out of over 50 submissions to get a THREE WEEK RUN at the Edge Theatre in Chicago!\n\nThe themes in the story are inspired by our experiences growing up as first-gen Asian American immigrants. It's a story about family, friendship, failure, and the question of what we owe the people we love. We think it's a story a lot of you will really enjoy, especially in this slice of reddit :)\n\nWe're currently fundraising, because putting on a musical is apparently really expensive. Go figure. If you're able to throw a little money our way to support the CMTF production, we'd super duper appreciate it: [https://igg.me/at/bakedcmtf](https://l.facebook.com/l.php?u=https%3A%2F%2Figg.me%2Fat%2Fbakedcmtf%3Ffbclid%3DIwAR1cmlVDqkEoQOJ75EZ30LJ3YZbxbGW42P5wttAPgiuovqBbY3jOgr8fjxE&h=AT2tdyqeKmZyet26hnKdMnuerwK4yOrtPyvib1BWKmKapCxG6xEo39-K-WXGI0k5w7D5V_loRuI4GfTeNGWUkGB_tOQyVqFfCxq9Z1W0kFQk8P2wq6ElaJWba76UDBsNST91HSr2cPLwLn3DqsreF15A)\n\nEven if you can't, that's totally okay! We hope that those of you in the area will consider checking out the show when it premieres at the Edge Theatre in Chicago next February. Please reach out to me if you're interested in learning more about the project – we love talking about this show.\n\nThanks for carving out this little space on the Internet. It's really awesome.\n\nCheers,\n\nDeepak",
    "title": "Introducing Baked! The Musical – An All Asian Musical @ Chicago Musical Theatre Festival",
    "subreddit": "asianamerican",
    "timestamp": 1569269335,
    "score": 9,
    "keyword": "american judge"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 509,
    "keyword": "american judge"
  },
  {
    "text": "Someone asks on Quora the rights that US men have that women do not. Someone else replied with a genius answer. Question: What rights do men have in the USA that women don't?\n\nAnswer:\n\n \n\nWe have a ton more rights in the USA (I’m from Canada but I was there for long enough to see what rights men had)\n\n1. The right to get raped and be forced to pay child support: [Statutory rape victim forced to pay child support](https://www.usatoday.com/story/news/nation/2014/09/02/statutory-rape-victim-child-support/14953965/)\n2. The right to genital mutilation without our consent: See circumcision\n3. The right to be laughed at if we get raped: See prison rape jokes\n4. The right to be “made to penetrate” and not have it count as rape\n5. The right to be legally forced to go die for the country if we want to vote: See conscription.\n6. The right to be falsely accused and robbed of home and possessions: See Duluth Model.\n7. The right to have parental fraud committed against us—It is rather difficult to commit maternity fraud while paternity fraud has been around since sexual reproduction existed.\n8. The right to be forced to become a parent: See sperm-jacking. If an equivalent of deception causing pregnancy was done against a woman, we’d call it rape.\n9. The right to have almost no domestic abuse shelters for men. This is of course in the interests of promoting masculine independence and because men can totally run away from an abusive woman with the kids without getting jailed for “kidnapping”. (sarcasm)\n10. The right to be treated as jokes if we decline sex: [Girlfriend, 21, stripped naked and ‘violently attacked’ boyfriend when he refused sex](https://www.thesun.co.uk/news/8458539/girlfriend-violently-attacked-boyfriend-refused-sex/) I’m quite sure this woman would have gotten away with a slap on the wrist at most if she hadn’t been stupid enough to spit on the cop.\n11. The right to be paid less per hour because you worked longer hours in a harder job than a woman was willing to do and thus are contributing to the “wage gap”, so we must pay women more! [Women in their 20s earn more than men of same age, study finds](https://www.theguardian.com/money/2015/aug/29/women-in-20s-earn-more-men-same-age-study-finds)\n12. The right to be judged short if we’re under 6 feet and labelled intimidating if we’re taller and broader than a woman.\n13. The right to be seen as weak if we don’t work out and brutish if we do.\n14. The right to be discarded as useless if we don’t know something and be decried as mansplaining if we do.\n15. The right to repeatedly and publicly commit the crime of manbreathing.\n16. The right to be publicly hated for existing (or rather, the crime of manexisting).\n17. EDIT 2: The right to be accused of either being predators or just wanking our consciences when we do exactly what women ask us to do and they don’t like it. [Why I won't date another 'male feminist' | Kate Iselin](https://www.theguardian.com/commentisfree/2015/oct/19/why-i-wont-date-another-male-feminist)\n\nThis list is non-exhaustive.\n\nEDIT: Wow, my first answer over 1K upvotes. Just remembered something to add…\n\nThere are a few rights Canadian men have that Americans don’t though. For example, this right observed to be possessed by Canadian men, according to a University of Toronto student who is a Feminist:\n\n1. The right to #FartRape women by farting louder than a woman who farted audibly in public. This is obviously the man chastising the woman for farting audibly in public and therefore violating her. (Source: [Can a fart be misogynist?](https://thewaterpipe.wordpress.com/2013/12/22/can-a-fart-be-misogynist/))\n\n(Since I am Chinese and the Chinese have a idiom that translates to something like “Who rules Heaven and Earth cannot dictate shitting and farting.” you can tell what I think of #FartRape)\n\n&#x200B;\n\nSource: [https://www.quora.com/What-rights-do-men-have-in-the-USA-that-women-dont](https://www.quora.com/What-rights-do-men-have-in-the-USA-that-women-dont) (the first answer with over 2.7k upvotes by Run Ze Cao)\n\n&#x200B;\n\nDISCLAIMER: This answer is in no way, shape, or form mine. I saw this while browsing Quora and wanted to share this with you guys.",
    "title": "Someone asks on Quora the rights that US men have that women do not. Someone else replied with a genius answer.",
    "subreddit": "MensRights",
    "timestamp": 1552623018,
    "score": 365,
    "keyword": "american judge"
  },
  {
    "text": "The wage gap is created by women, and reflects female financial privilege over men Assuming that men and women need about the same amount of money to live their lives and be happy, the wage gap is a good metric for the amount of money that women extract from men without using their own labor in the job market.\n\nThis allowes women to work easier jobs with fewer hours, and leads to better health outcomes, longer lives, and a better overall quality of life compared to men.\n\nThis money comes from one of three sources:\n\n1. **From welfare and government benefits** that are overwhelmingly paid for by men ([source 1](https://www.reddit.com/r/MensRights/comments/2kj8qu/the_benefits_gap_a_cursory_analysis_of_us_social/), [source 2](https://www.victoria.ac.nz/sacl/centres-and-institutes/cpf/publications/pdfs/WP10_2013_Distribution-Income-and-Fiscal-Incidence_18062013.pdf)) but consumed by women ([source 1](https://www.creditdonkey.com/welfare-statistics.html), [source 2](https://www.census.gov/newsroom/press-releases/2015/cb15-97.html)).  It is no surprise that women have consistently voted to expand welfare programs to themselves ([source 1](http://www.people.fas.harvard.edu/~iversen/PDFfiles/LottKenny.pdf), [source 2](http://conference.iza.org/conference_files/ELIT2008/bertocchi_g1882.pdf), [source 3](https://www.jstor.org/stable/30026099?seq=1)), using their own disproportionate political power ([source](http://cawp.rutgers.edu/sites/default/files/resources/genderdiff.pdf)), since they are the ones who primarily benefit from it. \n\n2. **From marriage and dating**.  A tremendous amount of money is transferred from men to women in the form of free food, free entertainment, free rent, bills, and other benefits that women take from men ([source 1](https://www.express.co.uk/life-style/life/774083/sex-women-spend-money-seduction),  [source 2](https://www.fastcompany.com/1663594/women-dominate-the-global-market-place-here-are-5-keys-to-reaching-them )).  This happens through abuse, manipulation, and by taking advantage of misandrist social norms that are themselves often enforced by women and female preferences in the dating and marriage market (aka *hypergamy*).\n\n3. **From divorce, alimony, and child support**. A legal situation that was largely created and institutionalized by feminists ([source](https://recalculatingthegenderwar.tumblr.com/post/142883164331/most-powerful-american-feminist-organization-kills)) through the disproportionate political power that women have over men ([source](http://cawp.rutgers.edu/sites/default/files/resources/genderdiff.pdf)).\n\n####**Encouraging women to support themselves (and criminalizing the usage of men for financial gain) would end the wage gap**\n\nIf men were no longer forced into the bread winner role, and women were forced to carry their own financial weight in life, it would cause two things to happen:\n\n1. Women would have a greater incentive to maximize their own earnings potential\n\n2. Men would have less of an incentive to maximize theirs\n\nThis would have to be accomplished on two fronts:\n\n1. We would have to eliminate the societal expectation for men to pay for everything for women (including paying for dates and financing mortgages).\n\n2. We would have to fix our divorce and child custody laws so that a woman couldn't take money from a man through divorce or from unfair child support laws.  Give men default 50/50 custody of their kids, and force the mother to support herself and pay for her half of the child rearing costs.\n\n>*\"The easiest way to solve the ‘gender pay gap’ would be to make it a criminal offence for a man to financially subsidize ANY woman, even his wife. Then women would have an incentive to work to the best of their earning potential regardless of the wealth of their male spouse.\"*\n\n[Source](http://www.fighting4fair.com/uncategorized/the-myth-of-wage-disparity/)\n\nHow do we know this would work?  Simple: trends among lesbian and unmarried single women already show this happening.\n\n####**Lesbian and unmarried single women often earn more money because they anticipate that they can't use a man for his money**\n\nNot only has it been shown that lesbian women earn more money than heterosexual women, the academic literature on this topic claims that the primary reason for this is because lesbian women anticipate that they will have to support themselves in the job market.  Since they cannot use a man to subsidize their income, they often make similar choices in the job market that men do ([source](https://wol.iza.org/articles/sexual-orientation-and-labor-market-outcomes/long)).\n\n>Decisions [that lesbian women make] might include staying in education longer, choosing a degree more likely to lead to a higher paying job, working longer hours or choosing a male-dominated career path where average salaries are higher. These choices “differ from those they would have made had they adopted traditional gender-based household specialisation roles\".\n\nA similar phenomenon has been observed in heterosexual women who are young enough to have never been married, as well as among older never married women (who are therefore supporting themselves instead of letting a man take care of them).\n\nIn fact, women who pursue their careers the same way that men are often forced to, commonly find that there is \"positive discrimination\" in the labor market that makes it easier for them to find jobs and get promotions compared to men ([source 1](https://www.recruiter.com/i/people-management-finds-widespread-hr-bias-against-men-and-overweight-women/), [source 2](https://www.pnas.org/content/pnas/112/17/5360.full.pdf), [source 3](https://www.reuters.com/article/us-science-gender/academics-rate-women-job-applicants-higher-than-identical-men-study-idUSKBN0N421420150413?irpc=932)).  As a result, *single women often earn more money than men do* ([source 1](http://content.time.com/time/business/article/0,8599,2015274,00.html), [source 2](https://www.forbes.com/2006/05/12/women-wage-gap-cx_wf_0512earningmore.html)).\n\n>Without husbands, women have to focus on earning more. They work longer hours, they’re willing to relocate and they’re more likely to choose higher-paying fields like technology. Without children, men have more liberty to earn less–that is, they are free to pursue more fulfilling and less lucrative careers, like writing or art or teaching social studies.\n\n-- Warren Farrel (from the [second source] (https://www.forbes.com/2006/05/12/women-wage-gap-cx_wf_0512earningmore.html) above)\n\n####**But what about \"unpaid labor\"? Aren't men essentially paying for a maid or a nanny?**\n\nThis assumes two things, both of which I don't think are true.  First, it assumes that this trade-off is voluntary, and not one that is enforced primarily by women, who often prefer to be in charge around the house.  Studies indicate that women very often wrest control from men, *sometimes aggressively*, and that men are forced to take a back seat in most relationships ([source 1](https://www.scotsman.com/lifestyle-2-15039/women-decide-to-rule-the-roost-1-1503380), [source 2](https://public.psych.iastate.edu/ccutrona/psych592a/articles/Vogel%202007.pdf)).   And second, it assumes that the amount of work that women do at home is somehow equivalent in value or labor to what they receive from men, which is doubtful given that you can hire a maid or a nanny for *less than minimum wage*.\n\nAnd even if you do buy these assumptions, it is still advantageous to do an equivalent amount of work from the comfort of your own home instead of out in the real world in the labor market.\n\nMen also do not see this benefit from cases **1** and **3**.  Judges are quick to force a man to pay for his ex-wife (violating his financial and bodily autonomy), but women are never forced to come cook and clean for their ex-husband in return.\n\nInstead I think you'll find that men are perfectly capable of taking care of themselves and their kids ([contrary to misandrist social stereotypes about men that are often enforced by women](http://www.telegraph.co.uk/men/relationships/11401315/At-home-women-treat-men-as-if-they-are-barely-competent.html)), and that the amount of work required to do so is fairly minimal and tends to be exaggerated (in fact a lot of the \"work\" is likely created by, and is primarily for, the wife, and not the husband, which is another topic in and of itself).  \n\nThe amount of work that a woman has to put in to make up the difference that she took from a man, however (in terms of job earnings and male labor around the house), is much more substantial, and women are often unwilling to replicate this work themselves (often taking advantage of welfare or money from a divorce).  As such, I think this is a situation that is primarily advantageous to women.  It represents a tremendous amount of privilege that women have in society.  And it is often enforced through hateful gender stereotypes and discriminatory legal practices.",
    "title": "The wage gap is created by women, and reflects female financial privilege over men",
    "subreddit": "MensRights",
    "timestamp": 1573928714,
    "score": 316,
    "keyword": "american judge"
  },
  {
    "text": "The Mis-Education of Boys and Men. I wrote this article last year in reaction to the fact that boys and men are falling further behind in our education system. The article is a bit long - 1600 words but I felt it was my duty to express my opinion on the difficulties and obstacles boys and men face trying to get an education. \n\nThe Mis-Education of Boys and Men\nBy Red Pillis\n\nQuestion. If you want to disempower and disenfranchise a whole class of people to reduce them to serf-like status, what would be a good way to do it? Answer. Don’t educate them.\n\nDeny them a good education. Educate them just enough so they can handle the basics of reading, writing and arithmetic. Don’t educate them any further. This way they will be able to work the jobs that don’t require a good education – the manual, dreary, dirty, dangerous and disgusting jobs needed to make profits or to keep our infrastructure and society running. \n\nTry to keep them from learning too much. Don’t let them acquire critical thinking skills, advanced knowledge, good grammar and spelling, and the ability to speak articulately and convincingly. Don’t give them the ability to think for themselves, form their own opinions, make independent decisions and be skeptical of the propaganda they see, hear and read. This way you can easily manipulate, control and contain them and have them do your bidding. Keep them as an underclass – useful beasts of burden.\n\nThis technique has been successfully used many times during our history. In ancient and not-so-ancient times only a small percentage of the people, the elite ruling class, were educated and had the ability to read and write. The lower classes were kept illiterate or near-illiterate. In modern times it was done to the blacks by the ruling whites in South Africa during Apartheid and to the blacks by the whites in the American South during slavery and the Jim Crow years.\n\nNow it is being done on a much wider scale. It’s being done to half the population – the male half. \n\nStudy after study is showing that boys and men are falling behind in education. From kindergarten to college, there is a strong anti-male bias that creates a hostile environment for them in school.\n\nBoys are constantly being told they are bad, their masculinity is toxic, they need to respect girls and never hit girls even in self-defense \n\nBoys learn better by actively engaging in a project or task than by just passively listening to the teacher. But in primary school, and even secondary school, they are forced to sit still in class, even though boys as a rule need to move around and expend energy more than girls do. \n\nRecess, which used to be part of the school day, has been eliminated at many schools, which means that kids, especially boys, have no way to burn off that youthful energy. So, with all that unspent energy, they may be somewhat high-spirited or rambunctious in the classroom, which these days will be diagnosed as ADD (Addition Deficit Disorder), and they will be given drugs such as Ritalin to ‘help them focus’, turning them into virtual zombies and setting them up for disorders later in life.\n\nIn a female-oriented, zero-tolerance classroom, the slightest infraction of the rules or a bit of horseplay or any display of impertinence on the boys’ part immediately results in disciplinary action such as detention, suspension, expulsion or even arrest by school police – the school to prison pipeline. Watch how fast the authorities converge on a boy if he draws something remotely resembling a weapon. \n\nAlmost all teachers in primary school, and increasingly in secondary schools, are women, and they do tend to favor girl students. When being graded, girls are constantly being given better grades than boys, even for the same quality of the completed assignment.\n\nBy the time they reach college, things get really bad for the boys who are now young men. They are told that a ‘rape culture’ exists on campus and that they are all potential rapists. They are told that they are part of the ‘patriarchy’ that oppresses and subjugates women. They are forced to take sexual harassment classes and sensitivity courses. The straight white males have it the worst. They are automatically labeled racist, homophobic and sexist and are blamed for every bad thing that has ever happened in human history. \n\nThere are also the rape tribunals on campus. They should be called what they really are – Kangaroo Courts. A male student accused of sexual assault or harassment is automatically presumed guilty. He has no legal rights, no access to due process that an ordinary criminal would receive. He is expelled from campus with a damaged reputation that can ruin his whole life.\n\nAll this is creating a hostile environment for boys and men, and as a result, they are dropping out of school and not attending college. On some campuses, female enrollment is nearly double that of male enrollment. And the situation is getting worse. Male enrollment is dropping even further as women surge ahead in Academia.\n\nThere have been so many articles, reports and studies about the plight of males in education, that one would think everyone is aware of it by now and that measures would be taken to correct the imbalance. \n\nBut nothing is happening. In fact, the opposite is happening. It seems Academia is doubling down on the exclusion of males from higher education.\n\nWhy?\n\nI may sound like a conspiracy nut, but this is my theory. I think it is deliberate.\n\nThere are plenty of well-paid jobs that don’t require a college degree. Our First-World society needs a vast amount of manual workers, technicians and skilled tradespeople to build and maintain our complex, sophisticated infrastructure. There is always a great need for electricians, plumbers, carpenters, welders, machinists, masons, bricklayers and so on – people who use their hands and brawn (mostly men) to build and fix things. Many of these jobs pay very well, and one can make a very good living from them.\n\nBut, these kinds of jobs do not give the worker any power or influence. The jobs that do convey power and influence are ones like politicians, legislators, professors, teachers, doctors,  judges, lawyers, writers, journalists, reporters, media pundits, to name a few. \n\nPeople in these professions can profoundly affect and control society. Legislators can set policies and pass laws, judges can pass sentences, politicians can shape public policy, teachers and professors can influence and shape students’ opinions and beliefs, and reporters, writers, TV pundits and journalists can influence public opinion. \n\nWhat all these jobs have in common is that you need a college degree, at least a Bachelor’s Degree, or better yet, a Master’s Degree. If you don’t have a degree, the chances are slim to none that you will be able to enter one of these professions. So it becomes important for groups with certain ideologies to prevent certain other groups from obtaining the requisite education and degrees to enter these professions.\n\nA skilled welding specialist can easily make a six-figure income, but he can’t pass laws. A good carpenter can make a lot of money building houses, but he can’t set policy. \n\nThe Leftist, Feminist, Marxist, Multi-culturist, Social Justice Academics know this. They are fully aware that males have to be kept out of education, especially higher education. But they can’t just suddenly stop males from going to school. There are too many laws and social precedents that would prevent this, and the public outcry would be deafening.\n\nSo it has to be done slowly and stealthily over the course of years or even decades. The Leftist Academics are ratcheting up the pressure on males a little bit at a time. They are turning schools and colleges from places of learning into indoctrination centers and gradually making males feel ever more unwelcome. Their goal is to create a permanent, uneducated, docile underclass – mostly male. The educated class, mostly female, will be the leaders and masters who will set policy, make the laws and control and dominate the underclass.\n\nIf you think I am a paranoid conspiracy nut, just pay attention to some of the Feminist slogans being uttered. ‘The Future Is Female’, ‘Girls Rule’, ‘The End Of Men’, ‘Women Are Better Than Men At – (Practically Everything)’. \n\nSo what is to be done? How do we reverse this? \n\nTake action. Fight back.\n\nThe first step is to get the word out. If you know individuals or families with young boys, let them know about the plight of boys in education. Do your research and gets the facts, then tell everyone. \n\nSecond, if you are a parent or guardian of a boy in school, monitor his progress closely. Take an interest in his education. Ask him to tell you what is going on in the classroom and how his teachers treat the boys. Document this. If you discover any bias or discrimination against boys by the teachers or the school itself, say or do something. Make sure your allegations are valid, and then talk to the teachers. If you get no results from teachers, take it to the next level and complain to the school authorities.\n\nForm associations and groups for the single purpose of helping the boys to do better in school and go to college. Go after colleges and universities that practice discrimination against males. Do this by use of lawsuits, demonstrations, boycotts and any other kind of legal non-violent means.\n\nWe need to help or boys and young men realize their potential and succeed in life. If we don’t, and we let our boys flounder and fall further behind, we will be doing them a terrible disservice. It will also be very bad for our society. This is not to take away any of the advancements and achievements by females. This is simply to level the playing and be fair to both sexes – to achieve true gender equality. If both sexes are equally well-educated and equipped to succeed in the workplace, both sexes and our society will benefit.",
    "title": "The Mis-Education of Boys and Men.",
    "subreddit": "MensRights",
    "timestamp": 1553368390,
    "score": 86,
    "keyword": "american judge"
  },
  {
    "text": "An update on the petition about Judge Rachel Rancilio: 10,077 have signed. Let's get to 15,000!  [https://www.change.org/p/as-americans-let-s-remove-the-judge-responsible-for-imprisoning-a-grieving-father-for-criticism?utm\\_content=cl\\_sharecopy\\_17698674\\_en-US%3Av7&recruiter=774984031&recruited\\_by\\_id=6a441f90-919a-11e7-9f66-db9832d9e998&utm\\_source=share\\_petition&utm\\_medium=copylink&utm\\_campaign=psf\\_combo\\_share\\_initial&utm\\_term=psf\\_combo\\_share\\_initial&share\\_bandit\\_exp=initial-17698674-en-US&share\\_bandit\\_var=v2](https://www.change.org/p/as-americans-let-s-remove-the-judge-responsible-for-imprisoning-a-grieving-father-for-criticism?utm_content=cl_sharecopy_17698674_en-US%3Av7&recruiter=774984031&recruited_by_id=6a441f90-919a-11e7-9f66-db9832d9e998&utm_source=share_petition&utm_medium=copylink&utm_campaign=psf_combo_share_initial&utm_term=psf_combo_share_initial&share_bandit_exp=initial-17698674-en-US&share_bandit_var=v2) \n\n&#x200B;\n\nhttps://preview.redd.it/35x0czr5nlm31.png?width=1065&format=png&auto=webp&s=29d6df57d2f280e6ace505dc780235003fa46e68",
    "title": "An update on the petition about Judge Rachel Rancilio: 10,077 have signed. Let's get to 15,000!",
    "subreddit": "MensRights",
    "timestamp": 1568484292,
    "score": 64,
    "keyword": "american judge"
  },
  {
    "text": "The status quo of women as caretakers, and men as breadwinners (or wage slaves), was created by the women's movement during the late 19th century The modern social standard of women being responsible for child care, and men being responsible for bringing in the money, was not always the case.\n\n####**Before the late 1800s, fathers contributed substantially to child care, probably more so than the mother**\n\nFamilies at that time had to have a lot of kids because of the high infant mortality rate.  Since so many children died before reaching adulthood, you had to have a lot of kids in order to guarantee that a few would eventually make it.\n\nSo mom was usually either pregnant, or she was breastfeeding.  And that put most of the other parenting responsibilities on the father.  Once a child was old enough to walk and talk, it became his responsibility.  Fathers educated their children, taught them trades, taught them manners, and taught them how to become adults.  In fact, mothers were often seen as hindering the development of a child, since it was thought that she coddled and babied them too much.\n\n####**Fathers were also the ones who received custody of the kids in a divorce**  \n\nThe responsibilities of being a parent -- paying for your children's upbringing in society -- was closely tied to the  privileges of being a parent.  Since the father was the one who paid for the kids, the father was also the one who got to keep them in a divorce.\n\nThis was not tied to the amount of time that a parent spent with their children, but was instead tied to the ability of a parent to actually support and take care of them.\n\n####**This changed primarily because of the early women's movement**\n\nThe early women's movement, before it was even known as feminism, passed child custody laws that legally required custody to go the mother, and for the father to pay for it.  These reforms were initially championed by Caroline Norton, a British woman who lost custody of her children after she left her husband.\n\nAt first these laws only applied up to age 4, at which point custody was transferred back to the father.  But then they expanded it to age 7 (1836), and to age 16 (1873). In 1881 these laws found their way over to the United States and eventually to much of the rest of the world.  And today, even though the laws are different, the father's financial responsibilities to a child can go all the way up to age 26.\n\nThis was known as the *[tender years doctrine](https://mensrights.com/tender-years-presumption/)*.  And although it was eventually replaced with the \"best interests of the child\" standard, the remnants of these laws are still very influential today. The fact that judges, and society at large, assume that mothers should get custody is largely because of this.  Some lawyers have even argued that the tender years doctrine never really went away, but is still enforced (in practice), even if the laws might have changed.\n\n####**What this means is that it is not the fault of the patriarchy, or men, or male oppression of women, that our modern gender roles are the way they are today**\n\nIt is because of the women's movement, and their push to pass overtly sexist and discriminatory child custody laws.  They are responsible for the current legal standard, and that legal standard is responsible for the gender norms that are present in society today (and which are often turned around and blamed on men and \"male lawmakers\").  \n\nOf course the existence of modern medicine (which reduced infant mortality), an education system, and trade schools / colleges also contributed to this.  As did the changing labor market that eventually led to the 40 hour workweek.  But the existence of a status quo that puts mothers in front of fathers, and that has done so for well over 150 years, has contributed greatly to the modern gender norms that we have in society today.\n\nIn particular, the patriarchy, and male oppression, is nowhere to be found in any of it.\n\nIf anything, it is men who receive the short end of the stick, and it is feminism that is responsible for it.\n\n___\n**A few sources on modern feminism defending the status quo**\n\n######Franklin, R. (2014). Karen DeCrow, Last NOW President to Support Shared Parenting, Dies. National Parents Organization.  Available from: https://nationalparentsorganization.org/blog/21752-karen-decrow-last-now-president-to-support-shared-parenting-dies\n\n######Reid, P. (2015). Opposing Shared Parenting: The Feminist Track Record.  A Voice For Men. Available from: https://www.avoiceformen.com/mens-rights/opposing-shared-parenting-the-feminist-track-record/\n\n######RECALCULATING THE GENDER WAR. (2016).  Most powerful American feminist organization kills another shared parenting bill: N.O.W.’s crusade against actual gender equality slips into the limelight.  Available at:  https://recalculatingthegenderwar.tumblr.com/post/142883164331/most-powerful-american-feminist-organization-kills\n\n######u/ThePigmanAgain (2019, Oct). Feminists are trying to get parental alienation delisted from the WHO ICD-11. Here's how you can say \"Hell, no!\". r/MensRights. Available from: /r/MensRights/comments/dnl1b7/feminists_are_trying_to_get_parental_alienation\n\n**And some progress that has been made, usually with major concessions to feminist lobbying groups**\n\n######Loftis, Leslie. (2016, September 1).  Better Time, Better Parents: More states should follow Arizona's lead and implement child custody reform.  Available at: https://www.usnews.com/opinion/articles/2016-09-01/child-custody-reform-is-spreading-from-arizona-to-missouri-to-the-nation\n\n######Jacob, Kathleen. (2019, July 7). Local dads fighting to make joint custody the default. *Fox17 Nashville*.  Available at: https://fox17.com/news/local/local-dads-fighting-to-make-joint-custody-the-default\n\n######Hancock, Matt. (2018, June 15).  Kentucky takes a leading role with the nation's best joint-custody law.  Available at: https://www.courier-journal.com/story/opinion/contributors/2018/06/15/kentucky-now-has-best-joint-custody-law-country/705331002/",
    "title": "The status quo of women as caretakers, and men as breadwinners (or wage slaves), was created by the women's movement during the late 19th century",
    "subreddit": "MensRights",
    "timestamp": 1574795641,
    "score": 59,
    "keyword": "american judge"
  },
  {
    "text": "Apparently \"Kids Don’t Damage Women’s Careers — Men Do\" (of course...) [Here's the article on Medium](https://medium.com/s/jessica-valenti/kids-dont-damage-women-s-careers-men-do-eb07cba689b8)\n\nPredictably, it's always mens fault. The main issue with the article is how the author presumes that it's a one-sided decision: that the man forces the woman to take on the childcare role against her will so that he can work instead. She pretends as if it's never the case that...\n\n1. ...it's a mutual decision that the couple came to\n2. ...the man would also like to spend more time with his children, but is expected to provide for the family\n\n>Americans need to stop believing that women do the majority of care work because we want to. It’s because we’re expected to, because we’re judged if we don’t, and most of all, because it’s incredibly difficult to find male partners willing to do an equal share of the work.\n\nFirstly, this is not always true. There are indeed some women who enjoy being housewives, who take pride in being mothers and raising children, etc.. It's simply unrealistic to pretend all of them are forced into that role, and that they'd rather be working (esp. considering how often people don't even like their jobs, either)\n\nSecondly, her claim can just as well be reversed. She needs to stop believing men don't spend time with their children because they don't want to. It's often because [they're expected to be the breadwinner](https://www.washingtontimes.com/news/2017/nov/9/women-marrying-down-men-become-less-educated-study/); because they're judged when they're not making a lot of money; and because it's difficult to find female partners willing to marry a man who makes less money than them, or willing to be the primary breadwinner so the man can spend more time at home, forming relationships with his children",
    "title": "Apparently \"Kids Don’t Damage Women’s Careers — Men Do\" (of course...)",
    "subreddit": "MensRights",
    "timestamp": 1556838817,
    "score": 45,
    "keyword": "american judge"
  },
  {
    "text": "Kentucky Judges Pre-Signed Blank Legal Documents So That Child Services Could Take Custody of Kids on Nights and Weekends Kentucky Judges Pre-Signed Blank Legal Documents So That Child Services Could Take Custody of Kids on Nights and Weekends\n\n\"Children are being illegally taken from their home without judges' proper authority.\"\n\nhttps://reason.com/2019/05/09/kentucky-cabinet-family-health-child-services-judges-pre-signed/\n\ntweet with me to seek justice:\n\n> \"Kentucky Judges Pre-Signed Blank Legal Documents So That Child Services Could Take Custody of Kids on Nights and Weekends\" Look @OIGatHHS @HHSOCR @SecAzar @realDonaldTrump #cps https://reason.com/2019/05/09/kentucky-cabinet-family-health-child-services-judges-pre-signed/\n\nand in reply:\n\n> \"There is a fundamental right under the Fourteenth Amendment for a  parent to oversee the care, custody, and control of a child.\"..\"guarantees more than fair process.\" Look @CivilRights https://supreme.justia.com/cases/federal/us/530/57/     \n\nand in reply:\n\n> If the law requires judicial review, aren't pre signed orders a Conspiracy Against Rights? (18 U.S. Code § 241) @FBI @TheJusticeDept @realDonaldTrump @AndyBeshearKY @GovMattBevin  https://www.law.cornell.edu/uscode/text/18/241\n\nand in reply:\n\n> Children were also snatched in Detroit using pre-signed orders. This appears to be a pattern or practice of possible crime funded by Title IV-E incentive dollars. HHS has a constitutional and statutory duty to protect civil rights of American families.  https://www.reddit.com/r/MensRights/wiki/faq#wiki_14._is_there_evidence_of_sexism_and_corruption_in_the_child_protective_services_bureaucracies_in_the_united_states_.28title_iv-e.29.3F",
    "title": "Kentucky Judges Pre-Signed Blank Legal Documents So That Child Services Could Take Custody of Kids on Nights and Weekends",
    "subreddit": "MensRights",
    "timestamp": 1557604485,
    "score": 42,
    "keyword": "american judge"
  },
  {
    "text": "“I can no longer find [the Texas Department of Family and Protective Services] to be credible in any way,” Jack said. “It’s shameful … You all cannot be relied upon for anything. Period.” An exasperated U.S. District Judge Janis Graham Jack found the state in contempt of court Tweet with me to seek justice:\n\n> “I can no longer find [the Texas Department of Family and Protective Services] to be credible in any way,” Jack said. “It’s shameful … You all cannot be relied upon for anything. Period.” U.S. District Judge Janis Graham Jack https://www.texastribune.org/2019/11/05/federal-judge-hammers-texas-officials-over-failures-foster-care-system/\n\nand in reply:\n\n> Why haven't audits by @OIGatHHS protected children and families? When will the Inspector General Act be applied to protect them? When will the Green Book's \"reasonable assurance\" be applied? @SecAzar @realDonaldTrump @GOPHELP #FosterCare #MensRights  https://www.gao.gov/greenbook/overview \n\nand in reply:\n\n> When will @HHSOCR  protect fathers from gender discrimination and children from age discrimination, and treat them equally as Americans? @SecAzar @realDonaldTrump @GOPHELP #MensRights #FathersRights https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nEnd of tweet list.",
    "title": "“I can no longer find [the Texas Department of Family and Protective Services] to be credible in any way,” Jack said. “It’s shameful … You all cannot be relied upon for anything. Period.” An exasperated U.S. District Judge Janis Graham Jack found the state in contempt of court",
    "subreddit": "MensRights",
    "timestamp": 1573319366,
    "score": 31,
    "keyword": "american judge"
  },
  {
    "text": "Article asks why Katy Perry is still an American Idol judge noting that she sexually harasses male contestants. Obviously it's because she's a woman and she sexually harasses men. I know it's hard, but should have been acknowledged.",
    "title": "Article asks why Katy Perry is still an American Idol judge noting that she sexually harasses male contestants. Obviously it's because she's a woman and she sexually harasses men. I know it's hard, but should have been acknowledged.",
    "subreddit": "MensRights",
    "timestamp": 1557386350,
    "score": 31,
    "keyword": "american judge"
  },
  {
    "text": "Useful collection of feminist hate quotes for reference Source: [https://www.urbandictionary.com/define.php?term=feminism](https://www.urbandictionary.com/define.php?term=feminism)\n\n&#x200B;\n\n *Feminism dehumanizes men for political gain. Here are some examples from leading feminists in their own words:*   \n\n\n*\"Men who are unjustly accused of rape can sometimes gain from the experience.\"*   \n*Catherine Comin,* [***Vassar College***](https://www.urbandictionary.com/define.php?term=Vassar%20College)*. Assistant* [***Dean of Students***](https://www.urbandictionary.com/define.php?term=Dean%20of%20Students)*.*   \n\n\n*\"Probably the only place where a man can feel really secure is in a maximum security prison, except for the imminent threat of release.\"*   \n[***Germaine Greer***](https://www.urbandictionary.com/define.php?term=Germaine%20Greer)*.*   \n\n\n*\"All men are rapists and that's all they are.\"*   \n[***Marilyn***](https://www.urbandictionary.com/define.php?term=Marilyn) *French, Author; (later, advisor to* [***Al Gore's***](https://www.urbandictionary.com/define.php?term=Al%20Gore%27s) *Presidential Campaign.)*   \n\n\n*\"And if the professional rapist is to be separated from the average dominant heterosexual (male), it may be mainly a quantitative difference.\"*   \n*Susan Griffin, Rape: The All-American Crime.*   \n\n\n*\"All men are good for is fucking, and running over with a truck\".*   \n*Statement made by A* [***University of Maine***](https://www.urbandictionary.com/define.php?term=University%20of%20Maine) *Feminist Administrator, quoted by Richard* [***Dinsmore***](https://www.urbandictionary.com/define.php?term=Dinsmore)*, who brought a successful civil suit against the University in the amount of $600,000. Richard had protested the quote; was dismissed thereafter on the grounds of harassment; and responded by bringing suit against the University. 1995 settlement.*   \n\n\n*\"We live, I am trying to say, in an epidemic of male violence against women.\"*   \n[***Katha***](https://www.urbandictionary.com/define.php?term=Katha) [***Pollitt***](https://www.urbandictionary.com/define.php?term=Pollitt)*.*   \n\n\n*'To call a man an animal is to flatter him; he's a machine, a* [***walking dildo***](https://www.urbandictionary.com/define.php?term=walking%20dildo)*.\"*   \n*Scum Manifesto. (Valerie Solanas)*   \n\n\n*\"All sex, even consensual sex between a married couple, is an act of violence perpetrated against a woman.\"*   \n*Catherine* [***MacKinnon***](https://www.urbandictionary.com/define.php?term=MacKinnon) *(inventor of the sexual harassment paradigm, prominent legal feminist scholar; University of Michigan, & Yale.)*   \n\n\n*\"I believe that women have a capacity for understanding and compassion which man structurally does not have, does not have it because he cannot have it. He's just incapable of it.\"*   \n*Former* [***Congresswoman***](https://www.urbandictionary.com/define.php?term=Congresswoman) *Barbara Jordan.*   \n\n\n*\"The traditional flowers of courtship are the traditional flowers of the grave, delivered to the victim before the kill. The* [***cadaver***](https://www.urbandictionary.com/define.php?term=cadaver) *is dressed up and made up and laid down and ritually violated and* [***consecrated***](https://www.urbandictionary.com/define.php?term=consecrated) *to an eternity of being used.\"*   \n*Andrea* [***Dworkin***](https://www.urbandictionary.com/define.php?term=Dworkin)   \n\n\n*\"The media treat male assaults on women* [***like rape***](https://www.urbandictionary.com/define.php?term=like%20rape)*, beating, and murder of wives and female lovers, or male incest with children, as individual aberrations...obscuring the fact that all male violence toward women is part of a concerted campaign.\"*   \n*Marilyn French*   \n\n\n*\"Men* [***renounce***](https://www.urbandictionary.com/define.php?term=renounce) *whatever they have in common with women so as to experience no commonality with women; and what is left...is one piece of flesh a few inches long, the penis. The penis is the man; the man is human; the penis signifies humanity.\"*   \n*Andrea Dworkin*   \n\n\n*\"You grow up with your father holding you down and covering your mouth so another man can make a horrible searing pain between your legs.\"*   \n*Catherine MacKinnon*   \n\n\n*\"Man-hating is everywhere, but everywhere it is twisted and transformed, disguised, tranquilized, and qualified. It coexists, never peacefully, with the love, desire, respect, and need women also feel for men. Always man-hating is* [***shadowed***](https://www.urbandictionary.com/define.php?term=shadowed) *by its milder, more diplomatic and doubtful twin,* [***ambivalence***](https://www.urbandictionary.com/define.php?term=ambivalence)*.\"*   \n[***Judith***](https://www.urbandictionary.com/define.php?term=Judith) [***Levine***](https://www.urbandictionary.com/define.php?term=Levine)   \n\n\n*\"Men's sexuality is mean and violent, and men so powerful that they can 'reach WITHIN women to fuck/construct us from the inside out.' Satan-like, men possess women, making their wicked fantasies and desires women's own. A woman who has sex with a man, therefore, does so against her will, 'even if she does not feel forced.'*   \n*Judith Levine, (explicating comment* [***profiling***](https://www.urbandictionary.com/define.php?term=profiling) *prevailing* [***misandry***](https://www.urbandictionary.com/define.php?term=misandry)*.)*   \n\n\n*((Delaney* [***Nickerson***](https://www.urbandictionary.com/define.php?term=Nickerson)*, of the American Coalition for ABUSE AWARENESS, refers to the* [***False Memory Syndrome***](https://www.urbandictionary.com/define.php?term=False%20Memory%20Syndrome) *Foundation as \"The Fucking Molesters Society\". (Miami Herald, April 3, 1995) The* [***ACAA***](https://www.urbandictionary.com/define.php?term=ACAA) *is a* [***lobbying***](https://www.urbandictionary.com/define.php?term=lobbying) *group, which includes Ellen Bass (co-author of THE COURAGE TO HEAL), and Rene* [***Frederickson***](https://www.urbandictionary.com/define.php?term=Frederickson)*, leading feminist* [***psychotherapist***](https://www.urbandictionary.com/define.php?term=psychotherapist) *and strong proponent of* [***repressed memory***](https://www.urbandictionary.com/define.php?term=repressed%20memory) *theory.))*   \n\n\n*((At the STONE ANGELS* [***satanic ritual abuse***](https://www.urbandictionary.com/define.php?term=satanic%20ritual%20abuse) *conference in* [***Thunder Bay***](https://www.urbandictionary.com/define.php?term=Thunder%20Bay) *in February, 1995, the following was contained in the handouts at a conference supported financially by the Ontario Government:* [***FMS***](https://www.urbandictionary.com/define.php?term=FMS) *stands for: FULL OF MOSTLY SHIT; FOR MORE SADISM; FELONS, MURDERERS, SCUMBALLS; FREQUENT MOLESTERS SOCIETY.))*   \n\n\n*\"The male is a domestic animal which, if treated with firmness...can be trained to do most things.\"*   \n[***Jilly***](https://www.urbandictionary.com/define.php?term=Jilly) *Cooper, SCUM (Society For* [***Cutting Up***](https://www.urbandictionary.com/define.php?term=Cutting%20Up) *Men.)*   \n\n\n*\"Women have their faults / men have only two: / everything they say / everything they do.\"*   \n*Popular Feminist Graffiti*   \n\n\n*\"I feel what they feel: man-hating, that volatile admixture of pity, contempt, disgust, envy, alienation, fear, and rage at men. It is hatred not only for the anonymous man who makes sucking noises on the street, not only for the rapist or the judge who acquits him, but for what the Greeks called philo-aphilos, 'hate in love,' for the men women share their lives with--husbands, lovers, friends, fathers, brothers, sons, coworkers.\"*   \n*Judith Levine, My Enemy, My love*   \n\n\n*\"There are no boundaries between affectionate sex and slavery in (the male) world. Distinctions between pleasure and danger are academic; the dirty-laundrylist of 'sex acts'...includes rape,* [***foot binding***](https://www.urbandictionary.com/define.php?term=foot%20binding)*, fellatio, intercourse, auto eroticism, incest, anal intercourse, use and production of pornography, cunnilingus, sexual harassment, and murder.\"*   \n*J. Levine; summarizing comment on the WAS document, (A southern Women's Writing Collective: Women Against Sex.)*   \n\n\n*\"I want to see a man beaten to a bloody pulp with a high-heel shoved in his mouth, like an apple in the mouth of a pig.\"*   \n*Andrea Dworkin; from her book Ice and Fire .*   \n\n\n*\"Men are rapists, batterers, plunderers, killers; these same men are religious prophets, poets, heroes, figures of romance, adventure, accomplishment, figures ennobled by tragedy and defeat. Men have claimed the earth, called it \"Her\". Men ruin Her. Men have airplanes, guns, bombs, poisonous gases, weapons so perverse and deadly that they defy any authentically human imagination.*   \n*Andrea Dworkin, Pornography: Men Possessing Women*   \n\n\n*'My feelings about men are the result of my experience. I have little sympathy for them. Like a Jew just released from Dachau, I watch the handsome young* [***Nazi soldier***](https://www.urbandictionary.com/define.php?term=Nazi%20soldier) *fall writhing to the ground* [***with a bullet***](https://www.urbandictionary.com/define.php?term=with%20a%20bullet) *in his stomach and I look briefly and walk on. I don't even need to shrug. I simply don't care. What he was, as a person, I mean, what his shames and yearnings were, simply don't matter.\"*   \n*Marilyn French; The Woman's Room.*   \n\n\n*\"All patriarchists* [***exalt***](https://www.urbandictionary.com/define.php?term=exalt) *the home and family as sacred, demanding it remain* [***inviolate***](https://www.urbandictionary.com/define.php?term=inviolate)*from* [***prying***](https://www.urbandictionary.com/define.php?term=prying) *eyes. Men want privacy for their violations of women... All women learn in childhood that women as a sex are men's prey.\"*   \n*Marilyn French*   \n\n\n*\"On the Left, on the Right, in the Middle; Authors,* [***statesmen***](https://www.urbandictionary.com/define.php?term=statesmen)*, thieves; so-called humanists and* [***self-declared***](https://www.urbandictionary.com/define.php?term=self-declared) *fascists; the adventurous and the* [***contemplative***](https://www.urbandictionary.com/define.php?term=contemplative)*, in every realm of male expression and action, violence is experienced and articulated as love and freedom.\"*   \n*Andrea Dworkin, Pornography: Men Possessing Women.*   \n\n\n*\"I was, in reality, bred by my parents as my father's concubine... What we take for granted as the stability of* [***family life***](https://www.urbandictionary.com/define.php?term=family%20life) *may well depend on the sexual slavery of our children. What's more, this is a cynical arrangement our institutions have colluded to conceal.\".*   \n*Journalist Sylvia Fraser*   \n\n\n*\"We are taught, encouraged, moulded by and lulled into accepting a range of false notions about the family. As a source of some of our most profound experiences, it continues to be such an integral part of our emotional lives that it appears beyond criticism. Yet hiding from the truth of family life leaves women and children vulnerable.\"*   \n*Canadian Panel on Violence Against Women.*   \n\n\n[***Catharine***](https://www.urbandictionary.com/define.php?term=Catharine) *MacKinnon ( ) maintains that \"the private is a sphere of battery, marital rape and women's exploited labor.\" In this way, privacy and family are reduced to nothing more than aspects of* [***the master plan***](https://www.urbandictionary.com/define.php?term=the%20master%20plan)*, which is male domination. Democratic freedoms and the need to keep the state's nose out of our personal affairs are rendered meaningless. The real reason our society cherishes privacy is because men have invented it as an excuse to conceal their* [***criminality***](https://www.urbandictionary.com/define.php?term=criminality)*. If people still insist that the* [***traditional family***](https://www.urbandictionary.com/define.php?term=traditional%20family) *is about love and mutual aid--ideals which, admittedly, are sometimes betrayed--they're \"hiding from the truth.\" The family isn't a place where battery and marital rape sometimes happen but where little else apparently does. Sick men don't simply molest their daughters, they operate in league with their wives to \"breed\" them for that purpose.*   \n*Donna* [***Laframboise***](https://www.urbandictionary.com/define.php?term=Laframboise)*; The Princess at the Window; (in a critical* [***explication***](https://www.urbandictionary.com/define.php?term=explication) *of the Catharine MacKinnon, Gloria Steinhem et al tenets of* [***misandric***](https://www.urbandictionary.com/define.php?term=misandric) *belief.)*   \n\n\n*\"I feel that 'man-hating' is an honorable and viable political act, that the oppressed have a right to class-hatred against the class that is oppressing them.\"*   \n*Robin Morgan, Ms. Magazine Editor.*   \n\n\n*\"I claim that rape exists any time sexual intercourse occurs when it has not been initiated by the woman, out of her own genuine affection and desire.\"*   \n*Robin Morgan*   \n\n\n*\"And let's put one lie to rest for all time: the lie that men are oppressed, too, by sexism--the lie that there can be such a thing as 'men's liberation groups.' Oppression is something that one group of people commits against another group, specifically because of a 'threatening' characteristic shared by the latter group--skin, color, sex or age, etc. The oppressors are indeed FUCKED UP by being masters, but those masters are not OPPRESSED. Any master has the alternative of divesting himself of sexism or racism--the oppressed have no alternative--for they have no power but to fight. In the long run, Women's Liberation will of course free men--but in the short* [***run it's***](https://www.urbandictionary.com/define.php?term=run%20it%27s) *going to cost men a lot of privilege, which no one gives up willingly or easily. Sexism is NOT the fault of women--kill your fathers, not your mothers\".*   \n*Robin Morgan.*   \n\n\n*\"Heterosexual intercourse is the pure, formalized expression of contempt for women's bodies.\"*   \n*Andrea Dworkin*   \n\n\n*\"In a* [***patriarchal***](https://www.urbandictionary.com/define.php?term=patriarchal) *society, all heterosexual intercourse is rape because women, as a group, are not strong enough to give meaningful consent.\"*   \n*Catharine MacKinnon, quoted in Professing Feminism: Cautionary Tales from the Strange World of* [***Women's Studies***](https://www.urbandictionary.com/define.php?term=Women%27s%20Studies)*.*   \n\n\n*\"The institution of sexual intercourse is* [***anti-feminist***](https://www.urbandictionary.com/define.php?term=anti-feminist)*\".*   \n*Ti-Grace* [***Atkinson***](https://www.urbandictionary.com/define.php?term=Atkinson)*, Amazon Odyssey (p. 86).*   \n\n\n*\"(Rape) is nothing more or less than a conscious process of intimidation by which all men keep all women in a state of fear\".*   \n*Susan Brownmiller, Against Our Will p.6.*   \n\n\n*\"When a woman reaches orgasm with a man she is only collaborating with the patriarchal system, eroticizing her own oppression...\"*   \n*Sheila Jeffrys.*   \n\n\n*\"As long as some men use physical force to* [***subjugate***](https://www.urbandictionary.com/define.php?term=subjugate) *females, all men need not. The knowledge that some men do suffices to threaten all women. He can beat or kill the woman he claims to love; he can rape women...he can sexually molest his daughters... THE VAST MAJORITY OF MEN IN THE WORLD DO ONE OR MORE OF THE ABOVE.\"*   \n*Marilyn French (her emphasis)*   \n\n\n*From 'A feminist Dictionary; ed. Kramarae and Triechler, Pandora Press, 1985:*   \n\n\n*MALE:...represents a variant of or deviation from the category of female. The first males were mutants...the male sex represents a* [***degeneration***](https://www.urbandictionary.com/define.php?term=degeneration) *and deformity of the female.*   \n\n\n*MAN:...an obsolete life form... an ordinary creature who needs to be watched...a contradictory* [***baby-man***](https://www.urbandictionary.com/define.php?term=baby-man)*...*   \n\n\n*Letter to editor: \"Women's Turn to Dominate\". \"......Clearly you are not yet a free-thinking feminist but rather one of those women who bounce off the male-dominated, male-controlled social structures. Who cares how men feel or what they do or whether they suffer? They have had over 2000 years to dominate and made a* [***complete hash of it***](https://www.urbandictionary.com/define.php?term=complete%20hash%20of%20it)*. Now it is our turn. My only comment to men is: if you don't like it, bad luck--and if you get in my way I'll run you down.\"*   \n*Signed: Liberated Women,* [***Boronia***](https://www.urbandictionary.com/define.php?term=Boronia) *Herald-Sun, Melbourne, Australia. 9 Feb., 1996.*   \n\n\n*\"If the classroom situation is very heteropatriarchal--a large beginning class of 50 to 60 students, say, with few feminist students--I am likely to define my task as largely one of recruitment...of persuading students that women are oppressed,\" said Professor Joyce Trebilcot of Washington University, as quoted in Who Stole Feminism: How Women Have Betrayed Women.*   \n\n\n*\"Life in this society being, at best, an utter bore and no aspect of society being at all relevant to women, there remains to civic-minded, responsible, thrill-seeking females only to overthrow the government, eliminate the money system, institute complete* [***automation***](https://www.urbandictionary.com/define.php?term=automation)*, and destroy the male sex.\"*   \n*Valerie* [***Solana***](https://www.urbandictionary.com/define.php?term=Solana)*, SCUM Manifesto (Society for Cutting Up Men.)*   \n\n\n*\"Men, as a group, tend to be abusive, either verbally, sexually or emotionally. There are always the exceptions, but they are few and far between (I am married to one of them). There are different levels of violence and abuse and individual men buy into this system by varying degrees. But the male power structure always remains intact.\"*   \n*Message on FEMISA, responding to a request for arguments that men are unnecessary for a child to grow into mature adulthood.*   \n\n\n*And:*   \n\n\n*Another posting on FEMISA: \"Considering the nature and pervasiveness of men's violence, I would say that without question, children are better off being raised without the presence of men. Assaults on women and children are mostly perpetrated by men whom they are supposed to love and trust: fathers, brothers, uncles, grandfathers, step-fathers.\"*   \n*Both quotes taken from Daphne Patai's excellent critical work,*   \n\n\n[***HETEROPHOBIA***](https://www.urbandictionary.com/define.php?term=HETEROPHOBIA)   \n*\"At Brandies I discovered Feminism. And I instantly became a convert... writing brilliant papers in my Myths of Patriarchy class, in which I likened my fate as a woman to other victims throughout the ages.\"*   \n*Heather Hart 7*   \n\n\n*\"Ninety-five percent of women's experiences are about being a victim. Or about being an underdog, or having to survive... women didn't go to Vietnam and blow things up. They are not Rambo.\"*   \n[***Jodie Foster***](https://www.urbandictionary.com/define.php?term=Jodie%20Foster) *in The New York Times Magazine.*   \n\n\n*\\* \\* \\**   \n\n\n*\"The* [***prejudicial***](https://www.urbandictionary.com/define.php?term=prejudicial)*, man-hating cant of militant 'gender' (victimal) Feminists has foolishly served only to reinforce a counter-sexist prejudice that holds ALL women to be likewise self-serving, manipulative, irrational, unfair...now organized into a kind of* [***monolithic***](https://www.urbandictionary.com/define.php?term=monolithic) *Collective Shrew, throwing a massive* [***slo-mo***](https://www.urbandictionary.com/define.php?term=slo-mo) *cultural tantrum among us. It is the classic tactic of infantile Passive Control, a strategy vehemently protested against by Equity Feminists, who are none of that (as is no mature adult)...*   \n\n\n*\"What we are seeing in this* [***headless***](https://www.urbandictionary.com/define.php?term=headless) *misandry is a grand display of the Tyranny of* [***the Underdog***](https://www.urbandictionary.com/define.php?term=the%20Underdog)*: 'I am a wretchedly longstanding victim; therefore I own no burden of adult accountability, nor need to honor any restraint against my words and actions. In fact, all efforts to restrain me are only further proof of my oppressed condition.'*   \n\n\n*\"It is the most perfect trump-card against accountable living ever devised.\"*   \n\n\n*Gladden* [***Schrock***](https://www.urbandictionary.com/define.php?term=Schrock)*, from The Tyranny of the Underdog.*",
    "title": "Useful collection of feminist hate quotes for reference",
    "subreddit": "MensRights",
    "timestamp": 1551568069,
    "score": 29,
    "keyword": "american judge"
  },
  {
    "text": "Is this some kind of \"hypergamy culture\" or just my imagination? Hi Men's Rights:\n\nSo I've been musing on something tonight. I'm 32 years old and single (by choice.) I've never really had an American girlfriend, or Western girlfriend for that matter. I've dated Brazilian, East European, and Southeast Asian women among other ethnicities. Even back in university, in the states, it was the foreign exchange students who were interested in me and vice versa. I'm usually invisible to American women. But I don't care so much because it's not like I have a lack of options, and besides I'm much more attracted to exotic women with accents etc so... no complaints with my love life.\n\nSo I'm back to living out of a backpack and traveling around the world. Here's what I've noticed: wherever I go, hanging out in hostels, it's always the shorter stature guys like me or shorter (I'm 5'8-5'9) who are single OR have non-Western girlfriends with them. So if I see a guy who looks like me, \\[is American or Western\\] and he's with his girlfriend, it's always like \"this is Yuko from Japan\" or something. But every time I see some pretty Aussie, English or American girl, her boyfriend is ALWAYS some huge guy... 6'3, 6'4, with a pretty face, and either really masculine looking OR completely immasculated and she's bossing him around constantly. Both dynamics I find a bit odd.\n\nI don't think I've ever seen a Western couple where the guy wasn't hitting all those criteria. Otherwise, the pretty Western women are single. So, it's either they're with that X-perfect guy, or no guy at all. Most often, they're by themselves or with girlfriends, but I've never seen a Western woman with a guy who looks even similar to me. And that's really an observation from years of traveling.\n\nDoes this mean I am being \"weeded out\" of Western rampant hypergamy, or is it my imagination? Is the fact foreign women don't seem to care evidence that it's Western culture promoting this to an extreme level and resulting in this phenomenon? Basically, in my experience, including my failed days trying to be a kind of pickup artist back in the states, fellow American women are open to talk to me or become friends but very closed off romantically. With foreign women, things turn romantic quite naturally and it happens more often than not and doesn't even require a lot of thought. It's a bit like, eh, I'm being hardcore judged by fellow Westerners and being systematically weeded for not being a pretty enough, tall enough bloke.\n\n(I might add, given I've dated some really beautiful women in my life, the fact Western women immediately rule me out means I feel bad for those \"alpha males\" who get stuck with the Americans while I get the better girls!!)\n\nIs this just me going crazy or is this a real thing?",
    "title": "Is this some kind of \"hypergamy culture\" or just my imagination?",
    "subreddit": "MensRights",
    "timestamp": 1552677502,
    "score": 25,
    "keyword": "american judge"
  },
  {
    "text": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education   \n\nOrwell’s famous dystopia *1984* is often cited as a parable  about the banality of administrative evil. The ever-vigilant bureaucrats  of Oceania position themselves not only on the Left side of history,  but also at its *end.* To err from their ideology is treason.\n\nThe citizens of Oceania live in a state of self-imposed hypnosis  where they have to pretend that even the simplest of words signify their  exact opposites. The government agency that specializes in espionage  and torture is thus called *The Ministry of Love*. The Ministry views every sexual act as a potential crime unless proven otherwise via affirmative surveillance.\n\nImagine a federal agency that has invested itself with the authority  to monitor the most private details of citizens to root out sexual  heresy. Imagine a federal  agency which once contemplated [installing security cameras](http://pgbovine.net/OET-Draft-Grit-Report-2-17-13.pdf) in every classroom in order to monitor the facial and optical muscles of all students nationwide.\n\nThis agency was so devoted to its ideological mission that it never presented its [unconstitutional rules](https://www.thefire.org/did-the-office-for-civil-rights-april-4-dear-colleague-letter-violate-the-law/) to the American public to consult their opinion, considered itself to be [a superior alternative](https://www.huffpost.com/entry/why-students-are-fighting-for-title-ix_b_58e27314e4b0ca889ba1a848) to the criminal justice system, granted itself [universal jurisdiction](https://www.insidehighered.com/news/2018/01/19/feds-find-buffalo-state-failed-investigate-alleged-sexual-assault-created-hostile), threatened many colleges with financial death unless they punished [constitutionally protected speech](https://www.nas.org/blogs/dicta/ocrs_new_sexual_harassment_guidelines_threaten_academic_freedom_due_process), sought to abolish the [“reasonable person” standard](https://reason.com/2016/09/12/ocr-to-frostburg-state-university-common), and created [a class of imitative bureaucrats](https://www.nas.org/blogs/dicta/gender_inequity_among_the_gender_equity_enforcers) in academic institutions to perpetuate an industry of victimhood.\n\nImpossible, you think? We have just objectively described the record  of the Department of Education’s civil rights branch, the Office for  Civil Rights.\n\nThe Office for Civil Rights (OCR) received bipartisan and  professional criticism for its unconstitutional actions during the Obama  administration. Formal critics include the [Federalist Society](https://regproject.org/wp-content/uploads/RTP-Race-Sex-Working-Group-Paper-Campus-Misconduct-Proceedings.pdf), [Heritage Foundation](https://www.heritage.org/crime-and-justice/report/campus-sexual-assault-understanding-the-problem-and-how-fix-it), [National Association of Scholars](https://www.nas.org/articles/nas_applauds_secretary_devos_decision_on_title_ix),[ California Governor Jerry Brown](https://www.wsj.com/articles/jerry-browns-title-ix-veto-1508280834), [Justice Ruth Bader Ginsburg](https://reason.com/blog/2018/02/19/ruth-bader-ginsburg-due-process-me-too),  [American College of Trial Lawyers](https://www.actl.com/docs/default-source/default-document-library/position-statements-and-white-papers/task_force_allegations_of_sexual_violence_white_paper_final.pdf), and [Reason Foundation](https://reason.com/blog/2017/09/07/betsy-devos-rape-ocr-title-ix-campus).\n\nMoreover, courts that have heard cases involving OCR’s Title IX  procedures have often strongly denounced them. Examples include  condemnatory opinions from the [Second Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca2/15-1536/15-1536-2016-07-29.html) and the [Sixth Circuit of Appeals](http://www.opn.ca6.uscourts.gov/opinions.pdf/18a0200p-06.pdf). In a recent [Seventh Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca7/17-3565/17-3565-2019-06-28.html)  opinion, Judge Barrett stated that “Purdue’s process fell short of what  even a high school must provide to a student facing a days-long  suspension.” Professor KC Johnson [has covered the case in greater detail. ](https://www.city-journal.org/john-doe-v-purdue-univ)\n\nObama’s OCR espoused a particular brand of radical feminism.  According to this doctrine, taught across the nation in women’s studies  departments, men have brutalized women since the beginning of history.  Past oppression must be remedied through government intervention,  eliminating the due process principles that are meant to protect every  American.\n\nThe perils of government tyranny aside*,* the fundamental  assumptions of the “patriarchy theory” cannot survive rational scrutiny.  While it is true that women were historically denied various rights,  they have also been sheltered from grievous harm (combat, for example).  Also, analysis of federal aggregate data from the United States  demonstrates that women are [as likely to engage in sexual coercion](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) against men as [vice versa](https://www.sciencedirect.com/science/article/pii/S1359178916301446?via%3Dihub), which undermines the “patriarchy” narrative.\n\nAt any rate, past historical wrongs cannot be rectified by unfair treatment in the present, as the Eighth Circuit stated in [this ruling](https://cases.justia.com/federal/appellate-courts/ca8/18-3077/18-3077-2019-03-06.pdf?ts=1551889833).\n\nOCR’s historical record speaks to its lack of fairness. The agency  authored a total of 255 resolution letters (formal decisions in a case)  from 2012 to 2019.\n\n[Pekgoz summarizes the circumstances in a Synthetic Analysis](https://static.wixstatic.com/media/ea7b71_a751c44c74dc4e8fa8f35666ab9b81a1~mv2_d_3812_2108_s_2.jpg/v1/fill/w_3812,h_2108/PrintScreen%2C%20Synthetic%20Analysis.jpg).\n\nThe analysis shows that whenever OCR wrote a resolution letter  between 2012 and 2019 to adjudicate adversarial proceedings between  female and male parties, they sided with the female 216 times but only 9  times with the male (2400% more likely to side with the female). Their extreme partisanship is clear in every  aspect of Title IX.\n\n&#x200B;\n\n* **Athletics.** The Department’s athletics compliance tests have been [rightfully criticized](https://www.nccivitas.org/2010/title-ix-blind-quota-system-or-how-kneecap-college-sports/)  for imposing unconstitutional quotas. The agency sided with female  athletes 63 times, but sided with the male only once between 2012 and  2019. The only resolution letter favorable for male athletes is the [Temple University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03142257-a.pdf).\n* **Grading.** The Department sided with female students who alleged [discrimination](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/06112126-a.pdf) in [grading](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11162077-a.pdf) on [multiple occasions](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15132147-a.pdf), while dismissing [very similar allegations by male students](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/07132238-a.pdf).\n* **Retaliation.** The Department sided with female  complainants alleging retaliation on many occasions. There are at least  23 letters in this category, such as the [Jacksonville State University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/04142086-a.pdf)  where the agency sided with a “falsely accused” woman. There is no  clear example of the Department siding with a male student alleging  retaliation on the basis of sex, [but dismissal letters do exist](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10111376-a.pdf).\n* **Sexual Harassment.** Male students who petitioned the  agency to allege bias in sexual harassment disputes (either as the  accused, or the accuser) had a success rate of 1.1 percent during  2012-2019 (6/532). The Department was very aggressive when it came to  siding with female accusers while consistently dismissing the concerns  of accused males. This is despite male students often suffering  life-altering consequences, such as expulsion or a permanent notation on  their transcript, in addition to severe emotional distress. [Some have committed suicide](https://www.insidehighered.com/news/2017/05/02/title-ix-cases-resulted-suicide-suicide-attempt-two-colleges-prompt-fresh-debate).\n* **Reasonableness.** OCR urged schools to get rid of the  “reasonable person” standard at least twice:  One letter involved a  female student who accused a male teacher of [staring at her breasts for 3-4 seconds](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09141376-a.pdf). Another letter involved a costly systemic review because very young students [were playing “National Grab Ass Day”](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131106-a.pdf) during play time. The agency even sided with a female student whose claims of sexual violence [were disproven via DNA evidence](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15112115-a.pdf).\n* **Due Process.** While sending a dismissal letter to an accused male student, OCR argued that [“due process” is not covered by Title IX](https://www.scribd.com/document/426012564/Samuel-Meritt-University-Dismissal).  As long as the accused is a man, that is. Federal bureaucrats  aggressively sided with women who were accused of various sexual  infractions. On one occasion, the Department condemned a university for  allowing a male [to file a counter-claim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11116001-a.pdf) of misconduct against a female student. Another time, the agency [threatened a university](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/01102089-a.pdf)  with loss of federal funding for pressing fraud charges against a woman  who made false accusations. There is also an example of OCR using [defamation theory to side with a female complainant](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11141175-a.pdf), even though the agency has never accepted any complaints concerning the damaged reputations of accused men.\n* **Single-Sex Programs.** Women are the majority of college students, but many colleges offer dozens of support programs [for women only](https://www.jamesgmartin.center/2019/05/identity-politics-versus-basic-logic-should-colleges-offer-affirmative-action-for-the-female-majority/).  Whenever male complainants challenge female-only programs, such as  women’s centers or STEM camps for girls, the Department has dismissed  their complaints on various pretexts. One popular pretext is that these  female-only programs cannot be challenged unless men specifically apply  to them and receive rejections, thus creating a putative victim.  However, OCR has resolved [procedural complaints in the absence of any victim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/02152290-a.pdf) on many occasions, as long as the objective [was consistent with their agenda. ](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03121217-a.pdf)\n* **American Psychological Association (APA) Guidelines.** OCR dismissed a Title IX complaint challenging the APA guidelines, which sought to [classify masculinity as a mental illness factor](https://www.dailywire.com/news/46458/foia-request-reveals-boston-title-ix-office-has-ashe-schow).  This was despite serious public outcry against those guidelines. In the  dismissal letter, officials argued that Title IX cannot be applied in a  manner that would interfere with curricular materials. That was false.  OCR has aggressively interfered with [the training materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11142219-a.pdf) and [the curricular materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131096-a.pdf) of [various colleges](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10131040-a.pdf) as long as doing so furthers their gender agenda.\n* **Administrative Closure.** OCR has a rule requiring  the dismissal of pending complaints if similar allegations have been  filed elsewhere. This rule is rigorously applied [to male students to dismiss their Title IX complaints.](https://www.documentcloud.org/documents/3479594-Stanford-University-09-15-2324.html) However, when [female students file complaints against their institutions](https://www.ed.gov/news/press-releases/office-civil-rights-launches-investigation-university-southern-californias-handling-sexual-harassment-claims), administrative closure is not applied to dismiss their allegations.\n\nSome might assume that OCR has received few meritorious complaints  from male students. According to a Freedom of Information Act request,  however, the Department received [532 complaints](https://www.scribd.com/document/426016051/FOIA-All-532-Cases-With-545-Relevant-Allegations) from men in the sexual harassment category alone between 2011 and 2019.\n\nThe Department of Education became a hive of identity politics under  Obama and there is little evidence of improvement. The modest reforms  proposed by Secretary Betsy DeVos have not yet been implemented.\n\nResolution letters published under the Trump administration perpetuate the Obama doctrines. For example, [the Stanford University letter](https://provost.stanford.edu/wp-content/uploads/sites/4/2018/04/OCR-Redacted-Stanford-Letter-of-Finding.pdf) tried to eliminate the reasonable person standard. [The Butte-Glenn Community College letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09132096-a.pdf) involved a retroactive review of many old complaints, demanding the creation of a complex bureaucracy. [The Buffalo State University letter](https://www.insidehighered.com/sites/default/server_files/media/OCR-SUNY-Buffalo-State.pdf) wrongfully claimed that off-campus incidents fall under the jurisdiction of Title IX, [despite case law to the contrary.](https://caselaw.findlaw.com/us-8th-circuit/1410731.html)\n\nUnsurprisingly, some politicians want to abolish the entire Department of Education. Representative Thomas Massie has [introduced a bill](https://massie.house.gov/newsroom/press-releases/rep-massie-introduces-bill-to-abolish-federal-department-of-education)  to do just that. While we cannot predict whether the Department will  ever be abolished, we must never cease our vigilance against our very  own *Ministry of Love.* \n\n*Kursat Christoff Pekgoz is a PhD student at the University of Southern California.*\n\n*James E. Moore, II is professor of industrial and systems  engineering; public policy and management; and civil engineering at the  University of Southern California.*\n\n[*https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/*](https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/)",
    "title": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education",
    "subreddit": "MensRights",
    "timestamp": 1570815774,
    "score": 16,
    "keyword": "american judge"
  },
  {
    "text": "Until last year, child marriage was legal in all 50 states in the US I've been reading about child marriage in the US this week. I knew it was a problem, but oh my god I did not know how far-reaching of a problem it was. Here are some articles I found (and significant points). Please add any resources or articles that you know about. I am floored that I haven't heard more about this (and that it's legal to begin with).\n\n[https://en.wikipedia.org/wiki/Child\\_marriage\\_in\\_the\\_United\\_States](https://en.wikipedia.org/wiki/Child_marriage_in_the_United_States)\n\n* Until 2018, all 50 states in the US allowed child marriage\n* 48 US states allow child marriage (New Jersey and Delaware have banned it)\n* 17 US states have no minimum age for child marriage\n\n[The legal loophole of child marriage enables grown men to get away with raping girls](https://www.huffingtonpost.com/entry/child-marriage-state-laws_us_59a5e70ee4b00795c2a27e19)\n\n* “More than 200,000 children under 18 were married from 2000 to 2015”\n* “2000 to 2014, over 800 children age 15 or younger in Missouri were married”\n* Girls who marry as teens are 50% more likely to drop out of high school, 4x less likely to finish college, and 31% more likely to live in poverty later\n* Common motivations for child marriage include religious beliefs about premarital sex and pregnancy, arranged marriages, parents’ desire to stop providing for the child, and covering up rape\n* Married children are not legally emancipated and do not have the full rights of adults\n* State labor laws and runaway laws prevent married girls from leaving abusive situations\n* Children can get married even if they are not legally old enough to consent to sex\n\n[American child marriage laws leave married children vulnerable](https://www.nytimes.com/2018/06/01/opinion/sunday/child-marriage-delaware.html)\n\n* Most domestic violence shelters do not accept women under age 18\n* In many states, a married underaged girl who flees her home is legally a runaway\n* In some immigrant families, girls face pressure to marry distant relatives in order to allow them to move to America\n\n[Child Marriage in America](http://apps.frontline.org/child-marriage-by-the-numbers/)\n\n* Approximately 3500 minors married in New Jersey between 1995 and 2012\n* At least 207,459 minors were married in the US between 2000 and 2015\n* 87% of married minors are girls\n* 14% of minors married other minors; 86% married adults\n* Law enforcement rarely charges adults with statutory rape if they are married to their victim, even if that victim is under the age of consent\n* In most states, minors need a parent’s consent to marry. In some, they need a judge’s approval.\n* 9 states allow a pregnant minor to marry without a judge’s approval and sometimes without parental approval\n* Minors in rural areas and from poor families are most likely to marry young\n\n# Individual states\n\n[Child Marriage 2000-2017](https://www.independent.co.uk/news/world/americas/200000-children-married-us-15-years-child-marriage-child-brides-new-jersey-chris-christie-a7830266.html)\n\n* In 2001, 3 10-year-old girls were married to men aged 24, 25, and 31 in Tennessee\n* In 2006, an 11-year-old boy was married to a 27-year-old woman in Tennessee\n* Data from 40 of the 50 states establishes that more than 200,000 minors were legally married in the US between 2000-2015\n* More than 1000 children 14 and under were granted marriage licenses from 2000-2015\n* A 14-year-old girl was married to a 74-year-old man in Alabama\n* A 17-year-old girl was married to a 64-year-old man in Idaho\n* Chris Christie vetoed a bill that would have made child marriage illegal in New Jersey because he said it defied religious customs\n\n[Florida law enables the sexual exploitation of children](https://www.sun-sentinel.com/opinion/commentary/fl-op-viewpoint-florida-child-marriage-20171024-story.html)\n\n* 16,400 children as young as 13 were married in Florida from 2000-2017\n* Data suggests that many of these marriages were between pregnant girls under 15 (who cannot legally consent to sex with an adult in Florida) and their rapists\n* Underage girls are at higher risk of domestic violence than adult women\n* In Florida, married children are automatically emancipated from their parents and no longer protected by the Department of Children and Families\n* Unlike in other states, married children in Florida have the ability to get divorced\n* 80% of teenage marriages end in divorce\n\n[2018 Kentucky child marriage bill](https://www.patheos.com/blogs/lovejoyfeminism/2018/03/why-conservatives-objected-to-that-kentucky-child-marriage-bill.html)\n\n* Senate Bill 48 would have raised Kentucky’s legal marriage age to 18 (from 16; or, if pregnant, no minimum age with a judge’s approval)\n* If the bill had passed, 17-year-olds would have been able to get married to someone within 4 years of their age with judicial approval if they provided evidence of maturity, stable housing, and a GED or high school diploma. Parental consent would not be required and married 17-year-olds would be automatically emancipated.\n* Conservative lobbyists (notably the Family Foundation of Kentucky) opposed the bill because it defied “parental rights” since parental consent would no longer be sufficient for 16- and 17-year-olds\n* The bill specified that parental wishes are not “sufficient evidence to establish that the best interests of the minor would be served by granting the petition for marriage.”\n\nEdit: spelling",
    "title": "Until last year, child marriage was legal in all 50 states in the US",
    "subreddit": "Feminism",
    "timestamp": 1551475944,
    "score": 732,
    "keyword": "american judge"
  }
]