[
  {
    "text": "Americans who didn't vote in November on principal, do you regret it?",
    "title": "Americans who didn't vote in November on principal, do you regret it?",
    "subreddit": "AskReddit",
    "timestamp": 1487012928,
    "score": 1,
    "keyword": "american principal"
  },
  {
    "text": "Advice for new teachers Good morning!\n\nI've only lurked on this sub for a few months, but I've noticed a huge influx of first time teachers (which I assume is common around this time of year) so, first of all, congratulations! Teaching is incredible. It's fun, it (can be) rewarding, but there are some scary parts to it. So much so that [8% of teachers quit per year](http://www.npr.org/sections/ed/2016/10/24/495186021/what-are-the-main-reasons-teachers-call-it-quits), which is alarmingly high, but even worse is that [4 in 10 new teachers quit within the first year](https://www.theguardian.com/education/2015/mar/31/four-in-10-new-teachers-quit-within-a-year). Yikes.\n\nNow there's many reasons for that, but a lot of it (my opinion) comes from ignorance to the profession. So to help combat that, I'm going to laundry list a bunch of random tips/suggestions/things in no particular order that helped me my first year or so, and if anyone else feels so inclined to add to this, please do so.\n\nDISCLAIMER: my suggestions apply to mainly high and possibly middle. Some of my suggestions might be the polar opposite for elementary; I can't speak on grades 1-5. \n\n* Teaching is a balance of combining your personality, strengths, and style with what has already been proven to work. Don't try and reinvent the wheel; you're not the first person to ever step in a classroom, but at the same time don't just run to your Classroom Management textbook from your Sophmore year of college every time little Timmy rolls his eyes. \n* Your school should have a mentoring program of sorts, if not, find someone in your department that you can basically follow around like a hawk. Find someone that's approachable and good with the kids - you'll be able to tell from the first time you talk to them. Trust me. Try to not find someone that is jaded, which depending on the school/district, that'll be very hard to do. Mimic that person to a tee. You'll find that some of the stuff he/she does is great for you while others you can do without. No two classes are the same. You could be teaching American History and the teacher across the hall which is doing the exact same unit as you with the exact same assessments, but it'll be ran differently. Find what works for you. \n* Don't do the same things two years in a row. I don't mean curriculum (though you'll definitely be tweaking that for the first few years), but rather the way you approach it. Find what work and what doesn't. You may find that you don't like some of the things that the teacher with 30 years experience does. That's okay.  \n* Be willing to drop whatever isn't working. It sucks when you spend all weekend working on a lesson plan only to realize that it didn't at all come out the way you intended. Always have a fallback.\n* Learn to read the students' body language. I don't care if you have the most well-behaved, disciplined, AP students. If you see a sea of glossed over eyes, you've lost them. Stop and move on to something else (especially applicable to those of you who are teaching in 90 minute periods).\n* Whatever grade you teach, talk to them two grades higher. I teach freshmen and juniors English honors and I have the same spiel every year. For my juniors it's that they're two years away from sitting in a college classroom, so they need to act like adults. For my freshman I semi-unintentionally scare them with my \"this is an honors level class, and I expect honors level behavior and effort. If you cannot do that, then go to guidance now and switch to a regular level class.\" That causes them to perk up. My logic is that high schoolers are either of age to drive or about to be, and if the US says that they are old enough to drive a giant piece of metal on a highway going 70 mph, then they are mature enough to do what is asked of them.\n* Don't take their opinions of you personally. They're going to be varied. I had a kid tell me that I'm his favorite teacher he's ever had while the student right next to him absolutely hated me. It'll happen. No sweat. In this regard, treat teaching like a normal job. If you focus on trying to get them all to like you, then you're going to have a bad time.\n* Treat them like adults until they act like a child.\n* DO NOT UNDER ANY CIRCUMSTANCE CREATE A RULE THAT YOU DON'T INTEND ON ENFORCING! I made this mistake my first year. Kids will test you. If you stupidly put a dumb rule in your syllabus, you're stuck with it for the whole year. \n* Speaking of syllabus, if your school allows you to tweak it, I like to ask for parent's e-mail, cell-phone, and also which method of contact that they prefer (I've had it bite me before in parent meetings when they said I called but should have e-mailed or vice versa).\n* Hope you like tape. This job has more red tape and bureaucracy than I ever would have imagined - which brings me to my next point...\n* CYA. Document every single little thing that you can imagine, especially behavior issues. You don't want to be sitting in a parent conference with the principal in March and not have anything to back up what you've been saying (as a side note, this is another reason why I prefer e-mail over phonecalls with parents). Literally document everything. \"On 10/3 at 11:38 AM, Timmy took out his cell phone. Received verbal warning. 10/4 11:00 AM Timmy took out phone. Issued detention. Called home on 10/4 at 3:00 P. No answer. Left voicemail detailing incident. Sent email on 10/4 at 3:15 P. E-mail attached.\" Is it a pain? Yes. But it is so necessary, and nothing shuts up the \"my child is an angel and would never do that\" parent quicker than that.\n* Be available to kids. You'll get a few that latch on to you. I had a few that came to me for tutoring during lunch and it turned into a mini counseling sessions with things they were struggling with school wise and friends.\n* But be careful. Remember that you are required by law to report any signs of abuse or any indication of self-harm.\n* Be respectful of other teachers. For some reason students think that it's okay to berate other teachers to the \"cool\" teachers. Don't allow them to do that. Cut it off immediately. You may share their opinion, but remember the classroom isn't a place for gossip. You are their instructor. They'll respect that.\n* Enjoy what you teach. I mean, this should be a very \"duh\" point, but you will be amazed at how many experienced teachers hate their subject. Yes, there's going to be parts of it you don't like, and that's okay, but whatever you don't like, multiply that by 50. That's how your kids feel.\n* But the flip side of that is things you are enthusiastic about goes over so much better than things you're indifferent. I'm one of the few out there that still loves teaching \"The Scarlet Letter\" and the vast majority of my kids like it too because of how we approach the text.\n* Remember where you are. You may love what you're teaching, but the kid in front of you might hate every single thing about your subject. Think back to your least liked subject in school and how you felt about it. Now realize that in every period there's a few of those kids sitting there.\n* 504's are not an excuse to be lazy (NOTE: I have no idea what 504/IEP's are called in other states. They might be the same thing. I can only speak for Florida). Some students will have accommodations whether they're ELL or something else. You have zero authority to override an IEP/504 (note that you will have a meeting with guidance and you will be able to give your input about accommodations per student, but in the classroom, you have to go by whatever they need). The brutal reality is that some students manipulate the system. In Florida it's incredibly easy to get accommodations. The most common one is extended time. That's not just on quizzes/tests. That's for homework/papers/projects/anything. You could inevitably have a student who waits until the bitter end to turn in everything. A 504 IS NOT AN EXCUSE TO BE LAZY! But it's tricky. Sometimes you cannot enforce a strict deadline. This is where communication with the parent and guidance is paramount as well as documentation.\n* Be very aware of what else is going on in school and be sympathetic to it. For example, I know a lot of my students are in AP classes, so I try to make the workload light come around April-May. I also know that a lot of them take SATs around that time, so I come up with SAT prep exercises that also align with the standards I'm teaching (something that is very easy to do with English in particular). Homecoming is next week and the kids are excited? Don't assign a weekend project. Things like that. \n* Male teachers: Be very aware that you are a male. Don't find yourself alone in a classroom with any student male or female. I'll have one or two come talk to me privately for whatever reason and I do the same thing. I float by door in eyesight of anyone that could be in the hallway. Don't ever allow the door to be closed. Even if they're coming to you for something personal, explain to them that you have to keep the door open.  \n\nOkay, this turned out to be significantly longer than I had imagined. I'll update if I think of more. But if you hung in this long, that already shows you care. It's fun. It's hard. Probably harder than anything you've done before, but man, seeing the lightbulb click in the faces is awesome. It's worth it if you can stick with it.",
    "title": "Advice for new teachers",
    "subreddit": "Teachers",
    "timestamp": 1501239423,
    "score": 235,
    "keyword": "american principal"
  },
  {
    "text": "I am not able to give all of my students the attention they need and deserve. Right now I work at a private charter school that deals with children with behavioral problems and emotional problems. I didn't really know what I was getting into when I applied there, just that I wanted a job my first year teaching history and that I wouldn't be getting many subbing calls in the place where I lived (Though i did have a person call the other day looking for me to sub. So it would have been a long wait). \n\nSo I took a job teaching at this school. And right now I'm in a bind because I love the people that work there and are really think full to them for their guidance but the way the school is set up their is just no way for me to give the kids what they need.\n\nRight now this is what my schedual looks like.\n\nBlock one: 72 minuites of class with two Civics students, three world history students, two 8th grade state history students, and one 7th grade world history student. And in a week we may be getting a 6th grader in the class as well.\n\nSecond block I go and teach at a different part of the school where I may get one student in class if I'm lucky and have one who everyday refuses to come point blank. And in it I have 1 American history, two world history, and two 7th grade history.\n\nThen for their block I don't get planning. Because its a charter school and because we don't have enough people to provide services (every kid has an iep) the teachers have to sub in on their planning period. So I get to help out in another class that I have no experience in.\n\nThen in fourth block its a littler easier for the moment. I have five civics students and one American history student. This is down from last week when I had that plus one world history student. \n\nAnd I just dont' have the time and ability to give everyone what they need. I wish I did, the kids deserve it and need it but usually I end up having to have some kids or groups like the NC class self teach because between managing lessons, dealing with behavior (like today when three kids decided they weren't going to do guided notes or work and just sat there. And their was nothing I could do because we don't have enough staff to send them out or do ISS so all I could do was try to convince them to work before having to move on just to cover things) and teaching I run out of time.\n\nAnd because of the fact that we use  versions of text books, limit access to the net, and that I have to prep for five different classes I can't really come up with anything to new and exciting to really make class more enjoyable or add to  my repertoire \n\nAnd this is not a school where the students will self teach at all. Classroom management is also a mess at times it seems like. Their are therapists who are in there to supposedly help with the management and help the kids do work but they are either gone most of the time or just sit there quietly. \n\n And their are other small things like not getting out due to in climate weather like the public schools do, even for snow days. \n\nBut my principal and the other teachers are supportive and that is partly what makes my decision hard. I really like them and they have given me a lot of help and I know if I leave then they will have a hard time finding a replacement ( I get the feeling their weren't very many others applying for the position when i got it). But also their is the idea of job security. The between DeVos and the new Pres who knows whats going to happen. And with the school thinking of going to semester scheduled and starting in june of this year I would have to either say no to the contract and look for a job or accept it and then break contract a month into it which seems wrong to me and I would imagine carry repercussions when it comes to future employment.  \n\nSo I really don't know and I don't know if anyone will even read this far. It's just something I really need to get out. I mean maybe I am stressing myself out to much. Maybe if I cared less it would  be better. I mean not having to be there untill 8 every day, getting a free lunch, and living close to where i work in a cheap neighborhood are good things. But I just don't know if I can do it a second year. The school is thinking about not offering as many classes next year so that may help things but I'm not sure if it will happen.",
    "title": "I am not able to give all of my students the attention they need and deserve.",
    "subreddit": "Teachers",
    "timestamp": 1488412570,
    "score": 5,
    "keyword": "american principal"
  },
  {
    "text": "Old Dog New Tricks: Professional Development Ideas? After receiving my Masters of Education in the mid-90's, I worked briefly in the United States teaching Middle School and then for a year in Canada working as a Learning Resource Teacher.\n\nDuring this period of time, I finished a second (academic) Masters degree and after being laid off at my public school teaching job, I decided to move overseas and teach English in Asia. \n\nThat I had a large student loan to pay off also informed my decision. \n\nLife is good over here. There was / is always loads of work and in the 15+ years I've been here, I've taught everything from Kindergarten all the way up to University. \n\nThe money is good (by North American standards) and the cost of living is low. \n\nNow that I have a family and children of my own, I am trying to get into the International School system as a teacher. Besides career advancement, I would like also to eventually transition my own children from the local public school system into an international school so that I can eventually send them to University in Canada.  \n\nDespite having more than 20 years experience as a teacher - during my last interview de-brief, the principal mentioned that I have very little professional development over last 15 years. \n\nHe was completely right. \n\nI was applying for a Grade 5 position and the principal mentioned that he would have liked to see me come into the interview with programming / instructional knowledge and experience of 'Readers / Writer's Workshop' and 'Responsive Classroom'. These were two of the examples he mentioned, I imagine there were others he could have pointed to as well. The principal mentioned that he liked me, the things I said, my experience and passion for teaching but that other candidates coming directly from public school or international school jobs had more professional development and up-to-date knowledge of instructional programming and practice than I did.  \n\nQuestion: What professional development courses could I take that would put me in a good position to be a better candidate during the next round of interviews?\n\nAny course I would take would have to be available online and -while it might be possible to organize classroom demonstrations for the purposes of evaluation, it would be a bit hard to organize given local resources. \n\nThanks for tolerating the long-winded question. \n\nAny advice would be greatly appreciated.",
    "title": "Old Dog New Tricks: Professional Development Ideas?",
    "subreddit": "Teachers",
    "timestamp": 1493091487,
    "score": 3,
    "keyword": "american principal"
  },
  {
    "text": "What can my mom do? Alright Reddit.. I've had several throwaways and small accounts, but I've never actually posted before. I'm really banking on some helpful advice here. \n\nMy mom graduated from college with a Bachelor's Degree in Biology, but she stayed home with my siblings and I while we were really young. When we were kids, she went back to school to obtain a Master's Degree in Science Education, and she started teaching high school Chemistry. She taught at her first school for a few years, but her contract wasn't renewed because she had run afoul of the head principal (not giving school board member's children grades they didn't deserve, not passing star athletes who didn't put in the work, and disciplining a girl for acting belligerent and skipping class, who in turn went to said principal and accused my mother of being racist and only disliking her because she was African American). \n\nShe found a new job for the next school year at a smaller school district teaching Advanced Biology and Environmental Science, and even though it was a smaller school (the previous high school had been a huge intercity school) her salary went up by about 10k per year. She taught there for 1 full year, and is in her second year at this high school. \n\nHowever, yesterday she was told that because the school can't pass a levy (it's a very small blue collar area who doesn't value education too much) her and a few other newer teachers are being let go and absorbed for the following year. She is still getting payed through the summer, and she's going to finish up the year, but she won't have a job after that. \n\nWe're not going to be without an income as my dad is a police officer and I'm moving out of my parents house when college is finished, but my question is what are her options? \n\nShe put so much into teaching and loves making a difference in her kids' lives, and she's a very good teacher. She's just tired of looking for a new job every couple of years, and anyone who is a teacher knows how hard jobs are to come by. She is a very smart woman, but she doesn't know what else she can do besides teaching. \n\nIs there any type of profession that those degrees can matter in besides teaching? I'm not sure what else to ask but if you guys could take a second and give whatever advice you have, no matter how small. I just want my mom to be happy and I feel bad that she keeps getting screwed by the education system. \n\nI appreciate everything you guys have to offer.",
    "title": "What can my mom do?",
    "subreddit": "careerguidance",
    "timestamp": 1490301586,
    "score": 18,
    "keyword": "american principal"
  },
  {
    "text": "ELLA - independent short film about Asian Americans in the midwest! Hey, my name is Douglas Kim, I'm a writer/producer living in Los Angeles.\n\nI'm producing a short film of a coming of age story that takes place in small town America.  The film follows the unlikely bond between Abe, a high school recluse and Ella, a charismatic college dropout, as they navigate the streets and social groups of their community.\n\nThe film features a notable Asian TV actor (Nichole Bloom of NBC's \"Superstore\"), offers a new setting for an Asian American story, and follows Asian characters who are integrated in their community, going through universal struggles while dealing with their outsider status in subtle but real ways.\n\nThe film will use an experimental, one-of-a-kind, camera rig that allows for a digital IMAX image.\n\nWith the success of Moonlight and other independent films, it's my belief that film is the way Asian Americans become normalized in America, where we can be seen as Americans pursuing our own version of the American dream.  I think we can accomplish that and more with our film.\n\n\nhttps://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid\n\nWould love it if you can support and share our vision!\n\n\nmore from the director, Dan Chen:\n\nNichole Bloom and Dan Chen have been friends since they attended USC. After Nichole’s successful climb into American television, and Dan’s online awards for his short films (danchen.co), the two decided to collaborate once more on a character-driven project with the intention of festival recognition, online release, and a proof-of-concept for universal Asian American stories.\n\nDan, on the film’s story: “The underlying theme is one of “selling out,” as Abe distances himself from Ella to fit in with new kids he’s met. As an outsider, can he only fit in by submitting to the dominant views of his peers? Or is there a way he can stay loyal to his loved ones, without being left out of the larger community? The film’s story is character-driven and specific, but acts as a metaphor for the Asian American experience. Do we stay in our place, assimilate, or somehow find a third way of being?”\n\nThe camera rig was built by cinematographer Philips Shum, who has shot music videos featuring Diddy, Schoolboy Q, and Drake. It uses the principal of 35mm lens adapters, while increasing the size to accommodate a 56mm x 56mm frame, to create a low-budget solution for an IMAX field of view.\n\nElla is to be produced by Eric Cook and Douglas Kim with Evidence Films, Varient Entertainment, and Justice Tech Industries attached.",
    "title": "ELLA - independent short film about Asian Americans in the midwest!",
    "subreddit": "asianamerican",
    "timestamp": 1488496011,
    "score": 26,
    "keyword": "american principal"
  },
  {
    "text": "\"I was a feminist until my father was murdered by that woman\": Colombian woman speaks out against feminist double standard when it comes to partner homicide In Cartagena de Indias (Colombia), [Jesus Martínez was stabbed to death](https://www.elheraldo.co/bolivar/fallece-hombre-por-heridas-de-arma-blanca-en-un-motel-en-cartagena-333831) after having a discussion with Ana Margarita Rocha in a hotel. According to the woman, who left the hotel room covered in blood and with wounds on her hands and legs, her partner tried to assassinate her. After he regretted attacking her, the man ended his life by stabbing himself in the chest twice.\n\nHowever, the subsequent investigation concluded that the incident was not a suicide, but a murder and Ana Margarita Rocha has been detained as the principal suspect. According to Kelly Martínez Zuluaga, the victim's daughter, Ana Margarita's obsession with her father was such that on one occasion they argued for the same reason, since she was looking for him all day and demanded to know where he was. She also said that her father's Facebook account was allegedly hacked by Rocha. *\"She became a friend of mine when we started studying at the [National Service of Learning](https://en.wikipedia.org/wiki/National_Service_of_Learning), but she intended to approach me because she wanted to know everything my father was doing and where he was\"*, she said.\n\nKelly said that after what happened, she has not received support from the people and assured that society is very feminist, because there haven't been marches asking for justice for her father, [unlike what happened when a woman was beaten and abused by a taxi driver](http://www.eluniversal.com.co/cartagena/hoy-gran-marcha-para-pedir-justicia-por-caso-de-jasmin-alvarez-romero-245362). [***\"I was a feminist until that woman killed my dad\"***](http://www.aldia.co/mundo-serio/hablo-kelly-martinez-la-hija-del-hombre-que-murio-de-manera-sangrienta-en-un-motel), said Kelly Martinez, who believes that if the genders were reversed in this case, feminists would have been marching and asking for a court ruling.\n\nIn order to understand Kelly's disappointment with feminism, we have to take into consideration that one of the main focus of Latin American feminists is femicide. Just like North American feminists are obsessed with rape, Latin American feminists are obsessed with femicide, which is defined as the murder of a woman by her husband, boyfriend or lover. Although the vast majority of homicide victims in Latin America are men, [feminists have organized massive protests under the banner of #NiUnaMenos (Not One Woman Less)](http://nacla.org/news/2016/11/01/niunamenos-not-one-woman-less-not-one-more-death).",
    "title": "\"I was a feminist until my father was murdered by that woman\": Colombian woman speaks out against feminist double standard when it comes to partner homicide",
    "subreddit": "MensRights",
    "timestamp": 1489120885,
    "score": 293,
    "keyword": "american principal"
  },
  {
    "text": "How the Ford Foundation Created Women's Studies [link](http://archive.frontpagemag.com/readarticle.aspx?artid=14085)\n\n>Women’s Studies professor and feminist author Susan M. Hartmann credits the Ford Foundation with being a substantive force that created the feminist movement. In fact, Ford’s support of women’s studies and feminist causes is so extensive that it cannot be summarized in an article of this length. The subject is ripe for a full-length book. It is safe to say that without the Ford Foundation, feminism would not have been successful in gaining such a strong foothold in academia, and by extension, politics.  \n\nSee also: [The Ford Foundation and the CIA: A documented case of philanthropic collaboration](http://transmissionsmedia.com/the-ford-foundation-and-the-cia-a-documented-case-of-philanthropic-collaboration/).  \n\n>The CIA uses philanthropic foundations as the most effective conduit to channel large sums of money to Agency projects without alerting the recipients to their source. From the early 1950s to the present the CIA’s intrusion into the foundation field was and is huge. A U.S. Congressional investigation in 1976 revealed that nearly 50% of the 700 grants in the field of international activities by the principal foundations were funded by the CIA (Who Paid the Piper? The CIA and the Cultural Cold War, Frances Stonor Saunders, Granta Books, 1999, pp. 134-135). The CIA considers foundations such as Ford “The best and most plausible kind of funding cover” (Ibid, p. 135). The collaboration of respectable and prestigious foundations, according to one former CIA operative, allowed the Agency to fund “a seemingly limitless range of covert action programs affecting youth groups, labor unions, universities, publishing houses and other private institutions” (p. 135). The latter included “human rights” groups beginning in the 1950s to the present. One of the most important “private foundations” collaborating with the CIA over a significant span of time in major projects in the cultural Cold War is the Ford Foundation.\n\nEdit: someone rightly took issue with the website on which the above was published (contains some questionable links on the side bar).  So here's the CIA itself discussing the same issues, in a somewhat humorously defensive tone: \n\nhttps://www.cia.gov/library/center-for-the-study-of-intelligence/csi-publications/csi-studies/studies/vol46no1/article08.html\n\nThe data comes not from the website but from the book by academic Frances Stonor Saunders, a British historian, as well as congressional investigations.    To repeat: there is no doubt, none, nada, that CIA has used philanthropic foundations throughout its history.   The same essay was published on other [sites](https://www.ratical.org/ratville/CAH/FordFandCIA.html) as well.   \n\nFor those still skeptical, go to 26.32 in [this](https://www.youtube.com/watch?v=5CFLpZcY3ss) documentary and you'll find an actual News report by CBS from the 1970's describing the scandal of CIA using philanthropic organizations as fronts.\n\nThis is not a \"conspiracy theory\".   It is part of the documented historical record.   \n\nIn Orwell's 1984, dissident groups (represented by Emmanual Goldstein) are actually controlled by the party.   By the same token, capitalist \"philanthropic\" foundations have long attempted to steer the left in certain directions -- specifically, away from class analysis and toward identity politics and postmodernism.   Feminism is their greatest triumph.   \n\nIt's ironic that so many people blame Marx for feminism, considering that the entire purpose of funding gender and ethnic studies was to reduce the focus on class.  \n\n>\"The Women's Liberation Movement may be considered as subversive to the New Left and revolutionary movements as they have proven to be a divisive and factionalizing factor.... It could be well recommended as a counterintelligence movement to weaken the revolutionary movement.\" This was from an August, 1969 report by the head of the San Francisco FBI office.[4] Within several years, the Rockefeller and Ford Foundations were pumping millions into women's studies programs on campus.\n\nOnce again I have to stress that this is not a \"conspiracy\" since it was done out in the open, although to the extent that CIA used these foundations to disguise their involvement in domestic politics, I suppose it may qualify.   Certainly the CIA's funding of Gloria Steinem and Ms. Magazine was illegal, since CIA is prohibited from engaging in domestic counter-intelligence operations.   \n\nThere are two possibilities here: one is that the great capitalists are just really enamored with feminism.   So much so that they bankrolled the certifiable nutcase Sally Miller Gearhart, founder of the first gender studies class and promoter of male genocide.  \n\nThe other possibility is that elites aren't quite as dumb and incompetent as many assume.  They recognized the gender war as an ideal way of neutering the left by dividing and conquering the working class.   Whether by design or accident or a little of both, they have succeeded.   Pseudo-\"leftists\" today talk almost exclusively about identity politics; they alienate the white male majority by labeling them privileged oppressors; and the traditional American left -- which focussed on anti-war activism, civil rights, free speech and above all class issues -- is all but dead.",
    "title": "How the Ford Foundation Created Women's Studies",
    "subreddit": "MensRights",
    "timestamp": 1514509030,
    "score": 46,
    "keyword": "american principal"
  }
]