[
  {
    "text": "Why does America's Got Talent not have an American judge on the panel?",
    "title": "Why does America's Got Talent not have an American judge on the panel?",
    "subreddit": "AskReddit",
    "timestamp": 1498870318,
    "score": 6,
    "keyword": "american judge"
  },
  {
    "text": "A reflection on two recent interactions with other women Apologies in advance for the length of this post, but two recent interactions have left me with a rather sour taste in my mouth. I've been mulling them over and decided to post here to share and hopefully inspire some thoughtful discussion about modern-day feminism and specifically, how women treat other women.\n\n\nThe first interaction happened in a grocery store as my partner and I were shopping in preparation for a camping trip. I had just picked up two of those single-serving instant flavored oatmeal cups. An older woman and her husband passed us in the aisle, and she asked me how much those cups cost. I told her $2.00 each. She looked surprised, then even somewhat offended, and remarked that for the price of those two I could get a whole large container of Quaker's oatmeal. I laughed it off and said, \"I guess so,\" since I neither felt the need to explain to her my preference of oatmeal nor to justify my financial decisions. She then proceeded to turn to my boyfriend, scowled, and said, \"And you're going to marry her?\", her words dripping with judgment. While both my boyfriend and I were too stunned to reply, she huffed off and disappeared to the next aisle. \n\n\nI was honestly so taken aback by the whole interaction that I couldn't even begin to put into words what about it disturbed me the most. Was it the way she spoke to me, so condescending and superior? Was it the way she judged my worth as a woman by how financially sound my shopping decisions were? Was it the fact that she, a stranger, knew nothing of my circumstances and yet felt the need to intrude with her opinion (about the most mundane of topics - *oatmeal* - no less)? Was it how she insinuated that I was not marriage material (or even that marriage was my goal) because of my choice of dried goods? Was it the way the question was purposefully directed at my boyfriend, to put him on the spot and plant doubt into his mind as to my ability to take on the role of wife and keeper of household? Or was it the knowledge that, had I been a man, she never would have even cared what kind of oatmeal I bought? \n\n\nWhat bothered me was all of the above. And it pissed me off to no small extent. I realize that this woman was raised in another time, when women took home ec classes and the role of wife and then mother were perhaps the most important and defining things about a woman. She was  (and this is giving her the benefit of the doubt) not trying to be a bitch, but rather just a product of the society that shaped her. So maybe age was her excuse.\n\n\nWhich brings me to the next encounter at IHOP. I'm sure most Americans have been, but for the uninitiated, IHOP is one of those restaurants where you eat and then pay up front. My boyfriend and I went up to the hostess, a young woman in her early 20s, to pay our bill. I asked if it wouldn't be too much of a hassle for her to split the tab. She plucked my boyfriend's credit card from his hand and told me, \"Girl, why do you want to pay? He's the man; let him pay.\" I calmly told her that I would prefer to pay for half and waited patiently until she took my card as well. She shook her head at me and said, \"Paying is his job, girl. You let him go broke.\" \n\n\nSo apparently, it offends some people's very existence that I don't take advantage of my sex and have men pay for my meal. Let me repeat that. *It offends some people when a woman pays for her own meal.* The problem with the hostess's mindset is that she's the type that wants to be an \"independent woman\" but also wants to be financially spoiled by her man, which not only makes things very confusing for the opposite sex but also basically relinquishes her right to be treated equally and fairly by the very nature of the request. \n\n\nThe forces against feminism take many forms, not least of which are other women. The days of blatant sexism in daily interaction have in large part been replaced by smaller, often unnoticed aggressions -- perhaps a judging glance, a snide remark, or an ignorant question. To clarify, most of the time there is no malice, but just a general thoughtlessness with respect to treating women as equals to men. And women are often as guilty of perpetuating these as men are.",
    "title": "A reflection on two recent interactions with other women",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1500427459,
    "score": 32,
    "keyword": "american judge"
  },
  {
    "text": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear. Hi everyone. I don't really have anyone to bare my heart to right now. I want to send this out to the universe and see what comes back. I would love to hear your perspectives.. whatever corner of the world you're in.. whatever life path you've walked. I really appreciate all your voices and Reddit so so much. I'll try to keep it condensed and simple. \n\nI dated a narcissist for eight months. He was incredibly cruel and selfish but hooked me with rare very special moments of revealing a deeply hurt.. damaged.. wholesome.. helplessly pure childlike heart. He would verbally and emotionally abuse me but sometimes with time, he would realize how hurtful or selfish his actions were. With sincere tears in his eyes he would apologize and express that he's learning and wants to change.. express that his cruel actions and words are purely from ignorance because even his own mother never showed him any love, open-heartedness, gentleness, morals. \n\nIt doesn't come as a surprise.. he experienced a horribly abusive heartbreaking childhood. He used that excuse almost always. And being an empath.. my heart opened and poured for him, I wanted to love him more. Help him see all women aren't money hungry and out to lie and cheat. Show him it's okay to open and be vulnerable. My upbringing wasn't perfect either. I honestly felt we were both \"breaking\" our cycles of hurt from the abuse and neglect our parents created. (My family was very poor growing up and my father abandoned my mother, sister and I when I was 12.) He always said such amazing things about growing old together.. building character through experience.. being there for eachother.. building a life and family together that's strong and confident (him) but sensitive giving and loving (me). He would say I am the best person he's ever met with character he values most above anything. That I have changed his life forever in all aspects of his life.. work. And I was learning a lot about patience, understanding, and forgiveness. No relationship is flawless and flatlined. I appreciate and value rolling with the punches of life. Struggle is what makes you grow.. its what broadens and builds your mind and heart, I love that. And I love the idea of a life partner who is down to walk the sometimes mountainous path of life with you. I appreciate open-mindedness and the will to adapt. Effort is so beautiful. Anyway.. I honestly believed we could awaken together.. Live more and more with awareness.. and mindfulness.. and learn together. But I was wrong. He would do things like tell me his ex was exceptionally beautiful.. she was a professional model.. but I'm pretty. His other ex is very smart. But I'm definitely not smart. I'm talented and creative. But not smart because my brain is not wired to be a coder or engineer. This is one of the most painful parts. I stayed with a man who fought me and defended himself for the right to call me stupid.. many times. He would tell me my problems are trivial.. that he doesn't care about my pleasure.. several times he would fuck me and just roll over. I would silently cry in the dark and masturbate next to him as he snored. We fought so many times about our sex life. It was always selfish and only about him. There were times I would be very ill or very drunk and he would just go ahead and fuck me.. even when I'm barely conscious. I would just lie there in the fetal position. He said that was one of the great things about me.. \"I never left him wanting.\" He was so proud that he's slept with 120 women. He told me I was the first one he gave eye contact with when having sex. And he said he typically didn't kiss the girls he'd sleep with. That I have no idea how much he's changed. I brought this up so many times.. that I want to make love.. sex should be us sharing how we feel physically.. it's about both of us..and he just didn't care. He would say sometimes sex is just carnal and sometimes he needs to be a man and take it. It's just about him. I never once orgasmed in the 8 months we dated. He never tried. It was always for him. He went down on me maybe 3 times in 8 months. He blamed it on me. He said some women aren't confident or comfortable orgasming in front of people. He would say some girls orgasmed as soon as he put his dick in them. Typing this out I know it sounds fucking heartbreaking and pathetic. I know. If I heard all this from my sister or if my future daughter were telling me all this... I would be utterly mortified and devastated for them. Sometimes it's very hard to see unobstructed reality when you're struggling in the middle of everything. He would fall asleep after I drove 22 miles to talk about how he's hurt me as I am crying next to him in his bed. He once dropped me on the side of the road with all my luggage to take an uber home after a road trip when I said I wanted to go back to my apartment, not his. \n\nHe has a very unhealthy relationship with sex. He was once over 500 pounds but with sheer will.. starving and lifting he lost 230lbs. From age 30 to 35 he overcompensated by \"fucking and conquering as many women as possible doing whatever it takes to make them comfortable\" His greatest fantasy is rape. He would often tell me his greatest \"id\" fantasy is to kick down a door like a Viking and violently rape a wife as his defenseless smaller frightened husband is forced to watch in horror. (My ex is 6'5) He used to \"jokingly\" say rape victims often orgasm because in a subconscious level they loved it. He would joke and say 50 shades of grey is about him.. and there's a reason why that franchise is insanely popular. Women love and want to be raped on a cave man level. He absolutely lovess the new Westworld for how brutal and fetishized rape, pleasures, violence, dominance, and indulgence is. He would often say when he looks around and thinks about it.. his character and life is similar to most leaders. The greatest leaders he knows arent emotional, overly caring, sensitive, \"squishy\" or giving. Superstar singers.. athletes.. businessmen like Steve jobs.. world famous video game designers.. they all have one thing in common. They \"lick the earth\" as he would put it.. and they dont hold back their id-driven desires. That is the source of their greatness and inspiration, especially as an artist. Being a sensitive \"squishy\" ..That all seemed so empty to me. \n\nHis dream is to have a line of hundreds of women waiting their turn to be fucked.. he impregnates them and doesn't take care of the babies. \"Like a Viking king\" He often said sex is a need. If he doesn't have sex in two weeks everyone starts to look like meat. He doesn't care. Men and women alike. I tried to understand the root of this manifestation. It was horrifying to hear but in all these stories.. all I saw was this nerdy obese kid who was ignored all of his life... a guy who was so ignored that he lost his virginity to a prostitute... this poor 7 year old boy who would be locked in his room for days by his horrible stepfather. His cries ignored by his cold mother to ensure her loans are paid by this new man. It all screamed suffering and heartbreak. Especially because I personally know several women who have experienced rape and I have been volunteering with The Rape Foundation for several years. I really tried not to judge. How can you.. life is crazy and sometimes devastating and sometimes you dealt difficult cards.. like your parents. And humans are capable of such cruelty.. a lot of times they genuinely think they're doing the right thing. We also got into many painful fights about his views on having children and marriage. He said he would absolutely test the blood of his babies. That was a deal breaker. I would explain how hurtful that is. He would say its not about me. It's statistics. Women will lie and have men financially support children that are not theirs. (This is what his mother did to his stepfather. When his stepfather found out. He began to abuse my ex from a very young age.) He also said 80% of women initiate divorce for the payday. So if marriage was a deal breaker he would consider \"many types of arrangements\" with the help of his lawyers. \n\nAnyway.. 8 months we dated. He made me cry 1-3 times a week. But when things were good we were both adventurous.. incredibly playful.. tender.. driven.. and affectionate. We both love similar music and movies. He would sing to me.. we loved going on long drives and talking about life.. this existence.. our hopes and dreams. We are both class clowns. But one thing was rawly clear. We were cut from different cloths. He's a big tall trump loving white guy from Texas who always lived in a big house.. no student loans.. went to art school.. atheist.. first job was after college for a video game company.. etc. I'm a Korean American from the east coast who was raised by a struggling single immigrant mother.. have had at least one job since high school.. lived in my car in NYC.. put myself through college thus have student debt (this was a big issue for us.. he said for him to even consider marrying me.. I would have to get rid of my debt. I'm the first one in my family to go to college).. insatiably curious about spirituality.. religions.. philosophy, the human condition. I am such a sensitive giving tender hopeless romantic easily hurt squishy. And he's just a confident iron fist, force. His mother and the rest of his family believe vulnerability and feelings equal weakness. A few times he was very vulnurable and shared how when he get married and starts a family, he plans to stay away from his family because they are all a very certain way. \"poverty mentality\" is what he would call it. He would share how his mom never cared.. and still doesnt care about his problems when he tries to open up to her. One time when he dumped me he said.. his mother is so strong she has never cried ever in his life. And I cry all the time. He would resent her for her hard coldness but I don't think he's aware of how attached and proud he is of her. He'd laugh and say \"my mom is a tempest. Shes the boss of the house, what she says goes, she gets her way, she's dominant she's fierce. She's a force.\" He would express how the other girlfriends he introduced to his mom were shredded apart and would end in tears going up against such an intimidating woman. I see right thru all that. His mom holds a tremendous amount of guilt. He never once talked to her about how her abandoned him while his step father would abuse him and lock him up. For days he would sleep on a bare mattress.. starve..  and go to the bathroom in the room. He said he became obese because of this feeling of having absolutely no control and not knowing when he'll eat again. It's so heartbreaking. When he got older his step dad and mom sent him away to a military school for delinquent kids. He would be locked in his dorm for days as well. He would beat kids up and created a group of friends that he \"protected\". Multiple times he told me about a very feminine kid who would massage him in exchange for his protection. My ex would explain if they locked him up in his dorm for a few more weeks he would have absolutely fucked that feminine kid. My gut tells me he did a lot at that school that he'll probably never tell anyone. \n\nI see thru all this. He and his mom have taught eachother to pretend like nothing happened. This is their way of comforting eachother.. pretending like it went away. As a woman.. as a super sensitive aware woman.. I know she's holding a lot of guilt and sadness. She's created such a tough persona she can't get herself to let it out. People will live a lifetime running from feeling. \n\nMy ex is incredibly charismatic to his coworkers and he's loved and well known at work. Many shy guys at his video game company idolize him and his ability to sleep with many women. He's this fearless jokester who is \"untouchable\". He is very proud of the fact that he hit the \"jackpot\" being born a tall white confident man. He has absolutely no one he's responsible for except for himself. Im very close to my mother and sister and when my parents divorced I pretty much stepped up and felt responsible for keeping the three of us together. Since high school I started to help financially support our family. He couldn't understand that. He'd simply say it's very good of me. \n\nAnyway..\nWe are such opposites and we knew this from day one. I was WAY too giving. I paid for amazing vacations because he had never snowboarded.. snowboarding was my life from middle school to college. I always drove to his place in Santa Monica (22 miles away from my place and my work.) I always planned amazing adventures.. things he's never done in LA. He surprised me with a candle lit dinner once. The first three times we ever went out to dinner was my idea and I treated him. He used to say I am the balance and light that will melt the ice and softened the thorns around his heart. I remember one time he was just in awe. He didn't own any plates or cups so we went to target and I got him some essentials. He said he had never been treated or cared like this. In the beginning, he did hand draw me pictures of me which was really touching. He had flowers sent to my work. Once after we fought and once after I stayed with him while he got a gal stone removed. He used to say he had never spent money like this for anyone. He used to never even buy girls drinks before taking them home. So many times I told him. I don't care about the money spent. Pick a dandelion for me. Let's share a mcdonalds apple pie on the beach. It's the thought care and effort that is so special. He just never got it. \n\nHonestly as the days pass and I continue to practice Shambhala meditation, contemplation and mindfulness.. I see I was YEARNING for that strong eternal male energy love... the love of an unconditionally loving caring father that I never had. He broke my heart 1-3 times a week for 8 months, honestly my heart and gut knew it was very wrong. But my yearning to fall in love.. to GIVE the love I hope to receive.. and the yearning to settle down blinded me. I gave the love that I wish to receive. Even though my ex didn't deserve it. The biggest lesson I am walking away with is why did I stay for so long. That's where I am going to learn and grow from. That's where my self love needs to focus on. Believing in someone.. believing in hope.. believing in good and forgiveness are all wonderful things but there needs to be an unbreakable boundary where my self respect and self worth isn't brutalized. And I need to have self love and strength to walk away. For good. Even when they're crying, apologizing, explaining, or making the most beautiful promises. \n\nThe very last week we spoke. I texted him in the morning after fighting the night before. He bit my head off about bothering him at work. I went silent after that. After several hours he emailed me explaining he fucked up and when he gets emotionally overwhelmed he doesn't know how to deal. He said he loved me.. loved what we've built.. that I am a ray of sunshine he has been able to capture and he will never give up. He said he was going to come over that night to fix things. \n\nI was so exhausted and broken.. I couldn't get myself to respond. I just didn't get it. Me caring.. me reaching out being affectionate.. texting him to see if he's okay.. all of that to him was nothing but an annoyance and a horrible burden. If you have so many excuses against it.. and so much aggression and aversion against it... why be in it? How can I apologize and be sorry for burdening you with my affection? Poisoning your life with my love? \n\nAfter getting no response for 5 hours he texted me. \"Actually I'm not coming tonight. I'm seeing other people.\" That was it. After a few days. I emailed him a couple times that I deserve a proper phone call break up. He unblocked my number and finally called me. Immediately he just unloaded his anger. He blamed everything on me. He said I have a personality disorder and as my friend he was begging me to get help. That everything was in my head and that I cry for no reason. He said he knew from the first week of dating that I was the problem but he felt bad for me and was tired of hopping from one girl to another so he stayed with me for 8 months. He said he is tall.. confident and white.. he makes a shit ton of money and he loves his life. He said \"I simply have TOO MANY choices.. our connection wasn't special at all and I will love again\" He said he had already fucked someone new and she is \"very sweet\". He went on a date with someone and \"she is fucking awesome\". I stayed on the phone as he said every single thing a hurt desperate person would say to try to convince himself that's he's okay.. he's in control.. he's not hurt.. and he's right and strong. \n\nWe often talked about the five love languages. He always said he only needs physical touch. And I need all five which he thought was crazy. I stayed on the phone with him as he described all the reasons why this new stranger he slept with was better than me. How her only love language is touch as well. He emailed me on Monday saying he will never give up, and by Thursday he had slept with someone new. As I listened to all this.. it finally clicked in my heart. That was it. All the hope and forgiveness and empty promises broke in me. He finally cut the remaining karmic tie between us. This was never about me. I was never going to make this guy happy and we were never going to work. All this horrible cruelty he was yelling into the phone... was his internal dialogue convincing himself that he is right, he is okay, he not hurt, he is not responsible. Having no control.. or being accountable for selfish hurtful actions causes him to lash out. He has such a fear of feeling things.. of getting hurt.. or having no control that he rather live a surface level life and cushion himself with yes people and agreeable circumstances that make his life easy and unchallenging in anyway. Control everything.\n\nThat, believe it or not is the shortish summary of my last 10 months. There are so many other examples and details but I have a feeling you guys get the picture. \n\nSo here I am today. It's been an up and down road to healing. Today my close friend sent me articles on the toxic relationship between empaths and narcissists. I am SHOCKED how accurate and to the T these articles capture our relationship. Our relationship was EXACTLY like how these articles explain it. Honestly... I wish fate would send these articles to him.. I even contemplated having my fiend or my sister email them to him. Is it wrong of me to care about his happiness and growth? Care about him opening his eyes to the destruction he's creating? Is it wrong of me that I don't violently hate him? I feel sad FOR him. I feel no need for relief by cursing him and saying cruel things. I have no need to fill any voids by sleeping with people and saying \"OH I am SO over him. OH he was horrible and I can do better.\" Life is vast and life is crazy. How can I condemn and judge anyone? That's just not me. You can't control certain cards you're dealt... like your upbringing. But you DO have the choice in how you live on from these experiences. That is what I do choose to examine. I wish him bravery and strength.. I wish that for anybody and everybody. I wish that for myself too! I'm working on it everyday. Strength to see myself and life without any veils. See my actions without any self deception. (Deception like cushioning your ego.. focusing on blame which is so empty and pointless.) Fear from not knowing what's gonna happen.. fear of having no control.. it's instinct to protect yourself. Your ego will protect itself with all kinds of destructive momentary relief (empty sex, alcohol, saying mean things to people and putting others down, etc.) I wanna see things for what they truly are. Be brave enough and have the wisdom to walk away when you know it's wrong and not meant for you. \n\nIs it wrong of me to hope that he'll learn the true root of happiness? It's not money or sex with hundreds of beautiful women. Or telling yourself how confident and awesome you are. How many people know you. (From the years of isolation.. all he did is draw alone in his room. Now he is a somewhat well known video game artist and director at a major video game company in LA.)\n\nLiving a full life is about living awake.. how much you open yourself to the world. How much you give and share. Vulnerability is true bravery and strength. Not cushioning your life with ease and agreeableness. But I realized.. who am I to force a lesson on anyone. Who am I to \"make\" someone wake up or realize things. Even if he were to have a.. \"shit.. now I see\" moment.. it takes consistent drive and desire to be awake and mindful... it takes time to change your habits. I just wanted to know what you guys think. Thank you for reading. I may be hurt and heartbroken but I am SO thankful for this experience. I think these lessons have really opened my eyes and I'm coming out stronger and a lot wiser. You definitely can be too open... too giving.. and too forgiving. \n\nhttps://dailyoccupation.com/2017/03/14/toxic-attraction-empath-narcissist/\n\nhttps://www.psychologytoday.com/blog/sense-and-sensitivity/201201/the-highly-sensitive-person-and-the-narcissist?amp\n\nAs the time passes I rawly see how completely lost I became. I lost myself and completely forgot who I am and what I'm worth. I became a deeply desperate and sad person. Everyday I yearned for the small crumbs of kindness and affection he would strategically give me.. especially in the form of verbal affirmation: telling me I'm the love of his life and he will never give up. But then check me by ogling and comment on women's bodies while we're out.. and keep me down on myself and insecure. He is truly manipulative with his words which in this world can take you far. It's rewarded. He was always very proud that he could get what he wanted.. especially with women. I also rawly see that how you treat and speak to others is a true reflection of how you treat and speak to yourself internally. If someone is so easily and freely able to be sooo mean and cruel to another living breathing FEELING human.. how is their internal dialogue with themselves and their self worth? \n\nThank you so much for the wonderful comments and messages. I cannot express how moved I am. Its even more special because we are all anonymous strangers yet we are all so interconnected in how we feel and the hardships we face. I am so thankful. I choose to take this painful experience and life lesson and continue to explore myself.. love myself... open myself to others.. and love. \n\nHe texted and emailed me a few weeks ago. He wrote:\n\nText:\nIt's been hard without you. I hope you're okay.\n\nEmail: \nIt's been hard without you. I hope you're okay. Sorry for how things went down. \n\nI couldn't respond.",
    "title": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1498231430,
    "score": 13,
    "keyword": "american judge"
  },
  {
    "text": "I've lived in Iran and in the U.S. Anti-feminists on both sides mirror (and feed off of) each other. Warning: Long post.\n\nI grew up in Iran but moved to the U.S. about a decade ago. You can say I've seen \"both sides of the coin\" as far as societal attitudes towards feminism is concerned. Here are some of my observations:\n\n* Here in the U.S. you often see people admonishing feminists for focusing on \"first-world problems,\" while women in developing countries are grappling with much more serious issues. \n\n\n    You might be surprised to know that a very similar argument is used against women's rights activists in Iran, not necessarily by the state, but by conservatives at large. Iranian feminists are told that their focus on the mandatory dress-code (including hijab), on [the right to ride bicycles in public](http://www.bbc.com/news/world-middle-east-37430493), or on [the right to enter sports stadiums](https://www.hrw.org/news/2016/06/30/banned-stadiums-being-woman-iran) is frivolous. \"What's the big deal about wearing a scarf on your head?\" \"Are you so defined by your attire that a piece of cloth is going to oppress you?\" \"You are diverting attention from real issues by focusing on getting women to stadiums.\" \"Not everyone can afford a bicycle. This is merely a middle-class issue.\"\n\n\n    Iranian women are also told they should be thankful to live in a state that keeps them safe from ISIS, because things could be a lot worse. Sound familiar?  \n\n* Statistics around issues like the wage gap, rape, and male-on-female violence have been contested over and over again in the U.S. They are called bogus, misrepresentative, and at best inconclusive. Meanwhile, statistics on mortality, longevity and well-being are used to show that American women have it better than men. \n\n\n    You'd think anti-feminists couldn't use the same argument in Iran, but they do. Longevity is similarly female-skewed in Iran ([and in most countries of the world](https://en.wikipedia.org/wiki/List_of_countries_by_life_expectancy#List_by_the_OECD_.282013.29)). So we're often asked: \"how come you live longer if you're so oppressed?\" These anti-feminists point out that [Iranian women have a higher penetration in STEM fields than American women](https://www.forbes.com/sites/amyguttman/2015/12/09/set-to-take-over-tech-70-of-irans-science-and-engineering-students-are-women/#7b9d107e44de). That Iranian women are not subject to compulsory national service, as opposed to some developed countries such as Norway. That Iranian women are [less likely to have body-image issues](http://www.npr.org/sections/goatsandsoda/2014/09/15/347083281/covering-up-with-the-hijab-may-aid-womens-body-image). In a way, we're told that we have it better than some Western women in some aspects, so we should stop being greedy about pursuing other aspects. Sound familiar? \n \n* Iran's theocratic regime has often argued that women have a natural tendency to nurture, and therefore need to stay home and take care of their children. Recently, they've discovered the fields of evolutionary/developmental psychology/biology and try to argue this point from a \"scientific\" perspective ([non-English link 1](http://webcache.googleusercontent.com/search?q=cache:iILWu2n5hOEJ:www.tebyan-zn.ir/News-Article/zanan/2010/10/10/5607.html+&cd=12&hl=en&ct=clnk&gl=us), [non-English link 2](https://www.youtube.com/watch?v=Mi0JZm_2vbc)). [Sound familiar](https://twitter.com/charlesmurray/status/837287933312909313)?\n\n* In the U.S., some people argue that family courts unfairly favor women, especially in issues related to custody and child support. You might be surprised to hear that there are similar arguments in Iran, not around custody (which almost always favors the father), but around [Mahr](https://en.wikipedia.org/wiki/Mahr). Anti-feminists have vehemently opposed and dismissed the mandatory Mahr payout as a law that disadvantages men, conveniently forgetting that the scale is tipped the other way in almost any other legal issue. \n \n* The red-piller ideology has also found its following in Iran (and other countries I imagine). I've seen an increasing number of my old college mates and friends turn to red-pill/mgtow-type communities, especially on reddit. They even have a prophet (Roosh-V, who was born to Iranian parents). You might wonder, what makes them think they're disadvantaged and oppressed by feminists, despite living in country where a woman is literally worth half a men ([+](http://iranhrdc.org/english/publications/legal-commentary/1000000261-gender-inequality-and-discrimination-the-case-of-iranian-women.html#3), [+](http://iranhrdc.org/english/publications/legal-commentary/1000000261-gender-inequality-and-discrimination-the-case-of-iranian-women.html#22))? Is the illusion of victimhood so pervasive that it can elude some of the most gender-privileged people on the planet?  \n\n* The Islamic Republic has repeatedly accused women's rights activists of being Western stooges, for defending Iranian women's right to dress as they choose. Feminists in the West are repeatedly called terrorist sympathizers for defending Muslim women's right to dress as they choose. Both arguments twist the reality and turn a very simple issue (the right to choose your attire) into a tool for geo-political conflict. \n\nI expect some of you to say: but anti-feminists in the U.S. *do* have more convincing points, seeing that their country doesn't deprive women of their most basic rights. The ridiculous rhetoric of anti-feminists in Iran doesn't undermine the fair points raised by anti-feminists in the U.S.\n\nWell I do agree that objectively and definitively, Iranian law is far\nmore backwards in terms of gender equality. But there are three points to keep in mind:\n\n1. U.S. law didn't use to be very progressive either. Progressive ideas had to be argued into the law, by people who fought for them. The law often doesn't change as long as public opinion around it doesn't start to change. In that sense, anti-feminist rhetoric in the U.S. is not as innocuous as it's made out to be. I'm sure 100 years ago when women did not have the right to vote, most people were able to rationalize it as a necessary disadvantage for women, similar to how denying women a decent maternity leave is rationalized now. \n\n2. It's always easier to judge a nation from the outside. But when you live inside a country, you are exposed to the nuances and complexities of social issues, and might lose sight of the big picture. For instance, a Swedish citizen might view the U.S. as remarkably backwards in terms of gender equality, when it comes to access to abortion and affordable healthcare, violence against women, representation in politics, etc. But to some people living in the U.S. the issue is not \"so black and white\" (to use a phrase so cherished by anti-feminists). Iranian anti-feminists use the same argument (\"it's not as black and white as the West would like to portray\") to justify their incredibly backwards ideas. Sometimes it's good to take a step back to look at the big picture. \n\n3. The Iranian regime has learned to play the Westerners' rhetorical game really well. For instance: studies [have shown](https://www.theguardian.com/education/2009/mar/18/secondary-schools-girls-gcse-results) that girls perform better if they study in gender-segregated schools. The Iranian regime has flaunted these statistics in defending its segregation policies, *as if they segregated schools to help girls succeed.* This type of hypocrisy can be illuminating when inequality (in any context) is discussed: **It's not enough when things work out. Things have to work out** ***for the right reasons.***\n\nIn conclusion, I think it's important to look at the global context when issues of women's rights are concerned, and it's also important to see beyond the rhetoric.",
    "title": "I've lived in Iran and in the U.S. Anti-feminists on both sides mirror (and feed off of) each other.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488838700,
    "score": 6,
    "keyword": "american judge"
  },
  {
    "text": "Experienced a ton of sexism and racism in South Korea and need to vent You'd think this was a more appropriate post for the country's sub but, having read so many ~~white men~~ people there apologize for racism, I thought the sexism aspect would at least be appropriate here. **TL:DR at the bottom.**\n\nIt's probably my fault for not reading up on the 'bad' aspects of Korean culture, but I don't know many people who look for those things before visiting a country that has a modern-looking society. Being half Asian the racism and sexism I receive from my mother's homeland is minimal and tolerable. At 5'8\" I stand out. My plain features, brown skin and lankiness draw judgement because 'mixies' are meant to be pale and have more Anglo features. My bad. \n\nAnyway, my stay in Hong Kong and Taiwan was dope. So much to see and so much good food to eat! Shopping was cheaper than back home. Nice. The last leg was South Korea, the source of my mother's beloved K-Dramas and my opportunity to see snow for the first time. What I actually experienced was the opposite of dope. \n\nIt started as I got off of the plane. By far I was the tallest woman there. I stood near the exit and three people approached from behind whispering. I turn around to face my friend and the group glances at me with an audible sigh 'oh, negro'. It was a shock to hear someone refer disdainfully, out loud, to a person as negro. I wondered if they were seeing people who had dark skin or were African (American) around. When there was no person with brown skin other than myself close by I jumped to the conclusion that they might be talking about me and judged based on my features - big lips, booty and wide-ish nose. I dismissed it as me imagining things. \n\nThe next day I was in Meyongdong, a big tourist area, near my hotel. We rushed about and it was packed with stylish people and all the cheap makeup and street food we wanted. As I got bored I tuned in to the crowd around me. So, FYI, the locals LOVE to stare and make comments about foreigners in Hangul, and if they really want to speak their mind a descriptor or two in English as you walk by. By the time I made it back to the hotel I'd been called Japanese (called, not asked) and Chinese and Americano (anyone who can speak English) and... ni**er, once. I saw an African family on a train later with such miserable looks on their faces that I wondered if they were getting the same treatment.  \n\nNow sexism and internalized-mysogyny. Going in I knew Korea has impossibly high beauty standards and I was not exempt from judgement; not that I could hide given I was taller than most people as well as having brown skin. I believe women did not like that I was tall and thin as that is a huge ideal and the vast majority are smaller than 5'8\". Two other girlfriends who were with me have typical Asian height and features and were mostly ignored. Men especially didn't like that I was tall. Contrary to reports, Korean men did not appear any taller to me than other Asian men. So while women laughed as I walked by and grabbed their boyfriends to drag them further away, men got aggressive, like intentional shoves in crowds and 'tch-ing' as they would walk past. Old men turned around after seeing me as I approached. If I stood next to them in a crowd they'd move elsewhere. A kid walked by and called me a giant monster as his parents smirked. It was bewildering how frequent and constant this behavior was. Almost everyone I walked past was laughing or giving dirty looks. Even people some distance away. Christ. By the end of my 2nd day I tired of what was happening and concluded this was top of the range sexism and racism. [I Googled this shit and found that I wasn't alone and the issue is swept under the rug.](http://ireport.cnn.com/docs/DOC-1221602) [Open discrimination is not legislated against and foreigners complaints are dismissed](http://www.koreaobserver.com/nearly-all-foreigners-victim-of-discrimination-in-seoul-29001/). Great. Also found out that speaking English when not white invites scorn for being a snob and 'better' than Koreans, which they mocked me for too. Another layer of bullshit to deal with.\n\nOn the 4th day I had enough and stayed in my hotel. It was great tbh, but my travel companions who had typical Asian appearances thought I was crazy. I was fine with watching action movies all day instead of looking at the ground to try in an attempt to hide myself.\n\nBy the 7th day I was willing to face the music and go on the DMZ tour, which was amazing, then I had dinner and it was back to the bullshit. I decided to go out for the remaining couple of days anyway as I had recharged my spirit staying in the hotel and wanted to see what I could, which was a bad decision. I only remembered Gangnam was the capital of superficiality once I saw all the plastic surgery ads in the train station. Walking around there the laughs were louder and the men yelling 'You're a big girl!' was just enough evidence for my friends to start believing me. \n\nBy the end I was emotionally worn down. I was happy my flight was early morning but the abuse from other Korean travelers continued until I got off the plane in Singapore. The biggest irony was sitting in the departure lounge as a Korean woman walked past with a bag that said 'RACISM' with a cross through it. If I weren't so demoralized I would've laughed. \n\n**TL:DR - Beware of rampant, open, sexism and racism in Korea, and by all means do not be brown, tall and female. People defend Korea's nationalist monoculture and say 'you just have to deal with it' but you'd think there'd at least be some tiny courtesy to keep the racist and sexist comments quieter. Even sadder is that it's being taught to children. I don't hate Korea, it's a beautiful country, but I wish their culture did not foster so much ignorance. For *anyone* visiting there you'll need something tougher than thick skin.**",
    "title": "Experienced a ton of sexism and racism in South Korea and need to vent",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1484496487,
    "score": 2,
    "keyword": "american judge"
  },
  {
    "text": "Hijab and Black Lives Matter: white in-laws pissed... advice? Long time lurker on this sub. Not sure if this is the best place for this, but I've seen other posts with great advice from this sub and you guys have already been very helpful. Black Lives Matter and wearing a hijab are two issues affecting women across the country, and the big women's march on Washington (and across the world!!) was SO INSPIRING. As a young woman, these issues and many more are affecting me every day. I have a daughter, and I want to be part of the movement that makes the future BETTER for the next generation to come. \n\n----\n\nI just moved in with my white, Italian-American in-laws who think of themselves as totally-not-racist individuals. (Spoiler alert, they are racists.) \n\n\nThey are Trump supporters, support the Mexican wall, support the travel ban aka Muslim ban, and more. But this isn't about \"politics\" this is about morality. I am not a democrat. They often vote democrat. We are not pushing political party agendas here. When you inquire further- and don't let them get away with vague phrases but push for them to say what they really mean- they can say some real doozies. Like that \"white people/culture is inherently better.\" Or that they \"don't want to help those in need if it takes away from our own kind.\" Although they'd never word it that way by their own choice, they admit these thoughts when backed into a corner. And yes they did use those exact words when you make them face it. \n\n\nI'm much more progressive and liberal, myself. (Surprise!) But they ARE open to having some passionate debates with me. They think I'm smart, thoughtful and kind and will occasionally concede their point to me. We've been going at it since the inauguration, right around the time I moved in. They secretly love the arguing and so do I, but I'm still deeply concerned. \n\n\nWhen we discuss these issues, I genuinely hope to bring new information to the table to change their minds and sometimes I do. (Yay!) We all can influence our social circles no matter how big or small the impact may be. \n\n\nAnyway. Today I got a Black Lives Matter t-shirt in the mail. I needed an oversized t-shirt to wear with my new leggings, and I knew this would be a conversation starter. I often wear t-shirts about my beliefs (like \"some chicks marry chicks\" which they have no issue with.) First thing out of their mouths before I even tried it on were: \"Why would you wear this, you're a white girl. You're not even dating a black guy.\" And of course, \"All lives matter.\" \n\n\nWe discussed it at length today and I told them tomorrow I am going to wear this shirt at dinner (I'm making dinner that night), and ALSO a hijab. (There is an invitation for people to try the hijab for a day in solidarity with acceptance of other cultures, although, I still will criticize religion and oppression don't get me wrong, but this is about tolerance.)\n\nThey are so upset. Don't worry, they also love it. We are very respectful on both sides. Like I said, on a certain level they enjoy being challenged. I'm not in any danger, and I won't lose my home or anything like that. But they did say that they wouldn't eat dinner at the same table as me if I wore either item. My plan is to let them sit while I stand in the kitchen, however, I know they will invite me to join as well and then they will stay too. At least, I think they still will, we are just going to get into some heavy (good) conversation. I hope I can encourage them to open their world view. \n\n\n**So, this is why I need your help... can you please help \"prep\" me for some common questions/rebuttals etc. about BLM, and \"anything related to a hijab\" which could honestly be anything from left field considering they aren't super informed on these issues despite having their strong opinions.**\n\n\n(Another example, TRIGGER WARNING RAPE, my mother in law was on a jury back in the day for an alleged rape, and the jury --and judge!-- forced the alleged victim to remove her hijab to testify so they could \"better tell if she's lying\".) \n\n\nI have a decent grasp on the basics, but I want to bolster my \"ammunition\" of statistics, articles sources, examples, memes, etc. They have this idea that the black community, and pretty much any minority, hasn't contributed anything as a whole \"like us whites.\" They say, \"how come on the news it's always blacks and immigrants committing crimes and killing one another.\" \n\n\nTHE FACT THAT THEY DO NOT SEE THEMSELVES AS RACIST IS THE MOST DANGEROUS, CONCERNING PART TO ME.\n\n\nThank you in advance, fellow women. And men. And non binary folks. You all rock my world. \n\n\n**Tl;dr: Please help me handle black lives matter and racist issues in general tomorrow at dinner with my in laws. Thank you!**",
    "title": "Hijab and Black Lives Matter: white in-laws pissed... advice?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1486083534,
    "score": 0,
    "keyword": "american judge"
  },
  {
    "text": "Action Opportunity: Grace deserved love. What she got instead was unspeakable. Please, protect all foster children TO:\n\nscheduling@hhs.gov; AskDOJ@usdoj.gov; OCRMail@hhs.gov; Daniel.Levinson@oig.hhs.gov; contact@gao.gov; debra.murphy2@usdoj.gov; reform@mail.house.gov; referrals@usccr.gov; fraudnet@gao.gov; cidhoea@oas.org; spcim@oas.org; rcelorio@oas.org; lel1@cdc.gov; knw9@cdc.gov; petitions@ohchr.org; InfoDesk@ohchr.org; civilsociety@ohchr.org;\n\nSUBJECT:\n\nGrace deserved love. What she got instead was unspeakable. Please, protect all foster children\n\nBODY:\n\nScheduling for HHS Secretary Sylvia Mathews Burwell, VAWA Civil Rights, USDOJ, USDOJ-OCR, HHS-OCR, HHS-OIG including Inspector General Daniel Levinson, USDOJ-OVW, GAO including fraudnet, Debra Murphey at DOJ, US House Reform, US Civil Rights Commission, US House Reform, Organization of American States, Inter American Commission on Women and Rapporteur on the Rights of Women (and Gender Equality), CDC Office of Minority Health and Health Equity, Petitions Team, Office of the High Commissioner for Human Rights, United Nations,\n\nThank you for your service to our nation, to the Organization of American States, and to the United Nations respectively.\n\n> A woman charged with killing her adoptive daughter last year worked as an \"adoption supervisor\" for Northampton County before being suspended in 2010, and throughout that time also took in several foster children, authorities said Monday.\n\n> Sara Packer, the adoptive mother of 14-year-old Grace Packer, is charged in Bucks County along with Jacob Sullivan, Sara Packer's boyfriend, in the brutal death of the teen who had been reported missing last summer. Prosecutors said Packer and Sullivan acted out a rape and murder fantasy when they killed her in Richland Township last summer and dismembered her body. \n\n> Woman charged in killing, dismemberment of daughter worked for Norco child services, had foster kids \n\n> http://www.mcall.com/news/breaking/mc-pa-grace-packer-murder-dismemberment-northampton-county-20170109-story.html\n\nPlease recall that federal law under Title IV-E to which states agences are contractors:\n\n> (10) provides for the establishment or designation of a State authority or authorities which shall be responsible for establishing and maintaining standards for foster family homes and child care institutions which are reasonably in accord with recommended standards of national organizations concerned with standards for such institutions or homes, including standards related to admission policies, safety, sanitation, and protection of civil rights, provides that the standards so established shall be applied by the State to any foster family home or child care institution receiving funds under this part or part B of this subchapter, and provides that a waiver of any such standard may be made only on a case-by-case basis for non-safety standards (as determined by the State) in relative foster family homes for specific children in care;\n\n> https://www.law.cornell.edu/uscode/text/42/671\n\nPlease also recall the pattern of a pattern or practice of various state Title IV-E agencies,inclining those Los Angeles County, Oregon, Texas, and Massachusetts, to fail absolutely and completely to protect the safety and civil rights of children under the plan. In Texas, US District Judge Janice Jack wrote:\n\n> rape, abuse, psychotropic medication, and instability are the norm,\n\n> THERES LITTLE OUTRAGE FOR 12,000 KIDS SUFFERING IN THE TEXAS FOSTER CARE SYSTEM BY CRAIG MALISOW, TUESDAY, FEBRUARY 16, 2016 \n> http://www.houstonpress.com/news/there-s-little-outrage-for-12-000-kids-suffering-in-the-texas-foster-care-system-8161341\n\nI do not accept that these monsters were properly vetted to ensure the \"safety, sanitation, and protection of civil rights\" of Grace and their other foster children. Rather, her horrific abuse and murder, I believe may be more likely to be a foreseeable grave harm which may be caused by:\n\n> Gross negligence is a conscious and voluntary disregard of the need to use reasonable care, which is likely to cause foreseeable grave injury or harm to persons, property, or both. It is conduct that is extreme when compared with ordinary Negligence, which is a mere failure to exercise reasonable care.\n\n> http://legal-dictionary.thefreedictionary.com/gross+negligence\n\nI ask HHS, HHS-OIG, and HHS-OCR to faithfully execute federal law, and to ensure  the \"safety, sanitation, and protection of civil rights\" of Grace and their other foster children.\n\nTo the extent that agencies have consistently failed to faithfully execute federal law, the General Accounting Office is tasked with investigating and properly informing Congress.\n\nTo the extent that children continue to suffer for years, and no one actually helps them, this apparent pattern or practice of federally funded child abuse, becomes a human rights violation under the jurisdiction of the Organization of American States and the United Nations.\n\nI ask that you remember Grace, and the other children like her, and act with a foundation of righteousness and justice.\n\nI ask each of you to recognize your authorities and jurisdictions. Every official is under orders from higher up, and the higher officials look up to their superiors. I ask each of you to recognize your duties to direct the officials who work for you, are contracted by you, or who answer to you, and ask that each of you faithfully execute the duties of your office to the best of your ability.",
    "title": "Action Opportunity: Grace deserved love. What she got instead was unspeakable. Please, protect all foster children",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1484013322,
    "score": 0,
    "keyword": "american judge"
  },
  {
    "text": "Why I Teach History (7th grade) Im pretty routinely asked why I bother teaching.  Specifically, people almost always ask why I chose to teach Middle School History.  After all, it is in the past and the kids dont really care any way.  To try and get to the bottom of that question, I gave an alternative prompt on our most recent large test.  It was inspired but stories from a long-time family friends favorite teacher.  The kids, if they wanted to, could write about What they learned in 7th Grade World History.  This isnt supposed to be a humblebrag or back-patting session.  I was just so amazed by what some of my students wrote that I want to share it with all of you.  This is why teachers teach.\n\n\n\n**What I learned in 7th Grade World History  By an anonymous student who has been quiet all year.**\n\n\n   I learned a lot more in 7th grade history than just numbers and dates.  I learned how to think deeper about things, I learned more about why you shouldnt judge someone by their race, and I learned that history happens all the time.\n\n\n   In 7th grade history, I learned to think deeper.  In the past, I never really thought about the meaning of some of the holidays or why history matters, but now I know that they actually have an important meaning.  Ive also been way more interested in history.  I want to know about everything, especially when my parents are talking about stuff.\n\n\n   I learned a lot more about why people shouldnt judge others by the color of their skin.  I learned that it is about more than because its racist and wrong, its also because were all equal.  No one is superior.  Some may think the Europeans are better and smarter than the Meso-Americans but thats not true because the Meso-Americans also have amazing buildings and creations, such as temples and floating gardens.\n\n\n   History happens all the time.  I used to think that history was just people that changed the world but history also happens in my own life. History is being made everyday, even when we dont know that it is.  There are also different types of history, such as personal history, world history, and even Internet history.  We probably see a piece of history everyday and we dont even know it.\n\n\n   In 7th grade history, Ive learned that you should think deeper, dont judge people by their looks, and history is being made everyday.  History is importance because it teaches us what to do and what not do do.  It shows up past mistakes so we know to not repeat them.  Therefore, I have a lot more in 7th grade history than just dates\n\n\n\n**What I learned in 7th Grade World History  By an anonymous student who now comes during break to talk about history.**\n\n7th grade World History was one of the most importance experiences of my life.  This class taught me many things that I will remember forever.  It taught me how working hard has its benefits, how you should always think about things more carefully, and most importantly, it taught me one of the most important concepts that everyone should learn.\n\nIn this class, the teacher would always push us to do better and always made sure we were doing our best work.  At the beginning of the school year, I found this annoying because I didnt think I would benefit from it.  I just thought the teacher was too strict about the quality of work.  Now I realize the benefits of this.  It will help me throughout the rest of my life because most things in life, especially when you get a job, need you to do your best and work your hardest to be successful.\n\nThe teacher also taught me the importance of thinking carefully about things.  He taught me this by tricking our classes to see if we would notice he was lying.  Almost every time I fell for his tricks and this taught me to think more closely about things.  Thinking more closely about things will help my everyday life just like always working my hardest will.\n\nLastly, this class taught me about why we care about African civilizations.  This was an important lesson because it showed me how biased our opinions of West African cultures are because they are influenced by European ideas.  This concept will help me educate others on this topic because many do not realize this.  It is the most important thing that I have learned so far in my school career.  Many others need to learn this too.\n\nThis year in 7th grade was very important to me.  It taught me so many important lessons that I will remember forever.  It taught me the importance of thinking closely and working my hardest.  It also taught me about why our opinions on the African cultures are biased and the importance of learning and teaching their true story.  This class will help me in so many ways for years to come.\n\n\n\n\n\n**What I learned in 7th Grade World History  An Anonymous student that sent 10-20 emails to me over the last two quarters, trying to solve the question of Why we care? with no points involved.**\n\n\n\nLearning of the Meso-American and African societies is part of the seventh grade standards, but it is often not told the way it really happened.  The takeover and destruction of these civilizations probes the importance of history and the complexity of people and their actions in history.  The reasons the horrendous actions of the Europeans are still accepted are guilt and faulty reasoning, the lack of purely good and bad people, and bias/lack of enthusiasm in history today.  The repetition of these issues in other situations, even slightly, happens over and over in history and the modern day.\n\n\n\nWhen the Europeans arrived and encountered Meso American or African civilizations, they were quick to declare superiority.  Their first reaction to the confusion of the other people was to assume that they were stupid and had no culture.  When it became apparent that they could use these people to their own advantage, they decided that the best way to relieve the guilt was to make the non-Europeans inhuman.  This creates the illusion that killing and enslaving people was much less cruel than it should be, as they were not people at all.  This idea is used over and over again by thousands of people.  Essentially making the victims of evil actions into people who shouldnt be seen as victims, thus the actions are no longer evil.  It is seen in history and it is seen now, and being aware of it gives one the ability to properly understand the actions of others.\n\n\n\nThat being said, most who cover up what they are doing do not think they need to cover it up.  Most people legitimately believe that what they are doing is for the greater good, including the Europeans when doing their pillaging.  King Leopold infamously believed that what he was doing benefited the Africans.  It goes to show that humans are never purposely trying to be bad.  Even if they are aware of their cruel actions, they believe that their reasons are good and that what they are doing is just.  There is no such thing as a purely good or purely evil person.\n\n\n\nThe true story of the enslavement and slaughter of the Meso-Americans and the West Africans is often quieted or ignored for the same reasons as displayed above: guilt, excuses, and the honest belief that what the Europeans did was okay.  Without seeing every side of this incredibly complex story, one would be just as ignorant as the Europeans.  It is important to try as hard as possible to become unbiased and open-minded.  This sentiment applies to everything in life.  Surrounding oneself with diverse opinions and views of the world is the fastest way to eliminate ignorance.  One cant just listen to whoevers voice is the loudest.\n\n\n\nThe reason why we care about the Meso-American and African civilizations is complex on its own, but it connects to outside issues and the entirety of human nature.  It teaches one how to be an intelligent, less biased member of our society and most significantly, how important history is to achieve this.",
    "title": "Why I Teach History (7th grade)",
    "subreddit": "Teachers",
    "timestamp": 1496599461,
    "score": 126,
    "keyword": "american judge"
  },
  {
    "text": "[Indiana] [ELA - student teacher] - Possible ELL resource? Hey guys,\n\nSo I'm about to start my student teaching in the spring and I have a question about a possible resource I found that may help ELLs.\n\nI found a language learning website called www.italki.com and it's designed to help people learn languages from native speakers. The reason I think this website could be helpful is because it would allow students to get practice with English without feeling like they're being graded or judged. Also, it's a place that would allow them to ask questions that they might not be comfortable asking their teacher for whatever reason.\n\nSome of the features include:\na blog area where the student can type whatever they please that other users can comment on and correct\n\na question forum where the student can ask questions in either English or their native language about English or American culture and receive answers in either English or their native language \n\na tutoring feature (for a fee) that the student can get informal tutoring where they can get one on one attention\n\na teaching feature (for a fee) where they can also get one on one attention from a certified instructor\n\nThere are only 2 issues I have with using this as a resource that I would look opinions on - the first being that one of the features is that you can meet people from all over world - the point being you can skype with a 'language partner' and the student teaches their native language and their partner teaches them English - this service is free but I know you all see the problem with this - Lord knows how many creepers could get in contact with the student and I would never forgive myself is something happened because of a resource I gave them\n\nThe other problem is that I would be afraid that the student would feel like they have to use this website, that they have to use the teaching service and pay for it out of their own pocket. I want to emphasize that this is completely by choice and that I would never expect them to use it (and pay for it) if they don't want to.\n\nSo my questions are - Is it even worth mentioning?\n\nWhat if I have the students do it in class with me present so I can see what they're up to? Or perhaps have them give me their username and password so I can check their accounts from time to time?\n\nI would really appreciate any advice!",
    "title": "[Indiana] [ELA - student teacher] - Possible ELL resource?",
    "subreddit": "Teachers",
    "timestamp": 1502398075,
    "score": 1,
    "keyword": "american judge"
  },
  {
    "text": "Federal Judge Breaking Law in Her Clerkship Comment? Hey all,\n\nI am currently applying to clerkships, and I just came across this gem from Federal Judge Victoria Roberts: \"My preference is to hire clerks with ties to Detroit, to BALSA and to Just The Beginning.\" She posted this on Oscar.\n\nBALSA= Black American Law Students Association. So, she is actually saying: \"I prefer to hire black clerks.\" How is this legal? I understand how race can be looked up as a \"plus\" factor as a key to diversity, etc. But it seems highly unconstitutional/illegal for a person working in the federal government to flat out say: \"I prefer to hire black people\" for this government job. Thoughts?",
    "title": "Federal Judge Breaking Law in Her Clerkship Comment?",
    "subreddit": "LawSchool",
    "timestamp": 1500086159,
    "score": 0,
    "keyword": "american judge"
  },
  {
    "text": "Livid.... So I came back from a night out with a friend of mine. And this Uber driver mentions the rally tomorrow and how he had a busy day. Then he goes on explaining what the rally is about and that it's a white nationalist rally and there will be counter protestors there. So obviously as any sane American, I dismiss it because obviously it's horrendous. And then the uber driver is like, now you don't know what they're all about, so he can't judge them and neither can I. And I'm like whaaaaaaaa. Wtf. And then my friend who's in the car with me AGREES with the Uber driver ...  \n  \nSo I'm like.... Me judging??? WHAT!? you can't be serious. And then the Uber driver is saying how they claim they're not Nazis and so yadda. And then my friend goes, you're not listening. Because I said I was not judging them based on nothing, but on their effing ideology. And so the car ride consisted of me actually having this surreal conversation with a friend and a stranger who is literally defending white nationalism and have reversed the conversation by saying that I'm being the short sighted one.  \n  \nSo we make it to our destination and I'm livid with this friend. And he's like chastising me that when I hear conversation like that, I'm not supposed to engage it. And I'm thinking, this friend was the one that started the conversation with him and engaged him in the first place. And he realized this after I stated it. Then I say that he agreed with the fool. And then he's like, he has to worry about being deported so he always is careful with what he says. And then says I HAVE PRIVILEGE for being a citizen. .......  I call him out on his paranoia and say that what you stand for is what you stand for and there's no fear that can make someone defend white nationalism.....  And by his absurd logic, the more \"American\" thing to do was to oppose.  \n  \nAnyway, I'm livid and honestly don't want to be friends with him anymore after that. I can't believe that happened.",
    "title": "Livid....",
    "subreddit": "blackladies",
    "timestamp": 1503646084,
    "score": 49,
    "keyword": "american judge"
  },
  {
    "text": "Judge: Suspensions OK For Albany High Students Who Liked Racist Posts https://sanfrancisco.cbslocal.com/2017/11/30/judge-suspensions-ok-albany-high-students-racist-posts/\n\nSAN FRANCISCO (AP)  An East Bay school district acted properly when it suspended five students who liked or commented on racist images on another students Instagram account that included nooses drawn around the necks of a black student and coach and comparisons of African-American women and students to gorillas, a judge has ruled.\n\nThe case raised thorny questions about how strictly schools can regulate student speech and whether likes on social media should be treated similarly to the original posts.\n\nU.S. District Judge James Donato said in his decision late Wednesday the five students contributed to disruption at Albany High School in the San Francisco Bay Area.\n\nThe judge rejected arguments that the Albany Unified School District violated the students free speech rights because the offensive posts were on a private account and made off campus.\n\nDonato said the accounts followers were mainly Albany High School students. The posts pictured students and school employees and created a risk of substantial disruption at the school, the judge said.\n\nThese cases establish that students have the right to be free of online posts that denigrate their race, ethnicity or physical appearance, or threaten violence, he said. They have an equivalent right to enjoy an education in a civil, secure, and safe school environment.\n\nAn attorney for three of the students had no immediate comment. An attorney for the other two, Darryl Yorkey, said liking images does not necessarily express approval.\n\nI think the judge took an opinion that many of us do in the older generations in assuming that a like on its face is just that, I like it, I approve of it,' he said.\n\nHe said many of the students who were suspended over the images were Asian and were just trying to shock each other.\n\nTaken out of that context, it definitely looks really bad, he said. He did not immediately know whether his clients would appeal Donatos ruling.\n\nA phone message left with the school district seeking comment on the ruling was not immediately returned.\n\nA male student identified in court documents only as C.E. created the account in November 2016 and posted on it over the next several months.\n\nOne post showed a screenshot of a female African American student that she had captioned, I wanna go back to the old way.\n\nC.E. juxtaposed an image on the students post of a white man beating a black slave hung by his hands, according to Donatos ruling.\n\nSchool officials learned about the account in March. They called in mental health counselors to help calm students and contacted police over concerns references to lynching, nooses and the Ku Klux Klan in the posts could constitute threats of violence, Donato said.\n\nC.E. was suspended and later expelled. Donato upheld his discipline as well on Wednesday.\n\nBut the judge said the district went too far when it disciplined two other students. One followed the account but appeared to have done nothing else and the other commented that the account was racism solely directed at black people with an emoji of a laughing face, the judge said.\n\nThe judge overturned their suspensions.",
    "title": "Judge: Suspensions OK For Albany High Students Who Liked Racist Posts",
    "subreddit": "blackladies",
    "timestamp": 1512146276,
    "score": 28,
    "keyword": "american judge"
  },
  {
    "text": "Law schools are filled with Asian Americans. So why arent there more Asian judges?",
    "title": "Law schools are filled with Asian Americans. So why arent there more Asian judges?",
    "subreddit": "asianamerican",
    "timestamp": 1500389784,
    "score": 111,
    "keyword": "american judge"
  },
  {
    "text": "There are many Asian American attorneys, yet few are judges",
    "title": "There are many Asian American attorneys, yet few are judges",
    "subreddit": "asianamerican",
    "timestamp": 1489075176,
    "score": 78,
    "keyword": "american judge"
  },
  {
    "text": "Born and raised As-Am but I refuse to be ashamed of who I am. I'm Chinese - and China has been stereotyped as the world's sweatshop, people with weird eyes, dog eaters and other undesirable things. I also grew up an Asian American, who didn't see race until late high school, but before I could fully understand it, I went back home to China. \n\nMy mom used to microwave vegetable buns she bought from Chinatown for my lunch and I used to bring all sorts of Chinese food for lunch. It got to a point where even other Asians in class started blaming me whenever they smelled something funky. I never once assumed that the way I looked or the food I ate was weird because that's who I was, though luckily for me, nobody made a big deal out of it because I grew up in a diverse neighborhood.\n\nBut as I grew older and traveled beyond my racially diverse, lower-middle class coastal American city, I've noticed that I've slowly become the \"other\" in society. I've begun slight changes in the way people approached me, a certain coldness or strangers acting weirdly confident around me because they assumed or knew I wasn't a local.\n\nWell, I now live in China and I'm past the age where anger was my response to the world. I've accepted that this is the way things are, and all I can say is - it's made things a lot easier for me. I'm a Chinese person who speaks great English and that's who I am - no more dwelling on what my cultural identity is or how I should change who I am just so I can fit in with everyone else. I don't have to be sorry for being Chinese abroad or the fact that I speak great English in China, and I do feel sorry for anyone who doesn't agree. What's there to lose? They'll judge you anyway, do as you wish.\n\nEven though I live in China now, I am still a citizen of another country in the anglosphere, and through that I hope to retain my Westernized Asian identity to the best I can. I also hope I can make friends with other non-Asians who settle in China, but only if they show they have a basic respect of the local culture. I also hope that, through charitable organizations, I can support non-Chinese, non-Han minorities who are born and raised here but sadly isolated from the rest of our society. Is it only because of my experience as an Asian American do I understand what it means to be \"other\", and I am better because of it.\n\nI will respect you when I'm in your house, and you will too when you're in mine - but I will make no concessions regarding who I am, and that applies wherever I go. Place your two feet firmly on the ground and make the world move for you. \n\nIt's that simple.",
    "title": "Born and raised As-Am but I refuse to be ashamed of who I am.",
    "subreddit": "asianamerican",
    "timestamp": 1486668786,
    "score": 42,
    "keyword": "american judge"
  },
  {
    "text": "Mental Health. Dealing with shitty/racist stuff online So in this age it's easy to find stuff online that will outrage you, especially with the whole \"edgy culture\" and current polarized political situation right now. But I'm just curious how y'all dealing with shit online that you disagree or just find abhorrent. \n\nLike usually I stay away from this, but have yall seen YouTube comments before? Especially on videos relating to Asians it's downright vile & there's often to \"humor\" to it. Just insults, racism & punching down - esp with that whole uprising of \"alt\" ppl\n\nAn example of this is just a vid like [this.](https://youtu.be/k_Az5FCe6yc) Tell me what y'all think about this. It kinda saddens/infuriates me that the host in the vid is judging all these Asian-American comedians by just insulting their backgrounds \"You think America is bigoted against Muslims? Well India & Asia suck even more!! You are ungrateful minorities!\" and things of that nature.\n\nI usually try to stay away from vids & dark parts of the net like that where I know it'll get me mad/depressed or affect my mental health. But sometimes I get morbidly curious about this kinda stuff, look it up, and the shitty/racist nature of it all just kinda makes me hopeless. \n\nSo how do y'all deal with it? I feel like it takes a toll on my mental health and it lingers in my head for too long. Ugh, what do y'all do/think bout all this? \n\n**Tldr:** See bad/racist/bigoted stuff online (or shit I vehemently disagree with). Get mad & sad. Affects my mental health - stays in my head & thoughts too long. How do I deal with it? ^^help",
    "title": "Mental Health. Dealing with shitty/racist stuff online",
    "subreddit": "asianamerican",
    "timestamp": 1513967357,
    "score": 23,
    "keyword": "american judge"
  },
  {
    "text": "Anyone ever go back to visit your respective Asian countries and felt more at home there than in the US? Went on vacation with my family in China recently and just got back. Find myself really missing my time there, though it may just be post-vacation blues. For once in my life, I did not stand out in a crowd, everyone looked like me. I didn't feel like I was being judged, even though that's probably not the case in the US but I just *feel* differently here. I have a good job in the US though I hate my coworkers but I could see myself working in China (specifically Hong Kong). I'm hoping to go back already sometime this year.\n\n\nMaybe it's because I'm not enjoying my current job, which takes up a lot of my time. My close friends here are all white and though we've known each other for a long time, it's just different not having any Asian or Asian American friends may who have gone through the same experiences I have. \n\n\nAnyone feel similarly after visiting their roots in Asia?",
    "title": "Anyone ever go back to visit your respective Asian countries and felt more at home there than in the US?",
    "subreddit": "asianamerican",
    "timestamp": 1490114314,
    "score": 16,
    "keyword": "american judge"
  },
  {
    "text": "3 Filipina-American Journalists Discuss 'My Family's Slave' And Who Gets To Judge It",
    "title": "3 Filipina-American Journalists Discuss 'My Family's Slave' And Who Gets To Judge It",
    "subreddit": "asianamerican",
    "timestamp": 1495202492,
    "score": 17,
    "keyword": "american judge"
  },
  {
    "text": "Feminism is about equality, it's NOT a hate movement - The price of clinging to the enemy [a man] is your life. To enter into a relationship with a man who has divested himself as completely and publicly from the male role as much as possible would still be a risk. But to relate to a man who has done any less is suicide. . . . I, personally, have taken the position that I will not appear with any man publicly, where it could possibly be interpreted that we were friends.  Ti-Grace Atkinson [Ti-Grace Atkinson, Amazon Odyssey, Links Books, 1974, pp. 90, 91]\n\n- Janet Bajan, a member of the New York Radical Feminists, drew applause when she said that man hatred was a protective reaction, a survival mechanism to change the situation in favor of women.  Janet Bajan [Jurate Kazickas, Hatred of Men On Conference Agenda, syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- [Rape] is nothing more or less than a conscious process of intimidation by which all men keep all women in a state of fear.  Susan Brownmiller [Susan Brownmiller, Against Our Will: Men, Women and Rape, Secker & Warburg, 1975, p. 6]\n\n- Women have always been the primary victims of war. Women lose their husbands, their fathers, their sons in combat.  Hillary Clinton, [speech by Hillary Clinton, First Ladies Conference on Domestic Violence in San Salvador, El Salvador on Nov. 17, 1998\n\n- If life is to survive on this planet, there must be a decontamination of the Earth. I think this will be accompanied by an evolutionary process that will result in a drastic reduction of the population of males. People are afraid to say that kind of stuff anymore. Mary Daly [from a 2001 interview with What Is Enlightenment magazine [referencing] Mary Daly, Quintessence...Realizing the Archaic Future: A Radical Elemental Feminist Manifesto, Beacon Press, 1998, p. ?]\n\n- MALE:...represents a variant of or deviation from the category of female. The first males were mutants...the male sex represents a degeneration and deformity of the female.  Elizabeth Gould Davis [Elizabeth Gould Davis, The First Sex, 1971, G. P. Putnams Sons; reprinted in: Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996]\n\n- All men are scum and must die.  Clementine Ford [Twitter, @clementine_ford, Nov. 15, 2016]\n\n- All patriarchists exalt the home and family as sacred, demanding it remain inviolate from prying eyes. Men want privacy for their violations of women ... All women learn in childhood that women as a sex are mens prey. Marilyn French [Marilyn French, The War Against Women, Ballantine Books, 1992, p. 186]\n\n- The proportion of men must be reduced to and maintained at approximately 10% of the human race.  Sally Miller Gearhart [Sally Miller Gearhart, The Future - If There Is One - Is Female, in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982]\n\n- Why have any men at all?  Sally Miller Gearhart [Sally Miller Gearhart, The Future - If There Is One - Is Female, in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982, p. ?]\n\n - I have a great deal of difficulty with the idea of the ideal man. As far as Im concerned, men are the product of a damaged gene.: Germaine Greer [Germaine Greer publicly speaking at a Hilton Hotel literary lunch, promoting her book, The Change: Women, Aging and the Menopause, Knopf, 1992, p. ? -- from a news report dated Nov. 14, 1991]\n\n- Probably the only place where a man can feel really secure is in a maximum security prison, except for the imminent threat of release.  Germaine Greer [Germaine Greer, in Security, The Female Eunuch, Mcgraw-Hill, 1971, p. ?]\n\n- And if the professional rapist is to be separated from the average dominant heterosexual [male], it may be mainly a quantitative difference.  Susan Griffin [Susan Griffin, Rape: The All-American Crime, Ramparts 10, September 1971, pp. 26-35]\n\n- if this book leaves the impression that men have conspired to keep women down, that is exactly the impression I mean to convey; for I believe that men could not have succeeded as well as they have without concerted effort [Ann Jones, Women Who Kill, Ballantine, 1981, p. xvii; quoted in Peter Vronsky, Female Serial Killers: How and Why Women Become Monsters, 2007, Berkeley Books, p. 16]\n\n- I believe that women have a capacity for understanding and compassion which man structurally does not have, does not have it because he cannot have it. Hes just incapable of it.  Barbara Jordan [Barbara Jordan, speaking at a womens political symposium in Sep. 1991; quoted in Lawrence Wright, Are Men Necessary, Texas Monthly,  Feb. 1992, p. 84]\n\n- MAN:...an obsolete life form... an ordinary creature who needs to be watched...a contradictory baby-man...  original source? [Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996, p. ?]\n\n- Mens sexuality is mean and violent, and men so powerful that they can reach WITHIN women to fuck/construct us from the inside out. Satan-like, men possess women, making their wicked fantasies and desires womens own. A woman who has sex with a man, therefore, does so against her will, even if she does not feel forced. [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- I feel what they feel: man-hating, that volatile admixture of pity, contempt, disgust, **envy**, alienation, fear, and rage at men. It is hatred not only for the anonymous man who makes sucking noises on the street, not only for the rapist or the judge who acquits him, but for what the Greeks called philo-aphilos, hate in love, for the men women share their lives with--husbands, lovers, friends, fathers, brothers, sons, coworkers. [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- Man-hating marks a turning point in the movement. We have been defensive long enough. People often ask me how women can be man-haters. And I wonder, hoe can we be anything else.  Pat Mainardi [Jurate Kazickas, Hatred of Men On Conference Agenda, syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- The only way to win liberation is to make men miserable so they will have no peace until women are free. Married women invented man-hating.  Pat Mainardi [Jurate Kazickas, Hatred of Men On Conference Agenda, syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- We have a moral cause for hating men for they have taken away all our power.  Barbara Mirnoff [Jurate Kazickas, Hatred of Men On Conference Agenda, syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- I claim that rape exists any time sexual intercourse occurs when it has not been initiated by the woman, out of her own genuine affection and desire.  Robin Morgan [Robin Morgan, Going too Far: The Personal Chronicle of a Feminist - Theory and Practice: Pornography and Rape, Random House, 1974, p. ?]\n\n- ...rape is the perfected act of male sexuality in a patriarchal culture -- it is the ultimate metaphor for domination, violence, subjugation, and possession.  Robin Morgan [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Womens Liberation Movement, Vintage, 1970, p. ?]\n\n- I havent the faintest notion what possible revolutionary role white hetero-sexual men could fulfill, since they are the very embodiment of reactionary-vested-interest-power. But then, I have great difficulty examining what men in general could possibly do about all this. In addition to doing the shitwork that women have been doing for generations, possibly not exist? No, I really dont mean that. Yes, I really do. [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Womens Liberation Movement, Vintage, 1970, p. ?]\n\n- Man is but one of a million humble fertilizers. Nature intended woman to reign supreme.  Marie Petti [William M. Sweets, Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head, syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- Modern man, in his pose of superiority, is but a mere contemptible imposter, who must be subdued. Womans superiority has been scientifically established. At the beginning of organic life, woman, created man, and ruled him. He was a parasite, and a slave. At best, man is but an afterthought of nature.  Marie Petti [William M. Sweets, Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head, syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- I honestly have been reassessing the fact that I am giving care to these little future rapists, and what that says about me and my separatism. I know it is kinda going against my principles to support and care for these little f****rs. [quoted in John the Other, Feminists: demented, stunned or cultists: Why Do MRAs Keep Attacking Feminism? A Voice for Men, Jan. 2, 2012]\n\n- The male is a biological accident: the y (male) gene is an incomplete x (female) gene, that is, has an incomplete set of chromosomes. In other words, the male is an incomplete female, a walking abortion, aborted at the gene stage. To be male is to be deficient, emotionally limited; maleness is a deficiency disease and males are emotional cripples.  Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- [Males should] ...go off to the nearest friendly suicide center where they will be quickly and painlessly gassed to death.  Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- We are, as a sex, infinitely superior to men.   Elizabeth Cady Stanton (Nov. 12, 1815  Oct. 26, 1902;  feminist; suffrage leader) (USA)\n\n- Patriarchy requires violence or the subliminal threat of violence in order to maintain itself... The most dangerous situation for a woman is not an unknown man in the street, or even the enemy in wartime, but a husband or lover in the isolation of their home.  Gloria Steinem [Gloria Steinem, Revolution from Within: A Book of Self-Esteem, 1992, Little, Brown & Co., pp. 259-61]\n\n- Only men kill in anger. [from: Gerald Caplan, Battered Wives, National Review, Feb. 25, 1991]\n\n- Only when manhood is dead--and it will perish when ravaged femininity no longer sustains it--only then will we know what it is to be free.  Andrea Dworkin [Andrea Dworkin, Our Blood: Prophecies And Discourses On Sexual Politics - The Root Cause, Harper & Row, 1976]\n\n- Men love death. In everything they make, they hollow out a central place for death, let its rancid smell contaminate every dimension of whatever still survives. Men especially love murder. In art they celebrate it, and in life they commit it. They embrace murder as if life without it would be devoid of passion, meaning, and action, as if murder were solace, stilling their sobs as they mourn the emptiness and alienation of their lives. \nAndrea Dworkin [Andrea Dworkin, Why So-Called Radical Men Love and Need Pornography, in: Laura Lederer, ed., Take Back the Night, Morrow, 1980, p. 148]\n\n- ...[W]omen and men are distinct species or races ... men are biologically inferior to women; male violence is a biological inevitability; to eliminate it, one must eliminate the species/race itself ... in eliminating the biologically inferior species/race Man, the new Ubermensch Womon (prophetically foreshadowed by the lesbian separatist herself) will have the earthly dominion that is her true biological destiny. We are left to infer that the society of her creation will be good because she is good, biologically good. Andrea Dworkin, Letters From a War Zone - Take Back The Day - Biological Superiority: The Worlds Most Dangerous and Deadly Idea, 1977, Dutton Publishing, 1989, p. 146]\n\nCredit to unknown misandry for compiling these.  \n\nEdit: I wanted to add one of my replies from the comments: \n\nThese \"certain people\" include the founder of the feminist movement in the United States, the founder of the first gender studies department, the most well known figures in the second wave, and the quasi-intellectuals who developed feminist theory.\n\nFeminism is rooted in the hatred of men. That's why they've only ever looked at ways in which females are supposedly disadvantaged by the system (ergo, nothing to do with equality). \n\nThat's also why it is absurd to claim that \"feminism helps men too.\" Why would you want to help the people you consider your oppressors and class enemies?",
    "title": "Feminism is about equality, it's NOT a hate movement",
    "subreddit": "MensRights",
    "timestamp": 1486569871,
    "score": 138,
    "keyword": "american judge"
  },
  {
    "text": "Romance is dead There is a widespread misconception that women are hopeless romantics.   Turns out it's the other way around.  \n\n>So lets start with how men and women score on the most well-known measure of romanticism, the Romantic Beliefs Scale.2 This questionnaire asks people to rate the extent to which they agree with statements like, There will only be one real love for me,\" If I love someone, I know I can make the relationship work, despite any obstacles,\" and, \"The person I love will make a perfect romantic partner; he/she will be completely accepting, loving, and understanding.\n\n>The researchers who developed the scale have found that, on average, men outscore women\n\n[Source](https://www.psychologytoday.com/blog/close-encounters/201408/whos-really-more-romantic-men-or-women)\n\nAlas, the dual assaults of feminism and globalization are leaving huge numbers of men with no romantic prospects.   Why?   Because despite what feminists initially claimed, hypergamy doesn't suddenly disappear when women achieve financial stability and increased social status.   \n\n[Article](http://www.cbsnews.com/news/why-men-are-having-problems-getting-married/) from CBS notes:\n\n>That meshes with the problems facing younger American men who lack college degrees. In 1990, more than 17 percent of men between 18 to 39 worked in manufacturing, but by 2007 that had declined to about 11 percent, Autor and his co-researchers found. Fewer job opportunities reduce the supply of young men who would likely be judged as **good marital prospects**, they noted. \n\n>Its not only that young working-class men are less marriageable when jobs dry up, but that some of these men are actually disappearing, the paper noted. \n\n>Where are these young men going? Many are turning to risky behaviors such as heavy drinking and drug use. Trade shocks are leading to higher mortality rates for young men, which explains some -- but not all -- of the imbalance. Young men are also disappearing because theyre incarcerated, homeless or migrating to other areas to find better job opportunities. \n\nSo in other words, working class men are doing horribly.   \n\nBut not to worry gents, just as feminists are determined to create gender equality in the political and legal spheres (cough), they are doing their best to help working class men achieve decent employment and therefore a chance at having a happy relationship.   Oh wait...\n\n>A \"man-cession.\" That's what some economists are starting to call it. Of the 5.7 million jobs Americans lost between December 2007 and May 2009, nearly 80 percent had been held by men. Mark Perry, an economist at the University of Michigan, characterizes the recession as a \"downturn\" for women but a \"catastrophe\" for men.\n\n>Last November, President-elect Obama addressed the devastation in the construction and manufacturing industries by proposing an ambitious New Deal-like program to rebuild the nation's infrastructure. He called for a two-year \"shovel ready\" stimulus program to modernize roads, bridges, schools, electrical grids, public transportation, and dams and made reinvigorating the hardest-hit sectors of the economy the goal of the legislation that would become the recovery act.\n\n>Women's groups were appalled. Grids? Dams? Opinion pieces immediately appeared in major newspapers with titles like \"Where are the New Jobs for Women?\" and \"The Macho Stimulus Plan.\" A group of \"notable feminist economists\" circulated a petition that quickly garnered more than 600 signatures, calling on the president-elect to add projects in health, child care, education, and social services and to \"institute apprenticeships\" to train women for \"at least one third\" of the infrastructure jobs. At the same time, more than 1,000 feminist historians signed an open letter urging Obama not to favor a \"heavily male-dominated field\" like construction: \"We need to rebuild not only concrete and steel bridges but also human bridges.\" As soon as these groups became aware of each other, they formed an anti-stimulus plan action group called WEAVE-- Women's Equality Adds Value to the Economy.\n\n[source](http://www.weeklystandard.com/no-country-for-burly-men/article/17737)\n\nFor a group of people who so often call themselves \"socialists\" they sure seem hellbent on harming working class men.   There is however a silver lining to the death of romance.    Thanks to feminism marriage no longer provides any benefit to men, and on the contrary is an exceedingly risky proposition.   Therefore working class men are ultimately being spared a life of misery.   \n\nStill, being alone is another type of misery.   In one sense men are being freed, but on the other the loss of love is tragic.   Most men aren't suited to monk lifestyles.   They are being forced into this position out of a combination of hypergamy run amok and anti-male laws.   \n\nLest there be any confusion, working class men are not some minor part of the economy.   They are the people who maintain civilization.    \n\nUnless the MRM succeeds, I anticipate that the Japanese herbivore phenomenon will rapidly go global.   It may spread so quickly that people won't even realize what's happening before it's too late.   When I first saw Karen Straughan's video \"Fempocalypse\" I assumed she was engaging in hyperbole.  Now I'm not so sure...",
    "title": "Romance is dead",
    "subreddit": "MensRights",
    "timestamp": 1488279889,
    "score": 55,
    "keyword": "american judge"
  },
  {
    "text": "You are Equal: I'm sorry Here is my response to the \"you are not equal, I'm sorry\" letter.  First, the letter in it's entirety, followed by my reply.\n\n\"Say Thank You\n\nSay thank you. Say thank you to the women who gave you a voice. Say thank you to the women who were arrested and imprisoned and beaten and gassed for you to have a voice. Say thank you to the women who refused to back down, to the women who fought tirelessly to give you a voice. Say thank you to the women who put their lives on hold, who lucky for you  did not have better things to do than to march and protest and rally for your voice. So you dont feel like a second class citizen. So you get to feel equal.\n\nThank Susan B. Anthony and Alice Paul for your right to vote.\n\nThank Elizabeth Stanton for your right to work.\n\nThank Maud Wood Park for your prenatal care and your identity outside of your husband.\n\nThank Rose Schneiderman for your humane working conditions.\n\nThank Eleanor Roosevelt and Molly Dewson for your ability to work in politics and affect policy.\n\nThank Margaret Sanger for your legal birth control.\n\nThank Carol Downer for your reproductive healthcare rights.\n\nThank Sarah Muller for your equal education.\n\nThank Ruth Bader Ginsburg, Shannon Turner, Gloria Steinem, Zelda Kingoff Nordlinger, Rosa Parks, Angela Davis, Malika Saada Saar, Wagatwe Wanjuki, Ida B. Wells, Malala Yousafzai. Thank your mother, your grandmother, your great-grandmother who did not have half of the rights you have now.\n\nYou can make your own choices, speak and be heard, vote, work, control your body, defend yourself, defend your family, because of the women who marched. You did nothing to earn those rights. You were born into those rights. You did nothing, but you reap the benefits of women, strong women, women who fought misogyny and pushed through patriarchy and fought for you. And you sit on your pedestal, a pedestal you are fortunate enough to have, and type. A keyboard warrior. A fighter for complacency. An acceptor of what you were given. A denier of facts. Wrapped up in your delusion of equality.\n\nYou are not equal. Even if you feel like you are. You still make less than a man for doing the same work. You make less as a CEO, as an athlete, as an actress, as a doctor. You make less in government, in the tech industry, in healthcare.\n\nYou still dont have full rights over your own body. Men are still debating over your uterus. Over your prenatal care. Over your choices.\n\nYou still have to pay taxes for your basic sanitary needs.\n\nYou still have to carry mace when walking alone at night. You still have to prove to the court why you were drunk on the night you were raped. You still have to justify your behavior when a man forces himself on you.\n\nYou still dont have paid (or even unpaid) maternity leave. You still have to go back to work while your body is broken. While you silently suffer from postpartum depression.\n\nYou still have to fight to breastfeed in public. You still have to prove to other women its your right to do so. You still offend others with your breasts.\n\nYou are still objectified. You are still catcalled. You are still sexualized. You are still told youre too skinny or youre too fat. Youre still told youre too old or too young. Youre applauded when you age gracefully. Youre still told men age better. Youre still told to dress like a lady. You are still judged on your outfit instead of whats in your head. What brand bag you have still matters more than your college degree.\n\nYou are still being abused by your husband, by your boyfriend. Youre still being murdered by your partners. Being beaten by your soulmate.\n\nYou are still worse off if you are a woman of color, a gay woman, a transgender woman. You are still harassed, belittled, dehumanized.\n\nYour daughters are still told they are beautiful before they are told they are smart. Your daughters are still told to behave even though boys will be boys. Your daughters are still told boys pull hair or pinch them because they like them.\n\nYou are not equal. Your daughters are not equal. You are still systemically oppressed.\n\nEstonia allows parents to take up to three years of leave, fully paid for the first 435 days. United States has no policy requiring maternity leave.\n\nSingapores women feel safe walking alone at night. American women do not.\n\nNew Zealands women have the smallest gender gap in wages, at 5.6%. United States pay gap is 20%.\n\nIceland has the highest number of women CEOs, at 44%. United States is at 4.0%.\n\nThe United States ranks at 45 for womens equality. Behind Rwanda, Cuba, Philippines, Jamaica.\n\nBut I get it. You dont want to admit it. You dont want to be a victim. You think feminism is a dirty word. You think its not classy to fight for equality. You hate the word pussy. Unless of course you use it to call a man who isnt up to your standard of manhood. You know the type of man that allows his woman to do whatever she damn well pleases. I get it. You believe feminists are emotional, irrational, unreasonable. Why arent women just satisfied with their lives, right? You get what you get and you dont get upset, right?\n\nI get it. You want to feel empowered. You dont want to believe youre oppressed. Because that would mean you are indeed a second-class citizen. You dont want to feel like one. I get it. But dont worry. I will walk for you. I will walk for your daughter. And your daughters daughter. And maybe you will still believe the world did not change. You will believe youve always had the rights you have today. And thats okay. Because women who actually care and support other women dont care what you think about them. They care about their future and the future of the women who come after them.\n\nOpen your eyes. Open them wide. Because Im here to tell you, along with millions of other women that you are not equal. Our equality is an illusion. A feel-good sleight of hand. A trick of the mind. Im sorry to tell you, but you are not equal. And neither are your daughters.\n\nBut dont worry. We will walk for you. We will fight for you. We will stand up for you. And one day you will actually be equal, instead of just feeling like you are.\"\n\n\n------------------------\n\n\nMy reply: \n\n\nI think you misunderstand the concept of \"equality\". \n\nEquality means that nobody is inherently considered to be better than someone else because of superficial qualities. It means that we have laws to prevent someone from using those superficial qualities as a basis for making decisions regarding opportunity. \n\nLet's examine your complaints one by one:\n\nYou list over a dozen women who should be thanked for fighting for the rights that women have today. Which, is all the same rights as men have (plus a few more). \nThen you double back and say basically that you can pretend that you have equal rights, but you're a fool denying all the work done by those before you.  So...  look more closely at that. The *ACCOMPLISHMENTS* of those women are what earned you equal rights. Yes. Say THANK YOU. Say it often and mean it, because you have equal rights. today. right now. You do. \n\nImmediately you plummet into the wage gap myth. Let's use some tired cliche' obvious answers of why this is stupid. \n1. If I could pay a team of primarily women approx. 75% of what I would pay an equivalent group of men, why would I not hire primarily women and save up to 25% on my largest expense as a business owner, human resources?\n2. The differences in pay between men and women in the sighted fields is normally on the level of 5 or 6 cents to the dollar. an amount easily attributed to a variety of things, but certainly not solely determined by sexism. I'll grant you that it is possible it is a factor, but if I were a betting man I'd wager an argument could be made to show sexism acounts for less than 1% of the discrepancy. \n3. Let's factor in the wages paid for jobs likely to harm or kill you. An industry happily left to men, who make up over 95% of workplace deaths. This means that jobs likely to harm or kill you are likely at least 90% men. Meaning that when you have no education, and you need to make good money, risking your life will earn you more money. Add to this the understanding that girls and women graduate high school and college in greater numbers than boys and men. \n4. young childless women, in their mid 20s, are out-earning their male counterparts. \n\nWomen aren't treated poorly in the workplace as a commonality. They gravitate towards different fields of work. There are anti discrimination laws, if someone is violating those laws, report them. use social media, expose them. Believe me, the world is watching, and very few of them would want to miss out on a chance to support a woman fighting oppression.\n\nYou go on to complain about men discussing your uterus, and your body...  So, what you mean is that men elected by a population of voters made up of men and women, where at least half don't vote, decide details of laws surrounding abortion and reproductive rights. \nCurrently you have the federal right to seek an abortion. You have literally hundreds of birth control options, ranging from hormonal daily pills, to semi monthly injections, implants, non-hormonal options...  etc. Many/most of these options are covered by health care, by law. Men have one option: condoms. Besides condoms men are told to either accept the risk of sex, or not have it at all. \nIf I meet a girl, she says \"I'm on birth control injections, and I would abort as soon as I found out if something happened anyway, I'm totally not interested in having kids at this point in my life.\". We have sex that night. we see each other another few times, and it kinda fizzles out. 4 weeks later she calls me and says \"I'm pregnant, and I know I said I would abort but I'm keeping it. It's yours\", you have no choice in the matter. You are now legally accountable for that kid for 18 years. \nIf you put that sort of lack of choice upon women, suddenly it sounds like the worst thing ever. Imagine, if a man could say \"fuck no, you're having this child, I'll take custody, and you pay me monthly to raise it, I know I agreed that abortion was what we would do if birth control failed, but I actually want a kid now, so you'll have it and I'll take it, and you help pay for it, and you can see it on weekends if you want.\"  no. If you said \"Well if you don't like the concept of being forced to have a child if you get pregnant, then don't have sex\".  This is literally the choice men have. We can trust a woman at her word, and then she can change her mind and we are legally responsible for that kid. This is not equality, not at all. when the suggestion of the \"financial abortion\" is made, that a man can tell a woman \"I will not raise a child with you, I am opting out legally from raising this child or ever having a right to be in this child's life\" you have to release that man from being a legal parent. This would have to occur within a time frame during pregnancy the same as a biological abortion. This allows women their choice of being single parents, or aborting in the case that they decided to keep an accidental pregnancy. This allows men to be held to their word, as well as women to be held to theirs. This allows equality of choice, and reproductive rights.  \nI also wonder where feminism is on helping to promote Vasalgel, which would greatly reduce the rate of accidental pregnancy in the first place, and give men a powerful option for birth control methods, putting them a step closer to women in terms of this right. \n\nTaxes on \"basic sanitary needs\".  you are talking about equality to men, right? we pay taxes on our basic sanitary needs all the time. razors and toilet paper and tissues, and talcum powders, and deoderants...  of course we pay taxes on those items. If you have a complaint that items like sanitary goods shouldnt be taxed, that is fine, I probably would support that. But I don't see how you believe that is an issue of inequality to men. \n\nThe letter talks after this about having to \"justify their actions after a man forces himself on them\" right. you have to recount exactly how it happened to the police, who will investigate the incident. You have to explain to police when there is a potential element of consent involved that you had clearly communicated you were not consenting, and how you did that. So the police will ask you detailed questions all about the incident so they can do their job as best as possible. You giving a strong account of an event will help your case. the police are trying to help you.  this is not inequality. If I am attacked by someone, and I break their nose and jaw defending myself, and yet I'm untouched claiming to have been attacked, I'm going to have some detailed explanations to make, aren't I? and here I am the victim, being interrogated!? Yes. Because your story is a very important element of the incident. \n\nYou follow this by mentioning that women don't have paid maternity leave. Do men have paid paternity leave? \nOh...  women in other countries have it, gotcha, Because this was supposed to be about how you're not equal to men, wasn't it? Sure, work to get paid maternity leave, work to get all the things you believe would improve out society. But don't claim it is a factor of inequality. Because it's just something you want the government to regulate about business, and you cannot simply stuff socialist concepts down people's throat without a spoonfull of oppression to make it slide down a little easier. This again is not an inequality, and I've yet to see an actual right you lack that men have. \n\nThe next topic is breastfeeding. I don't really know if there are any laws preventing this, but I'm fairly sure that most laws allow for it, making an exclusion to indecency laws for breastfeeding in public. I think people who give others a hard time for this are shitty people. It isn't something men do though, so it's not an inequality, it's also (to my knowledge) not regulated as being illegal. So it's mainly social pressure and commentary that is being complained about. Again, not a right being denied to women that is granted to men. If women want to urge the law to let them be topless as it does in various parts of the country, go for it. Just don't expect men to stop looking at tittys. That's never going to happen. \n\nThe next part discusses social pressures and criticisms of things like appearance and then references being judged for the brand of high end hand bag she carries rather than her degree.....  by who? BY WHO!? I don't know any men who would know the brand of the handbag, but they might judge you by your degree. A degree she is more likely to have than a man, on average, by the way.  You are judged differently from men on your appearance? probably. But if you believe men aren't objectified you're crazy. If you think men aren't catcalled you're crazy. You simply can't see what your feminist lenses filter out. This is not inequality. There is no law that can prevent how people see other people. and your depiction of judgement for the high end handbag over the college degree just stinks of your inability to see just how insane your privilege theory really is. \n\nNext up is spousal abuse and rape, followed by the privilege stack listing off people worse off than white men.  Let's take them one at a time. The deluth model makes sure men are arrested when they are the abused. The lack of men's shelters helps to ensure that there are no resources for men to get themselves and their children out of abusive homes. If they go to the CPS, they may lose their children all together, because of the lack of understanding of abused men in our society. You ignore half of the abuse sufferers because of their gender, and act like women are the ones who are invisible. Just google \"men's shelter closes\" and read.  That's feminism. that's your equality. You want to know a little nugget of info that should help you understand how much you don't understand this situation? Lesbian couples have the highest rates of spousal abuse. \n\nFollowing this you compare the USA to various other nations. \n\nSingapore, Estonia, Iceland, New Zealand. You understand that your request for equality is all over the map, you want to have the benefits of socialist systems for yourself, but you also idolize what some of the least diverse nations on the planet are able to do by being a strongly nationalist society. They have some of the most strict immigration laws in the world, while america remains to have one of the most permissive. None of this has any bearing on your equality to American men. \n\nThe next paragraph essentially creates a straw man out of the sort of person who would claim to be on equal footing to men in America. The author essentially paints a picture of a woman who says she isn't a victim, and doesn't see the world through the feminist lens. Then scoffs at this straw man, claiming she get's it. It's because these sort of women cannot bear to understand their victimized place in society, that these women who don't walk around feeling the victimhood of womanhood are simply too weak to handle the realities of our world, and their place in it. The existence of successful women, and the individuals who are doing well in life are tossed aside, with the explanation that just because a woman can make patriarchy work for her doesn't mean she isn't still oppressed... Right. It's amazing how the writer of this article can start off the list thanking all those who won her the equal rights she enjoys today, turn around and deny the equal rights she has, and then list off a bunch of factors that have nothing to do with equality, simply are issues feminism/some women have with modern society or government policy in America. Though not one can be held up as a right other citizens have that they are denied. Not one can be listed as a \"human right\" and not one can be looked at as anything more than a first world complaint when compared to what women around the world deal with. \n\nShe ends the list having never sighted one thing men have that women don't, but that she will keep fighting to make she she gets those equal rights, because even though you might feel equal in your life, you really aren't because you're eyes aren't opened, and focused through the feminist lens to see how horribly you have it.  \n\n\nHere is a list of rights women have that men do not: \n\nWomen are able to register to vote without a social contract of selective military service. Men may not register to vote without selective service registration. Failure to register for the selective service may result in fines or jail time. \n\nWomen have the only legal control grated over reproductive rights. Men have the option to use birth control or abstain from sex in order to control their reproductive rights. \n\nWomen in the USA aren't allowed to have part of their genitals removed at birth. Male genital mutilation is considered normal in the USA.\n\nIn several states, men cannot be \"raped\" by a woman. Rape is only considered to be penetrated, but being forced to penetrate is not called rape. Further, you'll notice when a little boy is raped by a woman, they call it an affair, or sex, but not rape. \n\nAnway, that's about it. Legally we are pretty much on equal ground. So when you discuss the issues, call it what it is. You are fighting for womens rights, and women's issues. But not equality. You thanked the women in the first part of your letter who gave you that. Maybe stop shitting all over their work by claiming it didn't accomplish all that it has. You have all the legal rights of men in your nation, and then some.",
    "title": "You are Equal: I'm sorry",
    "subreddit": "MensRights",
    "timestamp": 1485362231,
    "score": 12,
    "keyword": "american judge"
  },
  {
    "text": "Right wing groups judge each other on how they treat their women. This article seems to be another example of competing right wing groups judging each other on the basis of how they treat their women.\n\nhttp://www.rightwingwatch.org/post/far-right-audiences-drag-two-of-their-favorite-female-pundits-for-not-having-children/\n\nIn this case it seems to be a \"Deep State\" / anti-Trump style of web site that's attacking the \"alt-right\".  Look at how mean the alt-right is to it's women they say.  Of course the whole sexual harassment witch hunt has kind of exploded on the \"Deep State\" side of things recently with Franken and others being accused which has given their right wing opponents the opportunity to make a charge of hypcrisy in treating \"their own women\" wrong.\n\nI was thinking to myself that you'd never see an article like the one above that featured men instead of women.  Fundamentally women's rights (and feminism) tends to be a right wing thing because of the way that being seen as the champion of \"the little ladies\" is a safe badge of honour among men at the top of the heap.  And it's always been this way.  We know going back to the earliest laws in history, the bible and the code of Hammurabi, that women get special treatment and protections from the male leaders at the top of the heap.\n\nI've observed before that this is true whether it's the Taliban and the American elites criticising each other over how badly they treat their women, or whether it's jurists in 18th century England talking about how much better a society they had compared to the bad old days of the 17th century when it was lawful for men to beat their wives with a stick \"no wider than their thumb\" (a law which was entirely fictional and may have been made up purely to brag at how much better at treating women the then modern society had become).\n\nMen at the top love to be the champions of women.  And that's how they brag about their society.  They don't care about men's lives under them of course, or positively seek to make them worse because those men are a threat.  This is a sexual relationship so basic you see it with animals.  So-called patriarchy loves giving privileges to women and undermining men.\n\nBut these traditional or even natural hierarchies are right wing politics.  The Left comes along and it's basis is the concept that all men are equal.  It's revolutionary.  It's demanding worker's rights (ie men's rights). It's the labor movement, unions, communism.  In this sense I would say that men's rights is naturally aligned with the Left as it has been historically, whereas the authoritarian / right wing hierarchy or \"patriarchy\" style of society has always benefited women.\n\nHow then has it come to be seen as the reverse in recent decades?  The only thing that is different is the rise of the feminist movement and it's identification as on the left.  Don't notice that the right wing governments are funding feminism to the tune of billions of dollars.  Don't notice that feminism has undermined the Left and divided it up in pursuit of right-wing / tribalist style identity based politics.  If we accept what feminists say about themselves uncritically they claim to be for equality and for left wing politics.  In reality they oppose both.  The difference between left and right is largely defined in any case on the basis of two things: attitudes towards equality and attitudes towards authority.  And those are similar things.  Do you support the natural hierarchies or do you say no, everyone should be equal?  Those who claim that feminists are the left wing do so on the basis only of what feminists claim about themselves.  But we know feminists falsely claim to want equality, and it is only logical to question their claim to be on the left.\n\nWomen's rights and privileges are a thing that has always been around.  It's not radical.  It's the status quo.  So old even other social animals in the wild do it.  Men's rights - meaning not the power of men at the top of the heap, but men at the bottom of the heap - is a new idea.  It's revolutionary.  it cuts at the very basis of society by undermining the existing authority.  By the very definition of what we mean by \"left\" and \"right\" wing politics these concepts of radical equality and rejecting the status quo hierarchy places men's rights on the Left and this is also why women's rights advocates have always been pushing on an open door, whereas men's rights advocates have always been attacked by those in power.",
    "title": "Right wing groups judge each other on how they treat their women.",
    "subreddit": "MensRights",
    "timestamp": 1512495258,
    "score": 8,
    "keyword": "american judge"
  },
  {
    "text": "The real reason women are not represented in tech First, I want to clarify I do not agree with the basis that women are not biologically suitable for roles in tech. I am much more inclined to believe it has to do with culture, and a good hard example against women being biologically inferior would be the country of Iran, where women make up the majority of engineers. Now granted, Iran has segregated schools between men and women, and they are under a theocracy, but if your basis was of biological merit, then this would be a good hard example to prove otherwise.\n\nNow, I will say that culture, primarily American culture, plays a huge role. \n\nLet's think back to middle school tech-ed courses, and think of the demographic in play. White/Asian nerdy boys primarily, a few hispanic and black nerds, and once in a while a nerdy girl. \n\nThis demographic holds true throughout high school. I would know, I was a guy who took tech ed courses in middle school/high school between two secondary schools, and this demographic holds true in hackathons, coding conventions, tech conventions, and..... tech jobs!\n\nBut why? Why do women, aside from a minority number, shy away from tech? Because of nerd culture. Yep, I'm just keeping it 100% honest here. Nobody likes nerds, besides other nerds. As someone who graduated from high school in 2015, the same stereotypes from 2-3 decades ago still hold true.\n\nNerds don't have friends to sit with at lunch, they are too autistic to make friends, and ESPECIALLY girlfriends, they are easy to pick on, and on the social hierarchy in high school they are at the very bottom.\n\nSo they fall back on tech, video games, and porn. And now you know why 90% of league players are males, just as the majority of competitive PC gamers are males. Men have a culture to fall back on, women do not. If women try to join this culture, lets say they play league, they will get hit on constantly for being a women. It's not fun, unless your aim is to make money from it by being a titty streamer of course.\n\nCompare this to a country like Iran, where western high school culture is non-existent, girls and boys are separate until 18, and girls are brought into tech collectively, where they can enjoy the subject without being hit on constantly, and without being judged.\n\nThis is not to say we need a theocracy. Hell, I'm agnostic myself. But I am saying that different cultures breed different peoples, and that our current nerd-normal people-jock culture cannot produce an equal outcome for both genders.\n\nUnless of course we mandate the subject, which could change things drastically. \n\nLooking forward to hearing your thoughts.",
    "title": "The real reason women are not represented in tech",
    "subreddit": "Feminism",
    "timestamp": 1502563805,
    "score": 12,
    "keyword": "american judge"
  }
]