[
  {
    "text": "Pros/Cons of transitioning from FTE to Contactor I was laid off my FTE job last December after 10 years (VERY LARGE American telecom firm) due to a reduction in force.  They told me I can come back as a contractor in 6 months.  My previous pay was 105k a year + about a 5% year incentive bonus and included decent healthcare/401k/stock options. \n\nThe phone rang the other day with my old manager and director telling me to come back and offering $85/hr w2 through a contracting firm that would pay via w2.  I asked them about benefits and whatnot  and they said \"ask the contracting firm\", indeed tells me these benefits are crap and you dont get paid for days off, no 401k match, etc.  I asked them about \"exclusivity\" (ie i can work another contract at the same time) and they said no.  To me it sounds like they want me back as an employee with all the loyalty that comes with it but are not giving it back.  Also, the contract is year to year and I have to get a renewal with them each year.\n\nSo with that whats the pros/cons with going back to my old job this way?  Seems like a shit sandwich deal for me but great for them.  Am I missing something or is this offer garbage?  I have seen a lot of peers go down this path but I am not sure why - maybe because the company is all they ever knew.\n\nI have another FTE job I am working now that is paying 130k + 10-15% bonus with all benefits, 401k matching, stock options, etc.  I am think I would be a moron to walk away from this for a contact gig at my old employer who let me go out the door.",
    "title": "Pros/Cons of transitioning from FTE to Contactor",
    "subreddit": "jobs",
    "timestamp": 1616754706,
    "score": 5,
    "keyword": "american director"
  },
  {
    "text": "Did this company reject me [25F] without saying outright that they rejected me? I'd agreed to take a 6-hour test and am irritated by their behavior. I applied to an analyst position at a registered investment advisor on LinkedIn and went through multiple rounds of Zoom interviews. They were supposedly interested in me because they then also asked me to take a 6-hour exam, which I then took.\n\nI didn't know if I did well on it or not, but then they also asked me to grab lunch with 4 directors and the chief investment officer. The lunch was pretty bizarre because I was this 25-year old Asian American woman eating with five Caucasian men who were all 35-60 years old. I struggled to insert myself into their conversations, which were 80% about their kids. I think I screwed up my chances after asking a question about their company's diversity initiatives - I was pretty concerned about potentially being on a team of 15 men (not to mention they were all Caucasian and extremely tall/attractive) and no women.\n\nAfter the lunch, HR emailed me to tell me that they would get back to me extremely soon. Well, a week went by and they didn't get back to me! I'd emailed one of the directors in the meantime to thank him for lunch but didn't get any information about next steps. Then I noticed that they'd recently posted an analyst position on LinkedIn (whether or not it was the same one as the one I'd interviewed for, I couldn't tell), and within 24 hours it'd gotten 200+ applications.\n\nI then applied to the company's newly posted job on LinkedIn just to alert them that I'm aware, and HR called me an hour later to tell me that I didn't get the job, but that I was being considered for this \"new\" job and that they'd throw my application into the mix. I talked to someone who'd vacated this position and he'd said that there's only ONE open spot. Did this company reject me \\[25F\\] without saying outright that they rejected me? I'm tired of not just being rejected outright.",
    "title": "Did this company reject me [25F] without saying outright that they rejected me? I'd agreed to take a 6-hour test and am irritated by their behavior.",
    "subreddit": "jobs",
    "timestamp": 1628212854,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture. In 2012, while running for the US Senate, former Missouri House Representative Todd Akin stated, [\"If it’s a legitimate rape, the female body has ways to try to shut that whole thing down.”](https://www.politico.com/story/2012/08/akin-legitimate-rape-victims-dont-get-pregnant-079864)  As someone who [worked for IBM selling computers and ran the maintenance department at his father's steel company](https://news.stlpublicradio.org/government-politics-issues/2012-10-02/akin-embraces-image-of-minuteman-as-he-battles-establishment-including-his-own-party), it clearly gave him the expertise necessary in women's anatomy, biology, and physiology to be able to make this assertion.  Of course, as an anti-choice usurper of rights, what type of man would he be, unless he [physically restricted access to reproductive healthcare clinics for women in need](https://archive.thinkprogress.org/todd-akin-was-arrested-multiple-times-for-physically-blocking-womens-access-to-abortion-clinics-7dda2f38d322/)?\n\nAkin's son, Perry, said, [\"As my father’s death approached, we had people from all different walks of life share story after story of the personal impact he had on them.\"](https://apnews.com/article/former-rep-todd-akin-dead-0a1b944f96eee4b63d9ea57e04c44ca4)  Of this, I have no doubt.  I'm certain that there are millions of women across the globe who would have liked to share the impact your father's life had, and will continue to have, on them.\n\nIn 1990, Lawrence Lockman, a Republican member of the Maine House of Representatives wrote, while serving as director of the Pro-Life Education Association, [\"If a woman has (the right to abortion), why shouldn't a man be free to use his superior strength to force himself on a woman?  At least the rapist's pursuit of sexual freedom doesn't (in most cases) result in anyone's death.\"](https://archive.vn/5cKpD)  Well, in that case, since you make such a perfectly reasonable, rational argument...\n\nIn 1990, Texas Republican gubernatorial nominee Clayton Williams, lamenting poor weather conditions that threatened to cancel a cattle roundup at his West Texas ranch, likened the atmospheric conditions to rape, stating, [“Rape is kinda like the weather. If it’s inevitable, relax and enjoy it.”](https://www.snopes.com/fact-check/personal-foul/)\n\nIn 2018, former US Rep for Iowa, Republican Steve King was asked about his stance of not allowing exceptions for either rape or incest in anti-choice legislation.  He said, [\"What if we went back through all the family trees and just pulled out anyone who was a product of rape or incest? Would there be any population of the world left if we did that?\"](https://www.desmoinesregister.com/story/news/politics/2019/08/14/steve-king-abortion-rape-incest-westside-conservative-iowa-representative-birth-iowa-civilization/2007230001/)  Steve King, everyone; noted critical thinker, [construction worker](http://kingconstruction.net/), and [avowed](https://thehill.com/homenews/house/413601-steve-king-members-of-nazi-linked-party-in-austria-would-be-republicans-if) and [unabashed neo-Nazi](https://www.vox.com/policy-and-politics/2018/6/13/17459908/steve-king-neo-nazi-tweet-retweet).\n\nFormer Republican Senator from Pennsylvania, Rick Santorum, most recently in the news for attempting to erase all remnants of Native Americans from North American soil ([\"We birthed a nation from nothing. I mean, there was nothing here. I mean, yes we have Native Americans but candidly there isn't much Native American culture in American culture\"](https://twitter.com/JasonSCampbell/status/1386685340522536961)), when asked what his views were on abortion in cases of rape and incest in 2012, stated, [\"...the right approach is to accept this horribly created--in the sense of rape--but nevertheless a gift in a very broken way, the gift of human life, and accept what God has given to you...We have horrible things happen.  I can't think of anything more horrible.  But, nevertheless, we have to make the best out of a bad situation.\"](https://archive.thinkprogress.org/santorum-to-rape-victims-make-the-best-out-of-a-bad-situation-a8388910c907/)  Apparently, in the case of rape, it's a gift.  It's a horribly created gift, yet nonetheless, a gift.  However, in the case of incest, it's what?  Just a regular, everyday gift?  A normal byproduct of a fully-functional family life?\n\nAlso in 2012, Richard Mourdock, a Republican candidate at the time running for Senate in Indiana, stated, [\"...I came to realize life is that gift from God.  And I think even when life begins in that horrible situation of rape, that it is something that God intended to happen.\"](https://www.cbsnews.com/news/richard-mourdock-even-pregnancy-from-rape-something-god-intended/)\n\nIn 2014, Montana Judge Todd Baugh sentenced a 54-year-old, admitted child molester, convicted of repeatedly raping his 14-year-old female student, who committed suicide during the course of the trial, to 30 days in jail.  At sentencing, he stated that the victim [\"seemed older than her chronological age\" and was \"as much in control of the situation\"](https://thelede.blogs.nytimes.com/2013/08/29/protesters-demand-montana-judge-resign-over-rape-sentencing/) as her rapist.  One month later, in an interview, he defended his decision, stating, \"Obviously, a 14-year-old can't consent.  I think that people have in mind that this was some violent, forcible, horrible rape.  It was horrible enough as it is just given her age, but it wasn't this forcible beat-up rape.\"  [He also added that her death complicated the case](https://www.usatoday.com/story/news/nation/2013/08/28/teacher-rape-montana/2722817/).\n\nIn 2019, a Tennessee Judge Steven Sword sentenced former pastor, David Richards, to 12 years in prison, 60 short of the maximum prosecutors had sought, for repeatedly having raped his adopted daughter over the course of two years, beginning when she was 14-years-old.  Richards maintained his innocence throughout trial, attempting to portray his victim as a rebellious teenager, who only made the allegations, after he had imposed strict rules for his children.  However, his DNA profile was lifted from a seminal fluid sample recovered from the girl's bed frame.\n\n[The judge, in handing down his lenient sentence, stated that he took into account Richard's longtime ministry, the Bible study he began in jail while awaiting trial, and the community support he received from family, friends, and fellow Christians](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/).\n\nAt sentencing, over 30 friends and parishioners sat on Richard's side of the courtroom in support of him, while only six appeared for his victim.  One of those appearing on behalf of Richards to argue for sentencing leniency, David Thompson, who shared ministerial duties w/ Richards at their church, said, [\"I find it impossible for me to believe he's guilty of this. His business needs him. His family needs him. Our church needs him.\"](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/)  Clearly, his family needs him, since he's such a wonderful father.\n\nAnd, of course, there's the new breed of vitriolic misogynists who, in a single breath, deny rape culture while proliferating it w/ their toxic ideology.  They refer to themselves as \"[Western chauvinists](https://www.splcenter.org/fighting-hate/extremist-files/group/proud-boys),\" but in reality, [they're nothing but neo-Nazi terrorists](https://www.timesofisrael.com/not-nazi-enough-proud-boys-leader-wants-group-to-fully-embrace-white-supremacy/), and [that's all they've ever been](https://www.adl.org/blog/proud-boys-bigotry-is-on-full-display), so don't be fooled by their rhetoric.  They've now taken to wearing suits and ties and [holding yearly conventions that promise to make \"men masculine again,\" while \"Making Women Great Again.\"](https://the21convention.org/)  Since last year's conference was such disgrace, [this year's conference promises to be an even more hatefully misogynistic experience w/ 17 featured speakers, and in a first, they're actually going to allow to women to speak](https://22convention.com/)!\n\n>Women today are being taught to act more like men. Where has that led us? Skyrocketing rates of broken families, a documented decline in female happiness since the 1970s, endless social and dating dysfunction, and America at the #1 spot in the world for single motherhood. No longer will you have to give in to toxic bullying feminist dogma and go against your ancient, biological nature as a woman, great men and women have arrived to help #MWGA.\n\nIt's pretty clear that this toxicity has led to a rape culture that's just intolerable, and this is just a snapshot of what's taking place in America.  [Gender-based violence has rooted itself in some of the most populous countries in the world, and the problem only appears to be getting worse](https://www.atlanticcouncil.org/blogs/southasiasource/understanding-rape-culture-in-bangladesh-india-pakistan/).  In other parts of the world, the abuse of women is absolutely horrific, [akin to something the Third Reich did to Jews in the death camps](https://scholarworks.lib.csusb.edu/cgi/viewcontent.cgi?article=1233&context=history-in-the-making).  In 2016, an [Indian woman from the state of Rajasthan was gangraped by her husband and his two brothers](https://www.indiatvnews.com/news/india-woman-gangraped-by-husband-in-laws-tattooed-with-expletives-over-dowry-336883), then tattooed across her forehead and hands/arms w/ expletives, b/c her family failed to meet the husband's dowry demands.  In 2018, [a 17-year-old Moroccan girl was abducted, tortured, and gangraped by 13 men over the course of two months](https://www.aljazeera.com/news/2018/8/27/morocco-outcry-after-girl-is-raped-tattooed-with-swastikas).  They burned her w/ cigarettes and tattooed her all over her body, including w/ symbols of swastikas.\n\nThis could go on (and on and on and on and on), but there's only so much space available on the Internet.  What's clear is that those who perpetuate this violent culture are the same who propose and legislate the wholly ineffectual laws designed to deal w/ this problem, and they're also those who enforce, prosecute, and adjudicate said laws.  In a sense, it's allowing predators to sit in judgment of predators, while, at the same time, giving them the option to dismiss those they victimize.  I'd say that it's a broken system, except that it's not.  It's a system that's working exactly in the way in which it was intended.",
    "title": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633547326,
    "score": 2033,
    "keyword": "american director"
  },
  {
    "text": "Do your part to boycott Texas. People are calling for a boycott of Texas in response to the state's restrictive abortion bill that egregiously infringes on women's rights. While celebrities can avoid holding concerts or filming in Texas, we need to go after the major corporations headquartered in Texas and tell them to speak out against the restrictions and move their headquarters out of a state that clearly has no respect for the women who live there. Here is the best contact information I could find for some of the biggest corporations headquartered in Texas:\n\n1. McKesson - A pharmaceutical company has no place in a state that restricts citizens' access to medical procedures. [publicaffairs@McKesson.com](mailto:publicaffairs@McKesson.com)\n2. AT&T - I couldn't locate a good email address for AT&T, but mail can be sent directly to the Secretary of their Board of Directors at Office of the Secretary of AT&T Inc., 208 S. Akard Street, Suite 2954, Dallas, Texas 75202 \n3. Dell Technologies - Emails to senior management or the Board of Directors can be sent to this address:  [Board\\_of\\_Directors@Dell.com](mailto:Board_of_Directors@Dell.com) \n4. Sysco - Mail can be sent to  Office of the Corporate Secretary, Sysco Corporation, 1390 Enclave Parkway, Houston, TX 77077. An online message can also be sent through their \"[Ethics Line](https://app.convercent.com/en-us/Anonymous/IssueIntake/LandingPage/2d82ff5d-b631-e611-8105-000d3ab03673)\"\n5. Oracle - According to some Justice Department records, the Chairman of the Board can be emailed at  [larry.ellison@oracle.com](mailto:larry.ellison@oracle.com) and the CEO can be emailed at  [SAFRA.CATZ@ORACLE.COM](mailto:SAFRA.CATZ@ORACLE.COM)  \n6. USAA - The CEO's email is [wayne.peacock@usaa.com](mailto:wayne.peacock@usaa.com) \n7. Hewlett Packard - The Board of Directors can be emailed at  [bod@hp.com](mailto:bod@hp.com) \n8. CBRE - The President and CEO can be emailed at  [bob.sulentic@cbre.com](mailto:bob.sulentic@cbre.com)\n9. Baker Hughes - The President and CEO can be emailed at [lorenzo.simonelli@bakerhughes.com](mailto:lorenzo.simonelli@bakerhughes.com)\n10. Kimberley Clark - Chairman and CEO can be emailed at  [michael.hsu@kcc.com](mailto:michael.hsu@kcc.com) \n11. American Airlines - CEO can be emailed at  [douglas.parker@aa.com](mailto:douglas.parker@aa.com) \n\nThis is all I have been able to dig up (I really should get back to work). I omitted oil and gas companies because they are likely in Texas because their resource is located there. \n\nReminder: this information is being provided to contact these individuals regarding legitimate complaints about Texas's abortion law and encouraging corporations to respond to it. None of this information should be used to spam inboxes or harass any individual. Take into consideration the fact that many of these individuals likely have someone reading their email for them, so your words are most likely being directed at someone who does not have the authority to take any action. Respectful, thought out arguments are most likely to get to the intended individual.",
    "title": "Do your part to boycott Texas.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630601385,
    "score": 141,
    "keyword": "american director"
  },
  {
    "text": "Consent should be taught in every school   \nI think that consent is CRITICAL for children's education. It is important because it allows them the courage to say no when others try to groom or assault them. Also, it is important because many children are assaulted and have no way to process that trauma as adults. It is estimated that 1 in 3 girls and 1 in 6 boys are assaulted, with the average age at the time of assault being 9. It will take a lot to end these atrocities, but I think that teaching consent is the first step. So I would like to start a letter writing campaign to representatives. To make it easy, I've posted a template for the letter below and a link to find your representative so you know who to email. Please help me change this! As of now only 9/50 states teach consent as part of sex education! This is unacceptable and we can make all the difference!!!\n\n  \n\n\n[Find your Representative here.](https://ziplook.house.gov/htbin/findrep_house?ZIP=)\n\n&#x200B;\n\nLetter Template:\n\nDear Representative \\_\\_\\_\\_\\_\\_\\_\\_\\_,\n\nI am writing because I believe that consent should be taught in schools in America. In a society where 1 in 3 girls and 1 in 6 boys  are sexually assaulted, something needs to be done. \\[1,2\\] The average age these children are affected is 9 years old. \\[3\\] The cost of this abuse is 23 billion dollars annually. \\[4\\]\n\nConsent is an important part of sex education, but it doesn’t need to be sexual in nature. There are age appropriate ways of presenting consent and teaching children that they have control over their own bodies, and they can say no if they do not want something. Helping children understand this and recognize warning signs will give them power over their body to mitigate grooming strategies from perpetrators and the tools to inform other adults about the abuse.\n\nPlease create federal mandates for ALL schools in the US to be required to teach age appropriate consent lessons to every grade K-12. Our current system is not enough.\n\nThank you for your time and consideration of this issue.\n\nSincerely,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nReferences:\n\n1. Dube, S.R., Anda, R.F., Whitfield, C.L., et al. (2005). Long-term consequences of childhood sexual abuse by gender of victim. American Journal of Preventive Medicine, 28, 430-438.\n2. Briere, J. & Elliot, D.M. (2003). Prevalence and psychological sequelae of self-reported childhood physical and sexual abuse in a general population sample of men and women. Child Abuse & Neglect, 27, 1205-1222.\n3. David Finkelhor, Kimberly J. Mitchell, and Janis Wolak, 2000, Online Victimization: A Report on the Nation’s Youth, National Center for Missing & Exploited Children: Arlington, VA. Darkness 2 Light. Statistics Surrounding Child Sexual Abuse.\n4. T. R. Miller, M. A. Cohen, B. Wiersema, Victim costs and consequences: A new look. (US Department of Justice, Washington, DC., 1996).\n5. Holmes, W.C., & Slap, G.B. (1998). Sexual abuse of boys: Definition, prevalence, correlates, sequelae, and management. Journal of the American Medical Association (JAMA), 280, 1855-1862.\n6. Lisak, D., Hopper, J. & Song, P. (1996). Factors in the cycle of violence: Gender rigidity and emotional constriction. Journal of Traumatic Stress, 9, 721-743.\n7. Finkelhor, D., Hotaling, G., Lewis, I. A., & Smith, C. (1990). Sexual abuse in a national survey of adult men and women: Prevalence, characteristics, and risk factors. Child Abuse & Neglect, 14, 19-28.\n8. Holmes, G.R., Offen, L., & Waller, G. (1997). See no evil, hear no evil, speak no evil: Why do relatively few male victims of childhood sexual abuse receive help for abuse-related issues in adulthood? Clinical Psychology Review, 17, 69-88.\n9. Widom, C.S. & Morris, S. (1997). Accuracy of adult recollections of childhood victimization part 2. Childhood sexual abuse. Psychological Assessment, 9, 34-46.\n10. Widom (1999). Posttraumatic stress disorder in abused and neglected children grown up. American Journal of Psychiatry, 156, 1223-1229.\n11. Felitti, V.J., Anda, R.F., Nordenberg, D., Williamson, D.F., Spitz, A.M., et al. (1998). Relationship of childhood abuse and household dysfunction to many of the leading causes of death in adults. American Journal of Preventive Medicine, 14, 245-258.\n12. Lisak, D. & Luster, L. (1994). Educational, occupational and relationship histories of men who were sexually and/or physically abused as children. Journal of Traumatic Stress, 7, 507-523.\n13. Dube, S.R., Anda, R.F., Whitfield, C.L., et al. (2005). Long-term consequences of childhood sexual abuse by gender of victim. American Journal of Preventive Medicine, 28, 430-438.\n14. Briere, J. & Elliot, D.M. (2003). Prevalence and psychological sequelae of self-reported childhood physical and sexual abuse in a general population sample of men and women. Child Abuse & Neglect, 27, 1205-1222.\n15. Arata, C. (2002) Child Sexual Abuse and Sexual Revictimization. Clinical Psychology, 9: 135-164.\n16. Hopper, J. (1998). Child Sexual Abuse: Statistics, Research, Resources. Boston, MA Boston University School of Medicine. Child Sexual Abuse: A Mental Health Issue. Kentucky Division of Child Abuse and Domestic Violence\n17. American Academy of Pediatrics, Preventing Sexual Violence, An Educational Toolkit for Health Care Professionals, The Facts about Sexual Violence, [https://www2.aap.org/pubserv/PSVpreview/pages/factsheet.html](https://www2.aap.org/pubserv/PSVpreview/pages/factsheet.html)\n18. Hanson, R. F., Resnick, H. S., Saunders, B. E., Kilpatrick, D. G., & Best, C. (1999). Factors related to the reporting of childhood rape. Child Abuse and Neglect, 23, 559–569. doi:10.1016/S0145-2134(99)00028-9. [http://www.nsvrc.org/sites/default/files/publications\\_nsvrc\\_factsheet\\_media-packet\\_statistics-about-sexual-violence\\_0.pdf](http://www.nsvrc.org/sites/default/files/publications_nsvrc_factsheet_media-packet_statistics-about-sexual-violence_0.pdf)\n19. David Finkelhor, Director of the Crimes Against Children Research Center. [https://www.victimsofcrime.org/media/reporting-on-child-sexual-abuse/child-sexual-abuse-statistics](https://www.victimsofcrime.org/media/reporting-on-child-sexual-abuse/child-sexual-abuse-statistics)\n20. National Center for Victims of Crime and Crime Victims Research and Treatment Center, 1992\n21. US Department of Justice Sex Offense and Offenders Study. 1997.\n22. Sobsey, D. (1994). Violence and abuse in the lives of people with disabilities: The end of silent acceptance? Baltimore: Paul H. Brooks. [http://aspires-relationships.com/the\\_invisible\\_victims.pdf](http://aspires-relationships.com/the_invisible_victims.pdf)\n23. U.S. Department of Health and Human Services. Administration for Children and Families, Child Maltreatment, 1995.\n24. Simpson, C., Odor, R., & Masho, S. (2004 August). Childhood Sexual Assault Victimization in Virginia. Center for Injury & Violence Prevention. Virginia Department of Health, Snyder, H N. (2000). Sexual assault of young children as reported to law enforcement: Victim, incident, and offender characteristics. National Center for Juvenile Justice, U.S. Department of Justice.\n25. U.S. Department of Justice, Office of Justice Programs, Sexual Assault of Young Children as Reported to Law Enforcement: Victim, Incident, and Offender Characteristics, by Howard N. Snyder, Ph.D., National Center for Juvenile Justice, July 2000, NCJ 182990, [http://www.bjs.gov/content/pub/pdf/saycrle.pdf](http://www.bjs.gov/content/pub/pdf/saycrle.pdf)\n26. The Alan Guttmacher Institute. 1994. Sex and American Teenagers.\n27. Hanson, R.F., Resnick, H.S., Saunders, B.E., Kilpatrick, D.G., & Best, C. (1999). Factors Relating to the Reporting of Childhood Sexual Assault. Child Abuse and Neglect, (23) 559-569; FBI Law Enforcement Bulletin\n28. David Finkelhor and Gerald Hotaling, Sexual Abuse in a National Survey of Adult Men and Women: Prevalence, Characteristics, and Risk Factors, Child Abuse and Neglect (1990), 14, 19-28.\n29. Finkelhor D, Browne A. The traumatic impact of child sexual abuse: A Conceptualization. J Orthopsychiat. 1985;55:530–541.\n30. Browne, A., & Finkelhor, D. (1986), Impact of child sexual abuse: A review of the research. Psychological Bulletin, 99, 66-77.\n31. Merrill, L.L., Newell, C.E., Gold, S.R., and Millen, J.S. Childhood Abuse and Sexual Revictimization in a Female Navy Recruit Sample. Naval Health Research Center, Pub. 97-5, 1997. [http://www.dtic.mil/dtic/tr/fulltext/u2/a331433.pdf](http://www.dtic.mil/dtic/tr/fulltext/u2/a331433.pdf)\n32. Larry K. Brown, M.D., et al, American Journal of Psychiatry 2000;157:1413-1415.\n33. Jennifer Brownell, Director of the local CAC, Finger Lakes Child Abuse Response Team [http://www.waynepost.com/article/20150802/NEWS/150809976a](http://www.waynepost.com/article/20150802/NEWS/150809976a)",
    "title": "Consent should be taught in every school",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1614555991,
    "score": 111,
    "keyword": "american director"
  },
  {
    "text": "I just saw something really sexist happen in class and I’m not sure how to address it. I’m at university studying music, and one of my classes is to be in a performing ensemble that the conducting students can practice on. The students run the rehearsals but the department directors are there to jump in and give advice or correction if needed.\n\nToday we had two student conductors, a woman originally from China and a white American man. For the half hour the woman conducted, one of the directors basically never left the stage, contradicting her instructions, or just addressing the musicians directly with what he wanted and ignoring her altogether. Me and several other musicians made eye contact like, “what is going on?” Of course, when the male conductor went the director did not say a single word the entire time. \n\nA lot of us in the class are upset but the music business is so based on reputation I don’t know if anyone else would be willing to risk calling them out. The directors are actually nice people and I thought maybe if I just point out to him what happened and how it came across, it might have been completely innocent and something he’d be willing to work on. I’m hesitant to go above his head directly to the administration but I also don’t want this teacher to put me on his shit list if I confront him directly. Does anyone have any ideas on how I should handle this?",
    "title": "I just saw something really sexist happen in class and I’m not sure how to address it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633030127,
    "score": 32,
    "keyword": "american director"
  },
  {
    "text": "In light of Raiders coach Jon Gruden resigning today over sending nude photos of Washington R*****n cheerleaders, please support NFL cheerleaders and get Roger Goddell to release the investigation results into sexual abuse allegations in DC. (regardless of whether or not you keep up with American football, please read to support the women involved.)\n\nI'm big mad right now.\n\nJon Gruden, Raiders coach, resigned today in response to a NYT report citing racist and homophobic conduct, as well as emails exchanged between him and leadership at the Washington Football team (formerly known as Redskins) that contained semi nude pictures of the team's cheerleaders at one of their bikini shoots.\n\nEarlier this year, the whole of the Washington Football Team's all female cheer squad were fired \"without cause.\" \n\n[https://www.nbcnews.com/know-your-value/feature/muted-washington-football-team-cheerleaders-allegedly-fired-during-faceless-zoom-ncna1258579](https://www.nbcnews.com/know-your-value/feature/muted-washington-football-team-cheerleaders-allegedly-fired-during-faceless-zoom-ncna1258579)\n\nOther leaders at the WFT have said wonderful things about women employed as cheerleaders for their org. \n\n>Washington’s former cheerleading director Donald Wells also alleged that Snyder once told him, with regard to members of the squad, “You better keep them skinny with big t-ts or I’ll f—ing kill you.” [(source)](https://brobible.com/sports/article/jon-gruden-photos-topless-washington-cheerleaders/)\n\nDan Synder recently brought on his wife as a co-owner of the team to save face and thus far has enjoyed a mostly inconsequential fall out from his actions. Jon Gruden got to resign (albeit under pressure) on his own terms years after the original transgression, but the whole of the abused party, the Washington Redskins cheerleaders, lost their jobs and their team in the middle of a pandemic. This is why we can't talk. We have no protection; not in our franchise, not in **other** franchises, not in our jobs, or our bodily autonomy. Economic and sexual assault on all fronts.\n\nWe are sick and tired of being abused for pennies, abused period. Men paid millions on company time, sending between them nonconsensual nude photos of women who are being paid hundreds. I'm sick about it.\n\nPlease consider [signing the petition](https://www.change.org/p/roger-goodell-nfl-washington-football-team-do-the-right-thing-for-women) to get Roger Goddell to release the findings of the investigation into WFT's leadership. Get Synder cuts. We need heads to roll before true change will happen. \n\n[https://www.insidehook.com/daily\\_brief/sports/jon-gruden-emails-provecheerleaders-unsafe-nfl](https://www.insidehook.com/daily_brief/sports/jon-gruden-emails-provecheerleaders-unsafe-nfl)\n\n [Jon Gruden Resigns After Homophobic and Mysogynistic Comments - The New York Times (nytimes.com)](https://www.nytimes.com/2021/10/11/sports/football/what-did-jon-gruden-say.html) \n\n [Jon Gruden Sent Photos Of Topless Washington Cheerleaders: Report (brobible.com)](https://brobible.com/sports/article/jon-gruden-photos-topless-washington-cheerleaders/) \n\n[https://www.change.org/p/roger-goodell-nfl-washington-football-team-do-the-right-thing-for-women](https://www.change.org/p/roger-goodell-nfl-washington-football-team-do-the-right-thing-for-women)",
    "title": "In light of Raiders coach Jon Gruden resigning today over sending nude photos of Washington R*****n cheerleaders, please support NFL cheerleaders and get Roger Goddell to release the investigation results into sexual abuse allegations in DC.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1634071925,
    "score": 26,
    "keyword": "american director"
  },
  {
    "text": "The Supreme Court Order Regarding Texas HB8 Hi everyone, earlier today, I wrote the following and that you might want to use it in your arguments against Texas SB 8 and the Supreme Court's ridiculous unsigned order. This analysis was not written to defend abortion, because I don't think that will be beneficial in convincing a lot of people how dangerous this new law is. Instead, it takes the logic of the law and the Supreme Court's logic and extends them to their natural conclusions using examples of free speech, religious freedom, and gun rights. I hope that all of you find this helpful:\n\n\n Today, I weep for the Constitution, for yesterday the Supreme Court eviscerated both its importance and their own power. To start, my thoughts on abortion are irrelevant to this and many of you would be surprised where I stand. I am not writing about why abortion should or should not be illegal. The order issued by the Supreme Court yesterday has far reaching effects and that are not limited to abortion; indeed that stand to effect every right that you hold dear from gun ownership to free speech and everything in between. That is what I am writing about today – the slippery slope that the Supreme Court created and the map that the Supreme Court drew for states to pass laws that are unconstitutional on their face.\n\nTo understand how the Supreme Court got where it got and why it is so dangerous to the freedoms and Constitutional protections afforded to every American, you must first understand the diabolically clever law that was at issue before the Court yesterday – Texas SB 8. \n\nFirst a little background on the state of the constitutionality of abortion and SB8: Under Roe v Wade, Planned Parenthood v Casey, and their progeny, a state cannot make abortions illegal before the fetus is viable (that is the fetus could survive outside the mother’s womb), which occurs around 24 weeks into the pregnancy. Instead of making abortion illegal prior to 24 weeks, SB 8 created a private cause of action for any Texas citizen to bring a civil lawsuit against anyone who performs an abortion after a fetal heartbeat is detected (or if the clinic fails to search for a heartbeat), which occurs at approximately 6 weeks of gestation. Under this private cause of action, anyone can sue anyone for at least $10,000 if they perform an abortion after a fetal heartbeat is detected or if they aid someone in getting an abortion after fetal heartbeat (which aid can include paying for the abortion or even driving someone to the clinic). To summarize – abortions are not criminally “illegal” in Texas after 6 weeks, but if you perform one or aid someone in getting one you are subject to civil liability of at least $10,000 which civil suit can be brought by ANYONE even if they are not related to the fetus and even if they don’t even live in the same city as the mother and fetus. This enforcement scheme is wholly novel – in every other case that I am aware of, abortion bans are enforced by the state itself, not by private citizens.\n\nAfter SB 8 was passed, a Texas abortion clinic filed a lawsuit to have the law declared unconstitutional and to prevent its enforcement while the case was pending. This is the usual method that these cases are handled. In most cases a law that appears to be unconstitutional is passed, then someone or some group who will be affected by the law file a lawsuit naming various state employees and elected officials, then the law is stayed (put on pause and not enforceable) by the courts pending litigation, and then the courts decided whether the law is constitutional or not, giving time for briefing, argument, etc. – and this does take time; though the wheels of justice turn, they do so slowly. However, in this case the law is not actually enforced by the state – it’s enforced by civil actions, so the question arises of who to name in the lawsuit. In this case, the defendants were multiple the directors of multiple state agencies, a Texas district judge and court clerk, and an individual who threatened to sue people under the law. The theory in naming these people was to enjoin the government and judges from hearing the private lawsuits and to name a party who had previously said they would file such lawsuits to enjoin everyone from filing the lawsuits.  Multiple procedural actions occurred in the district court and in the 5th circuit, which ultimately let to an emergency motion in the Supreme Court asking the Court to enjoin (stop) enforcement of the law while the case proceeded on the merits. Again, this is what would ordinarily be done.\n\nHowever because the state isn’t actually enforcing the law itself, and is instead, essentially subcontracting that duty to private citizens on the promise of at least $10,000 in damages, the state argued that there isn’t anything to enjoin because no such lawsuits have been filed.\n\nUltimately, in a 5-4 unsigned order, the Supreme Court agreed with the defendants, saying “\\[the movants’’\\] application also presents complex and novel antecedent procedural questions on which they have not carried their burden \\[for an injunction to be issued\\].” Essentially, this means that the question of who to sue and who to enjoin makes it so the majority could not issue the injunction. However, this procedural quandary is one created by the State of Texas, itself! As stated by Chief Justice Roberts, in his dissent, “\\[t\\]he desired consequence \\[of private enforcement of the 6 week ban on abortions\\] appears to be to insulate the State from responsibility for implementing and enforcing the regulatory regime.” In effect, by granting the power to enforce otherwise unconstitutional bans on abortion, SB 8 has evaded constitutional scrutiny. As Justice Sotomayor wrote, in her scathing dissent:\n\n\"Taken together, the \\[Texas abortion law\\] is a breathtaking act of defiance—of the Constitution, of this Court’s precedents, and of the rights of women seeking abortions throughout Texas.\"\n\nShe goes on to write:\n\n\"Today, the Court finally tells the Nation that it declined to act because, in short, the State’s gambit worked. The structure of the State’s scheme, the Court reasons, raises “complex and novel antecedent procedural questions” that counsel against granting the application, ante, at 1, just as the State intended. This is untenable. It cannot be the case that a State can evade federal judicial scrutiny by outsourcing the enforcement of unconstitutional laws to its citizenry.\"\n\nThis statement, by Justice Sotomayor, is the heart of why I grieve for the Constitution today and shows how the majority of the Court undercut both its own power and the sanctity of the Constitution. In short, the Supreme Court has said that a state may pass a law that is unconstitutional on its face, but so long as it leaves enforcement of that law to the hands of private citizens, the Court will allow the law to stand.\n\nWhat does this mean and how can this be used? Almost everyone is familiar with the First Amendment and its general provisions – the government cannot prevent someone from speaking even if the government disagrees with the content of the speech; you cannot go to jail for criticizing the government. But, what if Governor Abbot and the Texas legislature got tired of the criticism heaped upon them by their opponents and simply passed a law that said “if a private citizen hears someone say something negative about the Governor or the Legislature, that citizen can sue the speaker for $10,000.” Though it is clearly unconstitutional for the government to throw you in jail for such speech, under the precedent set by the Supreme Court last night, such a law would be allowed to be enforced until a lawsuit was actually brought under the law (and maybe even after – apparently the majority of the Supreme Court believes it might not be able to enjoin such a law at all). What chilling effect would this have on speech? \n\nOr, another example – Multiple states issued emergency orders preventing religious gatherings of more than a certain number of people during the pandemic to prevent the spread of COVID. These laws were enforced by the government and the Supreme Court twice enjoined enforcement of these laws as unconstitutional. What if those laws instead said that the gatherings were legal, but private citizens could sue anyone who attended a religious gathering of more than 20 people for $5,000 per person? Under the precedent set last night, such a scheme is apparently allowable.\n\nOne final example – many states have tried to pass laws banning the possession of certain types of guns which have been struck down as unconstitutional. What if instead of making it criminally illegal to own such guns, they just created the ability for other citizens to sue you if you owned a gun the state didn’t like? Again, apparently acceptable according to the majority because the procedural questions are too complex for some of the greatest judicial minds to grasp. \n\nMy feelings on abortion are irrelevant to the legal significance of this case. The majority of the supreme court has undercut the Constitution itself and the effects could be far and wide reaching. The very basis of our freedoms is apparently unenforceable if a state gets cute and simply subcontracts enforcement to private citizens. Your rights – all of them – are in jeopardy today.",
    "title": "The Supreme Court Order Regarding Texas HB8",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630617115,
    "score": 8,
    "keyword": "american director"
  },
  {
    "text": "I'm Israil Ali, Director of the Division of the National Health Service Corps (DNHSC) at the Health Resources and Services Administration (HRSA). Let's talk about the NHSC Loan Repayment Programs (LRPs) and answer your questions about the application cycle. Ask me anything! Hi, Reddit! I’m Israil Ali, Director of the Division of the National Health Service Corps, within the Health Resources and Services Administration (HRSA), which is part of the Department of Health and Human Services. The National Health Service Corps (NHSC) awards scholarships and loan repayment to health care professionals who care for our communities in need. Thanks to the American Rescue Plan, the NHSC received $800 million in additional funding and is poised to award student loan repayment assistance to the largest class of clinicians in program history.\n\nI’m here to highlight the open NHSC Loan Repayment Programs (LRPs) – the NHSC LRP, NHSC Substance Use Disorder (SUD) Workforce LRP, and the NHSC Rural Community LRP. The goal of these programs is to recruit and retain clinicians who provide quality healthcare services to communities in need across the nation. I hope you will decide to apply **before the deadline on May 27 at 7:30 p.m. ET**. It takes applicants an hour to complete the application.\n\nYou can find out more information about the NHSC LRPs and choose the right one for you when you visit [https://nhsc.hrsa.gov/choose-your-lrp](https://nhsc.hrsa.gov/choose-your-lrp).\n\nAdditionally, NHSC loan repayment program recipients and HRSA representatives will help answer questions as they come into the comments section. Their accounts are listed below for easy identification during the AMA:\n\n* u/ehos1659 (NHSC LRP Recipient)\n* u/DrMonicaTD (NHSC SP Recipient)\n* u/Mavis_HRSA (HRSA Representative)\n* u/Malissa_HRSA (HRSA Representative)\n* u/Darren_HRSA (HRSA Representative)\n* u/JaimeHart_Ketchum (HRSA Representative)\n* u/TimHRSARep (HRSA Representative)\n* u/CourtneyHRSARep (HRSA Representative)\n\n&#x200B;\n\nI'll be here on May 20 from 6-7 PM ET to answer your questions and tell you about the tremendous impact the NHSC brings to underserved communities. Ask Me Anything!\n\nWhile you all consider your questions, I also want to bring your attention to HRSA's new Loan Repayment Program that will launch in the coming weeks—the STAR LRP! Loan Repayment will be awarded to health professionals caring for patients living with opioid substance use disorder. To learn more and to subscribe to updates visit: [https://bhw.hrsa.gov/funding/apply-loan-repayment/star-lrp](https://bhw.hrsa.gov/funding/apply-loan-repayment/star-lrp)",
    "title": "I'm Israil Ali, Director of the Division of the National Health Service Corps (DNHSC) at the Health Resources and Services Administration (HRSA). Let's talk about the NHSC Loan Repayment Programs (LRPs) and answer your questions about the application cycle. Ask me anything!",
    "subreddit": "medicine",
    "timestamp": 1621359783,
    "score": 33,
    "keyword": "american director"
  },
  {
    "text": "New student teacher noticing potential racism with cooperating teacher and needs advice Hi everyone,\n\nSo my fiancée just finished her first week of student teaching for her master’s program, and is assigned to kindergarten. She loves her students and has a good relationship with her cooperating teacher, who has been teaching for 5 years and went through the same program.\n\nHowever, my fiancée has noticed that her cooperating teacher appears to treat the one African-American boy in the class more harshly than the others, who are mostly white and Latina. The little boy had a rough first day—as can be expected for a kindergartner on their first day—and from then on, she has described him as “defiant”; which she hasn’t described any other student as. My fiancée has a good relationship with all of the students and says that he’s really sweet, really smart, and has been no more defiant than any other student.\n\nToday, he apparently swept some plastic fruit toys off of a kitchen counter toy—the cooperating teacher claimed as he was looking her in the eyes—and she grabbed him by the upper arm and forcefully sat him in the timeout chair. My fiancée thinks she seems to be overly scrutinizing him—not in an obvious way but in what seems like an insidious, possibly subconscious way.\n\nMy fiancée questions whether her newness to teaching and proclivity for leniency might be clouding her thoughts but it’s gnawing at her—especially given the effects of the pandemic on kids and this having been the kindergartners’ first week of school ever.\n\nShe doesn’t feel like she can tell the program professors or directors because they’re still close to the cooperating teacher, and doesn’t want to overstep with the elementary school principal and staff. She also doesn’t know whether it’s appropriate to bring it up with the parents or with the cooperating teacher—especially as the cooperating teacher is the main person determining her grades.\n\nHas anyone dealt with anything similar, or does anyone have any advice? \n\nThank you so much!",
    "title": "New student teacher noticing potential racism with cooperating teacher and needs advice",
    "subreddit": "Teachers",
    "timestamp": 1630106255,
    "score": 9,
    "keyword": "american director"
  },
  {
    "text": "Marcus Lemonis rewards teachers and staff at his alma mater This is incredible.\n\nMarcus Lemonis donated to his high school, Miami’s Columbus High School, and also gave each staff member $18,000 each!!\n\nFrom The Miami Herald (link below):\n\nTV star and entrepreneur Marcus Lemonis lacks the white beard and red coat, but after announcing Thursday he will give $18,000 checks to each employee at his alma mater, Christopher Columbus High School, many may start calling him Santa Claus.\n\n“It’s hot as s*** out here. I know we’re not supposed to cuss — all right — I will try to be brief about this,” said Lemonis, 48, as soon as he took the stage in front of about 1,600 people during a 9 a.m. schoolwide meeting on the Columbus football field.\n\nThe school administration had told students, teachers and staff to gather for a special guest appearance but hadn’t revealed the details. The last time they all gathered there was two years ago when the football team won the state championship.\n\n“When we think about the people that make this school run, the people that make it tick, the people that take care of the grounds and the classrooms, that teach us, that take care of us, those to me are the most important service providers on the planet,” Lemonis said. “It’s not a glamorous job; it’s not a high-paying job; it’s a job with a lot of stress.\n\n“Today, I’ll be providing a $3.1 million tip to everybody who works here. You’ll be sharing it,” he said. “Whether you’re a school teacher, whether you are in the maintenance department — every single employee will receive a check for $18,000.”\n\nLemonis, who hosts CNBC’s “The Profit,” graduated from Columbus in 1991 and was inducted into the Columbus Hall of Fame in 2015. In August 2020, the school partly named a new facility, the Center for Science and the Arts, after him.\n\nHis donation comes as part of his new initiative, The Great American Tip Off, a nationwide call to action to tip servers across the country.\n\nLemonis will dole out about $3.1 million to cover the one-time payments to the 180 Columbus employees — about 145 teachers and about 35 support staffers. Cristina Cruz, the school’s marketing director, said she couldn’t disclose the average employee salary at Columbus.\n\nAs soon as Lemonis broke the news, the crowd exploded in cheers.\n\n“What the h*** just happened?” said Jannette Rojas, who teaches English at Columbus, 3000 SW 87th Ave. “Oh my God. Oh my God. Oh my God. Is this what kids feel like with Santa? Is this what my kids feel on Christmas morning?”\n\nRojas, 44, has worked at Columbus for about seven years and has two boys, ages 8 and 11. “This the most wow thing that has ever happened,” she said.\n\nErin McGrath, a colleague of Rojas in the school’s English department, described what happened as a “great example” of giving back and following the mission of the school’s Marist Brothers, an international organization of religious men dedicated to education. She has worked at the school for about 13 years.\n\n“If you could’ve taken a picture of my face, it would’ve been a meme,” said McGrath, 36. “My heart is happy. It’s so full. I’m speechless.”\n\nBoth said they would follow Lemonis’ advice and use the money to pay off debt and invest. “Don’t go shopping!” Lemonis had told them a few minutes earlier.\n\nYovani Alvarez, the head of maintenance at the school and an employee of about 14 years, said he wants to invest it for his future.\n\n“I’m very grateful,” said Alvarez, 43. “Very excited.”\n\nSchool will also build two new centers, cancel class Friday\n\nLemonis also announced Thursday he will contribute an additional $7 million to build a college guidance center and a success center for students of disadvantaged backgrounds. Cruz said 35 percent of students at Columbus receive financial aid.\n\nHe requested the guidance center be named after two former teachers of his: Pat Call and Irene Culmo, and the success center after the Desmond family, his former neighbors. They all helped him get to where he is now and he wanted to recognize that.\n\n“Two of the families were school teachers of mine when I went here, and the other family, the Desmond family, is the reason that I came to Columbus. They drove me to school every day. They shepherded me and gave me all of the instructions I needed,” he said.\n\nCall, who taught biology and math at Columbus for nearly 45 years before retiring last spring, said “it was a total surprise” and she was “floored” when Lemonis said he wanted to honor her.\n\nLemonis’ most recent donation of more than $10 million is the largest the private, Catholic, all-male school has ever received since its founding in 1958. Cruz said she couldn’t disclose how much Lemonis has donated on other occasions, but that “he has been a great supporter of the school for many years.”\n\nLemonis was born in 1973 in Beirut, Lebanon. His birth mother dropped him off at an orphanage as a four-day-old baby. His parents, Sophia, a Lebanese, and Leo, a Greek, adopted Lemonis and moved him as a nine-month-old baby to Miami, where they raised him.\n\nAt about 25, after graduating from Marquette University in Wisconsin, Lemonis founded Camping World, which grew from a single store in Bowling Green, Kentucky, to the nation’s largest retailer of RVs, headquartered in Lincolnshire, Illinois.\n\nLemonis still leads the $5 billion-a-year company, which has more than 160 locations across the country, as its CEO and board chairman. \n\nIn “The Profit,” Lemonis finds struggling businesses and offers them cash in exchange for a piece of the profit, then tries to save the venture. In 2022, he will star in another show — The Renovator for HGTV — in which he will help people transform their homes. \n\nBefore he wrapped up Thursday, Lemonis said he had a third announcement that he hadn’t cleared with the administrators, pointing to the school’s president Thomas Kruczek: “There is no school tomorrow!” he said. Kruczek looked at him in surprise and raised his arms.\n\n“Marcus! Marcus! Marcus!” the students chanted. Asked later if he meant it, Lemonis said: “Oh, they’re definitely having school off tomorrow — I’m going to lock the fence, the door.”\n\nCruz confirmed afterward that the school canceled classes for Friday.\n\nRead more at: https://www.miamiherald.com/news/local/education/article256436921.html#storylink=cpy",
    "title": "Marcus Lemonis rewards teachers and staff at his alma mater",
    "subreddit": "Teachers",
    "timestamp": 1639503276,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "Grad school options; what do I do? HELP I got accepted into two graduate schools and I can’t decide what to do.\nI currently teach high school ESL in Europe and want to keep doing this for a decade or so. Eventually (like 15-25 years in the future) I may want to teach at a university. What do you think? \n\n\nOne option is a super well known/prestigious university to get an MSED in language, culture, and literacy. It sounds like a great program but seems to be more geared toward elementary ESL or American ESL. Their language program is top 3 in the world, but I would only be taking 1-2 classes that aren’t in the education program (still good, but not world renowned good)\n\n\nThe other option is a lesser known school for an MA in Linguistics and TESL. The classes seem more focused on what I’m interested in and the director has reached out to me multiple times to offer help and check up on my application/offer. (Also 3 generations of my family went to this school)",
    "title": "Grad school options; what do I do? HELP",
    "subreddit": "Teachers",
    "timestamp": 1616509926,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "Can others familiar with the higher education teaching world offer their perspective on quitting mid-year?  \n\nWhat up fam, how's it going?\n\nI was able to land a 1-year lecturer position at a liberal arts college, because the teacher before me quit suddenly before the start of the semester, and they needed an emergency hire. I've been there for 1 month, and I already think I need to quit as well. My current plan is to extend to them the courtesy of staying until the end of the Fall semester, at which time there is a winter break, and I can give my two-weeks notice before the start of the Spring semester.\n\nI've seen similar posts here recently about similar subjects (been at a workplace a month, toxic culture, should I go, etc.), and **I was wondering if someone familiar with the higher ed teaching world can offer some perspective**. I'll list my situation below, starting with the most serious reasons I'm thinking of leaving, then continue in descending order.\n\n* The department is badly mismanaged, to the point where it creates so much more unnecessary work for everyone, including me. The director requires a large amount of redundant processes to be required, which I've never seen at comparable schools (I compare it to a Rube Goldberg machine, like in the *Looney Toons* cartoons). The same director has elaborate explanations which make no sense, for why we do these time consuming, busy work processes. I have thus far worked 10-hour days Monday-Friday, and 6-hour days over the weekends and holidays in good faith, trying to catch up and show the department that I'm a team player.\n* I was provided with little guidance or direction when I was hired a few days before the first day of class. The director wasn't able to provide me with basic information about the classes he wanted me to teach, despite being there for 30 years. The department is taught in a \"these are your classes, these are my classes, figure it out\" kind of style, which in my experience is more the rule than the exception in American Higher ed.\n* My classes are the most difficult in the department, and were given to me despite having no time to prepare and being completely unfamiliar with the school. Naturally this has resulted in **even more work for me**. The director knows this, but gave them to me anyway; he just told me that he and the other teacher already had their materials prepared for their classes.  \n\n   * The director wanted me to dig through hundreds of computer files from previous teachers, collected over the years that he has been there, in order to piece together materials for my class. The files are kept in a disorganized computer folder, and even using the search function is of little help to me. I simply didn't have the time between my HR orientations and lesson preparations to dig through the decades of old computer files.\n* As I was creating the course essentially from scratch (again, not unusual in American higher ed), I was starting to fall into a rhythm for what we would do daily, weekly, and big picture through the semester. I was happy with how the classes were beginning to take shape, and I used modern educational research and approaches for classroom activities and assignments.  \n\n   * The director contacted me suddenly by email during my 5th week there, and told me that my approaches weren't acceptable for his program. He required me to scrap what I'd been doing the previous 5 weeks, and do convoluted assignments that he had created while using similar \"Rube Goldberg machine-esque\" processes that seem to dot the environment. As you may have guessed, this created EVEN MORE WORK, on top of the work I already had which was taking me 10 hours a day during the week, and 6 hours a day on weekends/holidays. The director offered an extended monologue for why he wanted me to use these convoluted assignments; the explanations again made no sense. **As an aside, I am an expert with a graduate degree from the top program in the US in our field.**  \n\n      * The students naturally were disappointed, because I set up my class in line with modern educational research, and the director is now making them memorize lists and complete rote mechanical exercises. All of this 5 weeks after the semester began, and with the director stepping in condescendingly changing our course structure with reasons that don't make sense.\n      * **The director's sudden intervention triggered me to have a panic attack on that same day**, and I needed to leave campus immediately to relax. I have been taking time away from a newborn baby and family, because I was so grateful to have a full-time job with benefits (rare in higher education).\n* After I calmed down the next day, I lost all motivation for bettering the program, and began approaching my position with a \"one foot out the door\" mentality. My weeks and countless hours of work felt in vain. I would quit now, but...\n* As is typical of teaching jobs, I am paid for winter and summer breaks. HOWEVER, there have been hints that I would need to work though said breaks on even more convoluted projects from the director, all with elaborate explanations that don't make logical sense. As such, I'm no planning to do what the previous teacher did: string the department along until the last moment, and quit before the start of the new semester so that I get paid as much as possible during the winter break.\n* The school itself is...a weird one. If I get more specific, I'd out myself. I'm planning on doing an AMA in a few months using an alt about my experiences there, on another subreddit. Essentially, it is affiliated with an infamous religious cult, which uses the school for money laundering purposes. I only was interested in teaching there because the campus is beautiful, and I thought I could compartmentalize the religious cult from my job. It's difficult, and the cult atmosphere is everywhere on campus, not to mention that the job has essentially taken over my life. The cult leader's presence is imposed every where on campus.\n\nLastly, and this one's important...\n\n* The teaching field in higher education is not exactly robust. 80% of the teaching workforce in American schools are part-time adjuncts, and hiring preference for full-time positions is given to diversity hires. **The point being that I would not be moving on to a robust job market in this field**.\n\nI'm currently working on an exit plan, which would involve me teaching part-time somewhere as an adjunct, and getting another degree in a more robust field. I would be taking a pay cut, but it might be worth it to get away from what I believe is a toxic environment.\n\nI would deeply appreciate if those familiar with teaching could throw their two cents into my situation.",
    "title": "Can others familiar with the higher education teaching world offer their perspective on quitting mid-year?",
    "subreddit": "careerguidance",
    "timestamp": 1634522728,
    "score": 3,
    "keyword": "american director"
  },
  {
    "text": "How do I respond to an offer to work in Korea for my company for 6 months? I work in the US as a Program Manager (Coordinator) for a Korean based Tier 1 supplier. I have only worked there for 4 months and I heard this week from my Launch Manager that I may be asked by our Korean Managing Director if I would be willing to go to Korea for 6 months. This would be to learn more about how the main Corporate office conducts launching new programs and about a particular product that is new to the North American Plant I work at. \n\nI understand that at 4 months on the job that this would be a considerable offer. I have no children and my Wife would be supportive. Sure, we'd missed each other. I imagine the pressure would be immense, but nothing more than I would place on myself. \n\nI never really considered this to be a possibility when looking at the broad scope of my career at the company.\n\nI have some questions I would like help with, but maybe there are some other questions I'm not asking myself.\n\nIs this opportunity too good to pass up?\nIs there a giant red flag I am missing?\n\nWhat should I expect them to provide? I assume that living expenses (Quarters, Food, Phone, & Transportation) would be paid by the company. I wouldn't want to leave something on the table (Compensation or time back home).\n\nAny advice or perspective would be welcome. I know this is all a \"What if\" scenario, but I want to be prepared for it and not make an uneducated decision if it happens. Thanks!",
    "title": "How do I respond to an offer to work in Korea for my company for 6 months?",
    "subreddit": "careerguidance",
    "timestamp": 1637860720,
    "score": 3,
    "keyword": "american director"
  },
  {
    "text": "Should I have patience and wait for improvements or jump ship now? Location: UK (not London) \n\nI left my fast paced agency side dream job because of workplace bullying from my manager.\n\nI told myself, if im leaving, then wherever I go has to be crazy different, a new challenge. I also wanted to move into a bigger team of my specialism because it’s been a bit lonely. \n\nHaving worked agency side all my career, I decided to dip my toes into a in-house role for an ecom business. I was told by the recruiter they’re taking digital seriously and want to build a product team and myself alongside a UX director would take lead as first recruits. They told me I’d fit right in due to my experience in a fast paced agency as their business works fast too. They assured me they’ll grow the team fast too. They didn’t reveal too much about benefits which I thought maybe they’re keeping it hush until I join… turns out they just don’t really have benefits besides a decent annual leave allowance. In addition, when they said the business is fast, I thought they meant they deliver outputs fast but it’s more like they change their minds on projects quickly. \n\nThe first day I joined, I was told I was suddenly reporting to someone else (not my hiring manager) in a completely different team and the UX director never accepted the offer so it’s just me in this product team. The talks of growing the team fell pretty silent too. I was promised they have a strong Dev team albeit based in America. Turns out this wasn’t accurate either. The American Dev team are third party and we aren’t allowed to use them for minor projects. We have two in-house devs which I’ve since found out they are utterly useless. \n\nI’m 4 months into this role (passed probation) and none of my work has been delivered (implemented) because of how incompetent the devs are and the amount of technical debt that was accrued before I joined needed addressing. There has been other red flags as well. I told my manager (chief digital officer) I feel progress is stalled and it’s demoralising. He responds saying things will improve but it takes time. I’ve worked out it’s realistically going to take 12 months before we get anywhere. \n\nThere are employees who have been here for years who has simply coasted their way, delivering mediocre work and I dread that could be me. \n\n4 days ago, I started to look on the job market just incase, and the next thing I know, I’ve got two confirmed first interviews with a potential two other roles who might be interested. \n\nDo you think I should wait out and stay at my current role or move on before I get complacent at what I do?",
    "title": "Should I have patience and wait for improvements or jump ship now?",
    "subreddit": "careerguidance",
    "timestamp": 1624365576,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Laid off from FTE now they want me back as a contractor  \n\nI was laid off my FTE job last December after 10 years (VERY LARGE American telecom firm) due to a reduction in force. They told me I can come back as a contractor in 6 months. My previous pay was 105k a year + about a 5% year incentive bonus and included decent healthcare/401k/stock options.\n\nThe phone rang the other day with my old manager and director telling me to come back and offering $85/hr w2 through a contracting firm that would pay via w2. I asked them about benefits and whatnot and they said \"ask the contracting firm\", indeed/glassdoor tells me these benefits are crap and you dont get paid for days off, no 401k match, etc. I asked them about \"exclusivity\" (ie i can work another contract at the same time) and they said no. To me it sounds like they want me back as an employee with all the loyalty that comes with it but are not giving it back. Also, the contract is year to year and I have to get a renewal with them each year.\n\nSo with that whats the pros/cons with going back to my old job this way? Seems like a shit sandwich deal for me but great for them. Am I missing something or is this offer garbage? I have seen a lot of peers go down this path but I am not sure why - maybe because the company is all they ever knew.\n\nMy skillset is very marketable and I have another FTE job I am working now that is paying 130k + 10-15% bonus with all benefits, 401k matching, stock options, etc. I am think I would be a moron to walk away from this for a contract gig at my old employer who let me go out the door.",
    "title": "Laid off from FTE now they want me back as a contractor",
    "subreddit": "cscareerquestions",
    "timestamp": 1616756848,
    "score": 5,
    "keyword": "american director"
  },
  {
    "text": "How to complain against boss in small company So I am the lead of the R&D team in a company of 25. I report directly to the second-in-line of the company, whose official title is “Director of Development”. \n\nMy boss is an extreme narcissist who micromanages, doesn’t listen when we say something can’t work and isn’t worth the effort (both true, every time), disrespects everyone, devalues everyone with sly comments, threatens to nullify bonuses etc. \n\nWith only the CEO above him in a small company, I see it as risky to go directly to the CEO, because I feel my boss will somehow lie his way out of my complaints, as he always does. I have a few recorded videos of him straight up leaving calls while people are trying to talk to him, examples of his devaluing comments, and lying that he made decisions that caused everything to break. The worst one shows him being incredibly insensitive (joking) about how my cat got killed by coyotes the day beforehand. \n\nI got a written performance warning from him yesterday. My team and I know that it’s because of his managing.  If I file an complaint, he will definitely put our missed goals against me. The team (whom have been with the company for 4 years, me 7 months) will probably not join the complaint because their culture (Japanese under an American boss) unfortunately is submissive. \n\nMy question is: what should I expect if I file an complaint and speak to the CEO? Should I even do it? My boss is extremely good at sliding by tough situations with his charm. Options are to just bear with him and continue looking for a job, or complain about my boss and start massive turmoil within the company I love. Both options are very stressful, consequences imposed on my fellow coworkers, and involve feelings of loss.\n\nI love this company and the opportunity I’ve been given to make an product that will make an difference in the real world. I don’t want to lose that, but the absurdity of my boss is just too much to bear. Yes, I have had conversations with him regarding his actions, and he does not take responsibility or take steps to change his behavior.\n\nRegardless, I’m grinding leet code and getting ready for interviews, because I legitimately can’t work under this guy.\n\nI guess this turned into more of an venting post…\n\nEdit: CEO is HR btw",
    "title": "How to complain against boss in small company",
    "subreddit": "cscareerquestions",
    "timestamp": 1634418659,
    "score": 0,
    "keyword": "american director"
  },
  {
    "text": "MBB + Big 4 Canadian Salary Thread 2021 As there's a lot of disparity among salaries within North American Market, let's share Canadian salaries here. USD vs CAD is like comparing apple to oranges. That said. you know the drill.\n\n**Format:**\n\n1. Firm Type: (e.g. MBB **or** Big 4 **or** if Other please mention name)\n2. Market/Office: (e.g. Toronto/BCG Toronto/HCOL)\n3. LOS/Vertical/Practice: (e.g. Advisory/BCG Digital)\n4. CY Level: (e.g. A1->A2, S1->S2, S3->M1,M1->M2 etc)\n5. C$: (Salary + Bonus + Benefits)\n6. Additional/Optional: (MBA, Experienced Hire, Lateral Entry, Double Promotion, Travel Perks etc.)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**P.S:** If you're not from a MBB or BIG 4, you're still very welcome to add value here, we Canadians love each other :)\n\n**Generic** Levels/Bands info for n00bs -\n\nA1, A2, A3 --> Associates\n\nSA1, SA2, SA3 --> Senior Associates\n\nM1, M2/M3 --> Manager\n\nSM1, SM2 --> Senior Manager\n\nD1, D2, D3 --> Partner, Senior Partner, Practice Lead, Executive Director, Managing Director\n\n**Generic** COL examples\n\nHCOL --> Toronto, Vancouver, Montreal\n\nMCOL --> Ottawa, Edmonton\n\nLCOL --> Calgary, Winnipeg",
    "title": "MBB + Big 4 Canadian Salary Thread 2021",
    "subreddit": "consulting",
    "timestamp": 1616712613,
    "score": 103,
    "keyword": "american director"
  },
  {
    "text": "Crystal Windham. Executive Director of Global Industrial Design at General Motors. First Black American female director at GM (2008), her awarded car interiors include the Chevrolet 'Malibu' (2016) and 'Impala' (2014). She became Cadillac's Interior Design Director in 2016.",
    "title": "Crystal Windham. Executive Director of Global Industrial Design at General Motors. First Black American female director at GM (2008), her awarded car interiors include the Chevrolet 'Malibu' (2016) and 'Impala' (2014). She became Cadillac's Interior Design Director in 2016.",
    "subreddit": "blackladies",
    "timestamp": 1634116640,
    "score": 128,
    "keyword": "american director"
  },
  {
    "text": "Johnnetta B. Cole (84) & Tiffany D. Loftin (32) have an amazing intergenerational conversation https://www.facebook.com/watch/?v=516562173062841\n\n- Dr. Johnnetta Betsch Cole is an American anthropologist, educator, museum director, and college president. Cole was the first female African-American president of Spelman College, a historically black college, serving from 1987 to 1997. She was president of Bennett College from 2002 to 2007. During 2009–2017 she was Director of the Smithsonian Institution's National Museum of African Art.\n\n- Tiffany Dena Loftin was the National Director of the NAACP Youth & College Division at the NAACP.  She was appointed by President Barack Obama to serve on the White House Initiative on Educational Excellence for African Americans in Higher Education",
    "title": "Johnnetta B. Cole (84) & Tiffany D. Loftin (32) have an amazing intergenerational conversation",
    "subreddit": "blackladies",
    "timestamp": 1619671246,
    "score": 4,
    "keyword": "american director"
  },
  {
    "text": "Gah that American \"math\" team post on the front page really bothered me. I get it, it's a casual joke. Asians tend to dominate math competitions. But more importantly, the sense that even though you're winning a competition for America and are American through and through, you're still a foreigner in your own country.\n\nIt used to drive me insane when people asked me \"where are you really from\". I'd want to reply well started in Alabama, moved to Chicago when I was still young before school, and now I work in New York. I would carry my passports out in airports like a badge of honor so people would know I'm \"american\". \n\nAnd it took me decades to unfurl the toxic defense mechanisms I spent my life throwing up. Growing up, I vehemently rejected Asian culture. I hated my name so I changed it legally. I beat the shit out of my body playing lacrosse at a high level because it was the whitest sport (all conference and even then I was known in the conference as the \"asian kid\" or the \"chinky boy with skills\"). I attended a fucking US military academy for a year instead of a top 5 school initially because I wanted to show the world how American I was. \n\nIt took me until 25 and working in Asia on projects for half the year to finally get it. To finally be in a place where the assumption isn't I'm a math guru or code monkey. Where my managing directors don't assume I'm a work horse and nothing more. Where instead of preparing the deck for sales meetings, I got to actual drive the meetings and lead. But more importantly, as I matured, I understood so much more about myself and why I am the way I am.\n\nI never realized how much growing up in the midwest as one of the only Asians in my school would impact my sense of self. My obsession with fitting in and being \"american\" led me to completely reject so much of what makes me well, me. \n\nThis current movement of Asians standing up for themselves and doing it together makes me so fucking proud. I now realize my history and culture isn't just that of China but it's about the workers brought here to build the railroads. The asian communities that popped up early on that suffered untold racism and abuse. The Chinese exclusion act and the Japanese internment camps are some of the most atrocious decisions by my country. But I'm so fucking proud to be part of that history. To know that the strength to endure untold hardship and sacrifice for the future generations flows through me and is part of my history and culture means everything. So thank you to all the activists and people stronger than me who push the narrative. You guys have made me so proud to be Asian American and my children will love and embrace their culture and heritage in a way I never allowed myself to. So thank you.",
    "title": "Gah that American \"math\" team post on the front page really bothered me.",
    "subreddit": "asianamerican",
    "timestamp": 1621955598,
    "score": 118,
    "keyword": "american director"
  },
  {
    "text": "The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead",
    "title": "The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead",
    "subreddit": "asianamerican",
    "timestamp": 1617918532,
    "score": 112,
    "keyword": "american director"
  },
  {
    "text": "Game Changers: 'Crazy Rich Asians' filmmaker Jon M. Chu is 'no longer scared of being called an Asian American director'",
    "title": "Game Changers: 'Crazy Rich Asians' filmmaker Jon M. Chu is 'no longer scared of being called an Asian American director'",
    "subreddit": "asianamerican",
    "timestamp": 1622294593,
    "score": 104,
    "keyword": "american director"
  },
  {
    "text": "'Crazy Rich Asians' director Jon M. Chu: 'The American dream is not a given'",
    "title": "'Crazy Rich Asians' director Jon M. Chu: 'The American dream is not a given'",
    "subreddit": "asianamerican",
    "timestamp": 1620132198,
    "score": 43,
    "keyword": "american director"
  },
  {
    "text": "List of Asian leads in North American movies and TV in 2021 Asian and Pacific Islander*\n\nProbably missing some, but these are ones I know of:\n\n**Movies**\n\n* **January 29:** Finding Ohana\n* **February 12:** Minari (limited theatrical release)\n* **March 5:** Boogie\n* **March 5:** Raya and the Last Dragon (animation)\n* **April 26:** Mortal Kombat\n* **May 7:** [The Paper Tigers](https://old.reddit.com/r/asianamerican/comments/mzs5ai/quoc_bao_trans_the_paper_tigers_movie_screening/) (limited theatrical release) - tomorrow!\n* **May 14:**  Army of the Dead\n* **June 11:** Wish Dragon (animation - English dubbed)\n* **July 23:** Snake Eyes: G.I. Joe Origins\n* **September 3:** Shang-Chi and the Legend of the Ten Rings\n* **November 5:** Eternals\n* **December 1:** Fistful of Vengeance (Wu Assassins)\n\n**TV Shows**\n\n* **January 5:** Kim's Convenience (season 5 - final season)\n* **January 15:** Bling Empire\n* **March 26:** Invincible (animation)\n* **March 26:** The Irregulars (recently canceled)\n* **April 7:** Kung Fu (reboot - recently renewed for season 2)\n* **April 14:** Announcement for Warrior season 3 (will return in 2023)\n* **July:** Never Have I Ever (season 2)\n* **TBA:** Cowboy Bebop live action series\n* **TBA:** Ms. Marvel\n* **TBA:** After Yang (by the same director, Kogonada, who made Columbus)\n\n**Honorable mentions**\n\n* \"**The Six**\" documentary: About the untold story of Chinese passengers on the Titanic. Released in China in April. International release date still pending.\n* \"**Far East Deep South**\" is a documentary about Chinese-Americans in the Mississippi Delta (on America ReFramed - currently available on PBS website until June)\n* May 23: **Master of None** season 3. Aziz Ansari won't be the main lead for the new season, but will still write and direct. New season will focus on another POC character, Denise, played by Lena Waithe who is also a writer on the show.\n* **Nomadland** was directed by Chloe Zhao who won several awards for this film including Best Director at the Oscars. She will also direct a Marvel movie, **Eternals**.",
    "title": "List of Asian leads in North American movies and TV in 2021",
    "subreddit": "asianamerican",
    "timestamp": 1620330077,
    "score": 38,
    "keyword": "american director"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 35,
    "keyword": "american director"
  },
  {
    "text": "Director Anne Hu Returns to Native Cleveland to Film New Short on Growing Up Asian-American and Family",
    "title": "Director Anne Hu Returns to Native Cleveland to Film New Short on Growing Up Asian-American and Family",
    "subreddit": "asianamerican",
    "timestamp": 1624971032,
    "score": 9,
    "keyword": "american director"
  },
  {
    "text": "Quoc Bao Tran's \"The Paper Tigers\" movie screening locations and streaming options for next week * [List of screening locations](https://www.facebook.com/tranquocbao/posts/10161539002213636) - Opens May 7\n\n(The director will update that post if he adds more confirmed theaters)\n\nStates not in alphabetical order. Cinemark also has an option to book a screening for yourself and a group up to 20 people for $149\n\n\n**Rental streaming options:**\n\n* Apple TV / iTunes\n* Prime Video (Amazon)\n* Google Play / YouTube Movies\n* Vudu\n* Microsoft Store / Xbox\n* Sony / PlayStation\n* FandangoNOW\n* Comcast Xfinity\n* Charter / Spectrum\n* DirecTV\n* AT&T U-verse\n* Cox Communications\n* Verizon\n* Frontier Communications\n\n**Other info:**\n\nYuji Okumoto from The Karate Kid 2, Cobra Kai is one of the producers and guest appearances. Other appearances include MartialClub (YouTube), Roger Yuan and other martial artists.\n\n**Previous threads:**\n\n* [The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead](https://np.reddit.com/r/asianamerican/comments/mn2exb/the_paper_tigers_may_7_crowdfunded_martial_arts/)\n\n* [The Paper Tigers - Kickstarter for Kung Fu Indie Film](https://np.reddit.com/r/asianamerican/comments/9tdb74/the_paper_tigers_kickstarter_for_kung_fu_indie/) - The director posted on here a couple years ago with their Kickstarter",
    "title": "Quoc Bao Tran's \"The Paper Tigers\" movie screening locations and streaming options for next week",
    "subreddit": "asianamerican",
    "timestamp": 1619540356,
    "score": 10,
    "keyword": "american director"
  },
  {
    "text": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community Related post: [Bao Tran: Hollywood Wanted Me to Make My Martial Arts Characters White, But My Ancestors Wouldn’t Have It](https://np.reddit.com/r/asianamerican/comments/n6vh71/bao_tran_hollywood_wanted_me_to_make_my_martial/)\n\nNotes from [Well Go USA's press kit](https://www.wellgousa.com/films/the-paper-tigers):\n\n**DIRECTOR’S STATEMENT**\n\nTell someone you’re making a Kung Fu movie and everybody has a clear idea of what they’re in for. For a  genre that has such vivid connotations also comes preconceived expectations and, dare I say,  stereotypes.\n\nA Kung Fu movie about out-of-shape fighters should have been easy for us to finance, but it took us 9  years of conversations like this:\n\n**Savvy White Financier**: “I love the Kung Fu movies. Love the wirework where they fly around, so  cool.”\n\n**Me**: “Great. Except we’re not doing wirework, our characters are schlubs past their prime. We want to  show them struggle with gravity, not defy it.”\n\n**SWF**: “But you gotta have the dubbing, that’s so hilarious.” \\*mimes dialogue while contorting their  mouths\\*\n\n**Me**: “Yeah no, our characters speak English in their own voices without any accents.”\n\n**SWF**: “They’re all American?”\n\n**Me**: “Ensemble piece with Asian and Black American lead characters. See, it’s a reflection of how I grew  up in Seattle…”\n\n**SWF**: “Can you change them to be white?”\n\n**Me**: “Hm. Okay. Well, this is about characters stuck between two cultures. The Kung Fu world is steeped  in Confucian, arcane, hierarchical values that is so at odds with modern American sensibilities.”\n\n**SWF**: “Bruce Willis!”\n\n**Me**: “Sorry?”\n\n**SWF**: “If you get Bruce Willis, we’ll fund your movie. Right now it’s too risky with no real names  attached. There’s no bankable Asian or Black stars that can sell your movie.”\n\nThen you have the militant fellow Asian American:\n\n**Militant Asian American:** “Why are you setting our people back? Hollywood has only portrayed us  Asian men as Kung Fu masters or Triad henchmen. We have to tell different stories.  #RepresentationMatters!”\n\n**Me:** “But I like Kung Fu. And Jackie Chan was really the one who inspired me to make movies.”\n\n**MAA:** “No, you need to do something like The Farewell or Saving Face. You know, real Asian American  experience stories.”\n\n**Me:** “Can’t we do it all and support each other in telling whatever stories we want to tell? This is not  Highlander, there can be more than one.”\n\n**MAA:** “You’re just perpetuating stereotypes. Bullies used to call me Bruce Lee and tease me because  they thought all Asians could do Kung Fu.”\n\nSo if your tribe doesn’t find you, you go out and build it. We eventually turned to Kickstarter and our local  community of private investors. The ones who “got it” recognized themselves in the story and/or Asian Americans in lead acting, producer, and director roles. But through it all, we always aimed for more,  hoping to expand the idea of what a Kung Fu movie or an Asian American film could be.\n\nI found this in my old director notes, written for various grant proposals or some investor documents  throughout the years: “We want that blue-haired grandma in Iowa, who has not a mean bone in her  body, to root for Danny by the end of the movie.”\n\nAt the end of the day, you can’t please everyone, but watch us try. Grannies of Iowa, be ready!\n\n\\--\n\nBao Tran",
    "title": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community",
    "subreddit": "asianamerican",
    "timestamp": 1622247264,
    "score": 11,
    "keyword": "american director"
  },
  {
    "text": "[Remote Job] IMPACT DIRECTOR - Asian American Documentary Network (A-Doc)",
    "title": "[Remote Job] IMPACT DIRECTOR - Asian American Documentary Network (A-Doc)",
    "subreddit": "asianamerican",
    "timestamp": 1631205685,
    "score": 11,
    "keyword": "american director"
  },
  {
    "text": "Meet the co-directors of the Coalition for Asian American Children and Families",
    "title": "Meet the co-directors of the Coalition for Asian American Children and Families",
    "subreddit": "asianamerican",
    "timestamp": 1615652694,
    "score": 8,
    "keyword": "american director"
  },
  {
    "text": "NYC ASIAN AMERICAN CASTING CALL I am a casting associate at Kate Antognini Casting and we are currently working on casting a new short film about an Asian American man on a quest to find his delivery bike after it is stolen. The film is about the importance of family and the Asian American immigrant experience in New York City. We are open to both real people and actors for the roles. You do not need to have any training as an actor to be considered. The director is very open to working with someone with no experience on camera. Please let us know if you are interested or if you have any questions. I've attached the poster and I've included more information about the film below.\n\n\\*Please note the director will tailor the film to whatever your native language is, so don’t worry if you aren’t a fluent English speaker as you will be speaking primarily in your native language.\\* \n\n“Same Old” follows Lu, an undocumented Asian immigrant who came to the US with his wife and son only 10 years ago. Exhausted, he works every day as a food delivery driver to support his family during the pandemic. After his bike is stolen, he desperately searches the streets of NY to find it - his only lifeline to keep his family afloat.\n\nBelow are some information and a flyer on the project. You can submit an application here: [https://airtable.com/shr1rhtBptKlAa0kd](https://l.facebook.com/l.php?u=https%3A%2F%2Fairtable.com%2Fshr1rhtBptKlAa0kd%3Ffbclid%3DIwAR1ZtcE7FHstyVTTqnmMRznn_Cm7P8uxxSgGtuqk_-O0D2GXU1NjnW45eNI&h=AT0WiNUpfECHwx-LWukcmYLU-KUw-rQz0sO8IlDgEkmO-3ti7X-GuuBhfPQgj0zOyAj0HAjfyU3Pah7VpJN9VtFPQLa8ZthbP3NrOQzySFNTOM30OKjuiZjjTVYDeSEyrQ1yFVP6&__tn__=-UK-R&c[0]=AT1DIEnQ5E433v2dcCqRZO9EyJ3IPEynDx6w4GyHzp2axOzQoftWn2PCYg-ubOcYkzj_S5bvCqmKqzrZPUMsWKxGZ5BCbhJnamOPv11yVQOWU-oVKrMCXyeAOsA7sYZevu78fI063kYBrmwiF-JzTmp6x8AiNC3xkQo5dzPJihTAuvu1FFBQhN8yl_ygocebjyvYtdf-rp9-Z0rXqg) Please try to submit ASAP. \n\n**PROJECT DETAILS:**  \n**Project: \"Same Old\" Short Film**  \n**Talent Rate: $300-400 Per Day**   \n**Shoot dates:  March TBD (1-4 days depending on role/will work around availability)**  \n**Shoot Location: NYC**  \n\n\n**Breakdown:**  \n\n\n**LU (Asian) Age 40-60: Male. Must be able to ride a bike comfortably. Must be fluent in their own cultural language. \\*Bonus if a real delivery driver\\***  \n\n\n**MING(Asian) Age 40-60:Female. Must be fluent in their own cultural language.**   \n\n\n**GARAGE OWNER (Asian) 40+: Male. Must be fluent in their own cultural language.**   \n\n\n**DANNY (Asian) 20s: Male. Disabled.**\n\nProduction will be adhering to strict COVID-19 precautions to ensure safety of all. The crew will also be wearing PPE and all crew members will be tested on an ongoing basis.",
    "title": "NYC ASIAN AMERICAN CASTING CALL",
    "subreddit": "asianamerican",
    "timestamp": 1613774117,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "History of Mary P. Koss and rape laws. And important data that clearly shows that scale of rapes perpetrated by women are higher than people commonly think. This is big scale issue, not less prevalent than rapes perpetrated by men! Let me introduce you to Prof. Mary P. Koss:\n\nFor statistical reporting, rape has been carefully defined as forced penetration of the victim in most of the world. You should listen to this feminist professor Mary P. Koss explain that a woman raping a man isn't rape. [Hear her explain in her own voice just a few years ago](https://clyp.it/uckbtczn). I encourage you to listen to what she is saying. (Really. Listen to it! Think about it from a man's perspective.)\n\nShe is considered the foremost expert on sexual violence in the US. **She is the one that started the 1 in 4 American college women is sexually assaulted myth by counting all sorts of things the \"victims\" didn't.** A man misinterpreting a situation going in for a kiss and then backing off when she pulls back, puts up her hand, or turns her cheek is a sexual assault on a woman. **As you hear in her own words the woman's studies professor and trusted expert that literally wrote the book on measuring prevalence of sexual violence does not call a woman drugging and riding a man bareback rape ... or even label it sexual assault ... it is merely \"unwanted contact\".**\n\nYou see she has been saying this for decades and was instrumental in creating the methodologies most (including the US and many other government agencies around the world) use for gathering rape statistics. E.g.:\n\nDetecting the Scope of Rape : A Review of Prevalence Research Methods. Author: Mary P. Koss. Journal of Interpersonal Violence Volume: 8 Issue: 2 Dated: (**June 1993**) Page: 206\n\n>Although consideration of male victims is within the scope of the legal statutes, it is important to restrict the term rape to instances where male victims were penetrated by offenders. It is inappropriate to consider as a rape victim a man who engages in unwanted sexual intercourse with a woman.\n\n[Source.](http://boysmeneducation.com/wp-content/uploads/2014/01/Koss-1993-Detecting-the-Scope-of-Rape-a-review-of-prevalence-research-methods-see-p.-206-last-paragraph.pdf)\n\n**She is an advisor to the CDC, FBI, Congress, and researchers around the world and promoting the idea that men cannot be raped by women.** There was a proposal to explicitly include forced envelopment in the latest FBI update to the definition of rape but after a closed door meeting with her and N.O.W. lobbyists, it mysteriously disappeared. She has many many followers and fellow researchers that follow her methodology and quote her studies. That is where most people get the idea rape is just a man on woman crime. Men are fairly rarely penetrated and it is almost always by another man.\n\nMost people talking about sexual violence refer to the \"rape\" (penetrated) numbers as influenced by Mary Koss's methodologies, but in the US the CDC also gathered the data for \"made to penetrate\" (enveloped) in the 2010, 2011, and 2015 NISVS studies.\n\nAs an example lets look at [the 2011 survey numbers](https://www.cdc.gov/mmwr/preview/mmwrhtml/ss6308a1.htm):\n\n>**an estimated 1.6% of women (or approximately 1.9 million women) were raped in the 12 months before taking the survey**\n\nand\n\n>The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\n\nvs\n\n>**an estimated 1.7% of men were made to penetrate a perpetrator**\n\nand\n\n>Characteristics of Sexual Violence Perpetrators For female rape victims, an estimated 99.0% had only male perpetrators. In addition, an estimated 94.7% of female victims of sexual violence other than rape had only male perpetrators. For male victims, the sex of the perpetrator varied by the type of sexual violence experienced. The majority of male rape victims (an estimated 79.3%) had only male perpetrators. For three of the other forms of sexual violence, a majority of male victims had only female perpetrators: being made to penetrate (an estimated 82.6%), sexual coercion (an estimated 80.0%),\n\nSo if made to penetrate happens each year as much as rape then by most people's assumed definition of rape then men are half of rape victims. **If 99% of rapists are men and 83% of \"made to penetrators\" are women ... then an estimated 42% of the perpetrators of non-consensual sex in 2011 were women.**\n\nBut since made to penetrate is not rape, the narrative is that men are rapists and women are victims and boys/men that are victims are victims of men. Therefore most of the gender studies folks create programs to teach men not to rape (e.g. [here](https://www.reddit.com/r/science/comments/3rmapx/science_ama_series_im_laura_salazar_associate/)). Therefore there is justification for having gendered rape support services which means almost none for males victimized by females.\n\nAnd before you think that was just one study, it wasn't. The prior year numbers have been pretty close between the sexes every year, and that's before the fact that male victims go much more under reported than female victims.\n\n[2015 survey results](https://www.cdc.gov/violenceprevention/pdf/2015data-brief508.pdf)\n\n[2010 survey results](https://www.cdc.gov/violenceprevention/pdf/cdc_nisvs_ipv_report_2013_v17_single_a.pdf)\n\n[Scientific American](https://www.scientificamerican.com/article/sexual-victimization-by-women-is-more-common-than-previously-known):\n\n>*data revealed that over one year, men and women were equally likely to experience non-consensual sex, and most male victims reported female perpetrators. Over their lifetime, 79 percent of men who were “made to penetrate” someone else (a form of rape, in the view of most researchers) reported female perpetrators. Likewise, most men who experienced sexual coercion and unwanted sexual contact had female perpetrators.*\n\nAnd non CDC study...\n\n>*A recent study of youth found, strikingly, that females comprise 48 percent of those who self-reported committing rape or attempted rape at age 18-19.*\n\n[The Atlantic](https://www.theatlantic.com/science/archive/2016/11/the-understudied-female-sexual-predator/503492/)\n\nAnother non CDC study...\n\n>*a 2014 study of 284 men and boys in college and high school found that 43 percent reported being sexually coerced, with the majority of coercive incidents resulting in unwanted sexual intercourse. Of them, 95 percent reported only female perpetrators.*\n\nAnd another non CDC study...\n\n>*National Epidemiologic Survey on Alcohol and Related Conditions found in a sample of 43,000 adults little difference in the sex of self-reported sexual perpetrators. Of those who affirmed that they had ‘ever forced someone to have sex with you against their will,’ 43.6 percent were female and 56.4 percent were male.”*\n\n[Time](http://time.com/3393442/cdc-rape-numbers)\n\n>*when asked about experiences in the last 12 months, men reported being “made to penetrate”—either by physical force or due to intoxication—at virtually the same rates as women reported rape (both 1.1 percent in 2010, and 1.7 and 1.6 respectively in 2011).*\n\nJust maybe, rape isn't a gendered issue and we should stop treating it like one. But if we acknowledge that, then we would have to point the blame at \"rapists\", rather than \"men\". RAINN data, along with CDC reporting data, and all other data surrounding rape in the western world has been specifically designed by feminists to exclude men.\n\nThere's also [this](https://www.city-journal.org/html/campus-rape-myth-13061.html) article I came across a while back, via The City Journal, about 'The Campus Rape Myth' which provides some additional context.\n\n>None of this crisis response occurs, of course—because the crisis doesn’t exist. During the 1980s, feminist researchers committed to the rape-culture theory had discovered that asking women directly if they had been raped yielded disappointing results—very few women said that they had been. So Ms. commissioned University of Arizona public health professor Mary Koss to develop a different way of measuring the prevalence of rape. Rather than asking female students about rape per se, Koss asked them if they had experienced actions that she then classified as rape. Koss’s method produced the 25 percent rate, which Ms. then published. Koss’s study had serious flaws. Her survey instrument was highly ambiguous, as University of California at Berkeley social-welfare professor Neil Gilbert has pointed out. But the most powerful refutation of Koss’s research came from her own subjects: 73 percent of the women whom she characterized as rape victims said that they hadn’t been raped. Further—though it is inconceivable that a raped woman would voluntarily have sex again with the fiend who attacked her—42 percent of Koss’s supposed victims had intercourse again with their alleged assailants. All subsequent feminist rape studies have resulted in this discrepancy between the researchers’ conclusions and the subjects’ own views. A survey of sorority girls at the University of Virginia found that only 23 percent of the subjects whom the survey characterized as rape victims felt that they had been raped—a result that the university’s director of Sexual and Domestic Violence Services calls “discouraging.” Equally damning was a 2000 campus rape study conducted under the aegis of the Department of Justice. Sixty-five percent of what the feminist researchers called “completed rape” victims and three-quarters of “attempted rape” victims said that they did not think that their experiences were “serious enough to report.” The “victims” in the study, moreover, “generally did not state that their victimization resulted in physical or emotional injuries,” report the researchers.\n\nBasically for years feminist were trying to prove rape was really common, but their own studies kept finding “too low numbers” (around 1%... which is already shockingly high). This should tell you something about what feminism really cares about, as few women being raped is viewed as a negative and unacceptable outcome, instead if something to celebrate... what feminism really cares about.\n\nThen in the late 80’s Mary Koss devised a study in which she asked college women numerous somewhat vague and ambiguous questions regarding there sexual experiences e.g. Have you ever with someone who gave you alcohol? And most importantly she never asked them if they had been raped. If a women answered yes to any of the vague questions, she marked them down as having been raped (or maybe sexually assaulted, I can’t remember). Even though by her own admission, over 60% of the women she categorized as having been raped explicitly said they did not consider themselves having been raped; and that the majority of the women who had had a bad sexual experience said they considered it to be simply a result of miscommunication between them and the man, and not anything of a criminal nature. And she acknowledges that it was strange that a large fraction of the women who she said were raped went on to have long term relationship with their supposed assailants. She then rationalized this by saying most of them ended after a year or something like that, so this was a sign something was awry from the start (well... most college relationship probably don’t last very long anyway). It also implies that a minority of the women went on to have a voluntary long term, multi year relationship with their supposed rapist.\n\nNeedles to say with this dubious and obviously flawed methodology she was able to claim that 1/5 campus women had been raped. And having found a practice that obtained the “correct” overinflated feminist results, her methodology became the feminist standard of all subsequent sexual assault research done by feminist (which is most of the research).\n\nBy the way a study from UCLA used the same methodology on college men, and surprise surprise it also found the around 20% of college men had been raped by women. Unfortunately instead of realizing the obvious and enormous flaw in the way the data was collected and interpreted, it concluded that men were also victims of a rape culture.\n\nWhich I’m not saying rape doesn’t happen, but definitely not at such a high rate. The proof is people still send their children to college, so clearly they don’t believe these numbers regardless of what they claim. You want to know what people believe, look at how they act, not what they say. In fact feminists, who are most adamant about the college rape crisis are usually the most involved in convincing and encouraging teenage girls to go to college (and I’ve never seen one even warn the girls or their parents about the rape hotbed they would be walking into by going to college... instead they tell the how supportive and caring the environment is... it’s not until they have arrived and the school has their money that the “you’re surrounded by sexual predators” bomb is dropped on them, and the only solution is to join some prof’s feminist/women’s advocacy group.\n\nAnd if that wasn’t enough, even if the 1/5 college women being sexually assaulted figure were true, it would not be evidence of a rape culture as it’s a matter of simple math to show that such shockingly high numbers could easily be achieved if only 1% or less of college men were rapists (the majority of violent crime in general is carried out by a very small fraction of the population who are continual repeat offenders).\n\nFinally, I strongly recommend [read](https://www.instagram.com/p/CIOIFX3gieB/) this infographics about the raised topic.",
    "title": "History of Mary P. Koss and rape laws. And important data that clearly shows that scale of rapes perpetrated by women are higher than people commonly think. This is big scale issue, not less prevalent than rapes perpetrated by men!",
    "subreddit": "MensRights",
    "timestamp": 1635531983,
    "score": 54,
    "keyword": "american director"
  },
  {
    "text": "Gender Disparity in College Attendance & Scholarships [WSJ had an interested/depressing article](https://www.wsj.com/articles/college-university-fall-higher-education-men-women-enrollment-admissions-back-to-school-11630948233?mod=hp_lead_pos12) on the decline in male college attendance and the disparity between female and male graduation rates. The article is surprisingly pro-male. Here are some facts from the article:  \n\n\n*Women increased their lead over men in college applications for the 2021-22 school year—3,805,978 to 2,815,810.*  \n\n\n *The gender enrollment disparity among nonprofit colleges is widest at  private four-year schools, where the proportion of women during the 2020-21 school year grew to an average of 61%.*  \n\n\n*The proportion of male undergraduates at UCLA fell to 41% in the fall  semester of 2020 from 45% in fall 2013. Over the same period, undergraduate enrollment expanded by nearly 3,000 students. Of those spots, nine out of 10 went to women.* \n\n*Young women appear eager to take leadership roles, making up 59% of  student body presidents in the 2019-20 academic year and 74% of student body vice presidents, according to W.H. “Butch” Oxendine, Jr., executive director of the American Student Government Association. “Across all types of institutions, particularly two-year institutions, but also  extending into public and private four-year institutions, women  dominate student government executive boards,” Mr. Oxendine said.*\n\n*Young men get little help, in part, because schools are focused on  encouraging historically underrepresented students. Jerlando Jackson, department chair, Education Leadership and Policy Analysis, at the University of Wisconsin’s School of Education, said few campuses have been willing to spend limited funds on male underachievement that would also benefit white men, risking criticism for assisting those who have historically held the biggest educational advantages.*\n\nIt can be inferred from the last paragraph that anti-white male bias is negatively affecting men in minority groups.\n\nAnecdotally I hear people bring up the need for female scholarships, as if it's common knowledge that there are more males than females both attending and graduating college. I checked [scholarship.com](https://scholarship.com) and found that there are 78 male-specific scholarships and 304 female-specific scholarships.  \n\n\n[https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/male](https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/male)\n\n[https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/female](https://www.scholarships.com/financial-aid/college-scholarships/scholarship-directory/gender/female)",
    "title": "Gender Disparity in College Attendance & Scholarships",
    "subreddit": "MensRights",
    "timestamp": 1631022158,
    "score": 29,
    "keyword": "american director"
  },
  {
    "text": "Light-hearted feminist-friendly film recommendations? I like watching rom-coms and teen movies because I generally watch movies to relax at the end of the week, whereas I read when I want to be challenged. However, most of these kinds of films are painfully sexist, among many other '-ist's. I really just want to watch films that have a light-hearted tone and are about the way people connect with each other, romantically or otherwise, and those two genres seem the closest thing I can find to doing that. I'm sick of movies that are depressing or violent.\n\nAs a queer woman who practices relationship anarchy, I don't expect to find movies that reflect my values exactly, but I was just hoping for something better than the bullshit I find on 'top 10 rom-coms' listicles. I also would like to watch more indie and international films (I'm Australian) as I don't vibe with most mainstream American humour, but I don't know how it is that people hear about those kinds of movies. If someone has a recommendation for an American movie that fits the bill, though, please share anyway, even if it's well-known!\n\nMy own recommendations for things that others in my position might like include Ladybird, Edge of Seventeen, Maggie's Plan, Juno, Little Miss Sunshine, An Education, and any of the films by the director Hirokazu Koreeda (my favourite movie is his Shoplifters, though it's not as lighthearted as the other films on this list. Like Father Like Son is a good one to start with).  The 1931 version of Madchen in Uniform is good too, and queer, though it gets dark towards the end. I also love You've Got Mail, and I enjoy older British rom-coms like Four Weddings and a Funeral, and Notting Hill. The quasi-polyamorous set-up in part of Bridget Jones' Baby was something I enjoyed as well. My Australian recommendation is Top-End Wedding, which is lots of fun and is one of few rom-coms I know that isn't from a completely white perspective.\n\nI'm sure there are others who feel similarly to me, so all recommendations would be super appreciated!",
    "title": "Light-hearted feminist-friendly film recommendations?",
    "subreddit": "Feminism",
    "timestamp": 1612143187,
    "score": 15,
    "keyword": "american director"
  }
]