[
  {
    "text": "How do you all deal with this shit? I am a licensed teacher in Japan (originally from America, but I moved to Japan and got a teaching license)\n\nI have been a member of this sub for a week, and I gotta say....if I was a teacher in the U.S. I would lose my fucking mind.\n\nLet me give you some examples why\n\n1. I usually teach English (because, duh) but every teacher in Japanese junior high schools is assigned a second subject, and once a week they will join that subject's lessons as like an assistant. So I basically go observe a social studies lesson once a week, and recently it was WW2, and the teacher said oh hey, David, can we ask you about America's point of view on WW2, and why you dropped the bombs. I stood up and said, the prevailing theory of why we dropped the bombs was to save lives, in 2 ways. One, save American lives by preventing a land invasion, and 2, save Japanese lives but scaring the shit out of the citizens of Japan to the point where they would give up. Dropping the atomic bomb on Japan was the best choice. And he said, could you stand in front of the dome in Hiroshima and say that? And I said, I could absolutely say that, because I wasn't alive, and that is what I was taught. And he thanked me after the lesson, and the kids asked me a few questions about if anyone in my family hates Japan (some of them do) and I answered honestly, and that was the end of it.\n2. I taught a lesson about how a large portion of the Japanese population is xenophobic, which can lead to foreign people, especially non-white foreign people feeling unwelcome. How Japanese people, especially Japanese people older than 40 seem to have a superiority complex, and it leadls to them thinking Japan is the only country on earth with \"X\", and how in America we have a lot of people who believe the same thing. The students/parents/principals were all super cool.\n3. A girl I teach was told she looks like a monkey by a boy (she's 15, so she was devastated) and she asked me if she was ugly, and I saw you are gorgeous and any boy with a brain would fall in love with you immediately. There was 2-3 other teachers nearby, and they all basically joined in saying similar stuff.\n4. I will start this one off by saying, Japanese kids can be waaaaaaaaaaaaaaaaaaaaay more innocent than American kids, and have a very child-like view of the world. So a 12 year old girl at my school, fresh to the JHS tried out a new shampoo, and was insanely excited how soft her hair got. So when she was coming into the school she said, oh sensei, look how soft my hair is, feel it, and immediately like threw her pony tail into my hand. I let it go immediatley, and just said wow that's amazing. However, her mom was standing right there, and complained to the assistant principal, who was also outside saying hi to students. The assistant principal immediately snapped back with, I don't know if you saw what I saw, but your daughter basically threw her hair into his hand, what was he supposed to do. If you don't want her to do that kind of thing, tell her it's inappropriate, I am sure he was much more uncomfortable than she was.\n5. Every time a fight happens inside the school, me, or another larger male teacher will go break it up, get the kids into seperate rooms, figure out what happened, talk to them for 20-30 minutes, and that's it. That's the whole story. There are no police, if there are no injuries and it was a first time occurence, than there is no escalation to parents, it's just chill.\n6. If a student is being a complete fucking menace, and preventing other student's from learning. Another teacher who is free during that period will come to the room, and essentially be that kid's watcher. If the kid continues to disrupt the class to the point where other students can't learn, then the extra teacher will take them somewhere else (the gym or something) and just hangout with them until they calm down.\n7. Anytime a parent complains about anything regarding curriculum/a teacher's behavior, the assistant principal/principal answers the same way, 100% of the time. I am sorry you feel that way, we are legally required to teach this curriculum, and there is nothing we can do to change that. If you have any further issues please contact your local representative.\n8. The pay is standard nationwide, and is roughly 1.25x the national average salary\n\n&#x200B;\n\nI don't know how the hell you guys do it.\n\nAlso, I really hope this post didn't read as, HA HA LOOK AT HOW GREAT MY LIFE IS , SUCKERS!\n\nThe whole reason I was inspired to get into teaching in the first place was a few teachers I had while growing up in America.\n\nI just can't believe how fucking terrible it is teaching in the U.S.\n\n&#x200B;\n\nP.S. - I pay for 0 of my school supplies.",
    "title": "How do you all deal with this shit?",
    "subreddit": "Teachers",
    "timestamp": 1687173017,
    "score": 3003,
    "keyword": "american principal"
  },
  {
    "text": "Was Made to Remove LGBT Page From Civil Rights Packet I'm currently a 5th and 6th grade social studies teacher, and while the students have been busy MAP testing, I have hosted the students who are not in testing on any given day, since social studies isn't tested.  The last four days of last week I had fifth graders in my room working on a packet I assembled, which includes an assignment I made for them to write a historical fiction short story, as well as a budget project I found online and a civil rights set of sheets I found, which amounts to an article on each movement and questions at the end.  I already covered the Civil Rights Movement during Martin Luther King, Jr. Day and that week.  This set of sheets covered the Women's Movement, LGBT, Chicano, Native American, and Disabled.\n\nMy principal came to me at the end of the day Friday and asked whether I had sent home \"stuff on LGBT\" with the students. I told her no, but LGBT was a part of the civil rights packet I had them working on during our silent MAP testing period and that I could show her.  She glanced at it and said that it needed to be removed, that a parent had complained and that she anticipated more would call her to complain.  She said things needed to be aligned with the curriculum.  I live in Missouri, and one of the learning standards for fifth grade social studies is to teach about the causes and consequences of \"major political developments and reform\" for the 1800-2000 year period, including the Civil Rights Movement, Women's Movement, \"and others.\"  In addition, Missouri is not a state that has one of those terrible laws that disallows the teaching about LGBT.  This sheet was simply an informative article on the history of the LGBT movement, mainly centering around the Stonewall Riots.\n\nI looked at her and asked when were we going to not be able to teach history anymore.  She then took one of the packets to show the Board.\n\nIt was all I could do to keep from crying before leaving the building.  I ripped out all the \"rights/movements\" pages and restapled the other things.  When I got home, I typed out an email to my principal, documenting everything that happened and said that I no longer felt safe or protected at my place of employment.  I happen to be a member of LGBT.  I'm a bisexual woman who was long married to a man but am married to a woman now.  If the parents are hating that students are simply reading about true history that talks about how LGBT people fought for their rights, how would they feel if they knew I was gay?  How many of them actually know?  What is more, one of my wife's best friends she grew up with was a trans man who was killed earlier this year in the Colorado shooting.  That was horrific for her, and it was bad for me, too, because I'd heard all these stories about him and had hoped to meet him one day.  They both moved from their home state around the same time.  People in minority groups are targeted and DIE.  When my principal told me I had to remove the LGBT sheet, she basically told me the minority group to which I belong doesn't matter, that it's ok for those parents to hate and teach their kids that.  I feel she should have reminded them that they have rights, too, and can homeschool their kids.\n\nI told her I would be seeking FMLA leave due to the fact this has severely heightened my stress levels.  They were already really bad, and I was counting down the weeks, because I already resigned and was looking forward to the end.\n\nShould I contact my union representative?  Should I go try to get FMLA leave?  I don't have any paid days left to take off, but are my chances good to get it so that it doesn't matter?  I struggle with bailing on my team, and I hate it for all the students I like and who love me, but I don't think I can go to work after this.  Am I overreacting?  Am I right to be this upset?  I spent all evening Friday crying, and the only reason I haven't today is because I'm visiting family and have kept it off my mind for the most part.",
    "title": "Was Made to Remove LGBT Page From Civil Rights Packet",
    "subreddit": "Teachers",
    "timestamp": 1682219251,
    "score": 78,
    "keyword": "american principal"
  },
  {
    "text": "What does it take to get a student expelled at your school? I am very curious about what the expulsion process and threshold looks like in other buildings.\n\nFor some context, I teach middle school and we have had a few students this year accumulate 10+ days of out-of-school suspension (OSS). A couple girls keep vaping in the same bathroom and keep getting caught (not the brightest bulbs for sure). On of them also keeps fighting too. Another posted nudes of her ex-boyfriend, which got her two or three days of OSS.\n\nWe also got one shrimpy 8th grade boy with a Napoleon conplex. He has cussed out four different adults, including two teachers and the principal and vice principal. His poor science teacher got verbally abused twice by him. All these incidents had earned him a bunch of days of OSS and behavior support plan that doesn't do much, cause he is a ticking time bomb.\n\nWe have a decent school culture, definitely in the middle of pack of the American education system. But why admin doesn't try to get rid of these clearly toxic students out of the building is beyond me. It would definitely help to get rid of a few these students. \n\nSo I want to know what this looks like in other buildings. Seriously what does it take to get a student expelled these days?",
    "title": "What does it take to get a student expelled at your school?",
    "subreddit": "Teachers",
    "timestamp": 1702050604,
    "score": 55,
    "keyword": "american principal"
  },
  {
    "text": "How to stop this Ok, I'm not a teacher by trade, I spent 50+ years in the HVAC industry. I'm a 62 year old white male and I'm working in a high school that is largely African American I am teaching their HVAC program. I came to this last October when the former teacher retired and asked if I'd be interested. After thinking about it I decided that I really liked the idea of being able to mentor young students and helping those who had no designs on attending college, and were looking for a good way to support their lives at the next level. \n\nMostly this has been the case, the students are generally great and responsive. However..... I have a few students that I cannot get to stop being disruptive, they refuse to pay attention and get out of their seats, they talk constantly. This is bad enough for a normal class and tough for teachers who have gone to college and trained to handle these situations. These traits can be deadly in my lab if they do not pay attention they can electricity themselves or others, there is the possibility of exposure to liquid refrigerant, explosions due to the natural gas furnace that we work on and so on. The administration is supportive, but how many red slip referrals can I give trying to get my point across to these kids before someone gets seriously injured. \n\nMy second issue and the reason why I have my demographic and those of the school is their use of the N word. They state that they're using it would seem a at the end and not the r, personally I do not see the difference and it bothers me greatly. My question here is do I die on this hill, or turn my head and try to not let it bother me. I've brought in a coach at the high school and the principal to talk to them about how this word should be offensive to them, bit it fits in one ear and out the other. \n\nI'm not sure that I'll get the right answer here, and not sure that I'm really expecting one, but it did give me a place to vent and to try to work things out. Thank you for reading this far.",
    "title": "How to stop this",
    "subreddit": "Teachers",
    "timestamp": 1693552665,
    "score": 26,
    "keyword": "american principal"
  },
  {
    "text": "Falsely accused and reported to TEA I received an email this past weekend from an unknown parent informing my principal and I that last week during a field trip with my students, she witnessed me yelling at African American students multiple times. She “implored” my principal to take action and alluded to my actions being racially motivated. \n\nI had several adult chaperones on that field trip so I reached out to each one to ask if they ever witnessed me raising my voice at a student and to please let me know if this is something I may have done so I could learn from this. Literally every single parent replied that I never yelled at anyone, that I was actually soft spoken, and my students were all so well behaved that raising my voice was never necessary, and they were impressed with how everything went. \n\nWith permission from my principal, I replied to the parent thanking her for bringing this to our attention, that I was not dismissing her claims, but I was confused with what she saw because I don’t recall that happening nor did my chaperones. I asked that we meet so I could gain better clarity and grow from this as well. She replied angrily in all caps that she knows what she saw, knew what shirt color I was wearing, and that she didn’t want me to reply anymore. She also recommended I read a book on racial trauma because yelling at African American kids can cause trauma when it is done by another race. \n\nBy now, I was heated and I probably shouldn’t have replied, but I did. I removed the names of the parents on the screenshots and sent them all to her. I said it is apparent that she does not want to meet in person, I do not know her intentions, so this would be my last correspondence with her. \n\nShe replied, “Did you just say you don’t know my intentions? Your behavior is ridiculous!” Then said she would make a formal complaint to my state’s education agency (she CC’d the complaints email), my superintendent, as well as my principal. \n\nMy principal and I called the chief of schools together to inform her. She said that these things happen all the time and that they would handle it. I’m afraid this parent is going to continue to harass me. I contacted my union for advice on how to proceed, but I guess I’m coming to you all for some comfort and advice as well. Maybe similar stories to help me get through this?",
    "title": "Falsely accused and reported to TEA",
    "subreddit": "Teachers",
    "timestamp": 1680131191,
    "score": 17,
    "keyword": "american principal"
  },
  {
    "text": "standing position is gonna make the students disrespect you. Today, I was approached by the principal for the very first time since my interview. He told me he has an issue with me that he can’t let go and must vocalize. Of course I was a bit concerned at first. He then told me that he sometimes sees me standing in class during class discussions with my leg hanging over the table. He said it was very unprofessional and sets a very bad example for the kids. He also said it would send a completely wrong message about the class to anyone passing by the class and asked me not to do it again. He also says he doesn’t understand how I model this to the kids since it’s gonna make them not take me seriously or respect me (all precisely his words, not mine). The position he’s talking about is basically me standing up on one leg and hanging my other leg over a table (which pretty much reaches me a little above the knee). It’s like a happy medium between resting and standing. Just resting my knee over the table while standing up. I have a bad right knee and can’t always handle standing up for the very long amount of hours I have to teach. However, when I sit down on a chair, it’s almost like I lack presence in the classroom and can barely see the students sitting in the back. I’m finding it hard to describe the position he’s referring to but I hope someone can get me. I, of course, thanked him for the conversation and said I didn’t interpret it the same way as he does but will pay more attention to it. \n\nCan’t lie though….I don’t feel like it’s that big of a deal. I’m surprised this is the hill he decided to die on when there are plenty of severe actual issues in the school and with other teachers. I also don’t know how I’m expected to stand up for all of these hours considering my knee injury. But, from my conversation with him, I got the impression he actually doesn’t mind me sitting down rather than standing in that position. It feels a bit unfair to police the way that I even stand especially given that I’m a very animated and active teacher who’s always walking around class, walking up to students, barely ever sitting down at all. \nI’m aware it’s really no big deal and I should shrug it off. I just, to be honest, find this entire situation strange and not as serious as he tried to make it seem. I don’t know why he found the conversation so necessary and urgent, lol. I’m just a bit frustrated and would like to know if I’m justified in this or not. I’m very amenable to change and want to actually improve any issues I might be perpetuating by presenting unprofessionally as he said. I just want a second opinion!\n\nEdit: I gotta admit the biggest learning lesson today was coming to know Americans describe bad or painful body parts as “bum”.",
    "title": "standing position is gonna make the students disrespect you.",
    "subreddit": "Teachers",
    "timestamp": 1673519269,
    "score": 11,
    "keyword": "american principal"
  },
  {
    "text": "Stalker much? AITA?\n\nHad an interesting week interacting with a non-parent. I’m an ESL teacher and we have a new family with a complicated story-Syrians, moved to Lebanon, sponsored by Catholic charities, living in a house owned by a local Presbyterian church. The family speaks Arabic, and a representative is the Presbyterian church has been coming to the school with the family to register each student (they have three). She is not an emergency contact, the family hasn’t asked us to include her, and she doesn’t speak Arabic, so I’m not sure what time she is filling here. \n\n Thursday last week we had open house. At the end of the night I got an email from her saying that she didn’t understand why the last student to register in the family still had no schedule. He has met with the counselor just that day and as a senior, we needed to review his transcripts carefully to ensure he was enrolled in the right classes. I had plans to be out the following Friday, so I forwarded the email to the school counselor and the ESL case manager in charge of that child’s end of the alphabet. I don’t know why she emailed me in the first place. As the department chair, I am kinda involved in each student, but I’d like to see the rest of my team approach a situation before I step in. \n\nI come in this week on Tuesday (Monday there was no school for Labor Day) and find a voicemail from 9:00 am Friday insisting that I needed to call her back to discuss the reasons why this student still did not have a schedule. I also got note in my mailbox that was written in the back of an email her husband (yet another legally unaffiliated adult) had sent to the case manager with a written note complaining that the case manager and guidance counselor weren’t responding to her, saying it was ridiculous she had to resort to writing a not on paper. The letter explained how she heard a friend who worked in special Ed at a neighboring district who suggested that these students should not be enrolled in American history class until they’ve learned English. Well, I hate to break it to her, but that’s not how the system works.  State law still requires that they earn all required credits in the span of four years, so they take classes in the same schedule as a native English speaker. After talking with the front office staff, I  B found out she had wanted to come in and talk with me on Friday when she wrote the note and made enough of a scene that the secretaries now call her crazy. And they tell me she was waiting in her car at the school that morning. \n\nThe waiting in the car was my final straw. I emailed the story to the principal and the school resource officer. The last update I got from the principal said that he was going to take part in the next meeting that involved this crazy church lady to establish protocols and roles, but I got the feeling he thinks I’ve overreacted. \n\nTLDR/ crazy lady with no legal rights to students is harassing me for information I can’t give.",
    "title": "Stalker much?",
    "subreddit": "Teachers",
    "timestamp": 1694221438,
    "score": 5,
    "keyword": "american principal"
  },
  {
    "text": "District Decision I don’t know if I need advice or a place to vent.\n\nI am a middle school teacher at a Title 1 school. We were “graciously blessed” this year with a problematic student who is on his 3rd strike in our district. He has a long rap sheet of behavior issues from two other middle schools and the district transferred him to our school thinking a small K-8 environment would be better for him.\n\nObviously this isn’t the case. He’s had behavioral issues since the first day of school with all of us middle school teachers. He uses lewd and foul language and causes a lot of micro aggressions that make most of the other students annoyed and slightly fearful with him. It’s basically like “who will he pick on today?”. We have documented so much of his behavior but have received so much pushback from the DO about him. \n\nI’ve been extremely patient with him all year even though I dislike him immensely. However, today was my final straw.\n\nHe recently got a buzz cut and wanted to hide it and chose a durag to cover it with. Mind you this kid has specifically targeted our African American students and will casually use the N word to describe them and others. The middle school  teachers told the principal that we will not allow him to wear it in our classes and he made such a big deal about it that admin asked the district and they ok’d it. \n\nIt completely undermined us as teachers and is allowing this racist student to get away with cultural appropriation. He has no respect for the African American culture and is enjoying wearing it to cause drama. He called me racist because I don’t think it’s right he can wear that. I am so over this kid and no matter what we say or do they keep bending over backwards for him. \n\nI am at a loss of how I navigate the rest of the year with this student. I have lost what little respect I have for my administration and for the district. I almost want to leak this situation to a newspaper and see what happens.",
    "title": "District Decision",
    "subreddit": "Teachers",
    "timestamp": 1699388643,
    "score": 5,
    "keyword": "american principal"
  },
  {
    "text": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation I thought Matt Yglesias' post today about the failure of teacher evaluation/pay as a policy over the past 15 years, would interest some here. It's from his substack which has a paywall for most posts, but I thought it would be reasonable to put the text in here, maybe he'll get a new subscriber or two. If you want to see the whole thing with the charts/graphs and hypertext links, check it out over there.\n\n&#x200B;\n\n[https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped](https://www.slowboring.com/p/why-teacher-evaluation-reforms-flopped)\n\n&#x200B;\n\n**Why teacher evaluation reforms flopped:The strange death of education reform, Part V**\n\nBy Matt Yglesias\n\n&#x200B;\n\n\\[This is part five of an ongoing series. Check out part one on the nature of the education reform movement, part two on the rise and fall of the achievement gap, part three on the successes and failures of charter schools, and part four on the right’s embrace of unregulated privatization.\\]\n\nI can’t believe I’ve gone this far in the series without discussing what was probably the single most important component of Obama-era Education Reform: the large-scale effort to shift teacher compensation and teacher evaluation from a system that was very focused on seniority and credentials to one focused on teachers’ measured ability to generate learning gains for students.\n\nObama was not only convinced by this strategy on the merits, but his administration was also empowered in a very unusual way to implement this change.\n\nThis was in part thanks to the Great Recession, which left state and local governments short on money and the macroeconomy in need of fiscal stimulus. The American Recovery and Reinvestment Act allocated money for a grant program called “Race to the Top” that, instead of giving federal money to school systems based on some formula, granted funds based on the extent to which schools implemented Department of Education-approved reforms. It was also in part a somewhat peculiar legacy of the original No Child Left Behind law, which deliberately gave states unrealistic proficiency targets and required non-compliant states to obtain “waivers” from the federal Department of Education.\n\nThe nexus of RTTT and the NCLB waivers gave Arne Duncan unusual influence over K-12 policy (which is typically more of a state and local matter), and Obama empowered Duncan to wield that influence fairly aggressively — especially to push states to adopt quantitative teacher evaluation systems.\n\nThis was politically dicey. Teachers unions hated it, and while rank-and-file Democrats never turned on Obama over his advocacy for this idea, the dispute drove a lot of intra-party tension and organizing. A lot of people who are today firmly anchored in the progressive wing of the Democratic Party don’t realize (or don’t remember) that downstream disputes about teacher evaluation 10 to 15 years ago were the genesis of so much factionalism, but they were. At the same time, while this cause had a degree of bipartisan support, it wasn’t really something Republicans or the conservative movement leapt to give Obama credit for. Rather than right-of-center people praising Obama for taking on the unions, conservatives generally negative-polarized away from their belief in the reform project, leading to today’s revived interest in vouchers.\n\nIf it had all worked out as intended, we would today see this as a major pillar of the Obama legacy — ARRA might not have been large enough to fully close the output gap, but it was large enough to drive systematic and beneficial change in American education.\n\nThe unfortunate reality though is that while there are some teacher evaluation success stories, these reforms did not on the whole generate great results. The upshot is that a ton of political capital was poured into something that didn’t work, the energy for reform dissipated, and a tremendous opportunity was lost.\n\n**The 10,000-foot case for evaluation reform**\n\nAs I’ve argued before, in politics it’s really helpful to be right about everything all the time. Unfortunately, Obama and his allies were wrong about this, and I was, too. The upside, though, is that I feel like I can describe pretty clearly what the reformers were thinking.\n\nThe basic point is that when it comes to setting teachers’ salaries (or deciding who gets laid off during a budget crisis), you have to pick some system. You could pay everyone the exact same amount (or do layoffs randomly), but that would still be a choice. And I think paying every teacher the exact same amount would probably be a mistake. Instead, districts typically pay teachers based on seniority, with extra pay based on their possession of graduate degrees. Because of the way pension and health benefits work, a veteran teacher is more expensive to have on the payroll than a rookie, even if their salaries are identical. So in practice, the system is even more weighted toward seniority than the salary schedule alone would suggest. Meanwhile, many systems operate on a “last in, first out” system for layoffs, meaning the most junior teachers are the ones who have to go in the event of a budget crisis.\n\nYou can model this as just union clout, but I think many who support this system have a good-faith belief that seniority serves as a rough proxy for teacher skill. That’s even clearer for the graduate degrees — giving people extra comp for extra credentials makes no sense unless you think the credentials are a good proxy for quality.\n\nIn reality, though, seniority is a pretty weak proxy for quality. In a very influential paper published in 2006 by the Hamilton Project at Brookings, Robert Gordon, Thomas Kane, and Douglas Staiger argued that the positive impact of experience on performance plateaus fairly rapidly.\n\nThe research on paying teachers extra for getting Master of Education degrees is, if anything, much clearer — these degrees do not help teachers become more effective, in part because the incentives are obviously screwy. Teachers are strongly incentivized to get the degrees whether or not the degrees are valuable, so universities compete in the marketplace to make the degrees as easy to obtain as possible. And as any teacher could tell you, that is not a good way to teach anything useful to anyone.\n\nThat’s what made the idea of switching to a system that emphasizes measured effectiveness so compelling.\n\nIs it straightforward to measure what makes a great teacher? Of course not. Are there problems and shortcomings with value-added measures based on test scores? Sure. At the same time, a highly imperfect proxy still seems much better than a proxy that definitely doesn’t work well, like seniority. And the master’s degree thing is worse than useless — the teacher ends up with less than 100 percent of the raise because some of the money goes to pay off the student loans that financed the useless degree.\n\nSurely we can do better than this.\n\n**It’s hard to do better**\n\nI think that we can, in fact, do better, and the teacher pay reforms that Washington, D.C. enacted during this era have had some clear benefits.\n\nBut in terms of the big national push for compensation reforms, the news is bad. That’s the conclusion of a recent and convincing paper co-authored by Joshua Bleiberg, Eric Brunner, Erica Harbatkin, Matthew Kraft, and Matthew Springer:\n\n\"Federal incentives and requirements under the Obama administration spurred states to adopt major reforms to their teacher evaluation systems. We examine the effects of these reforms on student achievement and attainment at a national scale by exploiting the staggered timing of implementation across states. We find precisely estimated null effects, on average, that rule out impacts as small as 0.015 standard deviation for achievement and 1 percentage point for high school graduation and college enrollment. We also find little evidence that the effect of teacher evaluation reforms varied by system design rigor, specific design features or student and district characteristics. We highlight five factors that may have undercut the efficacy of teacher evaluation reforms at scale: political opposition, the decentralized structure of U.S. public education, capacity constraints, limited generalizability, and the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security.\"\n\nI really like this paper because it not only presents a provocative result but offers a good explanation for what went wrong. Federal officials saw local reforms that seemed to be producing good results and decided to create a financial structure whereby the federal government would try, via the states, to make localities adopt similar reforms.\n\nBut not only do education interventions in general have an annoying habit of failing to work at a large scale, but this particular effort was beset by huge problems of political implementation.\n\nLots of the state-level politicians thought these evaluation systems were a good idea, of course. But the marginal elected official in these jurisdictions often didn’t think this was a particularly good idea, and only went along with it because they wanted the RTTT money. That meant there wasn’t a strong state-level political coalition that really wanted to overhaul the teacher personnel system. And this was atop another implementation layer of school boards (or occasionally mayors) who almost certainly didn’t want to change things. This then filtered down to another layer of implementation where principals were suddenly dealing with teachers who didn’t like being subjected to a new evaluation framework. Meanwhile, a range of actual practitioners (including some fervent reformers) has emphasized to me that reformers at the time tended to ignore the fact that most principals in schools with challenges really, really hate needing to fill vacancies. There isn’t some huge line of skilled teachers looking to take jobs in high-poverty schools.\n\nThe last line in the quote above about “the lack of increased teacher compensation to offset the non-pecuniary costs of lower job satisfaction and security” is really important in my opinion.\n\nA key linchpin of the D.C. merit pay efforts is that average compensation went up by a large amount — and is only partially undermined by the high cost of D.C. housing. Every teacher, every year, needs to make a choice between “keep teaching” and “change careers.” The goal of compensation reform is to make the above-average teachers marginally more likely to keep teaching and the below-average teachers marginally more likely to change careers. But if teachers on average find the assessment process annoying and the reduction of job security troubling, then you’re making retention of average teachers harder and undermining the whole process.\n\n**Revisiting the original recommendations**\n\nThe Gordon/Kane/Staiger paper I mentioned earlier was very influential on my thinking. And it’s not just me. The Hamilton Project, in the late Bush years, played a major role in developing the policy agenda of what would turn out to be the Obama administration. Then-Senator Obama was even a featured speaker at Hamilton’s launch.\n\nI think it’s fair to say that the paper wasn’t just one of the research documents that supported the Obama administration’s approach; it was, in a sense, the intellectual blueprint for the whole thing.\n\nStill, it’s worth saying that this policy agenda was conceived during a different set of circumstances than those under which Obama became president. He says in the talk above that “when you keep the deficit low and our debt out of the hands of foreign nations, then we can all win,” and the policy panel that followed really focused on deficit reduction. Democrats in the mid-Bush era were not expecting the Great Recession, a huge collapse in aggregate demand, soaring unemployment, and ultra-low interest rates. They believed the Bush policy mix of tax cuts, wars, and Medicare expansion was unsustainable and that it would fall on them to replace it with something more responsible. By the same token, Obama name-checks Gordon as one of the Hamilton people “I have stolen ideas from liberally.” But Gordon’s paper does not propose using federal stimulus funds to try to strong-arm states into changing teacher evaluation policies, in part because the whole idea of doing a big federal stimulus wasn’t on the radar.\n\nWhat they wanted the federal government to do instead was pick up the tab for “up to ten states” to create a system that would offer bonus pay to highly effective teachers who were willing to work in high-poverty schools while denying tenure to highly ineffective teachers.\n\nThat’s similar enough to RTTT that you can see how one idea became the other. But it’s also genuinely different — Gordon proposed, essentially, a subsidy to a handful of states whose political leaders were genuinely enthusiastic about reform, with the reform in question designed to take nothing away from veteran teachers. It’s a policy change that is designed to generate a much higher level of top-to-bottom alignment, from teachers to principals to district leaders to state-level politicians. The hope, obviously, was that the reforms would prove to be a huge success, which would generate pressure for further adoption.\n\nThe other important plank of Gordon/Kane/Staiger was reducing barriers to entry in teaching. They cite data indicating that while traditionally certified teachers are better on average than uncertified ones, the difference is small with plenty of overlap. The idea was that by pairing certification reform with tenure reform, you’d cycle through more cohorts of rookie teachers faster, weed out the least-effective ones, and over time raise average teacher quality. And you could achieve that without doing anything negative from the standpoint of veteran teachers.\n\nBecause of the Great Recession, we ended up in a situation where districts weren’t hiring new teachers or creating new bonus programs. There was instead a lot of emphasis on using effectiveness evaluations to structure layoffs, which makes sense conceptually but is a clear and present danger to veteran teachers, and the point of RTTP was to tempt jurisdictions that didn’t particularly want to do compensation reform to do it anyway.\n\nI think the hope was that this would bring reform to scale much faster.\n\nInstead, it generated tons of ill will while creating a very strong socio-psychological connection between the evaluation movement and a period of severe education austerity in which budgets were slashed, jobs were lost, and inflation-adjusted salaries fell. And it was from within the union backlash milieu that we first started hearing from Ibram X. Kendi that the idea that an achievement gap exists is racist and that we can’t try to evaluate teachers based on student test performance because standardized testing is also racist.\n\n**Pitfalls of change**\n\nAs I mentioned above, I was a true believer in this particular reform idea.\n\nAnd I still believe that the 10,000-foot version of it is correct. If anything, I’m more focused than ever on the role that screwy compensation practices play in supporting rent-seeking graduate schools of education and in incentivizing them to operate as highly ideological enemies of sound social science and pedagogy. One potentially promising compensation reform proposal is to simply eliminate all new graduate degree bumps on a forward-looking basis and plow the savings into higher base pay across the board. This would have only minor educational benefits, but down the road it would have good political economy benefits.\n\nMore broadly, though, my thinking about the other great municipal workforce — cops — is greatly shaped by my understanding of what did and didn’t work here.\n\nMy points about the spatial misallocation of police officers are directly parallel to the Gordon/Kane/Staiger points about the utility of paying bonuses for highly effective teachers who are willing to take on the most difficult assignments. The discourse about “merit pay” flew off in a different direction, but the basic idea was never intended to be anti-teacher — it’s simply harder to teach classrooms full of kids who are dealing with a lot in their lives and whose parents are less likely to have the bandwidth or the financial resources to participate actively in their education. But the system as a whole does not serve its intended goals if valued teachers all self-select out of those assignments, leaving the toughest jobs to a mix of rookies, idealists, and people who’ve washed out of other schools.\n\nSimilarly, whether you’re talking about cops or teachers, if you want to hold people to a higher standard you need to be willing to spend money on higher pay and to think hard about recruiting pipelines.\n\nThe next, and probably final, entry in this series will focus on something that, based on the arc of ed reform, I am both hopeful and concerned about: I’m inclined to support the new wave of enthusiasm for phonics and “the science of reading,” but I also worry it will turn out to be another example of something that’s hard to bring to scale in a decentralized system.",
    "title": "Matt Yglesias on the sort of failed policy push around teacher pay & evaluation",
    "subreddit": "Teachers",
    "timestamp": 1684956059,
    "score": 5,
    "keyword": "american principal"
  },
  {
    "text": "Getting my masters at American College of Education? Hi\n\n   I don't really know who to ask because all my friends are in the same boat as me (all graduates and not really much experience) and my parents never went to college (along with others adults I know) and I don't have anyone who I can talk to on this or have someone to guide me in this process.\n\n   I finally got my degree (yay) and wanted to try to get my masters in education leadership just in case I want to work in administration or principal in the future if I don't enjoy being a teacher or realize I love paperwork (haha) plus I hear you kinda get bit of a pay bump if you have a masters. My question is does it really matter where you get your masters from? I see a lot of the schools (some online) that are a bit expensive, and found one called American College of Education and they have a masters in educational leadership.\n\nMy concern is I know that in some fields they consider online a joke or find this college unworthy and I am worried if in this field if I choose to get my masters there and go for an interview in future will that put me at a disadvantage? I tried to talk to my dad but in his job they care more about experience over degrees (that was his answer) and wanted to get some insight from this community. Teachers (or any principals on here) if it really matters where we get our masters from? I saw a few amazing Universities but 1. I don't think its online and 2 its very expensive and the schools are known more for their name. I do believe schools provide same education just I know sometimes reputation is important too. Please let me know and thank you for your help and sorry if this was wordy.",
    "title": "Getting my masters at American College of Education?",
    "subreddit": "Teachers",
    "timestamp": 1688099570,
    "score": 5,
    "keyword": "american principal"
  },
  {
    "text": "Advice Please Background:\nI am a newly appointed head of department at a fairly large inner city school that has a unique culture of radical acceptance, which is wonderful. This attracts students that feel like they’re on the fringes of society and gives them a safe space to find themselves and develop a more natural sense of belonging. With a large population of these students, they are inherently more vulnerable to mental health issues, which is why we have a large counseling staff and local community support programs. \n\nHere’s the situation:\n(now, I only have 2-3rd hand information, but still…)\nToday we had a clubs/sports assembly presentation thing in the auditorium where the kids walk around and learn about all the cool activities/clubs/lunchtime meetups/stuff they can do to find their place (there are close to 40 different things). Think science fair boards, but with cosplay, 3d printing, underwater hockey, meditation, climate crisis, and philosophy clubs, etc. There was apparently a student with a history of depression that either had a meltdown in the auditorium during the thing, or in transition on the way to the thing. This meltdown included threats of self harm, acts of violence against passersby, and suicide. It also was apparently quite difficult to calm this student down. Eventually, principals, deans, counselors, and police (unarmed - not American) came to relieve the teacher. \n\nAdvice:\nThis teacher is only just barely 3 weeks into their second year teaching, under me in my new department. At lunch, they said they were shaken up, but feeling better. You know, and I know, that later this evening it’s going to hit her and shake her to her core. I’ve got a small care package put together to remind her of the positive impact that she makes, but what do you write on the card? What do you say when the reality sinks in?\n\nTLDR; I’m at a loss for words after one of my subordinate baby teachers in my department had to handle a student’s suicidal (perhaps violent) meltdown.",
    "title": "Advice Please",
    "subreddit": "Teachers",
    "timestamp": 1676360242,
    "score": 4,
    "keyword": "american principal"
  },
  {
    "text": "Rethinking Grading Standards: Is \"meets\" an \"A?\" To start, I work outside the USA, but we use the Common Core since I work at an American curriculum international school. I don't have to deal with a lot of red tape, and I have a lot more freedom than many stateside teachers, I feel. I teach language arts, so my thinking is mostly in terms of papers, projects, and presentations.\n\nThe standards have always been treated as a guide, but our new principal wants more evidence of their use. I'd like to make sure all my assignments are aligned with the Common Core expectations.\n\nThis is an opportunity for me to rethink how I do a few things. My department treats \"meets expectations\" at about an 85%. I've always been fine with that, but I've started to think it might not necessarily be fair.\n\nNow that I'm actually a lot more familiar with the standards, I'm starting to wonder why \"meeting\" the standard isn't at least a 90% (A). If it's what the curriculum asks a student to do and they do it well, then why isn't that earning an \"A?\"\n\nI want almost everything to have a standards-based rubric. I also want to be able to explain that not meeting the standard means you won't even earn a C. Does it sound insane to have \"meets standards\" as a 10/10 and the next step down, \"approaches,\" being a 6/10? Ds are passing for us, but even that gap between numbers feels huge.\n\nI guess I'm just struggling to figure out what an \"A\" really is in regards to the standard when we use the normal 0-100 percent scale. If you aren't meeting the standards, do you even deserve a C or a D?\n\nThat being said, no one is breathing down my neck about passing students or giving out As like candy. I just see an opportunity to rethink how I handle things. My admin had us watch that one famous video where a guy rants about grades meanings, but didn't give us any guidance; just kinda looked at us and the screen as it played like it should be a profound lesson to us. \n\nAny advice or input would be greatly appreciated.",
    "title": "Rethinking Grading Standards: Is \"meets\" an \"A?\"",
    "subreddit": "Teachers",
    "timestamp": 1681284909,
    "score": 5,
    "keyword": "american principal"
  },
  {
    "text": "\"You won't be teaching history\" - add-on licensures A few veteran or retired teachers have told me something I've suspected:\n\n\"You won't be teaching history.\"\n\nEvidently there are too many history majors in my State.  There's plenty of history / poli-sci classmates in my classes, so I've suspected this might happen if all my classmates stay teaching.\n\nIt's too late for me to switch majors.  My college advisor suggested I take a bunch social studies to get the Broadfield SS licensure, but that will add on another 6+ months till my graduation.  (Part of me suspects college advisors always suggest more classes because more classes = more money for them -- maybe I'm jaded, hah!)  Broadfield SS will also open the door to my nightmare: it will put me in front of middle schoolers.  I could move to another State but I'm married so moving ain't so easy, and maybe it's like this everywhere in the US??\n\nMy State allows add-on licensures via Praxis and Pearson but it looks like I must have my degree 1st.  The American Board tests are also an option.  \n\nWhat are people's experiences with these add-on tests?  How quickly should I go for add-on licensures for high school?\n\nI'm thinking my plan should be taking these tests for additional licensures right after graduation to beef up my resume for high school principals ...",
    "title": "\"You won't be teaching history\" - add-on licensures",
    "subreddit": "Teachers",
    "timestamp": 1694090745,
    "score": 3,
    "keyword": "american principal"
  },
  {
    "text": "Positive post! It's not so bad everywhere. Yes teacher pay is garbage and many people in American society don't understand why we do it or what we put up with for those small bits of emotionally rewarding moments. Some districts don't get it. Many buildings don't. I've lucked into one that mostly does. Good admin (generally) . But really a positive group environment lead by a handful of teachers with full admin support. These usually come in the form of friendly competition. I have only been there 7 years but I think it started with the staff Halloween costume contest. This is middle school btw. People go all out for individual or group costumes that are won by student vote. 2 years ago my para and I won with Squid games costumes. We made our own when we realized we wouldn't get the original ones on time. I was worried it was too risky because of the violence. Turned out the administration team had the same idea.....and problems of delivery. Point the student votes for the winner(s)  the skull and bones traveling trophy for almost 20 years! You sign it and display it until next year. I made one a few years ago for the \"No shave November\" competition the guys do. Our behavior specialist has ping pong tables in her office/classroom. People started coming in on their plan time if her room was open. So now we have another competition and trophy. There is a school fantasy football league as well. Yes the trophy is displayed. Where? In vice principals office. She is really proud of it too! I guess what I'm saying is some buildings have nothing to keep staff together or interested. I'm lucky to have one where snarky and competition are normal. I've had to avoid the \"reindeer poop\" of Hershey kisses for several days now in the mail room.",
    "title": "Positive post!",
    "subreddit": "Teachers",
    "timestamp": 1703058069,
    "score": 2,
    "keyword": "american principal"
  },
  {
    "text": "Feeling isolated and exhausted at teaching job where black teachers are the minority I’m currently working at a predominantly white staff school. I’d safe about 7 teachers out of 70 are people of color. The demographic of students is almost evenly spilt between blacks,whites, and Latino students. \n\nI returned to this school after I had a rough experience in a metropolitan area school district . I’m in Georgia btw. I did this because I thought my principal was reasonable and nice ( he was the previous assistant principal when I left the first time and was super kind).  Now I’m regretting coming back . I genuinely think my principal is trying but it’s getting to  me.\n\nOne day last week, one of my students broke down crying telling me that a white boy asked if could call him a n*gger and if his daddy was a slave ? “ I was livid . I told him I heard and felt him but do not ever make them make you feel bad about being black.\n\nI brought this incident up to the assistant principal and he said he “understood”. Never followed up with me. So I went to the principal about this and he told that he had the kid on his “radar” and that the kid was having a “rough time”. I was perplexed at why he was telling me this. He added that the kid could be valedictorian if he wanted to but was just not in a good situation now. But then my principal would jumped back to the fact that he wasn’t condoning his behavior and gave me a long story about how he grew up with black friends and because he was darker skin he was mistaken as Hispanic. \n\nI got more irritated as he continued and essentially let him finish off his point. What causes more pain is that I’m currently in school learning about critical race theory and just how awful American history is in regards to treating Blacks. I need health insurance and a salary but im fearful that if I move districts I’ll have another issue. I just want a space where I feel heard. I’m not sure how to proceed.",
    "title": "Feeling isolated and exhausted at teaching job where black teachers are the minority",
    "subreddit": "blackladies",
    "timestamp": 1674524140,
    "score": 14,
    "keyword": "american principal"
  },
  {
    "text": "Advice needed. How to move forward with some making bad choices especially making racist comments Advice needed on how to move forward with son making bad choices especially making racist comments.\n\nTrigger warning: racist comments \n\nI am a Black and Native American woman married to a Native American man who adopted two Native American children. We are a blended family, I had three children, my husband had four and we have the two together. My son is 13 years old and has been acting out a lot lately. He has been drinking and smoking weed. A couple weeks ago we found a weed cartridge and a nicotine vape in his backpack. I warned him if it happened again I would homeschool him. Well, a week later we found alcohol in his room so I checked his backpack again and there was a weed pen in it. He has excuses for everything but I don’t believe any of them. I pulled him out of school last week. He also stole $200 from my husband’s wallet. We got $120 of it back. \n I talked with his counselor and set up an appointment and drug and alcohol evaluation for Friday. We went and she didn’t think he had a problem she suggested I let him go back to school so against better judgement I let him go back on Monday. I wasn’t sure if I was overreacting because I am scared especially of the drinking because my son has type 1 diabetes and it could easily kill him. So Wednesday his principal calls me and says my son was in a bathroom where they were vaping. They checked his bag and he had stuff so my husband picked him up and he will be homeschooled now. \n\nI went through his phone. The only reason he has a phone is because he needs it for his continuous glucose monitor. It sends his levels to my phone so I can tell him how much insulin to take. I thought it was locked down but it was not. I read his message and he has been making racist comments to a Black girl. She makes them too but they are always about Black people. They think it’s funny.\n Some of the comments he made:\n“ I have 16 slaves picking cotton for me and 5 house slaves cooking that good fried chicken and good koolaid\nHe sent a pic of some enslaved people and said those or mine. Straight thugs from the trenches of Africa \nThen he sent another pic with more enslaved people and said that’s us now. I paid extra for the kidnappers to get a whole village for me. \nHe called her a thug, monkey, slave, blacky, cotto picker, koolaid drinker, chicken bone sucker, and a watermelon eater. \nShe would write back that she had slaves too and call him monkey, slave, and the same. \n\nI am so disgustedwith him. i am hurt and pissed beyond words. I feel betrayed. I found this today and called him a racist. I asked him if he thought that was funny. I said “say that shit to me. You can say that to a little girl so say it me. I want to laugh too.” He just kept crying, and crying and crying. I am so mad. I was in the room when this boy was born. I cut the cord.  I spent the night in the  room with him and took him home. Ever since he has been diagnosed with type 1 I stay up at night to watch his levels. To give him insulin if he’s high or have him eat if he’s low. He knows all the racist things me and my biological kids have had to deal with and he still does this. We watched the 1619 project as a family. Every day I wear some type of black pride clothing. I don’t know how to get past this. It’s so raw right now but I can’t see a way out. I can forgive him for all the other stuff but I have such hatred for racists. Please give me some advice. I don’t know what to do. \nMy husband doesn’t get it. He said “he’s young and dumb. He didn’t mean it.” He asked me how I’m gonna deal with this. I said I don’t know. I have no idea. I said you don’t understand.  \n\nMy son has been in counseling for a couple years. We were able to meet with her today and but it was minutes after I found the racist posts so I was crying and yelling. Telling her all that he said. My husband and daughter (14) were also there. They were both crying too. My husband because he saw how broken I was. My son was crying and wouldn’t talk at all. He had his head down and was just bawling.",
    "title": "Advice needed. How to move forward with some making bad choices especially making racist comments",
    "subreddit": "blackladies",
    "timestamp": 1702020705,
    "score": 11,
    "keyword": "american principal"
  },
  {
    "text": "I wonder if men of shorter stature are invisible to feminists, or make just as good cannon fodder. You know what they say, \"Men don't have to worry about being safe when walking at night\".\n\nLike this comment:\n\n>The really sad thing is that women even have to consider whether a man is a threat. But this is a reality in the life of a woman. You probably never think twice about walking in a deserted parking garage, or the vehicle parked next to yours with a person sitting in the passenger seat, or getting in an elevator and a man steps in just before the doors close. I guarantee every woman takes her safety into account in these situations.\n\nOh gee, I forgot, that male privilege gives me 100% damage reduction from bullets, punches/kicks, etc.\n\nAnd also: \"It's your duty to intervene, to call out sexism, etc. etc.\" like the infamous Gillette ad four years ago: \"To say the right thing. To act the right way. Some already are. In ways big and small. But some is not enough.\"\n\n\"Men have to hold other men accountable.\" said Terry Crews, the 6'2\"/237# former NFL player.\n\nOkay, now I am 5'7\"/150#, with no athletic inclinations whatsoever. I don't watch any sports at all because it bores me to tears (except classic auto racing, from ca. 1950-2000), I don't know anything about (American) football and don't care to learn because it won't be useful to my life, and with my shorter stature and athletic disinterest combined, thus can't exactly count on physical strength. Do they really think that all men are 6' or taller?\n\nAnd now it's my duty to call out a 6'5\"/250# football player in a cocaine-induced rage because he told one sexist joke.\n\nWhat do they think is going to happen? That this guy will just say \"Oh, hey, you're right, I shouldn't have said that, I will educate myself and try to do better.\" So, tell me you've never met another person before without saying you've never met another person before. This \"~~protect your daughter~~/educate your son\" virtue-signaling. Because I can tell for sure that Bart is totally open to being educated. It's not like he's already an underachiever at school, a prankster and disrespects authority (Homer, Principal Skinner, etc.), calling Homer generally by his first name and not \"Dad\" and [diss raps about him on stage, calling him a fat load.](https://www.youtube.com/watch?v=DTsB95Snluc) He'd totally listen, right? And \"saying all men are rapists/it's in their nature is misandrist/insulting to men/shows you have a really low opinion of men\". Opinion is like an asshole, everyone is entitled to one, doesn't mean it's always right. And when did I say that it's in the nature, point out the exact words. Also, France (Prime Minister Georges Clemenceau) did not try to \"educate the Germans\" at the Paris Peace Conference, but really wanted to really punish Germany hard, harsh reparations, territory annexations, the whole nine yards, because they bore the brunt of the WWI horrors. As he said: \"America is far away, separated by ocean, and even Napoleon couldn't touch England. You two are both sheltered, we are not.\" I guess maybe Woodrow Wilson and David Lloyd George should have called him out for \"having a low opinion of the Germans\" or that he was being \"insulting to the Germans!\"\n\nAnyway, back to the main point, more likely, this 6'5\"/250# football player will be throwing me down on the floor and then beating the shit out of me. Like I said, I'm just 5'7\"/150#, so if he wanted to harm me, he is going to succeed at it. So I have to \"be an ally\" and risk life-threatening injuries, and later also pay the medical costs (at best), have to spend my entire life in wheelchair (worse case) or die (worst case), but hey, at least now I have earned some \"ally points\". What a good deal, where and what for can I redeem them? Like Bill Allen said: \"Better to be a live coward than a dead hero. Sure people will still sing about dead heroes from time to time, but aside from that they get little attention. Unless they manage to get a holiday named after them. Even then, it's not like they get to enjoy the day off.\"\n\nSo, actually here's another debate topic. **For men of shorter stature, safety is not a given.** And many of those feminists tend to also be politically more on the progressive-liberal (not necessarily left/leftist) and collectivist/authoritarian side. The side that's usually not so gun-friendly. But if I am two inches below the average American male height, how am I supposed to defend myself? Not that have to actually want to shoot someone, oftentimes the mere sight of a gun will make an attacker think he's not that tough after all and scamper. I mean, it's such a tragedy that the feminists have to walk with car keys between their fingers while walking at night. While if I did that, since I can't count on physical strength, I would only achieve 1) making the assailant angrier and thus 2) reducing my chances of survival, not to mention fucking up my fingers. Or if I carried pepper spray or mace, it would end up right in my face if used downwind. Knife? You know what they say, \"The winner of a knife fight dies in hospital, the loser in the street.\"\n\n**So, for a shorter man, dating may be harder, but there are more important, more pressing issues, like self-defense/self-preservation.**\n\nPostlogue: But hey, if it mainly targets women, then it's all \"society bad, men bad, have to change\". But when the vast majority of the crime victims are men, \\**crickets chirping*\\* Like New York in the 1970s, in the Lindsey and Beame era, when the city was near bankruptcy (Remember the infamous NY Daily News \"Ford to City: Drop Dead\" headline?), and had to \"defund the police\" to stabilize the budget. And the best NYPD could do under those circumstances was to pass out pamphlets at JFK/Newark/LaGuardia saying \"[Until things change, stay away from New York City if you possibly can.](https://archive.org/details/FearCity/)\" Very likely, the vast majority of the crime victims then were men. So will the feminists also agree that all this was victim blaming: \"Stay off the streets after 6 PM, do not walk, avoid public transportation, remain in Manhattan, protect your property, safeguard your handbag, conceal  property in automobiles, do not leave valuables in your hotel room\"?",
    "title": "I wonder if men of shorter stature are invisible to feminists, or make just as good cannon fodder.",
    "subreddit": "MensRights",
    "timestamp": 1674052416,
    "score": 63,
    "keyword": "american principal"
  }
]