[
  {
    "text": "I don’t know how to look for a job and I feel like a failure I don’t have a mentor and my parents have had the same job for 25+ years. They don’t understand my struggles. They think I should be emailing CEOs for jobs. I’m a first generation American and I’ve been doing pretty much everything on my own. \n\nI’ve been at a dead end job for almost 2 years now. I stayed during 2020 due to the pandemic but realistically my goal was to work at this company for a year and find something else. The job pays $17 an hour and I really want to advance my career. I want to make more money and move out. I don’t want to depend on an hourly salary anymore. \n\nThe issue is, this job has given me almost no skills for another job. It’s very entry level. I call it an entry entry level job. I just copy and paste stuff into an internal database. I know I can make it sound like something more on a resume, but I don’t have any skills for a real job. I’m nowhere near mid level jobs and I feel like I’m below entry level jobs still. \n\nI don’t even know where to start looking for a new job. I think I want to go into data analytics but I don’t have all the skills needed. I’ve been trying to learn SQL on my own. \n\nMeanwhile my brother called me today to say he will be making $32 an hour at his internship this summer. I feel like a failure. I’m happy for him and I’ve been helping him through the process but I can’t help but feel like I’m so behind. \n\nIf anyone has any advice or guidance, I would be so grateful. I just feel like I’m so behind on where I want to be.\n\nI think I’m pretty good at interviews, but it’s just getting past the initial screening.\n\nEdit: I have a bachelors degree",
    "title": "I don’t know how to look for a job and I feel like a failure",
    "subreddit": "jobs",
    "timestamp": 1617977111,
    "score": 10,
    "keyword": "american ceo"
  },
  {
    "text": "Dual national guy (Canada/PH) - Still trying to find a full-time job even while pandemic is going on/waiting to see if COVID-19 cases are down enough to do graduate studies in Singapore & work within university. May go for paid remote work despite living in different timezones. Advice appreciated Currently unemployed after I got booted out of first job from June 2016 a year after I permanently moved from America via British Columbia due to surgery/one bad grade too many (On the latter, I graduated with a BA in 2017 and received it in 2018).\n\nDid some volunteer jobs with a local humanitarian NGO for supposedly social media (Not planning to do it permanent), but didn't do much of that, but I did research/article writing for the most part. That's before COVID said hello.\n\nAs of June 2020, I'm doing remote intern work with a risk management/private intelligence company from the East Coast USA.\n\nOn the side, I applied to do graduate studies in Singapore with scholarship (paid or be paid with a salary as a research assistant) just to complement my BA. I have to wait and see in a couple of months as the uni will e-mail me if I'm still committed (Will need to let my parents know as they were surprised that the university wanted me to come to Singapore when COVID-19 became full blown in Asia last year. Mom was \\[a bit\\] angry that the university's asking me to accept the offer without taking COVID into consideration).\n\nIt's tempting to do paid remote work despite timezone differences. I got interviewed with a private intel company in the US and the guy interviewed me asked if I'm willing to move to their offices in either Washington or Pennsylavania (Plus the vaccine distribution had problems when I got interviewed around December-January last I recall). No remote work is allowed as the company's listed as essential. I was planning to turn it down due to lack of remote work opportunities, but I got e-mailed a day or so later that the company can't sponsor non-Americans. The company had sponsored non-Americans before when I did my research online.\n\nSurprisingly, the company CEO reached out to me via LinkedIn and he was happy to hear how the interview went. He said to keep in touch.\n\nI'm still looking for remote work. I was recommended to check risk management/management consulting/private intelligence companies, think tanks and research firms (I spoke in my virtual career counseling that I'm willing to move back to Canada to work in the federal/provincial government, provided that I passed the requirements in defense/national security matters. I almost got a job one time.), based on what I'm doing in my intern work.  I'm planning to speak to a career counselor/someone who also did the same studies as me in an IR/Poli Sci-centric community to see what else I can do.\n\nThe challenging thing would be timezones unless I work around the UTC +8 timezone.\n\nThoughts of improving my job hunt are appreciated.\n\n\\----\n\nPS - BA is Political Science. My folks were surprised when I applied for graduate studies with scholarship. I wasn't that bright in advanced math, but I loved history/pol sci/intelligence.\n\nPPS - Few people outside immediate family know that I don't have a full-time job in Manila. My aunt who immigrated to America (based in LA) e-mailed me a few days ago to keep morale up.\n\nPPPS - My dad was iffy about my remote intern work, saying that one days terrorists are gonna find me and kill me... Mom, no comment, but says the intern work could help in the long run.\n\nPPPPS - My mom (when she's frustrated) sometimes compares my lack of a full-time job to my other friends/classmates in high school who are doing well in their jobs, either in Manila or overseas like one of my buddies in Tokyo. That's the bad part of how I'm feeling right now. Good thing she doesn't bring up marriage in the conversation.",
    "title": "Dual national guy (Canada/PH) - Still trying to find a full-time job even while pandemic is going on/waiting to see if COVID-19 cases are down enough to do graduate studies in Singapore & work within university. May go for paid remote work despite living in different timezones. Advice appreciated",
    "subreddit": "jobs",
    "timestamp": 1612515350,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "What does Reddit think of the fact that apparently 21% of American CEOs are psychopaths (psychopaths make up 1% of the general population)?",
    "title": "What does Reddit think of the fact that apparently 21% of American CEOs are psychopaths (psychopaths make up 1% of the general population)?",
    "subreddit": "AskReddit",
    "timestamp": 1614943528,
    "score": 8,
    "keyword": "american ceo"
  },
  {
    "text": "Americans, what do you think about a CEO pay ratio law?",
    "title": "Americans, what do you think about a CEO pay ratio law?",
    "subreddit": "AskReddit",
    "timestamp": 1635697014,
    "score": 2,
    "keyword": "american ceo"
  },
  {
    "text": "Only 14.5% of American adult men are 6’0 and over, but comprise 58% of Fortune 500 CEOs. Only 3.9% are 6’2+, but comprise 30% of Fortune 500 CEOs. What do you think of this data?",
    "title": "Only 14.5% of American adult men are 6’0 and over, but comprise 58% of Fortune 500 CEOs. Only 3.9% are 6’2+, but comprise 30% of Fortune 500 CEOs. What do you think of this data?",
    "subreddit": "AskReddit",
    "timestamp": 1614365213,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "Do your part to boycott Texas. People are calling for a boycott of Texas in response to the state's restrictive abortion bill that egregiously infringes on women's rights. While celebrities can avoid holding concerts or filming in Texas, we need to go after the major corporations headquartered in Texas and tell them to speak out against the restrictions and move their headquarters out of a state that clearly has no respect for the women who live there. Here is the best contact information I could find for some of the biggest corporations headquartered in Texas:\n\n1. McKesson - A pharmaceutical company has no place in a state that restricts citizens' access to medical procedures. [publicaffairs@McKesson.com](mailto:publicaffairs@McKesson.com)\n2. AT&T - I couldn't locate a good email address for AT&T, but mail can be sent directly to the Secretary of their Board of Directors at Office of the Secretary of AT&T Inc., 208 S. Akard Street, Suite 2954, Dallas, Texas 75202 \n3. Dell Technologies - Emails to senior management or the Board of Directors can be sent to this address:  [Board\\_of\\_Directors@Dell.com](mailto:Board_of_Directors@Dell.com) \n4. Sysco - Mail can be sent to  Office of the Corporate Secretary, Sysco Corporation, 1390 Enclave Parkway, Houston, TX 77077. An online message can also be sent through their \"[Ethics Line](https://app.convercent.com/en-us/Anonymous/IssueIntake/LandingPage/2d82ff5d-b631-e611-8105-000d3ab03673)\"\n5. Oracle - According to some Justice Department records, the Chairman of the Board can be emailed at  [larry.ellison@oracle.com](mailto:larry.ellison@oracle.com) and the CEO can be emailed at  [SAFRA.CATZ@ORACLE.COM](mailto:SAFRA.CATZ@ORACLE.COM)  \n6. USAA - The CEO's email is [wayne.peacock@usaa.com](mailto:wayne.peacock@usaa.com) \n7. Hewlett Packard - The Board of Directors can be emailed at  [bod@hp.com](mailto:bod@hp.com) \n8. CBRE - The President and CEO can be emailed at  [bob.sulentic@cbre.com](mailto:bob.sulentic@cbre.com)\n9. Baker Hughes - The President and CEO can be emailed at [lorenzo.simonelli@bakerhughes.com](mailto:lorenzo.simonelli@bakerhughes.com)\n10. Kimberley Clark - Chairman and CEO can be emailed at  [michael.hsu@kcc.com](mailto:michael.hsu@kcc.com) \n11. American Airlines - CEO can be emailed at  [douglas.parker@aa.com](mailto:douglas.parker@aa.com) \n\nThis is all I have been able to dig up (I really should get back to work). I omitted oil and gas companies because they are likely in Texas because their resource is located there. \n\nReminder: this information is being provided to contact these individuals regarding legitimate complaints about Texas's abortion law and encouraging corporations to respond to it. None of this information should be used to spam inboxes or harass any individual. Take into consideration the fact that many of these individuals likely have someone reading their email for them, so your words are most likely being directed at someone who does not have the authority to take any action. Respectful, thought out arguments are most likely to get to the intended individual.",
    "title": "Do your part to boycott Texas.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630601385,
    "score": 139,
    "keyword": "american ceo"
  },
  {
    "text": "Finally breaking through the glass ceiling? 90% of the 3.6 million Americans who left their jobs last month were over 55 according to CNN.  (https://amp.cnn.com/cnn/2021/12/15/economy/labor-force-retirement-great-resignation/index.html)\n\nWe will assume Zippia is accurate, and 64.2% of CEOs in the US are white men(https://www.zippia.com/chief-executive-officer-jobs/demographics/). \n\nDoes this actually present a greater opportunity for women?",
    "title": "Finally breaking through the glass ceiling?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1640198896,
    "score": 4,
    "keyword": "american ceo"
  },
  {
    "text": "It’s my cake day, *itches. I don’t know, I’m just thrilled to have survived this far.  Got my multistate licenses approved. Moving to Georgia to work maternity after years of wanting to help with the lack of care ESPECIALLY for African American women.  And now I’m doing it.  I will be hands on with my patients in a low income, high minority area to give these women the love and care they DESERVE.  (Their pain is VALID.  If they say something isn’t right we INVESTIGATE WHY.  I hope my diligence saves lives).  This whole mission started by making friends with the CEO of “Femly” who is a young beautiful black woman who lost her first baby and nearly her life because she was ignored and now makes wholly organic feminine products.\n\nAnyway.  It’s my cake day.  I survived the first year and landed exactly where I wanted.  Yay!",
    "title": "It’s my cake day, *itches.",
    "subreddit": "nursing",
    "timestamp": 1616394174,
    "score": 19,
    "keyword": "american ceo"
  },
  {
    "text": "Warehousing the children of workers is essential for capitalism to function. That's why schools are being forced open during a pandemic. >Secretary Miguel Cardona tweeted:\n>President Biden recently said, “We can keep our K-12 schools >open, and that’s exactly what we should be doing.”  \n \n>He’s right and we are getting it done because of the resources >provided and the hard work of so many.\n\nTranslation:\n\n\"Warehousing the children of workers is essential for capitalism to function. We are willing to normalize the deaths we cause, because we lack empathy, are shameless, feel no guilt, & know you will not retaliate, just complain online & let us exploit your labor\"\n\nUpdate: **I identified the problem and the why above. Now here's the solution below**\n\nThe CDC admitted that it's most recent guidance was *\"What they thought people would be able to tolerate\"*\n\nThis Douglass quote just keeps fitting with every new development. Not just in general under capitalism but acutely since the pandemic started.\n\n>\"Power concedes nothing without a demand. It never did and it never will. Find out just what any people will >quietly submit to and you have found out the exact measure of injustice and wrong which will be imposed upon >them, and these will continue till they are resisted with either words or blows, or with both. The limits of tyrants >are prescribed by the endurance of those whom they oppress.\" - Frederick Douglass\n\n**So what do we do?**\n\nShort term/Individually: Teachers must self advocate and leave the profession.\n\nWhen people have benefited from & exploited your lack of self-care, they'll hate you when you start taking care of yourself, because, it inconveniences them.\n\nStand up for yourself and say no anyway. \nThey aren't entitled to your labor.\nRefuse to martyr yourself.\n\nLong Term/Cooperatively: Americans must engage in a GENERAL STRIKE, with mutual aid. Mutual aid means providing the needs of everyone participating in the general strike by sharing food, medicine, shelter, safety, & more for free.\nWhile a general strike is occurring we need to create a true democratically run, bottom up, education system. ** community focused worker owned cooperative open schools** should be that system or else the future of education will be child warehouses for the masses.\n\nA marriage of Mondragon in Spain + JCOS in Colorado should be the goal.\nHere are two episodes of an education podcast that you can listen to and learn about [Mondragon](https://soundcloud.com/user-942229618/history-of-mondragon-pt1) and [JCOS](https://soundcloud.com/user-942229618/what-is-an-open-school-exploration-of-jcos)\n\n**So how do we reach these goals?**\n\nFirst we have to confront and internalize that a majority of the people in charge (admin, parents, politicians, CEO's) are sociopaths - people who lack empathy, lack a conscience, are incapable of feeling shame and guilt - *thus they can't be shamed, guilted, or internally motivated to do good.*\n\n**Please read \"The Sociopath Next Door\" by Dr. Martha Stout. It'll help you understand who we are fighting.**\n\nSociopaths also believe that we, people who feel empathy, and have a conscience are gullible, weak, and liars. In an interview Dr. Martha Stout gave she said: *\"One sociopath told me that he thought he was the only honest person because he would admit that he didn’t have a conscience and everybody else was clearly faking it.\"*\n\nThis reads true when you learn about how Republican and American Libertarian beloved author **Ayn Rand admired a Serial Killer's sociopathic qualities. Ayn Rand wrote in her journals: \"Other people do not exist for him, and he does not see why they should,\" she wrote, gushing that Hickman had \"no regard whatsoever for all that society holds sacred, and with a consciousness all his own.**\n\nThe **\"FREEDOM\"** Republicans are constantly screaming about is the freedom to brutalize others without reprisal i.e. the freedom to be sociopaths. This comment doesn't mean I absolve democrat politicians. Democrat politicians have proven that they too are a good mix of sociopath or narcissist.\n\n**Why is this important? Because y'all are wasting time trying to shame the shameless, and guilt the guiltless!**\n\n>“In order for nonviolence to work, your opponent must have a conscience. The United States has none.”\n>- Kwame Ture\n\nAt the end of the summer of 2020 when it was apparent that schools wouldn't open unless forced open some parents were saying some form of this: [\"5-10 teachers will die. Students will get used to the deaths. Schools must stay open.\"](https://twitter.com/LRedSchoolHouse/status/1440110238670077959)\n\nHow has appealing to these types of people's empathy worked for you?\n\n**Has returning to the school helped anyone besides the selfish sociopath parents who don't want their kids interrupting their zoom meetings and the owner class who have made billions in profits?**\n\n**Even the students are suffering!**\n\nWhy are the children suffering?\n\nIt's not BS learning loss or being forced to wear masks. \nChildren are smart, they see through the lies and the delusions adults tell children & themselves. \n\nChildren are seeing their country, a majority of adults, & capitalism reward sociopathic behaviors & that we don’t value EDU, teachers,or them, and instead many adults just want kids warehoused.\n\nChildren also are seeing and hearing how they have no future. So they are rightfully expressing their rage and frustration about the futility and stupidity of not only being in school, but being taught preCOVID education.\n\n**Our kids understand that our country and capitalism rewards sociopathic behaviors. So why can't you?**\n\nIt's because we have been lied to and propagandized our whole lives that Capitalism is not only good, but its the only \"sane\" economic system.\n\n**Do you feel comfortable?**\n\n**Has work made you comfortable?**\n\n**How long do you need to work to reach comfort?**\n\nThe ruling class desires you to give up everything except work. \n\nMaybe its time we stopped trying to solve our problems individually attempting the same solution and instead united in solidarity and just stopped.\n\nAlso, I might be wrong but I'm of the opinion that bullies throw tantrums and attack others to force those people to do what they want.\n\n**So what should you do now? Leave the profession ASAP.** \nNeed help?\nTap your friends, family, & their friends & family - your network- for jobs. AIM FOR WFH jobs because if not you are going from one unsafe job to another.\n\nThen Look on Google, LinkedIn, and indeed with the search terms of:\n\ninstructional design, event planning, copy editor, project management, Sales, marketing, edtech,  real estate, management, & others - \n\nwhich you can figure out by searching Twitter for I left teaching and now do…\n\nthen the next hurdle is if you haven’t applied for a job in a while you will need to rework your resume\n\ntry to find former teachers who are in the fields you are trying to apply too they will most likely gladly help out\n\nLike this group of former teachers who pay it forward helping teachers transition to instructional design\n\nhttps://www.teachlearndev.org\n\n**But I don't want public education destroyed!**\n\nThen long term look into uniting with other like minded teachers to create a better educational system. One community can be found on Twitter @lredschoolhouse\n\nThere's a lot more to say because this isn't a simple problem and is connected to every facet of our lives.\n\nLove over cruelty\nSolidarity over greed\nCompassion over capital",
    "title": "Warehousing the children of workers is essential for capitalism to function. That's why schools are being forced open during a pandemic.",
    "subreddit": "Teachers",
    "timestamp": 1640827075,
    "score": 1353,
    "keyword": "american ceo"
  },
  {
    "text": "Marcus Lemonis rewards teachers and staff at his alma mater This is incredible.\n\nMarcus Lemonis donated to his high school, Miami’s Columbus High School, and also gave each staff member $18,000 each!!\n\nFrom The Miami Herald (link below):\n\nTV star and entrepreneur Marcus Lemonis lacks the white beard and red coat, but after announcing Thursday he will give $18,000 checks to each employee at his alma mater, Christopher Columbus High School, many may start calling him Santa Claus.\n\n“It’s hot as s*** out here. I know we’re not supposed to cuss — all right — I will try to be brief about this,” said Lemonis, 48, as soon as he took the stage in front of about 1,600 people during a 9 a.m. schoolwide meeting on the Columbus football field.\n\nThe school administration had told students, teachers and staff to gather for a special guest appearance but hadn’t revealed the details. The last time they all gathered there was two years ago when the football team won the state championship.\n\n“When we think about the people that make this school run, the people that make it tick, the people that take care of the grounds and the classrooms, that teach us, that take care of us, those to me are the most important service providers on the planet,” Lemonis said. “It’s not a glamorous job; it’s not a high-paying job; it’s a job with a lot of stress.\n\n“Today, I’ll be providing a $3.1 million tip to everybody who works here. You’ll be sharing it,” he said. “Whether you’re a school teacher, whether you are in the maintenance department — every single employee will receive a check for $18,000.”\n\nLemonis, who hosts CNBC’s “The Profit,” graduated from Columbus in 1991 and was inducted into the Columbus Hall of Fame in 2015. In August 2020, the school partly named a new facility, the Center for Science and the Arts, after him.\n\nHis donation comes as part of his new initiative, The Great American Tip Off, a nationwide call to action to tip servers across the country.\n\nLemonis will dole out about $3.1 million to cover the one-time payments to the 180 Columbus employees — about 145 teachers and about 35 support staffers. Cristina Cruz, the school’s marketing director, said she couldn’t disclose the average employee salary at Columbus.\n\nAs soon as Lemonis broke the news, the crowd exploded in cheers.\n\n“What the h*** just happened?” said Jannette Rojas, who teaches English at Columbus, 3000 SW 87th Ave. “Oh my God. Oh my God. Oh my God. Is this what kids feel like with Santa? Is this what my kids feel on Christmas morning?”\n\nRojas, 44, has worked at Columbus for about seven years and has two boys, ages 8 and 11. “This the most wow thing that has ever happened,” she said.\n\nErin McGrath, a colleague of Rojas in the school’s English department, described what happened as a “great example” of giving back and following the mission of the school’s Marist Brothers, an international organization of religious men dedicated to education. She has worked at the school for about 13 years.\n\n“If you could’ve taken a picture of my face, it would’ve been a meme,” said McGrath, 36. “My heart is happy. It’s so full. I’m speechless.”\n\nBoth said they would follow Lemonis’ advice and use the money to pay off debt and invest. “Don’t go shopping!” Lemonis had told them a few minutes earlier.\n\nYovani Alvarez, the head of maintenance at the school and an employee of about 14 years, said he wants to invest it for his future.\n\n“I’m very grateful,” said Alvarez, 43. “Very excited.”\n\nSchool will also build two new centers, cancel class Friday\n\nLemonis also announced Thursday he will contribute an additional $7 million to build a college guidance center and a success center for students of disadvantaged backgrounds. Cruz said 35 percent of students at Columbus receive financial aid.\n\nHe requested the guidance center be named after two former teachers of his: Pat Call and Irene Culmo, and the success center after the Desmond family, his former neighbors. They all helped him get to where he is now and he wanted to recognize that.\n\n“Two of the families were school teachers of mine when I went here, and the other family, the Desmond family, is the reason that I came to Columbus. They drove me to school every day. They shepherded me and gave me all of the instructions I needed,” he said.\n\nCall, who taught biology and math at Columbus for nearly 45 years before retiring last spring, said “it was a total surprise” and she was “floored” when Lemonis said he wanted to honor her.\n\nLemonis’ most recent donation of more than $10 million is the largest the private, Catholic, all-male school has ever received since its founding in 1958. Cruz said she couldn’t disclose how much Lemonis has donated on other occasions, but that “he has been a great supporter of the school for many years.”\n\nLemonis was born in 1973 in Beirut, Lebanon. His birth mother dropped him off at an orphanage as a four-day-old baby. His parents, Sophia, a Lebanese, and Leo, a Greek, adopted Lemonis and moved him as a nine-month-old baby to Miami, where they raised him.\n\nAt about 25, after graduating from Marquette University in Wisconsin, Lemonis founded Camping World, which grew from a single store in Bowling Green, Kentucky, to the nation’s largest retailer of RVs, headquartered in Lincolnshire, Illinois.\n\nLemonis still leads the $5 billion-a-year company, which has more than 160 locations across the country, as its CEO and board chairman. \n\nIn “The Profit,” Lemonis finds struggling businesses and offers them cash in exchange for a piece of the profit, then tries to save the venture. In 2022, he will star in another show — The Renovator for HGTV — in which he will help people transform their homes. \n\nBefore he wrapped up Thursday, Lemonis said he had a third announcement that he hadn’t cleared with the administrators, pointing to the school’s president Thomas Kruczek: “There is no school tomorrow!” he said. Kruczek looked at him in surprise and raised his arms.\n\n“Marcus! Marcus! Marcus!” the students chanted. Asked later if he meant it, Lemonis said: “Oh, they’re definitely having school off tomorrow — I’m going to lock the fence, the door.”\n\nCruz confirmed afterward that the school canceled classes for Friday.\n\nRead more at: https://www.miamiherald.com/news/local/education/article256436921.html#storylink=cpy",
    "title": "Marcus Lemonis rewards teachers and staff at his alma mater",
    "subreddit": "Teachers",
    "timestamp": 1639503276,
    "score": 3,
    "keyword": "american ceo"
  },
  {
    "text": "My company wants me to move over to US within 6 weeks but they don't want to let me know the details. How to ask more about it without being a pain for them? So, basically last Friday my company called me and asked me to move countries from Melbourne to US.\n\nThey expect me to be in America on the 3rd week of December (So really short notice), the new guy that is managing it doesn't know a lot about the details and everytime I ask about it he says that he will be sorting out the next few days. The CEO of my company is well known to have these sort of quick decisions without thinking to much about the details.\n\nBut the thing is that I have another job offer that I am considering accepting except that with this new opportunity I am keen to stay in the same role as long as there's a good pay compensation of top of that.\n\nCurrently I don't hold an American Work visa, just a B1/b2 (business/tourist) visa and I don't even know if they want me go to there just for a few weeks while we work with this American client or they want me there for good\n\nAlso my partner has a 3 month notice period, which means that the longer they take to tell me the details the longer I will stay away from him.\n\nI have asked 3 different people inside the company from upper management already about the fine details and they just don't know. All I know is that they want me to go ASAP.\n\nI don't want to be a pain in their butt, how do I approach this situation without burning any br",
    "title": "My company wants me to move over to US within 6 weeks but they don't want to let me know the details. How to ask more about it without being a pain for them?",
    "subreddit": "careerguidance",
    "timestamp": 1634511726,
    "score": 12,
    "keyword": "american ceo"
  },
  {
    "text": "Should i get Mba or msc in management? Hello all,\n\nI am in a bit of a hard situation and I would appreciate some great advice along with the information I have got through doing research.\n\nI have graduated in may 2020, I was literally promised a job from my first internship in 2019 as soon as I graduate. Unfortunately, corona peaked at the time of my graduation and the people who promised me a job just ghosted me. I have earned a bachelors degree in nuclear medicine from USA and I am a non-american citizen. Since I majored in a healthcare field, I need to obtain a national license for the country i am planning to work in. First, I was in a country where they required 2 years work post graduation experience in order to get their license and work there. Now I am in a country in europe where I need 2-4 years in order to get the license to work in my field. From the beginning, my plan was to get few years of experience and then do a masters degree to work as a hospital ceo one day, but now I am thinking of changing my plans and get a masters degree in order to work somewhere without having to spend time on getting a license to work in a specific field. In terms of my long term goals of being a hospital ceo, is it better that i get an mba or a masters of science in management?",
    "title": "Should i get Mba or msc in management?",
    "subreddit": "careerguidance",
    "timestamp": 1618839009,
    "score": 1,
    "keyword": "american ceo"
  },
  {
    "text": "Am I being fairly compensated? I work in an Emergency Room in the United States of America. My primary position is to manage six staff (including interviewing, hiring, on-boarding, training, and scheduling), I additionally sometimes work clinical shifts - should the need arise. I am paid $22/hr, my benefits are paid for by my employer (not the hospital, I work for a subcontracted group), and in general, it is a pretty low-stress job and workload. I attribute this to my success as a manager, I adapt people's schedules so that many may go to the local community college for school, I schedule people three months in advance, and I check in regularly and provide whatever time off requests people have. There is also a long-term benefit to the hospital in that many of my staff go on to become ER nurses. \n\nAdditionally, I do some work that is mutually beneficial to the hospital's billing department, and my group's billing department \\[American Healthcare is a business, and I am sorry, but I also need to eat\\]. As is, my primary employer has elected to pay me for the additional work I am doing for the hospital - less headache that way. Moreover, I have also become involved with the hospital's Data Analytics engine, and am now one of the only people that have some understanding of how it works (rural American healthcare ladies and gentlemen). \n\nWhile I recognize that the work I am doing is beneficial for both parties, I fear that my duties have outstretched the initial terms of my contract. I am grateful for the amount of experience that I have gained working where I do. I wouldn't trade it for anything, but I've worked there for six years, and I can't help but wonder if I could get paid more than 44k/yr with my skillset. I am turning twenty-four this year, I have an associate's in General studies, and an appointment with an advisor to look into getting a Bachelors's in \"Applied Human Behavior\". \n\nI should mention that I really like my job as the manager of people. It's very rewarding to help so many people, and I think I am fairly compensated in that role. Frankly, I don't even mind doing the work for the hospital it's fun and I get to learn about all sorts of stuff. My primary employer also gave me a 2 dollar raise (I asked for it last year). I feel supported by my CEO, and I tend to like them. Yes, it's corporate America, but they're really nice compared to the hospital which Is run by a patriarchy of LDS (no offense to the LDS - it's just small-town politics and there are only white people in my town). \n\nDo I:\n\nStick it out for another 1.5 years while I finish a B.S.\n\nMove elsewhere and try and find a new job?\n\nAm I being dramatic? \n\nIf I could be paid for the work I do, I'd ask for 60k from the hospital but take 40k. And I would be a contracted employee under my own LLC (I'd have to file an LLC). \n\n&#x200B;\n\nWhat do y'all think?\n\n&#x200B;\n\nA.W.C.",
    "title": "Am I being fairly compensated?",
    "subreddit": "careerguidance",
    "timestamp": 1614306247,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "Name & Shame: LoanStreet (NY) is suing me for over $3M in federal court after I warned potential employees about the company's labor practices **\\[Update to** [**Name and Shame: LoanStreet (NY) cheated me out of equity**](https://www.reddit.com/r/cscareerquestions/comments/o3jpfc/name_and_shame_loanstreet_ny_cheated_me_out_of/)**\\]**\n\nLast summer, **I was overwhelmed by the positive response** of online forums for workers in the technology industry **when** **I** [**shared**](https://www.reddit.com/r/cscareerquestions/comments/o3jpfc/name_and_shame_loanstreet_ny_cheated_me_out_of/) [**the**](https://www.glassdoor.com/Reviews/Employee-Review-LoanStreet-NY-RVW48628117.htm) [**true story**](https://www.teamblind.com/post/Name-Shame-LoanStreet-NY-cheated-me-out-of-equity-rRKGJAj3) of how my former employer, [LoanStreet](https://www.loan-street.com/) (NY), cheated me out of equity compensation and fired me without warning in the middle of the COVID hiring freeze. Thousands of people went out of their way to read, upvote, and comment on my posts, spreading the message far and wide. **It was amazing to see people from around the world join forces to protect vulnerable, at-will workers from exploitative opportunists.**\n\n**In response, LoanStreet and its** [**CEO Ian Lampl**](https://www.linkedin.com/in/ian-lampl-b7a5b684/) **have** [**sued me**](https://dockets.justia.com/docket/new-york/nysdce/1:2021cv06166/563584) **for at least three million dollars in U.S. federal court.** They are throwing the kitchen sink at me, accusing me of breach of contract, defamation, injurious falsehood, unfair competition, and false designation of origin. **All the accusations are either false or are attempts to enforce contract provisions that are illegal under federal labor law.**\n\n[**LoanStreet's legal complaint**](https://www.dropbox.com/s/5g263cnc22yursj/Federal%25252525252525252525252520Court%25252525252525252525252520Complaint%2525252525252525252525252019%25252525252525252525252520Jul%2525252525252525252525252021.pdf?dl=0) **against me is riddled with inaccuracies**, accusing me of all sorts of things I had nothing to do with. **Attempting to discredit me and distract from its lack of any supporting evidence, LoanStreet drags my name through the mud with wild lies** about my professional abilities and my motivation for sharing my experience, using phrases like \"intent of...whipping up an angry mob\"; \"acted maliciously, oppressively, with an improper and evil motive\"; \"delusions of grandeur\"; \"wickedness of \\[my\\] intentions”; and \"pernicious intentions.” I'm not sure if I'm being sued by LoanStreet or Charles Dickens.\n\n**To LoanStreet and CEO Ian Lampl: US law is on my side and I will prevail in court. Common sense and morality are on my side and I will prevail in the court of public opinion.** My donors and I can and will keep this fight up as long as is needed to ensure you cannot blindside anyone else, and to set a legal precedent that will protect all American workers from companies like you. Multiple former LoanStreet employees who feel you took advantage of them have reached out to thank me for standing up to you. You got away with discreetly abusing employees for a long time, but now you are reaping what you sowed.\n\nMedia coverage:\n\n* [Ladders](https://www.theladders.com/career-advice/a-former-employee-trashed-his-employer-online-now-theyre-suing-him)\n* [Business Insider](https://www.businessinsider.com/bad-glassdoor-reddit-review-led-to-a-1-million-lawsuit-2021-8)\n* [The Hustle](https://thehustle.co/08052021-glassdoor-lawsuit/)",
    "title": "Name & Shame: LoanStreet (NY) is suing me for over $3M in federal court after I warned potential employees about the company's labor practices",
    "subreddit": "cscareerquestions",
    "timestamp": 1633714408,
    "score": 5484,
    "keyword": "american ceo"
  },
  {
    "text": "How to complain against boss in small company So I am the lead of the R&D team in a company of 25. I report directly to the second-in-line of the company, whose official title is “Director of Development”. \n\nMy boss is an extreme narcissist who micromanages, doesn’t listen when we say something can’t work and isn’t worth the effort (both true, every time), disrespects everyone, devalues everyone with sly comments, threatens to nullify bonuses etc. \n\nWith only the CEO above him in a small company, I see it as risky to go directly to the CEO, because I feel my boss will somehow lie his way out of my complaints, as he always does. I have a few recorded videos of him straight up leaving calls while people are trying to talk to him, examples of his devaluing comments, and lying that he made decisions that caused everything to break. The worst one shows him being incredibly insensitive (joking) about how my cat got killed by coyotes the day beforehand. \n\nI got a written performance warning from him yesterday. My team and I know that it’s because of his managing.  If I file an complaint, he will definitely put our missed goals against me. The team (whom have been with the company for 4 years, me 7 months) will probably not join the complaint because their culture (Japanese under an American boss) unfortunately is submissive. \n\nMy question is: what should I expect if I file an complaint and speak to the CEO? Should I even do it? My boss is extremely good at sliding by tough situations with his charm. Options are to just bear with him and continue looking for a job, or complain about my boss and start massive turmoil within the company I love. Both options are very stressful, consequences imposed on my fellow coworkers, and involve feelings of loss.\n\nI love this company and the opportunity I’ve been given to make an product that will make an difference in the real world. I don’t want to lose that, but the absurdity of my boss is just too much to bear. Yes, I have had conversations with him regarding his actions, and he does not take responsibility or take steps to change his behavior.\n\nRegardless, I’m grinding leet code and getting ready for interviews, because I legitimately can’t work under this guy.\n\nI guess this turned into more of an venting post…\n\nEdit: CEO is HR btw",
    "title": "How to complain against boss in small company",
    "subreddit": "cscareerquestions",
    "timestamp": 1634418659,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "Are we actually gonna see the complete globalization of the tech industry? Well, I'm not sure that I am allowed to question here.I am actually on the learning programming phase- enrolling in a college soon.\n\nSo Everyone is going remote nowadays.So, what stops it from going global. And I'm not talking about spegatti coders or incompetent people (Although that's usually what peanuts gets), what I'm trying to say that for the same job in the same level a 100k job in America is  10k here- end of story. So if they pay me let's say 30k and another 20k from  them in tax and crap.But still it's a win win situation for both.\n\nI mean corona fucked everything up.It has definitely globalised me and millions of others.So instead of paying local tutor, I'm accessing the top uni courses, downloading their textbooks and following that curriculum and planning to grind the same leetcode.The culture has been also  quite neutralized in the few years.So if I'm in the mainstream American learning system,can I enter the job market as well?\n\nI mean not now.But think about next five years.We already see big companies doing it .Even have non American CEO.So will the smaller ones follow?\n\nlike what's your opinion and thoughts.Knowing I'm studying for 50k vs 10k is a big difference.One can make you sit in front of the black screen day and night,but the other is not so exciting",
    "title": "Are we actually gonna see the complete globalization of the tech industry?",
    "subreddit": "cscareerquestions",
    "timestamp": 1639992110,
    "score": 0,
    "keyword": "american ceo"
  },
  {
    "text": "What are my chances of getting an entry level position in public or industry accounting? Hello! I graduated with a degree in Accounting in 2010, and an MBA degree in 2012 with a respectable GPA of 3.50. I was also a member of an honor society. After 2012, I met a woman from Europe and followed her to her country. Unfortunately, the economy was very bad there (50 % amongst younger adults), so I worked in an entirely different field to earn an income. \n\nFast forward to 2018 when the relationship sadly ended. I moved to another European country (most of my family lives there). I’ve supported myself taking odd jobs here and there, but haven’t been able to break into the job market in accounting here. My resume is sadly completely unrelated to accounting, which works against me when looking for a job here, as it would for anyone being out of the game for so long. There’s also a major language barrier (long story). \n\nFast forward to 2021, my friend in the US who owns a small business has offered me a temporary job working in his office (AP/AR accounting using Quickbooks + other duties at the office) until I can find an entry level job in accounting in either industry or public accounting. He wants to pay 40K per year without any benefits. \n\nI am really hesitating, as I am worried that I’ll have a hard time finding an entry level Staff accounting position or something similar, considering the gap in my CV. He lives in one of the largest American cities. \n\nI read an article on LinkedIn by a CEO, recommending that those who have been out of the game for several years may propose to potential employers a contract type of employment, in which they wouldn’t have to hire me immediately before feeling assured that I am reliable and a good fit for their business. What other paths do you recommend to get a good entry level job in accounting in the US? How difficult would it be? \n\nHas your firm/company hired anyone in a similar boat to mine, or would a situation like mine be entirely frowned upon? \n\nI am 3 accounting courses away from being able to sit for the CPA exam, but realistically this would be a medium term goal if absolutely necessary, as many states require accounting related employment for 1 year in order to be certified. \n\nI have two solid CPA references from my studies. \n\nThanks for your feedback. I really appreciate it. I feel very anxious over my situation but really want to change it.",
    "title": "What are my chances of getting an entry level position in public or industry accounting?",
    "subreddit": "Accounting",
    "timestamp": 1634493826,
    "score": 9,
    "keyword": "american ceo"
  },
  {
    "text": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans] Noticeably absent:\n\n* University of Texas - Austin\n* Fordham\n* Iowa\n* Alabama\n* George Mason\n* Baylor\n* Notre Dame\n* Texas A&M\n* Kansas\n\n&#x200B;\n\n&#x200B;\n\n[https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/](https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/)\n\nJanuary 12, 2021\n\nLaw Deans Joint Statement on the 2020 Election and Events at the Capitol\n\n&#x200B;\n\nWe are deans of a diverse range of law schools across the country. We do not use our positions to advance our individual views. But we do have an obligation to support the rule of law and preserve the integrity of the legal profession. On rare occasions, despite our differing situations and views, that obligation requires us to speak as one to defend the fundamental commitments of our profession. This is such a moment.\n\nThe violent attack on the Capitol was an assault on our democracy and the rule of law. The effort to disrupt the certification of a free and fair election was a betrayal of the core values that undergird our Constitution. Lives were lost, the seat of our democracy was desecrated, and our country was shamed.\n\nMany lawyers and judges worked honestly and in good faith, often in the face of considerable political pressure, to ensure the 2020 election was free and fair. However, we recognize with dismay and sorrow that some lawyers challenged the outcome of the election with claims that they did not support with facts or evidence. This betrayed the values of our profession. Our profession demands that when lawyers pursue legal action, they must bring claims in good faith, grounded in facts and evidence, and demonstrate respect for the legal system. Only then can lawyers fulfill their responsibilities as lawyers and public citizens to promote public confidence in the rule of law and the justice system — duties that extend to all professional activities, whether lawyers are representing a client or not. The rule of law is as much a touchstone of our profession as it is of our Constitution.\n\nAs law deans, our mission is to train the next generation of leaders to uphold the core values of our profession and sustain the rule of law. This should be a moment of reflection for legal educators and members of the legal profession. A sustained effort will be necessary to repair and preserve our precious democratic institutions. As legal educators and lawyers ourselves, we must redouble our efforts to restore faith in the rule of law and the ideals of the legal profession. We have enormous faith in the law’s enduring values and in our students, who will soon lead this profession. We call upon all members of the legal profession to join us in the vital work ahead.\n\n&#x200B;\n\nSigned,\n\n^(Alicia Ouellette President and Dean Albany Law School)\n\n^(Robert Dinerstein Acting Dean and Professor of Law American University, Washington College of Law)\n\n^(Jace C. Gatewood Dean and CEO Atlanta's John Marshall Law School)\n\n^(Melanie Leslie Dean and Samuel Belkin Professor of Law Benjamin N. Cardozo School of Law, Yeshiva University)\n\n^(Vincent Rougeau Dean and Professor Boston College Law School)\n\n^(Angela Onwuachi-Willig Dean and Professor of Law Boston University School of Law)\n\n^(Michael T. Cahill President, Joseph Crea Dean & Professor of Law Brooklyn Law School)\n\n^(Sean M. Scott President and Dean California Western School of Law)\n\n^(Reynaldo Anaya Valencia Dean and Professor of Law Capital University Law School)\n\n^(Anita K. Krug Dean and Professor Chicago-Kent College of Law, Illinois Institute of Technology)\n\n^(Charles H. Rose III Dean and Professor of Law Claude W. Pettit College of Law, Ohio Northern University)\n\n^(Lee Fisher Dean and Joseph C. Hostetler-BakerHostetler Chair in Law Cleveland-Marshall College of Law, Cleveland State University)\n\n^(Gillian Lester Dean and Lucy G. Moses Professor of Law Columbia Law School)\n\n^(Jens David Ohlin Interim Dean & Professor of Law Cornell Law School)\n\n^(Joshua P. Fershée Dean and Professor of Law Creighton University School of Law)\n\n^(Henry C. Strickland Dean Cumberland School of Law, Samford University)\n\n^(Mary Lu Bilek Dean and Professor of Law CUNY School of Law)\n\n^(Rodney A. Smolla Dean & Professor of Law Delaware Law School, Widener University)\n\n^(Jennifer Rosato Perea Dean and Professor DePaul University College of Law)\n\n^(Jerry L. Anderson Dean and Richard M. and Anita Calkins Distinguished Professor of Law Drake University Law School)\n\n^(Kerry Abrams James B. Duke and Benjamin N. Duke Dean and Professor of Law Duke University School of Law)\n\n^(April M. Barton Dean and Professor of Law Duquesne University School of Law)\n\n^(Horace Anderson Dean and Professor of Law Elisabeth Haub School of Law, Pace University)\n\n^(Luke Bierman Dean and Professor of Law Elon University School of Law)\n\n^(Mary Anne Bobinski Dean and Asa Griggs Candler Professor of Law Emory University School of Law)\n\n^(Deidré A. Keller Dean and Professor of Law Florida Agricultural and Mechanical University College of Law)\n\n^(C. Peter Goplerud Dean and Professor of Law Florida Coastal School of Law)\n\n^(Antony Page Dean & FIU Foundation Professor of Law Florida International University College of Law)\n\n^(Erin O’Hara O'Connor Dean and McKenzie Professor of Law Florida State University College of Law)\n\n^(William M. Treanor Dean & Executive Vice President Georgetown Law)\n\n^(Leslie E. Wolf Interim Dean and Distinguished University Professor Georgia State University College of Law)\n\n^(Eric C. Christiansen Dean of the Law School (Interim, 2020-21), Professor of Law Golden Gate University, School of Law)\n\n^(Jacob Rooksby Dean and Professor of Law Gonzaga University School of Law)\n\n^(John F. Manning Morgan and Helen Chu Dean and Professor of Law Harvard Law School)\n\n^(Danielle Holley-Walker Dean and Professor of Law Howard University School of Law)\n\n^(Austen Parrish Dean and James H. Rudy Professor of Law Indiana University Maurer School of Law)\n\n^(Karen E. Bravo Dean and Professor of Law Indiana University Robert H. McKinney School of Law)\n\n^(Gordon Smith Dean and Woodruff J. Deem Professor of Law J. Reuben Clark Law School at Brigham Young University)\n\n^(Jennifer J. Johnson Dean and Erskine Wood Sr. Professor of Law Lewis and Clark Law School)\n\n^(Matthew R. Lyon Vice President & Dean Lincoln Memorial University Duncan School of Law)\n\n^(Colin Crawford Dean and Professor of Law Louis D. Brandeis School of Law, University of Louisville)\n\n^(Lee Ann Wheelis Lockridge Interim Dean and Professor of Law Louisiana State University Law Center)\n\n^(Michael Waterstone Dean and Professor of Law Loyola Law School, Los Angeles)\n\n^(Michael J. Kaufman Dean and Professor of Law Loyola University Chicago School of Law)\n\n^(Madeleine M. Landrieu Dean and Judge Adrian G. Duplantier Distinguished Professor of Law Loyola University New Orleans College of Law)\n\n^(Gail Prudenti Dean Maurice A. Deane School of Law at Hofstra University)\n\n^(Cathy Cox Dean and Professor of Law Mercer University School of Law)\n\n^(Lincoln L. Davies Dean & Frank R. Strong Chair in Law Michael E. Moritz College of Law, The Ohio State University)\n\n^(Melanie B. Jacobs Interim Dean & Professor of Law Michigan State University College of Law)\n\n^(Patricia Bennett Dean & Professor of Law Mississippi College School of Law)\n\n^(Anthony Niedwiecki President and Dean Mitchell Hamline School of Law)\n\n^(Anthony W. Crowell Dean and President New York Law School)\n\n^(Trevor Morrison Dean and Eric M. and Laurie B. Roth Professor of Law New York University School of Law)\n\n^(James Hackney Dean and Professor of Law Northeastern University School of Law)\n\n^(James Speta Interim Dean Northwestern Pritzker School of Law)\n\n^(José Roberto (Beto) Juárez, Jr. Dean and Professor of Law Nova Southeastern University Shepard Broad College of Law)\n\n^(Jim Roth Dean and Professor of Law Oklahoma City University School of Law)\n\n^(Danielle M. Conway Dean and Donald J. Farage Professor of Law Penn State Dickinson Law)\n\n^(Hari M. Osofsky Dean, Penn State Law and Penn State School of International Affairs Distinguished Professor of Law, Professor of International Affairs, and Professor of Geography)\n\n^(Paul L. Caron Duane and Kelly Roberts Dean and Professor of Law Pepperdine University Rick J. Caruso School of Law)\n\n^(Jennifer Gerarda Brown Dean and Professor of Law Quinnipiac University School of Law)\n\n^(Gregory W. Bowman Dean & Professor of Law Roger Williams University School of Law)\n\n^(David Lopez Co-Dean & Professor of Law Rutgers Law School)\n\n^(Kimberly M. Mutcherson Co-Dean & Professor of Law Rutgers Law School)\n\n^(Elizabeth Kronk Warner Dean S.J. Quinney College of Law, University of Utah)\n\n^(William P. Johnson Dean and Professor of Law Saint Louis University School of Law)\n\n^(Judith Daar Ambassador Patricia L. Herbold Dean and Professor of Law Salmon P. Chase College of Law, Northern Kentucky University)\n\n^(Douglas J. Sylvester Dean and Professor of Law Sandra Day O’Connor College of Law at Arizona State University)\n\n^(Anna M. Han Interim Dean Santa Clara University School of Law)\n\n^(Martin H. Brinkley Dean and Arch T. Allen Distinguished Professor School of Law, University of North Carolina at Chapel Hill)\n\n^(Annette E. Clark Dean and Professor of Law Seattle University School of Law)\n\n^(Kathleen M. Boozang Dean and Professor of Law Seton Hall University School of Law)\n\n^(Jennifer M. Collins Judge James Noel Dean and Professor of Law SMU Dedman School of Law)\n\n^(Susan Westerberg Prager President and Dean Southwestern Law School)\n\n^(Michael A. Simons Dean and John V. Brennan Professor of Law St. John’s University School of Law)\n\n^(Jenny S. Martinez Richard E. Lang Professor of Law & Dean Stanford Law School)\n\n^(Michèle Alexandre Dean and Professor of Law Stetson University College of Law)\n\n^(Andrew Perlman Dean & Professor of Law Suffolk University Law School)\n\n^(Craig M. Boise Dean and Professor of Law Syracuse University College of Law)\n\n^(Gregory N. Mandel Dean & Peter J. Liacouras Professor of Law Temple University, Beasley School of Law)\n\n^(Dayna Bowen Matthew Dean and Harold H. Greene Professor of Law The George Washington University Law School)\n\n^(Christopher J. (C.J.) Peters Dean and C. Blake McDowell, Jr. Professor of Law The University of Akron School of Law)\n\n^(Thomas J. Miles Dean and Clifton R. Musser Professor of Law and Economics The University of Chicago Law School)\n\n^(Katharine Traylor Schaffzin Dean & Professor of Law The University of Memphis Cecil C. Humphreys School of Law)\n\n^(Sergio Pareja Dean The University of New Mexico School of Law)\n\n^(Benjamin Barros Dean and Professor of Law The University of Toledo College of Law)\n\n^(Lyn Suzanne Entzeroth Dean and Dean John Rogers Endowed Chair The University of Tulsa College of Law)\n\n^(Daniel M. Filler Dean and Professor of Law Thomas R. Kline School of Law, Drexel University)\n\n^(David D. Meyer Dean and Mitchell Franklin Professor of Law Tulane University Law School)\n\n^(Theresa Beiner Dean & Nadine Baum Distinguished Professor of Law UA Little Rock William H. Bowen School of Law)\n\n^(Kevin R. Johnson Dean UC Davis School of Law)\n\n^(Jennifer L. Mnookin Dean and Ralph and Shirley Shapiro Professor of Law UCLA School of Law)\n\n^(Darby Dickerson Dean and Professor of Law UIC John Marshall Law School, The University of Illinois at Chicago)\n\n^(Barbara Glesner Fines Dean & Rubey M. Hulen Professor of Law UMKC School of Law)\n\n^(Aviva Abramovsky Dean and Professor of Law University at Buffalo School of Law, The State University of New York)\n\n^(Marc L. Miller Dean & Ralph W. Bilby Professor of Law University of Arizona James E. Rogers College of Law)\n\n^(Margaret Sova McCabe Dean & Professor of Law University of Arkansas School of Law)\n\n^(Ronald Weich Dean and Professor of Law University of Baltimore School of Law)\n\n^(David L. Faigman Chancellor & Dean and John F. Digardi Distinguished Professor of Law University of California Hastings College of the Law)\n\n^(Erwin Chemerinsky Dean and Jesse H. Choper Distinguished Professor of Law University of California, Berkeley School of Law)\n\n^(L. Song Richardson Dean and Chancellor’s Professor of Law University of California, Irivine School of Law)\n\n^(Verna L. Williams Dean and Nippert Professor of Law University of Cincinnati College of Law)\n\n^(S. James Anaya Dean and University Distinguished Professor University of Colorado Law School)\n\n^(Eboni S. Nelson Dean and Professor of Law University of Connecticut School of Law)\n\n^(Andrew Strauss Dean and Professor of Law University of Dayton School of Law)\n\n^(Bruce P. Smith Dean and Professor of Law University of Denver Sturm College of Law)\n\n^(Phyllis L. Crocker Dean and Professor of Law University of Detroit Mercy School of Law)\n\n^(Laura Ann Rosenbury Dean and Levin, Mabie & Levin Professor of Law University of Florida Levin College of Law)\n\n^(Peter B. Rutledge Dean University of Georgia School of Law)\n\n^(Camille A. Nelson Dean and Professor of Law University of Hawai‘i at Mānoa, William S. Richardson School of Law)\n\n^(Leonard M. Baynes Dean and Professor of Law University of Houston Law Center)\n\n^(Jerrold Long Dean and Professor of Law University of Idaho College of Law)\n\n^(Vikram David Amar Dean and Iwan Foundation Professor of Law University of Illinois College of Law)\n\n^(Mary J. Davis Dean and Ashland-Spears Distinguished Research Professor of Law University of Kentucky J. David Rosenberg College of Law)\n\n^(Daniel W. Hamilton Dean & Richard J. Morgan Professor of Law University of Las Vegas, William S. Boyd School of Law)\n\n^(Donald B. Tobin Dean and Professor of Law University of Maryland Francis King Carey School of Law)\n\n^(Eric J. Mitnick Dean & Professor of Law University of Massachusetts School of Law)\n\n^(Anthony E. Varona Dean and M. Minnette Massey Professor of Law University of Miami School of Law)\n\n^(Mark D. West Dean and Nippon Life Professor of Law University of Michigan Law School)\n\n^(Garry W. Jenkins Dean & William S. Pattee Professor of Law University of Minnesota Law School)\n\n^(Susan H. Duncan Dean and Professor of Law University of Mississippi)\n\n^(Lyrissa Lidsky Dean & Judge C.A. Leedy Professor of Law University of Missouri School of Law)\n\n^(Richard Moberly Dean and Richard C. & Catherine S. Schmoker Professor of Law University of Nebraska College of Law)\n\n^(Megan Carpenter Dean and Professor of Law University of New Hampshire Franklin Pierce School of Law)\n\n^(Michael S. McGinniss Dean and Professor of Law University of North Dakota School of Law)\n\n^(Katheleen R. Guzman Interim Dean and Professor University of Oklahoma College of Law)\n\n^(Marcilynn A. Burke Dean and Dave Frohnmayer Chair in Leadership and Law University of Oregon School of Law)\n\n^(Theodore W. Ruger Dean and Bernard G. Segal Professor of Law University of Pennsylvania Carey Law School)\n\n^(Amy J. Wildermuth Dean and Professor of Law University of Pittsburgh School of Law)\n\n^(Vivian I. Neptune Dean University of Puerto Rico School of Law)\n\n^(Wendy C. Perdue Dean and Professor of Law University of Richmond School of Law)\n\n^(Robert Schapiro Dean and Professor of Law University of San Diego School of Law)\n\n^(Susan H. Freiwald Dean and Professor of Law University of San Francisco School of Law)\n\n^(William C. Hubbard Dean and Professor of Law University of South Carolina School of Law)\n\n^(Neil Fulton Dean University of South Dakota Knudson School of Law)\n\n^(Andrew T. Guzman Dean and Carl Mason Franklin Chair in Law, and Professor of Law and Political Science University of Southern California Gould School of Law)\n\n^(Robert K. Vischer Dean and Mengler Chair in Law University of St. Thomas School of Law)\n\n^(Douglas Blaze Interim Dean and Art Stolnitz and E.O. Overton Professor of Law University of Tennessee College of Law)\n\n^(Renée McDonald Hutchins Dean & Rauh Chair of Public Interest Law University of the District of Columbia David A. Clarke School of Law)\n\n^(Michael Hunter Schwartz Dean and Professor of Law University of the Pacific, McGeorge School of Law)\n\n^(Risa Goluboff Dean and Arnold H. Leon Professor of Law and Professor of History University of Virginia School of Law)\n\n^(Mario L. Barnes Toni Rembe Dean and Professor of Law University of Washington School of Law)\n\n^(Daniel P. Tokaji Fred W. & Vi Miller Dean and Professor of Law University of Wisconsin Law School)\n\n^(Klint Alexander Dean and Professor of Law University of Wyoming College of law)\n\n^(Chris Guthrie Dean Vanderbilt Law School)\n\n^(Thomas McHenry President and Dean Vermont Law School)\n\n^(Mark C. Alexander Arthur J. Kania Dean and Professor of Law Villanova University Charles Widger School of Law)\n\n^(Jane H Aiken Dean and Professor of Law Wake Forest Law School)\n\n^(Carla D. Pratt Dean and Professor of Law Washburn University School of Law)\n\n^(Brant J. Hellwig Dean and Professor of Law Washington and Lee University School of Law)\n\n^(Nancy Staudt Dean and Howard & Caroline Cayne Distinguished Professor of Law Washington University School of Law)\n\n^(Richard A. Bierschbach Dean and Professor of Law Wayne State University Law School)\n\n^(James McGrath Dean and President Western Michigan University Cooley Law School)\n\n^(Sudha Setty Dean and Professor of Law Western New England University School of Law)\n\n^(Allen K. Easley Dean & Professor of Law Western State College of Law at Westcliff University)\n\n^(Brian Gallini Dean & Professor of Law Willamette University College of Law)\n\n^(A. Benjamin Spencer Dean & Chancellor Professor William & Mary Law School)\n\n^(John E. Taylor Interim Dean and Jackson Kelly Professor of Law WVU College of Law)\n\n^(Heather K. Gerken Dean and Sol & Lillian Goldman Professor of Law Yale Law School)",
    "title": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans]",
    "subreddit": "LawSchool",
    "timestamp": 1610491035,
    "score": 18,
    "keyword": "american ceo"
  },
  {
    "text": "Asian American CEOs Are Rare Due to Lack of Promotions",
    "title": "Asian American CEOs Are Rare Due to Lack of Promotions",
    "subreddit": "asianamerican",
    "timestamp": 1622055219,
    "score": 92,
    "keyword": "american ceo"
  },
  {
    "text": "Out of the Loop: What happened this weekend with Jay Caspian Kang? A friend of mine asked me what I thought about the Twitter drama over the weekend around Jay Caspian Kang's new book. I see that Ellen Pao (former Reddit CEO) has tweeted critically of him, and that some of the Kang critics seem to be proud of the fact that they don't have to read the book anymore. \n\n1. What's the controversy? Does he paint \"Men's Rights Activists\" in too sympathetic a light? Is it about his argument that Asian American activism tends to make the most noise around stuff that affects the richest Asian Americans, rather than the high stakes stuff about health/safety of the poorer Asian Americans? Is it something else?\n2. There's some reference to Kang's past pandering to white supremacists. What's that about?",
    "title": "Out of the Loop: What happened this weekend with Jay Caspian Kang?",
    "subreddit": "asianamerican",
    "timestamp": 1634694472,
    "score": 69,
    "keyword": "american ceo"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 34,
    "keyword": "american ceo"
  },
  {
    "text": "How Filipino American teen CEO Ryan Ang's basketball training business thrived amid Covid",
    "title": "How Filipino American teen CEO Ryan Ang's basketball training business thrived amid Covid",
    "subreddit": "asianamerican",
    "timestamp": 1614443485,
    "score": 7,
    "keyword": "american ceo"
  }
]