[
  {
    "text": "[office politics] coworker backstabbing me I got out of an engineering school October 2016. I am NOT American (Europe). I got my first job in August 2017. \n\nI am part of a small team of highly qualified people. We are 8 :\n\n•\tThe boss\n\n•\tMe\n\n•\tThe boss’ secretary\n\n•\tAn old guy (50)\n\n•\tAnother young guy (26, same age as me)\n\n•\tA regular guy (40)\n\nAll those people are directors. They have corporate positions which means they are in charge of one aspect for all the factories of the Group (about 100 factories throughout the world). \n\nFor instance one of these guy is in charge of maintenance while the other is in charge of industrial performance. \n\nI work in a team with the old guy, let’s call him “fucker” (name changed to protect identity, although I got the feeling you would recognize him easily with this new name). \n\nWe work together on one huge project which is about quality management. He is officially the one in charge. \n\nSo fucker works on industrial performance and on this project. I was recruited to handle this project and the many more projects concerning quality management that will arise in the future. So this project is tremendously important to me. \n\nHere is the problem \n\n**first** he takes credit for all MY work. I work like hell, I send him what I did, and then he sends it to the boss without ever mentioning my name or what I did. \n\n**second** I have the feeling he tries to “erase” me. For instance I asked him to tell me when he would call our boss to discuss the project advancement. He did it without me (teamwork anyone?). So it’s like he is the only one working on this project. All the work I do is invisible because he takes credit for my work and I don’t even take part into project advancement discussions. \n\nI WANNA KILL THAT MOTH..\n\n**sigh**\n\nYeah. \n\nWorst thing is he is very nice and I always have a great time with him but he harms me behind my back. \n\nMy goal is to show my boss that I work hard on this project. Because right now he must be thinking I do nothing at all. \n\nI am only hired for ONE YEAR. This is a great opportunity for me and I don’t want to fuck this up. \n\nPLEASE HELP I’M LOST",
    "title": "[office politics] coworker backstabbing me",
    "subreddit": "jobs",
    "timestamp": 1510747814,
    "score": 6,
    "keyword": "american manager"
  },
  {
    "text": "I resigned from my part-time retail job, hoping I made the right decision Backstory: Ever since graduating high school I knew I would have to find a part-time job to work in order to pay for tuition and cover other expenses since my parents couldn't afford to do so. I got a job working for one of the most famous American fashion designer brands as a sales associate and was happily employed there for the most part. Until 2.5 years later my store was closed and I was laid off, with a generous severance package thankfully. I told myself I didn't want to do retail anymore, at least not in a large store where I was only gonna be treated as well as my sales were.\n\nAfter being laid off I was unemployed for only about a month, before finding a new job. That month of unemployment was very productive for me, all in all, I went on 12 interviews and landed 3 positions. When it was all said and done I decided to work in a small boutique retail showroom, inside of the company's corporate office. As a result, I got access to all the perks all the actual corporate employees did and got to see what office life was really like, all while technically still working retail. After 6 months of working there I still do really love the brand and loved my job, but ultimately lack of support from my manager and a series of condescending remarks from my coworker's about my job performance made me have second thoughts.\n\nOver the summer my family was blessed with inheriting a sizeable amount of money from a relative who passed. My family promised me they would contribute part of that money to paying off my undergrad and graduate degree. Despite knowing that I didn't have to work anymore I still chose to do so. But after more frequent bitter moments at work and a new opportunity on the horizon, I thought about why I started working retail in the first place.\n\nWith the holiday weekend now being over and having served my part, I officially submitted my resignation email. A lengthy two paragraphs thanking my manager for the opportunity but letting them know that I secured an internship that offered more relevant experience to my degree. Despite my gracious tone and enthusiasm towards the brand, I received a rather curt \"Thank you, please let us know when your last day will be.\" Now I'll be starting my first internship of my college career (junior year )\n\nI've never known anything but retail my whole life. I'm super anxious right now but retail isn't my career so I am hoping I did the right thing. All I know is that doing this has lit a fire under my ass. I am super ready to work hard and make sure that this career choice plays out for the better. (If you want more information about company names and more specifics feel free to private message me as I feel this post is already fairly long.)\n\nTL;DR: I finally stopped drinking the retail kool-aid, will be taking a leap of faith into my first internship, and am nervous like all fucking hell!",
    "title": "I resigned from my part-time retail job, hoping I made the right decision",
    "subreddit": "jobs",
    "timestamp": 1511843178,
    "score": 7,
    "keyword": "american manager"
  },
  {
    "text": "Casual racism ***** EDIT: Wow, this post got significantly more attention than I expected. Thanks for all the advice and support (and zealous arguments about when stores should and should not allow more customers inside). I will be reporting this employee, mainly because while I do believe that there was wrong on both sides (but thanks to all of you who clearly offer amazing customer service), and I should just get over it, there is something to be said about speaking out about these matters, especially when prior generations have not. Who knows if it makes a difference, but it seems to at least have sparked some discussion here. I'm not going to insist on his firing or other retribution, if they would even do so in the first place; I can totally understand if this guy had a bad day and needed to take it out on someone. But the company should know if a branch allowed an employee to scream at a customer and did not address it immediately.\n\nObviously there's a lot of overt racism in the US, and it's been at a head for a long time now. There is every day violence committed against blacks and Muslims, and the statistics are there to prove it. I'm glad we talk about that. I hope that we can also talk about how comments about one's English or consumption of domestic animals is destructive too. No need to rank racism; it's all bad. For those who asked why saying \"ni hao\" is frustrating, rude, and yes, racist--I speak English. Why are those people assuming that I don't? *****\n\n\nI apologize beforehand if this isn't the right forum, but I need a place to vent, and this subreddit has always been one of the more open ones on this site. I went home this past weekend while studying for Step 1, and my dad offered to drive me back to my apartment as I don't live too far from school. He really wanted to stop by Sam's Club to pick up some fruit for me to take back, and even though I didn't think it was worth the effort, especially since it was nearing closing time, I said okay, because it's nice when your parents want to be nice to you, you know? We got to Sam's Club literally a minute before it closed, and my dad rushed inside while I parked. I decided to just wait for him outside the doors and was standing there when the guy who checks receipts called me inside and asked me if I was with the person who had just run in. He then proceeded to berate me for my dad coming in at closing time. (Edit: I did in fact tell him we were just getting one thing, in English, for those saying I shouldn't have just walked away. But no one has time to be yelled at once you're trying to be reasonable.) I walked away because no one has time to deal with that, and as I was walking away, he said, \"Maybe if I speak your language, ni hao ni hao, you’ll understand.\" I went to the cash registers and asked for the supervisor. When I told her what had happened and what this man had said, he ran up from the doors and started screaming in my face about how I was \"lying on [him].\" He continued to yell that I was lying (honestly if I were going to lie, I would have come up something slightly more creative). The manager said he was just trying to do his job.\n\nI was so frustrated and upset, and I continue to be despite sleeping on it. My dad does not want me to report this person because my dad is a good person and at about the zenith of non-confrontational, and he doesn't think this employee should be at risk for losing his job. But for me, not saying anything feels like implicitly condoning this behavior. Yes, we were in the wrong for entering this store at closing time--that one pack of strawberries better be the best I've ever had--but that didn’t justify outright racism and aggression. I don't know how many times I have heard \"ni hao\" as an insult/pick-up line/greeting and how many times I have been congratulated on not having an accent. I have been followed down the street and called a cunt because I told a stranger that addressing me with \"ni hao\" was impolite. I know this is something that people of color confront on a daily basis and that we are meant to speak out when it happens, but… it's hard, guys. Racism directed at Asians and Asian-Americans in particular seems like the last bastion of racism in comedy (see: Steve Harvey), the last and most insidious form of undercutting a whole group of people. It feels like no matter how hard I work, no matter how much I dedicate my professional (and whatever is left of my personal) life to trying to take care of people, how much my parents have sacrificed, that I can be leveled with the basest of insults.",
    "title": "Casual racism",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485967033,
    "score": 2363,
    "keyword": "american manager"
  },
  {
    "text": "Working with anti-feminists How do women feminists work alongside other women who are actively against feminism? How do feminists try to persuade other women who view feminism in the negative sense that it will have a positive impact in the workplace? \n\nI know I can't be the only women who is frustrated with other women in their workplace. So many college educated white women voted for Trump and that set of ideals as did the feminists who voted for Hillary. It's been difficult for me to create and encourage a \"pro-women\" workplace when my fellow women actively work against it, even if they're working against themselves. I feel stuck and outnumbered. I've created a pocket of employees who practice the same ideas and cooperation and our results have been overwhelmingly positive, but my other female peers reject and ridicule the model, despite their practices leading to negative results. It only leads to us all doing more work, higher work stress and a toxic atmosphere.\n\nTo give a clearer picture:\n\nI live in a red (almost) southern state and work as a retail manager. Like most retail locations, my store employees and peers consists of mostly of women between the ages of 16-50. I don't want to get too specific of my company, but my store is a common retailer you would find in any middle American mall, and fortunately they have an inclusive, empowering marketing stance. I specifically direct one of their sister brands that promotes a positive body image and celebrates all shapes and sizes of women. I hire young women who also believe in and promote a genuineness among women. I'm a young(er) manager as well, but have worked in retail long enough to know the pro's and cons of bad managers, and I've vowed never to be one of the \"bad bosses\" I had while I was working my way up the ladder. I have also taken it on myself to help advance these younger women as best as I can. I find ways to work around their school and lifestyle schedules so they can both enjoy their college years (and beyond) while also get a paycheck that supports their needs. I coach them through situations, both professional and outside of work. I hire them at an advanced rate, find ways to get them a raise and try to promote them into positions they're naturally suited for. I encourage teamwork and cooperation among each other and praise their strengths and use their weaknesses only as teachable opportunities, not against them. As a result of empowering my employees, my business results speak for themselves. The part of the business I am directly responsible for is in the green, while the rest of the store is in the red. I have very low turnover, and hardly ever have \"drama\" that I must mediate. Our projects are completed on time and my girls are often called on by the rest of the store to help with their responsibilities. I love my girls, am proud of them as individuals and they've grown close despite their differences and different ages. \n\nWhile I am directly responsible of one section of my store, I share responsibility of the other sections with my other managers who are also women. They don't have the same outlook on our employees, an are often catty with each other (and myself). On a few occasions, I've caught them purposefully acting against my section of the store or neglecting their responsibilities if I am not present. There's always unnecessary turmoil, high turnover, and complaints from employees. Numbers speak volumes in retail and we're very much in the red, (which not uncommon for retail right now in this economic uncertainty and a consumer movement towards \"less is more\") yet because of the stores poor performance certain factors have started to take place which makes all of our jobs harder in various ways.\n\nIn the past year, my direct supervisor, the store manager, noticed the positive difference my efforts were making and since then, she's been on board and encouraging, but we both feel like we're fighting an uphill battle with the rest of our peers. I've tried being encouraging and helpful of my fellow managers, vulnerable and likable, but I never receive compliments or encouragement back. They take advantage of my help and thats the end of us working together. It's gotten to the point where I feel sick if I'm scheduled to lead the other portion of the store, and where I keep to myself unless I'm around my employees. I feel like a robot half of my workweek, and its gotten worse since the election (I was a  vocal supporter of Hillary, and have faced a few situations since then where I was threatened to keep my opinions to myself despite other women being vocal about their Trump support.) \n\nI am sure I am not alone in this, but I'm not willing to give up the fight nor am I able to transfer my locations or switch to another job (and I'll be damned if I let Trump supporters run me away from my success).\n\nTL;DR: How does a feminist to work alongside other women who are actively anti-feminist in order to accomplish a common goal? How can you help persuade said anti-feminists that it would be in their best interest to accept feminism and practice it?",
    "title": "Working with anti-feminists",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1499111955,
    "score": 0,
    "keyword": "american manager"
  },
  {
    "text": "Data behind ACLS guidelines for medicines From time to time (but certainly no less than weekly, with the last one being [this one](https://www.reddit.com/r/medicine/comments/6hi5ya/not_medical_advice_1mg_epinephrine_ivp_during/?ref=share&ref_source=link)) threads pop up where the ACLS guidelines come into play. Sometimes because someone didn't follow them, sometimes because someone claimed they were followed the wrong way.\n\nWe rarely discuss why we have the guidelines we have, and never if this constitutes the standard of care, if it is evidence based guidelines or if it is a list of what some people think you should do.\n\nThe latter is true, and it is actually based on animal studies during the 60ies, namely [Redding JS, Pearson JW. *Resuscitation from asphyxia.* JAMA. 1962 Oct 20;182:283-6.](https://www.ncbi.nlm.nih.gov/pubmed/13973494/) and [Redding JS, Pearson JW. *Resuscitation from ventricular fibrillation. Drug therapy.* JAMA. 1968 Jan 22;203(4):255-60.](https://www.ncbi.nlm.nih.gov/pubmed/5694097/) where the second one found\n\n> Resuscitation [of dogs] was more successful when epinephrine was used than when no drug therapy or sodium bicarbonate were used. \n\n**Vasopressors**\n\nThe ACLS algorithm since at least 2009 have included adrenaline/epinephrine 1mg every 3-5 minutes. This is based on a single randomized study ([Jacobs IG, Finn JC, Jelinek GA, Oxer HF, Thompson PL. *Effect of adrenaline on survival in out-of-hospital cardiac arrest: A randomised double-blind placebo-controlled trial.* Resuscitation. 2011 Sep;82(9):1138-43. ](https://www.ncbi.nlm.nih.gov/pubmed/?term=21745533) which is best summarized by their own conclusion\n\n> Patients receiving adrenaline during cardiac arrest had no statistically significant improvement in the primary outcome of survival to hospital discharge although there was a significantly improved likelihood of achieving ROSC.\n\nROSC isn't the end result of CPR, survivability is. The same conclusion is shown in other retrospective studies as well, e.g. [Hagihara A, Hasegawa M, Abe T, Nagata T, Wakata Y, Miyazaki S. *Prehospital epinephrine use and survival among patients with out-of-hospital cardiac arrest*. JAMA. 2012 Mar 21;307(11):1161-8](https://www.ncbi.nlm.nih.gov/pubmed/?term=22436956) which concludes that while more patient in the epinephrine/adrenaline group achieved ROSC they were equally likely (actually slightly less likely) to be discharged.\n\nAnother study found that among patients who are at a hospital when they fall into cardiac arrest early ephinehrine/adrenaline push (as within 2 min of the first defibrillation which is against the guidelines that says after defibrillation nr 2) is associated with a worse outcome, per [Andersen LW, Kurth T, Chase M, Berg KM, Cocchi MN, Callaway C, Donnino MW; American Heart Association’s Get With The Guidelines-Resuscitation Investigators. *Early administration of epinephrine (adrenaline) in patients with cardiac arrest with initial shockable rhythm in hospital: propensity score matched analysis.* BMJ. 2016 Apr 6;353:i1577.](https://www.ncbi.nlm.nih.gov/pubmed/?term=27053638)  \nIt is a short article, well worth a read (and it is open access), but here is an excerpt\n> In conclusion, we found that early administration of epinephrine after the first defibrillation (that is, contrary to guidelines) was common (>50%) in patients who experience cardiac arrest in hospital with a shockable rhythm. Moreover, the provision of epinephrine at this time point was associated with a decreased chance of good outcome, including decreased in hospital survival.\n\n**The AHA guidelines**\n\nThe ACLS guidelines are heavily based on the [AHA guidelines](https://www.ncbi.nlm.nih.gov/pubmed/20956224/).  They say\n> It is **reasonable to consider** administering a 1 mg dose of IV/IO epinephrine every 3 to 5 minutes during adult cardiac arrest.\n\nReasonable to consider is the wording used. Think about that for a minute. \n\nI would also like to add that high doses of epinephrine/adrenaline is associated with a worse outcome. If that is because the patient is in cardiac arrest for longer, or because the people doing it are less experienced and doesn't follow protocol is hard for me to say. \n\n**Amiodarone**\n\nThere are 2 studies (ALIVE and ARREST). Neither was powered to really detect what we are interested in (survivability). \n\nThe first of these two, [Dorian P, Cass D, Schwartz B, Cooper R, Gelaznikas R, Barr A. *Amiodarone as compared with lidocaine for shock-resistant ventricular fibrillation.* N Engl J Med. 2002 Mar 21;346(12):884-90.](https://www.ncbi.nlm.nih.gov/pubmed/?term=11907287) found that more patients who got amiodarone was admitted to the hospital, but failed to show (due to how it was constructed) that they were discharged more often. The second trial ([Kudenchuk PJ, Cobb LA, Copass MK, Cummins RO, Doherty AM, Fahrenbruch CE, Hallstrom AP, Murray WA, Olsufka M, Walsh T. *Amiodarone for resuscitation after out-of-hospital cardiac arrest due to ventricular fibrillation.* N Engl J Med. 1999 Sep 16;341(12):871-8.](https://www.ncbi.nlm.nih.gov/pubmed/?term=10486418) showed the same, but didn't focus on survival to hospital discharge.\n\nTherefor the evidence is lacking. And again from the AHA  \n> Amiodarone may be considered for VF or pulseless VT unresponsive to CPR, defibrillation, and a vasopressor therapy (Class IIb, LOE B). An initial dose of 300 mg IV/IO can be followed by 1 dose of 150 mg IV/IO.\n\n**Edit 1.** /u/transmogrification pointed me towards another study, more recent then the above, [Kudenchuk PJ et al. *Amiodarone, Lidocaine, or Placebo in Out-of-Hospital Cardiac Arrest*. N Engl J Med. 2016 May 5;374(18):1711-22.](https://www.ncbi.nlm.nih.gov/pubmed/?term=27043165). This study concludes that\n\n> neither amiodarone nor lidocaine resulted in a significantly higher rate of survival or favorable neurologic outcome than the rate with placebo among patients with out-of-hospital cardiac arrest due to initial shock-refractory ventricular fibrillation or pulseless ventricular tachycardia.\n\nbut also\n\n> Finally, the point estimates of the survival rates in the placebo group and the amiodarone group differed less than anticipated when the trial was designed, which suggests that the trial may have been underpowered.\n\nSo there still may be a difference, but you would need 9000 study participants to find it with a 90% certainty. If it did have an effect of ca 3% that would be 1800 lives per year it could save, but the data as is doesn't support an effect larger than 3%.\n\n**Fibrinolysis**\n\nA lot of cardiac arrests are due to PE or AMI, and it would there go to reason that treating the clots would have an effect on survival. The problem is that when you give tPA you don't actually know why the patient went into cardiac arrest, and there hasn't been shown any benefit (a bit better effect on survival to ICU admission has been found), see [Böttiger BW, Arntz HR, Chamberlain DA, Bluhmki E, Belmans A, Danays T, Carli PA, Adgey JA, Bode C, Wenzel V; TROICA Trial Investigators; European Resuscitation Council Study Group. *Thrombolysis during resuscitation for out-of-hospital cardiac arrest.* N Engl J Med. 2008 Dec 18;359(25):2651-62](https://www.ncbi.nlm.nih.gov/pubmed/?term=19092151) and [Böttiger BW, Bode C, Kern S, Gries A, Gust R, Glätzer R, Bauer H, Motsch J, Martin E. *Efficacy and safety of thrombolytic therapy after initially unsuccessful cardiopulmonary resuscitation: a prospective clinical trial.* Lancet. 2001 May 19;357(9268):1583-5.](https://www.ncbi.nlm.nih.gov/pubmed/?term=11377646).\n\nIf we could select the right patients that may change, and with an increased amount of ultrasound used by ICU docs and even used during CPR we may be at a point where it is worth redoing such a study at a hospital (my own point of view).\n\n**Edit 2** As pointed out by the PEAPETT study [Sharifi M, Berger J, Beeston P, Bay C, Vajo Z, Javadpoor S; “PEAPETT” investigators. *Pulseless electrical activity in pulmonary embolism treated with thrombolysis (from the \"PEAPETT\" study).* Am J Emerg Med. 2016 Oct;34(10):1963-1967](https://www.ncbi.nlm.nih.gov/pubmed/27422214) and /u/macreadyrj there have been newer studies then the ones cited above. However PEAPETT included 23 patients where 16 had a previous diagnosis of PE by CT pulmonary angiography, which isn't the case for a random cardiac arrest and 3 were diagnosed with PE by ultrasound criteria. I would thus interpret the study more as a safety study than anything else, since it also didn't show any significant bleedings. \n\n**Sodium bicarb**\n\nThe AHA states\n> There are few data to support therapy with buffers during cardiac arrest. There is no evidence that bicarbonate improves the likelihood of defibrillation or survival rates in animals with VF cardiac arrest. A wide variety of adverse effects have been linked to administration of bicarbonate during cardiac arrest. Bicarbonate may compromise CPP by reducing systemic vascular resistance.\n\nAnd the study this is based at least partly on [Vukmir RB, Katz L; Sodium Bicarbonate Study Group. *Sodium bicarbonate improves outcome in prolonged prehospital cardiac arrest*. Am J Emerg Med. 2006 Mar;24(2):156-61.](https://www.ncbi.nlm.nih.gov/pubmed/?term=16490643) which despite the name states\n> **The empirical early administration of sodium bicarbonate (1 mEq/kg) has no effect on the overall outcome in prehospital cardiac arrest.** However, a trend toward improvement in prolonged (>15 minutes) arrest outcome was noted.\n\nIt should be said that there are specific circumstances were bicarb has it's use, but routinely using it simply hasn't been shown effective as stated by the AHA\n> In some special resuscitation situations, such as preexisting metabolic acidosis, hyperkalemia, or tricyclic antidepressant overdose, bicarbonate can be beneficial\n\n**Edit 3. Endotracheal Intubation** \n\nPer the AHA\n> However, intubation attempts by unskilled providers can produce complications, such as trauma to the oropharynx, interruption of compressions and ventilations for unacceptably long periods, and hypoxemia from prolonged intubation attempts or failure to recognize tube misplacement or displacement. It is now clear that the incidence of complications is unacceptably high when intubation is performed by inexperienced providers or monitoring of tube placement is inadequate.\n\nThere aren't any high quality studies and only a few retrospective studies, one of them saying that early intubation has a trend toward better survival at 24hrs; [Wong ML, Carey S, Mader TJ, Wang HE; American Heart Association National Registry of Cardiopulmonary Resuscitation Investigators. *Time to invasive airway placement and resuscitation outcomes after inhospital cardiopulmonary arrest*. Resuscitation. 2010 Feb;81(2):182-6.](https://www.ncbi.nlm.nih.gov/pubmed/20022157) and one study of poorly trained EMS on intubation of children failed to find an effect (and remember we think that ventilation is more important in children than in adults) [Gausche M, Lewis RJ. *Out-of-hospital endotracheal intubation of children*. JAMA. 2000 Jun 7;283(21):2790-2](https://www.ncbi.nlm.nih.gov/pubmed/10838643).\n\nA more recent study in Japan [Hasegawa K, Hiraide A, Chang Y, Brown DF. *Association of prehospital advanced airway management with neurologic outcome and survival in patients with out-of-hospital cardiac arrest*. JAMA. 2013 Jan 16;309(3):257-66](https://www.ncbi.nlm.nih.gov/pubmed/23321764) found that\n> Among adult patients with OHCA [out of hospital cardiac arrest], any type of advanced airway management was independently associated with decreased odds of neurologically favorable survival compared with conventional bag-valve-mask ventilation.\n\nYou also have another study, [Kajino K, Iwami T, Kitamura T, Daya M, Ong ME, Nishiuchi T, Hayashi Y, Sakai T, Shimazu T, Hiraide A, Kishi M, Yamayoshi S. *Comparison of supraglottic airway versus endotracheal intubation for the pre-hospital treatment of out-of-hospital cardiac arrest*. Crit Care. 2011;15(5):R236.](https://www.ncbi.nlm.nih.gov/pubmed/21985431) which found two things. A supraglottic airway is equally effective to endotracheal intubation, but having a person certified to do endotracheal intubation was associated with a better outcome regardless of wether they did or didn't. Early placement of an advanced airway was associated with a better outcome.\n\n**Edit 4**\nThanks to dr /u/CytokineShitStorm for pointing me to this study, [Andersen LW, Granfeldt A, Callaway CW, Bradley SM, Soar J, Nolan JP, Kurth T, Donnino MW; American Heart Association’s Get With The Guidelines–Resuscitation Investigators. *Association Between Tracheal Intubation During Adult In-Hospital Cardiac Arrest and Survival*. JAMA. 2017 Feb 7;317(5):494-506.](https://www.ncbi.nlm.nih.gov/pubmed/28118660) which is a 2017 observational study on cardiac arrest in the hospital setting which found\n>Although differences existed in prespecified subgroup analyses, intubation was not associated with improved outcomes in any subgroup. [...] Among adult patients with in-hospital cardiac arrest, initiation of tracheal intubation within any given minute during the first 15 minutes of resuscitation, compared with no intubation during that minute, was associated with decreased survival to hospital discharge.\n\nand thus it doesn't support intubating patients even at a hospital setting. As the guidelines stand intubation may still be the way to go, and by intubating the patient you may free up valuable resources. I always have an ICU/OR/anesthesia nurse present who can maintain any advanced airway or ventilate the patient if necessary so for me it wouldn't tie up any more hands to not intubate the patient. \n\n**Summary**\nHigh quality CPR and defibrillate as soon as possible. The rest is mostly guesses.",
    "title": "Data behind ACLS guidelines for medicines",
    "subreddit": "medicine",
    "timestamp": 1497702505,
    "score": 306,
    "keyword": "american manager"
  },
  {
    "text": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this. Background: I work in a city hospital that serves a very impoverished minority population . Our Institution isn't exactly stellar  , so except for Radiology and Surgery most of our residents and staff are FMGs or IMGs.  Me (FMG) and my posse ( Mostly FMGs)were doing our rounds. Being a Sunday , out team was providing cross-coverage and we had a lot of patients to round on. \n\nWe make to the ED to examine a patient who had come in with shortness of breath and  diagnosed with a PE. The patient was a black transgender patient. She had been in the ED for a couple of hours \n\nThe moment I stepped in the room my spidey-sense started tingling. Started off rough enough \" who are you ? why Are you here ? Why are  you rounding so late?.I'm short of breath\" ( while screaming at the top of her lungs).  Ma'am . I had 30 patients. i needed to prioritize , but you have my attention now . \n\nShe explained that she was basically ignored by the nurse ( which was true - was not hooked up to telemetry or SO2 monitoring ).\nI apologized to her and told her I would talk to the nurse and that she should take it up the charge nurse. So far nothing usual. \nThen she went off on a tirade  .\" My mother worked in this hospital ,I also worked in healthcare . Used to come here sometimes until I started getting my care in  *Brand name * Hospital . This hospital was  much better run when we had Real American Doctors, not all these foreign doctors.\" She repeats this stament verbatim again during the course of the encounter. \n\nNow my interns and resident are visibly disturbed. But she goes on . About how her usual hospital is much better.  I then remind her BTW, I'm also foreign ( my phenotypic  ethnicity is ambiguous- on a good day I can pass off for Hispanic/Italian . I was called \" white trash \" once ).\n\nIn order to diffuse the situation , I agree with all her comments. I  put in a few negative comments about my own hospital( I find this works very  well to calm down a an angry patient/family )  This eventually calms her down , and I manage to get a coherent history and physical exam.\n \nBy the end of the encounter I tell her \" Ma'am, I'm sorry you couldn't get a real american doctor today \". She then suddenly becomes apologetic.  \"Oh, I didn't  mean all foreign doctors are bad . Just like the cops you have good ones and bad ones  . You all have been very professional . \"\n\nI shake her hand and the encounter ends.\n\nI don't know how to feel about all this. My training tells me that the outburst was probably a reaction to the stress of being in a hospital and mistreatment by the ED nurse. She did apologize in the end ( cant vouch for the sincerity of it  though ) . She herself belongs to a very marginalized group ( Black M-to-F transgender ) but had no qualms or second thoughts about espousing xenophobic comments.  \n\n Throughout  my training I've been on the receiving end of irate patients .But this encounter left an especially bad taste in my mouth. I guess the fear of \"the others \" is a very primal urge. And all these civilities are just veneers on a underlying tribal  mindset. \n\nAt least I can watch the WWE Summer Slam tonight and get my mind off this .\n\nAnyone else here had similar experiences ? How would you debrief your residents/interns ?",
    "title": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this.",
    "subreddit": "medicine",
    "timestamp": 1503260107,
    "score": 35,
    "keyword": "american manager"
  },
  {
    "text": "Would this work? Billionaire Mark Cuban proposes national insurance for chronic or catastrophic issues, regular insurance for everything else I realize most doctors aren't policy makers or insurance people, but this seems like an [interesting proposal](http://blogmaverick.com/2017/03/08/some-thoughts-on-fixing-obamacare-shoot-holes-in-this-please/).\n\nIn a nutshell:\n\n> Whether its Medicaid or a new program, every single person in this country should be covered 100pct for chronic physical or mental illness and for any life threatening injury.  \n\n> Everything not covered by the above can be covered by insurance sold on the Free Market, managed by the states, sold across state lines, without government interference.\n\nIs it really possible to separate out risk pools like that? It seems like [most healthcare dollars go into chronic and catastrophic issues anyway](http://www.bankrate.com/finance/insurance/cost-of-chronic-disease-1.aspx):\n\n> Chronic health problems such as cardiovascular disease, diabetes, obesity, cancer and kidney disease account for more than 75 percent of the nation's $2.7 trillion in annual spending [in 2011, more like $3.2T now] for medical care, says Ursula Bauer of the Centers for Disease Control and Prevention.\n\nAccording to eSurance, health insurance for a family of four averages abut $10,000/year for an $8,000 deductible plan. There are about 125 million households in the US, with an average household size of about 2.5 persons, so that's not much more than $1 trillion. Medicare and Medicaid combined account for another $1 trillion or so. I'm not sure where the other $1 trillion comes from.\n\nHealthcare spending averaged over all Medicare recipients is about $15,000 per year, 50% higher than the average over all Americans, because Medicare recipients are mostly older of course. The average for Medicaid enrollees is about $8,000 per year, somewhat less than the national average. There are 44 million Medicare and 70 million Medicaid enrollees, so 114 million Americans, or 35% of all Americans are already covered by these two agencies.\n\nTaking all that into account, it seems like Cuban's plan could be an improvement over the current \"system\", and could be financially attractive to most people.",
    "title": "Would this work? Billionaire Mark Cuban proposes national insurance for chronic or catastrophic issues, regular insurance for everything else",
    "subreddit": "medicine",
    "timestamp": 1489183013,
    "score": 28,
    "keyword": "american manager"
  },
  {
    "text": "Burnt out and emotionally fatigued. How do you manage both? New position for the last 3 months. Stupidly high acuity tele floor which is somehow not considered a step down despite the patient population we get. We see everything on this floor. Alcohol/drug withdrawals, respiratory failure, sepsis, stroke, heart failure, post cardiac cath, etc. Needless to say, I'm burnt out after 3 months. Most of my shifts are an upwards battle just to be able to eat something. Maybe it has to do with poor time management, but at this point I don't really think it does so much as it has to do with the acuity of the patients. Multiple orders, if you have empty beds in your district you're guaranteed to either be full or near full by the end of the evening. I once had 2 admissions come up at the same time as I was dealing with a possibly critical new admit. Patients complaining I need to slow down when I'm trying to get done just so I can eat and not pass out on them. I have it set in my mind that at 6 months and leaving and taking time off. I don't know what I'll do but I just need to recover. I think I'll come back in outpatient but I don't even know for sure I'll do that. EAP isn't an option because I work nights and I'm not waking up in the middle of my day off to go to therapy and have them try to convince me it's my fault and I have to try different techniques when in reality it's truly the American healthcare system and the lack of reasonable nurse:patient ratios. I was slightly burnt out at my previous job and figured a change of scenery would help. Just made it worse honestly.\n\nAnyone ever left due to burnout? What did you do?",
    "title": "Burnt out and emotionally fatigued. How do you manage both?",
    "subreddit": "nursing",
    "timestamp": 1511649147,
    "score": 37,
    "keyword": "american manager"
  },
  {
    "text": "Advice for new teachers Good morning!\n\nI've only lurked on this sub for a few months, but I've noticed a huge influx of first time teachers (which I assume is common around this time of year) so, first of all, congratulations! Teaching is incredible. It's fun, it (can be) rewarding, but there are some scary parts to it. So much so that [8% of teachers quit per year](http://www.npr.org/sections/ed/2016/10/24/495186021/what-are-the-main-reasons-teachers-call-it-quits), which is alarmingly high, but even worse is that [4 in 10 new teachers quit within the first year](https://www.theguardian.com/education/2015/mar/31/four-in-10-new-teachers-quit-within-a-year). Yikes.\n\nNow there's many reasons for that, but a lot of it (my opinion) comes from ignorance to the profession. So to help combat that, I'm going to laundry list a bunch of random tips/suggestions/things in no particular order that helped me my first year or so, and if anyone else feels so inclined to add to this, please do so.\n\nDISCLAIMER: my suggestions apply to mainly high and possibly middle. Some of my suggestions might be the polar opposite for elementary; I can't speak on grades 1-5. \n\n* Teaching is a balance of combining your personality, strengths, and style with what has already been proven to work. Don't try and reinvent the wheel; you're not the first person to ever step in a classroom, but at the same time don't just run to your Classroom Management textbook from your Sophmore year of college every time little Timmy rolls his eyes. \n* Your school should have a mentoring program of sorts, if not, find someone in your department that you can basically follow around like a hawk. Find someone that's approachable and good with the kids - you'll be able to tell from the first time you talk to them. Trust me. Try to not find someone that is jaded, which depending on the school/district, that'll be very hard to do. Mimic that person to a tee. You'll find that some of the stuff he/she does is great for you while others you can do without. No two classes are the same. You could be teaching American History and the teacher across the hall which is doing the exact same unit as you with the exact same assessments, but it'll be ran differently. Find what works for you. \n* Don't do the same things two years in a row. I don't mean curriculum (though you'll definitely be tweaking that for the first few years), but rather the way you approach it. Find what work and what doesn't. You may find that you don't like some of the things that the teacher with 30 years experience does. That's okay.  \n* Be willing to drop whatever isn't working. It sucks when you spend all weekend working on a lesson plan only to realize that it didn't at all come out the way you intended. Always have a fallback.\n* Learn to read the students' body language. I don't care if you have the most well-behaved, disciplined, AP students. If you see a sea of glossed over eyes, you've lost them. Stop and move on to something else (especially applicable to those of you who are teaching in 90 minute periods).\n* Whatever grade you teach, talk to them two grades higher. I teach freshmen and juniors English honors and I have the same spiel every year. For my juniors it's that they're two years away from sitting in a college classroom, so they need to act like adults. For my freshman I semi-unintentionally scare them with my \"this is an honors level class, and I expect honors level behavior and effort. If you cannot do that, then go to guidance now and switch to a regular level class.\" That causes them to perk up. My logic is that high schoolers are either of age to drive or about to be, and if the US says that they are old enough to drive a giant piece of metal on a highway going 70 mph, then they are mature enough to do what is asked of them.\n* Don't take their opinions of you personally. They're going to be varied. I had a kid tell me that I'm his favorite teacher he's ever had while the student right next to him absolutely hated me. It'll happen. No sweat. In this regard, treat teaching like a normal job. If you focus on trying to get them all to like you, then you're going to have a bad time.\n* Treat them like adults until they act like a child.\n* DO NOT UNDER ANY CIRCUMSTANCE CREATE A RULE THAT YOU DON'T INTEND ON ENFORCING! I made this mistake my first year. Kids will test you. If you stupidly put a dumb rule in your syllabus, you're stuck with it for the whole year. \n* Speaking of syllabus, if your school allows you to tweak it, I like to ask for parent's e-mail, cell-phone, and also which method of contact that they prefer (I've had it bite me before in parent meetings when they said I called but should have e-mailed or vice versa).\n* Hope you like tape. This job has more red tape and bureaucracy than I ever would have imagined - which brings me to my next point...\n* CYA. Document every single little thing that you can imagine, especially behavior issues. You don't want to be sitting in a parent conference with the principal in March and not have anything to back up what you've been saying (as a side note, this is another reason why I prefer e-mail over phonecalls with parents). Literally document everything. \"On 10/3 at 11:38 AM, Timmy took out his cell phone. Received verbal warning. 10/4 11:00 AM Timmy took out phone. Issued detention. Called home on 10/4 at 3:00 P. No answer. Left voicemail detailing incident. Sent email on 10/4 at 3:15 P. E-mail attached.\" Is it a pain? Yes. But it is so necessary, and nothing shuts up the \"my child is an angel and would never do that\" parent quicker than that.\n* Be available to kids. You'll get a few that latch on to you. I had a few that came to me for tutoring during lunch and it turned into a mini counseling sessions with things they were struggling with school wise and friends.\n* But be careful. Remember that you are required by law to report any signs of abuse or any indication of self-harm.\n* Be respectful of other teachers. For some reason students think that it's okay to berate other teachers to the \"cool\" teachers. Don't allow them to do that. Cut it off immediately. You may share their opinion, but remember the classroom isn't a place for gossip. You are their instructor. They'll respect that.\n* Enjoy what you teach. I mean, this should be a very \"duh\" point, but you will be amazed at how many experienced teachers hate their subject. Yes, there's going to be parts of it you don't like, and that's okay, but whatever you don't like, multiply that by 50. That's how your kids feel.\n* But the flip side of that is things you are enthusiastic about goes over so much better than things you're indifferent. I'm one of the few out there that still loves teaching \"The Scarlet Letter\" and the vast majority of my kids like it too because of how we approach the text.\n* Remember where you are. You may love what you're teaching, but the kid in front of you might hate every single thing about your subject. Think back to your least liked subject in school and how you felt about it. Now realize that in every period there's a few of those kids sitting there.\n* 504's are not an excuse to be lazy (NOTE: I have no idea what 504/IEP's are called in other states. They might be the same thing. I can only speak for Florida). Some students will have accommodations whether they're ELL or something else. You have zero authority to override an IEP/504 (note that you will have a meeting with guidance and you will be able to give your input about accommodations per student, but in the classroom, you have to go by whatever they need). The brutal reality is that some students manipulate the system. In Florida it's incredibly easy to get accommodations. The most common one is extended time. That's not just on quizzes/tests. That's for homework/papers/projects/anything. You could inevitably have a student who waits until the bitter end to turn in everything. A 504 IS NOT AN EXCUSE TO BE LAZY! But it's tricky. Sometimes you cannot enforce a strict deadline. This is where communication with the parent and guidance is paramount as well as documentation.\n* Be very aware of what else is going on in school and be sympathetic to it. For example, I know a lot of my students are in AP classes, so I try to make the workload light come around April-May. I also know that a lot of them take SATs around that time, so I come up with SAT prep exercises that also align with the standards I'm teaching (something that is very easy to do with English in particular). Homecoming is next week and the kids are excited? Don't assign a weekend project. Things like that. \n* Male teachers: Be very aware that you are a male. Don't find yourself alone in a classroom with any student male or female. I'll have one or two come talk to me privately for whatever reason and I do the same thing. I float by door in eyesight of anyone that could be in the hallway. Don't ever allow the door to be closed. Even if they're coming to you for something personal, explain to them that you have to keep the door open.  \n\nOkay, this turned out to be significantly longer than I had imagined. I'll update if I think of more. But if you hung in this long, that already shows you care. It's fun. It's hard. Probably harder than anything you've done before, but man, seeing the lightbulb click in the faces is awesome. It's worth it if you can stick with it.",
    "title": "Advice for new teachers",
    "subreddit": "Teachers",
    "timestamp": 1501239423,
    "score": 241,
    "keyword": "american manager"
  },
  {
    "text": "[Southern USA] [Kindergarten] - Please help with class management! Throwaway account, because I'm paranoid of someone in my school finding me. Also posted in /r/ECEProfessionals \n\nI am a second-year teacher at a rural, 90% African American school in the southern United States. I'm having issues with classroom management. Last year, my assistant was very strong- she basically ran my whole classroom. Whenever the kids were being too loud, she'd sternly redirect them to pay attention. Sometimes she even yelled, but it worked. I am not a confrontational person and her methods worked, so I ran with it. She was African American, and told me that her ways were effective because the kids saw her as a mom/grandma figure and respected her. I believe this to be true. However, she has retired and I have a new assistant- an older white lady who is not as strong of a personality.\n\nIn this community, the norm is for children to be scolded/punished for doing wrong things. The ways that some of the other teachers talk to their students align to this method of child-rearing, because culturally they are similar to their students (again, the kids see the teacher as a mom/grandma). I should mention here that I am white. I have been told by the other kinder teacher (and several other friends within the school) that if I spoke to the kids the way the other teachers might, I would be in trouble because \"Black people don't want to see their kids yelled at by a white teacher\". That is a direct quote, please don't call me a racist or tell me that race doesn't matter.\n\nThe issue is that I cannot get the kids to stay quiet or pay attention, even if I raise my voice (which I hate to do). I also feel like they are goofing off when we are supposed to be working. My kids are turning in absolute crap- I know they are capable of better work. When I try to get them to be quiet, they still talk or play at their tables and do half-assed work. I would love to be able to allow them to whisper at their tables about what we are doing (and generally work together in teams), but it seems like the majority of them are always off-task. I try to plan active activities/group work/movement into our day. I also allow them to talk during breakfast and snack.\n\nWe have a school-wide management system using a 'green, yellow, red' behavior chart. If a kid misbehaves, I'll warn them. If they repeat, I'll change their color. I've thought about starting some kind of token-based economy, but at this point I'm not sure they'd be quiet or attentive long enough for me to tell them about it.\nI've tried all the positive behavior things we learn in college, like highlighting kids that are doing what is expected, etc. We made our class rules together. All the positive/reinforcing/'let's talk about your choices' stuff doesn't work. Changing their colors doesn't work. Having them practice walking in the hallway quietly (because we can't seem to do that correctly, either) doesn't work. None of it seems to work. I'm frustrated and upset and not sure what else to do. Any advice would be greatly appreciated.",
    "title": "[Southern USA] [Kindergarten] - Please help with class management!",
    "subreddit": "Teachers",
    "timestamp": 1504303176,
    "score": 11,
    "keyword": "american manager"
  },
  {
    "text": "Anyone have Experience with Springboard (ELA)? Hello!\nI searched previous posts on here about College Board's Springboard program, but I'd like some more insight. My district is adopting Springboard in every ELA classroom across the county, K-12. I will be teaching American Lit for the third year in a row and feel as if I finally created a solid curriculum, but now this is being dumped on me. \n\nI went to the Springboard training about a month ago and heard my district's ELA curriculum specialists say over and over again that \"Springboard is not a program.\" ...but yeah, it's a program. \n\nDo any of you teach in a district that currently uses or has used Springboard, specifically for ELA courses? I'm curious to know what your district's requirements/expectations were in regards to its implementation. To what extent do you use the \"scripted\" lesson sequence in the book?\n\nAlso: How effective do you think the unit summative assessments are? Is the workload manageable for students? I teach in one of the top performing districts in my state, but I am also at a Title 1 school. While my students have a pretty solid background knowledge, they're still a little behind their peers on the other side of the county. \n\nAny insight anyone could provide is very much appreciated! I'm trying to go at this with a positive attitude, but I didn't become a teacher to follow a script. Thanks in advance!",
    "title": "Anyone have Experience with Springboard (ELA)?",
    "subreddit": "Teachers",
    "timestamp": 1499802791,
    "score": 4,
    "keyword": "american manager"
  },
  {
    "text": "I am not able to give all of my students the attention they need and deserve. Right now I work at a private charter school that deals with children with behavioral problems and emotional problems. I didn't really know what I was getting into when I applied there, just that I wanted a job my first year teaching history and that I wouldn't be getting many subbing calls in the place where I lived (Though i did have a person call the other day looking for me to sub. So it would have been a long wait). \n\nSo I took a job teaching at this school. And right now I'm in a bind because I love the people that work there and are really think full to them for their guidance but the way the school is set up their is just no way for me to give the kids what they need.\n\nRight now this is what my schedual looks like.\n\nBlock one: 72 minuites of class with two Civics students, three world history students, two 8th grade state history students, and one 7th grade world history student. And in a week we may be getting a 6th grader in the class as well.\n\nSecond block I go and teach at a different part of the school where I may get one student in class if I'm lucky and have one who everyday refuses to come point blank. And in it I have 1 American history, two world history, and two 7th grade history.\n\nThen for their block I don't get planning. Because its a charter school and because we don't have enough people to provide services (every kid has an iep) the teachers have to sub in on their planning period. So I get to help out in another class that I have no experience in.\n\nThen in fourth block its a littler easier for the moment. I have five civics students and one American history student. This is down from last week when I had that plus one world history student. \n\nAnd I just dont' have the time and ability to give everyone what they need. I wish I did, the kids deserve it and need it but usually I end up having to have some kids or groups like the NC class self teach because between managing lessons, dealing with behavior (like today when three kids decided they weren't going to do guided notes or work and just sat there. And their was nothing I could do because we don't have enough staff to send them out or do ISS so all I could do was try to convince them to work before having to move on just to cover things) and teaching I run out of time.\n\nAnd because of the fact that we use  versions of text books, limit access to the net, and that I have to prep for five different classes I can't really come up with anything to new and exciting to really make class more enjoyable or add to  my repertoire \n\nAnd this is not a school where the students will self teach at all. Classroom management is also a mess at times it seems like. Their are therapists who are in there to supposedly help with the management and help the kids do work but they are either gone most of the time or just sit there quietly. \n\n And their are other small things like not getting out due to in climate weather like the public schools do, even for snow days. \n\nBut my principal and the other teachers are supportive and that is partly what makes my decision hard. I really like them and they have given me a lot of help and I know if I leave then they will have a hard time finding a replacement ( I get the feeling their weren't very many others applying for the position when i got it). But also their is the idea of job security. The between DeVos and the new Pres who knows whats going to happen. And with the school thinking of going to semester scheduled and starting in june of this year I would have to either say no to the contract and look for a job or accept it and then break contract a month into it which seems wrong to me and I would imagine carry repercussions when it comes to future employment.  \n\nSo I really don't know and I don't know if anyone will even read this far. It's just something I really need to get out. I mean maybe I am stressing myself out to much. Maybe if I cared less it would  be better. I mean not having to be there untill 8 every day, getting a free lunch, and living close to where i work in a cheap neighborhood are good things. But I just don't know if I can do it a second year. The school is thinking about not offering as many classes next year so that may help things but I'm not sure if it will happen.",
    "title": "I am not able to give all of my students the attention they need and deserve.",
    "subreddit": "Teachers",
    "timestamp": 1488412570,
    "score": 4,
    "keyword": "american manager"
  },
  {
    "text": "I'm almost 35 and I'm a \"job drifter\" and I'm still lost. I want to figure out what it is I should be doing with my life. Maybe this can help? Hi everyone. Fair warning, I'm not too good at \"short stories\" but I'll do my best to keep everything concise.\n\nI'm about to be 35 in a few weeks and I've been working random jobs since I was 16. I can't remember all of them but if you count having a job as collecting a paycheck (even one) from any place of employment then I have had close to or over 30 different jobs in that time span. I've worked on a farm, in grape vineyards, a bowling alley, Ponderosa, Walmart, Old Navy, Target, Home Depot, Dollar Tree, customer service call center, debt collections, a juice factory, a grocery store, a mini golf course, a gas station, a newspaper, sorted cans and bottles at a recycling center, sold expensive cutlery, worked in a group home assisting developmentally disabled individuals, worked in a pre-vocational center assisting developmentally disabled individuals, delivered in-home medical equipment for Hospice, worked in a short-term rehab for young adults struggling with substance addiction... I may be forgetting some but that's the gist. Since 2008 I've worked in human services and it's a decent fallback because the money is alright for a high school grad but it can be very stressful work and it is not something I want to do for a long time.\n\nI tried college at different times in my life. Both community colleges and both tries lasted about two semesters. I was enrolled in an art institute when I was 19 but I'm from a very small town and was thrust into a big city when I was completely not ready and came home before even attending a class.\n\nGrowing up I dreamed of being a pro football player (American) but the NFL doesn't have many places for pudgy asthmatics last I checked. Throughout high school I enjoyed art classes and acted in every high school play from grades 7-12. I was also a pretty good bowler. Yes, bowling. Hey, don't laugh, my tiny high school team (graduating class of 51) won three straight division titles against schools with graduating classes numbering in the 1000s. \n\nTowards the end of high school I began to tinker with simple graphic and website design. Have a cousin who was always very involved in that and I'd spend free periods messing with early versions of Photoshop, Microsoft FrontPage (bet no one remembers that) and teaching myself some HTML. I wanted to go to school for website design stuff but that type of career was still fairly new as the web hadn't quite yet taken off. Websites were still mainly text-based and not at all what they are today. Therefore there weren't any schools near me offering those types of courses. It was all computer science or programming and I wasn't interested in that. One community college course I took was an \"Intro to the Web\" class in which the final project was to create a three page website. I skipped the entire class and handed in my final project (a five page site with way more than required) because I had been designing and updating my high school's website since I was a junior.\n\nI do struggle with some mental stuff. Who doesn't these days? I grew up with OCD, anxiety/panic disorder and depression. I manage, as we all do. But work has always given me a great deal of trouble and I tend to think it's one of the reasons I have such a hard time holding down a job for any period of time longer than 3 years (that's my record, three whole years in one place) and I feel it interferes with my motivation and ambition... sometimes it feels like I have neither.\n\nI know we all have to work. I just want to be able to come home and tell my wife, \"Hey look at what I did today\" and not \"If I have to go back to that place one more day I'm gonna drive my car into a tree.\" It's always been very frustrating. I've had mental breakdowns in which I've missed substantial time from work because I couldn't deal with the stress and what I was feeling.\n\nMy most difficult hurdle is figuring out just what I should be doing. I feel like I'm a creative person. My mother is an artist and my father is a carpenter (although he's worked in a factory for 37 years to provide while doing carpentry stuff on the side) and they've been doing their own craft business for about 17 years now. They go to festivals and shows all over the area and recently my wife and I have been discussing getting their things on Etsy. I've also felt like perhaps I could start making some things to sell along with them and see where it goes. The trouble is, is it's an unknown entity and it's hard to just jump into something like that when you need a steady job to provide while you try to figure out how to make it work. And whenever I take on another random job I just shut down. Whatever the schedule is, on whatever days I have to work, I'm useless. I'm miserable, I don't speak to anyone, I go off on terrible rants about how bad I hate it and I basically have to talk myself out of an anxiety attack every time I get in the car to go to work. I don't wanna have to go through this anymore.\n\nA few years ago I took some SEO/blogging courses because I've always been decent at writing but I burned out on that too. A few years before that I came real close to going to a design school but a job came up that I had no choice but to take and the school didn't offer night classes so it was just back to work.\n\nI'm caught somewhere between wanting a type of career where I can be creative and something that I can run from home. Lately I've been thinking about the design school again because I've always enjoyed typography and making logos and I thought maybe I could be someone who makes invitations and cards or even posters or whatever and sell that on Etsy. The tough part is making the decision to go into debt to pay for college. Luckily my wife and I have made a pretty good life for ourselves despite my shortcomings, we always make rent, we don't starve, we drive decent cars and live in a good area and neither of us have massive amounts of college debt hanging over us.\n\nI'm just not sure what to do anymore. I'm tired of going around and around with this stuff all the time. I know not every job is cupcakes and rainbows and I get that, I just want something that doesn't fill me with complete dread every single day. I feel good about creating. I feel maybe a tiny bit of entrepreneurial sense within me... I just flip flop on a direction and my work ethic is crap. And I dunno why. Everyone I'm surrounded by has a good work ethic. I just feel so defeated and deflated by every job I've ever had to do. (If you're wondering how I keep getting so many jobs, I'm a really good interview. I've done it enough times to know exactly what they wanna hear.)  I've never felt good about any of the work I've done. It's always just been a paycheck. I don't wanna have to feel like that anymore. Is there a direction I can be pointed to? My mind changes on me more than the weather so one day it may be \"Design!\" and the next it'll be, \"Are you serious you frickin' loser? You can't do that, you suck.\" I've always been this dreamer who's always felt anything and everything is so unattainable. How do I fix that? \n\nI apologize for the novel and I thank anyone that read through it and anyone that may offer some advice. Thanks.",
    "title": "I'm almost 35 and I'm a \"job drifter\" and I'm still lost. I want to figure out what it is I should be doing with my life. Maybe this can help?",
    "subreddit": "careerguidance",
    "timestamp": 1487716561,
    "score": 37,
    "keyword": "american manager"
  },
  {
    "text": "Not sure how to feel about coworkers talking in another language to the extent that it feels exclusionary. Can someone please help me understand if I am in the wrong? Hello,\nI work in a Japanese-American Company. I work with 5 other people in the same office. All of us are in the same department in an open-office environment. The assistant manager and two of the other purchasing agents speak Japanese (one from the US and one from Japan). Conversations in Japanese are very common. Until recently, the last few weeks, it has never bothered me. I have worked here for almost a year now. One of the agents and the assistant manager have been having conversations in Japanese throughout the entire day lately, and I have been finding it more and more exclusionary. I understand wanting to talk in your native language because I can speak French, but I prefer English given the choice. However, both of them have lived in the US for 20 years and are nearly as fluent in English as I am. The worst part of this is I can’t pinpoint why this has been bothering me. They have had conversations in Japanese the entire time I have worked here. A lot of their conversations in Japanese are about issues our department/company is facing, and because they don’t have these conversations in English anymore, I know far less about what is going on than I used to. I know that their conversations dip into their personal lives, and I am actually okay with this part. However, I have noticed a growing rift between the US workers who only speak English (excluding me) and the 2 Japanese employees. They have gotten to where they barely ever talk to each other, and they don’t really respect each other. The Manager of our department being one of those English speakers has made this situation even more annoying. Also, I think it has been bothering me because my own workload has been steadily increasing as theirs seems to be decreasing, according to how much they talk and not work (note:  they also pass a lot of their work to me). I mean these conversations have lasted all day (while they were in the office), and they don’t really do anything else while they talked.\nAlso, I want to show that I am not just bothered by the use of foreign languages. I have friends from several different nations, and when we get together, we talk in several different languages together.  Most of these friends speak languages I do not know, and it is fine.  For example, we’ll be having a conversation and someone will say something in Arabic, then someone will kind of explain to the non-Arabic speakers what was said if anyone seems curious. Another example, a group of Spanish and English spearkers, and French and English speakers talking in all three languages together. The Spanish and the French can be loosely understood by both groups due to similarities, so English is used when people are unsure of the exact translation or when someone wants to be sure everyone understands what they say. Two of my friends may say something to each other in their mutual language and not explain it to the group because it was an obvious aside and not really important to the whole group. Or even a work example, our department is all talking together, and there will be both Japanese and English in the conversation but everything is being explained to everyone involved. These are the sorts of situations I am used to, and I have no problems with them because everything is out in the open if need be. There may be languages being used that don’t get explained, but it isn’t something that is important. \nSo, their conversations have been distracting for a multitude of reasons, and I am not certain how I feel or how I should feel. I want to work for the UN one day, so I feel like I should learn how to just be okay with this. I also see the real affect it is having on our department. There is also the point that they are spending more and more time at work not working (and they have very important jobs). I can’t tell if I am being petty for wanting them to stop talking in Japanese as much, or if I am in the right to think that they need to work harder to try to communicate in English more often. I also can’t tell if I am just being spiteful because of the increased workload for me from doing their stuff for them. Can anyone offer any advice for this situation?",
    "title": "Not sure how to feel about coworkers talking in another language to the extent that it feels exclusionary. Can someone please help me understand if I am in the wrong?",
    "subreddit": "careerguidance",
    "timestamp": 1498146673,
    "score": 16,
    "keyword": "american manager"
  },
  {
    "text": "Hello! Looking for career advice! What path would you recommend? Hello!\n\n&nbsp;\n\nI have a degree in Electronics and Communication Engineering, and 3 years and 2 months of experience in QA Software Testing. I really liked the job I did - test products that the company periodically came up with for sale, Coffee Beans, Travel and Living, I liked the products more than the actual job of testing (websites, backend entries, product flow), and I enjoyed \"client\" communications (I worked in an offshore establishment) and within the team, as compared to the technical task at hand. Especially the few \"product\" meetings that we attended, which put the developer to sleep, but I totally enjoyed sitting there, understanding the nitty-gritties that went into product development.\n\n&nbsp;\n\nSo I was wondering if there was some path I could take into Product development? I am currently on a sabbatical, took time off work last April to sort some personal stuff, and to think about where to go. I'm ready to come back into action, and was wondering what would be the right direction to approach this.\n\n&nbsp;\n\nShould I take a degree in Product Management? I couldn't find many on Quora apart from MBAs which a lot of people didn't recommend, quoting experience as a better candidate. I don't live in North America, or Europe (Preferred locations, I live in Asia), and I think higher education is the best way into these countries. I'm fine with any European or North American country, though I would love it if it were in America, or Scotland (LOVE the countryside!)\n\n&nbsp;\n\nI'm also open to any other recommendations that you may have with respect to career paths, I'm pretty much open to anything. I don't have a \"this is how it is supposed to be\", as long as I enjoy the task at hand - solving problems, guiding a product through to completion, communicating with the team, having a good time!, I'm okay with pretty much anything, as long as it has growth and stability, from personal responsibilities point of view. I'm not particular about \"fast\" or \"slow\" paced jobs, any pace would do, as long as it was engaging, fun, and gave me enough to take care of my responsibilities and peace. Any other responsibilities that went with the job, like late night calls, sudden product disruptions, long weeks leading up to a release, and working from home on Holidays, are totally okay!\n\n&nbsp;\n\nMy profile summary is as below, what would you recommend I do? There are opportunities in my country to pick up where I left off, but the competition is stiff, and I am not keen to pick up with the same role, which is why I'm asking about the degrees/programmes, also I can afford to pay for them, plus I'm 27 and would love to get started right away with a move, but it looks like in order to do this, I will need either time (and luck, in my country, to approach this from a professional point of view), or a degree in the country of interest.\n\n&nbsp;\n\nWhat would be some good degrees/programmes to pursue? Does the University matter? What certifications should I also consider? What are the opportunities in these areas (North America, Scotland, and Europe), like? Are there some other paths you would recommend to Product Management?\n\n&nbsp;\n\nProfile Summary (Most Recent, first):\n&nbsp;\n\n* 3+ Years of Total IT Industry experience as Software Tester in Agile/Scrum\n&nbsp;\n\n* 1+ Years of Marketing/Client Communications in a Startup\n&nbsp;\n\n* 6 Months of Marketing Internship in an Educational Institution\n\n&nbsp;\n\nFeel free to ask for any additional details, will be ready to share!\n\n&nbsp;\n\nMany thanks!",
    "title": "Hello! Looking for career advice! What path would you recommend?",
    "subreddit": "careerguidance",
    "timestamp": 1506089024,
    "score": 7,
    "keyword": "american manager"
  },
  {
    "text": "32, American with a Marketing background and a European MBA. My entire career was spent oversees. Looking to move stateside and considering getting a degree in data analytics, quantitative marketing to bolster my employability. Am I on the right track? I have big choices ahead of me.\n\nI spent the last 8 years working for advertising agencies in the Persian Gulf. The quality of my work experience was not as robust as it should've been, but I did manage to get an MBA from a Dutch university and save about $60k in the process. Now in my 30's, I realize that that staying in the middle east much longer is going to have a detrimental effect on my future career prospects in the US. Thus, I am trying to path my way out of here.\n\nI have no connections to the American advertising world and doubt that my experience here will be of much value. I am also somewhat introverted. For these reasons, I am looking to branch out into a separate (but related) field that would compliment my MBA.\n\nMy interest in digital marketing and the rise of big data compelled me to consider a career in data analytics/science. I started applying to Data Analytics, Marketing Analysis, Info Management programs in Europe (tuition is much cheaper there). My hope is that getting a skill set in this area will make me far more employable. I got accepted to a Marketing Analytics Program in Holland and a Stats/Info-management program in Portugal. I am also considering short-term certificate programs.\n\nI am not 100% fixated on DA and would consider other fields though.\n\nAlternatively, I could just quit my job, move back to the states and start applying to different positions. But do I have the credentials to land a decent position?",
    "title": "32, American with a Marketing background and a European MBA. My entire career was spent oversees. Looking to move stateside and considering getting a degree in data analytics, quantitative marketing to bolster my employability. Am I on the right track?",
    "subreddit": "careerguidance",
    "timestamp": 1492369666,
    "score": 5,
    "keyword": "american manager"
  },
  {
    "text": "22 - Should I quit my first BA job after 3 months? I'm a recent college grad who just started my job as a Business Analyst three months ago. Right now I'm ready to quit.\n\n\n&nbsp;\n\n\n\nI've always been interested in using technology to solve business problems, so when I saw this role initially I thought it was a great fit for me. The job description spoke of gathering business requirements, business process analysis and improvement, and consulting on the best ways to implement our software. The company is an a very narrow industry (it licenses software for a very specific and complex manufacturing process). We have the American rights for this software that is based out of Europe.   \n\n\n\n\n&nbsp;\n\n\nHere's the problem: I've done none of those things since I was hired. This company is extremely small (~10 people in the office) and I've quickly discovered that my supervisor and management in general is far too overwhelmed to involve me in anything even remotely important. There always seems to be a \"crisis\" with our clients, and this is largely due to the product. It's terrible software, but it's the only one of its kind and our company rides their monopoly like nothing else. \n\n\n\n&nbsp;\n\n\nI was supposed to receive full training to learn this industry and get involved, but my supervisor always seems to run into problems with clients and never has the time to sit down with me and show me the ropes. This cycle repeats over and over; I've never been trained properly, so I can't help my supervisor. My supervisor can't train me because they're always too busy putting out fires and managing our clients.\n\n\n\n&nbsp;\n\n\nNow, I've tried my hardest to teach myself, but this is an industry where you have to know extremely specialized and complicated manufacturing processes. I'm not an engineer by any means, and recognize my own limitations here. I'm getting extremely frustrated with this lack of understanding. \n\n\n&nbsp;\n\n\nSo, the net result is that I've been stuck with meaningless jobs - data entry, sending emails to schedule meetings for my boss, cleaning up the kitchen... all of which are tasks that have nothing remotely to do with my job. I spent the entire day today manually checking items off a spreadsheet from a budget for 2014. When I tried to automate it, my boss got upset and told me that wasn't the \"proper company method\". The results were IDENTICAL and yet he still wouldn't allow me to automate. It's almost as if they're filling my days with useless tasks on purpose to keep me \"busy\" and occupied, when I know that my time could be put to so much better use.\n\n\n&nbsp;\n\n\nI've tried speaking to my supervisor about this multiple times and have told him that I simply don't have enough work to do, and have practically begged him to give me more work or training so I can get involved with clients.\n \n\n\n&nbsp;\n\n\nThe salary is also below average, but I was looking for a job for months after I graduated and took this one because I thought it was manageable. My supervisor has said on many occasions that the CEO will pay me more when I can show that I've \"demonstrated value\", but they aren't giving me any opportunities to do so and I am restricted from creating my own. He's talking about 4-5 year timelines when I feel like I should be doing a lot more now.\n\n\n\n&nbsp;\n\n\n\nI'm willing to work hard for this, but I feel like I'm hitting the ceiling already and it's barely been 3 months. I can't continue to work at their pace doing meaningless administrative jobs for the next few years. I don't want to throw my career away by leaving too early, nor do I have a new job lined up yet. I am considering starting to look again.\n\n\n\n\n&nbsp;\n\nI had a meeting with my boss and the CEO on Friday last week, they apologized and promised more work for me. Today my entire day was spent doing customer support helping a new user go through the user manual and set up the program. This was NOT what I signed up for. Would appreciate any advice or guidance. Thanks. \n\n&nbsp;\n\n\n**TL;DR: BA job hasn't turned out at all like I expected. No training from Boss and finding it difficult to see how I can get more involved when they don't have time to work with me. Considering leaving for something better.**\n\n&nbsp;",
    "title": "22 - Should I quit my first BA job after 3 months?",
    "subreddit": "careerguidance",
    "timestamp": 1484007635,
    "score": 5,
    "keyword": "american manager"
  },
  {
    "text": "I want to work abroad? Mid-twenties. NYC. I work in corporate finance. 2 years as an associate out of college, decent company. Now I've been a senior analyst for 1+ year at a good company making ~80K.\n\nI just decided I want to move to Korea.\n\nI'm going to be staying in the States for another year then will begin making moves. I know that going abroad could mean a pay cut and getting there as a senior analyst could be hard. I'm thinking that maybe for the year or so I'm still here I try to find a manager position. That way, when I am looking for a job in Korea I will be at a higher starting point, both in terms of salary and (I hope) appeal.\n\nFinding a manager position with 3+ years experience will be hard, but I don't think impossible. If I do not manage to find a higher level position I will just stay at my current job for another year then try to get to Korea as a senior analyst or maybe manager. I'm not pressed if I don't get manager, I just want a similar salary to what I'm making now in Korea.\n\nIf I do manage to find a manager position I am to stay there ~1 year then apply for Korea. The pay increase is great but I'm afraid of the following:\n\n* Harder to find a similar level position since hierarchy is different in Asia (I would be applying to American companies though) So maybe I go from manager -> senior analyst? How bad does that look?\n\n* Resume looks like I move around too much?\n\nI am not Korean, would need Visa, and am planning to learn and possibly test (TOPIK) on language skills. My priorities are literally Korea -> money -> career path. I just want to make the move soon, at most staying 2 years.\n\nTLDR: 3+ years in corporate finance making ~80K. Want to move to Korea soon making a similar amount. What's the best way to make that happen?",
    "title": "I want to work abroad?",
    "subreddit": "careerguidance",
    "timestamp": 1510789413,
    "score": 3,
    "keyword": "american manager"
  },
  {
    "text": "Terrible performance in school and only took QA internships. All hope of a software developer position was lost.. until today as I just accepted a software developer job! (A retrospective view of my job hunt) I thought that I was stuck in QA for the rest of my life.  A software development gig in the USA (I'm Canadian) was my end goal, but with terrible performance in school and internships in QA, I thought that was out of reach.\n\n**Before interviewing (my credentials)**\n\nI took my first internship in QA because it seemed like a cool place to start.  And it was.  I really enjoyed it.  It was a blast finding bugs and speeding through every single manual test case faster than my other coworkers in QA.  I learned so much about QA that I didn't realize existed before.  I made it my goal to learn as much as I can, since internships are a great opportunity to learn too.  My boss was a great mentor; he taught me everything there was to know about QA.  Near the end of my internship (it was 8 months) my boss took a few days off and allowed me to lead the team with another member of QA.  Though I thoroughly enjoyed it, programming was always my end goal, so probably 5% of my time (and some lunch hours) was spent working on scripts that would automate things.  Sometimes I would show my QA coworkers the scripts, sometimes they'd glance at me and ask it.  They weren't a lot of scripts, but they were enough to pad my resume with.\n\nMy next internship was in QA because I couldn't find a position in software development (I feel like my grades and cover letter were the reason why, with more emphasis on grades).  All of the software developer jobs that I applied for didn't respond, while 10%-20% of the QA jobs that I applied for did, so I took them with the intention of doing things similar to my first internship (ie. write scripts in my own time while at work).  At this company my boss liked my performance which lead to an extension of my internship.  My boss got a QA intern for another 4 months, while I got a few extra bullet points to put down on my resume.\n\nI failed my first CS class, which shows up on the first page of reading my transcript.  Imagine reading someone's transcript and seeing an F on the first page.  Not a good start, eh?  I also ended up failing data structures and algorithms. But hey, that's okay, a lot of people fail, so I put on my big boy pants and attempt it again.  This time is different though; I get a tutor and go to every single office hour.  Yet even with tutors and getting extra help the final was too much for me to handle, so I end up failing it once more.  That's *not* okay, how the hell does someone bounce back from this?  Turns out, there's a way.  My school requires you have a streak of great semesters before you can take a class for a third time.  So I ponied up and fucking had three semesters of great performance (not enough to bring my GPA above 3.0, but enough to retake the class again).  I retook the class and somehow passed it.  How I did so much better this time... I have no clue.  Every single examination was so much easier (except for my final, which I fucked up on, but the rest of my grades were enough to save me from another dreaded F).  I also had to retake Calculus 1 because I didn't meet the prerequisites for Calculus 2.\n\n**Getting that interview**\n\nSo how does someone that graduates with a bad GPA (2.7), failed Data Structures and Algorithms twice, retook four classes, and only took QA internships get interviews for software developer positions?  Honestly, the only relevant thing in that list of fuck ups is that I only took QA internships.  Not a single company asked for my GPA, and only one of 250 companies asked for my transcript.  So how *does* someone that only took internships in QA get an interview for a software developer position?  By marketing themselves as a developer.\n\nI wasn't a software developer nor did I have any work experience in roles that didn't have the letters \"QA\", so a lot of people that reviewed my resume often tossed it after reading those two letters.  90% of the work that I did at both places was QA work (manual testing).  However, that 10% is what I capitalized on in my resume.  I made sure that I never mentioned anything about manual testing, designing test cases, or anything else that I learned from my first internship in QA.  I did know that testing knowledge is very important, though, so I touched up on it in my cover letters.  I didn't shy away from my job title being \"QA Tester\", since that's the role that I was given.  With that said, my resume gave off the impression that I was a tool developer from the scripts that I created.  I was able to say that I worked on x, or developed y, or extended the functionality of z even though I only spent 3 hours on it.  I was also able to put that my internship was extended, which is a great thing to put on a resume when the things above it are development oriented.  Lastly, I was able to talk about the specific bullet points without hesitations or \"umm\"s.  If it was on my resume, you know damn well that I'd be able to talk about it for 10 minutes.\n\nI also had a lot of help from my personal projects.  These are VERY important.  Don't just make CRUD apps that you can whip up in a few hours.  I took concepts from my upper division CS classes and applied them to my own questions to find interesting answers.  One of these projects took one month, while another took four months.  I also had an iOS app that took 9 months.  These say a lot about your programming work ethic.\n\n**My actual job application process and interviewing**\n\nThough I graduated in June, I started applying in January 2017.  A lot of people here suggest applying in the Fall so that you'd have full time positions lined up by graduation, but a lot of the places that I applied to in January said that they \"can't see that far into the future\" for May positions.  They also said that \"they're looking for people to join the team in the next few weeks, not months\".  But that's okay.\n\nAt the beginning of my job hunt, my cover letter began as a full page of text with one paragraph brown-nosing the company, three paragraphs explaining how well I'd perform three bullet points from on the ad, and a final paragraph rewording the first paragraph.  It was very formal, with the name of the hiring manager (if their name is gender ambiguous I'd waste a lot of time doing my research on the company website or Linkedin trying to find out if they're male or female so that their salutation is correct; or address it to Hiring Manager), address, country, zip/postal code.  At the end of my job search (and the cover letter that got me a job) my cover letter was usually half a page.  The first paragraph was one sentence that said that I saw their ad on Indeed/company's career site/Friend's Facebook post.  The next paragraph was a paragraph that linked as much of their required skills and job duties to my own experiences in software development (basically saying how I'm a 80% match to what they're looking for).  I also added that I have a brain for testing, if it was an SDET role.  Sometimes I'd separate this into two paragraphs, cause no one likes reading big-ass paragraphs.  The last paragraph was a closing statement about me getting my degree, and how excited I am to work for that company.  If the company was american, I'd include ~~my favorite beer, why, and a link to the political party that I fully support~~ that I'm eligible for TN status to work at said company.\n\nOf around 250 applications, I had 26 companies actually move forward to a phone interview or online assessment.  My favorite interview experiences are the ones that started off with an HR phone screen.  It felt like they actually cared about the people that they were interviewing.  I applied to several positions at every company, and while I wrote a cover letter for every single one, it was difficult for me to know exactly which position I was being interviewed for.  One thing that I really appreciated was when the recruiter would tell me exactly the position that I was being interviewed for, rather than guessing what position it's for.  If they didn't tell me, I'd ask, but sometimes the responses and answers are more vague than the job duties in the position description.  This is painful when the first interview is a technical interview and you don't know if you need to brush up on your linux admin tools cause one of the jobs that you applied to was part of the infrastructure team.  This happened and it was so annoying.  My worst technical phone interview experience was one where the guy asked me a question that was totally irrelevant to the things that he suggested online in preparation for technical interviews.  In this experience I was given the name of my interviewer, and the HR person suggested that I visit his LinkedIn and tech blog.  On his tech blog he had suggestions on how to prepare for interviews, but the interview that I had with him was totally fuckin different than what he suggested on his blog post.  The phone call also cut off in the middle of the conversation (never ever happened with my other phone interviews which are all done in my room)!\n\nOf those 26 companies, I had on-campus interviews with 5 different companies.  Three of them were in Canada (local), and two of them were in the USA (they paid for flight, hotel, expenses, and one of them paid for the rental car).  I had no experience with LeetCode when I started.  Looking back at how I approached my interview questions, holy shit did I need LeetCode.  I never thought it would make me a better developer, but it did.  It changed the way that I thought about my problems.  I never broke down problems into potential data structures that I could use, and instead, just hacked something together.  But then again, interviews just want to see that someone knows how to program, right?! (no)  Though exhausting, my favorite on-campus interviews were the ones where you were there for the entire day.  I appreciated this because you didn't need to go back to the company for a second time.  It also helped with nerves to get past the first interviewer.  In the first interview, my brain is foggy as hell and I'm not as sharp when it comes to coming up with an optimal solution.  But once that first interview is done my brain is wired and ready to go.  It also helps me understand the culture of the workplace when I'm there for 6-8 hours, rather than there for just one.\n\nOf those 5 different companies, I had a verbal offer from two of them (both in the USA) and got a written offer from one of them.  I got Company A's verbal offer on a Thursday morning, and got Company B's verbal offer on the afternoon of the Friday following it.  Company A offered more than Company B and offered a signing bonus that Company B did not offer, so I told Company B my offer from Company A, and she told me that she'd try to get the guys upstairs to match it, but there's no guarantees.  At 5:40 PM (on that Friday) I receive an email from Company A that they won't be continuing with me.  On Monday (That weekend felt like months tbh, couldn't sleep, questioned whether I should've just taken the offer and tell HR that the verbal offer with the other company fell through) she called me and told me that there's no jump in salary but she could give me a signing bonus which was higher than Company A's signing bonus (which was effectively 0, and so was their salary), to which I accepted.\n\n**Too long, did not read**\n\n* I had two 8 month internships in QA but wanted to get a software developer job\n\n* At both QA gigs I would devote 5-10% of my time (Lunch hours, time that wasn't spent on Reddit) to working on scripts\n\n* Marketed myself as a developer on my resume.  Some interviewers even said that they would consider my previous roles as a tool developer, not a QA tester\n\n* My cover letter started off as a full page of filler for two to three points related to the job, but eventually was trimmed down to half a page of good content that was really really related to the job\n\n* Sent 250 applications, 26 moved forward with phone interviews or online assessments\n\n* Only one company asked for my transcript\n\n* From 26 phone interviews/online assessments came 5 companies that wanted to see my human form\n\n* From 5 companies that saw me in person, I got two verbal offers (both USA) and one written offer (accepted after an excruciating weekend)\n\n* Verbal offers can fall through\n\n**Last minute comments**\n\n* If I could do it again, I wouldn't.  I hate interviews and hate applying for jobs even more.\n\n* Rejections hurt in the beginning, but eventually you become numb to them\n\n* The mental toll that I had waiting for Company B to come back to me was worse than waiting for marks to come back from an exam that you're not sure if you passed or not.  If you're not a top tier developer like myself and you're desperate for a job, I recommend taking it.  The signing bonus that I got is great but mental health is greater.\n\n* Start using sites like Leetcode and Geeksforgeeks.  I really like the Leetcode random button.\n\n* For the most part, Glassdoor interviews were unreliable\n\n* To be honest this subreddit didn't help at all\n\n* What helped more than anything is looking my interviewers up on Linkedin so that I can ask questions that are more tailored to them.  \n\n* At one company I asked HR what work-life balance was like, and she said that it's great, that the company values having your own healthy life outside of the company.  At the same company, I asked about worklife balance to a senior developer that's been there for 3 years, and he said that typically developers show up at 10 am and leaves at 7:30 pm.  Noped out of that.\n\nThanks for reading, everyone.\n\nEdit: Made things easier to read.",
    "title": "Terrible performance in school and only took QA internships. All hope of a software developer position was lost.. until today as I just accepted a software developer job! (A retrospective view of my job hunt)",
    "subreddit": "cscareerquestions",
    "timestamp": 1501741477,
    "score": 47,
    "keyword": "american manager"
  },
  {
    "text": "Staying at Berlin startup as PM vs. moving to San Francisco unicorn as SWE EDIT: To clarify, I'm American and graduated from an American college\n\nI recently graduated from university with a full-time offer as a software engineer at a top unicorn in SF (think one of Uber, Pinterest, Twitter, Airbnb, Dropbox) starting in the fall. For the past few months I've been interning at a fast-growing startup in Berlin as a product manager intern. In the past few days, the founders have said that they'd like me to stay on and be a full-time PM after the summer, which would mean leaving my SF unicorn offer.\n\nI'm having a hard time making a decision. \n\n----------------------------------------------------------------------------------------\n\nPM @ Berlin startup pros:\n\n- Open attitude\n- Stellar nightlife\n- PM role suits me better\n- Experiencing rapid growth, just closed Series A\n- Access to traveling around Europe/Africa/Middle East\n- Spend a lot of face time with founders/leadership\n- Role has more responsibility\n\nPM @ Berlin startup cons:\n\n- Winter is cold as fuck\n- Limited social network since I'm from the US\n- Less of a startup ecosystem than Bay Area\n\n--------------------------------------------------------------------------------------------------------------------\n\nSWE @ SF unicorn pros:\n\n- Decent weather year-round\n- Good food\n- Everyone speaks English\n- Awesome perks\n- Phenomenal compensation\n- Access to fun outdoors activities\n- Huge startup/tech ecosystem\n- Bigger social network already there from college friends\n- Tons of talented people at the company\n\nSWE @ SF unicorn cons:\n\n- SWE is not a role I want to stay in for long\n\n----------------------------------------------------------------------------------------\n\nBasically, are there any considerations I'm missing, or should take a hard look at while deciding? In the future, will it be easier to jump from unicorn SWE to PM at a great Bay Area company than from Berlin startup PM?",
    "title": "Staying at Berlin startup as PM vs. moving to San Francisco unicorn as SWE",
    "subreddit": "cscareerquestions",
    "timestamp": 1499809645,
    "score": 10,
    "keyword": "american manager"
  },
  {
    "text": "How do I know if I should quit my job as a junior developer? I'm a junior dev at a startup in New York. When I joined the company I didn't have any experience or a degree but even with that in mind, I'd still say my knowledge of Ruby/RoR at least was *approaching* that of a mid-level developer. The only company that would give me a job at the time primarily use Golang, which I sorta knew but not really. I told them this and they said it'd be cool and that I could work on one or two minor Ruby projects and do some customer support (everyone at the company was expected to do this back then) before eventually progressing to a mid-level role and working on Go code.\n\nSo it's been six months now and I feel that while my understanding of Go and the technologies my company specializes in have improved, they haven't improved anywhere near fast enough. There wasn't really much of a dev team when I joined (it was just me, another junior developer, a contractor and our CEO alongside less technical members of senior management). The CEO left the country a few months ago and now works from home but even when he was around, he was often pretty much doing his own thing and we were left to our own devices much of the time. Even now that they've hired more experienced staff, I still feel like I'm not getting the level of support I need. I don't expect anyone to teach me Go and I try not ask questions about it unless it becomes a blocker. But often when I raise a question about the way in which our core product functions in the company's Slack channel, I'm either ignored, forced to make do with the fact that nobody in my time zone understands the code well enough to know the answer, given answers that confuse more than help or, on rare occasions, belittled for not knowing the answer already even though everyone knows how much the existing documentation sucks. As a result, I often feel overwhelmed by the support side of my role and even on days where there are barely any user queries, I'm plagued by issues with the build environment that nobody can ever help me with or assigned confusing tasks that seemingly no one understands. I don't even really get to code all that much and often just feel more like an overpaid application support engineer than a developer.\n\nI don't know if this is all just growing pains and if I should just keep at it or if this really is a bad environment for me. Even though I feel really lonely most of the time (most of the other developers work from home in different states and I actually don't have that much in common with any of them - I'm the only African American and one of only three women in the company, I'm the only developer who doesn't either have a CS degree or 5 years+ of experience, etc.), I do actually really like the people I work with. At the same time, I worry that I might be being taken advantage of, which just tends to happen to me a lot in general. I've considered leaving but I'm also conscious of the fact that almost none of the code I've worked on in the last six months has been made public so, to a potential employer, I'd look as though I were in the same position as I was back when I was looking for a job six months ago.\n\nAny thoughts?",
    "title": "How do I know if I should quit my job as a junior developer?",
    "subreddit": "cscareerquestions",
    "timestamp": 1492625457,
    "score": 2,
    "keyword": "american manager"
  },
  {
    "text": "Financial Controller: US vs Europe Job Title I’m an American, and I’ve been looking at accounting jobs in Europe. I have noticed that many accounting jobs in Europe use the title, “Financial Controller”. However, the job descriptions are somewhat vague\nMy Questions: What is a Financial Controller? What level (number of years) of experience is necessary to be a Financial Controller?  And how is the position different from being an accountant?\nI tried the research online, but most of the information that I could find just said that it was a difference in the job title naming convention between the US and Europe.\nIn the US, a Controller is typically a middle-manager with probably a minimum of 7 years of experience (although many companies might prefer someone 10-15 years of experience). They will typically have a large group of people reporting to them either directly (like managers) or indirectly (like entry-level staff).",
    "title": "Financial Controller: US vs Europe Job Title",
    "subreddit": "Accounting",
    "timestamp": 1486352833,
    "score": 7,
    "keyword": "american manager"
  },
  {
    "text": "International Transfer Case - Need Advice I recently transferred to the north American office of my consulting firm from a developing country. As you may know, like many others, my firm allows only the top performers to make an international transfer. So, think of me as someone who does a good job on any project and whose partner thinks very highly of him.\n\nHowever, after spending some time in this country (great country BTW), I have come to realize that being a non-native English speaker has a distinct disadvantage compared to my peers especially at the higher levels (~manager+). I would not say that I had not expected it but I certainly did under-estimate the enormity of the challenge. It has begun to impact my morale.\n\nDo we have anyone on this subreddit who is a case of an international transfer especially someone coming from a non-native English speaking country? How did you assimilate in the new culture? It takes years to really understand all the references, right context, American psychology (behavior drivers) to do that small talk and make a 'real' connection with the prospective client who would 'like' you and 'want' to work with you. This becomes more important especially if big part of your role is going to be selling your firm's services. Of course partners are there to help, but I will certainly need to overcome this challenge on my own if I want to be successful at my firm. I am pretty confident about ‘executing’ any kind of project but unfortunately that's not going to be enough going forward if I want to survive and progress further. Any advice would be really appreciated. All inputs are welcome. Thanks.",
    "title": "International Transfer Case - Need Advice",
    "subreddit": "consulting",
    "timestamp": 1513815884,
    "score": 16,
    "keyword": "american manager"
  },
  {
    "text": "Angry Letter I Wrote 2 Years Ago I can’t help but to think the only real reason I can’t seem to get any type of  production artist/ graphic design/ or screen printing position is because I’m a young black female. I usually hate throwing the race card in but I don’t know where else to turn. Never mind the fact that I have the degree required for these companies in the first place. It’s strange how every time I contact these companies when I see that there is a new space open they’re either “too busy” to take a minute to talk to me or the position has been filled. I polish my resume and cover letter well and because my name isn’t ethnic sounding I usually get asked to come in for an interview (Why is that still a thing in 2015?) Professionally dressed and well spoken. Only to keep getting turned down because I’m not the blonde Brittany stereotype that was assumed on paper.\n \nI can’t even seem to get a position at art retail stores. I don’t seem to fit the mostly white male hipster vibe most of them seem to have. When asked how I could contribute to the sales I explained how I do my own illustration and how I can give others that come into the store my own input on supplies and materials. Even left business cards at the end of the interview but I either get told that I’m too over qualified or too under qualified and don’t get the position. Most of the yelp reviews of one art supply store in particular was saying how most the sales associates don’t even know their products at all. \n\nThe summer between my junior and senior year of college I had applied to an AC Moore where the hiring manger was an alumni of the school I was going to and saw how qualified I was but did I get hired nope! I went back a few weeks later to pick up supplies for a watercolor painting I wanted to do and I happened to pick up a sheet of Arches cold press watercolor paper that didn’t have a code bar. The red haired girl ringing me up got confused and to this day that statement still rings in my head as she asked her co-workers “How much is this poster board?” I was done literally just done right then and there. I didn’t get hired but this girl who does not even know the difference between watercolor paper and poster board got hired probably solely on her looks alone.\n\nSame thing goes for all those companies that turned me down. One screen printing place had a manager that told me that he couldn’t hire me because he couldn’t afford to pay me. (But he sure as hell paid for a damn chiropractor the same day he let me go and spent half the day shooting hoops smh). Not all young black people like myself are the way Fox News likes to portray us; most of us have goals and aspirations outside of twerking or being labeled “thugs”\n\nI’m not “right” for those jobs but I sure as hell was qualified to waste seven months of my life working in a burger joint. Not once I did have the energy to even do my illustration pick up a pencil or paintbrush because of that dead end low paying barely making it job. Didn’t learn any new pen and ink styles I wanted to further develop but I was pretty damn good at salting fries all day. I was tired all the time and at 22 to 23 years old I should have all the energy in the world but I didn’t. In fact when my manger let me go he had just hired his brother as a line cook despite him not shaving his Santa beard and working the grill (nasty) must be nice.\n\nSo now I’m back to square one once more trying to hopefully get employed again soon. But right now my main focus is trying to get new artwork done since I spent the past year just kind of drifting because of financial worries. I have lost sight of this is something that I love and it’s not a job it’s me building a career. I still dream of being a children’s book illustrator and I’m not ready to throw in the towel just yet. In fact I want to strive to be the very first African American woman to win the Caldecott Medal. That the type of quality illustration I want to be making and if I ever get to that level they’ll be the ones sorry for overlooking me.",
    "title": "Angry Letter I Wrote 2 Years Ago",
    "subreddit": "blackladies",
    "timestamp": 1498281014,
    "score": 15,
    "keyword": "american manager"
  },
  {
    "text": "TIL that current Dodgers manager Dave Roberts is of Asian descent, being born in Okinawa, Japan to a Japanese mother (and an African American father)",
    "title": "TIL that current Dodgers manager Dave Roberts is of Asian descent, being born in Okinawa, Japan to a Japanese mother (and an African American father)",
    "subreddit": "asianamerican",
    "timestamp": 1508996295,
    "score": 78,
    "keyword": "american manager"
  },
  {
    "text": "Question / Idea for American feminists in the \"Women in Tech\" movement This question is mostly directed at American feminists, since in other countries, lack of representation of women in tech seems not to be as dramatic.\n\nI work in Silicon Valley, at a tech company, and the majority of my co-workers are of South Asian or East Asian descent. I would say about 75% of my co-workers are men, and 25% are women. Of the women, virtually 100% are of South Asian or East Asian descent (for the men, 80% are of South Asian or East Asian descent). Most of the men and women I work with are immigrants here in America on H1B visas (a controversial topic in its own right - which I won't bother debating here). FWIW, I was raised in the US, am a US citizen.\n\nIf the goal is to increase representation of women in tech,wouldn't the easiest way be to require a certain quota of H1B visas be allocated to women only? On my team, I have hired both men and women on H1Bs, and on average, I see absolutely no difference in their talent and abilities. I do, however, notice that I only ever seem to receive resumes from female engineers who are immigrants from East or South Asia, the majority of them on H1Bs.\n\nThe process of \"competing\" for one of the limited H1B visas is a difficult and arduous one for the technical talent that comes to this country. Often times, talented women engineers from other countries cannot get these visas. Wouldn't the most efficient way to increase the representation of women in tech be to require a high proportion of the H1Bs that are granted to foreign tech talent be given to women only? Is this something feminists should advocate for as an efficient way to improve the women in tech problems? If there was a requirement that H1B visas can only be given to women, there would be a large influx of female tech talent to this country, and technical roles in my company would almost immediately be at least 60% women.\n\nAsking as a curious manager at a Silicon Valley tech company who has hired and worked with many (90%+ foreign born) men and women, and has seen no difference in technical competence between the two genders.",
    "title": "Question / Idea for American feminists in the \"Women in Tech\" movement",
    "subreddit": "Feminism",
    "timestamp": 1490308241,
    "score": 8,
    "keyword": "american manager"
  }
]