[
  {
    "text": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2] Hey r/jobs, it's me again, coming at you with all of the resume advice you could ever need, and more! I posted all of my resume tips and tricks a couple of months back, which led me to receiving an amazingly overwhelming amount of comments (THANK YOU!) and I wanted to clear up some things, and include some things I missed in my last post. I've put all of this advice in order so it's easy to find the info you need when you need it.\n\nTo introduce myself, my name is Holly, and I am an experienced resume writer and editor located in North America. Essentially, I love helping people make their resume the best it can be, and I often help out in the r/jobs discord, and a tech workers slack channel, giving free advice as often as I am able to.\n\nResume writing and editing has been a part time hobby/job for me since 2017. I work full time as a senior account manager in tech, plus I have a bunch of hobbies outside of work, so I give my time where I can, which is unfortunately not as much as it used to be. I guess that's why I've written these posts, because I can no longer help as many people as I used to, and hopefully this way it can assist hundreds or even thousands of people!\n\n***DISCLAIMER: Many of these tips are North America specific,*** ***and some/many don't apply to creative fields like designers/marketing resumes.*** *Also some of these are for people working in the corporate world and don't apply to food service or retail jobs.* ***Of course, some of these won't apply to you specifically, so use your common sense to take what is useful to you.***\n\n~\n\n# CONTACT INFORMATION AND TOP OF PAGE\n\n* **Contact details** \\- at the top when of your resume under or next to your name, you need to include the following things: your location (if you're willing to relocate to the area the job is in, put the jobs city in and not your current location) email address, and your LinkedIn profile. Phone number isn't essential, so include it or don't, it's fine. Other optional things to include - if you have a portfolio or GitHub, definitely include them. Don't paste them as a messy link, instead write \"GitHub\" and turn it into a hyperlink.\n* **Location:** Are you located in San Francisco, California, applying to jobs in your city, and/or remote? Write \"San Francisco, CA\".\n* **Location:** Are you in San Fran, but open to relocation, AT THEIR EXPENSE? Write \"San Francisco, CA (open to relocation)\".\n* **Location:** Are you in San Francisco currently, but you're willing to move **before** starting a new job to New York AT YOUR OWN EXPENSE, where your dream job is located? Or you've already planned to move to New York and you're only applying to roles there? Put your location as \"New York, NY\". Why? Because you're moving there on your own cost prior to starting work, at your own expense.  If it comes up in the interview, tell them the truth. \"This is my dream job and I'm planning to move prior to starting if I'm successful\", or \"I'm moving to New York on X-date - which is prior to the start date of this job - and everything is already organized, which is why I have my location listed as New York rather than San Francisco.\"\n   * If you want them to pay for your relocation fees, then use the (open to relocation) that I wrote above.\n* **DO NOT INCLUDE YOUR FULL ADDRESS IF YOU'RE IN NORTH AMERICA** \\- only include your City and State/Province, and use one of the above depending on your circumstances.\n* **Contact details (what not to include)** \\- don't include the word PHONE before your phone number, or EMAIL before your email address. They are not necessary. People know what a phone and email look like. You're just taking up space for no reason. Also don't include your social media accounts except for LinkedIn (unless they are professional accounts for marketing/design/media positions of course, etc.).\n* **LinkedIn link and info:** Make sure your LinkedIn profile link is customized. You can get a custom LinkedIn link from your LinkedIn profile on the right hand side at the top right, click on \"Edit public profile and URL\". Make sure your custom LI link includes your name and not just a bunch of random numbers. Be creative. Are you a John Smith and you're located in Texas? Maybe your custom link could be smith.john.tx or johnsmith.tx, or include your middle initial. Play around with it until you get the perfect LI custom link. When including your LinkedIn link on your profile, instead of including the whole URL, only include the last bit (for example, **in/johnsmith**) - and lastly, make sure you include the hyperlink on your resume so that people can click it while viewing your resume.\n* Do the same as above with GitHub or any other professional links you're including on your resume. Make it a hyperlink so you're not including some messy link that's killing the \"feng shui\" of your resume.\n* **DO NOT INCLUDE A PHOTO OF YOURSELF IF YOU'RE APPLYING TO JOBS IN NORTH AMERICA.** Companies have to prove that their hiring processes isn't based on race, gender, age, appearance, etc. Including a picture in NA can actually get your resume thrown out entirely. I know LinkedIn profiles include your profile picture, which is weird that we're just okay with this, but not with pictures on resumes, but here we are. Hey, I don't make up the rules, I merely abide by them and am here to ensure your resume is, *\\*chefs kiss\\**, perfectly formatted.\n* **Summary/Objective - to add or not to add?** I only recommend adding one if you're making a career move/change, and applying for jobs that aren't in your career ladder. The other alternative is if you've been out of your industry for a while, either studying or working in a completely different field, or if you took a break and need to explain the gap in work. I believe a summary should be no longer than 5 lines of the page maximum, which is typically around 3-4 sentences. You don't need a summary if you're looking for jobs on your current career ladder and don't have any gaps on your resume.\n\n# HOW TO ORGANIZE YOUR RESUME (IN ORDER)\n\n* If you HAVE had relevant experience since your education, then put your professional experience first. DO NOT INCLUDE YOUR HIGH SCHOOL EDUCATION (unless you're still in high school, or are looking for your first or second job out of highschool, or if you don't have university to add to it and you have less than 2 years of work experience). So it would go like:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it) 3. Experience 4. Education & Certifications 5. Projects (if you have any you want to add, and the space to add them, or simply link to your GitHub or LinkedIn and list them there) 6. Skills 7. Volunteering - if it's going to assist with your current career, or if you have the space for it 8. Languages spoken (only add this if you speak more than one language fluently) 9. Interests (if you have the space and want to add them)\n* If you HAVEN'T had relevant experience and your education was in the past 1-3 years and it's relevant to your job, then:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it - I do recommend it here to explain the direction you're heading) 3. Education & Certifications 4. Projects (if you have any) 5. Skills 6. Volunteering (if you have any) 7. Languages spoken (only add this if you speak more than one language fluently) 8. Interests\n* Basically, just put the best most recent and relevant info at the top that relates to the jobs you're applying to, and mark it in order from there.\n\n# ONE PAGE OR TWO?\n\nAh I love this question, people get so heated about it haha! There's a lot of variables and a lot of opinions on this, so let's get into it...\n\n* FIRST THINGS FIRST - If you're going to go to 2 pages, for the love of the flying spaghetti monster, DO NOT, I REPEAT DO NOT have it as less than 1.5 pages. If you're commiting to 2 pages, USE THE SECOND PAGE. Beef up some bullet points, make some of the text or the lines larger, whatever you need to do if you're absolutely convinced it will not fit on one page. Otherwise, REDUCE that bad boy to 1 page. Nothing quite grinds my gears as much as seeing an 8th of the second page being used. IT LOOKS AWFUL, REALLY REALLY AWFUL. Thanks for letting me get that off my chest.\n* Unless you're in senior management, your resume (for North American applicants anyway) should be one page ideally, two pages max if you have over 10 years of RELEVANT experience, but in saying that...\n* Do you have LESS than 10 years of university and work experience combined, and you're NOT in a high up VP/Director position? You are likely best to go with one page.\n* No education after highschool, but you've got 10 years or less of really amazing experience, but not in a higher up position? You are likely best to go with one page.\n* Do you have LESS than 10 years of university and work experience combined but you also have a few AMAZING projects you worked on separately, and you've done relevant volunteer work, and your resume is actually kind of incredible? Then hell yeah, go for 2 pages! Brag all you want and show them why they need to hire you!\n* I could go on. Just one page or two, either way, ensure you use the full page if you've got it, I hate seeing only 1.5 pages or less. Either bring it closer to 2, or bring it down to 1.\n* **\"What about 3 pages, or 4, or 5? I have so many jobs and I'm awesome and want to show them!\" In North America, NO, GET OUT OF HERE, ABSOLUTELY NOT!** They won't see it as \"Wow this person is amazing\", they will see it as \"Oh wow this person doesn't know how to write a resume, and this is way too long for me to bother to read\" and they'll delete it. In other parts of the world? Sure. I know some countries like the UK for instance that want a full CV (they are different from resumes, as they list every single job, achievement, certification, volunteer experience, and more) that are often 3+ pages long. Well, my advice isn't for UK resumes, because that's not my specialty. I'm just saying that 2 is the max for North America.\n* Need to find extra space on your resume to reduce it down to 1 or 2 pages? **Use narrow margins.**\n* **SO ONE PAGE OR TWO?** Honestly, either is fine if you're using the space efficiently, and aren't writing giant bullet points and paragraphs. ***If you're unsure, go for one page.***\n\n# GENERAL FORMATTING\n\n* **Make sure EVERYTHING is uniform**. If most of your dates are 3 letters only, like Jun 2016 - Oct 2020, then they ALL need to be the same. Yes, even the months of June and July with just one more letter. It looks much neater. Ensure you double check the spacing is correct too, for example, the most common error I see on resumes is some dates having a space and then a hyphen, and then no space before the next date (example Jan 2019 -Jun 2020 and then Jul 2020-Feb 2022, then Apr 2022 - Present) - this is a very small issue, but it shows you do not have attention to detail. Whichever format you choose for one, ensure they ALL follow the same format.\n* Double check if something is bolded, or underlined (like a title or date or company name), ensure that all the others are in the same format.\n* Is the font the same for each section? It's fine if you're using different fonts on your resume, but ensure that each section is the same. For example, if one job with all the bullet points are Times New Roman, then all jobs needs to be in Times New Roman. If one section header is Garamond, and the next section header is Times New Roman, it shows you don't have the attention to detail.\n* **Remember, your resume needs to be PERFECT. You seriously need to go through each line by line with a fine tooth comb.** Imagine not securing an interview with your dream job because of a few silly spelling mistakes or poor formatting. \"Well I didn't want that job anyway\"... yeah you did. It can be a hard pill to swallow and it's easy to make light of it, but you never know who is the one deciding on the yes or no pile and where yours will land.\n* **Ensure all line breaks are the same size**. If one blank line in between 2 paragraphs is size 7, and then the next blank line between paragraphs is size 11, it's a very noticeable detail to those looking at your resume.\n* **For your paragraphs and bullet points, use the \"justify\" align**. It removes a bit of the white space and brings your text fully to the right of the page. It's much neater and removes the jagged look of left align. The exception to this (as there usually are) is if none of your bullet points are longer than one line. I like justify align on a summary/objective if you're adding one, and on bullet points or any paragraphs that are 2 lines or longer. Play around with it and see what works best for your resume.\n* **DON'T WASTE AN ENTIRE LINE ON A HANDFUL OF WORDS!** I often see people when writing their bullet points taking up less than half a line, or only a couple of words on the 2nd or 3rd line. Not only does this create a lot of white space, but it's also selling yourself short. You have one, maybe two pages to sell the sh!t out of yourself. Make every single line of your page count. Make sure every single line of your bullet points is at least halfway across the page or more. Either beef up that bullet point, or condense it.\n* **5 bullet points max per job** (of course there are exceptions, but this is as a general rule). The older the job, the less bullet points. A job from 10 years ago will only require 1-3 bullet points (and only if it's relevant to your current career. Really think hard about whether to include it on your resume or not. Remember, all your jobs are on LinkedIn, not everything needs to go on your resume... again, North American advice).\n* **Use a different verb at the start of each bullet point.** I roll my eyes when I see the same word repeated multiple times as the first word in bullet points. Instead of just using the word managed, use words like Coordinated / Directed / Orchestrated / Oversaw / Spearheaded. There's a great article written by the Muse, you can find it here: [https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome](https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome). If you work in a field with specific wording, like Nursing for example, then google \"Nursing resume verbs\" or something like that. Put the work in to your research for your resume wording and you'll reap the rewards.\n* **DO NOT USE COLUMNS** (unless you're in a creative field like a designer, or your resume is being handed to someone in person) - Columns do not play nicely with ATS (AI resume reading software) and as the majority of companies now rely on ATS to quickly read resumes, you're shooting yourself in the foot by using columns or any other weird formatting.\n* Each bullet point should not be paragraphs long. Each bullet point should be 1-2 lines long only on the page, 3 maximum.\n* Each job should take up no more than 1/4 of the page, unless you've only had one or two jobs, or are more senior. Or in another unit of measurement, no more than 11 or 12 lines of the page. The more recent the role, and the more impressive the tasks, the more bullet points there should be, but don't just include the job description which leads me onto my next point...\n* Reiterating that each job should only include the achievements from that job, and only the most impressive things you achieved should be listed. Include KPIs, processes you implemented, articles you wrote, dollar amounts of your biggest sales or averages, include numbers of accounts you managed, or how many calls you took each day, if you went over your OTE what was the percentage, etc. It shouldn't read as a job description, you need to sell yourself and show them what you're capable of! (disclaimer - unless your jobs are more entry level or food service etc, then job descriptions are likely the norm).\n* Don't include irrelevant jobs/projects. If you worked at Starbucks for 6 months 5 years back, and you've had relevant experience in your field after that, then remove the Starbucks (or whatever other unrelated jobs you have) from your resume. Your resume should be tailored to the jobs you're applying for! To give you some more reference, I have been working since 2003, and my resume only has jobs from 2014 onwards.\n* **Try to have your dates on the right hand side of the page, and your position and company on the left (list the position first, then the company next to it or below it).** It's the standard, and makes the person reading your resume find the info much more quickly. Trying to make your resume too unique (again, unless you have a creative job then ignore this) will only hurt your chances of it being taken seriously. Of course you want to make it look nice, but try to follow the standard format where possible so it's easy to read.\n\n# SKILLS & INTERESTS\n\n* **Put your technical/software/program skills in one line**, separated by commas or | lines | like | these. Putting a single skill on each line is a waste of space, and will create too much white space. Your resume should be concise, to the point and get everything across in as little space as possible.\n* **Don't use the \"slider\" scales for your proficiency in various skills.** Why? Well, firstly, if the hiring manager wants to know your level in each, they will ask. And secondly, the dots or slider scales aren't measurable and take up extra wasted space that again is not going work well with ATS. Instead, as I mentioned above, list your skills and programs/software etc. in a line separated by commas | or | these | lines. Don't include software that you used 10 years ago and never progressed past a beginner level, but list pretty much everything else within reason. Most things you'll pick back up quickly even if it was 5 years ago, provided you were semi-decent with your knowledge of it.\n* What about interpersonal skills? Should you add them? I highly recommend adding them into your bullet points, rather than listing them separately. In saying that, though, there's going to be some industries, or some skills, that require them listed separately. If you're listing them separately, first ensure that you actually need them on the resume, and which ones are necessary and which ones can be removed if any. If you're still adament you want to list them separately, then put them in the same format as your technical/software skills as I listed above, either separating each with the | lines | like | these, or with commas, one on line. And that line needs to go below the hard/tech/software skills, not before, and ideally not together.\n* **Languages:** In North America, only list a languages section if you speak more than one language. Always list English first as this is a job requirement every time, and then other languages after that. If you're fluent in English, a native in Spanish, fluent in French, and have intermediate German, I would list it as such:\n   * \"Languages: Fluent in English, Spanish and French, intermediate in German.\"\n* **Interests - should you add them or not?** It's a highly debated topic and everyone will have a different view on this. I personally believe that you should include them. For example, I ride motorcycles and love stand up comedy shows, am coffee obsessed and love my local lacrosse team. Almost every single interview I land, my interests are brought up, with the interviewer connecting with one or more of my interests, or asking me more about them. It's a great conversation starter, and it makes you more than just an applicant, they will remember you as the person who they discussed their favourite sports team with, or the person who recommended them an amazing cafe that they've now added to their list. INTERESTS WILL MAKE YOU STAND OUT, I guarantee it. **Obviously, it can be negative depending on what you write, so be REALLY selective of what you include in your interests** (for example, don't include things like Anime or Manga, or the shooting range, or reading Holocaust novels, or your weapons collection, or anything political or religious, or anything you don't want to discuss during an interview - KEEP IT LIGHTHEARTED). I would make your interests 1 or 2 lines maximum on your resume, and don't go into detail (just list them out - for example, my interests on my resume are listed as \"Interests: Motorcycles, Warriors lacrosse, console and PC games, comedy shows, arcades, & searching for the perfect espresso.\") So basically, include them if you want, but if you do include them, make sure they aren't negative or controversial topics if it's brought up in an interview.\n\n# AVOID COMMON MISTAKES\n\n* \"References available upon request\" or adding references to your resume, is a BIG no no for North American resumes. Why? Because 1. it's assumed that you have references available on request, so including that is unnecessary, and 2. You don't want the company contacting your references if you've listed them, PRIOR to letting your bosses know, which is usually after you've received an offer, and 3. You don't want your references, whom have so kindly agreed to be one for you, getting inundated with calls or emails from the companies you're applying to, prior to the offer stage. Imagine applying to 50 companies, and all 50 call your references. Ouch. They won't be your reference for much longer.\n* Is your job across two pages? Nope, that's not going to work! I hate when I see a jobs bullet points going onto the next page. In my opinion, it's messy and just says \"poor formatting\".\n* **DO NOT MAKE YOUR RESUME TOO FLASHY! STOP WITH THE COLOURED TEXT!!** (this applies to non-design resumes only) Black text ONLY, with the exception of your name, contact information and section headers. You can put those in a colour other than black for a tiny bit of a \"pop\", but nothing overly in your face like red or bright pink. I personally use a dark blue, or dark green, or dark purple for the contact info and headers - DO NOT USE LIGHT COLOURS if you're going to use any at all. But objective/experience/skills/education etc, all the actual sections (not section headers) must be black text ONLY.\n* You absolutely should not have any images, and there should NOT be any background colour or background images whatsoever.\n* Do not use tables on your resume. That won't pass ATS and it looks pretty bad honestly.\n* Don't include a paragraph at the end along the lines of \"thanks for your time, please call me on 555-123-4567 if you have any questions or would like to set up an interview\". This isn't a cover letter. And even if it was, don't include your phone numebr or email in the cover letter body, that should be included with your contact details at the top of your cover letter, which should match the same format of your resume.\n* If you're going onto a second page, include the exact same name and contact information format as you have on your first (and other pages if outside of the US where more than 2 pages is common).\n\n# FINAL STEPS - SENDING YOUR RESUME\n\n* **NAMING YOUR RESUME:** And I'm not talking about naming him Resume McResumeface. Your resume name should be \"Firstname Lastname Resume\". Don't include the job title on there, or any periods, underscores, or any other information. \"J\\_Smith Customer Support Rep. Resume V2 Final\" is everything wrong with a resume title. I hear you asking, \"But holly948, how do I have multiple resumes then for the different jobs I'm applying to?\".\n* **ALWAYS SEND YOUR RESUME AS A PDF DOCUMENT!!** If you send it through as a Word document, their computer could mess with the formatting and it could ruin the perfect look of your resume. PDF will ensure they view it exactly how you have designed it to look. Sending through as a Word doc could ruin all of the hard work you put into the formatting. Devastating!\n\n# COVER LETTERS\n\nI'm sorry that's not my area, and I loath cover letters with a passion. Write them or don't, whatever. I personally never write cover letters as I find they are a waste of my time.\n\n# AKSHUALLY...\n\nLastly, I hear many of you about to furiously get into the comments with \"but my experience was...\" and \"in my opinion, you should...\", and \"actually, I think...\" and I get it! There is no \"one perfect way\" and everyone has different opinions. **This entire write up is in MY opinion and MY experience.** I'm not saying don't comment, just, please take this post as my opinion rather than \"it must be done exactly how I say or else you're never getting a job and your resume sucks\". Do whatever you want, man. Different things work for different companies and industries. This is my own general advice, and I know with resumes there is no \"one size fits all\". No two resumes I do are the same, because it comes down to the individuals experience, education, interests, what they're applying to and so many other factors. I'm just giving free advice from my own experience, in my own opinion, to serve the majority of people updating their resumes (primarily in North America).\n\n\\~\n\n**TL;DR** \\- **if you want to improve your resume, then I've given you everything you need minus the template.** **However, I'm doing up a template at the moment, and will share with you all, hopefully this weekend.** I want to give you all of the tools you need to succeed.\n\n*Enjoyed my advice from this post and/or the last? You can buy me a coffee!* [*https://www.buymeacoffee.com/holly948*](https://www.buymeacoffee.com/holly948)\n\nI sincerely hope this has helped, and I wish you all the best of luck in your job searches!",
    "title": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2]",
    "subreddit": "jobs",
    "timestamp": 1676641102,
    "score": 22,
    "keyword": "american director"
  },
  {
    "text": "Need help for quitting job without bond issue Hello. I worked as a scribe in augmedix bd (bangladesh) and had signed a 18 month stay bond with the company. But after starting working, the I started having lots of health issues. I was working at the nightshift live with american doctors. Due to excessive workload without any break due to live work, i developed severe hand pain similar to carpal tunnel’s. I informed the company and got switched to day shift later as it was not live. Initially they were maintaining work limits but after some days, they again started giving mor e and more works. Which again worsened the hand issue. I mentioned this and asked for help. They told me that they will take care of it and will maintain the work load accordingly. Despite this, they continued to increase the work load. One day, it felt like my hand muscles tore and I had to stop working. I went on sick leave and submitted all the medical documents. A few days later I contacted the manager and wanted to discuss the future of the work. But he was in usa for a meeting and would return after more than a week. In the interim, i went to the office to see if i can work again, but although i had complained and sick, they still gave me additional scribing even though knowing my case. For this, i emailed a resignation to my manager. But he told me about the bond. Later the director joined the mail and threatened me about legal consequences and also told me that i was supposed to inform them very early if this was a major issue. This made me furious as i already informed many times. And because of the threats i decided to immediately stop joining the office. There were not any issues for 8 months until a day before yesterday, i received a mail from the hr that is have been missing work since April and had breached the bond. For this, he asked me to join back or pay the huge amount mentioned in the bond on a per rata basis. Also it should be dealt with within 7 days. Now is this legal to bond employee in a company even after medical issue. Also what should be my next step. Many are telling me that they can’t do anything as you had proper reasons. I am unsure as I have only 5 days left to solve this matter.",
    "title": "Need help for quitting job without bond issue",
    "subreddit": "jobs",
    "timestamp": 1702025143,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "A huge problem # Looking for employment is challenging, and it is made more difficult if you have a visual impairment. However, keeping that job, if it involves proprietary company software or any software, can also be problematic. Why? Some software updates affect the interaction between the screen reader and the application, making the software impossible or difficult to use for those with visual impairments. And these software updates can often take awhile to be effectively patched because generally the developers have higher priorities, and the legal requirements that would enforce a quick fix don’t seem to currently exist.\n\nDisclaimer\n\nI want to make it clear that this is based on some research I have done. I am not a lawyer. So, do not take this as legal advice.\n\nI am also in no way targeting any person specifically.\n\nWhat does the job Accommodation Network Say?\n\nPer what I was told by the accommodation Network an accommodation does have to be made. However, there is no time limits for employers to address and fix the problem. It does state it should be done expeditiously, but again there is no timeline of 30 days or 60 days for an example.\n\nThere is also no requirement by the Equal Employment guidelines or disability guidelines that requires a work case must be set up or some kind of paid leave should be done while it is being worked on.\n\nAs in there is nothing listed under the employment section of the Americans With Disabilities act, or the EEOC rules.\n\nWhat this means is that if you are blind, and your employer’s software becomes inaccessible You really don’t have much of a leg to stand on. As long as they can claim that it’s being worked on The company is safe from any kind of legal action.\n\nThe full excerpt from the EEOC is as follows, An employer should respond expeditiously to a request for reasonable accommodation. If the employer and the individual with a disability need to engage in an interactive process, this too should proceed as quickly as possible.(37) Similarly, the employer should act promptly to provide the reasonable accommodation. Unnecessary delays can result in a violation of the ADA.”\n\nReasonable accommodation claws of the Equal Employment guidelines\n\nThis clause isn’t specific to the digital space, and it’s essentially up to the good will of the employer whether they’ll abide by the spirit of this reasonable accommodation requirement, instead of ignoring it, or making a half-hearted effort to abide by it.\n\nThere are a number of problems with this. To start with it makes job security very concerning. In some cases an employee may be put in a situation where they have to leave. Paid leave is not required, and an employee still has to pay their bills. In a worse case they can end up losing their home due to bad development practice that was not their doing. Your landlords, insurance, utilities and grocery stores are not going to care whether or not something is preventing you from working.\n\nOther issues is the employee may end up needing to use their paid time off earned just to make sure bills are paid. Keep in mind that some employers don’t give you things such as Vacation days, sick days, and other types of paid leave days. They may just offer paid time off, and unpaid time off. Therefore, in positions like those it’s down to the employee to decide how they will manage their paid and unpaid Time off.\n\nIt also should not be down to the said employee to convert paid time off into a cash out all because of a piece of software not being developed with the blind or visually impaired employee in mind. That employee earned their paid time off. They should have the right to use it for what ever days off they need. Not have it set aside for a problem that was not their doing. Even someone blind is going to have dreams, and interests that they would like to do. Part of which may need to use that paid time off to go and enjoy those dreams. Those things could include but are not limited to going to see a sport event, getting married, going to see a musician or band at concert or moving into a new house.\n\nOne more problem that cashing in your paid time off can pose is denial from promotions. Companies that list internal promotions may have a strict application requirement of X number of paid time off hours and Y number of unpaid time off hours. If you had to cash in your paid time off your balance of paid time off hours may be below that require number. It may also affect your situation in other ways. Some companies have some policies in place that if your paid time off or unpaid time off balances dip below a certain number you have to do something. Maybe return back on-site instead of working from home, or other things. This will differ from company to company.\n\nEthically speaking it can look bad, because it allows an employer to take advantage of their employee. The EEOC just states an accommodation must be made. With no firm time limits to have it completed with in, no paid leave requirements and proof not necessarily being required or enforced it’s open ended enough that if an employer can wait it out by just giving an employee voluntary time off it’s giving the employer a way to legally push an employee out of their job.\n\nAnswers to potential questions\n\nWhat about just looking for a new job or part time job?\n\nLooking for a new job or even a part time job would still take a long time. It’s difficult to find a job if you are blind or visually impaired as I have already mentioned above. Therefore, looking for a different job is not going to solve your immediate problems.\n\nWhat about a different department or position until it is fixed?\n\nThe Job Accommodation Network agrees that this is definitely an option whether the position is temporary or permanent. However, it may not be applicable in every situation. Some companies use the same software across several or all departments. What may be different is the position and the level of control someone has over the software. This may not solve the accessibility problem, because if a company is using the same software across different departments, it’s possible the software accessibility problem will still appear. And that’s stipulating the employer is interested in finding other work for the employee.\n\nRent assistance and Utility assistance\n\nApplying for assistance for rent or utilities is possible. However, organizations that provide these kinds of assistance often have stringent requirements. Depending upon one’s position and how much they make it’s not for certain if they will receive any assistance. Those same organizations may also only provide a 1-time assistance payment. Again, as mentioned above there ’s no firm time limits an employer must abide by to have a solution for the employee.\n\nWhat about selling something?\n\nSomeone in that position may be able to pawn or sell something provided they have something worth selling, but it’s not the person’s responsibility in that situation. Imagine if it was a family member of yours that had to sell the graduation gift you gave them. You probably wouldn’t appreciate the fact they had to sell that valuable item that may also hold sentimental value as well.\n\nUnemployment or short-term disability\n\nUnemployment will probably not work, because you’re technically still working. When it comes to disability pay that’s different from case to case, and even that is not a guarantee, and it’s only ever a short-term solution.\n\nWhat about borrowing money?\n\nThat said employee should never have to borrow money in a situation like this where they have no clue if there  will be a solution with in a timely manor. Lenders charge high interest rates, and not everyones financial situation allows them the chance to borrow money.\n\n**Blind Employment Statistics**\n\nDepending on what statistic you look at, the unemployment rate for the blind is as little as 30%, or as high as 75% (Information dated around 2010 from the American Federation for the Blind states that the unemployment rate is around 75%). However, these higher estimates include anyone with a visual impairment over the age of 16.\n\nThe U.S. Bureau of Labor does not group unemployment by disability. A more accurate estimate is between 30% and 40%. Dr. James Nyman, former director of Nebraska Services for the Blind, estimated in March 2009 that 30 percent is a more accurate reflection of the unemployment rate among the blind people who want to work but can’t.\n\nA post made by the National Federation Of The Blind estimates the unemployment rate at around 32.5%.\n\nJob Accommodation Network and ADA\n\nHere is the link that sources my information. If any representative or politician is reading this I humbly ask to start looking into getting this fixed. [https://www.eeoc.gov/laws/guidance/enforcement-guidance-reasonable-accommodation-and-undue-hardship-under-ada](https://www.eeoc.gov/laws/guidance/enforcement-guidance-reasonable-accommodation-and-undue-hardship-under-ada)\n\nIf you’ve finished reading this post all of the way I want to say thank you for reading. If it is not too much to ask may you please share this? Ideally it would be great if this can be seen by our law makers, and the more the post is shared hopefully there’s a better chance it will be heard.",
    "title": "A huge problem",
    "subreddit": "jobs",
    "timestamp": 1676312281,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "I think my job is conspiring to try to fire me. I need opinions and advice. I’m a transporter at a hospital local to me that I live 4 miles away from. I love my job and what I do. Right now I’m at Per-diem status. I started there in the middle of March. From when someone starts working there, probation is 90 days. Today would be 117 days from when I started. So technically, I’m supposed to be off probation. When I first started, I let my manager know I have ADHD. Despite my ADHD, I do my job well I believe. I always would talk with my manager sometimes and I would ask him for feedback on things that I may be doing wrong if there is anything that I’m doing wrong and they were never any complaints except for one maybe. But I was spoken to about that, and I was never written up for it. I want to Advance in this job, and eventually become full-time. When you become part time or full-time, you have a union benefits and start to build a pension at the 5 year mark. I went to human resources because I wanted to ask about union policies for whenever I become part time at the least, which I thought we could possibly be soon. They gave me the reunion representatives number and I reached out. When I reached out to the union representative about openings that are posted she told me that I am not eligible to even apply for these jobs because I’m still on probation even though it’s been 114 days at the time when I reach out to her. I thought maybe she’s mistaken because she only saw me once or twice and the first time she saw me was within my first two months I’ve already being there. I’m thinking there’s no way I can be on probation still. I was talking to one of my supervisors who is the lead transporter. They told me if I go to human resources the next day they would be able to tell me if I am on probation still or not. Me personally, I didn’t believe I was but something in the pit of my stomach told me to just go because I asked the union rep; lisn’t probation only 90 days?” And she replied; “if it wasn’t extended” my reply to that was “nobody ever informed me of my probation being extended so I don’t think I’m on probation still. Thank you for your time.” I didn’t get an answer, of course. Next day when I went into work, I went to human resources first thing. I got there early so I can speak to human resources. When I went to human resources, they looked up my name and they told me that I was still on probation and then they asked me how long I was there for in terms of how long I’ve been working at the hospital. I told him I’ve been there for just about four months now. They told me that it’s weird that it says I’m on probation and they don’t know how long it is until I’m done with it apparently. Technically, my manager extended my probation behind my back. I believe it’s in retaliation because he tells me when I’m at work I am great at what I do. I have ADHD and my hyper focus is intense when it comes to thinking about getting a permanent full-time or part-time spot. I know if I get part time, at least I’m next in line for full-time. The retaliation I’d believe though is from me taking a job on the weekends at a beach doing security 12 PM to 10 PM Friday, Saturday and Sunday.. which started on Memorial Day and ends Labor Day. During my interview, I was asked if I would be able to do weekends and holidays and I said yes. At the time I was able to due to the circumstances however, I left my other job which wasn’t convenient for me with the schedule because it was a part-time job Monday through Friday 1 PM to 5 PM during the school year only. They never had intentions on making me full-time because it was a civil service job and they did not want me on the collective bargaining agreement and he did not want to pay me benefits. I was doing security at a public library. I figured if I could work at the hospital anytime between Monday through Thursday and overnights on the weekends, potentially and holidays. It would work out. The hospital for per diem only allows 25 to 30 hours a week maximum unless there are extreme circumstances. I have text messages from my Manager saying that he wishes I can call out every weekend. And that he would give me a 12 hour shifts. There were some unsatisfactory readings on my 90 day evaluation and I believe it’s because the retaliation of not being able to work during the day on the weekends. I think it’s very unfair and I don’t know if the Director of my department was in on it or not. However, I know the directors and managers are not union. Not quite sure why but that’s how it is with them. Anyway, I’m just beside myself because my probation was extended and it has been for a month now I believe this coming Tuesday. They wanted to extend it another three months. I believe they’re conspiring to fire me because they’re unhappy about the fact that I’m not doing weekends and that they are trying to be sneaky about it. I made a stink about it to one of my supervisors saying that it’s not legal for them to just have me on probation without talking to me about it when they decided to do it and they are in a breach of contract. My supervisor called me while I was doing a run and told me that the Director wants to speak with me when I am done with my run. This was Thursday that passed this week July 6th. He spoke with me about my probation being extended and he told me that I need to call my Manager on Monday and have a meeting with them both and he asked me if I was working there on Monday. I told him I’m not working I was not given any hours. He told me to call my boss first and see if he would be able to have a meeting with him and me…. I truly believe they’re trying to manipulate the situation because they know that if I go to human resources, they might get into some serious trouble and I think they’re trying to avoid at all cost. However, I’m not buying it. I plan to go to human resources on Monday morning. And make a complaint. I plan if I have to take extreme measures to get an attorney involved if for some reason they keep me extended on my probation and don’t lift the extension on it and eventually sue if I get fired for discrimination on my ADHD. According to the American with disabilities act because I know I am protected under that.",
    "title": "I think my job is conspiring to try to fire me. I need opinions and advice.",
    "subreddit": "jobs",
    "timestamp": 1688865100,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "How do I start over at 35 in software engineering? My background: I graduated in STEM from a well-known North American university and currently living on the West Coast. Upon graduation, I immediately started a SaaS start-up with a close friend. I serve as the CTO and my friend CEO. I self-learnt web development and developed the product all by myself for a few years before we raised enough money to hire more employees. Gradually, I transitioned towards a leadership role rather than coding. I'd be responsible for hiring senior devs and managers, participating in high-level product decisions, and generally help everyone solve problems in coding, UX/UI, delivery processes. I am still coding once in a while, but I don't have enough time to get really deep into anything new. After a little more than a decade, we grew it to a sizeable company of around 50 people and recently sold it to a large investment firm.\n\nThe parent firm already signalled that they wanted us gone ASAP so they could install their own management. I also think it's a good time for me to move on to a new venture anyway. But I'm having a hard time deciding what to do next. My whole adult life has always been with my start-up and I don't think I've ever applied for any full-time job before, besides a few internships in college. I will list a few thoughts here hoping someone could help me process them.\n\n\\- My earn-out from the sale was decent and enough to sustain myself for quite awhile, but it's nowhere near enough to live comfortably while being unemployed.\n\n\\- My friend already wanted to jump on a new start-up with me. But tbh, the ideas of sleepless nights and financial uncertainties don't appeal to me as much now as in my 20s. In the case I do start a new start-up, I want to invest my own money this time instead of raising VC money. So I need to conserve my fund.\n\n\\- I can apply for a smaller role in another firm, maybe a senior software dev? This allows me less stress responsibility-wise while still having a decent pay so I don't have to eat into my fund. It also gives me time to develop myself technically and find ideas for my next startup. But does it look bad that a CTO's next job is going backward to a dev role?\n\n\\- I can also do a lateral move to a management role in another firm. Maybe a VP or Director of Engineering? This will obviously make the job-search process more rigorous and the job itself will be quite stressful again. But the pay will be much better and it will look better on my resume.\n\n\\- I can also go back to school? Maybe a Master in AI or ML. I never had a chance to study properly in university because of money. I had to take random courses to work and graduated very early. Also going back to school is a good excuse to have some gap years in my resume while starting a new start-up.\n\n\\- I've always been a more product-focused CTO rather than a technical one. I've always considered coding a tool to solve problems, and learned them as I needed. I think I lack deep understanding of many programming disciplines such as languages, best practices, Dev Op, etc... I only knew what to use to solve what problems come my way. I'm good at understanding business needs and develop the right products, and lead people to collaborate on them. Knowing this, I'm not sure which role will suit me in the \"real\" world.\n\nI'm open to advice and criticism. Please feel free to let me know what you think, good or bad (:",
    "title": "How do I start over at 35 in software engineering?",
    "subreddit": "jobs",
    "timestamp": 1703139957,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "2024 MS Grad Seeking Career Advice - When to apply for jobs with June 1 start? Where do my skills fit best? Looking for general advice on when to start applying for full time employment with a start date of June 1, how to network - MS grad student graduating May 2024  \na) interested in tech, management, economic, sustainability consulting / think tank / research type work  \nb) looking for full-time post grad school employment, finishing up my Master of Science in Applied Economics and a Graduate Certificate in Community Resilience and Planning May 2024, BA with Honors in Geography and Geospatial Technologies graduated May 2023 (finishing my Masters and Bachelors in 4 years total)  \nc) geography: currently attending the University of Vermont in the US, looking for employment in Midwestern US (Chicago, Detroit, Minneapolis, etc)  \nd) résumé    \nEDUCATION  \nMaster of Science. 2024. Community Development and Applied Economics, University of Vermont. GPA: 3.88/4.0  \nCertificate of Graduate Study. 2024. Community Resilience and Planning, University of Vermont. GPA: 4.0/4.0  \nBachelor of Arts with Honors. 2023. Geography, Geospatial Technologies, Honors College, University of Vermont. GPA: 3.89/4.0\n\nRESEARCH ASSISTANTSHIPS  \nGraduate Research Assistant, Community Development and Applied Economics,  2022 – 2024.  \nGeographic Information Systems Technician, Spatial Analysis Lab. 2021 - 2022   \nTechnical Research Assistant, Geography, 2021.\n\nTEACHING ASSISTANTSHIPS  \nGraduate Service-Learning Community Partner Coordinator, PA 6170: Systems Analysis and Strategic Management, 2024 \\*\\*accepted to position starting January 2024  \nGraduate Teaching Assistant, CDAE 002: World, Food, Population and Development, 2023.  \nUndergraduate Teaching Assistant, GEOG 060: Geography/Race and Ethnicity in the United States, 2023.\n\n  \nRESEARCH  \nApplication of Social, Economic, and Behavioral Science to Water Resources Prediction, Cooperative Institute for Research to Operations in Hydrology (CIROH). 2022 – 2024.  \nContributed to the development of a forecast design center aimed at exploring the heterogeneity of risk perception and behavior, as well as decision heuristics concerning water hazard mitigation. Played a key role in organizing and hosting empaneled focus groups with stakeholders in the Winooski Watershed in Vermont. Collaborated on the creation of a nationwide survey focused on public flood risk perception, utilizing the Extended Parallel Process Model (EPPM) as its framework. Responsible for data cleaning and validation in R and STATA, while also maintaining version control through Git Lab. Conducted an analysis of survey data using Exploratory Factor Analysis (EFA) to create a supervised Structural Equation Model (SEM). Will continue to analyze survey data by creating an unsupervised SEM in BayesiaLab and comparing the validity of the supervised model to the unsupervised mode.  \n\n\nSocial Relations, Second Homes, and the Space Between “Insider” and “Outsider” in a Rural, Amenity Rich Community, Honors Thesis with Distinction and College Honors in Geography,  2021 – 2023.  \nInitiated an independent research project examining the social dynamics between primary and secondary homeowners and the affordability of housing in a high amenity community in Northern Michigan. This involved independently formulating a research proposal and successfully navigating the Institutional Review Board (IRB) process at my university. Conducted nine separate focus groups, transcribed data, and performed qualitative coding of the information through NVivo. Additionally, analyzed National Low Income Housing data using SPSS to investigate whether an increase in second home ownership was associated with higher housing prices.  \n\n\nImpacts of plastic bag legislation on consumer behavior in the United States: Evidence from a statewide survey in Vermont. 2022.  \nConducted data collection and an extensive literature review on plastic and paper grocery bag legislation in Vermont. The data were analyzed using SPSS, drawing from the annual Vermonter Poll survey conducted by the Center for Rural Studies, in order to reveal Vermonter preferences regarding payment for paper grocery bags.  \n\n\nAlliance for System Safety of UAS through Research Excellence (ASSURE) A28, University of Vermont Spatial Analysis Lab, Federal Aviation Administration. 2021 - 2022  \nContributed insights into the safe and secure integration of Unoccupied Aircraft Systems (UAS) into the disaster preparedness and emergency response and recovery sectors. Conducted an extensive literature review on emergency response in the United States from 2000-2020. Gathered and organized data pertaining to the utilization of UAS and helicopters for FEMA-declared disaster responses. Qualitatively coded interview data with the aid of NVivo. Compiled and presented reports to FEMA and the FAA.  \nMapping American Childhoods, 2021.  \nExplored historical geographies of childhoods, with a particular focus on the examination of child labor and compulsory schooling laws in the United States during the early twentieth century. Transformed historical data into CSV format using Excel. Employed ArcGIS to present the converted historical data in map format. Generated data visualizations for academic presentations through the use of Tableau.  \nCERTIFICATIONS  \nResponsible Conduct of Research (RCR), Collaborative Institutional Training Initiative (CITI) Program.  \nSocial-Behavioral-Educational Researchers, Collaborative Institutional Training Initiative (CITI) Program.  \nIRB - Human Subjects Research, Collaborative Institutional Training Initiative (CITI) Program.  \n\n\nHONORS and AWARDS  \nHonors Thesis with Distinction, 2023. University of Vermont.  \nCollege Honors, 2023. University of Vermont.  \nPeter Young Award for Excellence in Geospatial Analysis, 2023. University of Vermont.  \nDr. Kim Monteaux de Freitas Women’s Empowerment Award, 2023. University of Vermont Fraternity & Sorority Life.  \nPresidential Scholar, 2020 – 2023. University of Vermont. Dean’s List Scholar, 2020 – 2023. University of Vermont.  \nGamma Theta Upsilon. International Honor Society in Geography. Inducted member.  \n\n\nPRESENTATIONS  \nGuest Lecture, “Rural Resilience,” Interdisciplinary Perspectives on Community Resilience, Champlain College. 2023.  \nSocial Relations, Second Homes, and the Space Between “Insider” and “Outsider” in a Rural, Amenity Rich Community Rural Sociological Society Annual Meeting. August 5, 2023. Burlington, VT.  \nStudent Research Conference 2023. Honors College, University of Vermont.  \nHonors Thesis Defense with Distinction, 2023. Honors College, University of Vermont.  \nInvited Panelist, 2023, Undergraduate Research Experiences, University of Vermont.  \nInvited Panelist, 2023, Department of Geography and Geosciences, University of Vermont.  \n\n\nLEADERSHIP:  \nVice President, University of Vermont Outing Club  \nDirector of Communications, University of Vermont Outing Club  \nLeadership Development Program Coordinator, University of Vermont Outing Club  \nOutdoor Orientation Head Leader - Mountain Biking, University of Vermont Outdoor Programs",
    "title": "2024 MS Grad Seeking Career Advice - When to apply for jobs with June 1 start? Where do my skills fit best?",
    "subreddit": "jobs",
    "timestamp": 1703093351,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Chances I'll get an offer? I'm an expat in southern Europe,  applying for a director level role at an American company with a local base.\n\nOn paper I'm an excellent fit, with no obvious gaps mentioned so far.\n\nTold I would hear the outcome in 4 days - but the suspense is killing me (and my savings!).\n\nRole is WFH, with a requirement to be near the city - so the limited applicant pool works in my favour.\n\nProcess has taken 7 weeks. Interviewed by 4 people, excluding recruiter. Interview with my future boss went very well, almost got the impression he wanted to hire me on the spot.\nFeedback from recruiter was glowing. \n\nOther 3 interviews were soft, more like \"meet the team\" types. One of the interviewers would report to me, one was a skip level. \n\nThe role has continued to be live on LI and their careers page all this time, even reposted 1 day ago.\n\nJust based on these signals - what's my % chances  on the likelihood of an offer?",
    "title": "Chances I'll get an offer?",
    "subreddit": "jobs",
    "timestamp": 1699691438,
    "score": 0,
    "keyword": "american director"
  },
  {
    "text": "My daughter’s dad making his other daughter (4F) “pose” for photos makes me feel so uncomfortable It’s always “full body” poses - arms and legs up and out like a star, her face blank as she concentrates on following his instructions and the expression is incongruous with the exuberant pose. This really gets me. I’m seeing that she isn’t old enough to say no when someone is telling her what to do with her body on camera. \n\nOr, her lying on the bed arms up and together, legs together too like a pencil, and him weirdly towering over her for the photo. Like, you can literally see his crotch in the photo. \n\nIt makes me so fucking uncomfortable. We’re not together anymore and when I asked him about it, he doesn’t give a straight answer. In fact, if you do some statement analysis, you can see he is being deceptive. Me: “Did you ask her to pose?” Him: “it would go something like this… I would say…” He is very deceptive and manipulative.\n\nI don’t know if I’m reading too much into this as he’s had 3 separate previous allegations (that I know of, one being me) of rape/sexual assault. One was a number of years ago by a child (I don’t know the age) - he was arrested but not charged, the police notes at the time (seen by me many years afterwards) implied the complainant was an unreliable witness from what I recall. This was the SA, the rape allegation came from his ex during the custody battle. \n\nThere’s also the weird thing that I have to repeatedly tell him to put a skirt or dress if wearing tights. He will just put them in tights and a top. At first I thought (and could still be true) he just didn’t understand tights weren’t leggings, but this is repeated. When I picked my daughter up like that most recently, he insisted the top was a dress. Then the next week he handed me a dress of hers and said “here’s the dress I thought she was wearing last week” - suspicious change of story. \n\nI just get “porn director” vibes from it, although to be clear I do not think any CSA is occurring. I’ve recently heard of the gift of fear and we shouldn’t ignore our gut. I’ve also recently genuinely realised he meets the criteria for a psychopath - I was shocked to my core he didn’t feel any guilt or distress when he caused our daughter real injury (he placed her on a window ledge whilst he was there but she still fell and hurt herself) or how he didn’t feel bad when she was crying when her bottle was blocked and we took a while to realise (nobody’s fault but I still felt so bad for her suffering needlessly). \n\nAm I overreacting? Would this make you feel uncomfortable too? He asked me “don’t you tell our daughter to smile for photos? What’s the difference?” But we know he is a gaslighting and manipulative POS.\n\nEdit - thank you all so far for your replies. I should’ve said, I am in the UK (but appreciate any American based advice, since I can translate it to the UK equivalent) and my daughter is 21 months. And as much as this disgusts me to write this, he liked me calling him “Daddy” in sexual circs, this made me uncomfortable but I assumed it was normal. I’m not sure if this is to do with it or a red herring.\n\nEdit 2 - A couple of other things. At a bonfire thing we went to, there was a child who was talking to us when we were sat down outside eating. My ex was trying to feed him some of his food off his fork he’d been eating on, without consent from the parents who I think were right there! That was a really weird thing to do and made me really uncomfortable.\n\nAt a homeschool meet up, he would be particularly friendly with this one kid. We saw her at a birthday party in a childrens’ soft play area (we had crawled in as our daughter was only a baby so obscured from the parents watching area) and he acted so happy to see her and wanted to give this girl a hug/fist bump. It was OTT. He didn’t know the kid hardly at all.\n\nWhen saying goodbye once, he made daughter 1 give daughter 2 a kiss, give him a kiss, give me a kiss; then repeat for daughter 2 to 1, to him, to me; then for me - ending with him telling me to give him a kiss - which I refused. \n\nHe often has a “Krusty the klown” type laugh when playing with the girls. Just exaggerated. He can’t own ANY mistake of his or even any suggestion of a mistake.\n\nEdit 3 - I did not know about the previous child sexual assault allegation until pregnant\n\nEdit 4 - He has previously been assessed in family court in light of the sexual assault allegations against a minor and rape allegation with his ex as being suitable for 50-50 custody of his daughter.",
    "title": "My daughter’s dad making his other daughter (4F) “pose” for photos makes me feel so uncomfortable",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1674768432,
    "score": 318,
    "keyword": "american director"
  },
  {
    "text": "Pregnant- how to tell my (American) boss - need advice Hi ladies, looking for some advice on handling the conversation with my manager about my pregnancy. Ideally from someone who has been in the scenario (on either side!) but any advice gladly taken. \n\nSome background- I am working for a large American company for just under a decade, but I am European and living in Europe and my contract is European. I have one child already - I took maternity leave from Dec 2021 to end July 2022. So I’ve been back at work over a year now. All my performance reviews have been exceeded expectations. \n\nAbout the job- my role is global though my manager and direct report sit in the US. I started as a junior member of the team and I’ve been running the team since end 2019. However, my career growth (read: pay) has been relatively stagnant because I’ve been very unfortunate- I’ve had at least 1 new manager a year and so each new manager I need to prove myself to, and they assume that my tasks are my “job” even though I’ve been steadily expanding my role every year. My job title has not changed since my old manager left and I took on her duties. \n\nAfter returning from maternity I was in the unique situation to be reporting back to a manager that I have previously reported to. I’m still on very good terms with my last manager and asked her opinion on career options/payrise. She said she had recommended it before her move. She advised me to ask about it immediately after returning, phrasing it like I had a lot of time to think on leave and I’m ready for the next step and my title should reflect my actual job. This went surprisingly well and my title was updated in the next month, along with some (seemingly) solid steps to getting to the next level.  \n\nHere’s the problem- I never got a payrise. When I expressed my disappointment with this, I was told it was in progress, they are different processes. A few months later I was told it was paused because annual review process was underway. Then there was a hiring freeze. Long story short this payrise has been dangled for a year with no update. My direct report is now basically outearning me (if you consider take home pay). I don’t begrudge her- I fought for her payrise. \n\nMy worry is the second I tell them I’m pregnant again, any hope of the payrise, and the move to director level disappear. There’s no guarantee that it’ll be the same boss when I return. I’m half thinking I say this outright- that I’m unhappy with the progress made and it’s making me reconsider my position but I cannot come down too strong as I have no intention of leaving right now. I feel like I rushed back from my first maternity leave and it made no difference. It’s making me second guess how long I should take this time. \n\nSorry for the long read, would love your advice!",
    "title": "Pregnant- how to tell my (American) boss - need advice",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1694000630,
    "score": 11,
    "keyword": "american director"
  },
  {
    "text": "A group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by Chinese nationalists \nChinese women economists who met Janet Yellen on Beijing trip called traitors and ‘American spy’ online\nA group photograph of the gathering posted to China’s Twitter-like Weibo was used to identify some participants.\n\n\nA group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by online nationalists for betraying their country by interacting with the US official.\n\nWhile the Treasury department skipped identifying attendees from the meeting on Saturday, a group photograph of the gathering posted to China’s Twitter-like Weibo was used to identify some participants. It was not clear who first shared the image online.\n\n\n“There’s no such thing as a free meal,” wrote Shen Yi, a professor in international politics at Fudan University, who has over two million followers on the platform. “They’ll need deliver KPIs in exchange,” he added, using the acronym for key performance indicators, implying the women would have to give something to the US government. \n\nThe criticism mostly targeted two women who posted about their experience on social media: Liu Qian, the Economist Group’s managing director for Greater China, and author Hao Jingfang, who previously worked for the China Development Research Foundation, which is managed by a branch of the State Council.  \n\n\n\nIn a now-deleted exchange, one Weibo user asked Hao, whose award-winning novel Folding Beijing is widely considered to be about income inequality in the capital, why she attended the dinner. Hao replied: “Because Yellen is the friendliest American official, she’s always dedicated to developing friendly China-US relations.”\n\nSeveral users accused Hao of being an “American spy,” while a post that garnered some 600 comments criticized the elite status of the women selected, saying “they have not worked in factories.”\n\nYellen’s exchange with women economists and entrepreneurs telegraphed the importance she places on female representation in elite decision-making. During her four-day trip to Beijing to stabilize ties with America’s biggest rival, the Chinese government exclusively put forward male officials to meet the first woman to run the US Treasury, according to publicly available information. \n\n\n“I see it all the time when I’m almost the only woman in the room,” Yellen told the women. “I’m sure many of you have that same experience at decision-making tables.”\n\nPresident Xi Jinping excluded women from China’s top leadership at last year’s congress for the first time in 25 years. Furthermore, as China struggles with a record low birth rate, women are being encouraged to take on more traditional care-giving roles. \n\nThe backlash against the women echoes attacks waged by online nationalists against foreign female journalists of ethnic Chinese origin working for Western news organizations. \n\n“Attackers routinely disparage their coverage of China and make crude sexual innuendos, including alarming threats of physical violence,” the Foreign Correspondents’ Club of China wrote in a report last year on the issue. \n\n“Women’s participation in the workforce is one of the major drivers of creating inclusive growth,” the Treasury said in a statement after Yellen’s meeting. “Women’s contributions to economics, in particular, are important to help ensure that economic research and policymaking appropriately reflect society’s priorities.”",
    "title": "A group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by Chinese nationalists",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689066373,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "ABIM proposes a pilot program for FMG to obtain IM certification without US residency The ABIM Council—which comprises the chairs of the individual specialty boards and advisory committees, as well as public and patient members—is exploring the idea of pursuing a pilot program to create a pathway to initial certification and MOC for international medical graduates (IMGs) who have completed their internal medicine training in another country and then completed accredited fellowship training in the U.S. The Accreditation Council for Graduate Medical Education (ACGME) has established criteria for exceptionally qualified internationally trained residents to enter accredited fellowship programs and continue if they are successfully assessed on the core competencies of ACGME and the American Board of Medical Specialties (ABMS). Physicians with that training background are currently ineligible for certification/MOC because their residency training is not ACGME-accredited.\n\nUsing the principles of competency-based medical education, a pilot would offer the opportunity to assess the knowledge and skills of physicians who have successfully completed their accredited fellowships as a pathway to initial certification eligibility in Internal Medicine and the subspecialty of their fellowship. Like other ABIM diplomates, physicians in the proposed pilot would need to pass the ABIM Internal Medicine Certification Examination to be eligible for subspecialty certification.\n\nThe Specialty Board discussed the proposed pilot and raised concerns about the alignment of training programs in other countries to core competencies, the possibility of individuals completing a subspecialty fellowship but practicing only in general internal medicine, and the potential for added pressure on program directors. However, most of the group expressed favor for the new special consideration pathway for exceptionally qualified IMG candidates with some safeguards in place, such as including in the pilot some physicians who have already trained with this background in the recent past.",
    "title": "ABIM proposes a pilot program for FMG to obtain IM certification without US residency",
    "subreddit": "medicine",
    "timestamp": 1690407202,
    "score": 201,
    "keyword": "american director"
  },
  {
    "text": "You are Justified. Good evening - I recently made the huge mistake of taking a house supervisor job at one of the bigger local hospitals in my area. What I've seen since doing so has truly disgusted me, so I wanted to post here to let you know:\n\nYour hate for administration is justified.\n\nThey do not care about you.\n\nThey do not care about your ratios and will openly joke and laugh about nurses who try to enforce contract limits.\n\nThere is no magic number - no census - that will satisfy the executive suite.  They are truly insatiable.  You cannot win.\n\nThey absolutely want to gaslight you into thinking your assignment/general staffing isn't so bad.  They will do anything they can to pressure you into thinking you're weak or lazy for wanting your floor to be safe.\n\nAmerican healthcare is legitimately evil.  There is no other word for it.\n\n---------------------------------------------\n\nExact quotes from leadership meetings (you're going to think I'm being hyperbolic. I'm not):\n\n\"Well, nurses care about people so how can we use that to get them to take more patients?\"\n\n\"We're short 16 nurses?  How many sick calls? 3? Well, there you go. They'll blame us but they're assholes who won't show up to work.\"\n\n\"If they complain about taking an admission, tell them to start thinking of these people as numbers, and to start thinking of them as people. That will shut them up.  Say 'what if it was your grandma? wouldn't you want them to be on the floor'?\"\n\n\"I don't care how many boarders there are in the ED.  I don't care if the ICU is out of physical beds. I don't want to hear any of these negative little bitch things.  It's one more patient. There is always room for one more. It's just one more\"\n\n\"All I ever about from the psych ward is 'acuity this and acuity that' like it's so dangerous. I don't want 'acuity' to become the newest buzzword that gets them out of taking patients\"\n\n----------------------------------------------\n\nYour ADO (admission despite objection - or whatever similar unsafe staffing reports - you file are never reviewed.  They don't matter at all.\n\nThere is no reasoning with anybody at the Director level.  Our CEO has set this really harcore objective that we will take every Direct Admit that our Beds department can find. Every single morning, we review every DA call that came in. It doesn't matter if we took in 5 or 30... we skip right past the accepts and review every single denial.  We have had an ED with 40+... 16 boarders for over 30 hours... every nurse working with a ratio of 7+:1... and if we turn down a single DA, we all get ripped up for it. Since our Beds dept is a group who sits in the basement and never provides pt care... it has created a system where they'll just actually accept anything because it's easier than getting punished for not doing so.  It's so toxic, haha.  The whole place is just a bunch of people who can't stand each other.\n\nAnyway, not trying to turn this into a venting session.... I just wanted to share how it really is.  And I work for a place with a reputation for being \"nice and community focused\".\n\nYou will be told over and over again that it isn't so bad. That you need to get over it. That you need to toughen up.\n\nNo.  You are straight being used and manipulated for profit.  It isn't right, and nobody is winning but the executives.\n\nIn our hospitals, falls and sentinel events are way up... patient satisfaction is plummeting.  None of it matters.  I was asked by a Director to investigate why there had been so many falls on our med/surg floor... I said \"well, probably because we have three nurses for 30 patients\" he said \"I can't take that to the board.  I need you to find out why they aren't being trained properly.\"\n\nIt's bad. It's worse than you think.\n\nEstablish unions.  If you're already in a union STRIKE AND FIGHT BACK.  There is nobody looking out for you.  You need to help yourselves.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
    "title": "You are Justified.",
    "subreddit": "nursing",
    "timestamp": 1702784064,
    "score": 404,
    "keyword": "american director"
  },
  {
    "text": "How to keep track of 50 students in a foreign country? I am going to be a resident director for a scholarship program that sends 50 American high school kids to Korea to study the language.\n\nAs a former high school exchange student in Korea, I am very excited, but also nervous about one of the kids potentially getting lost during the 6-week program. Each of them will be staying with a host family somewhere in Seoul, so all of them will have different commutes to and from the study center and to any field trips we would go on. Many of them have never traveled abroad or used public transportation, and all of them will be beginners at the Korean language.\n\nWhat are some ways that I can keep track of the kids' locations so I can make sure that they are safe throughout the duration of the program? I've thought about putting a Samsung Smart Tag (Apple Tags don't work here) on the lanyards they are required to wear 24/7 so that I can figure out where they are if they get lost and their phone is dead, but I'm not sure how feasible or legal that is.\n\nI don't care what they do in their spare time as long as it's safe, but thinking about trying to track down a lost child in a metropolitan area of 25 million people is honestly freaking me out. Do you have any creative suggestions or solutions that you have used on field trips, class trips, etc.?",
    "title": "How to keep track of 50 students in a foreign country?",
    "subreddit": "Teachers",
    "timestamp": 1683085147,
    "score": 6,
    "keyword": "american director"
  },
  {
    "text": "Newly appointed HOD duties Edit: I'm in a non-US school with an American academic director. These were the expectations set up by this director, so I assumed this is how things run in America. I see now that HOD means something totally different in the US than it does where I am from. Thanks anyway for the replies. Learned something new.\n\nSo starting this academic year, I've been appointed HOD of STEM (science, math, and STEM lab).\nLast year was my first year as HOD, and that was just science. I was appointed half way through the year and it was mainly to wrangle things back on course. Not much was done in terms of developing curriculum or improving teaching or mentoring teachers.\n\nThis year I have a reduced teaching load so I can focus more on the HOD part. I have plans, but I honestly don't know if they're enough. I don't want to let my team down, and also I obviously don't want to do a bad job.\n\nHere's what I have in mind:\n1. Weekly review meeting with the whole team. Coteachers can get together and plan for the next week, and I can get their reflections on the teaching for that week.\n\n2. Mini-PD's every week or two weeks. Each teacher on the team (I have 9 team members) will take turns giving a 15-20 minute presentation on a best practice, teaching strategies, new literature, etc., that they would like to.\n\n3. Official observations every couple of months.\n\n4. Short walk throughs weekly? Daily? Monthly?\n\n5. Review lesson plans weekly\n\n6. Review assessments\n\n7. Provide whatever help and guidance is needed.\n\n8. Substitute as needed.\n\nWhat else should I be doing?\n\nI've only got 3 teaching hours a week out of 30. Doesn't seem like I'd be doing much? Once the term begins, it's more of just weekly monitoring rather than much active work, or at least that what it feels like to me.\n\nPlease advise!",
    "title": "Newly appointed HOD duties",
    "subreddit": "Teachers",
    "timestamp": 1691755006,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Happy 4/20, reddit! We are cannabis union organizers with the United Food and Commercial Workers' Union. 🌲🍁 Ask us anything about protecting and organizing cannabis workers! &#x200B;\n\nhttps://preview.redd.it/3pgdd6czpuua1.png?width=1920&format=png&auto=webp&s=00decb343c4376230c89726889db733153f46076\n\nHi r/WorkReform! We're the American Federation of Labor, Congress of Industrial Organizations (AFL-CIO), the largest labor federation in America representing 57 affiliated unions with more than 12.5 million members. \n\nOn 4/20 starting at 1 p.m. ET, Nate Noel, UFCW Local 1189 executive board member and Vireo Health/Green Good shop steward, and Ademola Oyefeso, international vice president and director of the Legislative and Political Action Department at UFCW, will be taking your questions on how cannabis workers are organizing to break industry barriers and defend the workers who make the legal, billion-dollar business possible. \n\nProof it's us: [https://twitter.com/AFLCIO/status/1648063134668673043](https://twitter.com/AFLCIO/status/1648063134668673043)\n\nAsk us anything!\n\n**EDIT:** We're LIVE! Ask us anything!",
    "title": "Happy 4/20, reddit! We are cannabis union organizers with the United Food and Commercial Workers' Union. 🌲🍁 Ask us anything about protecting and organizing cannabis workers!",
    "subreddit": "WorkReform",
    "timestamp": 1681914734,
    "score": 174,
    "keyword": "american director"
  },
  {
    "text": "Maryland bill proposes four-day work week  \n\nThe nation was suddenly and collectively forced to re-examine the nature of work in March 2020, when most were mandated to stay home amid the spread of COVID-19. \n\nThe pandemic’s economic emergency appears to mostly be in the past. Economic recovery efforts have seen unemployment sink to the lowest levels in 50 years, and labor force participation rates have boosted to near pre-pandemic levels.\n\nHowever, businesses face a new set of challenges: attracting and retaining workers in a red-hot labor market.\n\n**What is the proposed bill called?** \n\nDel. Vaughn Stewart, D-Montgomery, introduced **House Bill 0181** last week.\n\n**What are some reasons behind the bill’s proposal?**\n\nThe bill draws on success stories from companies that have adopted the four-day work week since the pandemic and promotes flexibility. During a trial period with 25 companies in the U.S. and Ireland, 97% of workers said they wanted to continue the four-day work week.\n\n**What are the bill’s goals?** \n\nPrivate businesses would shift into a four-day, 32-hour work week. The program would include technical assistance from the Maryland Department of Labor and a tax credit of up to $10,000 in exchange for their participation in a study of the program’s success. \n\n**What does research say about alternate work schedules?** \n\nIn regard to remote work, a 2022 McKinsey survey found that 58% of Americans had the opportunity to work from home at least one day a week and 35% reported that they had the opportunity to work from home five days a week. \n\n**What has been said in response to the bill?** \n\nJoe O’Connor, director of the Work Time Reduction Center of Excellence, testified in favor of the bill. “This is something that organizations that I’ve worked with describe as a forcing function. They describe it as the cheapest and most efficient process improvement strategy that they’ve ever deployed. And why? Because the incentive for employees is so life changing, that it aligns the interest of the individual employees with the objectives of the business in a way that is more powerful than almost any other policy,” O’Connor told Maryland lawmakers.\n\nSome legislators, such as Del. Mark Fisher, R-Calvert, remain skeptical. “It’s all unicorns and pots of gold from what we’re hearing,” he said, arguing that this should not be a legislative issue at all. He also warned that the subsidy could be “punitive” for small businesses who choose not to adopt a shortened week.\n\nIf you’d like to stay in the loop with our coverage, you can see our content on [https://cnsmaryland.org/](https://cnsmaryland.org/). We are a student-run news organization at the University of Maryland, Philip Merrill College of Journalism.\n\n**Read through the full story**[ **here**](https://cnsmaryland.org/2023/02/16/four-day-work-week-bill-aims-to-give-workers-and-businesses-more-flexibility/) **○ CNS|** [**Instagram**](https://www.instagram.com/cnsmd/) **|** [**Facebook**](https://www.facebook.com/MarylandCNS/)",
    "title": "Maryland bill proposes four-day work week",
    "subreddit": "WorkReform",
    "timestamp": 1677182059,
    "score": 90,
    "keyword": "american director"
  },
  {
    "text": "Pigeon Shit Manifesto Awhile ago I spent my day scrubbing pigeon shit off the brick stoops of a meditation hall in downtown San Francisco.\n\nPigeons eat mostly trash. And city pigeons eat city trash. Imagine shit made of city trash. It’s ultra-hyper concentrated - weapons-grade shit-trash uranium.  \n\nThat’s when I was living as a Zen monk. Now I make $150K to sit in a warehouse. And I long for the days of scrubbing shit, mopping floors, and dusting altars.\n\nWhy is this so?\n\nI can’t figure it out. But I’ll take a crack at it.\n\nBelow are some lines from a commencement address by Bill Watterson. It’s titled “Thoughts on the real world from someone who glimpsed it and fled”. (This should give you a flavor for where this essay is going … and where I’m going.)\n\n*So, what's it like in the real world? Well, the food is better, but beyond that, I don't recommend it…*\n\n*We all have different desires and needs, but if we don't discover what we want from ourselves and what we stand for, we will live passively and unfulfilled. Sooner or later, we are all asked to compromise ourselves and the things we care about. We define ourselves by our actions. With each decision, we tell ourselves and the world who we are. Think about what you want out of this life, and recognize that there are many kinds of success.*\n\n*Many of you will be going on to law school, business school, medical school, or other graduate work, and you can expect the kind of starting salary that, with luck, will allow you to pay off your tuition debts within your own lifetime.*\n\n*But having an enviable career is one thing, and being a happy person is another.*\n\n*Creating a life that reflects your values and satisfies your soul is a rare achievement. In a culture that relentlessly promotes avarice and excess as the good life, a person happy doing his own work is usually considered an eccentric, if not a subversive. Ambition is only understood if it's to rise to the top of some imaginary ladder of success. Someone who takes an undemanding job because it affords him the time to pursue other interests and activities is considered a flake. A person who abandons a career in order to stay home and raise children is considered not to be living up to his potential-as if a job title and salary are the sole measure of human worth.*\n\n*You'll be told in a hundred ways, some subtle and some not, to keep climbing, and never be satisfied with where you are, who you are, and what you're doing. There are a million ways to sell yourself out, and I guarantee you'll hear about them.*\n\n*To invent your own life's meaning is not easy, but it's still allowed, and I think you'll be happier for the trouble*.\n\nWhen I think of my longing for pigeon shit scrubbing, I’m half-tempted to do some technical analysis of the psychological principles at work (efficacy, purpose, etc.).\n\nTruthfully, I’m not sure how to explain why that work now seems so enviable. I don’t know what the best adjective is – but it felt like the opposite of selling out. The word that keeps coming up is soul. The work felt like it had soul! (Do I sound crazy yet?... I will).\n\nThis feeling isn’t practical. And maybe it’s all in my head that I was serving some greater Buddhist cause of ending suffering for all beings. But I was the one scrubbing the shit. And I’m the one earning $1 per minute in this god forsaken warehouse. And I can tell you that right now it feels like my soul is slowly seeping out through the bottoms of my shoes.\n\n(The food is pretty good though.)\n\nIf you want to understand why meaning matters, do what I do. Contemplate death. You’re going to die, you know. You’re dying right now (so am I).\n\n*Ask yourself this question: when you die how will you know you lived a good life? Really, answer it.*\n\nOdds are you’ll think about things like to love and be loved, or make the world a better place, or live a rich, full life. I’m guessing money didn’t make the list? How about your title or the prestigious and impressive shit you did? Money is important. Success is great. But it won’t supply all the meaning you need.\n\nThe easy thing to do at this point is dismiss this. Say “Jackson, you’re a fucking a hippy, man. And a know-it-all”. (Both accurate). Because if you take this stuff about meaning seriously and you listen to your inner wisdom, your life is going to get a lot harder. What’s the meaning of your work? Are you really doing something that matters? Is it fulfilling your soul or making you yearn for something more?\n\nAre you working in a hospital? Yeah your work is probably pretty worthwhile even though it’s a bitch.\n\nAre you a college professor genuinely invested in your students? I’d say yeah your work is meaningful.\n\nAre you a senior VP at a large bank? The marketing director at a tech company? You say you’re making the world a better place. Are you?\n\nI don’t know. Maybe you are. But it’s worth being a little skeptical. Our culture puts folks like Steve Jobs on a pedestal. I don’t think changing the world or being a business icon are the same as making the world a better place. Maybe that’s a scorching hot take for an American writer to offer to an American reader.\n\nBut hear me out. Is technological progress or innovation or “growth” inherently good? Is revolutionary innovation equivalent to more happiness and less suffering?\n\nIt’s easy for me to say I’m an essential worker. I get industrial goods from my warehouse to manufacturers all over the country. This work is the lifeblood of the American economy. So on and so forth. Now I'm not making the world a *worse* place. But it’s a stretch for me to call this work soulful or meaningful. It feels a lot more like churning the gears of a massive economic engine than serving my fellow human beings.\n\nSo I don’t think you should beat up on yourself. Or get defensive. It’s just that what I don’t want to have happen to bright folks like you is to get to the end of your life and think, “fuck, what did I just do?”.\n\nI might have pretty high standards for meaning. But I’d wager that when you’re nearing the end of your life, then you will too. So make your money. Be successful. And don’t take some dumbass writer too seriously – but make sure you don’t lose your soul either.\n\nSelling out often means buying in – buying in to some bullshit definition of a fulfilling life. And in my opinion that’s what our current culture  has to offer in the way of personal philosophy: bullshit.\n\nThe happiness prescription is hustle, beat the next guy, rise to the top. Then you’ll have made it. Then you can be happy.\n\nBut what you’ll find is the only thing you’ll have made is an ass of yourself. Because our society’s bullshit happiness advice has made an ass of us all. Don’t believe me? Scroll twitter. Turn on Fox or CNN. Try tik-tok.\n\nHow are we doing? Totally f\\*\\*ked seems like an appropriate summary. Then dig into the stats on anti-depressant, anti-anxiety, and ADHD medications. A gander at climate change trends and wealth distribution might not hurt either. But that’s a whole other rabbit hole. The current socioeconomic situation really feels like one big scheme to rob us of our happiness and sell it back to us (then repeat).\n\nNow we’ve come a long way since the fun and innocent talk of pigeon shit. And I’m sure you’re tiring of my sermon. So what I’ll leave you with is this.\n\nIf you want to do the opposite of whatever selling your soul is. Then don’t buy in. Don’t listen to the marketing messages or the Instagram gurus or the bullshit philosophy of our current culture. Don’t even listen to me.\n\nListen to your inner wisdom. Think about living a life you won’t regret. Read the wisdom that’s lasted 1000s of years – the Bible, the Buddha, the Stoics… And try to find work that builds you up rather than breaks you down. This is something that you *feel* not something you *think*.\n\nIt won’t always make sense - but my experience has been that you can *feel* what’s soulful, what’s true, and what makes you happy. And you can *feel* when you sell out. \n\n**My pigeon shit manifesto is this: work to live, don’t live to work. And don’t settle for anything less than enjoying your life.**",
    "title": "Pigeon Shit Manifesto",
    "subreddit": "WorkReform",
    "timestamp": 1676901811,
    "score": 20,
    "keyword": "american director"
  },
  {
    "text": "Work Reform History Hero: George McNeill (1852) Hi all!  I thought it would be nice to discuss and link a story about someone who has fought before us.  Would love to see posts about your hometown work reform heroes.  \n\nGeorge McNeill:  Work Reform History Hero.  \n\n\n\nArticle Text:  \n\nOn this day in 1852, hundreds of mill workers at the Woolen Company in Amesbury [Massachusetts] walked out on strike. Fourteen-year-old George McNeill, who had worked in the carding room since he was ten, immediately organized the children employed by the mill into a mutual benefit association. This began his lifelong commitment to bettering the lives of working men, women, and children. His decades of advocacy for an eight-hour workday earned him the title \"father of the eight-hour movement.\" In 1869, he was instrumental in persuading the state legislature to create the Massachusetts Bureau of Statistics of Labor. He was co-director of the bureau, which was the first in the nation and the model for the U. S. Department of Labor.  \n\nBeginning in 1847, ten-year-old George McNeill worked at a textile mill from 5:00 in the morning to 7:00 at night. The workers were allowed a 30-minute break for breakfast, 15 minutes for \"luncheon privileges,\" and 45 for dinner. In 1852 the new manager, John Derby, decided this was excessively generous and announced the elimination of the morning and afternoon breaks. On June 1st, 100 employees openly defied his orders; they left for their customary morning break and did not return. Derby fired them all. The following day, spinners, weavers, and workers in the carding room went out on strike.\n\nOn June 15th Amesbury town meeting recorded its \"united protest\" against the Salisbury Corporation, which owned the mill, and urged \"legislative action restricting the hours of labor of manufacturing companies.\" It then authorized the selectmen \"to expend a sum not exceeding $2,000 if in their judgment it is needed for [strikers'] relief.\" The neighboring town of Salisbury also voted unanimously to support the strikers and called on the legislature to limit the workday to ten hours.  \n\nThe striking workers tried to negotiate with Derby, but the mill owners brought in police guards and hired 50 Irish immigrants to operate the machinery. The strikers never won their demands; nor did they get their jobs back. The Derby strike would be considered a failure except that it launched the career of George McNeill. For the remainder of his life he would be at the center of every major effort on behalf of the working people of Massachusetts.  \n\nWith the end of the Civil War, the drive for improved working conditions gained momentum. The National Labor Union, formed in 1864, enjoyed some success before it collapsed during the economic depression of 1868. Other labor organizations sprang up, but another long depression that began in 1873 undermined workers' bargaining power. As McNeill put it, \"an empty stomach can make no contracts.\"  \n\nMcNeill and other labor activists pressed on even when hard times made organizing difficult. By 1863 McNeill had moved from Amesbury to Boston; that year he co-founded the Grand Eight-Hour League. Five years later, the group became the Boston Eight-Hour League. George McNeill served as its president from 1869 to 1874.  \n\nA firm believer in \"organize, organize, organize\" and a brilliant consensus builder, he brought together not only workers but legislators and civic leaders. Recognizing the power of the press, he edited labor publications in New York City, Fall River, and Paterson, New Jersey. While he helped win passage of a number of federal and state eight-hour laws, the statutes were rarely enforced. Employers easily found ways to get around them.  \n\nTogether with abolitionist and reformer Wendell Phillips, McNeill lobbied the Massachusetts legislature to establish a Bureau of Statistics of Labor. He was appointed co-director. Under his leadership, the bureau published some of the nation's first studies on the conditions of working people. Among them was one showing that at least 25,000 children in Massachusetts were \"growing up without any, or but the slightest knowledge of the rudiments of education.\" In part as a result of the bureau's work, in 1874 the legislature passed a law limiting children and women working in factory jobs to ten-hour days.  \n\nConcern that McNeill's activism conflicted with his duties at the bureau led to his dismissal as its director. However, shortly thereafter, he was given the job of monitoring the state requirement that factory owners provide schooling for all 10- to 15-year-olds who worked 10-hour days. He found countless violations. \"I plead for the little ones,\" he wrote in an 1875 report. \"Ignorance and poverty are twin monsters, and education is a means of removing both. . . . We must work for universal education.\"  \n\nGarment workers in Philadelphia had formed the Noble and Holy Order of Knights of Labor in 1869. In 1876 the Knights adopted almost to the word a declaration of principles McNeill had written for another labor congress. In 1883 he joined the Knights and became treasurer of District 30 (Massachusetts), the largest of the state organizations. By 1886 the Knights of Labor had 750,000 members across the nation.  \n\nThe Knights favored arbitration over strikes, sought to cooperate with employers whenever feasible, and had faith in the legislative process. Their goal was a cooperative commonwealth with an economy \"organized upon principles affirming that all citizens enjoyed an equal right to independence and a decent livelihood.\" The eight-hour day was central to their platform, and they believed they could achieve it through legislation rather than activism.  \n\nIn May 1886 thousands of union workers defied the Knights' leadership and struck for an eight-hour day. Many of the strikes ended in appalling violence against the strikers. Frustrated working people all over the country turned to the newly formed American Federation of Labor (AFL), which promoted \"pure and simple unionism.\" George McNeill was one of them.  \n\nFor the next 20 years, he devoted himself to the AFL and the workers it represented. Hundreds of labor representatives — local, state, and national — attended the memorial service that followed his death in 1906. AFL president Samuel Gompers gave the eulogy.",
    "title": "Work Reform History Hero: George McNeill (1852)",
    "subreddit": "WorkReform",
    "timestamp": 1695433575,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "Used the word ‘subordinate’ in an email. Did not know it is taboo to use it in America. Is this grounds for termination? I’m used to British English since I come from a colonized country. Today I wrote an email to someone who is higher up than the senior director where I referred to reportees as my subordinates and coworkers. I had 0 knowledge that this word was derogatory here. I havent received a reply since 8 am until now( over 7 hours). This is not typical of this senior AGM because he always responds within 30 minutes. Spoke to my wife about it(she’s American). She told me using that term is as derogatory as calling someone oriental and I shouldn’t use it again. I had no idea. Am I going to be fired? Will this be eventful or am I just over thinking",
    "title": "Used the word ‘subordinate’ in an email. Did not know it is taboo to use it in America. Is this grounds for termination?",
    "subreddit": "careerguidance",
    "timestamp": 1680636093,
    "score": 830,
    "keyword": "american director"
  },
  {
    "text": "Is moving from a Director level position to Product Management a good idea? I currently run a team of computer network specialists at director level. (I'm in the UK, but work for an American company, we use the US management definitions). I'm considered a subject matter expert for this niche within networking. The company I work for is creating a new platform dedicated to this niche and have asked me to be the Product Owner.\n\nI enjoy running a team, and I'm told I do it well. Product Ownership isn't something that's ever crossed my mind. \n\nThe company considers this a promotion and my salary would increase, though they haven't mentioned specific numbers. \n\nI put forward the idea of hiring a director in my place that will report to me so I can still be involved with the specific niche I'd be designing a product for. They have rejected this as the Product Owner role is a full time job in itself - which I understand.\n\nNow, I'm at a crossroads, do I change career paths completely and move into Product Ownership, or continue with something I enjoy but I regularly feel burnout from due to the high demand?",
    "title": "Is moving from a Director level position to Product Management a good idea?",
    "subreddit": "careerguidance",
    "timestamp": 1682432950,
    "score": 2,
    "keyword": "american director"
  },
  {
    "text": "I just need to get this out of my chest....? I have been with this company for almost 2 years and its been like a nightmare in some way. Work wise it is impossible to get things done, there are no processes and if there are any they are not being followed and there is nobody (Supervisors, Managers or Directors) encouraging and enforcing them. I think we are lacking a lot of direction and leadership.\n\nOn the other hand, work/life balance is great, flexibility is great, it is not fully remote but still is great and with the bunch of flexibility we have and few hours of actual work a day make it even better.\n\nProfessionaly speaking and career wise is not worth it at all, at least not for me. Being a results oriented person this is not making me any good. I feel I am wasting my time and experience.\n\nThis is a very big global company based in Europe with offices in many countries (I am based in US) \n\nI am in the lower levels as individual contributor for my team but my experience is more than this. I have communicated and pointed several problems directly to my manager and even when she apparenlty cares she does nothing! I feel that all this mess is just a reflection of top management. I feel managers, directors and top leadership feel lost as well and all this shit is just running down to lower levels. I have been struggling a lot to get into my new job/responsibilities, and while my team and manager are very supportive I feel I am not delivering and performing the way I know I can.\n\nI came to this job/company from a US american mindset company with better and more modern structure where I spent 11 years, it was great but it was time for a change. I still miss it but unfortunatelly going back is not an option.\n\nI was not looking for a career change but unfortunately I am not even sure how I ended in something that is not in line with my background. Maybe the money was so good. It was almost a 50% salary increase from my previous job.\n\nI feel I am focusing in many things that can be improved in the company/department but it is not even within my scope or responsibilities of my position and is making me feel irritated, frustrated etc. \n\nBelieve me when I ay I try to take it easy and only do what I am supposed to do, but my nature is to be competitive and go for more and help to improve things, But I get really mad seeing that not even managers are doing anything! honestly so frustrating. Even when I enjoy the European mindset of working I feel I am in a mediocre environment where nothing can be accomplished.\n\nI have shared very specific examples of what can be improved and my manager and people agree but nobody takes action! this is killing me. When I have tried to take action I am being blocked and there is always something.\n\nI talked once with a teammate and he said it was like this in all big companies, I honestly dont think so, and refuse to think that all companies this size are a mess in terms of working smoothly.\n\nI have actively applying for other jobs for at least 1 year, several interviews but no offers at all. This first 3 months of 2023 no interviews at all. I am feeling really desperate.",
    "title": "I just need to get this out of my chest....?",
    "subreddit": "careerguidance",
    "timestamp": 1678215224,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Should I stay or leave my current company? I am 37M and I'm the R&S manager of my company since 5 years. It's a small company (12 people) with a relatively flat structure. Most people are old, and highly qualified (half with PhDs, including me,, as the other half Master's and with vast experience in complex topics).\nWe do very interesting work, that any scientist/engineer would probably fall in love with.\nHowever, the work environment is not great. The boss creates a lot of chaos, frequently expresses how I'm not doing a good job as a manager, and everyone is super overloaded with work. We are also not well paid, compared to the market (my peers in other companies are earning 20-40% more than me). It's a good salary still (60kEur, in Rotterdam), but it's getting quite tight with childcare, house etc...\nThis company has the advantage that I'm comfortable (I feel an expert and I do stuff super efficiently), it's close to home (7km, 20min by bike), and it's flexible (I can stay home if someone comes to repair something, or I can leave earlier if I have a medical appointment or something - there is not a tough control of the hours you come in and leave; the work just needs to be done). This is nice, now that I have 2 small kids.\nI don't agree with the strategy of the company, it's not financially stable every year, and I don't see myself having much margin for progression, career wise (except becoming director, in maybe 6-7 years when they retire).\n\nI received an offer for Project Manager in a large American company with a site in the Netherlands, offering me 85kEur (40% more than what I'm getting now), still to be negotiated.\nI respond directly to the R&D director, based in California.\nThis job is 35km (30min by car) away from home, 100% on site. The site has ~50people, and I would be managing projects via other project managers under me. I was told that this job would be essentially project execution (making sure that the current projects continue to be successfully executed until we have the product ready for market).\nIt doesn't seem to be technically very challenging, or a geeky job, but maybe I can live with, I don't know... Managing people is quite challenging, and I can get a rewarding feeling from it as well... But it depends a lot on the people.\n\nI'm undecided if I should take this job or not. Any thoughts? Thanks in advance.",
    "title": "Should I stay or leave my current company?",
    "subreddit": "careerguidance",
    "timestamp": 1692992192,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Am I experiencing wage theft? Hey everyone - Could use some advice, trying to determine if what I’m experiencing is wage theft and, if so, what my best course of action is. TL;DR at the bottom. \n\nBackground: I’m in a white collar profession, and recently relocated overseas for work. Though based overseas, I work for an American company, contract governed by laws of Washington, DC. I’ve worked for this company for 2+ years, and this transition overseas is an internal promotion that came with a hefty pay bump. \n\nThe problem: My new role’s contract started 1-May. To this date I haven’t received pay at my higher rate (though I am being paid at my lower rate). That’s five pay periods and counting. I’m also allocated a 25% hardship allowance on top of salary, which has not been paid. The chances of them resolving this by our next pay period next week are slim to none. \n\nI have contacted everyone and their mother at the company about this. HR has, I am not joking, never answered a *single one of my emails* about this. My Director agrees this is outrageous but there’s not much else she can do besides follow up with them as well, and loop in higher ups, but they still aren’t communicating. There’s other issues besides pay, such as accrued leave from my old role they need to pay out, which continue to go unaddressed. \n\nAt this point a VP and two Directors are on the email thread about this, and HR is still ignoring me. I am at my wit’s end and not sure what to do.\n\nPart of me wants to stop working until I’m paid, but that’s not an option; my team out here is great, and without going into too much detail, I’m in a critical enough role that me not working could bring a high profile project with public scrutiny to a screeching halt. And I don’t want to penalize my local colleagues who frankly have nothing to do with this. \n\nLook I’m not hurting for money, and I *am* still being paid at my old, lower rate so no one is going hungry. But I’m working my ass off, am pretty good at my job, and just moved across the world for this role so paying my fucking salary seems like the bare minimum we could do. Or, I don’t know, answer a fucking HR email?\n\nSo do I start throwing around terms like “wage theft” and “exploring my options” in an email next week if this isn’t resolved by the next pay day? Is this even wage theft? (I am certainly no lawyer.) Might not seem like it but I love this job, and, barring, ahem, some teams, I have a deep respect for my colleagues and have no desire to leave the company or burn bridges. \n\nTL;DR: Company promoted me effective 1-May, has continued to pay me at lower rate for five (soon to be six) pay periods, is this wage theft and what should I do, keeping in mind I love this job and don’t want to burn bridges.",
    "title": "Am I experiencing wage theft?",
    "subreddit": "careerguidance",
    "timestamp": 1689878559,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Career Advice: Modern American History/Film Sector/US Politics? Hi all,\n\nI'm a history graduate with a postgraduate MA degree, specialising in Modern American History. Alongside my academic background, I have a passion for films and possess professional experience in event management within the film festival industry. I’ve also taken several film history electives during my academic career. I'm based in London, UK, and I'm seeking career opportunities in either Modern American History, the film sector, or US politics.\n\nRegarding the film sector, I'm not aiming to be in front of the camera or pursue roles as a producer or director. Instead, I'm interested in research positions within the film industry or strategic and editorial roles within prominent film companies or distribution studios like Netflix, Paramount, or Universal. However, jobs seem very hard to come by. \n\n\nResearch and writing are two things I enjoy very much and would love to incorporate one or both of these into my work. As a halfway house I’ve been applying for research consultant and research analyst roles and also exploring copyeditor jobs, but something within one of these three industries is what I’m really endeavouring for.  \n\n\nI have a diverse professional history, including client services, event management, public policy, higher education, sales, and hospitality, so I have gained a clear understanding of my interests, strengths, and career goals. However, I'm uncertain about the potential alternative academic careers in Modern American History. I have been discouraged from pursuing a PhD in history due to the perception that teaching roles are the only viable options, which doesn't align with my interests. Are there any alternative academic careers, such as working for American history societies in the UK, that I could explore? I would love to perform further research in modern American history as I greatly enjoyed researching and writing my MA dissertation, but jobs based around this seem nonexistent for even PhD holders. \n\nIn addition to my passion for history and film, I am highly interested in US politics and would love to work for a news organization like The New York Times or FiveThirtyEight in the lead-up to the upcoming autumn election. However, I lack direct editorial experience and am currently based in the UK. Are there any viable options for me to pursue this path, considering my circumstances? I have managed projects, conducted qualitative and quantitative analysis, curated reports and briefings etc., so I do think I’ve got a lot of transferable skills \n\nAny advice would be much appreciated. I’m happy to provide more info on background and context if that would be helpful. \n\nThanks in advance!",
    "title": "Career Advice: Modern American History/Film Sector/US Politics?",
    "subreddit": "careerguidance",
    "timestamp": 1684268540,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "Is there that much of a disparity between US salaries vs CAN salaries? I’m in Toronto which I consider a high cost of living but maybe I’m wrong. Every now and then I see salary posts. Some US senior accountants make more than some of of our manager and directors here in Canada when converted. \n\nIs it really that far apart between the two? \n\nI asked a recruiter if they could provide some information North American wide which I don’t have yet.",
    "title": "Is there that much of a disparity between US salaries vs CAN salaries?",
    "subreddit": "Accounting",
    "timestamp": 1703240490,
    "score": 37,
    "keyword": "american director"
  },
  {
    "text": "Impact to financials from forcing employees to use saved PTO *Question* I work for a large American company that has global business operations.  Starting this past spring, executive management sent out a memo that all employees (all US based, not sure if it applied employees working in Asia) must use 40hrs of their saved PTO in the 2nd quarter and another 40hrs in the 3rd quarter.\nMy question is simply why would they make us do this? What impact would this have on financials that would make this a beneficial action for the executive team to do? Could it be to meet an accounting period specific goal set by the board of directors in order to receive bonuses/compensation?\n\nPS- I also forget to mention that the company is publicly traded.",
    "title": "Impact to financials from forcing employees to use saved PTO *Question*",
    "subreddit": "Accounting",
    "timestamp": 1696351593,
    "score": 3,
    "keyword": "american director"
  },
  {
    "text": "Being a Finance Manager in USA in Industry (TX) - what is the pay/work like? I'll be immigrating from Canada... I'm a finance manager for a big public company in Canada; and my company is building a new plant in Texas. I may have an opportunity to take a job there involving overseeing a team of a few accountants and handling all finance matters relating to the new plant. Finance matters include external reporting (IFRS, because the parent is Canadian), internal reporting, budgeting, etc. It will be a permanent job, and I'm told I can be sponsored for a green card.\n\nWhat is the pay like for such a job in TX? My company is being very quiet about it, but they told me its higher than in Canada, and that it's the same as typical finance manager jobs (for similar roles/industry) in the US. \n\nWhat is attracting me to the US is that it's very hard to climb the corporate hierarchy in Canada and make lots of money. It seems a lot easier to do that in the USA (possibly because there's a shortage of accountants/lots more big public companies?).  I'm thinking that once I get my green card, I can move around to different companies based in TX (like Dell, American Airlines, Exxon, Oracle) and climb the hierarchy that way. How hard is it to do that in TX? I eventually want to become a Director - what is the salary for that?",
    "title": "Being a Finance Manager in USA in Industry (TX) - what is the pay/work like? I'll be immigrating from Canada...",
    "subreddit": "Accounting",
    "timestamp": 1696801607,
    "score": 0,
    "keyword": "american director"
  },
  {
    "text": "I told /r/asianamerican a year ago we need more films with stories that happen to feature Asian people. I dropped out of film school with this mindset and directed my own film. One year later, I'm done! I'm having the world premiere in Los Angeles this Saturday, please join me! Hey everyone! My name is Reangsei Phos and I’m a 23 year old film director based in Toronto. Over a year ago, I posted to /r/asianamerican about this film and the support has been overwhelming. \n\nFor those of you who don't know I dropped out of film school three years ago and since then my views as a filmmaker have shifted from solely telling Asian stories about culture and identity - to telling compelling stories from an Asian-American viewpoint, involving Asian in front and behind the camera. With this new mindset, at the beginning of this 2022 I started working on a new short film.\n\nIt follows a couple on the verge of their one year anniversary, they get into an argument and end up locked in a diner with its strange owner. The film is heavily inspired by some of my favorites; the chaos of the Safdie brothers & the surrealism of Haruki Murakami and inspired by my last relationship. Unlike my previous film that highlights the Asian experience, this film highlights a unique story through an Asian cast, something that we need more of today.\n\nAfter a year of working on it, I'm finally ready to share it! I'm hosting a world premiere in Los Angeles Arts District on November 18th and I'd love for you to join me. It's free and all you have to do is RSVP [here](https://partiful.com/e/XeDpnxbcIntTrxxJWm4x)\n\nThank you everyone <3",
    "title": "I told /r/asianamerican a year ago we need more films with stories that happen to feature Asian people. I dropped out of film school with this mindset and directed my own film. One year later, I'm done! I'm having the world premiere in Los Angeles this Saturday, please join me!",
    "subreddit": "asianamerican",
    "timestamp": 1699914821,
    "score": 287,
    "keyword": "american director"
  },
  {
    "text": "I’m jason chu - Asian American rapper heard on American Born Chinese, Joy Ride, Warrior & more. Also a passionate racial justice advocate with Hate Is a Virus. AMA! Hi everyone! My name's jason chu - I'm a rapper & activist based in LA.\n\nFor the last 8+ years, I've been a full-time recording & touring artist, with music on *American Born Chinese*, *Joy Ride*, *Warrior,* *Kung Fu*, and more. My new album [*We Were the Seeds*](https://fanlink.to/weweretheseeds) just came out this past weekend.\n\nAs an activist, I've done work around AANHPI history, interracial solidarity, mental health, and other topics, including tons of educational content on [IG](https://www.instagram.com/jasonchumusic/reels/) and [TikTok](https://tiktok.com/@jasonchumusic). I've been communications director at Hate Is a Virus for the last couple of years, and also worked with the LA Mayor's Office to help shape plans for a new monument to the 1871 Chinatown Massacre.\n\nI'm a Yale graduate, and did an MA in Asian American Theology, a hybrid of Christian liberation theology and Asian American Studies. More of my background is at [jasonchumusic.com/about](https://jasonchumusic.com/about)\n\nAfter a weekend of album release shows, I'm sitting at home working all day - lets chat about being Asian in hip-hop, being a full-time creative, racial justice & mental health, or anything else that comes to mind. AMA <3\n\nProof: [https://www.instagram.com/stories/jasonchumusic/3196213069907490849/](https://www.instagram.com/stories/jasonchumusic/3196213069907490849/)\n\n**Call To Action:** On December 30, 2020, Christian Hall, a Chinese American boy, was killed by PA State Troopers.\n\nPlease sign this petition to help ensure something like this never happens again: [bit.ly/j4chall](https://bit.ly/j4chall)\n\nAnyone who doesn't know about Christian - you can read up [here](https://www.cnn.com/2022/04/01/us/christian-hall-shooting-pennsylvania-lawsuit/index.html) and in [this statement from the family's attorney](https://act.bencrump.com/a/christian-hall) (TW: violence, police brutality, mental health crises)\n\n&#x200B;\n\n**Edit 9/22:** Think I answered most of the questions, thank you all for a great AMA! Honestly, going in i was nervous no one would really want to engage, so it was cool getting to chat with you folks and respond to some really thoughtful questions.\n\nIf you want to reach out, hit [my IG](https://www.instagram.com/jasonchumusic/) \\- and please take a listen to [*We Were the Seeds*](https://hypeddit.com/w8gi7m), out now on all platforms <3",
    "title": "I’m jason chu - Asian American rapper heard on American Born Chinese, Joy Ride, Warrior & more. Also a passionate racial justice advocate with Hate Is a Virus. AMA!",
    "subreddit": "asianamerican",
    "timestamp": 1695237656,
    "score": 263,
    "keyword": "american director"
  },
  {
    "text": "Shoutout to The Whale for its Asian American portrayal Haven't seen The Whale mentioned so thought I'd bring it up. As I don't watch trailers, I didn't know there was gonna be a prominent Asian American character in it, just watched because I like the director Darren Aronofsky a lot. The Asian American character is just a regular Asian American living her regular life in the US like Asian Americans IRL, no \"hONoRR\", poor English, \"exoticness\", or other stereotypes often seen in American movies featuring Asian characters. As for the movie itself (no spoilers), it's the same director of Requiem for a Dream, Black Swan, The Wrestler so it falls under the same vibe of bleak yet amazing movie. The Whale has some really powerful delivery, even I teared up a bit during its climax and I'm pretty stoic (felt nothing watching Anohana lol). All the actors did an amazing job, the characters felt real, and it's beautiful how everything got tied together. Totally recommend",
    "title": "Shoutout to The Whale for its Asian American portrayal",
    "subreddit": "asianamerican",
    "timestamp": 1672692700,
    "score": 147,
    "keyword": "american director"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 69,
    "keyword": "american director"
  },
  {
    "text": "'Curse of Quon Gwon' (1916) - First Asian American film https://www.youtube.com/watch?v=o2-sMG3Qlt8\n\n“The Curse of Quon Gwon is the earliest known film directed by an Asian American, and one of the earliest films directed by a woman. The movie features an all-Chinese American cast, including the star, Violet Wong, who was director Marion Wong’s sister-in-law. Most of the film was shot in Oakland, a few miles of where it will be screened in Chinatown on Sunday. Their family came to the U.S. in the 1850s during the Gold Rush Era.”\n\nhttps://caamedia.org/blog/2015/08/04/caam-co-presents-earliest-known-asian-american-film-the-curse-of-quon-gwon/",
    "title": "'Curse of Quon Gwon' (1916) - First Asian American film",
    "subreddit": "asianamerican",
    "timestamp": 1693215067,
    "score": 7,
    "keyword": "american director"
  },
  {
    "text": "Anyone Have access to Alexander Street or Proquest for a documentary ?  \n\nHi, I'm trying to get a documentary to help me with a project but do not have an institution that has access to Proquests database. I have looked everywhere and the documentary I'm looking for only exists in some university institutions, Alexander Street, an Proquest. If anyone has access and can assist please let me know! Thank you. The documentary link is below. \n\n**Another America**\n\n[https://www.proquest.com/docview/2512404416/E2F02D9BBD2B4459PQ/1](https://www.proquest.com/docview/2512404416/E2F02D9BBD2B4459PQ/1)\n\nProQuest document ID:  \n2512404416\n\nCho, Michael (producer), and Cho, Michael (director).  \nSan Francisco, CA: Center for Asian American Media. Jan 1, 1996.",
    "title": "Anyone Have access to Alexander Street or Proquest for a documentary ?",
    "subreddit": "asianamerican",
    "timestamp": 1681279020,
    "score": 1,
    "keyword": "american director"
  },
  {
    "text": "A 25-year old Managing Director applies the best from the East and the West in a podcast interview Rick Hu, who became the youngest Managing Director of Northwestern Mutual at the age of 25, was the keynote speaker at the Asian Hustle Network conference that happened last month in Vegas.\n\nMy friend also interviewed him on his podcast. I wanted to share some highlights on what resonated with me:\n\nImposter syndrome - imagine what it felt like being a 25-year old Managing Director in a room full of 50-year old white men. Rick struggled at first but eventually led his office to becoming the number one district of the company.\n\nRelationship with your parents - Rick earned the respect of his parents through success. At the same time, he remained humble. He was able to build a relationship with his immigrant parents on equal footing and shared with them the abundance over scarcity mindset.\n\nBeing uncomfortable - he cites his successes to his failures, which he goes into deep (like getting put on probation in his first job). It’s amazing how far he’s come.\n\nI think this story is pretty closely tied to the Asian American experience and it’s good to have a role model like Rick to learn from: [https://podcasters.spotify.com/pod/show/afterhourprojects/episodes/Episode-15-Rick-Hu-Mindset-Matters-e24sn74](https://podcasters.spotify.com/pod/show/afterhourprojects/episodes/Episode-15-Rick-Hu-Mindset-Matters-e24sn74)",
    "title": "A 25-year old Managing Director applies the best from the East and the West in a podcast interview",
    "subreddit": "asianamerican",
    "timestamp": 1685481129,
    "score": 0,
    "keyword": "american director"
  },
  {
    "text": "The Barbie movie is a feminist milestone in cinematic history (no spoilers) I saw Barbie over the weekend and loved it. I dressed up in a pink dress and biked to my theater in a pink helmet and the white sunglasses she wears in the first scene. I felt so cool. In line I met other girls, all dressed in pink and let me tell you, the vibe was so wonderful and welcoming. \n\nAs I've watched the news following Barbie this week, I'm realizing this is even bigger than Barbenheimer. This is bigger than I ever thought it would be. \n\nBarbie is the highest grossing movie with a woman director, followed by Wonder Woman and Captain Marvel. I went to both of these movies on their opening weekend as well, but I'll get to that. First, a quick comparison:\n\n\"With $162 million in ticket sales from North American theaters, according to studio totals Monday, “Barbie” catapulted past both “Captain Marvel,” which was co-directed by Anna Boden and opened to $153.4 million in 2019, and “Wonder Woman,” Patty Jenkins’ 2017 film that debuted to $103.3 million\" (https://www.csmonitor.com/The-Culture/Movies/2023/0725/Barbie-box-office-bash-Gerwig-s-opening-weekend-shatters-records#:~:text=With%20%24162%20million%20in%20ticket,that%20debuted%20to%20%24103.3%20million.) \n\nAs I said, the vibe at Barbie was amazing. I dressed up, which is something I did for both Wonder Woman and Captain Marvel. What can I say? I love dressing up and I'm a nerd at heart. \n\nAt BOTH Wonder Woman AND Captain Marvel,  I had at least one man criticize my outfit. \n\nAt Wonder Woman I wore a WW T- shirt, a WW purse, and those WW socks with the capes on them. I show up early and I'm 2nd in line. The middle aged man in front of me looks me up and down and condescendingly says, \"Cute. But Wonder Woman doesn't wear a cape.\" For once in my life I had a good retort: \"Lynda Carter wore a cape for the Wonder Woman TV show.\" This dude, unphased, says \"Well, I haven't watched that since the 70s\" as though that changed the fact that he was incorrect. I was mad, but I did walk away feeling like I got the better of that convo.\n\nFor Captain Marvel, I didn't have (or franly want) anything Captain Marvel themed. She's great, don't get me wrong, I just really didn't have anything. So I rewore my Wonder Woman shirt as a throwback to the last woman-directed superhero movie. No less than FIVE MEN informed me I was wearing the wrong shirt. I wasn't upset at this, more amused. \n\n But in retrospect, it says a lot about how men feel so comfortable policing women's clothing and gatekeeping fandoms. Like I said, COMPLETELY different vibes. \n\nI remember a comedian when Wonder Woman came out (I wish I could remember her name so I could give her credit). She pointed out that if WW tanked, it would be taken as a sign that women-led movies don't do so well. The quote I remember was \"Batman v Superman sucked, but no one said, 'I guess we gotta stop making man-movies now.'\" And it's funny because it's true. It has long been assumed that movies with a female audience aren't worth it because men won't go to them. Even WW and CM were tied into superhero franchises in the hope it would attract more men into the audience.\n\nAnd then you have Barbie. There is no effort to make this pink masterpiece attractive to men. It is a movie about a girl's toy and it was 100% marketed for women. I don't remember ever seeing something like this in my lifetime.\n\nOn top of that, Margot Robbie is 33, which means a lot when you have Andrew Tate out here telling incels that women aren't pretty once they turn 30. \n\nBarbie takes the piss out of patriarchal values and toxic masculinity in the most delightful way possible. Women are walking out of the theater feeling seen in a way they have never experienced. \n\nI've also heard the take on how monumental it is for a Barbie to own her own house and her own car back in the 60s when women couldn't even have their own bank account until 1974! But her house and car are pink, they are clearly hers. She probably bought them with the money she made from her bajillion careers. \n\nWonder Woman ran so that Barbie could float. Ladies, this is what progress looks like. It looks like a pissed off Ben Shapiro. It looks like women feeling seen and empowered. It looks like girls dressed in pink complementing each other. \n\nAfter RBG's death, after Roe v Wade was overturned... this is the most hopeful I've felt in a long time.\n\nThank you, Greta Gerwig.\n\nEdited for grammar",
    "title": "The Barbie movie is a feminist milestone in cinematic history (no spoilers)",
    "subreddit": "Feminism",
    "timestamp": 1690407516,
    "score": 815,
    "keyword": "american director"
  }
]