[
  {
    "text": "The Burden of Being an Unmarried, Childless Teacher in 2019 America I’ve been teaching for eleven years. I absolutely love it. I’ve taught in three different districts with three very different types of students and families. I currently teach in a school in a small town in the American Midwest. We’re one of only two schools in the county.  Because of this, we have this weird small-town mentality, but with mid-size numbers. We should have a curriculum director,  but a principal can do it. We should have an assistant principal at the elementary level, but why when they’re just little kids? There is so much pressure on everyone all the time to do all the things. But more pressure is put on those of us who don’t have children. \n\nOP, why are you stressed, it’s not like you have children at home. OP, can’t you stay and do this duty? Do you want to run to the store after school for x, y, and z, my kid has dance. Why do you care if the meeting ends on time, you’re just going to go home to your cats. You’re not tired you don’t even have kids. OP, you’re really hard to get ahold of over the summer I had some things I wanted to discuss with you. I studiously avoided phone calls, texts and emails from my admin because I’m off contract during summer and anything they needed to talk to me about could wait until August. \n\nYes. I’m going home to my cats-unashamedly. I’m going to binge watch my show this evening because I don’t have to take a kid to dance. Yes, I traveled around the country this summer. Is my time not as valuable because I don’t have small humans of my own to take care of at this point in my life?  I’ve been in a long-distance relationship for over a year-but to them I’m single since I don’t have to take his dinner out to him in the field. \n\nThe guilt put on us by this district is unreal. Because I’ve taught for eleven years I’ve learned to say no, but the guilt is still there a tiny little bit. I’m getting really good at ignoring it, but it’s still really frustrating to hear those things. I’m stubborn and I don’t do things I don’t want to do, but it’s hearing those things that just sends me through the roof.  \n\nI guess I just want them to respect my time and life choices just as much as I respect theirs.\n\nEdit to add: I’m not against having children and do want them some day. I’m just annoyed with the overall attitude towards those of us who don’t have them in my school system.",
    "title": "The Burden of Being an Unmarried, Childless Teacher in 2019 America",
    "subreddit": "Teachers",
    "timestamp": 1576213390,
    "score": 143,
    "keyword": "american principal"
  },
  {
    "text": "The only job that people ignorantly think they can do better yet won’t. Am I the only one that feels this way? \n\nI was a high school math teacher. I was also a baseball coach. Spent 5 years between 2 low socioeconomic schools. Just recently got out.\n\nI can’t begin to tell you how great it feels to be out of the classroom in the middle of October. Working in the private sector; actually getting rewarded monetarily for your extra time and efforts and knowledge. Also being able to work without having to be on the edge of your seat worried about some random outburst of insubordination and/or a “go fuck yourself” or a “I’d fuck you up.” Or feeling a pen or wad of paper fly off your back while you are writing on the board. Or worrying about that inevitable investigation by principals and HR (which is amusing because HR is for the protection of the workers, not the students, but I digress) making sure you aren’t the reason for these outbursts, when all you did was try to teach a simple lesson. \n\nSound familiar? Then you’ll love what I have to say next...\n\nOne thing that pisses me off about the profession (besides the inadequate pay you receive to make apathetic children with zero work-related skills appear useful to the ever-growing workforce) is that EVERYONE thinks they can tell you how to do your job. After all the college classes, observations, student teaching, appraisals, professional developments, lessons taught, clubs supervised, etc., people actually have the nerve to expect that you take their criticism into consideration. That’s one reason why I left education, and if you’re on the fence about it, you should, too, because the job definitely ain’t for you.\n\nThink about it...\n\nEvery teacher with more experience than you is telling you about what you should do in your classroom, even if they’ve surfed the internet every day for the last 25 years. Peers that have a better relationship with superiors than you (not better teachers) are running professional developments. Principals that haven’t been in the classroom for the better part of the decade (or more) think they know what is best for your classroom.\n\nMy favorite critic is the parent, though. Especially the ones that raise their kids in front of an iPad and Xbox; on junk food and an unhealthy sleep schedule. Decided to stick a smartphone in their child’s hands way too early because they’re the “cool parent.” Have no education or work ethic either. Yet they have all the reasons why their child is failing, ignore the educated, specific reasons that I tell them they are failing, and then want to make a suggestion on how I should be teaching and giving assignments. On multiple occasions I threatened that I would get a substitute, drive over to their job, stand over their shoulder, and tell them what to do and how to do it.\n\n“But hey, teaching isn’t about the money or the problems, it’s about the relationships and students,” said about half of you that have read this. \n\nFirst of all, give it a rest. That self-righteous crap is why teachers (and you) don’t get paid enough. You keep martyring yourselves like that, and straight white males in suits that are in your state and local government are gonna keep taking your word for it. They don’t care. They know how screwed up the system is and have no solution for fixing it (because quality education starts with solid parenting/guardianship, but again I digress) so most of their children are enrolled in private schools anyway.\n\nSecondly, most of the average students don’t give a crap about you or your lessons (3.5 to 4.0 college-bound students are going to get it done no matter what). They think teachers and the school system are jokes, even if their justification is ignorant. It also doesn’t help that parents ALLOW their children to think like this (which is why they don’t need to be telling us how to run a successful classroom). \n\nThen for whatever reason (probably ignorant parents and social media), children of today think that they’re the only kids to have gone through public school I guess? Nah. More like the only generation to have unlimited platforms to whine about hard work. Too much homework because it causes a lack of sleep? Bullying might still be a problem? Can’t chew gum? There’s a dress code? These are all wimpy claims that students are making right now on social media to justify that school is useless and the “system is broken,” and society just buys in. Somehow these people forget that while they agree with these ignorant, whiny children on social media, they are doing it with a $1000+ smartphone, paid for with the money they earned from the job they do so well at BECAUSE of their “old school, pencil/paper” education.\n\nDon’t even get me started on the fact that a bunch of humans without high school diplomas (aka students) are being allowed to give input on their education, and that input is even being entertained. What kind of backwards ass logic is that? We are the ones that are educated and experienced, society should be listening to us and supporting our needs because our needs regard successful futures for children, not making sure there’s time to get a battle royale winning streak in on fortnite. \n\nInteresting how there’s a bit of a difference in motivation for why teachers do what they do and why students do what they do. Logically, it would make sense to listen to teachers, but too many of you got in the school and started bringing sympathy and emotion (instead of motivation and critical thinking), so logic has gone out the window as far as American public school is concerned.\n\nThe bottom line of my message is don’t feel bad if you want to quit and leave education. You don’t owe anyone anything. Tomorrow it may feel like you’ve betrayed everyone, but years from now you will be commended for the time you spent in the classroom doing what everyone else THINKS they can do and will never do.\n\nAnd to those of y’all that plan on staying in: work hard and quit martyring yourselves. Don’t give these people in a much higher tax bracket than you any reason to say you don’t deserve better. You deserve adequate pay for your efforts, and so do your peers that are working towards the same goal as you miles away. Give each other a chance and stand up for what you deserve, but you have to come together. You have to quit feeling sorry for kids and push them to do things that they don’t want to do. Otherwise, enjoy that non-merit-based, near poverty line, salary.",
    "title": "The only job that people ignorantly think they can do better yet won’t.",
    "subreddit": "Teachers",
    "timestamp": 1572025797,
    "score": 110,
    "keyword": "american principal"
  },
  {
    "text": "What are your thoughts on why there aren’t many African American teachers. Black teachers only make up 7 % of public school educators across the nation. Black males is even lower. Each year more and more black teachers are leaving the profession due to reasons ranging from feeling “pigeonholed” into only serving black students, being pressured into being the unofficial disciplinarian of students of color, to feeling ostracized by their administration and colleagues. These are ALL things I faced as an African American teacher my first couple years of teaching and had I remained at the school where I was, I would have most likely left the profession as well, but like most teachers, the students kept me motivated to keep going. My last year there our school had a “ Black History Month” Assembly which ONLY focused on the achievement African-Americans have made in sports and music. When I spoke to my principal about it she told me she didn’t feel offended and that neither should I. SHE as a white woman was not offended so ME as a black man shouldn’t. Now, at my current school things are much better as I feel valued and appreciated as a staff member and as an individual, but we ALL have a long way to go.",
    "title": "What are your thoughts on why there aren’t many African American teachers.",
    "subreddit": "Teachers",
    "timestamp": 1553136932,
    "score": 54,
    "keyword": "american principal"
  },
  {
    "text": "Well that's an ...interesting choice for a victory speech So I'm a school resource officer (cop in a school, only deal with actual criminal stuff, also kind of a backup nurse) at a let's say \"disadvantaged\" school in a large metropolitan area. \n\nSo we recently had the end of year meeting which for me usually just means I clean out my office, hang out with some of the teachers, and then go home early. This school the principal had food at the traditional end of year meeting so I sat in on part of it and it was shall we say unusual. \n\nShe opened by saying \"we made it\" and then quickly transitioned to \"when it got back to me that people were speaking about me behind my back it felt like getting raped\" (let's ignore the fact that she emailed my captain to complain about me going easy on the kids instead of talking to me or my lieutenant and focus on the \"y'all raped me\" comment. All I'll say is it's a good thing I had my sunglasses on because there was some eyerolling) \n\nThen it translated into complaining about Christmas because it was the only time people were nice to each other\n\nThen she told a lovely story about how she almost didn't hire a teacher because she was white (principal is African american, the students are almost all African american so I get what she was getting at but holy shit) but was glad because that teacher had done well\n\nThen she went on an anti union rant because it made it hard to fire low performers.\n\nThen she told us to take care of ourselves but not use sick days\n\nThen she told us not to eat meat\n\nThen I stepped out to take a call from my lieutenant. \n\nBut yeah a far cry from the traditional \"good job, here's what worked, here's what we're doing next year\"",
    "title": "Well that's an ...interesting choice for a victory speech",
    "subreddit": "Teachers",
    "timestamp": 1559840306,
    "score": 47,
    "keyword": "american principal"
  },
  {
    "text": "Last Minute Prepping for Classes I'm a high school Culinary Arts teacher. I'm dual certified with 17 years of prior experience as an elementary teacher. This includes 8 years abroad at Americans schools in Saudi Arabia and Lebanon. After earning a 3rd degree as a chef, I worked in the food service industry for a few years before returning to education as the chef instructor of high school Culinary Arts program. This will be my 13th year teaching Culinary Arts. It will also be my 30th year in education. \n\nOne other thing I will mention at the outset is that I'm autistic, though I didn't learn this until I was 54. This was nearly 5 years ago. \n\nI've been able to function as a teacher because my classroom is always highly structured. As a chef; school law, district policy, the state instructional standards, school rules, my budget, the availability of tools and equipment, the length of a class period, and the level of my own skills have defined the parameters within which I've been able  work with my students. Pictured below is a composed cucumber salad that my Culinary II students produced as a test of their knife skills. \n\n&#x200B;\n\nhttps://preview.redd.it/j6zpnmhzqpf31.jpg?width=532&format=pjpg&auto=webp&s=dee7669116c8764b21763d631a0dbb0fc3ae7866\n\nWhile each school year brings uncertainties which include not knowing what my budget will be, wondering what the chemistry of each class will feel like, and wondering if any of my students will be \"problems,\" this year has brought additional challenges. My immediate supervisor lost her job because the principal decided to do away with the dean's slot in favor of an assistant principal's position. Although the dean applied for this position, she was not one of the two finalists who will be invited for a 2nd round of interviews on Monday. Once the new AP has been hired, my supervisor will be out of a job. The school year starts on Monday, August 12th which means that she won't have any time to find another position or to relocate back to the greater Vegas area. \n\nAfter ten consecutive years of budget cuts, the teachers' union has also called for a strike. When will the strike be? How long will it last? Will the state legislature finally give us the additional funding we need to avoid cutting jobs and programs? Will the superintendent retaliate against teachers who went on strike and if he does take action, will any of us lose our jobs or will the reprisals be limited to an administrative letter of reprimand that will be placed in our personnel files? \n\nI despise uncertainty. \n\nIt doesn't help that as someone who's neurologically prone towards being a reclusive introvert that I kept to myself over the summer with no company other than my cats. While it doesn't bother me to be alone, having to interact with others after 10 weeks of self imposed isolation is really hard.\n\nSince teachers were due to report back on Wednesday, August 7th, on Monday the principal sent out an email to our faculty. We were told to wear color coded shirts. The color we wore depended upon what we taught. Reading between the lines, I just knew that our first day back at work would involve teachers being grouped with each other and that there would be lots of movement and discussion.\n\nSince none of this was autistic friendly (since many of us are sensitive to noise and movement), I emailed my principal to tell her that I was particularly stressed out for the coming year. I asked if I could be excused to work in my room instead of having to participate in our first day activities.\n\nEven though the principal knows that I'm autistic, she told me that, \"We all get stressed out,\" and denied my request. I subsequently had a panic attack. On Wednesday as I was getting ready for work, I broke into tears and had a meltdown. I subsequently emailed the school's office manager to tell her that I would be absent. \n\nI wound up missing the entire week. I just couldn't bring myself to go to work. My supervisor, (the dean who is being replaced with an AP), talked me into coming into school this Saturday since the school would be largely empty and there wouldn't be anyone to bother me.\n\nSince I didn't have my keys, I agreed to meat with my dean at 9 AM on Saturday. This is what my room looked like. \n\n&#x200B;\n\nhttps://preview.redd.it/z3gpt2ijupf31.jpg?width=532&format=pjpg&auto=webp&s=9fe5c0f1145b18dd038e83f50731c23a7787cdf8\n\nSince I'm really organized, this is what my room looked like after 4 1/2 hours. I set up my desktop computer and printer. I set up the laptop and confirmed that  both the projector and the sound system worked. I set up the student tables, and put up bulletin boards. \n\n&#x200B;\n\nhttps://preview.redd.it/wl53hoyqupf31.jpg?width=532&format=pjpg&auto=webp&s=dbeffe14f63802ecb611dbd214be13b866a3a128\n\nThe attached kitchen isn't ready, but then again it doesn't need to be. Since I won't have my budget for two more weeks and will need to train all students (including those who were with me last year) in food safety and sanitation, I will have two weeks to set up the kitchen.   \n\n\nhttps://preview.redd.it/twnittm3vpf31.jpg?width=532&format=pjpg&auto=webp&s=db3fc8a58ab2fa9aa26756c12e0a6136f9544b6f\n\nThe classroom is ready to go. I'm using the same lesson plans that I've used for the last 4 years. Since some high school students won't be happy with their schedules, the first week is always \"open\" so that students may change their classes as needed. During this time we don't teach to the standards. We go over expectations and rules and emergency procedures. We do assessment testing. We use getting to know you activities, though given the fact that we're a small rural school, all of the kids will already know each other unless they transferred in. This year I'll probably have my advanced students set up the kitchen. As it says in the Medieval romance, Sir Bevis of Hampton, \"Many hands make light the work.\"\n\nI am grateful to my supervising dean for having helped me  to (partially) get over my anxiety for the coming year, at least enough so that I could set up my room. As the year progresses and we fall back into the habit of our routines, things should get better. Knock on wood.\n\nI just hope my (soon to be former) dean will land on her metaphorical feet.",
    "title": "Last Minute Prepping for Classes",
    "subreddit": "Teachers",
    "timestamp": 1565485547,
    "score": 17,
    "keyword": "american principal"
  },
  {
    "text": "How can two schools be so different... nevermind I know.... Rant ahead warning....\n\nSo I teach at different schools within our county. I teach 4th-12th grade, one school/grade per day. So yesterday was one of our middle school's 8th grade, tomorrow will be a different elementary school's 5th grade and so on. There are 3 school systems in our tiny county. We can't have a consolidated school because football is king, but that's another rant. Most of our graduating classes have 50-60 kids. Its stupid. \n\nSo School A as we'll call it is in what's known as the redneck, backwoods part of my county. School B is in the county seat, highest population, least poverty, etc. School C is divided between low economic conditions and your average medium family income households. Also, this school is known for its ratio of African American to White students being almost 50/50 whereas our other schools are predominately white. \n\nSo here we go. I absolutely HATE going to School B. HATE. I leave almost in tears some days because the students are extremely disrespectful. I'm lucky if I get half my lesson completed because I spend the majority of my time telling some kids to shut their mouths and listen while trying to catch other's up because they are so far behind. I'm only speaking about School B's middle school here, as their elementary and high school are much better. There are 8th graders here that don't know their mom's name, or their address, or their birthday. What's even worse, the teachers stay in their classrooms while I come in to do my lesson. They say this is a normal day. \n\nSchool A. School A gets ridiculed throughout our county because they are the redneck country hillbilly folk. Let me tell you what, those are the BEST behaved students I've ever dealt with. Not only are they respectful, they are brilliant. They can interact with you as a teacher. They ask meaningful questions. You can joke with them during a lesson and immediately pull them right back in to listening and paying attention. We do so much fun stuff with this school, they make my job worth it. \n\nSchool C. Poor School C gets beat up on by the rest of the county with a lot of racism. School B hates School C because they always beat them in sports. What School B isn't realizing is they are also whipping their butts with test scores. People ask me if I feel safe going to teach at School C. Yeah? While these kids aren't the angels that School A is, they are most definitely a pleasure to work with. I have to call them out for being chatty a couple times, never anything major, and usually they are chatting about something we're learning.\n\nI love my county. But I hate my county. Football is king, kids will be held back grade levels to play football more. The football families could care less about education or teaching right and wrong. However, I often find it humorous when I look at my program where all my after school/most active kids outside the classroom are redneck backwoods hillbillys and our African American kids from bad situations. They get along with each other just fine until School B kids show up. I love using my program to break social norms, especially here in the deep south. \n\nYou may be wondering how School B can be allowed to act that way? Their administration is terrible. The principal there lets them get away with anything. I once had a kid stand up and spit in the face of the kid sitting next to him. I sent him to the principal, she sent him right back and his only punishment was \"don't do that again.\"\n\nI will now step off my soapbox of cluttered thoughts.",
    "title": "How can two schools be so different... nevermind I know....",
    "subreddit": "Teachers",
    "timestamp": 1568737780,
    "score": 11,
    "keyword": "american principal"
  },
  {
    "text": "Autobiography of An American Teacher I've gotten a lot of messages from people interested in DoDEA because I had mentioned I was a DoDEA teacher and that I'd be happy to offer advice about the system. It seemed like the dream job at the time. I got to live overseas and have my house paid for. Well I realized that while DoDEA may still be a good option for some teachers, the system is fundamentally flawed and run by corrupt administrators. There are good principals who squeak by as some of my friends will mention that they've had good principals. I, myself, had enjoyed working with the first principal I had while student teaching with DoDEA. I even liked working with this last set of administrators, but once they realized that I would have the audacity to show video evidence and academic research to them, along with my own personal reasons for having a horse shoe seating arrangement, they began their retaliation. It continued on and on, until finally they terminated me. I've had dozens of students and parents message me trying to figure out what happened and apparently they told my students that I quit. They've also left me stranded in the country and refused to pay for my flight home or to ship my belongings. They also cut off my rent payments, so I am paying for this house and everything else out of pocket, while not receiving a salary. I thought my situation was bad, but then I heard far worse horror stories than mine as DoDEA teachers from around the world began to private message me. I heard from one teacher about a union representative who after being given power of attorney, had stolen items from this teacher. Another teacher told me she was terminated after they found out she had terminal cancer, leaving her without pay or health insurance. Another teacher told me she was falsely accused of child molestation to silence her and nothing was found on her after the investigation. Another was falsely accused of child abuse.  I've heard from multiple teachers who were a few months before retirement and then the school looked for a technicality to terminate them. I've heard from someone who works at HQ that when she spoke out, they began retaliating against her as well. The stress was so bad that she had an actual hole in her stomach due to the stress. I've also heard of multiple other teachers being hospitalized due to stress.\n\n&#x200B;\n\nI used to think micromanagement and wasteful spending were some of the worst problems in education, but I've realized there is far worse. I won't post the link here because I don't want to get in trouble for advertising something, but I would highly encourage you to read \"Autobiography of an American Teacher\" by D.J. Wright. Someone told me about her book after I first started having my own issues. She's a current teacher for the same school system, but she fears she'll be terminated soon as a form of retaliation. But termination would hardly be the worst form of retaliation she's received since she's been literally forced to teach in a classroom leaking chemical fumes, that caused her and her students to vomit blood. If I had read her story prior to my own experience, I might not believe she was telling the truth. But after seeing how low some of these administrators will stoop and also after finding out that the director of DoDEA once bankrupted Providence Rhode Island Schools and then fired all 1,926 teachers simultaneously, it became hard not to believe her. We're expected to save drowning children while we are gagged, and have our feet and hands bound. I can no longer take any advice in education seriously if the root problems are not solved first. D.J.'s book \"Autobiography of an American Teacher\" does not have many reviews at the moment, but I hope to get her book better known. She apparently published it just this past fall, but I had only heard of it this April. These problems are huge and the administrators have been too good at silencing us. I know a lot of the teachers in this subreddit have their own horror stories, so I'd hope they would give her book a shot and alert others of the reality of not only what's going on in DoDEA, but American education in general. Scratch that, education globally, since I've heard these issues extend far beyond American education.",
    "title": "Autobiography of An American Teacher",
    "subreddit": "Teachers",
    "timestamp": 1556814831,
    "score": 3,
    "keyword": "american principal"
  },
  {
    "text": "The New Dilemma: Choosing a Regionally Accredited and Less Expensive For-Profit University for a Master's in Educational Administration I've read several posts concerning why to avoid for-profit colleges. However, the game seems to be changing. There are two major reasons typically posited to avoid for-profit colleges: lack of regional accreditation and higher costs. However, the game seems to have changed. There are now regionally accredited for-profit colleges that are less expensive than traditional universities.\n\nI was enrolled in the University of North Florida's Master's in Educational Leadership program because the program allowed me to use the state tuition reimbursement waiver to cover my cost of the tuition. In other words, I was going to a state school for free-- a no brainer. However, they changed their position on allowing public school teachers to use the waiver. For me to complete my degree, it would cost $18,000. I could transfer to UWF and finish for $11,000. However, my principal suggested the American College of Education where I could finish for $6900 after a 500 dollar credit and transferring my one class. It's a for-profit, regionally accredited, TEAC accredited (NCATE and TEAC have merged so I think this is a non-issue now) school. It prepares me for my FELE exam just like UNF and everyone within the DCPS district have told me where I get this degree from doesn't matter as long as I pass the FELE.\n\nI hate debt. I have no debt. Even on a teacher salary, I can manage $6900. 11k and 18k on the other hand are significantly more to pay for on a teacher's salary. Yet, the damn stigma of my highest degree being from a school called ACE kills me.\n\nGiven the information I provided, particularly because I can get an accredited degree for significantly less than I could from a public university, what do you think?\n\nhttps://preview.redd.it/r5cxowb95mb21.jpg?width=260&format=pjpg&auto=webp&s=e7af887aac2ede2bc4fa26fc6573a834c0bcde4a",
    "title": "The New Dilemma: Choosing a Regionally Accredited and Less Expensive For-Profit University for a Master's in Educational Administration",
    "subreddit": "Teachers",
    "timestamp": 1548005308,
    "score": 3,
    "keyword": "american principal"
  },
  {
    "text": "First Gen \"Fuck Up\" - where do I belong?  \n\nI’m 26 years old and first-generation American, living with various mental health conditions. I’ve been self-employed since I was 19, with the exception of a few part times gigs here and there, and I’ve hit a breaking point\n\nWith the help of an academic scholarship, I completed my Bachelor's degree in 2015 in Communications and Media. I was an excellent student in high school, and knew that I wanted to continue my education, but was struggling with various undiagnosed mental health conditions and didn’t fully understand how college “worked,” or what I wanted to do specifically. My entire college experience was one of survival. I just wanted to get my degree and move on. I found counselors and advisors to be extremely unsupportive. I knew I wanted a creative, unconventional career and life in general, but didn’t want to pigeon hole myself into one area and felt quite lost throughout college.  \n\nI nannied throughout college to pay my rent, worked a few customer service and sales/retail-oriented jobs. I fell into art modeling, extra work on tv and film, and occasional print and runway modeling gigs. \n\nI started progressing slowly in entertainment and worked as a stand-in, got featured roles and even a few principal roles in commercials. \n\nI started working as a brand ambassador for experiential marketing agencies. I also work as a guest speaker for a mental health non-profit and share my life story to help spread the word on mental health to end stigma. \n\nI feel like I’ve only ever dipped my toes in things. I have little to no savings (3,000 currently) but no debt, and a solid credit score (780+)  I’m told over and over again that I’m not in a bad place, but I feel stupid, unaccomplished and frustrated. \n\nI’d love to consider having a youtube channel, a podcast, perhaps even continuing acting…but I feel like an imposter and know these things will have to be hobbies that may not grow into stable sources of income. My degree gave me the flexibility to explore various electives, but I think I look unemployable to most folks because I don’t have a “thing.” \n\nI also have over a decade of vocal training and theory. I miss singing and dancing. It was a regular part of my childhood. \n\nI’m told that having a stable 9-5 would help me manage my mental health conditions, and give me a sense of financial security. I also feel that I wasted most of my early youth focusing on getting good grades in subjects I could care less about, and don’t want to become someone that comes home and does nothing after work to “unwind” from the mindless, desk job bullshit I’d do.\n\nI’m aware that I CAN find a 9-5 that works for me, save money, and still have it in me to work on my own projects…but I don’t wholeheartedly BELIEVE I can. I don’t understand most job postings, let alone the descriptions and job titles accompanying them, and the idea of making a choice terrifies me. I’ve only ever known survival and gig-based work. \n\nI feel an insurmountable shame and guilt. My parents want to see me happy and successful and tell me that I am choosing a life of hardship over something stable. \n\nI don’t trust my ability to make decisions anymore.\n\nI acknowledge that this is strange, and I’ve attempted to shove my lift into some sort of box for people to open and unravel. \n\nI want to attach my resume but it appears that I can't on this thread? \n\nAny advice would be appreciated.",
    "title": "First Gen \"Fuck Up\" - where do I belong?",
    "subreddit": "careerguidance",
    "timestamp": 1574439037,
    "score": 9,
    "keyword": "american principal"
  },
  {
    "text": "25 years ago, 14-year-old Jenny Lin was murdered in her own home. No killer has been named to this day. **TL;DR:** On May 27, 1994, two days after her 14th birthday, Jenny Lin had come home from school, talked on the phone with a friend until 5:15pm, and then been murdered shortly afterwards. At around 6:45pm, John Lin returned from work to find his daughter partially naked and repeatedly stabbed in their second floor bathroom. She was dead, and the killer hasn't been found since.\n\n**NOTE:** I [wrote more](https://www.reddit.com/r/UnresolvedMysteries/comments/btlc9a/25_years_ago_someone_fatally_stabbed_14yearold/) about the actual facts of the case and the murder in /r/UnresolvedMysteries, however for this post I'd like to focus more on Jenny herself as well as her family.\n\nI don't know about you guys, but I've found that there aren't very many unresolved murders involving Asian-Americans. So I took a special interest yesterday when I saw [this tweet](https://twitter.com/henrykleeKTVU/status/1132123234898305026).\n\nAccording to the [About Jenny](https://jennylinfoundation.org/about-us/about-jenny/) page on the Jenny Lin Foundation site (more on that later), Jenny was a bright young lady with lots of potential. She was born in Castro Valley, California; started dance lessons at age 3 and continued until she was 12; did piano for 8 years; and played the viola starting in grade 6, doing so well that by eighth grade she had become the sole and principal violist of the middle school orchestra, been invited to play in the Castro Valley Chamber Orchestra, and won a few awards. She also apparently loved school, especially math, reading and writing, and had been planning to attend U.C. Berkeley’s Academic Talent Development Program to study marine biology. And like all us other growing Asian-Americans preteens, she had her own personal interests in music (\"Phantom of the Opera\" and U2), fashion (she was fascinated with her older sister's clothes), extracurriculars (running and playing tennis), and hanging out with friends.\n\nAs for her family, [this paragraph from one of the articles I've read](http://www.sddt.com/News/article.cfm?SourceCode=19980929cg) sticks out to me:\n\n>The Lin home was on top of a hill, at the end of a quiet street. It's a neighborhood with little foot traffic. There's no reason to be there unless you live there or know someone who does.\n>\n>Five years ago, that home was at the heart of the Lins' American Dream. The Lins were successful professionals, their two daughters pretty and bright.\n>\n>Jenny was a straight-A student with a dazzling smile who liked the band U2. A musician herself, she played both the piano and the viola.\n>\n>\"As I sit on my front porch looking out I feel totally safe and free,\" she wrote once in a poem she titled \"Sunset.\" \"It is a strange feeling. It's just my head gets light and my whole body gets a warm chill.\"\n>\n>Her mother remembers those days, carefully choosing the words to describe them.\n>\n>\"Everything in our lives was like heaven. We used to ask each other, 'I wonder what we did in a past life to deserve such happiness?'\" Mrs. Lin said. \"Then all of the sudden it dropped from heaven to hell.\"\n\nThe Jenny Lin Foundation is a foundation that her parents started in her honour. The foundation sponsors several music and safety events in the East Bay area, including a free annual youth music camp and concert and scholarships for young musicians.\n\nEvery year since Jenny died, her parents have also held a memorial service and walk in her memory, in hopes of generating information that will help investigators identify and arrest Jenny's killer, who has never been officially found. From [this article posted a few days ago](http://www.ktvu.com/news/renewed-hope-that-dna-advances-will-solve-jenny-lin-case-as-family-holds-vigil-25-years-later):\n\n>On Friday night, the Lins held their annual event at the Castro Valley library.\n>\n>They say they believe it's only a matter of time before they get justice for Jenny.\n>\n>Young musicians performed during the memorial service.\n>\n>The Lins say through them, they find hope amidst the pain of losing their daughter who loved playing the viola. 　\n>\n>Mei-Lian Lin describes her emotions, \"Disappointment, frustration, desparate.\"\n>\n>Jenny was killed two days after turning 14-years-old.  \n>\n>\"Ever since then, every day is torture for us,\" says John Lin, Jenny's father.\n>\n>[...]\n>\n>Among those at the memorial was a classmate and friend of Jenny's. 39-year-old Yen Truong is now a mother of two.\n>\n>\"I think of her parents and the years they lost with her,\" says Truong.\n>\n>Jenny's parents have moved to Southern California, but they return every year to hold a memorial service.\n>\n>\"I made a promise to Jenny at Jenny's grave that I vow to solve this case for her no matter what it takes,\" says John Lin.\n\nI don't know Jenny or the Lin family personally, but I do feel especially sad after reading all of this. I am glad that some small good (i.e., the Jenny Lin Foundation) came out of such an incident, but it's heartbreaking that something so dark and awful occurred at all. I hope that Jenny and her family eventually find peace.",
    "title": "25 years ago, 14-year-old Jenny Lin was murdered in her own home. No killer has been named to this day.",
    "subreddit": "asianamerican",
    "timestamp": 1559007414,
    "score": 246,
    "keyword": "american principal"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 504,
    "keyword": "american principal"
  },
  {
    "text": "Feminism and the Law... *(P.S.: This comment was written in the fall of 2018 after reading a small essay by Rothbard on* [*LewRockwell.com (Click here)*](https://www.lewrockwell.com/)*, a major Libertarian Portal managed by Lew himself. I add to it a little bit for clarity. Its interesting because* [*Ayn Rand (click here)*](https://www.britannica.com/biography/Ayn-Rand)*, a Libertarian and pseudo intellectual, is a hero of feminists…)*\n\nObjective truth appears to exist only in a limited “time/space”. Einstein’s theory has progressively been used as an analogy for our current cultural revolution. In this age of excessive yet incompetent “scientific vulgarization” and mass media “education through propaganda”, science is often the first victim. And law, as is moral, are both sciences, yet soft sciences, and therefore bend easily under constraints, especially when these constraints contaminate the core of Good Faith necessary to participate in our civilization.\n\nThe greatest problem with our increasing tendency to economies of scales, is that they are not well adapted to the social environment. And in this sense, a limited local community may more adhere to a set of limited but well controlled and understood references. Yet. Globalism, and its companion structure, Matriarchal organization, performs on the basis of infinite references. The truth can be objective, often ceteris paribus, but in infinite choices of references, effectively, everything can only be relative, since the degrees of dimensions offered in terms of experience tend to infinity.\n\nThe core strategy of the globalist social revolution sits strong on this premise.\n\nBut let’s go back to the 10 Commandments: does everyone really know right from wrong.\n\nOur 10 Commandments, even for those who don’t adhere to Christian religion, are at the core of modern Law. At each Commandments the Law has sown “Unless”…\n\n>*It  is primordial, when addressing these kinds of discussion, to understand  that the 10 Commandments, which are part of Judaism and Christianity,  are universal archetypes which have been expressed universally in most  early civilization, in Islam, Buddhism, etc… While not expressed in the  same manner, all religions have most of these basic laws within their  tradition as pillars of organization and respect of others. And in  Western Justice, while these 10 Commandments served as reference, other  concepts are part of the pillars of Democracy, as the concepts of rights  surrounding Private property.*\n\n**You shall have no other gods before Me, unless…**\n\n**You shall not make idols, unless…**\n\n**You shall not take the name of the LORD your God in vain, unless…**\n\n**Remember the Sabbath day, to keep it holy, unless…**\n\n**Honour your father and your mother, unless…**\n\n**You shall not murder, unless…**\n\n**You shall not commit adultery, unless…**\n\n**You shall not steal, unless…**\n\n**You shall not bear false witness against your neighbour, unless…**\n\n**You shall not covet, unless…**\n\nFor example, an easy one is “You shall not murder, unless in self-defense”…This is a Natural Law contextual adjustment.\n\nTo every Commandment, a “Vox Populi” would complete the “unless” proposition in different manners. And in today’s globalist world where every human on the planet appears to be American, at least in concerns of hopes and freedoms…, in an infinite number of ways, the variations would be endless…\n\nMany take these Commandments as De Facto, yet even our Laws, and Interpretations of, have modulated each of these Commandments as to allow for exceptions.\n\nIt is these sets of exceptions that take expansion as our sets of references become larger.\n\nAs we castrate our localities progressively, we cannot expect but everything to become increasingly relative and unmanageable, except through ill faith and corruption, fake-ness and appearance of integrity, but rampant with conflicts of interests.\n\nI read, last weekend an article on Customary Law by Rothbard (chief intellectual in matters of Law of the Libertarians)…I was intrigued by the following proposition which first presented: \"...natural law as void of adaptation to Context...\", and that Libertarian Justice should be one where the Judge both writes and interprets the Law….\n\nThis is where, despite its profound condemnation of it, Libertarianism meets with feminism. The patriarchal system we have created is rooted in the separation of powers. Legislators write the Law, Justices interpret it. And the inherent shortcomings of Justices writing their own Laws, as described by the expression “Judicial activism” frustrates many conservative minds…yet is a pleasure to the Feminist thought adherent.\n\nGlobalism, social economies of scales, Judicial activism, relativism all belong to the Feminist political sauce….\n\nNow, Rothbard explained that Justices need to be more hybrid and shift from Natural to Customary law in order to give good balance to context…\n\nYes, certainly…and while Moliere quipped: **Only Theater is real, all else is Comedy…**\n\nYet, Feminists always wanting to be right and win, they want the institution of Justice to be malleable in good order…having a Law enforcement and a Judicial 98% positively bias towards women is not enough, they want more…\n\nIt  may come as a surprise for those not familiar with the philosophical  principals of Western Law, but “Women’s Justice” is what brought  expressions of justices such as Lynching. Women’s Justice is Arbitrary,  its core structure is Emotion…its a Spontaneous Institution (which means  it took place spontaneously, without community discourse or reflection)  which precedes the Construction of Western Justice. In fact, women’s  justice was meant to address situations which could not appear to be  adequately addressed by other structured judicial institutions or expressions, as a last recourse (never as a first one)…it was: point the finger and lynch…a bit  like the #MeToo Movement.\n\nAnd worryingly, Rothbard  “acclaimed judicial intellectual” of the Libertarian movement explained  that there is no greater Justice than Women’s justice…\n\nAnd the Feminists to Claim: “**There is only one absolute Objective Truth, it is that women are always Right…the remainder is all relative**”.",
    "title": "Feminism and the Law...",
    "subreddit": "MensRights",
    "timestamp": 1563020630,
    "score": 3,
    "keyword": "american principal"
  }
]