[
  {
    "text": "Stalker much? AITA?\n\nHad an interesting week interacting with a non-parent. I’m an ESL teacher and we have a new family with a complicated story-Syrians, moved to Lebanon, sponsored by Catholic charities, living in a house owned by a local Presbyterian church. The family speaks Arabic, and a representative is the Presbyterian church has been coming to the school with the family to register each student (they have three). She is not an emergency contact, the family hasn’t asked us to include her, and she doesn’t speak Arabic, so I’m not sure what time she is filling here. \n\n Thursday last week we had open house. At the end of the night I got an email from her saying that she didn’t understand why the last student to register in the family still had no schedule. He has met with the counselor just that day and as a senior, we needed to review his transcripts carefully to ensure he was enrolled in the right classes. I had plans to be out the following Friday, so I forwarded the email to the school counselor and the ESL case manager in charge of that child’s end of the alphabet. I don’t know why she emailed me in the first place. As the department chair, I am kinda involved in each student, but I’d like to see the rest of my team approach a situation before I step in. \n\nI come in this week on Tuesday (Monday there was no school for Labor Day) and find a voicemail from 9:00 am Friday insisting that I needed to call her back to discuss the reasons why this student still did not have a schedule. I also got note in my mailbox that was written in the back of an email her husband (yet another legally unaffiliated adult) had sent to the case manager with a written note complaining that the case manager and guidance counselor weren’t responding to her, saying it was ridiculous she had to resort to writing a not on paper. The letter explained how she heard a friend who worked in special Ed at a neighboring district who suggested that these students should not be enrolled in American history class until they’ve learned English. Well, I hate to break it to her, but that’s not how the system works.  State law still requires that they earn all required credits in the span of four years, so they take classes in the same schedule as a native English speaker. After talking with the front office staff, I  B found out she had wanted to come in and talk with me on Friday when she wrote the note and made enough of a scene that the secretaries now call her crazy. And they tell me she was waiting in her car at the school that morning. \n\nThe waiting in the car was my final straw. I emailed the story to the principal and the school resource officer. The last update I got from the principal said that he was going to take part in the next meeting that involved this crazy church lady to establish protocols and roles, but I got the feeling he thinks I’ve overreacted. \n\nTLDR/ crazy lady with no legal rights to students is harassing me for information I can’t give.",
    "title": "Stalker much?",
    "subreddit": "Teachers",
    "timestamp": 1694221438,
    "score": 4,
    "keyword": "arab principal"
  }
]