[
  {
    "text": "Did I mess up my career? How do I transition out of this? Hey folks, \n\nAfter a few dozen interviews Im starting to get to a point where I feel like Im unemployable and could uae advice on where I might target the job search.\n\nQuick stats:\n\n- pieced together my degree across deployments, no prestigious name on my 4 year.\n- 9 years military, lead groups from 3-20 doing Nsa intel for top 10 national threats in theater\n- arabic linquist\n- wounded in combat/gap\n- 1 year pricing analyst\n- 1 year admissions\nAnd then the hard part. \n\n- 4.5 years fortune 50 saas sales. Promoted rapidly through bdr,inside sales,partner,customer success. Then finished my time there spending two years building a monthly subscription service version of our platform. Took it from business model to 300 customers and 40 people. Working with almost every leader globally. Built and lead a sales team that was experimental and non traditional. built new experimental processes in pso, engineering, sales engineering, success, partnerships, and business development. Product managed the build of a custom crm for the team. Etc.\n- vc company carves us out, reorgs, cuts my product, fires the team.\n\nIssues:\n- cant get an individual contributor job in the four IC roles I held - they either think Im under qualified due to such a short time in each specialty,  or think that I wont be happy/wont stay. Sometimes dq'd by old pay being top of range despite assurances id come down.\n\n- they dont recognize the miltary experience at all. Which is a common issue.\n\n- cant land the management or director roles - want more experience or I dont have the exact experience building the same exact org theyve already designed for the role. \n\n- not getting responses from operations, product manager, or project manager\n\nAnyone have any suggestions of role titles or where I could start to look or what to do? Before I had the manager title, id constantly have written offers to turn down. But now without a job, and having a lot more experience, it feels like Im unemployable suddenly.",
    "title": "Did I mess up my career? How do I transition out of this?",
    "subreddit": "careerguidance",
    "timestamp": 1672644703,
    "score": 9,
    "keyword": "arab director"
  },
  {
    "text": "Right career path ? Hi, I am currently a Police Officer for a university. Its a pretty cush job but with not much room for advancement. Im about to have my masters in Criminal Justice ( I have a BS in CJ). I want to make more money in the university. I figured eventually being a director of something. I dont think the Police job is the right path for it. There is a job as an international student advisor. That might pay me the same or more . Im gonna ask for 10 k increase. I speak Arabic and english at a native level, I figured it would help. Do you think a path through advising will help?. I also plan on becoming an adjunct professor after getting my masters. Do you recommend a different career path not in law enforcement. Im in Tennessee and my ideal salary would be a base of atleast 60-70k . I make 50 now without OT and training",
    "title": "Right career path ?",
    "subreddit": "careerguidance",
    "timestamp": 1686194566,
    "score": 1,
    "keyword": "arab director"
  },
  {
    "text": "Mistreatment of women in my country  \n\nHello girls, I'm Moroccan and I just want to let my thoughts about because I'm frustrated, I have observed that a significant number of Moroccan Muslim( my default assumption) men, and men from other Muslim-majority countries like Egypt and Algeria, treat women unfairly and disrespectfully. Some women also exhibit this behavior, but it is unclear what else these individuals have in common other than the religion, I'm trying to understand what is the common ground that they share. although it mostly has nothing to do with what Islam preaches. For instance, I have come across a Facebook group with over 200K members that refers to women in derogatory terms such as \" lmra hashak\" which is kind of hard to translate correctly but it means something along the lines of \" women are something disgusting, something you're sorry to see\" because the term \" hashak\" is mostly used while talking about donkeys or dogs  ,and \" 9hwya\" which literally means \" the brown girl\" but in a very offensive manner, obviously both racist and degrading because that's what their intention is while using it. Other Arabic groups share similar content, including pictures that are demeaning to women. Additionally, there was a post mentioning a national team competing in mathematics with only one girl and four boys, people left derogatory comments, calling women stupid. because there aren't more girls there, and because in my country it's known that girls mostly get higher grades and pass more exams than men, such as exam to become a lawyer teacher etc., so when there is any post about any team that contains more men than women they immediately make everything girls did worthless,  And It happens with any post where there is anything about women sadly. I always check the comments hoping I'm wrong, just to be let down. They also do not acknowledge women's achievements throughout history or recognize the success of many women who did not get the recognition they deserved due to historical discrimination.\n\nIt is disheartening to see that many individuals in these communities blame the victim in rape cases and even defend pedophilia. In my high school, I witnessed four teachers who slept with 13-15-year-old girls or even younger. I want to understand why such mistreatment of women is prevalent in these societies and why some individuals think it is acceptable. I had hoped that in other environments such as university, things would be better, but unfortunately, I was once again disappointed. Even my professors speak about women in a derogatory manner, giving examples of them being stupid, crazy, and so on, even when the material they're teaching is unrelated to such topics. When they ask my mostly male classmates if they agree, they laugh and make even more offensive remarks. Some even go as far as to suggest that they would do worse things themselves.\n\nI once even tried to stop the professor and all he did was telling me \"you'll understand why men are better when you get married\". \n\nI just want to know if it's okay for me to have hatred for men in my country, and all the ones with similar mentality, or am I wrong? because I don't know why even the girls agree with them, if there is a rape case, it's women's fault, if there's assault case, it's women's fault. etc.\n\nThere is also a whole group that has the hashtag \"#NoToMarryingWorkingWomen\" where they say they won't marry any woman who works, because she gets exploited by her director and she isn't only his, but his and the director's too, and that they don't cook, and won't find time to take care of the children and him, and because she will start to go out with friends etc.\n\nAnd the list goes on obviously. \n\nI just don't get the hatred, is this also this common in your countries?\n\n Examples of such posts that they share, I provided translation :\n\n[https://ibb.co/c8Rn9ZM](https://ibb.co/c8Rn9ZM) \\- this photo was taken from a video where a girl was walking with a skirt and some man lifted her skirt and obviously sexually harassed her and slapped her bottom. they call him king for doing so. and when this happen most men were saying the girl deserved it for going out like that.\n\n[https://ibb.co/wQwzDm3](https://ibb.co/wQwzDm3) : insulting an inventor, and the comments kept saying she didn't help them make WIFI, she just opened her legs.\n\n> [https://ibb.co/jwM9Cjh](https://ibb.co/jwM9Cjh) : as for this one, the post says \" does women deserve to and the answers are \" she does \" \"she doesn't\" and everyone picked she doesn't, meaning they stopped at \" she doesn't deserve \" referring to she doesn't deserve anything. \"",
    "title": "Mistreatment of women in my country",
    "subreddit": "Feminism",
    "timestamp": 1683878025,
    "score": 546,
    "keyword": "arab director"
  }
]