[
  {
    "text": "Out of all the cases you've read so far, which one(s) pissed you off the most, and why? &nbsp;Have y'all ever read a case that boils your blood and ruins your day even just thinking about it? We all have those specific decisions that make us feel some kind of way, and I'd love to know which ones have affected you the most. I can't tell you how many times so-called jurisprudence made my jaw drop by irrationally legitimizing some serious bullshit. This might sound silly, but sometimes I'll get seriously pissed off thinking about judges who've a mockery of the law by perverting the very institution protecting our rights into promulgating injustices. Here's my list of the some of the cases I consider to be among the most egregious examples of this. Let's get the most obvious one out of the way. You already know which one it is without me even having to say it:\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n***Dred Scott v. Sandford.*** Universally regarded as the worst Supreme Court decision of all time, and rightfully so. The ghost of Roger Taney can catch these fucking hands any day of the week. The institution of American chattel slavery was an abomination to both God and mankind, a crime so unbelievably heinous that even those who tacitly endorse it are profoundly evil. But a man who abuses his immense power attempting to perpetuate that horror forever, well, he's cast himself down to the very bottom of the lowest circle of hell and started digging. Not only did it deprive African Americans of the basic rights even the racist Founding Fathers allowed them, it became a catalyst for the bloodiest war in our country's history. This smug piece of shit, believing he'd settled the slavery question forever, wrote words that killed hundreds of thousands of people and dehumanized even more.\n\n\n\n&nbsp;\n\n\n\n Yet **even someone who'd actually agree with dooming an entire race to lacking any rights whatsoever** couldn't even justify effectuating it the way the Court did, because this unbelievable asshole not only wrote his opinion *after* dismissing Scott's claim on standing grounds, he also attached a completely unrelated coda invalidating the Missouri Compromise when he had absolutely no authority to do so. Anyone with even cursory knowledge of the law can see his violation of the separation of powers in effectively legislating from the bench. The Chief Justice is supposed to be the brightest legal mind we have, so that bastard knew exactly what he was doing. His disgusting attack on the Compromise was, in effect, an advisory opinion masquerading as \"jurisprudence\" comparable to a five-year-old's crayon drawing of a swastika. Even worse, six other Justices participated in this gang-rape of the very rights our country was founded on. It was not only substantively unjust but procedurally unjust as well. The only two men with any sort of backbone in this story are Dred Scott himself and Justice Robbins (the only Supreme Court justice to resign on principle.) The rest of them deserve to burn (and yes, that includes McLean too).  \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n***McClesky v. Kemp.*** What do you get when you combine racism, injustice, and denial of not only factual proof but basic mathematics itself? You get an extraordinarily tragic and infuriating example of how courts have continued to deprive African Americans of their voice in the judicial process even almost a century and a half after the Dred Scott decision. The abolition of the pre-Furman framework for capital punishment was in large part due to systematic racial disparities in the imposition of death sentences. Our current post-Gregg framework, in contrast, was partly born from Georgia's desire to absolutely kill the shit out of Troy Gregg, as one of five states providing a template for the reintroduction of capital punishment. To do so, they convoluted their process in a way that addressed every concern in *Furman* to comply with the Eighth Amendment, and quickly extinguished any other lingering constitutional issues (e.g. Coker v. Georgia). This case directly exposed the post-Gregg framework as the charade it always was; a continuation of the policy of certain death for black defendants alleged to have committed **any** sort of crime against a white victim. \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThe disparity was always odious and obvious; black men accused of raping white women were almost always executed, with very few exceptions, if they even had the chance to make it the gallows before they were lynched by a mob. In contrast, the execution of white defendants for rape was very rare, and almost all of these cases involved defendants convicted of raping a child. McClesky's thorough, comprehensive, scientific analysis of every single Georgia death sentence statistically proved that black defendants accused of killing white victims were **TWENTY-TWO TIMES MORE LIKELY TO RECEIVE A DEATH SENTENCE THAN BLACK DEFENDANTS ACCUSED OF KILLING BLACK VICTIMS**, and more than seven times more likely to be sentenced to death than white defendants convicted of killing a black victim. The denial of such empirical and objective data can't be adequately explained by anything other than the majority advocating, or at the very least actively condoning systematic racism. \n\n\n\n\n&nbsp;\n\n\n\n\n\nThis alone is already unconscionable from the highest court in the land, but the most egregious part of this case is Powell's inexplicable and unconstitutional assertion that **even if Georgia's sentencing policy being racist were taken as true** (remember, their pledged avoidance of this was the whole basis they were allowed to bring it back)  McClesky had no recourse because no racial bias could be proven **in his specific case.** I can't even explain how wrong that is, on so many different grounds. The granting of rights to everyone through the granting of rights to an individual plaintiff has long been one of the most basic cornerstones of judicial function, and denying that to McClesky was, in effect,  a denial of rights to all African Americans, and it killed him. Even Powell himself admitted years later that he wished he could go back and change his vote. Unfortunately, McClesky had already been executed by then.\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n***Ashcroft v. Iqbal.*** This is an example of a recent case that makes scholars throw up their hands and go, \"yeah, I get it, but... come on, seriously?\". It's the legal equivalent of what happens when an unstoppable force (Iqbal's claims) meets an immovable object (the US government's storied commitment to covering its own ass when committing human rights abuses.) The extraordinary lengths the government went to in order fuck over just one guy over were so extensive that they irreversibly changed the way the ENTIRE AMERICAN LEGAL SYSTEM WORKS, FOR EVERYONE, disadvantaging every single civil plaintiff in the the past thirteen years, just to deny this one guy his basic rights. The Court's complete disregard for the well-settled logic behind the doctrine of respondeat superior and vicarious liability is already bad enough, but its extraordinary far-reaching consequences for civil procedure have irreparably harmed the whole idea of what litigation actually exists for, and will most likely continue to do so for a very long time. \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThis completely unwarranted, arbitrary imposition of the plausibility standard infected a mostly-objective process with an extremely dangerous element of subjectiveness. Who's to say what's actually \"plausible\"? The previous framework was imperfect but far more just: claims were dismissed immediately if they were obviously factually impossible, vexatious, malicious, 12(b)(6)'d, or otherwise unacceptable for litigation. these standards are not only very clear, but necessarily mostly or completely dependent upon consideration of objective facts. Plausible? I'll tell you what's fucking plausible. It's plausible that the Supreme Court secretly conspired with the executive branch to change the way the whole game is played, just to excuse its abuse and arbitrary detention of Arab Muslims in the aftermath of 9/11. It's plausible that they were looking for the a perfect test case to come along and serve as the excuse to introduce this plausibility standard, and this one just happened to be the right fit. And it's *extremely* plausible that everyone responsible for this decision can suck my nuts, because the last thing on Earth I ever needed as a manic 1L was a few dozen more pages of Civil Procedure reading than I otherwise wouldn't have had. Thanks a lot!\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n***Bank Markazi v. Peterson.*** Iran, Iran, Iran. How many times have we seen the incredible lengths our judiciary has gone to in order to break the fundamental rules of our own laws? They love to carve convenient exceptions out of the very concept of what laws and precedents mean, just to get back at them for the 1979 hostage crisis. That's the only explanation for all these similar rulings involving Iran -- far too many to list here -- that completely defy any logical justification and contradict everything the separation of powers stands for. The prohibition on legislative meddling in the specific outcomes of individual cases is, and always has been, one of the most important protections of the separation of powers, without which judicial power becomes completely meaningless, I mean like seriously  on some pre-Marbury shit, so it's one of the most important safeguards we have against violating that separation. Allowing the legislature to influence cases this way is downright incestuous, a distant and obviously legally different kissing cousin to the idea behind double jeopardy as well, if the legislature truly wants to play house like that and act as a quasi-judiciary (although not everyone would agree with this comparison, I know that's kind of a stretch.) \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThe judiciary means absolutely nothing without the absolute assurance of its finality. The judiciary interprets the legislature, and allowing the legislature to have any control at all over a pending judicial action would in effect allow the legislature to interpret itself. I don't have to expound on how dangerous that is. Justifying this decision on the argument that this law is acceptable because it applies only to a specific pending trial rather than its outcome, or other unrelated trials, and only eliminates all of one party's defenses rather than deciding their fate entirely, has the ultimate effect of arbitrarily giving Iran a snowball's chance in hell of exercising the same rights any other defendant would have. It's the legal equivalent of a boxing match where one of the fighters has both of his hands tied behind his back. Not only was this decision an egregious denial of due process to one defendant under a certain docket number, this was done with FIFTEEN OTHER DOCKET NUMBERS. I know they're still salty about the hostage crisis, but opening up a portal between two sources of power designed to be eternally immiscible creates the possibility of applying it to cases involving Americans as well, or really, anyone. The fact that Justice Ginsburg, of all people, wrote the majority opinion is shocking to say the least.\n\nAnyway, what cases have pissed you off the most, and why?",
    "title": "Out of all the cases you've read so far, which one(s) pissed you off the most, and why?",
    "subreddit": "LawSchool",
    "timestamp": 1618680250,
    "score": 39,
    "keyword": "arab judge"
  }
]