[
  {
    "text": "\"It's better it's coming from your mom\" says our aunt to my sister, who's been slutshamed. I am the brother to a wonderful 17 year old sis, who has a boyfriend. She always wants to be with her boyfriend, which is understandable, but one must be cautious during these hard times. When asked, our mom told our sis to wait off meeting him \"due to corona\".\n\nA day later, our mom gets a headache and a sore throat, and the next day she brings four friends over to talk about whatever middle aged women talk about. Seeing this, my sis disregarded what our mom said and snuck out at midnight.\n\nOur mom, unsurprisingly, discovered this. She is understandably angry, and my sis knows what she did was wrong. After this reasonable discussion, mom then goes on ranting about how stupid my sister is \"for not having the thought to sneak back in while [Mom's] still asleep\" instead of \"doing ... whatever you and [boyfriend] always do all the time\". \n\nThis is with the context, a few hours after mom screams at my sister for \"having sex - that's why you have birth control\", having hyperprudish opinions also about me cuddling with a friend, and being twice divorced from horribly abusive marriages.\n\nI got reasonably outraged and called out our mom, trying calmly to tell her that she is going over the top, and she should calm down before continuing to talk to my sis about anything. She goes on a screaming rant about how Filipino children must be submissive no matter what to their parents, and that Swedish children are undisciplined brats. (Ironically, she and her now-ex rants about them \"damn Arab\" neighbours not willing to attempt to assimiliate into the local culture.)\n\nOne thing leads to another and she gets a mental breakdown in my computer room, attempting to destroy my work PC, and me restraining her as she thrashes around, trying successfully to bite my wrists, in full view of my 11 year old sister. I got some scars from it, but I did not even notice the bleeding until after the adrenaline wore off. I think this is a hell of an escalation from me defending my sister from slutshaming, r/insaneparents material.\n\nAn hour later, my sis then talked via text with our mom's sister, our aunt. Auntie here is best friends with our mom, and managed to get some info about what happened - albeit obviously biased. My sister breaks down crying, texting how she cannot accept being slutshamed by our mom.\n\nAuntie replies \"at least it's your mom\". \n\nI know my sis has been slutshamed by others. I know all my female acquaintances (who talked about it) have been unconsensually degraded sexually. Even I, a man, have been slutshamed too. I know it is nothing compared to whatever parents can come up with. \n\nOur aunt tries to excuse our mom's behaviour by saying \"you'd understand her if you're experiencing what she is going through (referencing the hair-pulling divorces she's experienced), and that her high blood pressure which runs in the family may put her at risk of violent impulses and sudden death\".\n\nI got mixed negative feelings, but I feel good that these scars I got are from defending my family. I need some input.",
    "title": "\"It's better it's coming from your mom\" says our aunt to my sister, who's been slutshamed.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1610461100,
    "score": 1,
    "keyword": "arab manager"
  },
  {
    "text": "Is it a good idea to message the CEO? So there’s this company that I’ve been really wanting to work with. I have already had two interviews done with them previously for two different positions: Admin Sales and Account Manager. \n\nThe hiring for the Admin Sales position was put on hold after my first interview until next year, and so I requested the recruiter to interview me for the position of Account Manager as it really matched with my profile. \n\nAfter a month, I was interviewed for the Account Manager position. My first interview went pretty well, but since it was a replacement position, they needed a fluent Arabic speaker to maintain the team balance. And so I was not selected. \n\nNow the Account Manager position has reopened. I am thinking of messaging the CEO on LinkedIn, explaining him my story and how much I’m willing to join the company, and possibly pass a word to the recruitment team so I can have a strong backing.  \n\nI’m still confused about this approach. Do you think it would work out?",
    "title": "Is it a good idea to message the CEO?",
    "subreddit": "careerguidance",
    "timestamp": 1639625951,
    "score": 17,
    "keyword": "arab manager"
  }
]