[
  {
    "text": "Toxic workplace environment Before I start my story I would like to note that this story of my place working at this company has been amended so that only the first name of the workers given are named so that the full identity is not revealed. Also the business name is not revealed as this is a true story of my time working at the business as I worked at the business for around 7 months in the finance department before I left.\n\nI start working at the business in early January 2023 and am trained by a person called Morgan who is a few years younger than me. There is also my boss who is a woman called who has been working at the business for quite a while as well. I start working there and my boss tells me that Morgan will be leaving the business at the end of January 2023 and Morgan and his girlfriend will be doing a world tour covering various different countries located in east Asia as well as also travelling to parts of Oceania like Australia and New Zealand and are planning on doing this trip for approximately 3 months then returning back to the home country. That gave me approximately 3 weeks to spend with him before he left the business to go on his travels. At the end of my first day I was about to leave the office however Morgan tells me that before I leave the office I need to send a email to the CEO (Paul) to let Paul know all the tasks that I have completed today. I was confused by this but Morgan tells me that it is a mandatory procedure that everyone in the business is required to do (there is approximately 75 people who work in the business). Then I kept forgetting for the next few days after that to send the email to Paul about this which Nicola tells me to do. I quickly figured out that most of the job could be simplified and automated away given that it was all in excel and functions such as (COUNTIF, SUMIF, IF and VLOOKUP) could be used to simplify my job. Then around a week before Morgan was due to leave a woman called Catherine started working at the business and stated that she previously worked at her previous company for over 20 years but was forced to leave her previous job after it was announced that her job was being moved to Canada which she was not willing to relocate to. I got along with her well and it got to the end of the day and I asked her that I will see her tomorrow and she then looked at me and said “I think that I will see you tomorrow”. This left me confused as she was implying that she wasn’t sure if she was or wasn’t going to go to work the next day. The next day she arrived to work and Nicola told me to show her Sales Invoices and I provided a detailed explanation of how to do them and she stated that it is too complicated for her. Nicola then called Catherine into her office and they were in the office for over a hour which confused me and then Catherine announced that she was leaving the business and got her stuff and said that it was nice meeting me and Morgan and she left. I asked Nicola why she left given she only worked there for around 10 hours and she stated that the job was too complicated for her to do however a few days later Morgan told me that she got “bad vibes from the office” which caused her to leave. Then a few days before Morgan left the business he looked at me and told me that Nicola was also planning on leaving the business. I then asked him when Nicola was planning on leaving the business and he shrugged his shoulders and stated that he didn’t know when she was planning on leaving the business. It got to Morgan’s final day in the office and I said my fair wells and wished him the best of luck in whatever he decides to do in life. I then looked at Nicola and told her that I would see her tomorrow. I arrive to work the next day and walk over to my desk only to discover that my computer has disappeared which confuses me and I look around the office trying to find my computer. Then Paul the CEO asks me to go into the boardroom which is a separate room from where everyone else sits and another person called Andrew who is second in command is also in the room. I sit down and Paul tells me that not only did Morgan leave the business yesterday but also my boss Nicola also left the business on the same day even though she was meant to leave at the end of April 3 months after her original departure as she left at the end of January. He told me that I was the only person in the finance department for now and I would have to report directly to Paul if I got stuck. I was then moved to sitting near a woman called Tina who was the head of HR (Human Resources) and was also personal assistant to the CEO. I then started implementing the formulas that were required shortly after I sat at my new desk to simplify my job. \n\nAround a month after I started, I started doing IM’s which are Profit and Loss statements where you have your gross and net profits and then you have addbacks once the business is sold as our business is basically the business equivalent of selling houses and we earn between 2% to 5% commission per sale based on the business sale price. The IM’s are used in brochures which we send to the clients who might potentially buy a business. I start doing it alongside 2 other people who are new to it and then one day Paul the CEO sends a email stating that I won’t be doing that job and it will instead be done by 2 other people exporting some of my job out to others which normally takes me 5-6 hours per week to complete as when Morgan worked at the business he did briefly show me it but didn’t have much training in the task and it was instead going to be done by James and Daniel as Daniel was partially doing it anyone alongside Morgan before Morgan left. Paul then had a quick meeting with me and stated that there was no better place to work than here and he was more than happy to invest in me for my Accounting studies. Also Paul was in the process of hiring someone to replace Nicola for the position of management accountant. Also around mid February a new person called Kevin had started working for the business as he is the COO (Chief Operating Officer) and is the 3rd most important person in the business as his job is to be the go between person between the regular workers and the CEO as the regular workers go to him for any questions / problems / concerns and he then reports to the CEO so that the CEO Paul has a good grasp of the day to day running’s of the individual departments delivered by Kevin as well as Kevin also performing other tasks.\n\nThen at the start of March 2023 the business had successfully hired someone new to replace Nicola as the head of Finance which was a woman called Hiba. She started working at the business and I was impressed with her knowledge as she was born in Morocco and was fluent in 3 different languages which was (English, French and Arabic) and also had a degree in something medical related (can’t remember the exact degree name) and was now training to become a accountant and had also read multiple religious texts of the (Qua-ran, Bible, Torah and Talmud) as well as other texts and was well educated on religious beliefs from different religions. I was then moved away from where I was sitting with Tina after having a few laughs with her as the funniest was when I asked her how her weekend was and she said it was good as she states that she played a water fight with her kids in the garden where she was spraying her kids with a hose and they were running away. She asks me if I did that when I was younger with my parents and I said no I don’t think so but stated that we did have a pond. She then asked me if my parents took me down to the pond and looked at me and said “get in the pond you fuck” and then push me in which I couldn’t stop laughing at. My new boss Hiba was very calm and relaxed and we had a good working relationship and got along with her well. (Apologies if the story has been a bit boring up to this point as it will get good now). Then a woman called Jenna who was the head of one of the departments and had no prior knowledge or experience in finance advised me that the way I was doing a part of my job was wrong. I queried it with her and stated that I was following a series of notes to do this task which was typed up by Morgan before he left the business and was following them. She stated that the notes that he had typed up were wrong and stated that the breached company policy even though I had never been advised this prior to this point and also my previous worker never made any mention of this and Jenna also provided no proof or evidence to prove that what I was doing was breaching the company contract. I spoke to Hiba about this but she stated that she didn’t know much about it and I told the IT department to make this change even though as I stated I was sceptical of this claim and he changed it and it caused some changes on the system which I corrected. Then a few days later the changes that I made a few days prior due to this amendment caused over 4 million emails to be generated and I had to attend a meeting with Kevin and Andrew about this. I provided my evidence as I had email evidence from Jenna to me confirming me to make this change and also provided other evidence with regards to this and I didn’t face any consequences and Andrew had a chat with Jenna as I don’t know what was discussed. \n\nThen one day I was in the office and Kevin who as I stated was the 3rd most important person in the company was overseeing the development of Daniel and James who as I stated were working on the Profit and Loss statements for the IM’s and wanted to have a meeting with them to discuss there progress and performance. Kevin’s office was a single square office that was separate from the open planned office were me and everyone else sat. Part of the way through the meeting Kevin told Daniel to leave the meeting as Daniel got up from his seat and walked out of the office and sat at his desk and Kevin and James were sat in the office with the door closed. I was sitting there doing my work and was literally maximum of 4 walking steps between were I was sat and the office door to Kevin’s office. Then all of a sudden I heard this super loud shout from Kevin that was so loud that me and multiple other workers in the office could all hear it were Kevin shouted at James stating that “if James was not happy with his job then you should Fuck off yes you should Fuck Off”. Then shortly after this event James launched a complaint to the new head of HR named Janine as Tina who was the previous head of HR left the business due to her having a feud with Paul. Janine got Kevin and James around a table and James launched the complaint that Kevin was engaging in bullying in the workplace and Janine asked Kevin if this was true. Kevin then sat there and paused and then stated that these allegations were not true as Kevin would never swear at any of his workers or engage in bullying at the workplace and denied all allegations. Kevin faced no consequences for this and as far as I know didn’t receive any disciplinary action for his behaviour.\n\nThen on a different day in the office I received a letter from the post which I opened and read and was a bit unsure on what to do with it and was not sure who to give it to. I then looked over to see if my boss Hiba was there which she wasn’t and continued working (which was spent implementing excel formulas because I had completed all my work for that week). She then arrived back around 10-15 minutes later as prior to this she took a few random days off work and had a few meetings with the CEO Paul. I gave her the letter and explained that I didn’t know what to do with it and she advised on what to do with it and I was about to go back to my desk but she stated that she had an additional comment to make. She told me that she was leaving the business around 10 weeks into the job and I asked her why she was leaving and was a bit shocked by this announcement. She stated that she was told that it was going to be a management account position but she viewed the job as being more like admin work and that you don’t need to have any prior knowledge or experience in finance in order to do her job as they could drag anyone to do the job and they would be capable of doing it. She also stated that she doesn’t have much work available to do and she has quite a lot of free time in her job and gets a bit bored and stated that I was capable of doing my job and her job and that would also benefit the company so instead of hiring 2 workers they hire 1 worker saving money on wages. I then put a email to Paul the CEO for this which he denied due to the fact that I make a few mistakes which I get Paul to correct which literally is just amending a 4 digit number to fix. Then the next day I had a meeting with Paul and Kevin and Paul told me that Hiba had left the business and stated that due to the minor mistakes that I had made and also due to the fact that I was on my probation Paul was in the position to fire me at any given time if he wished to do so if I continued to make mistakes. He then looked at Kevin and stated that as of now Kevin would be my go to person if I had any questions or queries and to not contact Paul directly even though Kevin has no prior knowledge or experience in Finance as only Paul had knowledge in finance alongside me. I was at this point a bit unhappy about the decision to put Kevin in charge of me if I got stuck on anything given how he acted towards James and his behaviour and also thought that it was rude for Paul to potentially threaten to fire me at any point even though that is part of the job position that you have. \n\nThen shortly after this there was a amendment made in my “Daily Report” emails so instead of sending a email to the CEO Paul at the end of the day specifying what tasks I had completed on a daily basis I had to specify the tasks that I had completed on a daily basis and also specify the amount of time spent completing the tasks that I completed in my email for a day to day basis which I wouldn’t of usually had to do on a daily basis in terms of specifying the time it takes. I then start sending my daily emails at the end of the day giving the honest amount of time that it took for me to complete the amount of time that it takes for me to complete my tasks and there is easily over 100 minutes every day as a minimum that I had of free time that I had available in my emails which I didn’t specify what I was doing as I was implementing formulas in excel to simplify my job in the spare time but as I stated I didn’t specify this in the emails. Then after a week or so Paul notices this pattern and sends me a email if I didn’t have enough work to do which I tell him that I don’t have enough work to do and have a few hours per day for free time as he knew from the “Daily report” emails. He then tells me that he wishes that I told him this earlier and he sends me a email for a report on a website and then on that day Kevin then organises a meeting with him in the boardroom. I attend and Kevin states that I don’t have much work to do and I have been given the log in details to the website that I am required to do the report and I have been tasked with investigating over 400 different business that deal in various different investment companies and I have to put the business names, address, business occupation type and business investments and general business info about the business into a excel file for each individual business. I then start this process and start working through the list and continue sending the “Daily reports” with a full days worth of work to complete with the report I was tasked with completing factored in. Shortly after I start working on this task I receive a email from Paul stating that I will be training a worker called Emma who works downstairs training her on how to do sales invoices which is a task that I usually complete but is given to her before I continue doing the report as this meant that around 70% of the sales invoices task that I complete will now be exported out to Emma to complete which would normally take me 3-4 hours per week to complete. I then continue working on the report and after around 4 weeks I complete the report and tell Kevin this as I briefly interrupt him in a meeting with a woman called Corelia in a meeting. I apologise afterwards for interrupting which they state that they are okay with and I email the excel spreadsheet to Kevin and he opens the spreadsheet and asks if I had completed the task and I say yes I have and he then says that there is not that much info on the spreadsheet. He then scrolls to the top of the spreadsheet and I quickly realise that there was a filter applied on the spreadsheet which therefore explains why the full list is not shown and ask him that if he wants to view the full list then he has to clear the filter. He then tells me that he can do it and he highlights all of the rows on the spreadsheet and then right clicks after that and then clicks on find and replace and starts typing into the find box and then in the replace box and then clicks on replace all and it comes up with a error message. He then sits there and tells me that he doesn’t know what to do and I say to him “click on the banner at the top that has the word data” he clicks on that then I say to him “next to where it says the word filter click on where it says clear” he clicks on that and I say to him “you now have your full list of businesses on the spreadsheet.” Then the next day at work he then sits there in his office and asks me if he can borrow me and I walk into his office and he sits there and says that yesterday I showed him how to clear the excel filter however he has since forgotten on how to clear the filter and wants me to tell him how to clear the filter again which I tell him. He then puts the occupation in alphabetical order and then manually scrolls down the list to find the list that starts with the letter “H” and then tells me that if he wanted to read the list of businesses that have the name of healthcare then he knows that because it starts with “H”. I then advise him that this is a false claim to make as not all of the businesses for occupation are in alphabetical order in the list and when you filter in excel by alphabetical order it only does the order for the first word and ignores the rest meaning that they are not all in alphabetical order. I instead ask him to click on the drop down and type in the word “Health” which he does and then press enter and that gives him the full list of businesses that have the word “Health” in the list which he thanks me for. Then a few days later Paul the CEO then sends me a email asking me where I am up to with the report and I send him the spreadsheet with the info in it which indicates that Kevin did not complete his job of sending the report to Paul which is one of his tasks for his job title.\n\nThen after this I go back to having less work to do and as I briefly stated the sales invoices tasks had been exported out to Emma with no reason specified why this was the case and giving me less time now to complete my tasks and I continue to send my “Daily reports” emails with even less time now available to complete my job. Also as I stated earlier the IM task for Profit and Loss was also exported out to James and Daniel reducing my workload further as well. Also another task that I do is the AKS and the AML reports which I put together every Monday which I put together on excel and usually takes around 10 minutes to complete however that task is given to the other people due to the simple nature of the task and how quickly it takes to complete meaning that this task is also exported out to the other workers just before I completed the report task. I then continue sending the “Daily reports” emails and I again start to have a significant decrease in the amount of time that I have available to complete my job which is stated in the emails at the end of the day by the amount of minutes specified. Then after over a week after having little work to complete I have a meeting with Kevin towards the end of the day specifying what tasks I have completed and is shocked that I have several hours per day of no work to do. Also Paul the CEO also starts sending me emails saying that it is very frustrating about what I am doing on a daily basis and not specifying the full time of what I do. I then have daily meetings with Kevin giving a list at the end of each day asking me what I do and I state that I do other excel tasks. Then one day I go into work and Kevin taps me on the shoulder and asks to have a short meeting with me. I sit down and he closes the door and gives me a letter. He then tells me that in 2 days time on Wednesday (he tells me this on Monday) that I will be attending a disciplinary meeting on the basis that I have several hours free time per day and my time and communication skills and wants to know what I am doing and not stating earlier that I don’t have anything to do. I then walk out of the office room in shock that I am attending a disciplinary meeting over my productivity given the fact that I complete all of the tasks that I am scheduled to complete with several hours to spare. I then start thinking to myself that when I attend the meeting I need to prepare evidence which proves that they had foreknowledge that this was going to happen and start making plans to do this as I complete all the work that I need to complete on Monday and on Tuesday morning start preparing the documentation for my meeting on Wednesday. \n\nThen I go into the disciplinary meeting and point out these points about parts of my my job being exported and state that by default when you do that you reduce your workload giving yourself less stuff to do. I also state that when I did the requested report when I put information together for over 400 businesses during that time the amount of time spends doing my finance job is minimal when the required report is factored out and use my daily reports as evidence as proof of this fact and ask why plans were not put forward to increase my workload whilst I am doing it. I ask Kevin why the decision was made to reduce my workload and he stated that he will ask Paul this and get back to me (he never specified why this was the case). Kevin then asks me what I spend the rest of my day doing and I state that I implement formulas in excel to help simplify my job to reduce the amount of data that I put in excel. He then sits there and says that he thinks that I am lying and that I haven’t done the things that I have said. He doesn’t ask for any proof or evidence of this and then he asks me to leave as in the meeting Janine who works in HR is making notes of the conversation. I then leave the meeting room and he stated that he will discuss with Janine and I am then called back around 30 minutes later and go in the meeting room and Kevin states that I have received a first disciplinary warning which will remain on my system for 6 months because of the fact that I complete my work before the end of the day and didn’t request additional work. I then continue my job and state that the remains time I have free is implementing formulas in excel to simplify my job in my daily report emails. Kevin then again calls me into his office early next week and talks that since the meeting he has spoken to a woman called Vicki and a man called Greg and told me that if I run out of work I should speak to Vickie first and then Greg second asking for additional work which they will provide to me and that my probation period has been extended by an additional 5 to 6 months and I will have a monthly meeting to access my performance (which never happened a month after he specified this). I then continue doing my job and 1 of the 2 reports which took 10 minutes has now been given back to me to complete and have been given some additional work to complete which generates a extra 4-5 hours of extra work per week which is good but still not enough additional hours to fill the total gap of work available. Also after I received the disciplinary warning I was very annoyed and also mind blown that they thought that there is significant downsides to being a productive worker and thought to myself if these people lived in an alternative reality whereby according to them there is almost a universal consensus from experts that being productive is a bad thing.\n\nI then start doing tasks set out by Vickie and quickly complete them them and ask her for additional work but she states that there isn’t any additional work available for me to do. Then I go and see Greg and ask him for additional work and he gives me a task of doing research for Photography companies based in 2 different parts of the country and I put together a spreadsheet and put this information together which he is happy about. I then ask for additional work and a girl called Hannah gives me a excel file task which she states will take 2-3 hours to complete. She gives me the task and within 5 minutes I walk over to her desk and tell her the task that she asked me to do has been completed. She acts surprised and opens up the excel file to find it completed and is left speechless and I state that I used VLookups to complete the task and give her a set of detailed instructions of how to complete the tasks as she stated that she does this task on a weekly basis and it takes her several hours and thanks to me it will now take her a few minutes. She then gives me another task for whether businesses have or haven’t signed a NDA (Non disclosure agreement) which I complete in around a hour which she says that it takes a few hours to do. Then later on in that day I state I have spare capacity and another worker called Bradley states that all of the businesses that have a NDA need a email sent out to them and the format of the email is largely the same the only thing that changes is the business ID number. He gives me the task and within a few minutes I complete it and send out all 200+ emails. He then looks at me and asks me if I did it which I said yes and he tells Hannah this and everyone in the office is left speechless and James who I am friends with says that I am more intelligent than the CEO. I then send a email out to multiple people telling them all how to do mail merge and they all said that this will be hugely beneficial as it will help to simplify multiple people’s jobs.\n\nThen on this Monday a new girl called Maria worked for the company and I showed her how to do my job and showed her the stuff and she wrote a series of notes on how to do the tasks that she is required to do. I then showed her a excel file which had formulas in it and simplified the job and showed her how to do it which left her speechless. Then the day before I am due to leave the business I arrived to work and tried to log into my computer but came up with incorrect password. I tried again and nothing happened and then asked IT to update my password. Then Kevin tapped me on the shoulder and I went into his office and sat down and he said that he found out from someone in the business that I had implemented formulas to simplify my job and that I was planning on selling the formulas and deleting them. I tell him that I had no plans to sell them (as what is another business going to do with a bunch of data that has no relevance to there business anyway) but was thinking about deleting them because of how badly I have been treated. Kevin then tells me that he has no intention of telling the CEO Paul about this but if I delete the formulas I could be financially nuked and have a lawsuit filed against me but I state that even if I did delete them they are backed up onto a server anyway meaning that they can be re retrieved even if they are deleted of which he has no response. He asks me if I plan on deleting them of which I say no and then my password is reset and he again has a second meeting with me and he states that he has spoken to Paul and Paul has contacted his lawyers in case I do delete them to threaten legal action as Paul was on holiday at this time. He also stated that he understands what I have gone through and states that he has been in a similar situation in jobs where he has simplified and automated processes in his working life (none of which I believe). I have kept the formulas in place. Then on the final day that I work there on the Monday I again try to log into my computer and am again locked out of my computer as the password on my computer has been changed again over the weekend and I ask IT why I was locked out of my computer and he asks me to speak to Kevin which I don’t do as I get the impression that he doesn’t like me and finish my final day not being able to send a goodbye email to people I was friends with and keep in touch. Then after I finished my final day at the office I went on Linked In and posted a message on my account basically stating that I had automated away large parts of my job for the next few years and am looking forward to starting working at my next company.\n\nAlso I started looking for other jobs and have got a new job working for a different company and start my job in early August 2023 with towards the end of July 2023 being my final working day at the current company I am talking about and the remaining time is extra holidays I have left over to take. I again gave the business 24 hours notice given the short time span I had between finding out that I had a interview and when the interview takes place and it got later on into the day before I was having the interview as I booked Friday of work first thing on a Thursday and Kevin again asked me at my desk why I wanted Friday off as what my valid reason for this was and I stated that it was for a dentist appointment as I have to have braces fitted in a few weeks time due to a large gap in between the bottom of my teeth and he stood there and said that was a valid reason and authorised it.\n\nAlso another thing is that I had a leaving event a few days before I left on Monday and sent a email out to a series of people to see if anyone wanted to attend and shortly after I sent the email a person forwarded the email to the CEO Paul (as I didn’t include him in the email) and he responded stating that I had to get direct approval from him first before I should of announced the leaving event even though I finish work at 17:15 and the leaving event was going to start at 17:30 which is outside of work hours. I spoke to a local pub for the leaving event and a series of people attended the event and I had a chat with James who was the person who Kevin repeatedly swore at. James was giving me his opinion on the business as he stated that he recorded a video with audio of Kevin repeatedly swearing at James during a meeting and stated that the event where I heard Kevin swear at James was not the first time that has happened and he could of brought this up in his meeting when he accused Kevin of bullying in the workplace but decided against it due to fears he would get fired from his job. He also stated that the new person who works as the head of one of the departments who is a guy called Sunil was not a good boss as he spends most of his day on his phone and whenever he does get work to do he instead shifts the work from himself and instead gives it to a worker below him to complete so that he can do as little work as possible. He also stated that the workers who work in the sales department don’t receive any commission from any sales that they complete in the sales department as they only receive bonuses however the CEO Paul deliberately sets unrealistic targets so that as few workers as possible receive any bonuses from there work. The only person in the business who does receive commission from sales is Nathan and the reason why he receives commission on the sales of the businesses is because his dad is the CEO of the business. Also he stated that Nathan use to work in 1 of the businesses but has recently been transferred to a different department for a different business. James stated that the reason why this is, is because of the fact that there is more completion sales in the new department he works in than there is in the other company and also if another worker in the new department he works in is getting close to completing a deal the CEO Paul will contact this worker and will state that his son Nathan can handle it from here and Nathan would get the deal across the finishing line and complete the sale and earn commission from it. Also James stated that 2 of the 3 businesses were significantly underperforming and were no where near hitting there quarterly sales targets as the goal was to achieve a target in sales in 3 months but they only achieved 60% of the total amount required in sales and in a different department Paul got angry at Sunil as his department were less than 0.1% short of hitting there quarterly target which Paul was furious about. He also stated that he thinks that I was a great worker and I could easily do the same amount of work as 10 regular workers due to my productivity and also my simplifying of jobs to reduce tasks that are required to be completed to a fraction of the time that it usually takes to complete the task. I then spoke about the researchers jobs which is carried out by 4 different works at the company and asked James if he has heard of “web scraping”? He stated that he hasn’t heard of it and I say to him that web scraping is where you do a search result on a website and then you use the web scraping tool to pick out what pieces of data that you want to pick out and then select scrape and it gets the pieces of data that you need and compiles it in a excel file in a matter of minutes and also contact one of the researchers about this before I leave the business. Also on my final day I state this to a different worker and state that this would be beneficial to the business as it would require less workers to do that job in less time to complete saving the business money on wages and then after that you can then send this excel file to the workers in the sales group and they can then use mail merge to these businesses therefore allowing you to contact more businesses in a shorter period of time and then some of these businesses then might offer viewings and then a smaller amount will put down potential offers and then these offers might potentially lead to sales which would then lead to increased sales and a higher profit. \n\nApologies about the length of this text as it took me a while to type up as hope that you enjoyed it as it was a very toxic place to work and had a high turnover of staff in general and look forward to reading anyone’s comments.",
    "title": "Toxic workplace environment",
    "subreddit": "WorkReform",
    "timestamp": 1696187160,
    "score": 0,
    "keyword": "arab ceo"
  }
]