[
  {
    "text": "No full-time job for 4+ years, why? *EDIT:* Not long after submitting this post, several life changes happened. \n \n1. I finally landed a DevOps engineering internship with full benefits. \n2. I left the internship, despite positive encouragement stay from the VP of engineering, my manager, and peers, to pursue completing my education. (Who also positively encouraged my goal of education.)\n3. I was accepted at an internationally recognized university into their (software) engineering program. \n4. I began volunteering my (previously ignored, except for my internship) expertise for a positive cause. \n5. I landed a remote, part-time job (with full benefits!) as a software engineer which enables me to be employed, build my resume, and go to university. \n\nI learned that: \n \n1. It truly is darkest before the dawn. (I seriously considered suicide, and only didn't because it wouldn't financially benefit my family. I'm glad I didn't.) \n2. Sometimes all it takes is gathering the courage to ask a bunch of people to give you a chance, because all you need is one chance and one person to believe in you long enough to prove yourself. \n3. Don't give up. Do what's right, even if you don't see results for years. \n4. Do what works, do what works, do what works -- do what works for you and stop looking for hidden advice and listening to gurus.\n5. Find a mentor. If you can't, invent one. (ie, If no mentor, then be your own mentor and challenge yourself.) \n6. Find a cheap hobby that is something which you haven't done before, that you can share. (I picked card/ring magic.)\n7. Finally, stop knocking on closed doors, move on. (I left Austin, TX.)\n\n-----\n\nAs the title says, four years passed since my lay-off, and I have yet to find a full-time job. I'm aware there are others in a similar boat. I was unexpectedly laid off a week after I married in 2013, and have never quite recovered financially or otherwise. My wife has been a saint, but I think it's finally starting to cause her too much pain, mainly because we don't understand why I'm such a pariah to potential employers. (And living in limbo near the poverty line sucks.) What do I need to change to be considered worth hiring?\n\nI *think* I'm qualified for at least an entry-level full-time job, but despite what is now about 2000+ job applications (not an exaggeration), I number somewhere around ten phone interviews, and one in person interview. I don't apply to jobs which I don't meet necessary qualifications, or where my experience doesn't fit.\n\nMy primary and most current bullet points are:\n\n* One year of iOS development experience, through Udacity\n* C++ certificate from a 30 credit hour program\n* AAS in Computer Programming\n* AA in Arabic\n* Eight total years of active duty in the military\n* Three years in Special Operations intelligence\n* Administrative and project management experience\n\nI think the biggest strikes against me are:\n\n* No bachelor degree\n* Inactive security clearance\n\nAnd last, but not least:\n\n* A seemingly disjointed career so far: infantry > Arabic linguist > special operations > government contractor > unemployed > full-time student & part-time job > Google contractor (technically part-time temp, working 70 hr/wk) > unemployment > part-time job & full-time student\n\nBecause I've lived on, or below, the poverty line for about the last five years, my debt to income ratio isn't stellar, yet I've managed to retain a good credit score, and I do not have a criminal background/record or otherwise.\n\nMy friends often compliment me, saying I'm \"one of the smartest people they know.\" However, the proof isn't in the pudding, and I think my wife is about to divorce me because I'm poor, with no job in sight... And it's just painful. A $600 car repair sets us back months. \n\nWhat am I doing wrong? What's right?",
    "title": "No full-time job for 4+ years, why?",
    "subreddit": "jobs",
    "timestamp": 1485992948,
    "score": 9,
    "keyword": "arab manager"
  },
  {
    "text": "help an 18 year old student looking for an online part time job ? real life part time jobs don't pay that well from where i am from sooo i was looking for an online one , i read through a few posts on askreddit but i didnt find a link to anywhere. Gotta keep in mind that i am not european nor am i american. Im from Tunisia (North Africa)\nI am very found of computers , i love technology and i aspire to be an online security manager in the future :). I speak Arabic , English and French and a tiny bit of German ( in that order of fluency ) My typing speed is at 80 WPM( which i can deffinetly improve if the job includes typing )\nI dont think this is your typical post on PF but it is related to my personal finance and would really appreciate if you guys have any input ( as always , keep in mind i am not in the US or EU , i looked into alot of job and most of them require you to be American )\n\nthanks in advance fellas ! :)",
    "title": "help an 18 year old student looking for an online part time job ?",
    "subreddit": "jobs",
    "timestamp": 1511106077,
    "score": 1,
    "keyword": "arab manager"
  },
  {
    "text": "I lost my leg when I could of lost my life I just realized that today is Feb 16.. I don't post about this date a lot because it happened so long ago, but it was a very traumatic day for so many in the Arab area..\nToday 22 years ago I was 9 years old. My mother dropped me off at my daddy's house because she was leaving early the next morning to go to St. Judes hospital in Memphis with my grandmother and my aunt Kyndra, who was battling meduloblastoma, a brain cancer. I was angry she wouldn't let me skip school and go with her and as I got out of the car at my dad's, instead of a goodbye I looked at her and said \"I hope something happens so you can't go tomorrow\"... These would become words that would terrorize me in the years to come, as I tried to make my child-self believe I hadn't 'caused' the deaths and destruction that was to come. \nAt around 5 a.m. I was awoken by the sounds of debris hitting my bedroom walls. I had no idea what was happening and, if you know me, you know it had to be pretty dang loud to wake me up. I got out of bed and looked out the window. The still dark, winter sky was lit up with lightning and an orange haze, but right in the middle was a swirling mass of gray tornado. I was still sleepy, but I remember a shot of adrenaline pumping through me and all I could think was \"i have to get to Logan\".. Logan, my not even year old baby brother, asleep in the bedroom adjoining mine. The rain and hail and debris was so loud now I could barely hear anything, but I ran down the short hallway to his room and when I got to the doorway it seemed as if he was floating above the mattress in his crib (I'm still unsure if this happened or if it was my imagination, but further research did prove that the vacuum created by a tornado could have possibly caused enough suction to make this real). I turned and saw my daddy run out of his room towards us at the opposite end of the trailer and then the world flipped upside down... Like, literally, I remember seeing the trailer tear in two down the kitchen and my head hit the ceiling as our end of the trailer, along with me and my baby brother, were swept into the funnel cloud right in front of my daddy's eyes. \nI dont remember much of what came next, I faded in and out of consciousness for what seemed like ages, but in actuality was probably only seconds. Every time I awoke all around me was swirling, gray mass and the wind was so loud, tearing at my face and hair before I blissfully passed back out.  \nWhen I finally awoke for good I was alone. My 9 year old, childlike eyes took in the destruction surrounding me.. It seemed as if the debris, piled so high around me was as tall as skyscrapers, silhouetted against the night sky lit up with so many flashes of lightning... The stillness was absolute. No sounds were around me and I feared so much that I was the only one left. As I sat there, trying to process the destruction, I didn't know what I know now, that I had actually been INSIDE the funnel cloud and it had thrown me roughly 100 yards from where my bedroom was, and deposited me in the middle of a cow pasture. I remember only one thought passing through my head in those moments, I had to get to my daddy. To my daddy, who could fix anything, make anything okay again and everything alright.. I had to find my daddy. So I stood up, took a step, and fell. I sat there in the mud puddle in which I had landed, and stood up again. Took a step, and fell.. I repeated this process for who knows how long, all the while yelling out the only word I could think of \"Daddy..\"  And then finally standing on a rise in front of me, in the stillness and silence with only lightning and debris for company, I saw him. He was dark, a shadow, silhouetted against that flashing night sky, but I knew him immediately.. My daddy was there.\nHe ran to me and on his face was a mixture of emotions I've never been able to put name to. Terror, relief, joy, fear.. A literal miasma of conflicting expressions as he looked at me. He pulled off his belt from his jeans and tied it tight around the top of my thigh, I couldn't stop staring at him. I didn't even know why he was doing that, I mean, I wasn't hurt, but in that moment it didn't matter, my daddy was here- I would be okay. \nHe gently lifted me in his arms and carried me over the rise where I had initially seen him. I saw my step mom and she was sitting, crying. No baby brother. Where was Logan? My daddy sat me so carefully on the water heater, the only warm thing around on that cold, February morning. The sun still wasn't up, and at some point after finding my daddy, the rain had started. I began to become aware of things like how good the heat felt on the backs of my thighs, how I was trembling in my t-shirt and panties as the rain poured down on us. Slowly, my world was coming in to focus.. \nAs I sat there, listening to my dad and step mom frantically try and form a plan about how to find Logan I was overcome with tiredness... So I leaned over to put my head in between my knees, with my forearms on top of my thighs... Except my right forearm didn't go on top of my thigh... It went IN to my thigh. \nI felt the meat from the inside of my leg brush along my outer arm as I looked down in amazement.. I felt no pain, no hurt, nothing.. But this, this was why I couldn't walk, this was why I couldn't take a step! This was why my daddy's belt was wrapped so tightly around the top of my thigh! How had I not noticed it before?! The shock of the moment overtook me, and I began to scream, yet again for my daddy.. \nHe comforted me, I remember few of his words, other than they had the intended effect of soothing me. He once again picked me up in his arms and carried me... Across debris, wood, metal, the remnants of our home, our neighbors homes, our lives. Across live electrical wires in pouring down rain, he carried me across the road to a neighbor whose house was untouched. As he sat me on her cold concrete porch and the chill seeped into the backs of my thighs, he banged on the door and pled for help for his child, the only child he knew was alive at that moment. \nShe came out and brought me in, an hour later the ambulance managed to pick its way to us, but my daddy was still searching for my brother. They took me to the hospital and waited until my mother could find a way through the wreckage of the roads to get there to sign emergency surgery papers, before whisking me back and sewing up my thigh. \nIt was bad, much worse than I realized. My femur was exposed (and bones inside you are more gray than white btw😉) with my femoral artery only being missed by little over a centimeter. It cut me from knee to hip, wide open on the inside of my leg. I had just a bit under 400 stitches and 30+ staples. I still carry the scar, along with the memories, to this day. It has become a part of me, who I am, I barely notice it anymore.. Although it is one of the first things most people see, especially in summer with shorts. \nI would stay in the hospital for 22 days and my brother would be found a few hours later. The miracle baby, he was called, missing for hours after a horrible F4 tornado tore his home apart.. Not even a year old sitting perfectly sheltered, dry, not a scratch on him.. Like an angel built him a tent to wait out the storm. To wait for our daddy.\nWe were so blessed. Three people lost their lives that morning. We know it could have been us, but although not quite unscathed, we still emerged. We rebuilt, moved on with our lives, and we have never forgotten how quickly your life can change. Tornadoes in life can come so quickly. In the 22 years since, I have learned many things, been through many more trials and tribulations, but this was the first real test of my young life. I learned that  you should watch your words, even when you're angry.. Because you never know the kind of aftermath you will deal with if they prove true. I learned you can push through if you are determined enough, no matter how much mud, muck and pain tries to pull you back down. And I learned that you can always, always count on your Daddy to come for you if you call to Him.",
    "title": "I lost my leg when I could of lost my life",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1487292532,
    "score": 3,
    "keyword": "arab manager"
  },
  {
    "text": "[NYC][Math/Arabic/CS 9-12] Gifts for office manager and payroll secretary Hey,\nI'm a second year teacher and I'd really like to get some gifts for the office manager and payroll secretary in our school because they're so great and I want to show my appreciation. What's a good idea for a non-alcoholic gift that I could get for these amazing ladies? I'm not sure what works and what's appropriate, and I'm generally self-conscious about gift giving. Thanks for your help!",
    "title": "[NYC][Math/Arabic/CS 9-12] Gifts for office manager and payroll secretary",
    "subreddit": "Teachers",
    "timestamp": 1511360146,
    "score": 2,
    "keyword": "arab manager"
  },
  {
    "text": "Not sure how to feel about coworkers talking in another language to the extent that it feels exclusionary. Can someone please help me understand if I am in the wrong? Hello,\nI work in a Japanese-American Company. I work with 5 other people in the same office. All of us are in the same department in an open-office environment. The assistant manager and two of the other purchasing agents speak Japanese (one from the US and one from Japan). Conversations in Japanese are very common. Until recently, the last few weeks, it has never bothered me. I have worked here for almost a year now. One of the agents and the assistant manager have been having conversations in Japanese throughout the entire day lately, and I have been finding it more and more exclusionary. I understand wanting to talk in your native language because I can speak French, but I prefer English given the choice. However, both of them have lived in the US for 20 years and are nearly as fluent in English as I am. The worst part of this is I can’t pinpoint why this has been bothering me. They have had conversations in Japanese the entire time I have worked here. A lot of their conversations in Japanese are about issues our department/company is facing, and because they don’t have these conversations in English anymore, I know far less about what is going on than I used to. I know that their conversations dip into their personal lives, and I am actually okay with this part. However, I have noticed a growing rift between the US workers who only speak English (excluding me) and the 2 Japanese employees. They have gotten to where they barely ever talk to each other, and they don’t really respect each other. The Manager of our department being one of those English speakers has made this situation even more annoying. Also, I think it has been bothering me because my own workload has been steadily increasing as theirs seems to be decreasing, according to how much they talk and not work (note:  they also pass a lot of their work to me). I mean these conversations have lasted all day (while they were in the office), and they don’t really do anything else while they talked.\nAlso, I want to show that I am not just bothered by the use of foreign languages. I have friends from several different nations, and when we get together, we talk in several different languages together.  Most of these friends speak languages I do not know, and it is fine.  For example, we’ll be having a conversation and someone will say something in Arabic, then someone will kind of explain to the non-Arabic speakers what was said if anyone seems curious. Another example, a group of Spanish and English spearkers, and French and English speakers talking in all three languages together. The Spanish and the French can be loosely understood by both groups due to similarities, so English is used when people are unsure of the exact translation or when someone wants to be sure everyone understands what they say. Two of my friends may say something to each other in their mutual language and not explain it to the group because it was an obvious aside and not really important to the whole group. Or even a work example, our department is all talking together, and there will be both Japanese and English in the conversation but everything is being explained to everyone involved. These are the sorts of situations I am used to, and I have no problems with them because everything is out in the open if need be. There may be languages being used that don’t get explained, but it isn’t something that is important. \nSo, their conversations have been distracting for a multitude of reasons, and I am not certain how I feel or how I should feel. I want to work for the UN one day, so I feel like I should learn how to just be okay with this. I also see the real affect it is having on our department. There is also the point that they are spending more and more time at work not working (and they have very important jobs). I can’t tell if I am being petty for wanting them to stop talking in Japanese as much, or if I am in the right to think that they need to work harder to try to communicate in English more often. I also can’t tell if I am just being spiteful because of the increased workload for me from doing their stuff for them. Can anyone offer any advice for this situation?",
    "title": "Not sure how to feel about coworkers talking in another language to the extent that it feels exclusionary. Can someone please help me understand if I am in the wrong?",
    "subreddit": "careerguidance",
    "timestamp": 1498146673,
    "score": 16,
    "keyword": "arab manager"
  }
]