[
  {
    "text": "Stalker much? AITA?\n\nHad an interesting week interacting with a non-parent. I’m an ESL teacher and we have a new family with a complicated story-Syrians, moved to Lebanon, sponsored by Catholic charities, living in a house owned by a local Presbyterian church. The family speaks Arabic, and a representative is the Presbyterian church has been coming to the school with the family to register each student (they have three). She is not an emergency contact, the family hasn’t asked us to include her, and she doesn’t speak Arabic, so I’m not sure what time she is filling here. \n\n Thursday last week we had open house. At the end of the night I got an email from her saying that she didn’t understand why the last student to register in the family still had no schedule. He has met with the counselor just that day and as a senior, we needed to review his transcripts carefully to ensure he was enrolled in the right classes. I had plans to be out the following Friday, so I forwarded the email to the school counselor and the ESL case manager in charge of that child’s end of the alphabet. I don’t know why she emailed me in the first place. As the department chair, I am kinda involved in each student, but I’d like to see the rest of my team approach a situation before I step in. \n\nI come in this week on Tuesday (Monday there was no school for Labor Day) and find a voicemail from 9:00 am Friday insisting that I needed to call her back to discuss the reasons why this student still did not have a schedule. I also got note in my mailbox that was written in the back of an email her husband (yet another legally unaffiliated adult) had sent to the case manager with a written note complaining that the case manager and guidance counselor weren’t responding to her, saying it was ridiculous she had to resort to writing a not on paper. The letter explained how she heard a friend who worked in special Ed at a neighboring district who suggested that these students should not be enrolled in American history class until they’ve learned English. Well, I hate to break it to her, but that’s not how the system works.  State law still requires that they earn all required credits in the span of four years, so they take classes in the same schedule as a native English speaker. After talking with the front office staff, I  B found out she had wanted to come in and talk with me on Friday when she wrote the note and made enough of a scene that the secretaries now call her crazy. And they tell me she was waiting in her car at the school that morning. \n\nThe waiting in the car was my final straw. I emailed the story to the principal and the school resource officer. The last update I got from the principal said that he was going to take part in the next meeting that involved this crazy church lady to establish protocols and roles, but I got the feeling he thinks I’ve overreacted. \n\nTLDR/ crazy lady with no legal rights to students is harassing me for information I can’t give.",
    "title": "Stalker much?",
    "subreddit": "Teachers",
    "timestamp": 1694221438,
    "score": 4,
    "keyword": "arab manager"
  },
  {
    "text": "Toxic workplace environment Before I start my story I would like to note that this story of my place working at this company has been amended so that only the first name of the workers given are named so that the full identity is not revealed. Also the business name is not revealed as this is a true story of my time working at the business as I worked at the business for around 7 months in the finance department before I left.\n\nI start working at the business in early January 2023 and am trained by a person called Morgan who is a few years younger than me. There is also my boss who is a woman called who has been working at the business for quite a while as well. I start working there and my boss tells me that Morgan will be leaving the business at the end of January 2023 and Morgan and his girlfriend will be doing a world tour covering various different countries located in east Asia as well as also travelling to parts of Oceania like Australia and New Zealand and are planning on doing this trip for approximately 3 months then returning back to the home country. That gave me approximately 3 weeks to spend with him before he left the business to go on his travels. At the end of my first day I was about to leave the office however Morgan tells me that before I leave the office I need to send a email to the CEO (Paul) to let Paul know all the tasks that I have completed today. I was confused by this but Morgan tells me that it is a mandatory procedure that everyone in the business is required to do (there is approximately 75 people who work in the business). Then I kept forgetting for the next few days after that to send the email to Paul about this which Nicola tells me to do. I quickly figured out that most of the job could be simplified and automated away given that it was all in excel and functions such as (COUNTIF, SUMIF, IF and VLOOKUP) could be used to simplify my job. Then around a week before Morgan was due to leave a woman called Catherine started working at the business and stated that she previously worked at her previous company for over 20 years but was forced to leave her previous job after it was announced that her job was being moved to Canada which she was not willing to relocate to. I got along with her well and it got to the end of the day and I asked her that I will see her tomorrow and she then looked at me and said “I think that I will see you tomorrow”. This left me confused as she was implying that she wasn’t sure if she was or wasn’t going to go to work the next day. The next day she arrived to work and Nicola told me to show her Sales Invoices and I provided a detailed explanation of how to do them and she stated that it is too complicated for her. Nicola then called Catherine into her office and they were in the office for over a hour which confused me and then Catherine announced that she was leaving the business and got her stuff and said that it was nice meeting me and Morgan and she left. I asked Nicola why she left given she only worked there for around 10 hours and she stated that the job was too complicated for her to do however a few days later Morgan told me that she got “bad vibes from the office” which caused her to leave. Then a few days before Morgan left the business he looked at me and told me that Nicola was also planning on leaving the business. I then asked him when Nicola was planning on leaving the business and he shrugged his shoulders and stated that he didn’t know when she was planning on leaving the business. It got to Morgan’s final day in the office and I said my fair wells and wished him the best of luck in whatever he decides to do in life. I then looked at Nicola and told her that I would see her tomorrow. I arrive to work the next day and walk over to my desk only to discover that my computer has disappeared which confuses me and I look around the office trying to find my computer. Then Paul the CEO asks me to go into the boardroom which is a separate room from where everyone else sits and another person called Andrew who is second in command is also in the room. I sit down and Paul tells me that not only did Morgan leave the business yesterday but also my boss Nicola also left the business on the same day even though she was meant to leave at the end of April 3 months after her original departure as she left at the end of January. He told me that I was the only person in the finance department for now and I would have to report directly to Paul if I got stuck. I was then moved to sitting near a woman called Tina who was the head of HR (Human Resources) and was also personal assistant to the CEO. I then started implementing the formulas that were required shortly after I sat at my new desk to simplify my job. \n\nAround a month after I started, I started doing IM’s which are Profit and Loss statements where you have your gross and net profits and then you have addbacks once the business is sold as our business is basically the business equivalent of selling houses and we earn between 2% to 5% commission per sale based on the business sale price. The IM’s are used in brochures which we send to the clients who might potentially buy a business. I start doing it alongside 2 other people who are new to it and then one day Paul the CEO sends a email stating that I won’t be doing that job and it will instead be done by 2 other people exporting some of my job out to others which normally takes me 5-6 hours per week to complete as when Morgan worked at the business he did briefly show me it but didn’t have much training in the task and it was instead going to be done by James and Daniel as Daniel was partially doing it anyone alongside Morgan before Morgan left. Paul then had a quick meeting with me and stated that there was no better place to work than here and he was more than happy to invest in me for my Accounting studies. Also Paul was in the process of hiring someone to replace Nicola for the position of management accountant. Also around mid February a new person called Kevin had started working for the business as he is the COO (Chief Operating Officer) and is the 3rd most important person in the business as his job is to be the go between person between the regular workers and the CEO as the regular workers go to him for any questions / problems / concerns and he then reports to the CEO so that the CEO Paul has a good grasp of the day to day running’s of the individual departments delivered by Kevin as well as Kevin also performing other tasks.\n\nThen at the start of March 2023 the business had successfully hired someone new to replace Nicola as the head of Finance which was a woman called Hiba. She started working at the business and I was impressed with her knowledge as she was born in Morocco and was fluent in 3 different languages which was (English, French and Arabic) and also had a degree in something medical related (can’t remember the exact degree name) and was now training to become a accountant and had also read multiple religious texts of the (Qua-ran, Bible, Torah and Talmud) as well as other texts and was well educated on religious beliefs from different religions. I was then moved away from where I was sitting with Tina after having a few laughs with her as the funniest was when I asked her how her weekend was and she said it was good as she states that she played a water fight with her kids in the garden where she was spraying her kids with a hose and they were running away. She asks me if I did that when I was younger with my parents and I said no I don’t think so but stated that we did have a pond. She then asked me if my parents took me down to the pond and looked at me and said “get in the pond you fuck” and then push me in which I couldn’t stop laughing at. My new boss Hiba was very calm and relaxed and we had a good working relationship and got along with her well. (Apologies if the story has been a bit boring up to this point as it will get good now). Then a woman called Jenna who was the head of one of the departments and had no prior knowledge or experience in finance advised me that the way I was doing a part of my job was wrong. I queried it with her and stated that I was following a series of notes to do this task which was typed up by Morgan before he left the business and was following them. She stated that the notes that he had typed up were wrong and stated that the breached company policy even though I had never been advised this prior to this point and also my previous worker never made any mention of this and Jenna also provided no proof or evidence to prove that what I was doing was breaching the company contract. I spoke to Hiba about this but she stated that she didn’t know much about it and I told the IT department to make this change even though as I stated I was sceptical of this claim and he changed it and it caused some changes on the system which I corrected. Then a few days later the changes that I made a few days prior due to this amendment caused over 4 million emails to be generated and I had to attend a meeting with Kevin and Andrew about this. I provided my evidence as I had email evidence from Jenna to me confirming me to make this change and also provided other evidence with regards to this and I didn’t face any consequences and Andrew had a chat with Jenna as I don’t know what was discussed. \n\nThen one day I was in the office and Kevin who as I stated was the 3rd most important person in the company was overseeing the development of Daniel and James who as I stated were working on the Profit and Loss statements for the IM’s and wanted to have a meeting with them to discuss there progress and performance. Kevin’s office was a single square office that was separate from the open planned office were me and everyone else sat. Part of the way through the meeting Kevin told Daniel to leave the meeting as Daniel got up from his seat and walked out of the office and sat at his desk and Kevin and James were sat in the office with the door closed. I was sitting there doing my work and was literally maximum of 4 walking steps between were I was sat and the office door to Kevin’s office. Then all of a sudden I heard this super loud shout from Kevin that was so loud that me and multiple other workers in the office could all hear it were Kevin shouted at James stating that “if James was not happy with his job then you should Fuck off yes you should Fuck Off”. Then shortly after this event James launched a complaint to the new head of HR named Janine as Tina who was the previous head of HR left the business due to her having a feud with Paul. Janine got Kevin and James around a table and James launched the complaint that Kevin was engaging in bullying in the workplace and Janine asked Kevin if this was true. Kevin then sat there and paused and then stated that these allegations were not true as Kevin would never swear at any of his workers or engage in bullying at the workplace and denied all allegations. Kevin faced no consequences for this and as far as I know didn’t receive any disciplinary action for his behaviour.\n\nThen on a different day in the office I received a letter from the post which I opened and read and was a bit unsure on what to do with it and was not sure who to give it to. I then looked over to see if my boss Hiba was there which she wasn’t and continued working (which was spent implementing excel formulas because I had completed all my work for that week). She then arrived back around 10-15 minutes later as prior to this she took a few random days off work and had a few meetings with the CEO Paul. I gave her the letter and explained that I didn’t know what to do with it and she advised on what to do with it and I was about to go back to my desk but she stated that she had an additional comment to make. She told me that she was leaving the business around 10 weeks into the job and I asked her why she was leaving and was a bit shocked by this announcement. She stated that she was told that it was going to be a management account position but she viewed the job as being more like admin work and that you don’t need to have any prior knowledge or experience in finance in order to do her job as they could drag anyone to do the job and they would be capable of doing it. She also stated that she doesn’t have much work available to do and she has quite a lot of free time in her job and gets a bit bored and stated that I was capable of doing my job and her job and that would also benefit the company so instead of hiring 2 workers they hire 1 worker saving money on wages. I then put a email to Paul the CEO for this which he denied due to the fact that I make a few mistakes which I get Paul to correct which literally is just amending a 4 digit number to fix. Then the next day I had a meeting with Paul and Kevin and Paul told me that Hiba had left the business and stated that due to the minor mistakes that I had made and also due to the fact that I was on my probation Paul was in the position to fire me at any given time if he wished to do so if I continued to make mistakes. He then looked at Kevin and stated that as of now Kevin would be my go to person if I had any questions or queries and to not contact Paul directly even though Kevin has no prior knowledge or experience in Finance as only Paul had knowledge in finance alongside me. I was at this point a bit unhappy about the decision to put Kevin in charge of me if I got stuck on anything given how he acted towards James and his behaviour and also thought that it was rude for Paul to potentially threaten to fire me at any point even though that is part of the job position that you have. \n\nThen shortly after this there was a amendment made in my “Daily Report” emails so instead of sending a email to the CEO Paul at the end of the day specifying what tasks I had completed on a daily basis I had to specify the tasks that I had completed on a daily basis and also specify the amount of time spent completing the tasks that I completed in my email for a day to day basis which I wouldn’t of usually had to do on a daily basis in terms of specifying the time it takes. I then start sending my daily emails at the end of the day giving the honest amount of time that it took for me to complete the amount of time that it takes for me to complete my tasks and there is easily over 100 minutes every day as a minimum that I had of free time that I had available in my emails which I didn’t specify what I was doing as I was implementing formulas in excel to simplify my job in the spare time but as I stated I didn’t specify this in the emails. Then after a week or so Paul notices this pattern and sends me a email if I didn’t have enough work to do which I tell him that I don’t have enough work to do and have a few hours per day for free time as he knew from the “Daily report” emails. He then tells me that he wishes that I told him this earlier and he sends me a email for a report on a website and then on that day Kevin then organises a meeting with him in the boardroom. I attend and Kevin states that I don’t have much work to do and I have been given the log in details to the website that I am required to do the report and I have been tasked with investigating over 400 different business that deal in various different investment companies and I have to put the business names, address, business occupation type and business investments and general business info about the business into a excel file for each individual business. I then start this process and start working through the list and continue sending the “Daily reports” with a full days worth of work to complete with the report I was tasked with completing factored in. Shortly after I start working on this task I receive a email from Paul stating that I will be training a worker called Emma who works downstairs training her on how to do sales invoices which is a task that I usually complete but is given to her before I continue doing the report as this meant that around 70% of the sales invoices task that I complete will now be exported out to Emma to complete which would normally take me 3-4 hours per week to complete. I then continue working on the report and after around 4 weeks I complete the report and tell Kevin this as I briefly interrupt him in a meeting with a woman called Corelia in a meeting. I apologise afterwards for interrupting which they state that they are okay with and I email the excel spreadsheet to Kevin and he opens the spreadsheet and asks if I had completed the task and I say yes I have and he then says that there is not that much info on the spreadsheet. He then scrolls to the top of the spreadsheet and I quickly realise that there was a filter applied on the spreadsheet which therefore explains why the full list is not shown and ask him that if he wants to view the full list then he has to clear the filter. He then tells me that he can do it and he highlights all of the rows on the spreadsheet and then right clicks after that and then clicks on find and replace and starts typing into the find box and then in the replace box and then clicks on replace all and it comes up with a error message. He then sits there and tells me that he doesn’t know what to do and I say to him “click on the banner at the top that has the word data” he clicks on that then I say to him “next to where it says the word filter click on where it says clear” he clicks on that and I say to him “you now have your full list of businesses on the spreadsheet.” Then the next day at work he then sits there in his office and asks me if he can borrow me and I walk into his office and he sits there and says that yesterday I showed him how to clear the excel filter however he has since forgotten on how to clear the filter and wants me to tell him how to clear the filter again which I tell him. He then puts the occupation in alphabetical order and then manually scrolls down the list to find the list that starts with the letter “H” and then tells me that if he wanted to read the list of businesses that have the name of healthcare then he knows that because it starts with “H”. I then advise him that this is a false claim to make as not all of the businesses for occupation are in alphabetical order in the list and when you filter in excel by alphabetical order it only does the order for the first word and ignores the rest meaning that they are not all in alphabetical order. I instead ask him to click on the drop down and type in the word “Health” which he does and then press enter and that gives him the full list of businesses that have the word “Health” in the list which he thanks me for. Then a few days later Paul the CEO then sends me a email asking me where I am up to with the report and I send him the spreadsheet with the info in it which indicates that Kevin did not complete his job of sending the report to Paul which is one of his tasks for his job title.\n\nThen after this I go back to having less work to do and as I briefly stated the sales invoices tasks had been exported out to Emma with no reason specified why this was the case and giving me less time now to complete my tasks and I continue to send my “Daily reports” emails with even less time now available to complete my job. Also as I stated earlier the IM task for Profit and Loss was also exported out to James and Daniel reducing my workload further as well. Also another task that I do is the AKS and the AML reports which I put together every Monday which I put together on excel and usually takes around 10 minutes to complete however that task is given to the other people due to the simple nature of the task and how quickly it takes to complete meaning that this task is also exported out to the other workers just before I completed the report task. I then continue sending the “Daily reports” emails and I again start to have a significant decrease in the amount of time that I have available to complete my job which is stated in the emails at the end of the day by the amount of minutes specified. Then after over a week after having little work to complete I have a meeting with Kevin towards the end of the day specifying what tasks I have completed and is shocked that I have several hours per day of no work to do. Also Paul the CEO also starts sending me emails saying that it is very frustrating about what I am doing on a daily basis and not specifying the full time of what I do. I then have daily meetings with Kevin giving a list at the end of each day asking me what I do and I state that I do other excel tasks. Then one day I go into work and Kevin taps me on the shoulder and asks to have a short meeting with me. I sit down and he closes the door and gives me a letter. He then tells me that in 2 days time on Wednesday (he tells me this on Monday) that I will be attending a disciplinary meeting on the basis that I have several hours free time per day and my time and communication skills and wants to know what I am doing and not stating earlier that I don’t have anything to do. I then walk out of the office room in shock that I am attending a disciplinary meeting over my productivity given the fact that I complete all of the tasks that I am scheduled to complete with several hours to spare. I then start thinking to myself that when I attend the meeting I need to prepare evidence which proves that they had foreknowledge that this was going to happen and start making plans to do this as I complete all the work that I need to complete on Monday and on Tuesday morning start preparing the documentation for my meeting on Wednesday. \n\nThen I go into the disciplinary meeting and point out these points about parts of my my job being exported and state that by default when you do that you reduce your workload giving yourself less stuff to do. I also state that when I did the requested report when I put information together for over 400 businesses during that time the amount of time spends doing my finance job is minimal when the required report is factored out and use my daily reports as evidence as proof of this fact and ask why plans were not put forward to increase my workload whilst I am doing it. I ask Kevin why the decision was made to reduce my workload and he stated that he will ask Paul this and get back to me (he never specified why this was the case). Kevin then asks me what I spend the rest of my day doing and I state that I implement formulas in excel to help simplify my job to reduce the amount of data that I put in excel. He then sits there and says that he thinks that I am lying and that I haven’t done the things that I have said. He doesn’t ask for any proof or evidence of this and then he asks me to leave as in the meeting Janine who works in HR is making notes of the conversation. I then leave the meeting room and he stated that he will discuss with Janine and I am then called back around 30 minutes later and go in the meeting room and Kevin states that I have received a first disciplinary warning which will remain on my system for 6 months because of the fact that I complete my work before the end of the day and didn’t request additional work. I then continue my job and state that the remains time I have free is implementing formulas in excel to simplify my job in my daily report emails. Kevin then again calls me into his office early next week and talks that since the meeting he has spoken to a woman called Vicki and a man called Greg and told me that if I run out of work I should speak to Vickie first and then Greg second asking for additional work which they will provide to me and that my probation period has been extended by an additional 5 to 6 months and I will have a monthly meeting to access my performance (which never happened a month after he specified this). I then continue doing my job and 1 of the 2 reports which took 10 minutes has now been given back to me to complete and have been given some additional work to complete which generates a extra 4-5 hours of extra work per week which is good but still not enough additional hours to fill the total gap of work available. Also after I received the disciplinary warning I was very annoyed and also mind blown that they thought that there is significant downsides to being a productive worker and thought to myself if these people lived in an alternative reality whereby according to them there is almost a universal consensus from experts that being productive is a bad thing.\n\nI then start doing tasks set out by Vickie and quickly complete them them and ask her for additional work but she states that there isn’t any additional work available for me to do. Then I go and see Greg and ask him for additional work and he gives me a task of doing research for Photography companies based in 2 different parts of the country and I put together a spreadsheet and put this information together which he is happy about. I then ask for additional work and a girl called Hannah gives me a excel file task which she states will take 2-3 hours to complete. She gives me the task and within 5 minutes I walk over to her desk and tell her the task that she asked me to do has been completed. She acts surprised and opens up the excel file to find it completed and is left speechless and I state that I used VLookups to complete the task and give her a set of detailed instructions of how to complete the tasks as she stated that she does this task on a weekly basis and it takes her several hours and thanks to me it will now take her a few minutes. She then gives me another task for whether businesses have or haven’t signed a NDA (Non disclosure agreement) which I complete in around a hour which she says that it takes a few hours to do. Then later on in that day I state I have spare capacity and another worker called Bradley states that all of the businesses that have a NDA need a email sent out to them and the format of the email is largely the same the only thing that changes is the business ID number. He gives me the task and within a few minutes I complete it and send out all 200+ emails. He then looks at me and asks me if I did it which I said yes and he tells Hannah this and everyone in the office is left speechless and James who I am friends with says that I am more intelligent than the CEO. I then send a email out to multiple people telling them all how to do mail merge and they all said that this will be hugely beneficial as it will help to simplify multiple people’s jobs.\n\nThen on this Monday a new girl called Maria worked for the company and I showed her how to do my job and showed her the stuff and she wrote a series of notes on how to do the tasks that she is required to do. I then showed her a excel file which had formulas in it and simplified the job and showed her how to do it which left her speechless. Then the day before I am due to leave the business I arrived to work and tried to log into my computer but came up with incorrect password. I tried again and nothing happened and then asked IT to update my password. Then Kevin tapped me on the shoulder and I went into his office and sat down and he said that he found out from someone in the business that I had implemented formulas to simplify my job and that I was planning on selling the formulas and deleting them. I tell him that I had no plans to sell them (as what is another business going to do with a bunch of data that has no relevance to there business anyway) but was thinking about deleting them because of how badly I have been treated. Kevin then tells me that he has no intention of telling the CEO Paul about this but if I delete the formulas I could be financially nuked and have a lawsuit filed against me but I state that even if I did delete them they are backed up onto a server anyway meaning that they can be re retrieved even if they are deleted of which he has no response. He asks me if I plan on deleting them of which I say no and then my password is reset and he again has a second meeting with me and he states that he has spoken to Paul and Paul has contacted his lawyers in case I do delete them to threaten legal action as Paul was on holiday at this time. He also stated that he understands what I have gone through and states that he has been in a similar situation in jobs where he has simplified and automated processes in his working life (none of which I believe). I have kept the formulas in place. Then on the final day that I work there on the Monday I again try to log into my computer and am again locked out of my computer as the password on my computer has been changed again over the weekend and I ask IT why I was locked out of my computer and he asks me to speak to Kevin which I don’t do as I get the impression that he doesn’t like me and finish my final day not being able to send a goodbye email to people I was friends with and keep in touch. Then after I finished my final day at the office I went on Linked In and posted a message on my account basically stating that I had automated away large parts of my job for the next few years and am looking forward to starting working at my next company.\n\nAlso I started looking for other jobs and have got a new job working for a different company and start my job in early August 2023 with towards the end of July 2023 being my final working day at the current company I am talking about and the remaining time is extra holidays I have left over to take. I again gave the business 24 hours notice given the short time span I had between finding out that I had a interview and when the interview takes place and it got later on into the day before I was having the interview as I booked Friday of work first thing on a Thursday and Kevin again asked me at my desk why I wanted Friday off as what my valid reason for this was and I stated that it was for a dentist appointment as I have to have braces fitted in a few weeks time due to a large gap in between the bottom of my teeth and he stood there and said that was a valid reason and authorised it.\n\nAlso another thing is that I had a leaving event a few days before I left on Monday and sent a email out to a series of people to see if anyone wanted to attend and shortly after I sent the email a person forwarded the email to the CEO Paul (as I didn’t include him in the email) and he responded stating that I had to get direct approval from him first before I should of announced the leaving event even though I finish work at 17:15 and the leaving event was going to start at 17:30 which is outside of work hours. I spoke to a local pub for the leaving event and a series of people attended the event and I had a chat with James who was the person who Kevin repeatedly swore at. James was giving me his opinion on the business as he stated that he recorded a video with audio of Kevin repeatedly swearing at James during a meeting and stated that the event where I heard Kevin swear at James was not the first time that has happened and he could of brought this up in his meeting when he accused Kevin of bullying in the workplace but decided against it due to fears he would get fired from his job. He also stated that the new person who works as the head of one of the departments who is a guy called Sunil was not a good boss as he spends most of his day on his phone and whenever he does get work to do he instead shifts the work from himself and instead gives it to a worker below him to complete so that he can do as little work as possible. He also stated that the workers who work in the sales department don’t receive any commission from any sales that they complete in the sales department as they only receive bonuses however the CEO Paul deliberately sets unrealistic targets so that as few workers as possible receive any bonuses from there work. The only person in the business who does receive commission from sales is Nathan and the reason why he receives commission on the sales of the businesses is because his dad is the CEO of the business. Also he stated that Nathan use to work in 1 of the businesses but has recently been transferred to a different department for a different business. James stated that the reason why this is, is because of the fact that there is more completion sales in the new department he works in than there is in the other company and also if another worker in the new department he works in is getting close to completing a deal the CEO Paul will contact this worker and will state that his son Nathan can handle it from here and Nathan would get the deal across the finishing line and complete the sale and earn commission from it. Also James stated that 2 of the 3 businesses were significantly underperforming and were no where near hitting there quarterly sales targets as the goal was to achieve a target in sales in 3 months but they only achieved 60% of the total amount required in sales and in a different department Paul got angry at Sunil as his department were less than 0.1% short of hitting there quarterly target which Paul was furious about. He also stated that he thinks that I was a great worker and I could easily do the same amount of work as 10 regular workers due to my productivity and also my simplifying of jobs to reduce tasks that are required to be completed to a fraction of the time that it usually takes to complete the task. I then spoke about the researchers jobs which is carried out by 4 different works at the company and asked James if he has heard of “web scraping”? He stated that he hasn’t heard of it and I say to him that web scraping is where you do a search result on a website and then you use the web scraping tool to pick out what pieces of data that you want to pick out and then select scrape and it gets the pieces of data that you need and compiles it in a excel file in a matter of minutes and also contact one of the researchers about this before I leave the business. Also on my final day I state this to a different worker and state that this would be beneficial to the business as it would require less workers to do that job in less time to complete saving the business money on wages and then after that you can then send this excel file to the workers in the sales group and they can then use mail merge to these businesses therefore allowing you to contact more businesses in a shorter period of time and then some of these businesses then might offer viewings and then a smaller amount will put down potential offers and then these offers might potentially lead to sales which would then lead to increased sales and a higher profit. \n\nApologies about the length of this text as it took me a while to type up as hope that you enjoyed it as it was a very toxic place to work and had a high turnover of staff in general and look forward to reading anyone’s comments.",
    "title": "Toxic workplace environment",
    "subreddit": "WorkReform",
    "timestamp": 1696187160,
    "score": 0,
    "keyword": "arab manager"
  },
  {
    "text": "Did I mess up my career? How do I transition out of this? Hey folks, \n\nAfter a few dozen interviews Im starting to get to a point where I feel like Im unemployable and could uae advice on where I might target the job search.\n\nQuick stats:\n\n- pieced together my degree across deployments, no prestigious name on my 4 year.\n- 9 years military, lead groups from 3-20 doing Nsa intel for top 10 national threats in theater\n- arabic linquist\n- wounded in combat/gap\n- 1 year pricing analyst\n- 1 year admissions\nAnd then the hard part. \n\n- 4.5 years fortune 50 saas sales. Promoted rapidly through bdr,inside sales,partner,customer success. Then finished my time there spending two years building a monthly subscription service version of our platform. Took it from business model to 300 customers and 40 people. Working with almost every leader globally. Built and lead a sales team that was experimental and non traditional. built new experimental processes in pso, engineering, sales engineering, success, partnerships, and business development. Product managed the build of a custom crm for the team. Etc.\n- vc company carves us out, reorgs, cuts my product, fires the team.\n\nIssues:\n- cant get an individual contributor job in the four IC roles I held - they either think Im under qualified due to such a short time in each specialty,  or think that I wont be happy/wont stay. Sometimes dq'd by old pay being top of range despite assurances id come down.\n\n- they dont recognize the miltary experience at all. Which is a common issue.\n\n- cant land the management or director roles - want more experience or I dont have the exact experience building the same exact org theyve already designed for the role. \n\n- not getting responses from operations, product manager, or project manager\n\nAnyone have any suggestions of role titles or where I could start to look or what to do? Before I had the manager title, id constantly have written offers to turn down. But now without a job, and having a lot more experience, it feels like Im unemployable suddenly.",
    "title": "Did I mess up my career? How do I transition out of this?",
    "subreddit": "careerguidance",
    "timestamp": 1672644703,
    "score": 8,
    "keyword": "arab manager"
  },
  {
    "text": "Not Passionate About Anything, But Want to Find a Suitable Path. What should I do? Hello Reddit,  \nI'm fed up trying to get a dream job and just want to start a career that generally makes sense with my background. I'm not particularly passionate about any specific field or industry, so I'm open to any and all suggestions.  \n\n\nHere's my full resume:  \n**Education**  \nJohns Hopkins University School of Advanced International Relations (SAIS) Master of Arts in International Relations (MAIR) Concentrations: Security, Strategy, & Statecraft, Asia  \nHarvard University International Security Certificate  \nDickinson College Bachelor of Arts, International Relations  \n\n\n**Publications**   \nDuchaine (2023). Could a 500-year-old treaty hold the key to peace in space? The Space Review. Duchaine (2023). Is China’s rise in space over? Indexing space power for the next space age. The Space Review. Duchaine (2023). Despite the Luna-25 failure, Russia is not a declining space power. The Space Review  \n\n\n**Experience**  \nCenter for Space Governance  \nFellow  \nJune 2023-Present   \nCollecting open source space launch, satellite, and budgetary datasets in excel to create a space power index to analyze the great power system (US, China, Russia, India, Europe, and Japan) for trends Drafting a policy-relevant brief on potential sources of conflict and cooperation between the US and China in the space domain  \n\n\nAmerican Forest and Paper Trade Association  \nInterim Government Coordinator  \nMay 2022-September 2022   \nCoordinated projects schedules, agendas, tasks, and meeting logistics to facilitate collaboration between AF&PA committees Copy-edited briefing papers and other relevant materials for Capitol Hill Organized meeting preparation to facilitate collaboration between AF&PA committees Maintained legislative tracking documents  \n\n\nManheim Central Middle School Special Education   \nParaeducator  \nSeptember 2020-June 2021   \nDelivered behavior management support and recorded behavior data to help special education students function in general education classrooms  \n\n\nMaine Representative Margaret O’Neil   \nResearch Consultant   \nMay 2020-September 2020   \nConducted a literature review and analyzed best conservation policy practices Drafted a policy guide to collaborative natural resources management between the State government and indigenous peoples to support Representative O’Neil’s legislation and committee work  \nOffice of U.S. Special Counsel Washington D.C. Staff Assistant January 2019-May 2019 Screened and verified visitors. Managed office space. Assisted with the complaint filing process.  \n\n\nUS Senator Angus King Policy   \nIntern   \nSeptember 2018-December 2018   \nConducted extensive legislative research and monitored news related to international affairs, science and technology, and the judiciary Drafted official correspondence on behalf of the Senator Conducted Capitol tours for constituents Provided general office management support, including sorting the mail, scanning and sending documents, and purchasing office supplies  \n\n\nCampbell, Campbell, Edwards & Conroy, P.C.   \nPaoli, PA   \nParalegal  \nJune 2018- September 2018   \nServed as lead paralegal for various lemon law cases for the firm.  \n\n\nGarmey & Associates  \nPortland, ME Law Clerk  \nMay 2017- September 2017   \nRead and summarized legal documents. Created a mediation powerpoint presentation. Edited deposition videos for viewing at mediation and trial, helping win over $2 million for our client.  \n\n\n**Community Service and extracurriculars**   \nAPO Service Organization   \nCarlisle, PA President September 2015-December 2018   \nLed a team of 30 to plan the annual fundraiser, bringing in over $400, an organization record Directed a marketing campaign that increased organization membership by 200% Ran weekly meetings, increasing attendance from on average 10 members/week to 40 members/week  \n\n\nDickinson College Model United Nations   \nCarlisle, PA   \nFounder, Vice President   \nFebruary 2017-May 2017   \nFounded the club and grew it from 2 members to 95 members Established the conflict simulation committee and planned 3 conferences in the spring of 2017  \n\n\n**Additional Information**   \nLanguages: Chinese Mandarin: intermediate mid, Japanese: intermediate low, Arabic: beginner",
    "title": "Not Passionate About Anything, But Want to Find a Suitable Path. What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1693406065,
    "score": 5,
    "keyword": "arab manager"
  },
  {
    "text": "How to move forward with name discrimination? So, my sister brought to my attention that I'm not getting any call backs based on my name. My first name is Arabic. When you search my first name, you mainly see Arabian and Hispanic people. She suggested that I start using my middle name because it's more euro-centric, and recruiters/hiring managers will assume I'm of french decent. Can I send my résumé with my updated name to recruiters I've already spoken with? Do I tell them the truth? Or, do I just start applying under my middle name and have things like my LinkedIn reflect it?\n\nTIA",
    "title": "How to move forward with name discrimination?",
    "subreddit": "careerguidance",
    "timestamp": 1686607527,
    "score": 5,
    "keyword": "arab manager"
  },
  {
    "text": "Male privilege is a myth in Muslim countries, too, and here's why: **Afghanistan**\n\n*Trafficking*\n\nWell here's an interesting fact: [boys are more likely in Afghanistan to be trafficked than girls](https://hagarinternational.org/wp-content/uploads/2018/04/Hagar-Research-Forgotten-No-More-Male-Child-Trafficking-in-Afghanistan.pdf). They can be subjected to sexual trafficking, forced labor or being sent off as a soldier (a loophole due to the country's absence of conscription). For example, boys often age 13 and under often were sexually trafficked into Bacha Bazi or \"boy play\", which was a custom where young boys were forced into entertainment where they danced or sang sexually as male entertainers for adult men and were raped repeatedly by their captors and his friends. At least 50 percent of sexual exploitation in Afghanistan was bacha bazi, and it often crossed lines into forced labor. Boys age 13 and under were most likely to be sexually exploited, and because Afghan girls were banned from sexual work and entertainment because they were seen as child-bearers and homemakers, [Afghan boys were picked as a substitute for sexual gratification](https://76crimes.com/2021/10/21/sex-trafficking-of-boys-contributed-to-taliban-victory-in-afghanistan/), being seen as a substitute for women. As a result, the people raping them saw them as a fake woman and didn't consider themselves gay for raping them. Taliban opposed Bacha Bazi but American-backed Afghan leaders practiced it and American forces ignored it. This led to support towards Taliban from families of victims and others opposed to the practice. The boys were made to dress in feminine attire and were released as soon as they grew beards. Many powerful Afghan men supported the practice because they believed women are for children and boys are for sexual gratification.\n\nBoys are more likely to be trafficked in Afghanistan than girls, as mentioned above, and often forced into forced labor or being a soldier, with young men ages 14 to 18 often being forced as soldiers or forced labor. Many soldiers were forced to become suicide bombers and young men put in forced labor worked in mines, worked in the streets or assistant truck driving.\n\n*Crime victimization and abuse*\n\n[Physical abuse and corporal punishment is common for Afghan kids](https://journals.plos.org/plosone/article/file?id=10.1371/journal.pone.0220614&type=printable). Except for baseline, boys were more likely than girls to experience physical punishment at home. Boys were also more likely than girls to experience peer violence victimization. Boys also scored higher than girls on depression, but often admittedly scored slightly higher on hope. Schools and teachers also inflicted corporal punishment and violence, particularly on boys. 100% of boy schools and only 20% of girl schools involved physical punishment from teachers. The same study found high rates of sexual abuse, including rape, of boys at schools, often by male teachers and older boys. When it comes to physical abuse, mothers often can be aggressors. In a [study](https://www.whatworks.co.za/documents/publications/424-ndungu-et-al-gibbs-2021-afghan-child-punishment-sem-15122021/file), 71.8% of married women admitted to physically abusing their children, and a little less than half said their partner also did so, which means many times, their partner, presumably a husband, did not do so. [In a study of physical abuse of children in Afghanistan](https://areu.org.af/wp-content/areu_publications/2016/01/804E-Love-Fear-and-Discipline-IP-print.pdf.pdf), men were more likely to believe boys got more physically disciplined, possibly due to probably experiencing it themselves or due to boys being perceived as potentially troublemakers. Women believed girls were beaten more, and women reported higher levels of violence directed towards girls because men might be unaware of violence mothers inflict on girls in the house.\n\n*Murder/homicide*\n\nIn Afghanistan, [87% of homicide victims are men](http://www.unodc.org/documents/gsh/data/GSH2013_Sex_data.xlsx). [In fact](https://www.aljazeera.com/opinions/2021/9/10/it-is-time-we-remember-afghan-men-are-also-victims-of-this-war), Afghan men and boys were killed all the time and American media only focused on the women and children, portraying Afghan men as sexist oppressors, but these men are usually victims instead. Due to media portraying Afghan men as evil misogynistic terrorists, the American military killed many male Afghan civilians and assumed they were terrorists. The media used feminist language (even the right-wing media did this) to portray women there as damsels in distress in need to help but not due to care for the women there, but to influence Americans into supporting the war against Afghanistan. America's war created so many political and economic issues, it made Afghanistan even more dangerous and violent for women and even for men. In fact, the US military only helped solely women who claimed to be harmed by Taliban, so many women lied and said the Taliban hurt them to get US aid from the US military. Most American soldiers, just like their political leaders or generals, did not distinguish between Afghan male civilians and Taliban fighters, and thus killed many male civilians. They often were unlawfully imprisoned, tortured and killed by the US military despite being civilians. Often mistaken as security threats instead of civilians, these men were killed either by the US military or by Taliban. According to the Bureau of Investigative Journalism, between January 2004 and February 2020, the US conducted at least 13,072 drone attacks in Afghanistan, killing 4126 to 10,076 people. 300 to 909 of those killed are believed to have been civilians. It's impossible to know how many were really civilians, because the US did everything to obscure this number. As the New York Times [explained](https://www.nytimes.com/2012/05/29/world/obamas-leadership-in-war-on-al-qaeda.html) in 2012, for example, the Obama administration counted “all military-age males \\[killed\\] in a strike zone as combatants … unless there is explicit intelligence posthumously proving them innocent.” “Counterterrorism officials,” the Times article went on to say, “insist this approach is one of simple logic: people in an area of known terrorist activity, or found with a top Qaeda operative, are probably up to no good.” Thus, many Afghan men who were civilians were killed by being guilty by association. They lived in Afghanistan in areas the US attacked, being labeled as automatically terrorists by default.\n\n[In fact](https://news.un.org/en/story/2021/07/1096382), the media emphasizes women and children in Afghanistan who are wounded or killed, when adult men are the most likely to have been killed. In Afghanistan, of all civilian casualties, 32% were women and 14% were children. This means 54% were men. Men were the most likely to be casualties, more so than women and more so than children. Not to mention some these children are presumably boys. The media emphasizes exclusively the women and children who are killed.\n\n*Taliban's treatment of boys*\n\n[Taliban have turned so many young boys into soldiers](https://www.hrw.org/news/2021/09/20/our-opportunity-end-talibans-use-child-soldiers). Boys as young as 6 are indoctrinated, and by age 13, learned how to use firearms. By their teenage years they were required to fight. The US-backed Afghan government and pro-government forces also recruited and used young boys. Taliban also used these boys to carry out suicides and other violent attacks, recruiting them through deception, promises of money or other incentives, or even threats. Taliban and other armed forces used young boys many times to carry out suicide bombings because they thought they could manipulate them more easily and might be less suspicious than adults. The US-backed former Afghan government and other pro-government forces also recruited young boys as recruitment and using them to fight. [Taliban used many young boys even as young as age 7 as suicide bombers](https://www.hrw.org/news/2011/08/31/afghanistan-taliban-should-stop-using-children-suicide-bombers), telling them lies like they would survive the bombing themselves if they were an amulet with Quran verses on it. Boys as young as 11 were also recruited by Taliban to carry out activities like smuggling weapons across the Pakistan-Afghanistan border, planting explosive devices, and armed combat. There were even 5 year olds used to plant bombs in south Afghanistan.\n\nAnother thing people must realize about Afghanistan is that women didn't lack rights in Afghanistan before Taliban took over. Look up pre-Taliban Afghanistan and women didn't need to wear veils and they were much more liberated and dressed in Western clothes and often had prestigious jobs. It was like America. Honestly if the CIA didn't give weapons to Islamic fundamentalist warriors in Afghanistan during the Afghan-Soviet War in the 80s, Taliban would've never taken over. That's how osama bin laden got his weapons. The CIA gave the mujahideen guerillas weapons which helped them fight off Soviets and they saved Afghanistan but these guerillas turned Afghanistan into another war zone. Then, the Taliban told Afghans that they would stop the war zones and offered an alternative, which many Afghans thought would liberate and save Afghanistan. They then recruited many people deceptively to increase the number of Taliban members, and this helped Taliban take over. A year after taking over, Taliban then began to become oppressive, which citizens didn't expect. If it wasn't for the CIA, the mujahideen wouldn't have taken over and thus Taliban wouldn't have been able to offer an alternative to citizens and take over. The CIA indirectly created Taliban. The CIA also are why Osama bin Laden managed to get weapons.\n\n**Iran**\n\nIran didn't make women dress a certain way or do anything particularly oppressive until 1979 when the Islamic Revolution happened. Before that, Iran was a secular monarchy and it wasn't different from the Western world. Women back then had more rights than women today in Iran. If it wasn't for the 1953 CIA assassination of their prime minister, King Shah wouldn't have had such a firm rule over Iran, which eventually led to Iranians having a fit about him and overthrowing him, creating modern Iran. The CIA's actions eventually led to modern Iran happening. But men in Iran have it just as bad as women in Iran. [This article](https://avoiceformen.com/featured/the-myth-of-patriarchal-oppression-in-iran/) should give a lot of information so read this article too. Boys in Iran are disproportionately raped or homeless, men are drafted, 81.9% of murder victims are men (see citation above for Afghan murder victims too which is where I got this from), and men are economically oppressed too. The media only shows what women go through. There's much more details about men's oppression in Iran. They aren't a patriarchy. They oppress everyone, just like America. For example, yes, men can divorce women for any reason while women can only divorce men for certain reasons, but women receive more benefits: \"Should a woman get divorced, in addition to what she gets out of her husband (called *Mehrieh*), her provider is considered to be her father and in case her father is dead, she will get from the government an equal share of her father’s occupational insurance as her salary for as long as she lives. This way, most divorced women do not have to work.\" Hell, mahr is something men have to pay to women in Iran if he divorces her and it's alimony but on steroids. Look up about it. Here's [two](https://avoiceformen.com/featured/indentured-servitude-for-men-in-iran-the-myth-of-patriarchal-oppressive-divorce-alimony/) [articles](https://en.wikipedia.org/wiki/Mahr).\n\n**Syria and Iraq (ISIS)**\n\nThe media always talks about how ISIS oppress women, but they hurt men all the time. If you look at Syria, so many men are killed, including by ISIS.\n\n*Murder*\n\n[Since March 2011, when the Syrian civil war began all the way up to now, 228,647 Syrian civilians have been killed](https://en.wikipedia.org/wiki/Casualties_of_the_Syrian_civil_war#Civilian_deaths). 79.4% of them were men (181,540 men), 6.96% were women (15,925 women), and 13% were children (29,741 children). Many of these children probably are boys. This means women were the least likely to be killed and usually men are killed. In fact, of all the 5,043 civilians ISIS killed, 68.65% were men, 11.64% were women, and 19% were children. Of the 200,367 civilians killed by Syrian government forces, 82.24% were men, 11.45% were children, and 5.96% were women. This means it's typically men being killed there. [Within their first year following the 2014 declaration of Caliphate](https://www.ibtimes.co.in/isis-has-beheaded-stoned-shot-1362-civilians-including-9-children-report-630716), ISIS had already killed 1,362 civilians, including 9 children and 19 women. This means 97.94% were men.\n\n*Sexual assault*\n\n[Many times the media shows women being made as sexual slaves by ISIS. What they don't show is that many men face sexual abuse/rape in this region too](https://www.unhcr.org/en-us/news/latest/2017/12/5a27a4e04/male-rape-sexual-torture-widespread-syria-crisis-report.html). They often were held as prisoners and raped, gang raped, or sexually tortured with these men ranging from age 10 to age 80. They also might get jobs due to poverty while being sexually blackmailed or forced to do sexual favors in countries of asylum to be paid money. In asylum countries, boys might be molested by older youth and others. [This sexual abuse of men and boys is done by ISIS, other non-state armed groups, or even the Syrian government](https://www.hrw.org/report/2020/07/29/they-treated-us-monstrous-ways/sexual-violence-against-men-boys-and-transgender). LGBT men were particularly at risk, but it happened to men regardless of sexuality, including straight, cisgender men. A woman for The Guardian, a newspaper who are pro-feminist, [even said](https://www.theguardian.com/working-in-development/2017/nov/21/male-sexual-torture-in-the-syrian-war-it-is-everywhere) she initially thought this was rare but interview many refugees from that region and all of them, including all the women, told her that they knew many men who were raped or sexually tortured, and of all men detained in prisons, the female refugees estimated 30 to 40% of the detained men were sexually abused. Armed groups even conducted raids on homes and raped both men and women. When fleeing, boys were promised food or money by older boys but were instead molested. [Syrian men are just as often sexually assaulted or tortured as Syrian women](https://www.arabnews.com/node/1370701/middle-east). People think that in these countries, society hates women who get raped, but they don't. The social norms by a vocal minority who influence/form the government decide what is right and because these countries are often dictatorships/kingdoms, most people can't say what they truly think. People might pretend to view rape victims negatively, which is why being raped damages your reputation there, but people there actually don't feel this way towards rape victims. People hate rapists there, and Syrian families were horrified by the male and female rape victims in their family's stories of sexual assault victimization. Yeah, there are honor killings, but most murder victims there are men, and honor killings don't happen as much as the media says, and a considerable chunk of it happens in a couple specific countries.\n\n**Yemen**\n\n[Even in Yemen, men and boys are often sexually abused, raped or sexually tortured in detention centers](https://www.un.org/sexualviolenceinconflict/countries/yemen/). [In 2020, about 62% of civilian casualties killed were men, but this article emphasizes women and children](https://reliefweb.int/report/yemen/average-six-women-killed-every-week-yemen-result-ongoing-conflict). [Even in Yemen, men and boys are raped during conflict, and this is a problem that happens in conflicts worldwide, including in any other nation](https://web.archive.org/web/20190321220806/https://www.foxnews.com/world/male-rape-emerging-as-one-of-the-most-underreported-weapons-of-todays-wars). This problem even happened in Libya in the 2011 revolution. Even in yemen, boys as young as age 8 are raped by often militias aligned with the Saudi Arabia and UAE-led coalition. Psychologists treating former underage soldiers forced to fight for Houthis, an Islamist armed group in Yemen, found that 50 to 60% of them were sexually abused by their superiors.\n\n**Saudi Arabia**\n\nEven Saudi Arabia has their fair share of oppression of men. [When it comes to trafficking victims](https://www.state.gov/reports/2020-trafficking-in-persons-report/saudi-arabia/), they only give shelter to female domestic workers and nobody else. Only Riyadh had a place for male domestic workers. Men and women from other employment sectors were unprotected. People like to complain about how women are not allowed to walk out or go on an airplane without a male guardian (at least in the nighttime) but [young men weren't allowed in malls unless with a female relative in Saudi Arabia](http://www.alriyadh.com/1008285). [In fact, evidence shows that women in Saudi Arabia are more likely than men to be happy](https://www.ipsos.com/sites/default/files/ct/news/documents/2020-12/spotlight.ksa_views_on_happiness.pdf). Saudi Arabia is more happy than most countries. People there might think people in the Western world treat women poorly, and that not allowing women to do certain things is protecting them. It's called benevolent sexism rather than misogyny (or hostile sexism). The way America views Saudi Arabia is how they view America, but the people there don't necessarily agree with the government laws. [In Saudi Arabia, virtually everyone who is executed is male](https://www.bbc.com/news/world-middle-east-60722057), and there's many kinds of capital crimes there, and two-thirds of homicide victims are men (citation above). [In 2013](https://ncfm.org/2013/08/news/discrimination-news/discrimination-against-men-news/saudi-arabia-bans-domestic-abuse-because-it-hadnt-already/), Saudi Arabia banned domestic violence by men against women, but ONLY men committing domestic abuse against women. Women doing this to men wasn't even banned (although maybe they'll be charged with simply assault). So much for patriarchy. [In fact, in 2013](https://web.archive.org/web/20131109094735/https://www.theguardian.com/commentisfree/2013/nov/02/saudi-protest-driving-ban-not-popular), most Saudi Arabian women opposed the right to drive and they believed it would lead to sexual harassment, men betraying them, and other problems. They believed it was horrible America would allow women to drive and thought it led to women being harmed or unsafe from predators, and believed this was an imitation of America. They instead believe America allowing women to drive is oppression. They believing being prohibited from driving was a privilege. In fact, this is similar to how long ago, many women often didn't want the right to vote because they believe suffrage was harmful to women by allowing them into the dangerous world of politics and considered the lack of right to vote a privilege or luckiness. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), Afghanistan didn't allow anyone to vote until 2004 where everyone including women could vote. Although women couldn't vote in Saudi Arabia until 2015, men couldn't until 2005, just ten years prior. Men are expected to pay full sum for the wedding even if his future wife makes more than him. Men are required to work as usual with no other option, but women can get the option to work and go to school (if given permission) or they can choose to be homemaker. While women can walk alone in the daytime, at night they are required to have a man with them, but this is an overprotective attitude about women, not misogyny (hate towards women). Society just doesn't care about men getting hurt.\n\n**Domestic violence**\n\n[There's surprisingly high rates of domestic abuse against men in the Arab countries, where way more men than women are victims of DV](https://www.arabbarometer.org/wp-content/uploads/Sexual-Harassement-Domestic-Violence-Arab-Citizens-Public-Opinion-2019.pdf). There are more male victims than female victims of domestic violence in Yemen (70% vs 19%) Libya (66% vs 17%) Tunisia (52% vs 32%) Palestine (51% vs 18%) Iraq (49% vs 17%) Jordan (48% vs 11%) Sudan (41% vs 25%) Algeria (34% vs 16%). There are more female victims of domestic violence than male victims in Morocco (35% vs 29%) Egypt (43% vs 26%) and Lebanon (56 vs 18%). Typically people there get help by contacting relatives instead of police for dealing with domestic abuse. They don't often contact police unless they're in Lebanon. Yes, women come forward in Arab countries. They contact the family, and the family intervenes. It's not like in the West where you call police.\n\n**Americans underestimate people's support for women's rights in these countries**\n\nPeople in these countries aren't as conservative as their governments might be. [Among men in Egypt](https://web.archive.org/web/20170503224119/http://imagesmena.org/wp-content/uploads/sites/5/2017/04/IMAGESMENA-2017-FULL-Final.pdf), men can have conservative attitudes towards women but even men. These Egyptian men still had conservative attitudes about men, most believed men and women both should not have friends of opposite gender, and most of them (80%) believed that boys are responsibile for the behavior of their sisters, even if they're younger than their sister. This means they believe the boy should be held responsible for something the sister did. Many views in the data do show you that Egyptian men have conservative attitudes towards women, but people who have conservative attitudes about what women should do or their jobs don't feel this way due to hatred of women, but due to social norms/gender roles which they still believe about men, too. 94% believe men who fail to pay maintenence should be penalized. Women were far more likely to spank (79% of women and 41% of men) or hit their children (44% of women and 11% of men). Some of the men admitted to having slapped or pushed their wife before and some women experienced it but most did not experience in the past year. Relatively low percentages outright beat them, and even lower percentages did so in the past year. Hardly any threatened them with a weapon. 64% of Egyptian men and 60% of Egyptian women believed woman should marry her rapist (but it could be out of concern for her reputation), but 72% of men and 67% of women disagreed with the idea that rapists should not be prosecuted if he rapes a woman then marries her. Only just 16% of men believed a woman is obliged to have sex whenever the husband wants if he provides financially, compared to 33% of women thinking this. Nonetheless, 80% of men and 73% of women believe a woman should be able to refuse to have sex with her husband when she doesn't want to. **Remember this though, read Arab surveys with a grain of salt. As a guy who knows many Arab immigrants, many people in these countries might have a social desirability bias and will answer what they feel the government expects them to say or what the Western questionnaires expect them to say. They probably don't mean a lot of the things they say.**\n\n  \nAccording to [Gallup](https://news.gallup.com/poll/103441/saudi-arabia-majorities-support-womens-rights.aspx) in 2007 (and the results could be different these days), 67% of Saudi men believed men and women should have equal rights, 55% believed they should be able to drive, 75% believed women should be allowed to have any job they are qualified for outside home, 52% believed women should have leadership positions in the cabinet and national council, 83% said women should keep all earnings from jobs for themselves and that husbands should support them and the household in full, and 88% believe in divorce, the child's financial support should be full responsibility of the father even if the mom has custody. Iranians had similar attitudes too, and most Iranians supported women's right to drive, including most Iranian men.\n\n**Dress codes**\n\nPeople complain about how women are required to wear a veil, but this is only true in Saudi Arabia, Iran, and some of Afghanistan. It wasn't always true in these countries. Besides, in many countries they aren't required to wear anything and in any other country besides these 3 they aren't required to wear a veil but it is widespread. but only Saudi Arabia requires BURQAS. In Iran you still them wear normal clothes, just a mere hijab and they still show some of their hair. But men have a dress code too. [In Iran](https://www.justice.gov/sites/default/files/eoir/legacy/2013/11/07/IRN102671.E.pdf), men can't wear shorts or western hairstyles, and men who wear \"feminine\" clothes might get stripped or beaten. [Men have to cover knees, and cannot wear sleeveless shirts without stigmatization](https://www.bordersofadventure.com/iran-dress-code-what-to-wear/). [In Saudi Arabia](https://www.saudiarabiavisa.co.uk/dress-code-foreigners.html), men aren't required to wear thobes as tourists but must cover legs and shoulders. They must avoid skinny jeans, shorts or sleeveless shirts. [In fact](https://www.theguardian.com/commentisfree/2007/feb/20/themalehijab), in Iran, up until maybe the 2000s, men were required to wear long-sleeved shirts before they could wear short-sleeved. [In Iraq](https://web.archive.org/web/20150529185836/https://www.nytimes.com/2005/03/18/world/middleeast/a-haircut-in-iraq-can-be-the-death-of-the-barber.html), for example, barbers were killed by militias for giving \"un-Islamic\" haircuts or shaving beards. These Islamic militants tried to stop beardless men in Iraq. One Iraqi fled and said he was beaten up as onlookers cheered for lacking enough facial hair and wearing traditional clothes instead of a t-shirt and jeans or bright clothes or clothes with English writings. [Taliban](https://www.usnews.com/news/world/articles/2022-03-28/taliban-bars-government-employees-without-beards-from-work-sources) also set restrictions on men saying they will be fired from government unless they have beards and wear certain clothes. [Taliban even will severely punish any man without a beard and stop male drivers to check if he has a beard or not](https://www.republicworld.com/world-news/rest-of-the-world-news/afghanistan-taliban-carries-out-vehicle-checks-to-see-mens-beards-womens-clothing-articleshow.html).\n\n**Conclusion**\n\nIt's a myth that male privilege happens in Muslim countries. Men and women are both oppressed there and the media just focuses on when women are but ignores men's problems there. In fact, [the roots of sexism toward women in the Arab World go back to Ottoman empire problems, which is caused by western europe](https://www.theatlantic.com/international/archive/2012/04/the-real-roots-of-sexism-in-the-middle-east-its-not-islam-race-or-hate/256362/). It wasn't caused by Islam. These countries weren't even always like this and pre-Islamic Arabia was actually worse for women until Prophet Muhammad came. It wasn't until the past couple centuries (and couple decades in some countries) when it all changed. Dress codes in these countries used to be more diverse and vary until recent times.",
    "title": "Male privilege is a myth in Muslim countries, too, and here's why:",
    "subreddit": "MensRights",
    "timestamp": 1687457371,
    "score": 373,
    "keyword": "arab manager"
  }
]