[
  {
    "text": "Help me... I'm spiraling... For a bit of background - \n\nI recently made the switch from Pre-K to 3rd grade. I teach ESL (Arabic) students in Detroit, Michigan. I have 31 students in my class with little to no support (the para that comes in for 15 minutes just sits in the back of the room and writes consequences to students who are not paying attention.... the consequences are \"write this sentance 25x\" or something along those lines).\n\nI'm expected to have 90% of the students engaged 90% of the time. Starting next week, the curriculum/staff developer is going to be walking through my classroom 3x a week to see if I'm doing everything right and what I need to fix. I'm  still not familiar with the curriculum, so I'm foundering at times to teach a lesson.   \n\n\nWe have certain classroom managements that we MUST use:   \n1. Champs   \n2. Clip Charts  \n3. Class Dojo\n\nOn top of this, our curriculum feels like worksheets after workbooks after worksheets. It's so JAM PACKED full of this stuff that the kids aren't engaged and seem to be constantly talking - do I blame them? They're in their seats writing and stuff SO MUCH. How can I make worksheets more engaging? Please help!! It's required that I do them..... but how can I do them better? \n\n&#x200B;\n\nI'm currently home sick with laryngitis.... crying because I just checked my ClassDojo and the class has -736 points. That's NEGATIVE 736 from the substitute teacher.....   \n\n\nI just can't keep on this way. I'm unraveling and I don't know what to do....",
    "title": "Help me... I'm spiraling...",
    "subreddit": "Teachers",
    "timestamp": 1569955664,
    "score": 8,
    "keyword": "arab manager"
  },
  {
    "text": "History teachers...anyone else feel like teaching history gets harder every year? I teach AP World History, Global 10 and AP Psychology in NYS. This ia mainly about Global.\n\nEvery year as we approach the end of the school year it feels like a mad dash to teach 1/10 of the possible things that can be asked about from 1990 to 2010s. I have been teaching these courses for 7 years. This is not a case of poor time management so much as it is a frustration with juggling so many recent events and giving very little depth to them. For example, the Arab Spring is New York's new favorite topic. How can I realistically teach that topic in any depth? So little time has passed with so much complexity to the situation that historians will be studying the effects of it for decades to come...why the hell are we asking 15 year olds to even remotely grasp it? I am just sick of prepping for an exam that can theoretically ask about over a thousand of different things (seriously, look at the NYS curriculum guide...). \n\nNext year the course exam changes to be more \"skill based\" which sounds good but looking at the materials available I think the test will be even more challenging. As it stands global is the most failed test in NYS.\n\nDon't even get me started on AP World...that class attracts great students but the curriculum, even with the changes, is very seriously flawed. I never once took a college history course that used multiple choice...everything was research and reading and lecture and writing. The scope was far more narrow than AP World and that made sense! Testing kids on 12,000 years of history in one year and expecting them to have any depth of knowledge is foolish and detracts from History as a discipline. \n\nRant over, thanks for listening. On mobile so don't mind my typos and grammar.",
    "title": "History teachers...anyone else feel like teaching history gets harder every year?",
    "subreddit": "Teachers",
    "timestamp": 1554766772,
    "score": 5,
    "keyword": "arab manager"
  },
  {
    "text": "Classroom management in the Middle East? Hello, Reddit!\n\nI’m posting here after a very, very challenging first week teaching in my new school in the Middle East. I just moved here after two years teaching in the United States. I’m a special education homeroom teacher - meaning I have my own class of ten students who have learning challenges. \n\nI’m slowly finding that my (undiagnosed) students might not necessarily be low academically because they have a learning challenge... they would probably succeed if they only understood English better. I’m having a hard time teaching because my background is in SPED, not ESL. Im not very familiar with strategies to help them understand what I’m saying. \n\nI’m also finding classroom management to be a HUGE problem. Keep in mind that this was a major strength for me the past two years. I’ve tried using CHAMPS - my students wont listen long enough to let me get through my expectation. I have the usual call and responses - I can get my kids quiet, but they will immediately start talking, making silly faces to each other, whispering, etc. not twenty seconds after I start talking. I can’t get through any directions without kids touching the things I told them not to, starting the assignment and doing it wrong, etc. before I’m even two sentences in telling them what to do! \n\nI’m teaching fourth grade, and I’m finding my class (8 of 10 are boys) are very “too cool for school.” They don’t want to color anything. When I read a story, they dramatically go “UGH!!” (We had a chat about respect after that one, but I’m pretty sure they weren’t listening even though they were quiet). During morning meeting time, my boys don’t want to participate whatsoever and it feels like it’s killing our classroom community more than enhancing it. My kids won’t stop speaking Arabic despite setting the expectation not to, defining the consequence, and following through with that consequence. They keep speaking it, and I keep having students tell me that so-and-so said a bad word in Arabic. My school has the expectation that because I am teaching English, students need to be speaking only English in class. I have told them that if they need to give instructions or get clarification in Arabic that all they need to do is raise their hand and ask first. I’m fine with that. \n\nMy teammate and I joined classes for an activity yesterday, and I tried to really watch how he managed the classroom. He set the expectation that if any of the teams talked during another team’s turn, that team would lose points. I would have been strict on that - that’s my management style. I set the expectation and follow through. However, many of the teams were talking and my teammate never actually took away points, just threatened to. And, believe it or not, he was able to get through the whole hour and a half activity with the kids happy and engaged. It was a noisier classroom than I would have allowed. Two of my students asked afterwards if they could be in my coworker’s class instead because it was so much more fun. \n\nI’m asking here on Reddit if anyone has any experience or advice for my situation. I am a newer teacher, and this is my first job teaching internationally. It is also my first time actually teaching SPED; last year I was a gen Ed teacher. I am trying to adjust to the Middle Eastern culture, and that might mean being more okay with my students talking and being noisier than I am used to in the states. What differences did you have to get used to while teaching in the Middle East? I feel like a terrible teacher, my students don’t particularly like me, and all I want to do is go back to the United States right now. I want nothing more than to love it here and love my students and job, but I’m having a really hard time adjusting to this classroom. Any and all advice would be much appreciated!! Thanks in advance! \n\ntl;dr: I’m a new teacher from the U.S. teaching in the Middle East and I am struggling really bad with classroom management and teaching style. Any advice on teaching differences or things to try would be much appreciated!",
    "title": "Classroom management in the Middle East?",
    "subreddit": "Teachers",
    "timestamp": 1566572926,
    "score": 2,
    "keyword": "arab manager"
  }
]