[
  {
    "text": "I left a job after 6 months once I found out I was the diversity hire. How do I explain the brief stay in an interview? I was hired as an assistant manager at a very popular retail store back in 2022. I eventually found out I was just their diversity hire as it slipped they needed to hit numbers for more POC on the sales floor. I also realized no one took me seriously, was always talked over, disregarded and talked down to, and my manager responsibilities were given to other managers while I was used as a fill in 80% of the time.\n\nThings turned sour as soon as I hit my 6 month mark and suddenly I had numerous complaints about me. Was told to go home and I was on a paid hold until I heard something from HR. Well, I was ghosted for a month by HR and my managers until I called corporate.\n\nI obviously did not want to go back to work for the company after all this. I gave HR my two week notice and got the rest of my pay check. I spoke to a family member about the situation, who had worked in HR for 6+ years, she said it very much sounded like we all were diversity hired and obviously weren't meant to stay long.\n\nShe gave me the advice to tell interviewers that it was a temp/seasonal position for the summer. Also to say I couldn't list references as I worked with minors or very young adults. However, if they really did push to low key have a friend (who knew retail) pretend and vouch for me, if I really needed it. \n\nIs this sound advice or should I be honest about being a fill in for a job?\n\nEdit1: Thank you all for the comments! I do appreciate it! To clear some things up, I did take initiative in the role. I did ask the other managers and SM for help on how the store was normally ran but I kept getting different answers. Everyone had their way of doing things and it wasn't consistent. SM did not like that I tried to impliment different things to learn. She had a very OCD way of doing things but it cut into my time of running the sales floor. She'd want me to write down our KPIs in a binder with pen and paper instead of using our computer system for accuracy. The first 2 months I did ask how my performance was doing and was told I was doing fine and that I was making sales. After that, my performance was never broached or I was told I was doing good and not to worry. So I didn't think much of it. I never was properly trained and a lot of the other managers got away with things because they had known the manager since they worked in the store as teens years ago. Also, this was not a salaried position but hourly. I've been an ASM in the past and had done fine with no issues. What I felt confused about was that I would direct my sales team and then hear my manager on our ear piece saying to disregard my guidance and do it her way when I was the MOD for the hour. I'd talked to her about it but she wouldn't take accountibility for the back and forth. She had a habit of expecting people to read in between the lines when I'd ask her to just be direct. She also would hire POC and disregard their unavailable days and schedule them regardless. This led to some of the teens having no shows due to them trusting her when she'd promise their days off.\n\nAn example of how I lost some respect with my sales team: A WOC had asked me if she had enough time to put in a 4 day leave as she was going to some college open house with her family. I told her yes, that she had two weeks in advance and it should be fine and that I'd text and leave a note for the SM to make sure she saw the time off sheet. SM saw it, I mentioned it, told me she took care of it and still scheduled that employee and gave her a warning for missing her shifts. I did not know that until the week of and told SM she had made a mistake. She said \"Oops. Oh well. Guess I'll have to talk to her for missing then.\" Employee obviously was upset as I told her I'd be diligent in letting SM know. I was. Unfortunately the incident spread through the store and I was avoided for the most part.\n\nEdit 2: I know future employers are only supposed to get clarification on when I worked, job title and to make sure I was actually at the job. But I have heard a lot of previous and current managers tell people that they wouldn't hire XYZ again and leave it at that.\n\nEdit 3: I'm seeing some comments about my qualifications about being in the ASM role. This was not my first job or even a second. I'd worked 3 retail jobs consistently between 2013 to end of 2015. Each role I went up from being sales floor, customer service agent to even ASM at another retailer before the store closed. During 2015-2019 I was married to a military personal and we moved frequently along with living overseas. In 2020 I worked during covid and had successfully kept a year long job until I needed to find a higher paying job. Between then I had a 6 month contract job then the 6 month stint as the ASM at the retail store in question.\n\n\nSome of these comments are borderline racist in themselves. Btw, I'm not black. I'm Asian, a woman, and not some newbie in my early 20s. \n\n\nTo clarify, I work in the Midwest, USA.",
    "title": "I left a job after 6 months once I found out I was the diversity hire. How do I explain the brief stay in an interview?",
    "subreddit": "jobs",
    "timestamp": 1692771371,
    "score": 2024,
    "keyword": "asian manager"
  },
  {
    "text": "Horrendous Job Market? I work as a Program Manager for a academic department at a university. I was put in charge/given the responsibility to hire a student assistant for the department. I was like sweet, this’ll be my first time conducting the hiring process all by myself, this’ll be great experience for me. \n\nI published the job ad on Handshake (many universities use this to hire students) and was like “now we wait”. I wish I was exaggerating, but I had received around 50 applications in the first hour. By the time the job posting expired (roughly a week later) I had received 400 applications. \n\nThis is a part time position (10-15 hours a week) that pays minimum wage ($15 in my state). The thing that shocked me the most was that about 85% of the applicants were graduate students at the university. It boggled my mind that why would grad students with bachelors degrees be applying to a minimum wage job with no benefits (and part time!). Also, almost all of these grad students that applied were South Asian (primarily Indian). \n\nI talked to a co-worker about it and she said that times are hard and people are looking for anything. Just to clarify, this isn’t a “Graduate Assistantship” position (those help pay tuition). I was looking for an undergraduate student for the position so all of the grad student applicants were automatically not gonna make the cut. I felt extremely bad because so many of them had emailed me personally and messaged me on LinkedIn about the job. \n\nThis job market is horrible for everyone, including students. Just wanted to share this to see if anyone else in Higher Education can relate.",
    "title": "Horrendous Job Market?",
    "subreddit": "jobs",
    "timestamp": 1694452182,
    "score": 16,
    "keyword": "asian manager"
  },
  {
    "text": "Lost at sea in workplace :( how long before I call it quits? Recently got my first \"big-girl\" job out of college--after 5 years in restaurant work throughout college, I got a job in government (I studied political science), I thought it was just what I was looking for and I was really excited to be leaving the service industry for public sector in a field I found meaningful.\n\nIt's been about a month and I know it takes time to settle into a new job but I'm feeling increasingly helpless and anxious about my job. I knew an office was going to be a culture shock but I'm realizing I seriously underestimated how difficult this transition was going to be. I come from a completely different background in terms of work experience and education and I'm pretty much the youngest person in the whole office by at least a decade. I freak out when upper-level management talks to me because in my past jobs being talked to by mgmt means you're about to get disciplined and so much of my inner monologue is spent wondering if people are mad at me and what I need to do to \"fix it,\" small errors send me on complete spirals and I feel like everyone regrets hiring me. To make matters worse I have this growing fear that I got the job by default or as a diversity hire (I've seen like one other East Asian person here, they've all said their Asian community outreach is a blind spot, and everyone seemed all too excited to hand me that initiative right off the bat).\n\nI don't know how to navigate office relations and have a lot of difficulty reading social norms here. I've always struggled with a little anxiety around small talk, etc, but I feel truly like an alien on a different planet right now. 50% of my job is networking within and outside the office and it's an absolute nightmare—after 5 years of serving and bartending I thought I was good at schmoozing but I feel awkward and out of place now. I'm really struggling with building relationships and connections because it's such a formal space but also because I just have nothing in common with these people. I don't have a family or kids to talk about, we don't have any common background, no common interests due to age and lifestyle differences, and generally different senses of humor. When I do sense potential for connection it's usually because someone reminds me of my parents and I don't want to highlight that comparison.\n\nI feel like I've washed away all of my personality and the things that make me *me* in order to fit in here. (Another add-on: I use two sets of pronouns interchangeably, and even though I don't consider the use of one set exclusively to be \"misgendering\" it feels like I am losing a connection to a part of my identity I consider very important.) I feel very unreal and very sad at work all the time now.\n\nI don't know how to ask for help from my supervisor or any other possible mentor figures because I'm afraid that in doing so I will be admitting it was a mistake to hire someone with nothing but restaurant work into government, or at least inviting criticism of my inadequate work experience. I've never felt so in doubt about myself, or so lonely or lost before. Joining new teams when I was in the service industry was never this difficult—I always felt like I fit right in from day 1 and it was never difficult for me to ask questions before. I can't sleep, my stomach constantly hurts because of how scared I am of my job, and most of all I'm ashamed and humiliated by the fact that I left a job with a team I really loved and got along with super well for a job that turned out to be...this.\n\nHow can I approach this and stop feeling nothing but dread and shame? How long do I give it before I call it quits? What do I do if I do have to quit?",
    "title": "Lost at sea in workplace :( how long before I call it quits?",
    "subreddit": "jobs",
    "timestamp": 1699379248,
    "score": 11,
    "keyword": "asian manager"
  },
  {
    "text": "Supervisor blatantly targeting wife at her new job. So wife started new job as a production worker.  Most of the employees there only knows Spanish and would just blindly do their job.  Wife works in a group of 4-5 including the supervisor who was recently promoted because she’s been there the longest and also speaks Spanish but knows alittle english.\n\nThe job isn’t very difficult they would just fold and bag garments.  But they have a counter that records how many garments are bagged and it counts towards the worker’s percentage.  Also each team members would have to rotate stations every 30 minutes or so.\n\nSo the problem started to show just within the first few week of my wife started working. My wife is Asian and came here as an international student studying English.  So she knows English pretty decent.  And the job is so easy that she does it super fast.  \n\nThe supervisor noticed how well she does but keeps on micromanaging her and literally hovers over her and just her for entire shift.  Basically ignoring the other new hires.  Supervisor also doesn’t let my wife rotate out of the heavier duty stations for hours on end.\n\nSupervisor also is staying at the bagging station and only logging her and her friends percentages.  So forcing my wife and a few others to have very low percentages.  \n\nSupervisor is also standing by the door to wait for my wife to come back from break or lunch and tell that my wife is late coming back but my wife is always coming back on time.  There’s even times when other employees come back later than my wife but supervisor said nothing to them about it.\n\nWhat should my wife do?  Should she go to the manager or straight to HR?  Cause fuck this supervisor.",
    "title": "Supervisor blatantly targeting wife at her new job.",
    "subreddit": "jobs",
    "timestamp": 1697757234,
    "score": 10,
    "keyword": "asian manager"
  },
  {
    "text": "What am I doing wrong? Why won't I still be hired for entry-level IT jobs I'm qualified to do? I've tried for years, I've done everything people told me to do, and I have nothing at all to show for it I'm angry. I'm tired. I'm getting extremely frustrated. I've finished my daily limbo of applying for IT jobs that is as mundane and soul-crushing as it has been for the whole of 2022 and the start of 2023 as I write this as an angry cry for help:\n\n**What have I been doing wrong all these years?**\n\n[Here is my resume:](https://drive.google.com/file/d/1eUIt0yIvUfG5tIi2v8syp5IBOq19D4te/view?usp=sharing)\n\nI have plenty of basic IT knowledge and have the following skills:\n\n&#x200B;\n\n* Windows Active Directory\n* Group Policy and Management\n* WSUS\n* Performance Monitoring\n* Computer Networking\n* Computer Imaging/Reimaging/Clean Operating Systems Installations\n* Help Desk Documentation\n* IT Ticketing Systems (ServiceNow)\n* Programming\n* CMD and PowerShell\n* Virtualization\n* Hardware/Software Troubleshooting\n* Web Development\n* Database Programming\n* PC Assembly/Disassembly/ Interior Maintenance/Parts Replacement/Diagnosis/Troubleshooting\n* Hardware/Software Maintenance\n* Communication\n* Leadership\n* Project Management\n* Teamwork\n* Customer Service\n* Microsoft Office Suite (All programs with 10+ years experience\n* Analysis Skills\n* Problem Solving\n\nAnd I have the following experience in these Operating Systems/programming language (my programming language knowledge however is basic)\n\n&#x200B;\n\n* Windows XP/7/8/10\n* Windows Server 2016\n* MacOS\n* iOS/Android\n* Red Hat Linux\n* Kali Linux\n* SQL\n* Java\n* Python\n* JavaScript\n* Apple Swift\n* HMTL5/CSS\n\n&#x200B;\n\nI also have tons of references from managers, colleagues, professors, co-workers who all speak highly of me and are on my resume. I have an Associate's Degree in IT. I have applied for so many jobs over the last year that I have lost count, along with hundreds of IT jobs in the last 4 years. I'll be 30 in 2 days.\n\nI wasn't getting interviews, but now I'm getting interviews, but ALWAYS being PASSED OVER for someone else. It's infuriating. The last job my recruiter tried getting me, NOBODY got hired out of 10 candidates. I also am fairly certain I am doing well in my interviews. I am confident, I give good posture, I wear nice clothes, style my hair properly to loom professional, have good hygiene, trim my facial hair to be neat and presentable, answer their technical questions and personal questions with not talking too much but giving a good amount of detail to the question and always try to demonstrate my intelligence and education.\n\nI don't have any real work experience though that these stupid American companies find desirable. The only thing I have is the stuff I did for my 2 year Associate's Degree in community college, the 4 years of volunteer IT work at my Australian community college, 1 year at Teletech as help desk support, and 3+ years of working as an IT person for a mom-and-pop mechanic shop where I set up their computer/network and do their IT maintenance for them while they pay me in cash for the hours I work (it's basically under the table contract work, but the manager vouches my work as a great reference).\n\nI also don't have a Bachelor's Degree (yet) as I have applied for University and am hopefully getting a Bachelor's in Information Systems (I don't like Computer Science) with a second major in Japanese studies/the language during the next 3-4 years.\n\nThe other thing that pains me and infuriates me when people bring it up is I have permanent facial palsy, so I do have a speech impediment, however my speech is understandable and I have had years of speech therapy as a child. Technically yes I am disabled, and have been living off SSI for the last 4 years which was a terrible mistake, and I am trying to get off of it with a proper IT job. I've also been discriminated not only for my disability, but my race as well (I'm Southeast Asian/Thai) although I've never been able to sue for it due to lack of incriminating evidence that would be acceptable in court.\n\n&#x200B;\n\nThis is the experience I have:\n\nComputer Technician (3+ years) for mechanic shop:\n\n\\-Built and installed main office computer along with hardware/software maintenance and troubleshooting.- Installed modem, routers, set up 2.4Ghz/5Ghz Wi-Fi and Ethernet network while configuring and diagnosing network issues.- Set up system administration. Installed, maintains, configures, and troubleshoots printers, mobile phones, tablets, and customer entertainment system.- Handles all technology errands, requests, and gives advice/solutions when asked for technological improvements and upgrades.\n\nTeletech (1 Year)\n\n\\- Learnt how to install Windows 10 Enterprise onto a secure encrypted USB Flash Drive. Learnt how to login into a secure Workbooth as well as login into various secure Windows 10 and Windows 7 Virtual Machines and balancing all of them to perform work related tasks. Also learnt how to use Windows VDI (Virtual Desktop Infrastructure)- Learnt how to operate Cisco IP Telephones, as well as how to call customers and co-workers through the phone. Also learnt how to put customers on hold, how to transfer to another call, how to create a conference on the phone, and how to transfer from group to secondary calls.- Learnt about HIPAA, customer security, how to handle important documents, private and secure informnation, confidential classified info, etc.- Learnt how to look up information online regarding to assisting customers on the phone- Learnt how to look for customer's member ID through the system, how to locate important data such as policy numbers, payment due, overdue payments, SSNs, confirmation numbers, etc.- Learnt how to change customer PCP (primary care physician), how to make a payment online as well as read statements in verbatum, how to make split payments, how to pay in installments, how to change addresses as well as passwords, how to verify information, basic customer service mannerisms and operations, learnt all about healthcare basics, healthcare policies and updates, healthcare security and privacy, how to verify customer ID cards and mailing ID cards as well as PCP information, and how to update policy handbooks as well as mailing them to customer.\n\nCanberra Institute of Technology (Voluntary IT Staff 3 years voluntary experience)\n\n\\- Help-desk support- Technical support specialist- Customer service- IT training\n\n\\- System Administration (Windows Active Directory)- PC Assembly/Disassembly/Maintenance- PC Parts Replacement- PC Diagnosis/Troubleshooting- Observed training new staff- Documentation- Software Maintenance- Hardware/Software Troubleshooting- Virtualization- Operating System Installations- Virtual Machine Installations- Microsoft Office- Hardware Assembly/Disassembly- Cleaning/Maintenance\n\nWith my LinkedIn, I took my parents who are a Business Analyst and an accountant with a MBA, studied their profiles and copied their formatting to make my own LinkedIn as professional as possible. Most of the stuff you see on here are taken from my resume and LinkedIn. It also gets noticed daily by people and I get messages from recruiters offering me job applications in IT.\n\nAlong with all of this, I constantly self-study, am always learning and updating my knowledge on technology and what's new/evolving, constantly trying to improve my knowledge and experience with learning new skills, and am studying to get my COMPTIA A+ certification.\n\nAnd despite all of this... **I still have not gotten a goddamn IT job. I've wasted so much of my life trying to get my foot into this god-forsaken field but nobody will hire me for an entry-level position when I feel I am CLEARLY qualified to perform the tasks and learn to improve my IT knowledge and experience. It's a catch-22 with this field. I need the experience to get the job, but I need the JOB to GET the experience (especially since no internship has taken me). I've never gotten a single internship or job offer as I was always passed over FOR SOMEONE ELSE.**\n\nI've built computers from scratch at home and at college, I've fixed broken computers and laptops, I've replaced parts, installed operating systems, changed operating systems, programmed basic software applications, designed websites, done ticketing systems, monitored performance on computers/networks, written into knowledge bases online and have documentation experience, led a real life IT project in college for a museum, trained myself to use Windows servers at home by virtualizing 3-4 servers and desktops with VMWare so I could learn Windows Server 2016 and Active Directory, I've taken proficiency and assessments tests on recruitment websites and took them until I got a high score to impress interviewers, I've set up my own networks and other people's networks, routers, printers, etc.\n\nI've used so many job search websites: Indeed, LinkedIn, Monster, DICE, SimplyHired, ZipRecruiter, as well as applying to HUNDREDS of company websites and recruitment agencies. NOTHING but interviews and that's it, or not even hearing from them, or the most insulting: A damn automated message saying \"They're going with other people\".\n\nI get good feedback from people and constructive criticism on how to improve my interview skills from recruiters and have had years of interview experience. YEARS.\n\nWhat the hell am I doing wrong? I've followed everyone's advice and have gotten **NOWHERE.** What am I supposed to do to get into this field?! My career has been meaningless because it has never taken off. At this point, I have a better chance of getting better at digital art and somehow making money off that than getting an IT job and starting my IT career...\n\nTell me what I'm supposed to do to get an IT job and start my IT career when **The United States of America does not want to hire me for a single IT job let alone an entry-level one**",
    "title": "What am I doing wrong? Why won't I still be hired for entry-level IT jobs I'm qualified to do? I've tried for years, I've done everything people told me to do, and I have nothing at all to show for it",
    "subreddit": "jobs",
    "timestamp": 1676261898,
    "score": 6,
    "keyword": "asian manager"
  },
  {
    "text": "I'm 30 with an MA in Asian Studies and an advanced level of Japanese, but I can't find a job due to no entry-level experience. Considering being a high school Japanese teacher out of desperation. Feeling lost and depressed. Sorry this is super long, but I really needed to get this all off.\n\nAs I said in the title, I'm 30 with a BA and MA in Asian Studies and an advanced level of Japanese, but I can't find a job due to no entry-level experience.  I chose to study Asian Studies and Japanese because I became interested in Japan in high school and I was told that Asian Studies was a great major since it could be applied to a variety of fields, such as business, government, the FBI/CIA, etc. I had hoped to get into business where I could use my Japanese language skills and cultural knowledge to do international communications and travel to Japan for business.\n\nAfter graduating, I moved to Japan where I taught English for four years. I didn't want to be a teacher. It was just a means to experience Japan at a deeper level and improve my Japanese skills. I enjoyed teaching there for what it was and did pretty well with it as I made significant improvements to my school's English teaching system. However, the industry is terrible and foreign English teachers basically live paycheck to paycheck. Without having a near-native level of Japanese, job options besides teaching English are extremely limited there. Because of this, I moved back to the US last year as I felt it was time to get a real career started. I miss Japan terribly though.  \n\n\nNow, I've been job searching for over half a year, and I can't find a job, which is making me very depressed.  I managed to get three interviews for jobs I would have loved. I made it to the second round in an interview for my dream job at a major gaming company, but it didn't work out. Unfortunately, I've come to realize that while my background can be useful, it's too specific to solely rely on to find a job. My Japanese is around advanced level, but that's still far stretch from being fluent, so I don't qualify for fully bilingual positions. There are very few jobs (at least at the moment) that need someone with that kind of background, so I've given up on finding anything Japan-related and am searching for any decent job just to get my foot in the door and start and actual career path. I've applied to numerous jobs that I know I could quickly learn and do if given the chance, but I haven't gotten a single interview because even entry-level jobs are looking for specific skills and experience. I don't even qualify for administrative assistant positions. The only one interview I got was because my dad's acquaintance gave my resume to their company's recruiter and it was for an inside sales position. My Japanese skills and knowledge of Japan are a great supplementary skillset, but I lack any primary skills to land a job. I'm at a total loss at what to do now.\n\nI reached out to my Japanese professor and his suggestion was to become a high school Japanese teacher since I meet the requirements and it offers good job security and lifetime benefits in my state (which certainly sounds nice). He also suggested going for an Ed.D, but I don't want to take out more student loans. My parents and fiancée think I would be a great teacher, but I really don't want to teach as a career, especially in K-12. I always said if I ever wanted to teach, I would get a Ph.D and become college professor. I think I could enjoy teaching college. But even if I went that route, I would still need a full-time job while I was going for a Ph.D, and the starting salary for a college professor is just way too low to justify it at this point in my life. Despite all this, I'm considering going the teaching route because I'm so lost right now. I just don't know what else to do or what I can even do.  Teaching offers a much better salary compared to most of the entry-level jobs I've looked at, so I guess I could teach for a year while I continue to search for other options. Any suggestions or advice would be greatly appreciated!",
    "title": "I'm 30 with an MA in Asian Studies and an advanced level of Japanese, but I can't find a job due to no entry-level experience. Considering being a high school Japanese teacher out of desperation. Feeling lost and depressed.",
    "subreddit": "jobs",
    "timestamp": 1677660000,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "Pls Don't Discriminate Just Because You Are Having a Bad Day This was my (25F) first time working with this coworker (27F) that has been rehired due to many many convincing behavior and meetings for the last 2 weeks from my one of my general managers (32M). She was fired for a reason because she made at least 2-3 coworkers (19F, 22 M, 21F) cry after making fun of how they serve and talk to customers. This was my first time working with her, because I got hired after she left which was about a month ago. She got re-hired again just yesterday, after she begged one of my 2 managers that she needed the job to be able to pay for her car and rent. She ended up discriminating not ONE but TWO people and telling the other manager, explaining to her in Spanish (because the other manager is Hispanic and fluent) that she had a miscarriage 2 weeks ago and that she didn't need anyone's stress pushing onto hers. Okay, well, I am all about the professional over personal matters, but I'm not once the shift is done..like as in once the closing is happening and there's no customers, I am here for any of my co-workers if something is going on and they just don't have anyone or feel like they are alone, because that is something no one should ever feel, regardless. However, just 30 minutes into our shift, she comes up to me asking me do I speak fluent english because she thinks I have an accent (fyi I am a U.S. citizen, and have been raised in the U.S. since I was 5 after immigrating from my native Asian country), even after I introduced myself to her before I started my shift to her. She started laughing and standing at the bar, ignoring majority of her customers throughout work to which I had to attend to her customers due to her lack of attendance and attention, and when I tried to get her attention (multiple times), she asked me on purpose to speak louder and clearer. This ended up making my managers very disappointed and frustrated even when I didn't complain about it (because they heard it too loud and clear), and she ended up defending herself saying that the two managers are trying to make a fight against her, just because she was given a warning. She ended up saying something racially discriminative to one of my 27 year old managers who is also Asian, but born and raised in America, to the point where the customers had to say something to her because everyone was hearing her crying loud and clear. Are we in the wrong?\n\nTLDR; Co-worker says something discriminative but blames it on her personal issues that made her say such things; ends up crying outloud enough saying she is a victim for the whole restaurant to hear and ends up getting fired.",
    "title": "Pls Don't Discriminate Just Because You Are Having a Bad Day",
    "subreddit": "jobs",
    "timestamp": 1684135822,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Engineer job hunting vs operation manager at hospitality franchise. What should I do? Super brief about me:\n\n\\- mech engineering degree from decent (not godlike) uni\n\n\\- 2 internships\n\n\\- 3 year engineer experience after struggling to get a job for like 8 months. Worked remotely and casual during COVID. TBH, I was doing most of generic stuffs like internal communication and little bit of manufacturing. Waffled by CV, but not really know what I have done.\n\n\\- 1 year business owner in framing. Just had a golden lifetime chance and took it. Worked ass off and closed business, but painfully learnt about business. Wants to do another business in future after like 5-10 years(with proper planning and preparation) and have no idea about that damn niche tbh.\n\n\\- was working on trades just to make a living and recently got fired due to financial difficulty in company. I was actually doing some job hunting and planning to resign once I get one.\n\n&#x200B;\n\nWhat I want:\n\n\\- okay remuneration, 70k-80k (not in USD)\n\n\\- staying where I am living, so I can plan my future with my girlfriend\n\n\\- good work life balance, unless I have found my passionate industry\n\n&#x200B;\n\nThis explains why I am struggling with my career plan. I am interested in doing engineering, just to fulfil my 3 criteria. However, I cannot say that I am passionate about it. Soz Asian obeying study nerd and didn't even think about what I really want.\n\n&#x200B;\n\nShould I continue my engineering job hunting or do another career shift into operation manager at hospitality franchise? Pretty rare opportunity to become an operation manager, because this is job referral from my operation manager friend who is willing to teach me preliminary stuffs like coffee recipe.\n\n&#x200B;\n\nI would take engineering IF I can get it in, but it's uncertain...",
    "title": "Engineer job hunting vs operation manager at hospitality franchise. What should I do?",
    "subreddit": "jobs",
    "timestamp": 1700295645,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "How to convince an HM that you really want a job 3hr from home. I have an interview coming up for a good-to-great job. I live in a Nordic capital city and the job is a 3-he train ride away in a small town.\n\nThe recruiter was incredulous as to why J was even applying but I assured her that I’m aware and committed.\n\nIf the issue comes up again in the interview, I have the following prepared answers (all true):\n\n1. The job market in the capital has gotten crazy. I applied to a 1-3yr experience job with 5yr experience and lost to someone with even more experience. So I’m trying my luck in the countryside.\n2. I am recovering from some personal tragedies (dad died, going NC with mom, MiL dying, 50hr work week, let go by an apathetic manager) and would like a change of pace and enviornment.\n3. I’m from a huge Asian city where it’s pretty common for people to work 4-8 hours away from home during the week and only be with the family for the weekends. I myself have lived 3 hours away from home in the past (before remote work was a thing).\n\nWhich answer do you think is the best?\n\nPS. The plan is to rent a small room in the countryside Tue-Thu when I’m supposed to work onsite and spend Fri-Mon back in the capital. I have a house in the capital and mortgage payment is the main reason I’m urgently applying for jobs so soon after being laid off (last day was 30 Nov).",
    "title": "How to convince an HM that you really want a job 3hr from home.",
    "subreddit": "jobs",
    "timestamp": 1701723442,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Am I being treated unfairly at work? I’m not sure if I’m being treated unfairly or not\nI’ve been working at new job for about a month \n\nThey didn’t let me take a shift which was weird they said I needed more training but the manager would be the one training and she hadn’t done that? \n\nAnd they Recently hired a new girl that they trained for that shift.. \nshe’s prettier than me and white , I’m Asian. \n\nThe manager recently has been cutting my hours saying it’s bc more workers are coming from college or whatever so I believed her but I looked at the schedule and the new girl is scheduled 5 days a week for the past 2 weeks we also both have full time availability. \nSo they’re choosing her but idk why I haven’t done anything wrong \n\n\n\nSo they said since they have less hours for me here they suggested I work at this partner restraunt they said it’s bc I’m enthusiastic and want more hours that they can’t give ( they do have hours they gave them to new girl) but the thing I’d it’s an Asian restraunt and im Asian. It just feels… weird to me that for some reason they don’t seem to like me, I can’t think of anything having to do w my actual work experience \n\nThey’re all white and kind of mean very clique like not all but some of them.\n\nAm I crazy?? Or is there like something here \n\nThey seeming to not like me for no reason except maybe I’m not as pretty as the others \nThey cut my hours saying it’s only bc  they have too many ppl and not enough hours and no one’s getting over 2 shifts a week which they are atleadt the newer girl. \nIdk what i did wrong for them to favor the newer girl.. \n\nIt seems like they’re pushing me away from this restraunt and then saying I should go to a restraunt that happens to be very Asian.  They’re owned by the same person but still",
    "title": "Am I being treated unfairly at work?",
    "subreddit": "jobs",
    "timestamp": 1682747491,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Have I gaslighted myself for the last decade and chose a path that I'm not really good at? Y'know, my story is of typical average Asian John Doe: Go to the top universities overseas they said, take a major in STEM(chemistry/chemical engineering in my case) they said, and you'll land on a career you want they said.\n\nHowever, as the years go by working in a service sector related to my major, I have a genuine doubt that this is the field where I have forte with. Not to mention that I can't observe growth in competency enough for an assured promotion, I'm relatively behind other colleagues who don't even speak English properly, didn't necessarily attend better tertiary education than me, and yet exhibit more in-depth knowledge and skills in the same field.\n\nWhat's worse might be that I have lost interest in this field(chemical/chemical engineering) and I'm losing willingness to obtain skills or analyze trends. I lack initiative to read scholarly articles/press releases in the industry during my free time and I loathe trying to obtain additional professional certificates on this field. I'd rather spend my free time on learning electric guitars, music production, or digital arts.\n\nEver since my college days, while I've been losing interest in the field I majored in, I indulged myself in hobbies that I had genuine passion in. I've been interested in composing music, and learning electric guitar, and I even (while embarrassing) managed to compose a song or two with it. Making digital arts(especially related to video game fanworks) seems enticing as well, and I'd rather spend more time watching tutorials than reading journals on new technolgy in this industry.\n\nIf I do have to mention an edge that I have in my current career, the only thing I could think of might be that I have a bit of English Proficiency. But honestly, I couldn't experience myself using that edge fully.\n\nAt the same time... the current one is the only job that brings home bacon, although the paycheck isn't ideal. As much as I'd love to switch direction and do what I truely wanted(like becoming an artist, a musician, or even a youtuber), I fear that I will be venturing into uncharted territory and have to start from the ground-up again. If I were a sophomore dropout, this would have been easier, but I'm literally lapsing into my 30s.\n\nAnd(while cliche), I keep on asking myself - \"should I stay or should I go?\" Should I pursue what I'm truely interested in, or reluctantly stay in this field, despite lacking both interest and anticipation for growth? Well, I'm not expecting anyone to answer this question, or give me an advise, but would love to hear if there are others who had the similar experience.\n\n* English is not my 1st language and I wrote this at 4 am in the morning, so apologies if it sounds rough around the edges.",
    "title": "Have I gaslighted myself for the last decade and chose a path that I'm not really good at?",
    "subreddit": "jobs",
    "timestamp": 1701467299,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "My workplace is literally 99% young women. Last night after we closed a creepy man was loitering outside, waiting for my coworker and I to leave. It was scary. I’m still a little shaken up by this. I’m a VERY petite woman who lives in a relatively safe town. You don’t often hear about this kind of thing happening. I’m 24, and was working with my 21 yo coworker. She’s only a little taller than me; both of us are pretty small.\n\nImmediately after we closed the store (at 8:29 instead of 8:30 because we wanted to go home lol) we went outside to collect the outside trash to take it to the dumpster. It’s a rule at our work that we must take out the trash in pairs at night.\n\nWhile my coworker was waiting for me to finish tying up the garbage bag so we could walk it to the trash, this old guy in his 60s(?) kept trying to talk to us. I honestly didn’t absorb jack shit of what he said because we just closed and I was trying to go about with my own business. But my coworker later told me he was trying to make conversation about the weather. She smiled at him but neither of us responded to him. I expected him to leave but he didn’t. Then he said something else about the weather and didn’t get a response again. He still just kept standing there. Then he said something about, “I don’t know why everyone thinks I’m an asshole” and put on a black face scarf. I saw this too. My alarm bells went off. From the spot he was standing in, he was kind of cornering us into the patio area. I said to my coworker, “Y’know what, I think we forgot to do something. Let’s head back in to get that done before we go.” I’m so glad I followed my intuition and that she didn’t question my excuse. She was creeped out too.\n\nAfter we got inside and locked the door we immediately talked about how weird and creepy that guy was??? We planned to finish up the other closing duties before taking out the trash so we could wait for him to leave but he was standing there waiting for us. FOR LIKE 15-20 MINUTES. Several times we kept wondering, “Is he still there?” and peeked out the window to see him standing there in the dark, with a face scarf and bucket hat on, staring at the store. We don’t have a back door. He was standing at the only exit.\n\nI quickly took a picture of him, for evidence I guess? The photo I got didn’t capture any notable features because in the dark he was just a black silhouette. Maybe that was a stupid thing to do because he saw me. He started knocking on our door! We didn’t answer obviously. We were freaked out and wanted to get out of there ASAP. Fuck the rest of the closing duties lol we needed to leave.\n\nI called one of the businesses next to us to ask if they could send someone to walk us to the trash and our cars. They didn’t answer (I think they were closed) so I tried the restaurant across the street. Thankfully they did answer. I explained the situation and the employee on the phone said she’d send her manager who’s “very big and scary.” The manager came over, and he was a very tall but  lean and kinda scrawny guy. I found a little bit of humor in that lmao 😅. He came over with another male employee too.\n\nWe thanked them profusely and they walked us to the trash. We passed the creepy guy and he said something to us, I have no idea what, my brain couldn’t process it for some reason. I think I just wanted to focus on leaving while acting normal. After taking out the trash we had to walk back around the corner near the spot he was standing and he was gone. The employees walked us to our cars and we got the heck out of there lol. I made my coworker text me when she got home safe. Then I started a GC with our manager and told her about the situation. (When I gave a physical description of the guy and mentioned his grey stubble she said “Ew he sounds gross” LMAO that made me feel a bit better about everything somehow). I have to file an incident report when I go back into work today.\n\nThis whole situation was pretty terrifying. My workplace is full of teenage and early 20s girls. We’re really vulnerable. I’m glad I go outwardly deadpan and emotionless in situations like these, because I had my wits about me and was able to make some good decisions while being calm.\n\nOne thing I kind of wish I did was call the police. When the creepy guy started knocking on the door I was contemplating calling 911. This probably sounds kinda stupid but I was afraid of them not taking us seriously. What if they were like “Maam this isn’t an emergency, next time call the non-emergency line” or what if they took eons to show up? I’m also a little scared of the police after everything that happened in 2020. I doomscrolled a lot back then and saw too many videos of police either abusing their power or being completely useless. I’m half Asian and easily white passing but as a really tiny woman I’m really easily intimidated. My manager said that if this happens again to go ahead and call the cops. I’m going to warn all the other girls who work closing shifts too, because I feel like this creep will probably show up again.\n\nThat’s it. I guess I just needed to get this out, and to have something to help me file an incident report at work later. After work I went over to my godparents house (my only family, also I live alone and was not in the mood to return to my dead silent house at night). That helped a lot and they made me feel safe for a bit.\n\nNever posted here before. I’m looking forward to my free Reddit Cares handout that everyone seems to get! 🤲",
    "title": "My workplace is literally 99% young women. Last night after we closed a creepy man was loitering outside, waiting for my coworker and I to leave. It was scary.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1703275092,
    "score": 212,
    "keyword": "asian manager"
  },
  {
    "text": "I have a great relationship with my mom, but I feel like I’m the mom. Hi, I have no idea if this is even the right subreddit for this but I really have to get this off my chest. \n\nI’ve always had a great relationship with my mom. I idolized her, wanted to be her, and she’s always been open minded to everything that has gone with my life. I come from an Asian background and I always felt like I beat the typical “Asian mother/daughter” stereotype (mom resents daughter for being able to have the life she never got to have, pushes her too far, etc) but recently I’ve become pretty sad and resentful about my childhood. \n\nThinking back, my mom never really went out of her way to be a parent. She was always there, don’t get me wrong, but little things like packing me lunches, taking me out shopping, helping me boy problems, etc. and it dawned on me I really had to figure out everything on my own. I started taking on the “head of the household” responsibilities at age 13 because my mom couldn’t speak English and my older brother had gone off to the military. I managed the house, bills, my own studies and future planning, etc. until I couldn’t bear it and became severely suicidal at age 15. I could only be depressed for about half a year because I couldn’t bear the toll it would take on my mom if I wasn’t there to translate and be there for her. \n\nI don’t blame her or anything. She was going through so much in a foreign country trying to take care of us financially that she just really couldn’t be present. My mom was always the breadwinner in the family. My dad put our whole family in jeopardy multiple times financially and my mom always bailed him out until I discovered his infidelity at age 10. Since then they’ve been separated (he lived in my home country, we lived in the US, absolutely no contact) and got divorced early this year.\n\nI’m just realizing that I never got to be a child or act my age. I’m 24 now and I have no idea how to accept a gift from my mom. She took me shopping today and I tried to pay for everything because in my head I was thinking, “there is no way she can pay for all of this” and it was just so unfamiliar. I felt uncomfortable. I’ve burdened a lot of her emotional pain while trying to deal with mine for so long that I don’t even know how to accept such a small thing like couple pieces of clothing. \n\nI know she blames herself for how fast I grew up so I try to make sure she thinks it was beneficial for me because I know how to do so much and am a responsible person at a young age. But sometimes I just wish I could just be a damn child. I feel so foolish for even thinking this way because I am way too old to be throwing tantrums or acting like a child but I just wish I could. She oftentimes calls me her guardian and says things like “you’re my mom and not the other way around”, and while I’m grateful she trusts me so much to guide her through life, I feel like that’s supposed to be her job. I also know there comes a time in every child’s life where you begin to parent your own parents, but I just wish mine didn’t have to come to early. I talked to her about this too recently and she apologized but she just said there’s nothing she can do about the past and she’ll try her best moving forward but that I’m too old to be hung up on the past or childhood I didn’t get to have. \n\nI love my mom, she’s so strong and I will always be there for her and have no doubt she will do the same for me. But idk I guess I’m just here for some advice on how I could get past this feeling of “I missed my whole childhood and now I’m too old for any of this?”\n\nThanks everyone for reading. For anyone who has gone through something similar, I hope you’re able to heal your inner child.",
    "title": "I have a great relationship with my mom, but I feel like I’m the mom.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1692029170,
    "score": 10,
    "keyword": "asian manager"
  },
  {
    "text": "Not sure what to do…. I work in a retail clothing store in a big strip mall.  \n\nRecently a guy who was passing by turned back, came in, and bought a pair of socks, and proceeded to hold up the line to make conversation with me. \n\nHe said there was something “glowing about me”, and that I must be an artist of some kind,” and asked if I had any tattoos that were “hidden.”\n\nI said “no” to both.  Although I do create art, I don’t have any tattoos, but I thought it was creepy that he asked if I had any he “couldn’t see.”\n\nNow he comes in regularly to purchase inexpensive items (and returns them sometimes too), and tells the other employees he’s “my customer,” and asks for me.  If I’m not working, he says he will come back. \n\nOn a subsequent visit, he asked what ethnicity I was, and I asked why he wanted to know that.  He replied he “always thought Asian women were beautiful.”  I just said “oh, that’s nice” and dodged the question. \n\nHe even left his number when I wasn’t there once, so I could call when I’m in so I can “take care of his transactions.”  His note said his name was Frederick, but I could call him “Freddy.”\n\nHe hasn’t asked me out, but I feel it’s just becoming over the top.  I don’t know how to approach the situation, since it’s not just a random guy that won’t leave me alone outside of my place of employment. \n\nWe do need the sales, and I don’t want a complaint reported to corporate if I say something.  I’m a senior manager there, so I know it will fall on me if I say something and he complains. \n\nMy D.M. basically said he hasn’t crossed any lines, and he’s spending some money in the store, so “it is what it is.”",
    "title": "Not sure what to do….",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1692537622,
    "score": 4,
    "keyword": "asian manager"
  },
  {
    "text": "mom makes comments about body tw: ed \n\ni'm (18f) back home for break and my mom has been making comments about my body (or my past body) or commenting on food that i'm eating\n\n(i'm just listing off stuff i remember off the top of my head)\n\na year or so ago we were talking about chinese traditional dresses and i was like \"my friend wanted to get one\" and my mom essentially said that she'd look good in it bc she was skinnier and people who are bigger (like me ig) wouldn't look as good and should avoid it 9or slim down to wear it)\n\nwe were at costco a week ago and i mentioned that costco now had their mango smoothies in the food courts and my dad asked if i wanted one, to which my mom promptly replied \"are you sure you want to get that; you'll get fat if you drink it\". i hadn't even said whether or not i wanted a smoothie yet. \n\njust earlier today i bent over and my sweatshirt kind of rode up and she made a comment on the fat on my waist. \n\nshe was also talking how my legs were like \"elephant legs\" around a year ago and that i had finally managed to slim them down\n\nsometimes she'll also tell me \"you're young you shouldn't be worrying about weight and just eating whatever you want\" \"when i was your age i ate whatever i wanted\" ???\n\ni don't know what to do anymore. i know i'm not fat by any means; i'm 5'6 and 127 lbs 27 waist i don't get why she had to mention the fat on my waist? am i not supposed to have any fat on my body\n\nfor the past year or so i've been dealing with an eating disorder that's gotten horrifically worse in college and haven't been the best mentally when it comes to my body image. don't wanna get too into the specifica of the ed is this is mainly about my mom 😀☝️\n\nher commenting makes it even worse as i feel even guiltier eating \"junk foods\". i know i shouldn't let what she says get to me but it's kind of hard when you're already having trouble with your body image and there's someone behind you almost fueling your ed.\n\nik that if i ever do let her know that what she's doing is making me feel horrible she'll say \"i'm doing it for your own good\" or something. i'm east asian so i feel like part of this behavior is due to the body standards there\n\nik she's doing what she thinks is best for me; it just sucks when your ed is taking over your life and your mom's here cheering that said ed on. \n\nthe disordered part of me is thinking: this is a great chance for you to lose more weight while the part of me that knows i'm in a self destructive cycle right now is telling me to get it together. feeling like it's easier for these words to get to me since i'm so dissatisfied with myself and my body that i can just convince myself what she's saying is true.\n\ni don't know if this is a rant or a help post; just wanted to take this off my chest as it's been increasingly suffocating",
    "title": "mom makes comments about body",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687761108,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "In the closet transwomen nurse Highly debating switching from my Adult Med Surg unit to NICU TLDR: I’m a dark, south Asian mtf (in the closet) in the nursing field and am concerned if I will not fit in a NICU unit that is 90%+ white women because of previous experiences. I also have minimal experience with babies. Med surg unit feels like I’m not critically thinking as much as I would like and don’t like the population that much \n\n\nIn case some background info: I worked in BMT at a highly regarded hospital and was fired, had an extremely terrible time there even though I decided to be a peds nurse. Because of the area I’m in I had to go to adult health care. If it matters here’s my experience that had me switch https://www.reddit.com/r/nursing/comments/134qb9u/how_is_the_pediatric_nurse_environment_had_a/?utm_source=share&utm_medium=ios_app&utm_name=ioscss&utm_content=2&utm_term=1\n\nSo I have been working in my med surg unit for 6 months now, 4 months out of orientation. I have gotten semi-comfortable in the sense that I think I can handle what the shift can potentially entail. However though we have a 28 bed unit and we sometimes run 5 nurses and 1 PCA so we each get 6 patients. Some of these patients are extremely heavy and in general I just am NOT interested in the older adult population. \n\nBut in general a lot of my patients really like me and enjoy me as their nurse since they feel I advocate for them. My manager before she left (we have an interim manager on another floor and no educator) said I have been doing really well and am on track as a new grad nurse. \nMy preceptor also said I am doing great and is now trying to get me oriented as a charge nurse because of staffing in general being quite low. But I feel like at the end of the day I feel like I’m passing meds. I won’t be cocky and say I know everything though and I know there’s more to lean\n\nI know that my floor in the whole hospital system is regarded as the floor “I absolutely will not want to work in and that floor needs to be paid double” by floats and RTs. \n\nI don’t have a good baseline so I can’t say how legit that is or isn’t but I know in general it’s a tough high acuity unit. However I really like the staff we have here as a whole. Coming from my BMT unit the people here are very accepting of me and do not have issues with me not knowing things. I don’t feel like anyone looks at me odd. \n\nI shadowed at the NICU in our hospital and I was first concerned because in the interview the nurse educator specifically asked me why “as a MALE are you wanting to work in NICU and are you comfortable talking to women” which just throws me off a lot. Is this a general concern in NICU? Or am I being paranoid because of previous potential profiling?\n\nHowever the actual shadow was great. The turnover is very low with experienced staff (we have some nurses who are experienced with 10+ years but not much), I feel like all the questions I’m asking turn into understanding more physio which is something I love And in general I feel like I am critically thinking a lot more in a way that feels engaging. \n\nThe staff seemed friendly at least with the nurse I was shadowing and I didn’t feel like I had people looking at me in a very concerned way like I did in BMT. I like that the axillary staff is all there as well and i just feel like assessing feels more…engaging? I’m not sure how to explain it. \nAlso, from the nurses I talked to they said my current unit to nicu would be a much less hectic case load as well \n\nThe only thing I’m nervous on is being able to have the skills for IV placement, labs and whatnot because frankly I suck at it a LOT but I very rarely get the chance to try because our unit just has constant hard sticks even for the experienced nurses here. \n\nShould I take a plunge and go to NICU?",
    "title": "In the closet transwomen nurse Highly debating switching from my Adult Med Surg unit to NICU",
    "subreddit": "nursing",
    "timestamp": 1687879739,
    "score": 9,
    "keyword": "asian manager"
  },
  {
    "text": "How is the pediatric nurse environment? Had a terrible experience in BMT and nervous (Long post) \nTLDR in bottom\n\nDisclaimer: I understand now a heavy BMT unit is just not a new grad appropriate place because mistakes are more serious than a floor unit. Do not recommend for a new grad, maybe try it after you pick up your fundamentals.  \n\nNew grad in my first month. One of the top 4 hospitals had a job opening with literally “New grads welcome! BMT RN” so I happily applied since I do feel long term ICU care really can fit my interest. \n\nQuite literally I got the same vibes from my preceptor as I did in nursing school which is just a nurse who gets furious with any mistake. Imagine blonde high school bully from a Disney movie and you get the picture, it felt I could never win. It got so bad I would go to work tachy in the 130-140 range when I never am tachy besides a workout lol. \n\nIf I didn’t know something and asked how to do something it’s “why don’t you know that already?” And if I try to problem solve it’s “stop trying to pretend you know what you’re doing”. \n\nI actually never got critiqued besides one time when I was doing a sterile cap change for a central line on “just do the whole process, you don’t have to verify with me if this is right, I’ll correct you” which was fair. The other times I had the preceptor constantly TEXT the manager my mistakes while we are in the patients room and NOT tell me what I did wrong. \n\nI only was informed when I was called in the managers office. I got heavily critiqued and had a week to fix my mistakes and got fired with the explanation of “we expect you to have your med surg skills when you start”. \n\nI decided to switch specialties and now work at a heavy adult med surg unit, the staff is amazing for the most part even if we are short staffed. The population though is not for me long term. I really want to work with kids again. Though I think I do an okay job because a lot of my patients and families ask if they can have me as their nurse again lol. There's a lot more teamwork and a lot more support with asking questions a new grad might typically ask. So for developing fundamentals, the unit is good and that's why I'm staying here because the city in general is monopolized by this one huge academic peds hospital and the BMT manager never gave me the option to switch units but outright fired me.\n\nLast point because I feel its important to my unfortunate perception of peds is; I am from a very diverse city, I moved to a much more white dominated city because my wife is in med school here. We're planning on hopefully being elsewhere for residency that's more diverse populated. This matters a lot because in the unit I am (and I am not exaggerating), the only nurse who is not a white women and am a dark brown, southeast asian \"male\" nurse. There is quite literally no nurse, no NP or any staff besides the HUC who is remotely similar to my skin tone or background. Whereas the patient population is HEAVILY similar to my own ethnicity (side note: another reason I was really interested in this unit was this. How the nurses treat those patients and their families is a whole other issue that deserves a post honestly)\n\nI don't know how else to explain this so bare with my explanation, but the way people were looking at me was in a way I have never been looked at besides in one context. The only previous times i have been looked at with the vibe of you don't belong here (as a general gist of how it felt) is when I am in extremely white, very conservative dominated areas in the past. I asked other new grads do they also have this feeling assuming this is a new grad thing or if they have been thrown into drama and everyone said they have not. One experienced male nurse who is precepting another new grad told me that this unit just is very gossipy after talking about this. Who also said the mistakes I made is ones he's made in the past and the preceptors can be rude.\n\nAs I am already being thrown in drama with nurses who I have no clue who they are stating, and telling the managers, that I said \"This unit is easy, this is just a typical med surg unit. It's not hard to deal with this\" when I literally said none of this. This became an issue and the managers pulled me to the office to ask more about this and said that the staff in general is \"concerned\" about my approach as a nurse who is \"not taking this seriously\"\n\nTLDR; Is peds nursing super judgmental and am I going to be scrutinized for every detail or is it different in other units?\n\nEdit: sorry if this turned into a rant, I haven't been actually able to talk to any nurses about this experience so a lot of it might be a bit bottled up.",
    "title": "How is the pediatric nurse environment? Had a terrible experience in BMT and nervous (Long post)",
    "subreddit": "nursing",
    "timestamp": 1682956518,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Can't get hired I'm a 23 year old male. I am South Asian. Besides English, I can speak two other languages. I live in Chicago. I graduated college earlier this year with a bachelor's in education that's focused on gen-ed grades 1-6 along with a pre-k-12 special education endorsement. I would like to teach sped and have been told that finding  a job in that role will be easy for me. I definitely don't mind teaching gen-ed because I am looking to gain experience. The whole summer flew by and I've had 6 interviews. Out of those six, I have only made it to round 2 with one of them . I applied to more than 150 positions for sped and gen-ed combined since the beginning of May. Teachers go back to school in 2 weeks from now and I'm still not hired anywhere for any teaching role. I'm honestly just worried I will have to end up subbing the whole school year and try again the next year, unless I do long term subbing. Anyone else on the same boat or can shed some light? Btw, the school that I made it to the second round of interviews has a big population of students who are South Asian as well and can speak the same languages as mine,  rejected me for a SPED role.\n\nEdit: Thank you for all the advice, everyone. I am definitely taking long term subbing into consideration. I will apply for those openings. I've also thought about teaching in rough neighborhoods because I think I might have a better shot there and it'll help me build my resume and experience. I've thought of para positions but i don't know how beneficial it will be and now that I think about it, I think a long term sub can help me gain far more experience with lesson planning and classroom management.",
    "title": "Can't get hired",
    "subreddit": "Teachers",
    "timestamp": 1690905658,
    "score": 339,
    "keyword": "asian manager"
  },
  {
    "text": "I feel sad my students returned home. I was an ESL teacher in a Southeast Asian country for four weeks. My students were South Korean kids. They were visiting the country for their hagwon (cram school) studies. I handled four of them, and they were all bright and happy go-lucky children with their own strenghts, weaknesses, and quirks.\n\nThis was my first time handling a face-to-face setup. At first I was very nervous as I didn't have experience with middle schoolers and kids, but I managed and started having fun. My only problem is making the lessons kid-friendly- especially in grammar and TOEFL classes.\n\nYesterday was their last day in the hagwon. All of them gave me presents, which ranged from spicy ramen to a 1000 Won bill (which isn't a lot). They would be returning to Korea any day now.\n\nIt felt good having good kids to teach. Some of them were not good students, but they were all respectful to me. I couldn't even wrap my head around being called \"teacher\", because in my youth I usually cut classes and only graduated college because I enjoyed reading books and writing essays.\n\nHas anyone experienced the same thing? It feels so bad to be in this funk. I know that I'll move on. The kids, too, will probably forget about me. I just want to know if this is normal or not.",
    "title": "I feel sad my students returned home.",
    "subreddit": "Teachers",
    "timestamp": 1692439037,
    "score": 6,
    "keyword": "asian manager"
  },
  {
    "text": "Stress and Unequal Expectations given by Head teacher This is my second year teaching. I teach English in Asia, so sometimes it might not make sense in Western culture but it does in Asian culture.\n\nThe Head of English is very competent, patient and very willing to look care newbies, but I can't help but feel that she treats me a little different than colleagues of my age and experience (let's call them Alex and Bailey, not their real names, but it makes things easier)\n\nThe Head has the problem of changing her mind too often. Very often I ask for her guidance and instruction, she told me Method A. Three days later, when I show her the document, she would say I should have adopted Method B. It was only then I know, she changed her mind and told Alex and Bailey about Method B. She then told me to \"learn from Alex and Bailey, and see how they have done it\" The Head also told me not to give writing score more than 14/20 (score cap). But later on, she told Alex and Bailey that they can freely give a 14 and even a 15. So when she check my marking, she would ask me \"why didn't I give out a 14 or 15 to recognise students' talent, like Alex and Bailey?\" \n\nShe also asks me to organise activities and do extra things. Of course, in Asian culture, I can't say no. I did tell her that she needs to guide me through it because I don't know what to do. She did. But when I can't do what she wants (since she changed her mind), she would sound like \"why didn't you do a proper job?\" Last year, I had huge class management issues because there are 30+ students in a class and more than 10 of them have different degrees of special needs, Autism, ADHD, Anxiety, Antisocial Behaviour...you name it, I most likely have it, not to mention some boys are sexist and ageist, aka treating young female teachers more poorly, even other teachers feel this. So making them follow class instructions and submitting homework was hell. Half of them would be heavily plagiarising from the Internet or even losing the paper and wouldn't do it. Alex and Bailey had students like that but not as severe as my class, perhaps only 3 out of 30 in a class, and those 3 are very obedient (I teach them too. Alex and Bailey would tell me they are difficult to deal with, but they are a piece of cake). The Head chided me for it and told me that \"I have taught students like that and even worse than that! I never have any problems. Look at Alex and Bailey, they have no problems.\" The Head would often tell me to learn from Alex, in particular. Alex is quick and more chatty, but more careless than I am.\n\nYet, if Alex and Bailey overlook a grammar mistake and didn't mark it, they are only given a warm reminder, but when I did it, the Head would call me out. When they can't handle things and ask for help, the Head would help them, but when I ask for help, she would just cheer/toughen me up and reinforce the idea that \"We don't have a choice, so you have to do it, no matter how hard it is.\" Last year I told her it was traumatising to teach 3 classes of Year 8 English Lit when the only other English Lit teacher died in December, and I had to take up everything and lead the supply teacher while not knowing anything. I didn't know what to teach or what to assess. The entire year was the blind leading the blind. So I expressed that I wanted a break from the subject next year, she simply told me that she couldn't ask Alex or Bailey to teach Literature, and kept reinforcing that literature is fun and teaching it is even more fun because it's less work (which is untrue, I had to mark 90+ essays in 2 weeks! And I still have other English essays to mark). It is fun when students are eager to learn and read, but it's hell when none of them were interested! So then I learned, even when I told her I can't do it, she will still make me do it.\n\nSide-note: I am teaching 1 class of Year 8 English Lit this year. The other new English Lit teacher left without notice in November, which again leaves me alone to guide the new supply teacher. Still, the Head was like \"oh it's nothing, you got through it last year.\"\n\nWhenever I think about all these, I just feel so defeated and useless. It's almost like everything I do, I can't do it right. Even other English teachers (Alex and Bailey as well) feel that she is a little harsher on me, but there is no denying that she spends a lot of time guiding me through everything. I know she means well and every single feedback helps me grow as a teacher. I am not jealous at Alex and Bailey. We are good friends. They are them, I am me. I don't ask for spotlight on my strength, but I don't want a constant magnifying glass on my weakness.\n\nIt's a long long rant, but I feel that I need to vent to let off the steam. I know I am really stressed out because I don't cry easily, not even as a child, but now I could just get myself to cry every time I talk about it.",
    "title": "Stress and Unequal Expectations given by Head teacher",
    "subreddit": "Teachers",
    "timestamp": 1672946531,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Is early start times a petty reason to leave an otherwise fantastic school? I'm a first-year teacher and ever since the first day of the Spring semester, every time I wake up I've had thoughts of moving schools, literally every morning.\n\nThis is a school I picked mostly because they were the only school I applied to that accepted me, and I am grateful for the opportunity. I've come to really enjoy being at this school, and it has a lot of positives you couldn't get in many other schools.\n\nThe best parts about the school is:\n\n1. Great admin team who actually sides with teachers before students. The principal himself helped me out of some sticky situations with some students, even listening to my request to split 2 boys away from the same period and into different periods.\n2. Great coworkers who are all pleasant to work with\n3. Fantastic diversity. There is a very healthy mix of white, black, hispanic, and asian students. About a 50/10/20/20 split. No other school in the state has ratios like this school.\n4. Insanely early release. Students leave at 1:45 and teachers are allowed to go home at 2:15.\n\nHowever, I just can't deal with the early start times. Classes start at 7:00 but teachers are obligated to arrive at 6:35. Add in commute time and I have to wake up a little before 6 just to get everything ready and arrive at 6:35.\n\nI've never been a morning person and I don't think I ever will be. I've tried going to sleep at 9 and my body just doesn't go to sleep. Even if I somehow manage, I still wake up tired. I really do love every other aspect about the school but I can't lie to myself; waking up at 6 every morning is mentally killing me.\n\nDo you think leaving schools only because of the start time is a good enough reason? Should I try to tough it out? If this was your predicament, what would you do?",
    "title": "Is early start times a petty reason to leave an otherwise fantastic school?",
    "subreddit": "Teachers",
    "timestamp": 1682865730,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Wrangling Chatty Cathys Hey guys, I really need some help.\n\nI've been on this sub for a while, just trying to engage with teachers, and also learn some.\n\nI've been in education for a while, but 6 years as a para, and now I'm a sub teacher.\n\nI've finished my MAT and credentialing program, but haven't cleared the TPA's.\n\nI'm struggling with classroom management.\n\nI'm good at directing a group of up to 10.  Not that difficult.  However, I'm consistently loosing people at the 20+ mark.\n\nLike, literally within a minute or two of one call to listen, the kids are back to ignoring me or the video or etc.  It's not totally consistent.  Even at the same school, I'll have some classes where I'm able to go the whole lesson without issue, but then other classes I can't seem to maintain attention at all.\n\nWhen I've asked advisors and experienced teachers for advice, I get conflicting responses.\n\n\"You're too nice.  You jump to help too quickly, and you don't nip problems in the butt at the start.  Kids start talking to each other because you aren't pulling them back enough.\"  Even at the same discussion, another teacher will say, \"You're too demanding and condescending.  Don't be petty and ask for quiet so much.\"\n\nCan someone help me reconcile these?\n\nPart of my issue is my background.  I'm white and American, but I didn't grow up here.  I grew up in a South East Asian context.  Many of the axioms/attitudes of American education are very foreign to me, despite my time as a para.  One of these is the idea that students can talk to each other during direct instruction/a video.  That wasn't allowed... at all at my school.  You'd get sent to principal for 3 vocal/noisy disruptions.  Using the restroom/sharpening your pencil/whispering to your table partner during lecture were all infractions that were penalized.  That was my life k-5th grade.  I was homeschooled/in american schools for middle school, and high school rest of the time was very similar to elementary.\n\nI was in college and still asked the professor at the break in the middle of class if I could use the restroom.  I didn't realize I didn't have to ask.\n\nMy teachers never had to \"buy\" or \"earn\" my respect or attention.  The entire community enforced that teachers were to be held on high.\n\nI'm not saying this is the right way, I actually think there are significant flaws.\n\nBut I've got alot of my own hangups.  I struggle especially with early primary and middle school students.  3-6th seem to be fine.  But I struggle consistently with 1, 2, 7, and 8.  I cannot seem to hold their attention.  I feel like every 2-3 minutes I'm calling loudly for them to be quiet.  I don't even ask that they be silent, as in no talking.  I ask that they be quiet.  Like, whispering or just a bit louder.  Not so loud that I can hear them across the room.\n\nLong post, I know.\n\nBut I'm struggling.  How can I hold their attention long enough to present the lessons?  I don't even know what parts of the lessons are engaging to them because.... it doesn't seem any of it is.  I'm not learning what parts of the lessons went well/poorly.",
    "title": "Wrangling Chatty Cathys",
    "subreddit": "Teachers",
    "timestamp": 1673584727,
    "score": 0,
    "keyword": "asian manager"
  },
  {
    "text": "What do I do I just wrote out a whole post asking for help but when I went to post it got deleted. \n\nI will sum it down, I felt as I was discriminated against at work for the past few months and went to my manager regarding it countless times.\n\nNothing was just about it until the other night another incident took place which is when I had enough.\n\nI can post my statement below of what I sent to the DM of my company yet I feel as I will not receive justice through them and need your guys help to see what do I need to do.\n\nI will sensor my name, the key holders name, the managers name and the workplace name so I do not get in trouble, not that I was told I can’t say anything about it.\n\nI will say I am “M”\n\nThe key holder is “D”\n\nThe Manager is “G”\n\nThe workplace is “F”\n\n“Hello,\n\nMy name is M and I'm currently employed at F. I'm reaching out to share my experiences regarding an ongoing issue that has significantly escalated. This matter came to a head on December 13th, when my manager, G, unexpectedly required me to engage in a direct conversation with my colleague, D, who holds a key-holder position at our store.\n\nOver the past few months, I've faced various forms of differential treatment from D. For instance, she has expressed discomfort in my presence to our manager and has explicitly told me not to visit the store during my off hours. Additionally, D has restricted my involvement in certain tasks, such as assisting with the end-of-day financial checks, opting instead for a female colleague. This selective behavior extends to mundane tasks as well; I'm often singled out to handle all the cleaning duties and frequently receive undue criticism about my work.\n\nDespite repeatedly voicing these concerns to G, seeking a resolution, and requesting not to be scheduled alongside D, my pleas have been largely disregarded. Moreover, a recent incident, where D publicly reprimanded me over a minor misunderstanding regarding a break time, further exemplified the unprofessional and hostile environment I've been subjected to. Instead of addressing the issue discreetly, D chose to do so openly, exacerbating my discomfort.\n\nRealizing the severity of the situation, I reached out to G, conveying my distress and reiterating my request not to work with D. Contrary to my expectations, G organized a face-to-face meeting with D, which only intensified the issue. During this confrontation, my feelings and experiences were dismissed by D, who seemed to invalidate my perspective. The situation escalated to the point where I felt overwhelmed and requested to leave, a plea that was initially denied.\n\nThe culmination of these events, including being physically restrained from leaving the emotionally charged meeting, left me feeling devalued, unheard, and confined. This treatment, I believe, is not only unprofessional but also discriminatory, considering the differential treatment I've received as one of the few South Asian male employees working closely with D\n\nIn light of these events, I've had a discussion with the District Manager to address this ongoing issue, seek a resolution, and hopefully bring about a change that ensures a fair, respectful, and inclusive work environment for everyone at “F”.\n\nThank you for taking the time to read my statement. I look forward to a response and an opportunity to discuss this matter further.”\n\n\nThat’s the statement I provided the district manager, I am still working there but do not know what to do",
    "title": "What do I do",
    "subreddit": "WorkReform",
    "timestamp": 1702710433,
    "score": 0,
    "keyword": "asian manager"
  },
  {
    "text": "How to NOT feel inferior working with international colleagues at a global company? I recently started a job at a global company. I'm the only asian (F) in the team everyone else is from the US & UK. \n\nAs a Filipino, I was born and raised here in the PH. Generally speaking, I prefer writing in English but I can usually explain myself verbally in a decent manner. However, I found that whenever I would speak up during our team calls to share about my updates - I would stutter and lose my words. This would lead to me feeling stupid and embarrassed after the call. \n\nI've had the chance to mock present to our team recently and it was a mess. I was out of breath and stuttering and was just all over the place. The thing is, I've always told my manager that this is something I really want to experience more but I feel like I just messed up big time and should not have been given the chance at all.\n\nI 100% know what I'm presenting and have even tried practicing my explanations beforehand but whenever I join Zoom call, I would trip up and feel nervous and forget everything.\n\nAnyone here experienced something similar?",
    "title": "How to NOT feel inferior working with international colleagues at a global company?",
    "subreddit": "careerguidance",
    "timestamp": 1686670254,
    "score": 16,
    "keyword": "asian manager"
  },
  {
    "text": "Suffering from Workspace Bully and Wierd Probation Period, and Suggestions? Hi folks,\n\nI'm writing here to seek some advice and support for my wife, who has been facing a very difficult time at work. She works for a prestigious jewelry company in the US (i can't mention the name for now, unless she is fired or leave the company in the future) and is currently experiencing power harassment (workplace bullying) and unprofessional behavior from her manager and HR\n\nMy wife joined the company after her graduation and worked there for 6 months last year. However, due to some issues with her working visa application, she had to quit for a few months. After her O-1 visa was approved, she returned to her job in January this year\n\nUpon her return, her manager surprisingly stated that she had to undergo another 3-month probationary period, despite having worked there previously. During a meeting with HR, they treated her very poorly, saying things like \"you are replaceable by anyone who walks through the door,\" and \"you can either take the job or leave the country.\" These comments have been extremely distressing for my wife, and she's even cried a few times as a result\n\nMoreover, when she meets with her manager, they always show impatience and blame her for every mistake that occurs, even when the fault lies with someone else or it happened during the mentorship. Her manager issued her a serious warning for two incidents: one where she accidentally hurt herself while using a hammer under her mentor's supervision, causing no damage, and another where she used the wrong safety glasses during work. We both think these warnings are unacceptable and inappropriate (it's unfair!)\n\nFor now my wife has reported twice internally, in the company. She is expected to receive a phone call from company HQ this afternoon, and hopefully get some good news about the reporting(s). She is also considering calling mental health support, since she is really upset and depressed, especially right after work\n\nAdditionally, since we're Asian, I also doubt if there's minority discrimination in this. Is there any support I can get regarding this?\n\nI'm reaching out to you all for suggestions on how to handle this situation. What steps should we take to address the bullying and unprofessionalism my wife is experiencing? Any advice would be greatly appreciated. Thank you!",
    "title": "Suffering from Workspace Bully and Wierd Probation Period, and Suggestions?",
    "subreddit": "careerguidance",
    "timestamp": 1679587573,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Do you think there are some people just not cut out for SWE, or that they just haven't \"gotten it\" yet? I have had two full time jobs since graduating college, both SWE at respected companies (although not FAANG). My first job, my manager constantly complained that I was too slow and ended up not promoting me when everyone else my year was promoted. My second job, I was recently placed on a PIP. After two shitshows in a row, I can definitively conclude that I am the problem.\n\nMy parents (in typical Asian immigrant style) claim that it's because I haven't applied myself and haven't worked hard enough. The thing is though, I think I *do* work hard. At least as hard as for a job I openly admit I purely went into for the money. But no matter how hard I try, I feel like I am always the \"weak link\", always too slow and making too many mistakes. I wouldn't say I enjoy coding/solving these kinds of problems all that much, but I know plenty of people who are doing it just for the money and are still good at their jobs.\n\nEDIT: Thank you all for the responses. Strangely, it's almost a relief to hear that some people just don't have the talent for it (and that I am one of them). I have always been great at talking to people/selling shit, so I think I will try to pivot to something like that in tech.\n\nUPDATE: For anyone curious, I have switched careers and am now a Technical Support Engineer! I did take a non-trivial pay cut, but the job is a better fit for me overall and I am much happier and more productive :)\n\nAlso a caveat that I have saved up some amount of $ through my previous life as a SWE, so ironically that is part of what’s allowed me to make this switch. \n\nI realize this definitely isn’t a “normal” path and may be undesired for some, but wanted to share my personal journey as some were curious!",
    "title": "Do you think there are some people just not cut out for SWE, or that they just haven't \"gotten it\" yet?",
    "subreddit": "cscareerquestions",
    "timestamp": 1699106344,
    "score": 411,
    "keyword": "asian manager"
  },
  {
    "text": "Confused and Depressed . Need Advice May 2023 grad international in the US (worked for 3 years back home) , I joined this startup in june and its been a fking sweatshop since then . Its a dumpster fire 24x7 its panic , ceo and cto are related which makes things worse as there is no transparency and they treat employees like slaves who are available 24x7. In my 4 months here I have not even written a single line of code , all they make me do is random bs stuff like reporting etc . here its like okay we have this thing all are busy..oh you are free you do this(irrespective of whatever your background is like once i was told to make privacy laws lol)\n\nAlso its like people work 9 to 6 and then 8 to 10. the ceo acts like a commander , its all a command style management plus there are no ethics no professionalism at all. Like for example the cto had covid still she would come in to the office and the ceo wouldn’t give a shit (c’mon protecting your employees from health hazards like this is a common sense , i had got covid coz of that ) . Like another instance is keeping calls on a sunday that too 9pm - 3am (wtf) .\n\nIts a 4 day rto , which makes it more worse \n\nComing to the pay its god awful , like roughly 20-25$ per hour and no overtime pay. All are south asians(not being racist here , i am south asian myself) and roughly theres just 8 people and seems like i am the only swe here other all have titles but they don’t do what their titles mean. Also there are no policies here , one of the colleagues told me that in the past dude fired 3 interns . just told them “you go and don’t come from tomorrow” .\n\nMy mental health has gone south , all time stress can’t even prep nor apply outside . So i need your advice here :\n\nOption 1 : Leave this bs startup , join a volunteering firm to stop unemployment clock , prep tf out and get a new job. Money wouldn’t come in but I can manage that for atleast 6-7 months. I see roles opening too so theres some ray of hope\n\nOption 2 : Continue in this startup keep making bank with whatever little money i get , don;t give a shit and keep preping applying (this would be priority). Here consequences would be that I would get fired\n\nI am in dire need of help and guidance , would be ever grateful for it . Also i appreciate your patience and kindness if you read till here.",
    "title": "Confused and Depressed . Need Advice",
    "subreddit": "cscareerquestions",
    "timestamp": 1694559585,
    "score": 4,
    "keyword": "asian manager"
  },
  {
    "text": "Mentor doesn’t have ANY conversations with me at internship. TLDR:\nHow do I deal with unhelpful mentor?\n\nI am doing a hybrid CS dev internship at a large local non-tech company in FL. Predominantly mid-aged to old white/Hispanic with a fair number of immigrated South Asians/Indians.\n\nSince the very first day, my mentor did not try to have any conversations with me, no 1:1 introduction apart from the Teams meeting my manager set up. She didn’t even try to set up any in-person chat/lunch but in 2nd week we both happened to be working in-person the same day and thus officially met. \nHer uninterested demeanor really put me off by then so that day I only greeted her, asked her 1 or 2 work related questions, said bye and left at the end of the day. I am South Asian international student so I don’t know if she has any stigma against me. Over the next few days, I showed fake interest and learn a bit more about how she got the job and such but that’s it.\n\nIn our daily sync with my 2 other remote contractor mentors, she joins the meeting and just sits there without doing any explanations while the others walk me through - happening for 2 months now!\n\nMy manager and even his boss are super chill and rather impressed with my work ethics and quick working mindset and I want to work on this team cause of them but since she sits right beside me, I don’t want to see her.\n\nMy concern is how she’s gonna evaluate my performance, other 2 mentors seem somewhat satisfied with me.\nHow do I deal with her and do I raise this issue to my manager?",
    "title": "Mentor doesn’t have ANY conversations with me at internship.",
    "subreddit": "cscareerquestions",
    "timestamp": 1690123189,
    "score": 0,
    "keyword": "asian manager"
  },
  {
    "text": "How can I push through to the next level of my career I am a CPA (CAN) and am an asian immigrant. It feels like it doesn’t matter how much I try to prove myself or push harder, there’ll always be other people that will be ahead of me. My manager is super nice but the partner always choose someone else over me. There’s only three of us in our team that could probably move up to managerial position. I volunteer to do a lot presentations or projects/files and am always engaged and active in our discussions. But it’s really hard to get a breakthrough! Sorry, I’m so mopey!\n\nEDIT: I work in a big national firm.",
    "title": "How can I push through to the next level of my career",
    "subreddit": "Accounting",
    "timestamp": 1697139440,
    "score": 2,
    "keyword": "asian manager"
  },
  {
    "text": "Some advice on this job offer? I am a senior accountant working at a small boutique CPA firm for one and a half years. The owner likes me  and wants me to buy in as a partner in the future (at some point as i am in my late 20s). I got my CPA last year under him.\n\nI am not that ambitious and value WLB, which my job surprisingly offers. ( \"Actual\" work hours are 30-40hrs) Current job is full remote!! @$80k but limited growth due to the size of the firm. The only way for growth would be the abovementioned buy-in as a partner in the future, and hoping the firm continues getting more clients. \n\nRecently got an offer with an RE industry company in NYC paying 100k. The company is an Asian based company operating in NYC (not well known domestically), and i definitely got the offer due to being trilingual. The only sale here would be the higher pay and exposure to the RE industry, which I think is good in NYC. Although the only growth possible there would be replacing the direct senior manager who's mentioning retirement during the interview. \n\nMy current job does offer full wfh. The RE job is on site in NYC (NYC Subway can be horrible sometimes), but wlb should be nice as well given its industry job.\n\nWwyd if you were me?",
    "title": "Some advice on this job offer?",
    "subreddit": "Accounting",
    "timestamp": 1684298465,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "CPA USA for Aus CPA/CA Would getting a US CPA provide any benefit in local Australian market. How does it fare overseas? \n\nHas anyone completed their US CPA after Aus CA/CPA, how was the process and rank it based on how hard it is.\n\nI’m an Aus CPA with over 8 yrs experience ,working as Finance Manager in the industry. Exploring options to move overseas, Gulf or Asian countries. \n\nLooking for first hand information from someone who has gone/planning to take this path. \n\nTIA",
    "title": "CPA USA for Aus CPA/CA",
    "subreddit": "Accounting",
    "timestamp": 1694096431,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Fucking tired of being a DSBW — Can I just vent for a second? I 100% sympathize with those of you tired of reading ‘woe is me black woman’ content — if this is you please don’t read this one ❤️ \n\nBut my GOD. I live in a very white and very Asian region. I am treated like absolute shit day to day. I really can’t even say anything about the racism I experience because right now Asian people have the ear of white people as long as they’re hating on black people and white people here? Well they don’t want me here at all in the first place. So I just get double the whoop ass everyday, at work, at the grocery store, at the gym, everywhere. \n\nI’ve had one too many experiences that leave me with the feeling that people are just plain UNCOMFORTABLE with my presence. And it’s not just white people. I’ve had south Asian immigrants (not assuming, in this case there was verification as they did not yet speak English) literally look terrified that I was going to hurt or steal from them because I was walking behind them (they were in my way). \n\nThen being completely ignored or dismissed by staff at restaurants, stores, the hospital, you name it. While they address the white or Asian person in front of or behind me.\n\nAnd today, I just fucking lost it. I was at the store standing in line with a full buggy and an Asian man looked me in the eyes while he sprinted just to stand in front of me with two items. I stared, because it was just ridiculous. He says “oh I didn’t mean to cut you” and just turns around. I respond “oh it’s alright” and he literally just doesn’t acknowledge me further. Had I been angry, this would’ve beeen another instance of “discrimination”. \n\nThen a black attendant sees what happens and offers to take me in his line (express line) and I say okay. I take my big ass buggy (with a scared looking Asian couple in front of me) and then the white manager comes roaring in screaming “no you can’t be here it’s the express lane!!” \n\nThe whole store turns around and stares at me as she keeps yelling and I’m struggling with my buggy, including the guy who cut me, as if I’m causing a commotion. The same terrified looks I’ve become used to, even though I’m small and scared myself when I’m alone. It’s like a spotlight is on me at all times and I have no advocate.\n\nI lose my place in line and the stares continue as I move back. It may seem small but this is just one story in a million where I’m treating like Quasimodo in a big blue state for being unambiguously black. \n\nI’m sick of it. I’m tired. I’m tired of being told I have to be strong. Who do I owe strength to? \n\nEnd rant. I am over today.",
    "title": "Fucking tired of being a DSBW — Can I just vent for a second?",
    "subreddit": "blackladies",
    "timestamp": 1676251535,
    "score": 71,
    "keyword": "asian manager"
  },
  {
    "text": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies? Hi all, apologies for the long post below that is likely full of some grammatical errors! :)\n\nI have been with my partner for 5 years. He works for a very intense advertising company and is the only Black individual on his team. His managers are White/Asian and have started using terms such as, “disrespectful,” “angry”, “isolative.” I want to be clear, my partner is loved by his team/ “mini” managers (those who he supervises). He has received very good reviews and is extremely engaging/polite. He’s truly lovely. His colleague in the exact same position is vocal and will often raise his voice during calls, to which my partners bosses simply reply with, “that’s fine. We hear you.” \n\nToday, my partner worked from 7am-7pm and a 30 minute call was put on his calendar at 6pm. There has been some financial issues going on with their company, so everyone is feeling the pressure. My partner wrote in the teams chat, “I’m a bit blinded sided by this meeting. What is it in regards to?”  to which his manager said, “that is a disrespectful response. WE have been working harder than you the entire weekend.” My partner responded with: “Okay, let’s just do this then” to which they wrote “you’re so angry and disrespectful.”\n\nThis resulted in a very heated, 30 minute Teams call in which his superiors called him paranoid, disrespectful, and angry. He highlighted that his White colleague has said much worse and even hung up on calls, to which they responded, “we have no memory of this.” My partner refused to say that being labeled as such is damaging to but he did say he felt unsafe (they ignored it).\n\nI wanted to jump in this call SO fast but held my tongue. My partner was extremely defeated and I was livid the entire time. As Black women, how do you all navigate your partner experiencing bias, racism, labeling, etc? I am exhausted and this was just ONE 30 minute call.  He has been at this company for 4 months and wants to stay at LEAST 1-2 years to make Director. Part of me wants him to find a new job ASAP but I also know that isn’t feasible.\n\nI just feel defeated and watching him experience this hurts me deeply. Any tips?\n\n****EDIT:*** The only thing we can think of that has contributed to their perception of him changing is that he took a Monday off (approved leave) to move apartments. He didn’t log on at all to check accounts/budgeting and one of his Supervisee’s had made a mistake with an account. This was caught the next day but resulted in everyone having to work this error out. This was about two months ago.\n\nUpdate: Thanks so much everyone for your feedback! He has started documenting everything, as you all have noted. Not sure how this will turn out but it is definitely concerning. He’s also started updating his resume and making sure everything is followed up with an email documenting what was/has been talked about in meetings. He noted that he is fearful to use “the race card” because there is no coming back from that, which I understand but still I am still encouraging him to address how damaging language can be as the ONLY Black male on his team. It’s not the race card, it’s the reality and race is ALWAYS present (whether conscious or unconscious). \n\nFor right now, he is keeping his cool and maintaining professionalism.",
    "title": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies?",
    "subreddit": "blackladies",
    "timestamp": 1688601081,
    "score": 38,
    "keyword": "asian manager"
  },
  {
    "text": "Advice for Taking care of my hair from scratch Hi guys,\n\nI hope you are doing well. I'm going to start my natural hair care journey and instead of me posting pictures of my hair I'm going to ask you guys some general questions and see if anyone can guide me to some youtubers, tiktokers, instagrammers, etc or just give me some advice.\n\nI've been wearing a turban and want to start showing my hair. Right now I'm just in a cycle where I keep cutting off my hair cause I get frustrated and wear my turban. I'm also embarrassed cause my hairline is bad and I'm East African so we know I have a big forehead lol. \n\nI know that I want to buy Jamaican castor oil and hair grow serums to fix my hair line. I'm thinking of also just cutting my hair off completely and making it all small and even. ' I've been using kitchen scissors to just cut my hair off and keep it manageable so I can put it under my turban. I don't know if I should just cut it this time properly with my kitchen scissors or buy a buzzer hair cutter so I can cut it properly. \n\nI just don't know what to do when my hair grows out. Long term I do want to get it braided. But as of right now I don't know day to day what to do with it. Right now I'm just washing my hair with shampoo and then using conditioner. I do this once every other day. \n\nOverall my questions are:\n\n\\- Should I buy a razor so I can completely cut my hair short and make it even, or would I be able to achieve the same effect by still using my kitchen scissors?  \n\n\\-  How are you guys taking care of your hair day to day?  Like I know I don't have the type of hair type where I can just quickly comb it and go. Do you guys have any youtubers or anyone you are getting advice from?  I would say my hair type is 4a-4b?\n\n\\-  Has anyone had any success in fixing their hair lines? I remember there was a hair serum that went viral on twitter back in the day I think it was from an Asian ( Japanese?) brand. I'm sure I have it saved somewhere in my photo album but I'm curious if anyone has any serums that have worked for them?\n\nThank you :)",
    "title": "Advice for Taking care of my hair from scratch",
    "subreddit": "blackladies",
    "timestamp": 1678745896,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "I'm Japanese and starting a new hotel job. There are Japanese businessmen staying for the whole month! I recently got accepted at a front desk position at a nearby hotel. When I walked in for orientation I saw asian men in suits working on computers in the lobby. It really sparked my interest. When I asked the manager about them, he explained that there are Japanese people on business trips staying at the hotel. I was thrilled! I often feel lonely in Pennsylvania because I'm one of the very few Japanese Americans who live here. \n\nAfter the orientation I walked back to the lobby and saw two guys left. I could clearly hear one of them on the phone speaking our language, and when he hung out, I calmly approached them and began speaking to them in Japanese. They were completely caught off guard! Now I'm not fluent in Japanese, but they really appreciated my efforts. I told them how I'm a new employee who will be working here and we talked about our culture for a bit. I cannot wait to start training tommorrow!",
    "title": "I'm Japanese and starting a new hotel job. There are Japanese businessmen staying for the whole month!",
    "subreddit": "asianamerican",
    "timestamp": 1702104458,
    "score": 278,
    "keyword": "asian manager"
  },
  {
    "text": "“No, where are you REALLY from?” Such a common question I get asked at work. I just started this job and I’ve had someone ask me this at least once every week. It was a lot more prevalent when I was in grade school, though. I just don’t understand why non-Asian people (particularly white people) can’t just accept “I’m from here” as an answer. I’m not even lying either, I’ve lived in this godforsaken country for two damn decades! I thought about an alternate reality where Asian customers ask white workers where they’re from and probe if they’re Russian, German, etc. A lot of this is also paired with racial compliments and remarks towards how “ethnic” I look. The same customer who asked me where I was from was like, “I would’ve never guessed you were Chinese! You just look like something/got something going on!” and called me “hun” and “gorgeous” within the span of 15 minutes. 🙄 Apparently my work today got a call from some random asking for the name of the “pretty Asian girl who works here” (I have a few other Asian co-workers). The morning shift manager slammed the phone on his ass according to my closing manager. I’ve been the target of a multitude of racial “compliments” since I was in my mid-teens and thought it would stop since it seems like these types of men don’t want older women their age. There is also a customer who regularly comes here and sends money to people in the Philippines and he recently asked for the phone number of my newly 18yo co-worker. 🤩 God, if you exist, give me patience or send the flood. Lol",
    "title": "“No, where are you REALLY from?”",
    "subreddit": "asianamerican",
    "timestamp": 1698024376,
    "score": 135,
    "keyword": "asian manager"
  },
  {
    "text": "Don't forget to give back to your community We all have people who helped us along our way.  \n\nIf you are in a position where you can help those in the Asian community, then I think we should do it.\n\nFor instance, if are a manager in a company and in a position to hire someone who has fallen on hard times, then do it - provided that they are qualified for the job.  Ditto if you have a small business.\n\nAnd if you have a small business, you can help out by using Asian suppliers, and hiring those from the community.\n\nDon't forget to donate to charities in your community as well.",
    "title": "Don't forget to give back to your community",
    "subreddit": "asianamerican",
    "timestamp": 1678533490,
    "score": 121,
    "keyword": "asian manager"
  },
  {
    "text": "Upset at work but not sure how to define it. I'm asian female  and recently at work I got promoted. One of the manager (Black female) told me that she heard this other manager (White male) complained at work about how our work is keep promoting Minority like asian and latino and its not fair. They both work under me and i'm assuming that White male manager thought he was going to get this spot that i got promoted into. \n\nIt has been bothering me for few weeks and i am trying to figure out how to define it. \n\nSo promotion is already over, i got it and he didn't. i know he is pissed b/c he wanted this position and thought he was going to get it. However i don't think it is right that he can say that kind of stuff at work infront of everyone and no one thought it was an issue. Am i over reacting ? I think it is wrong for him to say that which denies all my extra work and effort i put in to get promoted. But its not like i got any harm by him saying it so. I'm not sure how to explain this situation. like how do i explain this is wrong of him or is it even wrong of him? b/c he didn't harm anything. \n\n&#x200B;\n\nAlso why am i upset by this for so long ? i'm the one with promotion. is it ok for me to be upset over this or am i over reacting?",
    "title": "Upset at work but not sure how to define it.",
    "subreddit": "asianamerican",
    "timestamp": 1688402223,
    "score": 107,
    "keyword": "asian manager"
  },
  {
    "text": "Freeman hits 59th double, Asian American managers make history in Dodgers’ win over Giants",
    "title": "Freeman hits 59th double, Asian American managers make history in Dodgers’ win over Giants",
    "subreddit": "asianamerican",
    "timestamp": 1696333175,
    "score": 9,
    "keyword": "asian manager"
  },
  {
    "text": "Many studies show black men face more discrimination than black women. Here is the evidence: Intersectional feminists often argue that black women have it the worst, and they suffer worse than black men because they're black and a woman. Well guess what? There's lots of evidence that shows black men face more discrimination than black women.\n\nThis [article](https://theconversation.com/black-men-face-high-discrimination-and-depression-even-as-their-education-and-incomes-rise-141027) by *The Conversation* elaborates on what black men deal with. According to study 1, black boys from the wealthiest families were the most depressed. Study 2 found that for black men, the highest education credentials were associated with an increase, not decrease, in depressive symptoms. Study 3 found that in a nationally representative sample of American adults, black men with the highest income had the highest risk of depression, specifically major depressive disorder. Interpersonal or one-on-one discrimination was not found to be a factor. Study 4 found that 700 black teenagers were followed for two decades in Flint, Michigan. Perceived racial discrimination was measured in 1999 and 2002. Discrimination as teens was a predictor of depressive symptoms in people transitioned to young adulthood a decade later. Nonetheless, this was only true for black men, but not black women. In that same study in Flint, an increase in perceived neighborhood fear, defined as being scared of the crime and violence in the neighborhood, was linked with an increase in depressive symptoms for black men, but not black women. Study 6 found on IAT tests that white men had higher racist attitudes towards black people than white women, but the difference wasn't particularly extreme, but statistically significant. Nonetheless, white women also can be really racist towards black people, too.\n\nBlack men also get arrested, incarcerated and stopped or profiled far more than black women. Even white men experience being arrested and incarcerated far more than black women. And the reason why most prisoners are men isn't simply because men commit crime more. [A significant minority of criminals are women](https://www.reddit.com/r/MensRights/comments/xyl5wb/statistics_cited_women_are_more_likely_to_commit/), but female criminals are severely underreported, get arrested less when reported, are less likely to be incarcerated when convicted, are paroled earlier, and given more lenient sentences compared to men. Additionally, black men are far more likely than anyone else to be killed by police. [In fact](https://www.bloomberg.com/news/articles/2019-08-06/race-and-police-shootings-what-new-research-says), white and Asian men were much more likely than even black or Native American women to be killed by police. Almost all police homicide victims were men! [Black men were also much more likely than anyone, even black women, to be murdered in general](https://www.niussp.org/health-and-mortality/americas-high-homicide-rate/?print=print). [Black men are also more likely than black women to be victims of crime in general](https://bjs.ojp.gov/content/pub/pdf/bvvc.pdf). [Black men also were](https://www.pewresearch.org/short-reads/2019/05/02/for-black-americans-experiences-of-racial-discrimination-vary-by-education-level-gender/) more likely to be subject to racial slurs/jokes, be unfairly stopped by a police officer, have people act suspicious towards them, been assumed to be prejudiced, or to have feared for their personal safety. In fact, 59% of black men had been unfairly stopped by police, compared to just 31% of black women.\n\nAnother study called \"[Gender Matters Too](https://psycnet.apa.org/buy/2008-05171-002)\" found black men and women in 11th grade classrooms differed in their perception of peer and classroom discrimination. For boys, discrimination harmed their grades, attitudes and their regard for the importance of school. For girls, however, the effects generally had a positive impact. Another [study](https://psycnet.apa.org/doiLanding?doi=10.1037%2Fpspa0000288) found that the real root of racism towards blacks was perceived threat, not dislike, and that people were racist toward black people not due to negativity towards them but feeling threatened by them, especially black men. When isolating negativity from threat, they found no automatic black-negativity link. Negativity towards blacks was associated with viewing them as a threat. [In fact](https://polisci.osu.edu/sites/polisci.osu.edu/files/mcconnaughy_white.pdf), another study found that people viewed black men as particularly violent, and viewed white men as more violent than black women. They ascribed a low amount of violent personalities to black women and an especially low amount of it to white women. They viewed black men as more promiscuous than white men, white men as more promiscuous than black women, white women slightly more promiscuous than black women! They viewed black men as less intelligent than black women, and viewed black men as less ambitious than black women. Fast responders gave unpleasant responses to black men far more than to black women. All responders gave black men the most unpleasant responses compared to black women and white men and women, and black women slightly less unpleasant responses compared to both white men and white women! Another [study](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.848.1523&rep=rep1&type=pdf) found that even both male and female participants were equally likely as each other to be more willing to shoot a black unarmed suspect than a white female armed suspect or black female armed suspect. Men and women equally were likely (when not even looking at race) to prefer shooting unarmed male suspects over armed female suspects. An implicit racial bias [study](https://journals.sagepub.com/doi/epub/10.1177/0146167219829182) found that black women were seen as more dangerous than white women by participants of all races, but they still viewed black men as more dangerous than black women. Even when looking at black children, they viewed black boys as more dangerous than black girls.\n\n**Black men had it worse during slavery**\n\nThis thread I made a year ago talks about how there were more male than female black people enslaved in the United States, and the black women were more likely to be free. In 19th century United States, [more men than women were slaves and more women than men were freed slaves](https://www.statista.com/statistics/1010277/black-and-slave-population-us-by-gender/). Although there was always a difference, the difference increased in the Civil War because of all the black male soldiers who died, and women weren't sent off to war as soldiers.\n\nThis only looks at the ones in the US. Believe it or not, the vast majority of enslaved black people were sent to places like South America or the Caribbeans, and a minuscule percentage were in the US. [When looking at all the enslaved black people from the 17th to 19th century](https://www.statista.com/statistics/1183869/ratio-male-female-slaves-by-route-1636-1867/), they found that in any region, men outnumbered women, with the gap being quite large in most regions. Many historians think all slave owners were white men, but evidence found that 40% were white women. They were often cruel and violent just like male slave owners. In fact, George Washington's wife owned way more enslaved people than him. White women were trained to enslave black people from a very young age, and they even were often given slaves as early as 9 months old! [According to](https://www.history.com/news/white-women-slaveowners-they-were-her-property) History.com:\n\n>White women were active and violent participants in the slave market. They bought, sold, managed and sought the return of enslaved people, in whom they had a vested economic interest. Owning a large number of enslaved people made a woman a better marriage prospect. Once married, white women fought in courts to preserve their legal ownership over enslaved people (as opposed to their husband’s ownership), and often won. “For them, slavery was their freedom,” Jones-Rogers observes in her book.\n\n**Black men were raped, too.**\n\nWe often hear about female slaves being raped, and how it was legal to rape black women. [What we don't hear about is how often black men were raped by slave owners](https://muse.jhu.edu/article/448992/pdf). [They often were](https://shareok.org/handle/11244.46/1279). They also were stripped naked and white people laughed at their genitals (i.e.: body shaming of men for their penis size even though they have no control or choice of their penis size). According to the [AAIHS](https://www.aaihs.org/sexual-violence-against-enslaved-men/),\n\n>Foster begins *Rethinking Rufus* by examining how enslaved men’s bodies were depicted in Western art and sculptures that were widespread in the visual culture of slavery. Foster argues that enslaved men’s bodies were “symbols of enslaved manhood and sites of violation” that were objectified through a number of cultural forms including art and literature (12). The objectification of enslaved men depicted in paintings often resembled everyday acts of terror including the public inspection of Black men’s genitals, whippings and lashings, and bodily exposure due to lack of adequate clothing. Visual depictions of enslaved men that emphasized their genitalia and sexual prowess gave way to the prevailing myths of Black hypersexuality and the Black male rapist, an archetype that ensured the extralegal protection of white women from Black men who purportedly lacked control over their sexual urges. Foster also argues that while visual depictions of enslaved men’s bodies often highlighted their athleticism, strength, and muscularity, this same imagery eroticized enslaved men’s bodies in ways that fueled the physical abuses and sexual exploitation of enslaved men. Foster notes that these stereotypes found in eighteenth-century visual art contributed to the eventual punishment and national disenfranchisement of Black men.\n\n**White women also raped or sexually preyed on black men, too.**\n\n[White women also had sexually abused black men, too](http://www.inquiriesjournal.com/articles/1674/sexual-relations-between-elite-white-women-and-enslaved-men-in-the-antebellum-south-a-socio-historical-analysis). White women were authority figures or in a position of power over these black men, and white women had sex with black men, often even raping them forcibly. White women also threatened to falsely accuse black men of rape if black men didn't have sex with them. Because abortion was unregulated, and any woman was able to get an abortion back then, many white women used this advantage to sexually abuse black men without people knowing she fornicated out of wedlock, and was able to abortion \"illegitimate\" children, hiding the evidence that she sexually abused black men. As a result of this and the fact that men could not speak about being raped because people believe men cannot be raped, historical records of white women raping black men are often overlooked, and it could've been more common than we think, perhaps as common as white men raping enslaved black women.\n\n**Almost all lynching victims were men whereas a significant minority of victims were white.**\n\n[Another interesting fact](https://www.newspapers.com/clip/5803482/lynching-nj-1901/): virtually all lynching victims were men. Of all the 2,516 lynchings that happened from 1885 to 1901 in the US, 82.67% happened in the South and 13.75% happened in the North. 66.69% were black and 31.84% were white. 97.97% were men and 2.03% were women. Just 51 women lynched compared to 2,465 men. We always hear about how most victims were black, but no information about how virtually all were men. White men got lynched far more than black women. Black women rarely were lynched, and almost no white women got lynched.\n\n**Black people also face discrimination when it comes to rape.**\n\nIt is true that people are less responsive to black women who got raped than white female rape victims, but if people knew how common it was for men to be raped, and women rape men as just as much as men rape women (cited in a thread I cited above about women being more likely to commit crime than people think), then I'm sure they'd respond less to black male rape victims than white male or black female rape victims. In fact, they'd probably care for black women who are raped than white men who raped. Black men also are viewed as hypersexual, promiscuous, unable to control sexual urges, and always wanting sexual intercourse.\n\nAlso, false accusations happen a lot more than feminists admit, and I cite evidence for it in this [thread](https://www.reddit.com/r/MensRights/comments/xzb7d8/statistics_show_that_false_accusations_are_quite/) of mine, and black men especially are affected. Black prisoners incarcerated for rape are especially likely to be innocent, especially when their accuser is a white woman. White women historically falsely accused black men of rape to get them lynched, and they still falsely accuse them, and while most rapists get away with it, black men who are accused by white women are more likely to be incarcerated even if they're innocent. It was considered rape historically for black men to have consensual sexual intercourse with white women, and there was a double standard for a while where people judged black men marrying white women more harshly than white men marrying black women because black men were viewed as predatory.\n\n**Education/life expectancy**\n\nBlack women also have a higher life expectancy than white men and especially black men, and are less likely to go to college than white men but [go more than black men](https://www.brookings.edu/articles/black-women-are-earning-more-college-degrees-but-that-alone-wont-close-race-gaps/).\n\n**Feminists don't care about black people, not even black women.**\n\nFeminists often don't pay attention much to black women's struggles. Even first wave feminists disregarded them and didn't want them to vote, let alone allow black men to vote, and that motivated them and was a reason why they wanted to vote, because they worried black men were technically allowed to vote despite Jim Crow laws and didn't want them to have the complete ability to vote before white women.\n\nNonetheless, many stereotypes feminists make about men are especially applied to black men due to society historically portraying them as hypermasculine, hypersexual and prone to violence or crime. Feminists' portrayal of men harms black men especially. They also ignore false rape accusations despite that white women still, to this day, falsely accuse black men of rape which is why so many black prisoners are falsely incarcerated for rape, and yet feminists expect every reported person for rape to be imprisoned. They also widely ignore how black women are associated more with the term black than with women, and aren't viewed as normal women.\n\nThis is why womanism (black feminism) was started.\n\n**Conclusion**\n\nDoes anyone notice how people hate black men more than black women? Yeah black women face pregnancy discrimination with prenatal care and dealing with more abortions and unwanted pregnancies, but black men usually don't ever get to see their kids, and often cannot afford to pay child support. Many black children are raised by single moms and barely knew their dad, if at all.\n\nThe reason black men face more discrimination than black women is due to people's racism towards black people being associated with seeing them as a threat, not dislike, and being a woman prevents black women from being seen as a threat as much as black men. Nonetheless, people might see black women as more dangerous than white women and be racist towards them due to a guilt by association mindset. In spite of that, people still are more racist towards black men because when racial attitudes are mostly about feeling threatened, people tend to view women in general as harmless, which is different from how they view men in general.",
    "title": "Many studies show black men face more discrimination than black women. Here is the evidence:",
    "subreddit": "MensRights",
    "timestamp": 1699982481,
    "score": 195,
    "keyword": "asian manager"
  }
]