[
  {
    "text": "ELLA - independent short film about Asian Americans in the midwest! Hey, my name is Douglas Kim, I'm a writer/producer living in Los Angeles.\n\nI'm producing a short film of a coming of age story that takes place in small town America.  The film follows the unlikely bond between Abe, a high school recluse and Ella, a charismatic college dropout, as they navigate the streets and social groups of their community.\n\nThe film features a notable Asian TV actor (Nichole Bloom of NBC's \"Superstore\"), offers a new setting for an Asian American story, and follows Asian characters who are integrated in their community, going through universal struggles while dealing with their outsider status in subtle but real ways.\n\nThe film will use an experimental, one-of-a-kind, camera rig that allows for a digital IMAX image.\n\nWith the success of Moonlight and other independent films, it's my belief that film is the way Asian Americans become normalized in America, where we can be seen as Americans pursuing our own version of the American dream.  I think we can accomplish that and more with our film.\n\n\nhttps://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid\n\nWould love it if you can support and share our vision!\n\n\nmore from the director, Dan Chen:\n\nNichole Bloom and Dan Chen have been friends since they attended USC. After Nichole’s successful climb into American television, and Dan’s online awards for his short films (danchen.co), the two decided to collaborate once more on a character-driven project with the intention of festival recognition, online release, and a proof-of-concept for universal Asian American stories.\n\nDan, on the film’s story: “The underlying theme is one of “selling out,” as Abe distances himself from Ella to fit in with new kids he’s met. As an outsider, can he only fit in by submitting to the dominant views of his peers? Or is there a way he can stay loyal to his loved ones, without being left out of the larger community? The film’s story is character-driven and specific, but acts as a metaphor for the Asian American experience. Do we stay in our place, assimilate, or somehow find a third way of being?”\n\nThe camera rig was built by cinematographer Philips Shum, who has shot music videos featuring Diddy, Schoolboy Q, and Drake. It uses the principal of 35mm lens adapters, while increasing the size to accommodate a 56mm x 56mm frame, to create a low-budget solution for an IMAX field of view.\n\nElla is to be produced by Eric Cook and Douglas Kim with Evidence Films, Varient Entertainment, and Justice Tech Industries attached.",
    "title": "ELLA - independent short film about Asian Americans in the midwest!",
    "subreddit": "asianamerican",
    "timestamp": 1488496011,
    "score": 24,
    "keyword": "asian principal"
  }
]