[
  {
    "text": "Freshman in highschool, no luck on jobs. I’m 15, in highschool and I literally have no luck on getting a job. Where I live, it’s pretty common for people at 14 to get a job and it not being much of a problem. I tried so hard to get a job last year, and I had absolutely no luck at all. Yet when my sister was my age, she got a job so easily. Just too easily. It’s pretty hard to believe that I try so hard yet she just got a job without trying at all. I’ve tried so many stores, and they all turned me down (basically). My mom helps me with this, and is just too optimistic. We try some restaraunts that I just know I won’t get a job at.\nFor example :\nShe tried to get me a job at a Spanish restaurant. I told her beforehand that they would probably only have Spanish-speaking people to work there, yet she thought otherwise. And Ofcourse, I was right.\nShe also tried to get me a job at a Chinese restaurant. I told her that they wouldn’t higher an american, unless I was a girl and could be a hostess or could do deliveries (but I’m only 15 so that’s not an option), and it turns out I was right. The hostess told me that her and this other girl were the only two Americans working there. She said they rarely hired non-Asians.\nI tried many fast food places, like McDonald’s burgerking, etc. \nMcDonald’s didn’t go so well. The manager flat out ignored me. This is weird because my other friend who dosent try at anything and always gets into trouble at school got it so easily. Turns out the manager that ignored me hired him. \nBurgerking, didn’t work out either. \nTacobell, stores in the mall, Dunkin’ Donuts, pizza places, gas stations, literally everywhere. Even places that my mom were friends with turned me down. \nI know I’m not the only one, that’d be selfish otherwise. It is just very very depressing to be turned down so many times. I try different times throughout the year, the best times too. I don’t think age is the problem,  otherwise it’d also be hard for my sister to get a job because she was even younger than me. It’s just really depressing. I have all of these bad thoughts like \n“What if it’s because of my physical appearance?” “What if my future is this?” Pretty bad, I know.\nI put on the best face, act nice and try my hardest when trying to get a job, while my pessimism just grows stronger afterwards. Literally everything I say before opening the door ends up happening.",
    "title": "Freshman in highschool, no luck on jobs.",
    "subreddit": "jobs",
    "timestamp": 1558735474,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Take a promotion within my current company or start a new career by moving back to the States? OK, this is going to be a long post so get ready.\n\nI've been teaching in Asia for the last 5+ years.  Recently I was thinking of leaving teaching and returning back to the US, but my school offered me a pretty big raise and a promotion to department head.  I am currently in China and the environment is getting pretty hostile here with the trade war but I would me making pretty decent money for the area though not a ton of money.  Also as a manager I would get a 2 year contract so I'd have the stability and my school is technically owned by a Taiwanese company which has a main campus in Taipei.  After two years if my performance is good I'd have the possibility of transferring there (and I really like Taiwan) and I'll really be raking the cash in since the cost of living in Taiwan is pretty low.\n\nOn the one hand I don't like living in China on the other hand the money is good and I like living in Asia (currently have an Taiwanese girlfriend who's working in my city and have always been more attracted to Asian women).\n\nHowever I never really planned on a teaching career.  I originally came to Asia to spend a year after college but liked it and stayed.  But now I am also considering going back to the States.  I have several offers on the table in my field, or in related fields (mainly tech) but they are either entry level and don't pay great, OR they are kind of low- to mid- management jobs where I applied just on the off chance that I'd get hired and actually ended up getting the job but they're in very expensive areas and i'm actually not sure if I could actually DO the job since I've never actually held a job in engineering.\n\nSo I have a dilemma now,  should I take the job where I am guaranteed a decent salary for at least 2 more years and possible career progression, or should I bite the bullet and get back to the States?",
    "title": "Take a promotion within my current company or start a new career by moving back to the States?",
    "subreddit": "jobs",
    "timestamp": 1559314773,
    "score": 0,
    "keyword": "asian manager"
  },
  {
    "text": "How can I help make my company more diverse I am one of 2 HR managers in a tech company that employs 100 people in Taiwan.  Our company is growing but currently the majority of my company maybe 70% are cishet East Asian men.  I see this as problematic and I think that this needs to change.\n\nI have tried suggesting many different initiatives to bring on different people (non-East-Asians, women, members of the LGBTQIAP+ community).  For example I suggested that managers who recruit people from minority groups would receive a small bonus for each person they brought on.  Alternatively I suggested that a small \"bonus\" of about 10 points could be added to our KPIs for recruiting and promoting.  Both these ideas have been shot down by the other HR manager and the HR director.\n\nThey said they could look into hiring more women, and maybe people from other East Asian countries like China (yikes!) and Japan but they're not willing to go any further than that.  In contrast I would like to see the company become \"majority minority\" within 5 years.\n\nWhat can I do in order to create more diversity?",
    "title": "How can I help make my company more diverse",
    "subreddit": "jobs",
    "timestamp": 1565148174,
    "score": 0,
    "keyword": "asian manager"
  },
  {
    "text": "Racially fetishized and harassed at work, reprimanded by management Came here to vent as I recently quit this job. Perhaps some of you guys have had similar experiences in customer service and can relate. \n\nI worked as a barista at a popular cafe in an upscale part of town. Most of my regulars were fantastic and we developed nice casual relationships and some of them were complete dicks as is the norm of any service industry job. My least favorite customers were the entitled creeper type and the worst offender of this pleasant bunch was “Steve.” \n\nSteve was a self proclaimed golden customer and “frequent flier” as he liked to put it. He took out basic customer service niceties as invitations to get uncomfortably friendly and blur the line of professional exchange (liked to try to come behind the counter sometimes and help himself to pastries if the line was long etc). He asked weirdly personal questions, most of which were targeted at the female staff, and even made other female customers feel uncomfortable by invading their personal space on multiple occasions. He assumed his business was superior to other clients and expected above and beyond service and quality time with employees (even during the busiest times of day with lines out of the door) in exchange for very little money spent and no tip. He liked to request a personal smile from each female employee before he left. Every time he came in. \n\nSteve also had an Asian fetish. My first interaction with Steve began with me warmly greeting him to which he responded by asking me what my nationality was. My family is from the specific country that seems to be Steve’s preference. I tell Steve bluntly that I am  ____ to which he states “ well you don’t look very _____. I would know because I go there all the time. I even adopted my daughter from there.” \n\nOver his next few visits, he tells me more about his second life in said country. He tells me about the business he’s done, the industry he’s dominating, the women he’s fucked. He asks me if I spoke the language well and offered tutoring sessions and if I dated outside my race. He comments on my body and how I’m shaped differently than the standard over there. At the time I was 10 weeks pregnant and super bloated. Even so what an invasive and fucking disgusting thing to say. I told him pretty bluntly to fuck off. He walked away with the most flabbergasted and hurt expression on his face. \n\nI reported him to management that day. A couple days later my manager pulls me aside and tells me there’s been a complaint about me. After some questions I find out it’s Steve who said “I get that it’s Origamibee’s culture to be stoic and cold sometimes but I feel that she’s purposefully being mean to me. I just miss her smile.” Over the last few days of him coming in I had only given my tables to other coworkers so I wouldn’t be directly serving him and refused to make eye contact. That was it, that was all. I was then written up. \n\nI’m so glad I quit and I hope I never have to work in a service job again. Fuck people like Steve and fuck racial fetishization.",
    "title": "Racially fetishized and harassed at work, reprimanded by management",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1572933991,
    "score": 2832,
    "keyword": "asian manager"
  },
  {
    "text": "OB/GYN jokes + a first year med student = one hell of a pap smear So this happened about a month ago during an appointment to qualify me for a medical study. This required general questions about my health, and a pap smear... tldr at the bottom\n\nI was leaned back on the table, about to get my pap, legs spread, in the stirrups, y'know the deal. There are 3 other people in the room: the doctor (a very small, older, sweet, Asian man), his med student (young, probably 23ish IF that old Indian girl), and the research nurse (white, late 20s, and I kind of knew her from my very small college; different major so we saw each other in passing but never in classes). The doctor was looking for a smaller speculum and was explaining to his student the difference. He holds up the larger speculum and said \"we would only use a speculum this large on a vagina this small if we dont want her to come back.\" and laughs hysterically for about 15 seconds. Awkward laughter from all parties... it was a good joke but my lady bits are starting to feel the chill of the air and I came in for a pap, not a comedy show. \n\nThen he does the pap, explaining what he was doing the whole time for his med student. He then asked me if I would mind if his student did a digital exam on me so she can get some practice. I said sure before realizing that a digital exam=when they stick their DIGITS AS IN FINGERS in ya and feel your uterus. I still didn't mind but wasn't considering the awkwardness of this when I said yes. \n\nThis poor girl was SO nervous. She managed to stammer out that this would be her first time and she asked him to walk her through it. So he performed the exam first, then she did. While she is doing the exam she's poking around, trying to feel the uterus and y'know when you're trying to listen closely to something or you're trying to grab something that fell between the couch and the wall and you kinda blankly stare in front of you? So she had that look on her face but staring into my eyes. The doctor meanwhile is asking her and I if we feel it and what she thinks the positioning of my uterus is, and some other medical jargon but she just continues staring into my soul. I didn't know if I should break the gaze or if it would make her realize that she was eye fucking me and finger blasting me at the same time, so I just kept awkwardly staring at her. \n\nAfterwards she was really grateful and thanked me a lot and apologized for taking so long. I'm pretty sure I was the first vagina she ever entered. \n\nTL;DR: had a pap where the doctor made speculum jokes and the med student finger fucked me for 7 minutes trying to find my uterus while locking eyes with me.\n\nEdit: these comments are giving me life, please keep telling me all of your awkward pap stories!!\n\nEdit edit: THANK YOU SO MUCH KIND STRANGER FOR THE SILVER!! I'm so glad you all have enjoyed my story!!",
    "title": "OB/GYN jokes + a first year med student = one hell of a pap smear",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549332544,
    "score": 520,
    "keyword": "asian manager"
  },
  {
    "text": "Sexually assaulted by masseuse? Was I sexually assaulted by my masseuse? I have so many thoughts and feelings, so thanks for understanding any poor grammar or anything in this rant.\n\n&#x200B;\n\nYesterday I went to an asian massage parlor that I've been to many times before. Usually, I do a cheap fully clothed reflexology massage, but yesterday I decided to treat myself to a full body 90 min massage.   I've gotten massages many times before and am very comfortable with getting my body touched and am ok with getting my butt massaged.\n\n&#x200B;\n\nWhen I first arrived, they took me to a room where I quickly got undressed, everything except my underwear under the sheets.  I was wearing glasses that day, so I took those off too, so my vision was very impaired, which is fine because my eyes are closed the whole time. The man working started working on my neck shoulders, backs, buttocks and legs. He started to massage my butt over the sheets and I was fine with it. I've gotten massages before and they've massaged my butt in the past, so that didn't seem out of the ordinary. Everything seemed fine, except for when he was massaging my butt, my underwear was rubbing against my skin and it made me feel itchy. (This is where I fucked up). I told him that was happening and asked if I could remove my underwear. I kept the sheet over me the whole time and then we were back to normal. He continued the massage as normal and at the time, it felt mostly normal. Looking back, there are a few things that I thought were weird , but  I didn't feel crazy uncomfortable at the time.\n\n&#x200B;\n\nI then rotated to massage the front side. He massaged my face and then the shoulders again. He then asked me if I wanted oil or lotion. I was like whatever you've been doing this whole time?  He covers my face with a towel and proceeds to start massaging my shoulders and then works his way down to my arms.  He massaging my legs and starts inching closer to my pubic area. This is when things start getting weird, I'm wondering if he's getting kind of close and at points, I'm honestly even slightly aroused, but I'm thinking, he's a professional, there's no way that this is happening and thought it was all in my head.  He kind of stops that area and then moves back to chest and removes the towel from my breasts to that I'm fully exposed. I'm alarmed, but just so shocked that this is happening to do anything. He moves back to my legs and sticks his fingers in my vagina. What the fuck is this really happening? Why am I not stopping him? What is going on? After a few seconds, I can't believe I took me this long, I motioned his arm away and use the towels to cover my chest.   He continues to massage my legs and then finally I just got the courage to tell him I need to stop and grab the towel, wrap it around my body, and ask him to leave. He just keeps pointing at something and saying something over and over and I'm not understanding, i just want to go. He then finally grabs a wet towel and says, towel for the oil. He tries to wrap it over and I'm just like no, I can do this myself. He quickly hands me a few more towels and leaves as I quickly dress and try get the fuck out of there.\n\n&#x200B;\n\nAs I leave, I told the front desk guy that I'm not paying for anything and that was unacceptable. I couldn't get the courage to tell him what happened and just left.  Moments later, I get to the car and I call him back and told him that the masseuse touched me inappropriately and that they need to do something about it. He apologized, but I was too pissed to see if that was even sincere.  I managed to call back later and asked for the masseuse's name and license number, they gave it to me, and then quickly hung up.\n\n&#x200B;\n\nSince then, Ive been racking my brain about this whole situation. I feel so much shame and guilt. I feel like I let myself be in this situation. I should have stopped him when things were getting weird, but I didn't. Was I asking for this because I was slightly aroused? Not by him personally, but like someone is touching your leg? I have a boyfriend, how is this going to affect him? How is he going to be hurt to know this happened? I don't know. I know what everyone is going to say, but I can't help but just feel like it's my fault. I thought that if I was in a situation like this, I would know how to speak up. Why didn't I feel outraged as this was happening? I thought that I would know and feel extremely violated, but was I just in extreme shock?  I took off my underwear during the massage, that wasn't fucking smart. What the fuck was I thinking?? I don't know what to do. I know everyone's going to say to file a report or whatever, but what happens after that?  Halp.",
    "title": "Sexually assaulted by masseuse?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1562448815,
    "score": 58,
    "keyword": "asian manager"
  },
  {
    "text": "You don’t have any right to my body. Posting this sort-of rant from a throwaway of sorts in a kinda-response to a post I saw this morning.\n\nI’ve been thinking a lot recently about the sexual harassment and assault I suffered as a young woman alone in Europe. This is really long so bear with me.\n\nI’m Asian, really short, kinda chubby, and plain as they come, so I thought I was pretty safe at the time. What a naive thought. \n\nOn my second day abroad, the 70-year-old man who was one of the people sharing the rented “apartment” with me offered me whiskey. I accepted. I knew how much I could drink, I wasn’t going to get drunk, and he was a 70-year-old man. What could happen? He was chatty, very much so. But as night fell and our conversation continued he started to become more creepy. It wasn’t just about daily life anymore. He started talking about how he left a woman who told him she desperately wanted his babies. He cornered me further and further along the galley kitchen. He found excuses to touch my shirt and my chest. I felt uncomfortable and even thought, “I could lose my virginity tonight.” I was aware that I wouldn’t accept his behaviour from anyone else, but because he was 70, what could he possibly do? He tried to lure me into his room. I didn’t enter. Then he entered mine and asked me to show him some games I’d been playing. He put his chin on my head. I moved away uneasily. Then he pulled up a chair beside me, told me he really liked me, put his hands on my face, pulled me towards him, and tried to kiss me. I resisted and pulled away. He refused to leave until he saw me frantically texting my friends and family to help me. Why didn’t I make a fuss or fight him? I don’t know. MEN who have heard me recall this story have asked me why I, as a 20-year-old girl, didn’t punch him right there and then. And I just don’t know.\n\nI called my father crying. To his credit, he absolutely took me seriously and raised a huge fuss back home, resulting in our Foreign Affairs ministry getting in touch with local police to conduct a welfare check. My father put pressure on the authorities, the school hosting me, and offered me money to get the hell out of there.\n\nThe next day the landlord pounded on my door, shocked that the police were on our doorstep. I too was stunned that the police were here, so I asked for a private moment with the landlord and told her what happened. I don’t know why but I cried. She looked shocked but told me to send the police away. I did. I told them everything was alright. Half an hour later, she had pulled me and the creepy old man together to attempt to “communicate”. The man said he remembered nothing. He’d been drunk. We’d been drunk. She believed him and told me to stop drinking alone with him in the future and that everything was OK now. It wasn’t but I knew I’d lost this one so I returned to my room, booked a hotel room, got a cab. And as I was waiting for my cab, the creepy old man came down the stairs and stood right beside me, close enough to touch, casually smoking a cigarette. And still I didn’t say anything.\n\nI guess that was the day a switch just flipped in my head driving the point home that even if not all men were dirty fucking bastards, how would I ever be able to tell if a 70 year old man could lay his hands on me?\n\nI didn’t even think of this as sexual assault. It was all me, being dumb. I saw the signs and didn’t act on them. I had been passive and helpless and dumb. It was all my mistake.\n\nIt wasn’t until I was forced to go to the police just to “give an interview” that they told me that I had been sexually assaulted, a crime had been committed against me. I had to wait to decide if I wanted the police to take action. I decided not to.\n\nBut here I was in Europe, a dream come true, when for weeks I was afraid to even leave my dorm to buy groceries because I was afraid I would run into my assailant.\n\nSome time goes by. Miscellaneous bullshit also happens. Strangers would think they had the right to grip my arms because it was winter and I wasn’t wearing a coat. Men leered at me from doorways. If I even gave a second glance to a male stranger on the street, they would take the opportunity to leer at me when nothing had happened before. I could be walking on one edge of a wide, empty street, and men would make the effort to cross the street, close the distance between us, and grab my hips and ass.\n\nThe last incident I remember was trying to walk back to my dorm in the wee hours of the morning. It was only something like 2,5 miles and I figured nobody would be on the streets. What could go wrong? Halfway through my journey a man stumbles out of a cab and spots me. He starts following me and talking to me, he wants my name and wants to know where I live. When I ignore him and speed up, he speeds up too and starts screaming at me if I want to have sex with him, he can show me a really good time. Even when I break into a jog he follows me and keeps screaming this at my back. I start thinking that I may not be so lucky this time and I may actually get raped. But my luck didn’t run out that day and I managed to run up to a crowded bar and stand in its doorway until the man saw me with other people and left me alone. And even when I walked home, I turned back every minute because I didn’t know if I would be ambushed.\n\nWhenever I mentioned these incidents to male friends, they would give me an incredulous look and a smile. “You got sexually assaulted?” \n\nBut of course it’s not like there weren’t kind men. I left a party with a complete stranger, having no intention of having sex with him, and he took me to a supper place like he promised, got angry on my behalf at what happened (while of course telling me what I SHOULD have done while being harassed and assaulted...), and finally helped me get a cab to get home safely. He checked with me when I got home. It does make me somewhat sad that this kindness had to be extended from a fellow Asian.\n\nI’m thankful every time I recall this that I wasn’t raped, but years later, even now, I just feel bouts of numbness and anger that people just seemed to take my body for granted. That a vulnerable young girl was there for their amusement, for them to touch, hold, harass without permission. Like they had a right to my body, like I was someone who wouldn’t mind these things happening because...? I was young, I was female, I was foreign.  I don’t consider myself traumatised but these unhappy incidents tend to surface in hard times. To all these people, many years later, I say a belated FUCK YOU. \n\nAnd that’s all I have to say.",
    "title": "You don’t have any right to my body.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1552994021,
    "score": 40,
    "keyword": "asian manager"
  },
  {
    "text": "Have you ever quit a nursing job because it “wasn’t a good fit”? Hello! \n\nI am in a stressful situation that I’d love to discuss as I haven’t been in this position before. I was working a postpartum job that I LOVED but I had to rotate. 3 weeks on nights and 3 weeks on days. It was wreaking havoc on my body; I have PCOS and my hormones were all out of whack and I was depressed and anxious. It was really important for me to stay in women’s health as it’s what I always wanted to do. So I started looking elsewhere - I REALLY wanted to stay in my healthcare system (state employee job, great benefits) but none of the OB clinics were hiring (again, really important to me to stay in women’s health and I’ve done outpatient before) don’t want to work L&D (just not my speed lol) So I started looking outside the healthcare system. \n\nAll of the postpartum jobs around me were night shift or rotating. So I started looking at OB clinics outside of my system. I felt desperate to get out of the schedule I was in. My manager said it could be another year of me rotating before I could get moved to permanent day shift. I found a clinic with a different large health system in my area that sounded good on paper. It was a pay cut, I had to give up my tuition benefits (getting my BSN online), and gave up my generous PTO. Again, I felt desperate so I thought it would be worth it if I loved the clinic. Free parking, can wear whatever scrubs I want, great location, etc. Sounded good to me! \n\nI got here and HATED IT. Literally within the first week I was looking for other jobs. They knew when they hired me that I didn’t have OB experience just postpartum. They had me shadow a CMA for one day; then threw me into rooming patients and getting health histories. Ok fine, I’ve done outpatient before and it’s not rocket science. But they criticized (not nice constructive criticism or feedback) EVERYTHING I did even though no one told me I needed to do X,Y, or Z. They acted as if I was a moron if I didn’t know how to do something. I brought my own lotion into what was supposed to be my office for when I’m on phones and not patient care and it was mildly scented and they threw it away without telling me. I also got lead to believe they had only slightly less PTO than my last job but after I started I found out that the majority of it is sick days which I can only use for calling out, and my vacation accrues barely 1 day in almost 2 months. As someone from a different state with in-laws and family in other states this was a bummer because I’ll never have paid time to visit family. \n\nThe manager is never at this location but at the other one but micromanages us even from over there. There have been inappropriate and racist words used in front of the manager that she ignored (a slur about an Asian staff members eyes) yet I got scolded for checking my phone in my pocket (not in front of a patient, didn’t even remove it from my pocket, just glanced at the screen). The only other RN got pissy with me because I couldn’t do an NST (fetal monitoring) because I hadn’t ever done one and hadn’t been trained (“you’ve never done one in your life? Well you need to learn because I can’t be the only one doing them all the time”) I had been there for like maybe 3 weeks by the time she said that. The manager is harassing me about have I done this that or whatever for my orientation as if I’m supposed to train myself with no guidance. \n\nYesterday, it was Halloween and was 4pm. The last patient was in a room and we were chatting at the nurses station. The manager had made some comments about us being chatterboxes throughout the day (she was actually in clinic this day) and I thought she was just making an observation. Then she said “I’ll tell you what I tell the other location: stop talking, get to work. You have to have something to do and if you don’t have work to do I will give you some.”  I was shocked. I’ve never worked somewhere like this. No one was saying anything inappropriate. We were talking about the weather and trick or treating. No patients around; work was all caught up. \n\nSo after all this I reached out to a contact from my last job and got an interview with an OB clinic from my old health system. I called out to go to the interview (I knew they wouldn’t give me any time off to go to an “appointment” without 30 days notice) and basically was told I got the job and should hear an official offer next week. I’m DREADING putting my notice in. A CMA who’s been here for 5 years put her notice in last week because she moved and has been commuting an hour each way and the manager is “punishing” her by giving her the cold shoulder and bad assignments. \n\nI’m still in my 90 day probationary period so I think it’s easier for me to quit now. I’m not a very confrontational person and I’m going to give 30 days notice (not that they deserve it but I’m basically doing it to look good to my hiring manager at the new job as she made a comment during the interview about RNs giving a months notice). I KNOW they’re going to ask for a more specific reason and I don’t want to unload on them about how they suck so I’m just going to say it’s not a good fit. Because it’s really not. \n\nHas anyone been in this situation before? I’ve never worked at a job for only a month (except maybe when I was a teenager) but not as a nurse. It doesn’t seem to bother my new manager as I know her from a previous job and she knew I was taking a gamble leaving the health system. She’s been wonderful. But my anxiety about putting my notice in has been through the roof. \n\nThanks for reading such a long post!",
    "title": "Have you ever quit a nursing job because it “wasn’t a good fit”?",
    "subreddit": "nursing",
    "timestamp": 1572615380,
    "score": 7,
    "keyword": "asian manager"
  },
  {
    "text": "[Male Nurse/Canada] Getting tired as a frontline nurse. Love computers as a hobby. Any alternatives? When I was in college (2007-2011), I tried my very best to love nursing. I was a city boy from Manila, Philippines, had a fair share of ups and downs (came from a family that went from riches to rags), so I was somewhat spoiled growing up but also had to learn the lessons of life during my later adolescence.\n\nNursing was never for me. But since asian families usually \"dictate\" your career path, and nursing was booming during this period, I was inevitably directed towards. I graduated with good grades and was able to upgrade as an LPN easily by 2016. Right now I am doing an upgrade towards RN, about 2 years timeline towards accomplishment from this date.\n\nI am currently working in an assisted living facility, night shifts, in a private company. I've only worked for 3 years but I feel like I am burning out from this type of work. It's hard to not be pessimistic about my working conditions when you do so much for the residents but still end up as the bad guy at work if you miss one or two responsibilities and families are never satisfied. We are just people, and we make mistakes too. Not only that, the problems that you encounter everyday are neverending. I always tell my coworkers to not make things a big deal (like workers getting pissed off because butter wasn't available in the fridge) because all our problems today, will just come back tomorrow, and that we also have to live our lives before/after working. \n\nAnother reason why I'm getting burnt out is the crappy benefits and hourly rate that's handed to us. We take care of life, without life there is nothingness. And therefore, life is the best thing that we can have. But how come, as people who are caretakers of other people's lives, don't earn as much as what other industries do? My friends in oil and gas earn about 10k a month, another friend is a mechanic and earns 8k a month. I know a project manager in EA Games who plays all day because all he does is supervise file transfers from one computer to another, earns 150k a year. I am entrusted a loved one's life and care, and yet I only earn 3.5k a month and surrounded by dissatisfied coworkers, families, and management.\n\nI loved video gaming and computers ever since I was a child. I always had almost perfect grades with any subjects that's related to computers, and even until now it's still my hobby. I enjoy building gaming PCs and using them to the fullest.\n\nBeing 28 and wanting a change (I was diagnosed with diabetes 2 months ago, because I fell in a state of chronic sadness/depression which lead me to have very unhealthy dietary decisions for the past 7 years since I came to Canada), I am starting to become more and more convinced that being happy at your job is of vital importance for the longevity of your career and mental stability. I fear that your daily stresses can start contributing to your daily decisions which may affect your relationships, finances, and health.\n\nMy dreams, since I was a kid, was to either be a pilot or computer science/engineer. My family could not afford me to be a pilot, and I didn't really think of the idea to go for a computer-related course back then.\n\nWhat are your suggestions/insights? Are there any career path related to nursing which are related to computer expertise? I would really want to find a way that would make me happy and look forward to working.\n\nThank you for your wisdom.\n\nP.S. I probably can't switch career paths right now because I am drowning in debt and can no longer afford student loans.",
    "title": "[Male Nurse/Canada] Getting tired as a frontline nurse. Love computers as a hobby. Any alternatives?",
    "subreddit": "nursing",
    "timestamp": 1571825027,
    "score": 4,
    "keyword": "asian manager"
  },
  {
    "text": "Supporting a pregnant student? Hi! I'm a head teacher in a middle/high school in an asian country.  Recently it's become known to us that one of our grade 11 (17y/o) students is pregnant, confirmed by a validated doctor note. \n\nWe're planning on setting up a temporary SpEd plan with some limited accommodations, but what accommodations would be appropriate? \n\nIt's also important to note this student has been known to really milk accommodations, illnesses, doctors notes, etc. \n\nAny suggestions to manage this?",
    "title": "Supporting a pregnant student?",
    "subreddit": "Teachers",
    "timestamp": 1570477501,
    "score": 5,
    "keyword": "asian manager"
  },
  {
    "text": "I am 35 year old Top MBA graduate and unemployed since graduation and struggling to land a job. What should I do? Hi,\n\nI request urgent guidance as I am finding it extremely challenging to get a job. There's also a Tl;dr down below.\n\nMy story and situation:\n\nI am a Full Time MBA graduate from one of the Southern Ivies in USA and graduated this year in May. I am 35 and an International student of South East Asian origin with an extensive (8 years) work background in Middle East. Most of my work was in Sales, Business Development and Project Management . I worked for one of the biggest conglomerates in Middle East and prior to my MBA I was working as a Business Development Manager for a small construction and engineering firm in Middle East. My undergraduate degree is in Computer Engineering and I did it from Canada and Middle East.\n\nBy my 6th work year I wanted to do a big career switch. I had a passion for Media and Film and planned to do my MBA in Media Management. I got a 98-99th percentile GMAT score and decided to apply to the two best MBA universities in USA that cater to Media Management. I tried hard but could not get into both of them and then I changed my mindset and after some advice from my professional network and my own analysis, I decided to pursue MBA for Investment Banking. Additionally, I was hopeful that an MBA would also allow me to see what else might be out there and how I can make a career switch. Lastly, I hoped an MBA from a good university would add more brand value and weight to my resume, especially compared to my undergraduate school. I wanted to end up at a post MBA level at least at the same, if not higher, career level as my peers.\n\nI got into a school with a full tuition scholarship. It had a nice track record for Investment Banking (20% of the class). I thought it was relatively good fit. As soon as I started, I was struck with a major personal issue that caused me a lot of strife. On top of that, I came to know that no International student from the school had been hired into banking for the past 5 years. Nevertheless, I pushed hard for Investment Banking. But by the mid of the first semester, because of my personal issue, things spiraled out of control and it was either maintaining pursuit for IB or maintaining grades for continued scholarship. Eventually, I focused on my grades and lost out on interviews for IB.\nI was also advised to pursue Consulting but since the recruitment happens at the same time as IB, I couldn't. In the\nSecond semester I just focused on my grades as I did not want to risk my scholarship again. In the Summer I took a Strategy internship in a education firm which was a non-profit.\n\nAs I did not get an IB Internship, I reluctantly gave up on that dream. In the last two semesters of my MBA, I took lots of strategy courses and tried improving my GPA as much as possible. Towards the end of the program, I built my resume again , and started networking full fledged for Strategy positions. Most of the companies that visited campus had already finished hiring in the 3rd semester and therefore there wasn't much recruiting in the 4th semester.\n\nAfter graduation, I had to wait 4 months to receive my 1 year work permit, which is given to International MBA students. In the meantime, I revamped my resume again, updated my LinkedIn and applied to many other places with very specific and well catered resumes. I ensured that all my resumes for any job application will pass the ATS system. I networked with the lead recruiters of the companies I was applying to.\n\nUnfortunately most companies did not sponsor an International MBA. Plus my school was not as big as a brand as the top 7 (M7) or Top 10 MBA schools. So there were very few interviews.\n\nI then focused my energy towards companies that only sponsored or positions in Middle East. However, getting an interview itself is a big hurdle and a very slow process. Unlike recruitment on campus, I am an external candidate now. That means I compete against a very large number of job applicants.\n\nAnother issue is that I do not know how should I distribute my time or what should I focus on? Beggars cannot be choosers, so I can't even neglect any potential opportunity for me, regardless of industry or job function.\nFor example, should I only focus on consulting? I have not worked in consulting and neither did I do my internship in consulting. This means that I have to spend an unbelievable amount of time on networking, research, case interview prep, studying consulting books, revising management theories and learning strategy models.\n\nYou, the reader, might ask why would I like consulting if it is so challenging for me to get in. Few things:\n1.\tI know I can do it and do it well. I have some very strong consulting soft skills such as client relationship, communication and presentation, building business from ground up, leadership and managing cross functional teams, solving complex issues, working long and under pressure and some decent hard skills such as business analysis, market research and variety of software. I can get stuff done for the client.\n2.\tI am 35 and I want to be at least on a level that personally satisfies me. I was a bright kid and usually the top of my group but during undergrad I fell behind my peers. Now, I am already 5 years behind 30 year olds who, post MBA, are in Consulting, Investment Banking and other Fortune 200s. Consulting, even at Big 4, gives me that kind of brand image, job prestige and financial security level.\n3.\tThis is the only chance I have to get into it otherwise I can't make a lateral shift later in my career.\n4.\tI will get to at least work with some smart people and successful clients. It will be an invaluable learning and growth experience.\n5.\tEven though I want to be long term in it, the exit ops of consulting are also good. The network made will help you lifelong.\nOr should I cast a wide net? I have applied for Business Development and Product Management roles but so far have had no luck. Additionally, I am over qualified for some of the jobs or those jobs are mostly a career stagnation for me.\n\nInitially, I wanted the US experience but because of the visa issues, my previous experience in the ME and my gf being in Middle East, I am now very much inclined to work there. However, I am still in the US. I am trying my best to reach out to recruiters and network from here but so far things have moved very slow. There has not been any official interview there. Therefore, I do not know whether I should completely forget about the US and just focus on Middle East.\nI am lost. I have run out of money and despite my scholarship, I have student debt that covered my non tuition expenses. I need guidance. I need help, evaluating my profile and knowing how I can achieve my goals.\n\nTL;dr: 8 yrs Sales/BD/PM prior MBA work experience in Middle East. Went to Southern US to school for MBA and graduated in May of this year. Jobless since then. During MBA, recruited for IB. Had major personal problem and IB didn't workout . Cost me key recruiting time as well as grades. Focused more on improving grades in following semesters. Shifted recruiting focus to strategy/consulting by end of MBA. Post MBA things have moved very slow and getting interviews is the biggest hurdle as an External/Non Campus hire as well as being an International Student. Want job brand, prestige and financial status equivalent to 30 year old top school MBAs. Do not know what should I focus on? Consulting or Buss Development? US or Middle East? How should I go about it? In debt and struggling. Need urgent help.",
    "title": "I am 35 year old Top MBA graduate and unemployed since graduation and struggling to land a job. What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1572923225,
    "score": 6,
    "keyword": "asian manager"
  },
  {
    "text": "Please help me decide which CS/IT career path is best suited for me? I am a 25 year old male living in Sri Lanka currently doing 4th year (final year) of a Software Engineering degree.  There are some personal details I think would be relevant so included that as well.\n\n**Schooling**\n\nAt school I followed GCSE London curriculum not the local Sri Lankan one. The local one is much tougher because there is a competition to get into the limited free slots in government universities. For my A levels I selected core mathematics, Biology, Chemistry and Physics. 95% of those who did this wanted to do medicine as is the case in many asian countries. I thought I wanted to be a biologist.\n\n**Learning difficulties**\n\nAt this time I realized I had some difficulties in learning new information and skills compared to other students. For example in school the teacher would teacher a concept for 45 minutes. I would kinda understand it at the time. In the next 45 minutes another concept would be taught that builds on the first concept. Now I have totally forgotten the first concept so would not understand anything. The teachers would complain that I am not attentive and don't listen in class. I would get low marks (30's) in term exams. But at home I would study the first concept over and over until I get it. But still I would forget more frequently and had to constantly study/redo questions.\n\nThis was the same when I tried to learn anything. Eg : martial arts, swimming, driving, rowing. Almost all the time the instructors were suprised that I haven't learned a technique  at that point. They always complained that I haven't paid attention. But reality is that I paid maximum attention. I just have to repeat it more. Another problem I noticed was that I don't remember directions when navigating. I had to go somewhere more than 50 times to remember how to get there. I would forget the turns landmarks etc. I suspect I have some form of learning disability relating to the memory. Was tested for ADHD and found negative.\n\nI somehow finished my AL's with 3A's and a B. B for physics. But the effort took a mental toll on me. In the final year I only slept around 6 hours a day and spent most of my  waking hours studying. I believed that I was not cut for science. Meanwhile my collegues in the commerce batch had a much more leisurely life. People who scored medocre in math get 90's in Accounting. I said I wanted to do commerce. I told people that this is because I wanted to earn money in finance and other fairy tales. But deep down I was bitter. I actually liked science and had no interest in this subject. I was 20 years old at the time.\n\n**My experience abroad doing undergraduate**\n\nI also disliked my country and wanted to escape to a western one. So, somehow convinced my parents to send me to Australia for a degree in accounting or finance. My parents were middle class but they agreed to fund my initial education and I would go there and do a part time job.\n\nIn my first semester I actually got good marks in the commerce subjects. The courseload was much smaller. But at the end of the semester I was depressed. I didn't like anthing I was studying. I felt like I would commit suicide by 30 if I worked as an  accountant. At the same time I discovered computer science and also did the Coursera course \"Learning how to Learn\" by Babara Oakley which said that with the proper study techniques it is possible to do a degree in science.\n\nSo, in my second semster I switched to computer science. Soon I was overwhelmed. The courseload was twice that of accounting and I ended up failing the semester. I have wasted around 20k usd of my parents money and I was going no where. I felt awful. At the end I decided to quit the degree and come back to Sri Lanka. I would try to get a degree in software engineering from a private campus here. This way I could stay and home and not get overburdened by other responsibilities of living alone.\n\n**Software Engineering degree in Sri Lanka**\n\nAll the top software engineering companies here do work for clients in the US, Europe and Australia. CS degrees from Colombo and Moratuwa  universities (government operated) are the most highly regarded in the industry. After that it's the degree offered by a small private institute. The actual degree is offered by a British institute. They just do the teaching here. So, I enrolled there. Soon I realized that the courseload is not as advanced as my Australain degree. It was watered down. Syllabus is given [here](https://www.iit.ac.lk/course/beng-software-engineering/#menu0).\n\nAt this time I have developed some good learning techniques mainly revolving around Anki Flash card software. This and due to the reduced courseload I managed to maintain an average around 75%. After completing the second year, the entire third year is a internship at a company.\n\n**One year internship**\n\nI got selected to one of the top 5 software companies here but I have mixed feelings about my experience. First I was assigned to a MEAN stack project. But I was not given any work in the actual project. Instead I was given a research task to come up with a good docker/kubernetes architecture to host the app. After this was done I was writing test cases and then a large chunk of time with no work. Not entirely their fault because they were dealing with a difficult client who constantly changes  requirements. In the end the project was shut down. Next I was transferred to an Angular project which was trying to meet a tight deadline. I was fixing bugs in forms etc. After this ended in a few months I was assigned to a research person who wanted to to develop a testing framework for react-native. I spent around a month doing nothing waiting for the project to start. Finally it never did and I was transferred to another big project with a team of around 30 people. This was the oldest project at the company. Now, I had around 5 months left of my internship.\n\nThe team was much more mature and stable. They had a procedure of dealing with new recruits such as KT sessions. Here, I got to work with actual production software. I mainly worked with .NET and Node backends. So, I finished that and started my final year. My internship was not very productive except for my last project. Meanwhile people who stayed in a single project doing a single technology the whole year are now very profecient at that while I knew little bits of node, angular, react, sql, .NET, react native. I came back to Uni to do my final year.\n\n**Problems I have**\n\nMany people passively learn when they do something many times. For example commuting somewhere every day you would  learn the sorroundings of places you pass, when cooking a recipe many times you would learn to make it without the recipe. Even in programming people remember the libraries and functions they use regularly without active memorization. But I don't. But I don't learn like that. Or I have to do  absurdly large amount of repetitions to remember. So, I have to actively try to remember these things using Anki software. I use Ank to memorize the roads in my city, proper form used in the gym exercises, names of people I meet, common knowledge I should be aware of etc etc. The rest I document in onenote notebooks meticulously.\n\nIn uni I carefully make Anki cards for all the concepts learned and all the different types of past paper questions.  I make sure that a single recall will only ask for a single piece of information. This way I manage to get good grades for my exams dispite my memory problems.\n\nI worked in Angular for  months and I had only a shallow understanding of the technology. In the next 3 months I created an Anki deck for Angular and tried to actively memorize the concepts such as routing etc when I encoutered them in my project. After sometime I felt like I'm getting profecient. I could understand things in the project more deeper. But this is a double edged sword. I dont' know what to anki and what not to. Somethings I used rarely and better off not memorized and googled when needed.\n\nEveryone told that using Anki this way is counterproductive. You don't have to memorize frameworks or libraries. Just google things when needed. You'll learn the important stuff while you are donig it anyway. But this last part is very difficult for me and I feel no one else understands.\n\nIn a job where you memorize the principles, techniques or theories and then applies them to solve problems I would excel due to my efficient study techniques related to Anki. And further more I have good discipline and drive. But programming is not such a job and I feel like I will always struggle to progress. I am confident that I'll get a good class in my degree and it won't be difficult to get a job at a good programming company afterwards. But I'm not confident that I'll be able to do the job properly. Maybe this view is because I was shifted between  different technologies and had lot of time doing nothing at my internship. Maybe if I was assigned to a single project I would have become profecient at that. But I don't know that.\n\n**So, here's my question**\n\n* The only things in life that  helped me remember the things other people remember naturally are Anki and memonic technique of visualization.\n* If I go into a career in programming, I will have to use the above. Then I have to understand which concepts to memorize and which are best googled when needed. If this is not practical I don't see much progress in myself in such a career.\n* If programming is not suited for me what career is? I cannot go into a completely diffierent field now. Are there any jobs in IT that are best suited in my condition?",
    "title": "Please help me decide which CS/IT career path is best suited for me?",
    "subreddit": "careerguidance",
    "timestamp": 1569911916,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Seeking career guidance throughout community college and transferring. TLDR; Should I still push through and focus on getting my associates? Hello I am 22 years old and I am currently at a community college.\n\nA bit of my past history, I attended a local community college after graduating high school and studied general engineering then eventually changed majors a couple times but in the relevant fields (ex. electrical, cyber security, computer engineering). I was very clueless as to what I wanted to do in the future and I wanted to seek a degree in which I was interested in rather than just to find a job. And so I pretty much wasted a lot of my time at the community college managing work, personal life, and not even attending classes due to lack of motivation. I currently have a GPA below a 2.0 (1.93 i believe) and have 40 credits out of an attempted 90 or so. I received an academic warning last year and was stripped of my financial aid. I took a semester (or two) break and just worked blue collar jobs as a server, hvac contractor, delivery driver, and at a ups store and hit a point that the purpose of school has become very valuable to me.\n\nThroughout the past year I have spent my time on the side trading in the stock market and became interested in becoming educated and to eventually pursue a career as a financial analyst (or anything related to the stock market/trading). I feel a lot more different about school now that I have a career I want to pursue and it feels immensely motivating to study hard for it.\n\nI talked to my local community college adviser and registered my degree as business administration (there was only a choice between accounting and business so no finance). Looking back at my past records made me realize how much I messed up my GPA and it made me lose a lot of confidence.  On top of that, it worries me that I won't even be able to transfer to a decent school because of how poorly I did previously and because I took so many credits already that it tanked my GPA so theoretically I don't think I can raise it to a 3.5 or even a 3. I know that once I transfer my GPA will reset  but at this point will business schools even accept me ? I hear that they care a lot about GPA and business has become even more competitive these days. The school that I want to get into and to further pursue my career at has quite the competitive business school and my adviser said I'm not going to get in which is understandable but other 4 year universities would take me in for sure.\n\nWhich concludes to the main question, should I still push through with it anyway and focus on getting my associates in Business Administration and then transfer to some 4 year university to finish my bachelor's?\n\nIs becoming a financial analyst even a realistic goal for me?  Should I finish my bachelor's at some 4 year uni and apply for a good masters program? Do I still have a chance with the dream school if I did a lot of extracurricular activities? Also any tips on finding an internship related to the finance field with no experience at all?\n\nJust throwing it out there, I'm an INTP and asian.\n\n&#x200B;\n\nHonest feedback to the situation is very much appreciated.",
    "title": "Seeking career guidance throughout community college and transferring. TLDR; Should I still push through and focus on getting my associates?",
    "subreddit": "careerguidance",
    "timestamp": 1566190861,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "I'm 22, I haven't applied to more than 20 companies in my life, and I have 6 SWE/intern positions under my belt, and I wanted to share some tips I read a lot about people applying to 300 jobs and getting like 2 callbacks, but I had a very different experience. I wanted to share some of my tips that I've learned.\n\n1. I never applied a ton, I had connections. In college I joined a professional fraternity and 4 out of the 6 jobs I got were through people I knew who worked there. You get your resume handed right to the manager instead of through HR. I recommend making friends with people in your class, or finding somebody else with a strong network and free-loading off of theirs (and buy them lunch or something). Furthermore, people you know there can give you invaluable advice on what is going to be on the interview/what the hiring manager is like, etc.\n2. I made friends with the \"CS gods\" who were role models in my class. Then, I just ask them for their resume, for them to look at mine, for their advice, their compensation and negotiation tactics, etc. It's not like the med field where other people want the competition to fail, I rarely meet any SWE who DOESN'T want to help others get a job.\n3. Even when I cold apply, NEVER apply on the website, there's too many people that do that. Instead, I find a recruiter on Linkedin, I find their WORK EMAIL with this extension (https://connect.clearbit.com/), and I email them DIRECTLY with my resume, my interest, and a blurb showing that I've researched the company.\n4. (only applies to US citizens) This sounds shitty, but if you have an asian sounding name and you ARE a citizen, put that you're a citizen on there. Some recruiters will toss resumes JUST because they're asian and the company can't sponsor, even if you are a citizen. I literally put \"US Citizen\" next to my phone number, linkedin, and github.\n5. Interviewing is honestly all about confidence. You have to be a salesman. You can't just be good at coding and suck at talking, or vice versa. I don't really study that much the day before an interview (that's for the weeks before), I just go on walks, run, do jumping jacks, get my blood flowing so that I feel the most alive I can be before stepping in to the room.\n6. credit to u/Chewbahka72, but if you don't have experience just apply to smaller companies, instead of FB/Apple/Google/MSFT. There's a reason those companies pay so well, it's cause everybody has tons of experience, it's ok to start at smaller companies where you can get good tech experience without the cool free food benefits and the company jerking you off while you work.\n\nLet me know if you want me to take a look at your resume or anything!\n\n**EDIT: RESUME TIPS:**\n\nI got some PMs about resumes, I'll take a look at them but here are my tips for resumes:\n\n1. Don't use Arial, Calibri, Times New Roman. I know this might be an unpopular opinion, but if you want to get a job (esp. in Silicon Valley), make it unique. DO put some interest in design. I'm not saying make the whole thing in LaTeX or get Elon Musk to lick it before applying, but try some different fonts and dear God learn to right justify text on the same line. (https://fonts.google.com/) (https://fontawesome.com/?from=io - for LinkedIn, github, email, phone# icons). I use Open Sans and Raleway\n2. Use PROBLEM, SOLUTION, IMPACT. Indicate the PROBLEM you're trying to solve, then indicate how you SOLVED it (what language, framework, architecture, system, design), and then talk about IMPACT (financial - saved $42069k, operational - less people needed to do this task now, time - saved 20% time on this operation). Here's an example: \"Built a batch utility using Java, SQL, Hibernate to automate self-checking of the business's pricing processing system (SOLUTION), allowing the business to catch failed charges due to temporarily failed downstream services (PROBLEM mixed with a little bit of SOLUTION), which in one instance saved the company $2000 in revenue leak\"\n3. Split up your skills into LANGUAGES and FRAMEWORKS/TECHNOLOGIES. Languages: Java, SQL, Python. Frameworks/Technologies: React, Redux, git, AWS, Docker\n4. Bold text that is important, make text lighter or smaller for text that is not important. IMPORTANT: Company names, Job title, headers. NOT AS IMPORTANT: employment durations, project times, company locations\n5. Just find a good-looking CS resume online or from a friend and copy the formatting. MS Word is honestly enough for the vast majority of cases.\n\n**EDIT 2: Here is my anonymized resume:**\nhttps://i.imgur.com/VpPK5G3.png\nNot all my experience is on there, I put what I thought were the most valuable ones. I want to highlight that my resume doesn't have the biggest names on there in terms of company names, but I do think it is a strong one due to formatting, design, and wording.\n\n**EDIT 3:** I had 4 internships in school (1 per summer, 1 in part time) and 2 full-time positions already, sorry for the confusion",
    "title": "I'm 22, I haven't applied to more than 20 companies in my life, and I have 6 SWE/intern positions under my belt, and I wanted to share some tips",
    "subreddit": "cscareerquestions",
    "timestamp": 1556127076,
    "score": 1959,
    "keyword": "asian manager"
  },
  {
    "text": "Finally gave my two week notice to pursue my Post-Bacc in CS. I would love to solicit some advice and tips from my fellow redditors on studying, interviews and career paths.\n\nA little background on myself. I got a degree in something that I loved ( Civil Engineering), however I did not realized how terrible the industry was for junior engineers, in the extent that it would basically grind you to the bones without really letting you learn any technical skills beside being billable. If you can survive the first few year, then you can have a cushy job ( if you are willing to follow where the work is ).\n\nI realized that this was not the career for me and decided to do a part time boot camp for Full Stack Development under the advice of a close friend and rediscover my passion for problem solving and having the ability to build elaborate solutions to exciting problems.\n\nHowever, I was unsuccessful in the job hunting process and I am depressed as hell at my current job, but it was difficult for me to just quit a job because my parents are Asian, so I'd to decided to do a post-bacc at my Local Public University to further bolster my skill set and go back to the drawing board. I am not currently aiming for a master's instead because I realized those programs are very accelerated/crash courses and the better one asks that you have at least taken some CS courses and I feel a bachelor would be a good way to get my feet wet.\n\nJust a few questions out here for my fellow CS redditors and hiring managers.\n\n1. Should I even put my first degree on resume and what would hiring managers think?\n2. What clubs, professional organization and societies related to CS/ programming are out there ?\n3. Pointers for dress code for interviews, career fairs and networking events.\n4. Your favorite online CS/web development/ database/algorithm resources.\n\nI just want to thank everyone ahead of time for your responses!",
    "title": "Finally gave my two week notice to pursue my Post-Bacc in CS.",
    "subreddit": "cscareerquestions",
    "timestamp": 1547745626,
    "score": 5,
    "keyword": "asian manager"
  },
  {
    "text": "Please help me decide which career path in IT/CS suites me better I am a 25 year old male living in Sri Lanka currently doing 4th year (final year) of a Software Engineering degree.  There are some personal details I think would be relevant so included that as well. \n\n**Schooling**  \nAt school I followed GCSE London curriculum not the local Sri Lankan one. The local one is much tougher because there is a competition to get into the limited free slots in government universities. For my A levels I selected core mathematics, Biology, Chemistry and Physics. 95% of those who did this wanted to do medicine as is the case in many asian countries. I thought I wanted to be a biologist.\n\n**Learning difficulties**  \nAt this time I realized I had some difficulties in learning new information and skills compared to other students. For example in school the teacher would teacher a concept for 45 minutes. I would kinda understand it at the time. In the next 45 minutes another concept would be taught that builds on the first concept. Now I have totally forgotten the first concept so would not understand anything. The teachers would complain that I am not attentive and don't listen in class. I would get low marks (30's) in term exams. But at home I would study the first concept over and over until I get it. But still I would forget more frequently and had to constantly study/redo questions.\n\nThis was the same when I tried to learn anything. Eg : martial arts, swimming, driving, rowing. Almost all the time the instructors were suprised that I haven't learned a technique  at that point. They always complained that I haven't paid attention. But reality is that I paid maximum attention. I just have to repeat it more. Another problem I noticed was that I don't remember directions when navigating. I had to go somewhere more than 50 times to remember how to get there. I would forget the turns landmarks etc. I suspect I have some form of learning disability relating to the memory. Was tested for ADHD and found negative. \n\nI somehow finished my AL's with 3A's and a B. B for physics. But the effort took a mental toll on me. In the final year I only slept around 6 hours a day and spent most of my  waking hours studying. I believed that I was not cut for science. Meanwhile my collegues in the commerce batch had a much more leisurely life. People who scored medocre in math get 90's in Accounting. I said I wanted to do commerce. I told people that this is because I wanted to earn money in finance and other fairy tales. But deep down I was bitter. I actually liked science and had no interest in this subject. I was 20 years old at the time.\n\n**My experience abroad doing undergraduate**  \nI also disliked my country and wanted to escape to a western one. So, somehow convinced my parents to send me to Australia for a degree in accounting or finance. My parents were middle class but they agreed to fund my initial education and I would go there and do a part time job.\n\nIn my first semester I actually got good marks in the commerce subjects. The courseload was much smaller. But at the end of the semester I was depressed. I didn't like anthing I was studying. I felt like I would commit suicide by 30 if I worked as an  accountant. At the same time I discovered computer science and also did the Coursera course \"Learning how to Learn\" by Babara Oakley which said that with the proper study techniques it is possible to do a degree in science.\n\nSo, in my second semster I switched to computer science. Soon I was overwhelmed. The courseload was twice that of accounting and I ended up failing the semester. I have wasted around 20k usd of my parents money and I was going no where. I felt awful. At the end I decided to quit the degree and come back to Sri Lanka. I would try to get a degree in software engineering from a private campus here. This way I could stay and home and not get overburdened by other responsibilities of living alone.\n\n**Software Engineering degree in Sri Lanka**  \nAll the top software engineering companies here do work for clients in the US, Europe and Australia. CS degrees from Colombo and Moratuwa  universities (government operated) are the most highly regarded in the industry. After that it's the degree offered by a small private institute. The actual degree is offered by a British institute. They just do the teaching here. So, I enrolled there. Soon I realized that the courseload is not as advanced as my Australain degree. It was watered down. Syllabus is given [here](https://www.iit.ac.lk/course/beng-software-engineering/#menu0).  \n\nAt this time I have developed some good learning techniques mainly revolving around Anki Flash card software. This and due to the reduced courseload I managed to maintain an average around 75%. After completing the second year, the entire third year is a internship at a company. \n\n**One year internship**  \nI got selected to one of the top 5 software companies here but I have mixed feelings about my experience. First I was assigned to a MEAN stack project. But I was not given any work in the actual project. Instead I was given a research task to come up with a good docker/kubernetes architecture to host the app. After this was done I was writing test cases and then a large chunk of time with no work. Not entirely their fault because they were dealing with a difficult client who constantly changes  requirements. In the end the project was shut down. Next I was transferred to an Angular project which was trying to meet a tight deadline. I was fixing bugs in forms etc. After this ended in a few months I was assigned to a research person who wanted to to develop a testing framework for react-native. I spent around a month doing nothing waiting for the project to start. Finally it never did and I was transferred to another big project with a team of around 30 people. This was the oldest project at the company. Now, I had around 5 months left of my internship.\n\nThe team was much more mature and stable. They had a procedure of dealing with new recruits such as KT sessions. Here, I got to work with actual production software. I mainly worked with .NET and Node backends. So, I finished that and started my final year. My internship was not very productive except for my last project. Meanwhile people who stayed in a single project doing a single technology the whole year are now very profecient at that while I knew little bits of node, angular, react, sql, .NET, react native. I came back to Uni to do my final year.\n\n**Problems I have**  \nMany people passively learn when they do something many times. For example commuting somewhere every day you would  learn the sorroundings of places you pass, when cooking a recipe many times you would learn to make it without the recipe. Even in programming people remember the libraries and functions they use regularly without active memorization. But I don't. But I don't learn like that. Or I have to do  absurdly large amount of repetitions to remember. So, I have to actively try to remember these things using Anki software. I use Ank to memorize the roads in my city, proper form used in the gym exercises, names of people I meet, common knowledge I should be aware of etc etc. The rest I document in onenote notebooks meticulously.   \n\nIn uni I carefully make Anki cards for all the concepts learned and all the different types of past paper questions.  I make sure that a single recall will only ask for a single piece of information. This way I manage to get good grades for my exams dispite my memory problems.\n\nI worked in Angular for  months and I had only a shallow understanding of the technology. In the next 3 months I created an Anki deck for Angular and tried to actively memorize the concepts such as routing etc when I encoutered them in my project. After sometime I felt like I'm getting profecient. I could understand things in the project more deeper. But this is a double edged sword. I dont' know what to anki and what not to. Somethings I used rarely and better off not memorized and googled when needed.\n\nEveryone told that using Anki this way is counterproductive. You don't have to memorize frameworks or libraries. Just google things when needed. You'll learn the important stuff while you are donig it anyway. But this last part is very difficult for me and I feel no one else understands.\n\nIn a job where you memorize the principles, techniques or theories and then applies them to solve problems I would excel due to my efficient study techniques related to Anki. And further more I have good discipline and drive. But programming is not such a job and I feel like I will always struggle to progress. I am confident that I'll get a good class in my degree and it won't be difficult to get a job at a good programming company afterwards. But I'm not confident that I'll be able to do the job properly. Maybe this view is because I was shifted between  different technologies and had lot of time doing nothing at my internship. Maybe if I was assigned to a single project I would have become profecient at that. But I don't know that.\n\n**So, here's my question**\n\n* The only things in life that  helped me remember the things other people remember naturally are Anki and memonic technique of visualization.\n* If I go into a career in programming, I will have to use the above. Then I have to understand which concepts to memorize and which are best googled when needed. If this is not practical I don't see much progress in myself in such a career.\n* If programming is not suited for me what career is? I cannot go into a completely diffierent field now. Are there any jobs in IT that are best suited in my condition?",
    "title": "Please help me decide which career path in IT/CS suites me better",
    "subreddit": "cscareerquestions",
    "timestamp": 1569911212,
    "score": 5,
    "keyword": "asian manager"
  },
  {
    "text": "Questioning whether to accept the job offer in March 2020 So... Long story short,-I have double degree in Business administration and Economics (16'), after studying abroad came back to my country to work at the top mining firm as a ERP System Administrator (just because of the name at the time and stuff) worked there from November 2016 to July 2019.-Changed it after I got an offer top bank in the country, in order to work as a process improvement department specialist\n\n\\-Currently I am working on big Bank projects, such as Treasury Module Change, Core banking software improvement, as well as SWIFT gpi project improvement... I know future looks bright and promising...\n\n\\-BUT yesterday I have met alumni from my alma mater and he offered me job. Pay is gonna be almost 40% raise and i will be working as project manager under him (whose in charge of East Asian zone), it is gonna be just me and him. I will get a new laptop, and additional pay to get a car leasing cuz work requires extensive travelling around the country, as well as international meetings and conferences, sorta cool, right? I feel like I need international exposure now more than ever, after working exactly 3 years in my home country...  It is Australian Renewable energy company, which is expanding so fast...\n\nSo, Professionals of Reddit, so I humbly ask of you to advice me on this... I have worked in mining sector, currently working in Banking, should I move to Renewable Energy sector because that might be the future trends and good way to shift career? I could not sleep last night thinking about it... I am just really not sure what to do with the offer, when he asks me again in March 2020... I am mean 50% I just wanna leave everything behind and go there... and rest of me, would like to stay here and see the end to those frickin awesome projects...",
    "title": "Questioning whether to accept the job offer in March 2020",
    "subreddit": "cscareerquestions",
    "timestamp": 1575368670,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "I’m starting to think Web Dev isn’t for everyone. I’m honestly not sure why I haven’t gotten a single in person meeting in 7 months. I’ve changed my resume 5  times already. While I do have an internship rn,  I would expect that after 1000 applications, I’d get atleast 1 other meeting.  Just a meeting atleast, not even a job offer. I’ve never had a bad interview so I was really banking on atleast meeting a hiring manager. \n\n\nI’m starting to think that nobody is calling me because I just don’t fit the stereotypical programmer (White/Asian). I know everyone is gonna say “no that’s not why, you’re just not a good programmer , or your resume sucks” . BUT  hear me out, I did an experiment where I applied to jobs sites like LinkedIn, Angelist etc. without a profile pic, and I actually got some (not many) recruiters contacting me. I turned down those interviews because i felt quite insulting tbh. \n\nWhen I apply to other positions outside of programming , I atleast get interviewed. I was actually offered a finance job in less than 2 weeks of applying, but I turned it down to follow my passion- web dev. \n\n\nAnyways, is it really this bad for everyone else? If you’re convinced that I just suck that’s why, please give me some feedback (constructive or de-constructive) on my portfolio. \n\nwww.laurencemintah.com \n\nCiao.\n\nEDIT: I want to thank you all for giving me feedback on my portfolio. It really gave me clarity about my situation. Even though I’m confident my portfolio isn’t worse than most, and many of the projects have been used by others to land jobs (they told me so themselves, and recommended I do those projects), I now know where I stand.\n\n\nTL:DR - I’m ultimately dropping web development as a career option. I had no idea it was this hard to get into , I would warn others who try getting into this field especially without a CS degree, but nonetheless good luck. Thank you all for your time,  I won’t ever stop programming (I love it too much), but now I’ll consider web dev a hobby and focus on getting a job in a different field. Ciao",
    "title": "I’m starting to think Web Dev isn’t for everyone.",
    "subreddit": "cscareerquestions",
    "timestamp": 1566053647,
    "score": 0,
    "keyword": "asian manager"
  },
  {
    "text": "Working at/adapting to big 4 culture coming from a poor background So I'm blessed enough to have got a job from a big 4 firm. I haven't started yet but we have already had multiple socials. I know this place is very pessimistic at times but honestly it's still an honor to start your career at even a national level firm. There's many people on this planet who would easily prefer being in those shoes.\n\nI come from an abusive background with a very mentally ill father. We came from a poor country when I was an infant and never adapted to the west. Just lots of abuse and neglect because of my father's mental issues and not allowed to socialize much, ever go out alone, go camping, or go to a sleepover, etc. This really hindered my development mentally but also socially. \n\nWhen I went to the last social I made an idiot out of myself a few times and wondered what the fuck is wrong with me. All these Asian chicks were ordering fancy drinks that I never even heard of while I kept ordering beers because I did not want to feel stupid and didn't want hard liquor. Beer and liquor is all I ever drank at college.\n\nThe most obvious example was when they were serving some dish, it was like ice cream but it had a base, like a cookie/pretzel or something under it and then you dress it on top. It had some fancy name and I looked like a complete fool because I wanted some but didn't know what to ask. So I ended up asking an associate I gelled with from an earlier social. I was like to him \"do I just say I want an ice cream with a cookie under it?\" And then he told me what it's called. But I didn't hear him right so confirmed and he just looked at me and was like \"..bro it's not that hard.\" It's a small example but it's stuff like that which makes me go what am I doing here. I brought this topic up with my older brother and he said he finds himself in these situations all the time, where things/terms seem normal to other people but he doesn't get it because we never had standard childhood experiences that would result in using those terms. I also made an idiot of myself once when introducing myself to a group of managers who were hiding in a corner. Tbf that was kinda on them, because if you're not interested in socializing with associates why bother coming. Just let someone who's not just there for the free food come instead lol. They stood in a corner the entire night never going to talk to anyone and no one talking to them for longer than a minute while the partners and national leads or w.e. you call em and everyone else walked around actively budding conversations and being friendly. So I tried introducing myself to them and one of them just started making fun of me cause I asked him if he's a senior associate and he was like \"wrong, why don't you guess again.\" I still felt like an idiot and like I was being cringe/uncultured for not having an ice breaker naturally occur to me. I was just tryna break the ice but the guy seemed to not take it well which means I probably messed up. Tbf the rest of the night went great and I even made a few great connections with people I wanted to get to know more. I definitely felt a culture shock though because I wasn't used to that kind of set up or that kind of food. It was like it was straight outta the movies. To others it's probably being dramatic but for me I definitely felt a bit of a culture shock. How should I best deal with that? I definitely feel like I risk coming across as uncultured at times which I would like to avoid.",
    "title": "Working at/adapting to big 4 culture coming from a poor background",
    "subreddit": "Accounting",
    "timestamp": 1570826305,
    "score": 35,
    "keyword": "asian manager"
  },
  {
    "text": "Here is my career plan, achievable? Background: Asian, work in London, second-year audit trainee in a top mid-tier firm,high 2:1 (equivalent to a GPA 3.7 under US system) from a Russell Group Uni,  High Merit from another Russell Group Uni.\n\nMy Career Plan: \n\n1, Finish my training contract (in two years, totally three years), qualify as a chartered accountant (ICAEW, ACA), make an audit senior.\n2, Move to the big four as an assistant manager for two years.\n3, Gain the permanent residency.\n4, Apply for a MBA in a top school (UK or US)\n5, Pass three levels of CFA exams during these time.\n6, With an ACA + CFA + MBA + big 4, I think I will have a reasonable chance to break into at least tier-2 IBD, or management consulting firms.\n7, work there for a few years.\n8, Move to the industry as the head of the finance in a SME.\n9, Lead the SME to IPO.\n10, Be rich.",
    "title": "Here is my career plan, achievable?",
    "subreddit": "Accounting",
    "timestamp": 1570225549,
    "score": 4,
    "keyword": "asian manager"
  },
  {
    "text": "Is it fine to GTFO after 2.5 years in audit? I recently just joined a big4 firm as a first year senior and has been in the job for 6 months. I am previously also a senior in another big4 firm. Got a rather mediocre performance rating recently and I am not in the promotion to second year senior. No bonus as well. Also, felt like I am given biased treatment by the engagement managers now after my performance rating was disclosed to me (like they kinda have bad expectations towards me now etc)\n\n&#x200B;\n\nI have been wanting to move into industry. But there are some people telling me to continue drinking the kool-aid and try to aim for promotion next year (12 months). I no longer find audit work meaningful and my passion has died out a long time ago. I have panic attack almost everyday. I am well aware that I am depressed and I know that public accounting is the root cause of it. Insomnia almost every night. I did not consult a doctor because I am from an Asian background, where it is generally frowned upon to have \"mental issues\".\n\n&#x200B;\n\nWill I do ok if I move into industry with 2.5 years (1 year as a senior, 1.5 year as a junior) under my belt? Are there people who left audit before managerial level and still do fine? (i.e. career progression and pay wise) Please share with me your thoughts/experience/opinion. I am absolutely dreading this right now and I am at the verge of breaking down.\n\n&#x200B;\n\nSorry if my English sound weird, its not my first language.",
    "title": "Is it fine to GTFO after 2.5 years in audit?",
    "subreddit": "Accounting",
    "timestamp": 1560321811,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "Do you have the pass code? Y'all. \n\nThis is a rant about a bad experience I had at a doctor's (naturopath) office today.\n\nI needed some records from an ND I had seen a couple years prior. I drive to her office and was told the she moved to a new location on the \"north end.\" Already I feel a little uneasy because the north end around here is predominately white and \"up scale\" if you will. I Google map the address and go the new location. It looks like a normal house and not an office building, but I see the sign with the doctor's name on it. The door is locked, but I see a little old Asian woman inside, so I gently knock on the door.\n\nThe woman let's me inside and I ask her which room is Dr. Naturopath. She then proceeds to ask me if I have the pass code. I ask what pass code. She responds that you are supposed to have pass code to get in, and wants to know who gave me the pass code. I tell her I don't have one as I've never been here before. Next she says she's unsure if she's supposed to let me in, which is VERY strange because I'm already inside. She let me in. Does it make sense to let someone in if you're not even sure if its ok?\n\nI tell her I was just there to pick up some of my medical records, but she starts slinking away from me and looking unsure. I politely repeat what I'm there for and tell her that I've never been here, so I didn't know there was a pass code needed. I ask her what her name is, thinking maybe this isn't even the office manager/receptionist and she hesitates. She didn't want to give me her name. Why was she afraid to give me her name? If you were this afraid about someone, why let them in the office/house in the first place? Feeling awkward and that I somehow need to prove to this lady that I'm not some hoodlum serial killer, I introduce myself and hold out my hand, she slinks back further. Now I'm getting pissed off. I tell her I'm not a bad a person, that I'm a previous patient of the doctor and just here to get some records. She replies with an old lady \"sorry,\" and I walked back to a random room and thankfully it was Dr. Naturopath's office. I told the doctor what happened and she just laughed nervously and said sorry. \n\nSome people might just think that the little old lady didn't have good people skills. I don't think it was that at all. Damn.",
    "title": "Do you have the pass code?",
    "subreddit": "blackladies",
    "timestamp": 1571797677,
    "score": 15,
    "keyword": "asian manager"
  },
  {
    "text": "TEFL Industry Woes Edit2: Thank you ladies! I appreciate the advice and contacts. I apologize for the negativity... I’m heartbroken and I realize I’ll need more resilience if I want to get anywhere with my job hunting. This post is my experience throughout the year when applying to TEFL jobs. I have other skills and I’m willing to pursue other things. I just wish the feedback I was getting from recruiters was less critical of things I can’t do anything about. I can stomach a wig and slight changes to my appearance to get my foot in the door. It just breaks my heart. It really brings me down and I tend to stay there. This post is my self-esteem taking another knock. Again, I apologize for the negative loathing. I’m not giving up! I want this! \n\nI wish I wasn’t black, so I could have an easier go at getting into the TEFL industry. \n\nToday, I had an interview with a recruiter and I needed to wear a wig over my hair because my afro puff was too big. Like I got there all dolled up and beautiful (can confirm I was cute AF because the manager even loved my hair... she was all up in it! Touching and everything).\n\nI love Asian countries but am I willing to continue to sell myself like this? No... it’s disheartening to have to keep up an appearance I don’t even like. I don’t like make-up (I have severe psoriasis flare ups), I don’t like weaves or wigs and I cannot bring myself to accept them. It took Chris Rock’s docie to make me appreciate my natural hair but it seems I’ll have to put it away for a decent job. \n\nMy options are very limited given the ever increasing unemployment rate in South Africa. I really would love to teach overseas but at this rate, I’m likely to give up on the whole recruitment process. I wish I was a white South African woman or a very white passing coloured woman (not derogatory in SA, it’s an official name for the mulato race). \n\nIt feels like there is no real place where my race doesn’t matter or is actually beneficial to me.\n\nEdit: I realize that just because I keep having bad experiences, it does not mean the whole industry is bad... neither is South Africa completely bad. However as a young black woman in South Africa I am tired of being black... I don’t want this life experience anymore. I don’t want to be this race anymore. I understand why women bleach their skin... I get the Eurocentric hair and make-up trends... it’s easier to just fit in.",
    "title": "TEFL Industry Woes",
    "subreddit": "blackladies",
    "timestamp": 1573141580,
    "score": 13,
    "keyword": "asian manager"
  },
  {
    "text": "Sen. Warren Chooses Roger Lau to be the First Ever Asian American Presidential Campaign Manager",
    "title": "Sen. Warren Chooses Roger Lau to be the First Ever Asian American Presidential Campaign Manager",
    "subreddit": "asianamerican",
    "timestamp": 1550072484,
    "score": 252,
    "keyword": "asian manager"
  },
  {
    "text": "Memphis Grizzlies announce Asian American manager as Vice President",
    "title": "Memphis Grizzlies announce Asian American manager as Vice President",
    "subreddit": "asianamerican",
    "timestamp": 1555599505,
    "score": 131,
    "keyword": "asian manager"
  },
  {
    "text": "Asian Bakery Dilemma Hopefully this post isn't too off topic, but I'm having a bit of a dilemma and wondering if anyone has been in this situation before and might know how to help me. I'm getting married in a couple of months, and I'm trying to get my wedding cake from an Asian bakery (85 degrees would be my top choice) because they taste better, I want to show my friends and my fiancé's family what Taiwanese-style Western cakes taste like, and they taste better. The plan was to pick up ~10 cakes depending on the guest count since most Asian bakeries don't make huge wedding cakes. My venue (generic place that really just specializes in weddings and quinceñearas) requires that the bakery I get the cake from show proof of liability insurance (aka, they are a real, insured business). Trying to get proof of that has been akin to moving mountains. I've tried talking to the manager of my local 85 degrees bakery, calling their customer service, e-mailing them with zero response. I've moved on to other local Asian bakeries, but all the owners/managers I've spoken to have been looking at me like I have 3 heads when I try to explain that the venue needs a copy of some kind of proof of insurance. Has anyone had this problem before and been able to find a solution to it? From a local Asian bakery standpoint, I am in Houston, if anyone knows of any that have good cakes and might not balk at the insurance thing. I'd love to be able to get cakes from an Asian bakery for my wedding!",
    "title": "Asian Bakery Dilemma",
    "subreddit": "asianamerican",
    "timestamp": 1556371366,
    "score": 9,
    "keyword": "asian manager"
  },
  {
    "text": "[JOBS] Remote PT Roles for Community Engagement & PR with Self Evident, An Asian American Podcast Just the messenger, sharing this from a friend.\n\n&#x200B;\n\n\\--\n\nThe podcast I've been working on for the past year is debuting in  May (!) and I'm looking for some people to join my team to help with  community management and PR/partnership management. If you know anyone  great, please send them my way! Both roles would report to yours truly.  Details below:\n\n[Self Evident](http://selfevidentshow.com/) is  podcast taking on what it means to be American by telling Asian  America’s stories. With our host, Cathy Erway, our team is tackling  today’s tough questions about identity, demographic change, and  nationhood — by presenting reported narratives, roundtable  conversations, and personal stories by and about Asian Americans. \n\nWe  want our show to reach as many people as possible while deepening our  commitment to community-driven storytelling. To do that, we are adding a  [Community Manager](http://bit.ly/selfevidentcmjob) and [PR & Partner Marketing Manager](http://bit.ly/selfevidentprjob)  to our team. These are remote, part-time, paid positions that ideally  start in mid/late February, although payment will be delayed until our  Kickstarter funds are released in early April (both roles include  working with us on the Kickstarter campaign). We’ve designed these  positions with lots of room for growth, ownership, and creativity.  Please apply by **Feb 2** and email [**talisa@selfevidentshow.com**](mailto:talisa@selfevidentshow.com) with any questions!  \n\n\nCommunity Manager: [bit.ly/selfevidentcmjob](http://bit.ly/selfevidentcmjob)  \nPR & Partner Manager: [bit.ly/selfevidentprjob](http://bit.ly/selfevidentprjob)",
    "title": "[JOBS] Remote PT Roles for Community Engagement & PR with Self Evident, An Asian American Podcast",
    "subreddit": "asianamerican",
    "timestamp": 1548267689,
    "score": 8,
    "keyword": "asian manager"
  },
  {
    "text": "How do you manage the Asian glow? I am a social drinker, but no matter how much I eat, how much water I drink, or how slowly I sip, I still get the Asian glow and end up feeling nauseous and getting headaches. I have no more than three drinks in a single evening. Otherwise than abstinence, is there a way to avoid feeling sick?",
    "title": "How do you manage the Asian glow?",
    "subreddit": "asianamerican",
    "timestamp": 1568264728,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "A Female Microsoft Manager Is Tired of Discrimination Against Men Read the article here:  [https://qz.com/1598345/microsoft-staff-are-openly-questioning-the-value-of-diversity/](https://qz.com/1598345/microsoft-staff-are-openly-questioning-the-value-of-diversity/) \n\nIn short, a program manager at Microsoft is getting mighty tired of being incentivized to discriminate against white and asian men in favor of women. She created a thread about this on an internal Microsoft social network and it has gotten quite some attention.  \nTo anyone who's familiar with the tech industry, this \\*\\*\\*\\* is nothing new. Women who are barely competent are constantly hired for prestigious roles, all in the pursuit of diversity brownie points. I have observed this countless times myself, but there is no need for me to share my personal anecdotes. Let me just say this - there is hardly another industry where your level of competence is more blatantly apparent than that of technology.",
    "title": "A Female Microsoft Manager Is Tired of Discrimination Against Men",
    "subreddit": "MensRights",
    "timestamp": 1555719695,
    "score": 167,
    "keyword": "asian manager"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 123,
    "keyword": "asian manager"
  },
  {
    "text": "International Women are Good Men Are Bad Day Hi ladies and  gents, if you live in the northern hemisphere you're probably still 'enjoying' the celebrations for International Women's Day. Now if this day was a celebration of women, motherhood, women's achievements, et cetera, I'd be enjoying it too, and have a glass of sparkling grape juice and a piece of cake.\n\n&#x200B;\n\nBut as a bigger, older school bully might say to you when you explain to her you need your lunch money, 'that's not how it works!'.\n\n&#x200B;\n\nIt's easy for men to celebrate women's achievements, and vice-versa, and at a superficial level that's not a zero sum game. However, when the tire hits the road, and we get into the real stuff like who gets the kids, who gets the university place, who gets the good job, and who gets a long prison sentence because their ex wants to say, 'yes, we did it like bunny rabbits for 5 years, but the last time was just horrible, I didn't want to and he should have known!', IT IS A ZERO SUM GAME To me, and my 'unconsciously biased' and 'white privileged' and 'arsehole and the cause of all human problems' eyes, feminism is not about equality, it is about increasingly advantaging group A (women) at the detriment of group B (men). And not a bit, crazy much. Don't get me wrong, most of this - except the kids bit - won't affect elite men and women, the top 5% can build their own businesses and make themselves the boss, feminism can't and won't attempt to influence this sort of thing. Their exes, who are likely also elites, will have too much to lose by making false claims and grueling through the justice process out for years, so they're unlikely to make them.\n\n&#x200B;\n\nSo selfish men in the top 5% of the income bracket, please stop reading now, enjoy your life, and forget about the enormous lifelong harms and disruptions injustly happening to other men.\n\n&#x200B;\n\nNow back to the point, IT IS A ZERO SUM GAME. It doesn't have to be - anyone who's had a good relationship with the opposite sex knows that. But as time goes on, I'm beginning to think the feminists who came after the Bolshevik revolution (so not the Suffragettes), were probably girls with pretty bad form sheets (several men, none who lasted) who always intended to create a zero sum game where women 'win' and men lose. Now of course, feminism clearly accepts the inevitable side effect of creating a zero sum game involving sex and/or marriage with the rules totally tilted against one player - the marriages don't last so well anymore. This is also not an accident, destabilizing marriage where monogamous, lifelong male female marriage becomes an exception rather than a norm was a primary goal of post Bolshevik feminism very early. You can see it in the Philippines - which is such an odd country as divorce is still illegal there - who is out there arguing for legalization of divorce? You got it, the women's rights movement. Philippines' divorce law is odd, as no other real country prohibits divorce, and I'm not actually defending the law - it seems outrageous to apply a Catholic standard of divorce for example to atheists, Muslims, or Episcopalians) - my point is, who's agitating for divorce? Feminists. Philippines is a valuable example because what we see is the progressive nature of feminism.\n\n&#x200B;\n\nFirst it's divorce, fine, that's gender neutral. Then it's no-fault divorce, well, fine, still gender neutral, although it causes massive spike in the divorce rate. But now the zero-sum part comes in - courts award custody of children to mothers, hey not so gender neutral, more zero-sum. Then, we've suddenly got a significant percentage of the population being divorced women with kids - hey the state needs to look after them. So there's welfare for single parents, again zero-sum with women 'winning' as they are the single parents. Now divorce is a cost-free option, because the state will carry the tab. Then UNMARRIED single mothers say, 'hey, what about me!', so now anyone who has a baby gets looked after by the state.\n\n&#x200B;\n\nI was once on a motorbike in Thailand. And a sad-looking, young-looking, not-pretty-looking Dutch woman came after me like a Cheetah wanting to mate with a Dachshund. All over me, wanting to come to my room. I must have friended her on Facebook or something, but did not go with her suggestion she come and stay in my room. A few years later I look on Facebook, sure enough a little white baby boy is born in Holland, sans-father. I don't blame this woman for having a baby, she was lonely and wanted one, and the Dutch state took care of the tab.\n\n&#x200B;\n\nSo that's one zero-sum game. But let's get now to couples, people who marry or are de-factos. If you live in any western country here's how it goes: You'd better forgive her for her occasional adulterous 'indiscretions' or 'you'll get what's coming to you'. If you've got kids, she'll get them - if you fight hard enough you'll get to see them, sometimes. She'll decide where they go to school, what they eat, wear, what out of school activities they do, what religion or no religion they follow, and how many boyfriends she brings back to meet them. If you have daughters, they will have the fortune of seeing and having modelled that women can have a 'healthy sexuality' as the wife leaves her husband and brings back a series of male lovers over a period of years.\n\n&#x200B;\n\nOh and of course, the money. Elites are a little bit different. But for the majority of the population, she'll get most of the assets - even if it was paid for by the husband's earnings. She'll also get a regular cut of your income - after all husbands should pay for the care of children they're denied to see, that's perfectly fair, isn't it?\n\n&#x200B;\n\nThen there's jobs. Got a profession like nursing or teaching predominantly female - that's fine. I went to a bank the other today and out of the 10 staff in the bank, 1 was male, the rest including manager and all seniors female. The lady Asian teller, who I'm normally very friendly with, got quite angry when I suggested it didn't look like the best bank branch for male job applicants. All deans of all faculties female (like RMIT University in Melbourne was), fine, most paediatric doctors female, fine. Too many senior board executives male - OH NO WE MUST FIX IT. Jobs predominantly male must have female quotas, jobs predominantly female should be left alone - ZERO SUM GAME people. Boy Scouts must allow girls, Girl Guides need not allow boys. I saw in the newspaper in Melbourne today that Geelong Grammar can discriminate and give scholarships only to girls. Does anyone reading this believe that any mixed private school in Melbourne would be given dispension to give scholarships only to boys?\n\n&#x200B;\n\nSo it's zero-sum game across the board: children, relationships, marriage, school, jobs...but let's get to the really good one, 'crimes against women and children'. So all this stuff I've mentioned above would still not keep down an entrepreneurial man who runs his own business. If he is his own boss, well, it's easy for him to hide income so his ex gets less - which would tend to press her to the negotiating table re: the kids - and he won't pass himself over for promotion because he is a man in his own business, so his own talent is his only limit. Now such a man might get uppity, and think he was equal with women, and go around doing a lot offensive male things like being assertive, picky about a women's sexual background and divorce history, and just being self-confident and living without fear.\n\n&#x200B;\n\nCan this really be tolerated? The feminists came up with the solution to that one too, let's change the law whenever a guy is charged with a crime against a woman - ie. the ex girlfriend who cries rape. Let's reveal his identity in the newspaper, but make hers protected upon penalty of contempt of court. Let's make him testify in open court, but let's let her testify remotely via video. Oh and if there's a hung jury, because some sexist jury member goes, 'oh wait, she was banging him the Tuesday before, and sexting, but how come she's saying rape on the Thursday?', guess what - she doesn't have to testify again, the court can just reply her recorded testimony. Oh yeah, and we can't ask her about her sexual history, or say that the fact, you know, she had sex with her boyfriend for years might mean it wasn't rape. I'm not making this stuff up - it differs from jurisdiction to jurisdiction, but there are a complete raft of these laws trying to engineer convictions. It often works, but not always. I spoke to a female former teacher of mine from University years ago, and she told me about a rape trial she was a jury member on. Finally the jury didn't convict because the 'victim' about an hour after her rape went and had sex with her boyfriend - the sexist jury didn't believe that a woman who was raped by her friend (not a cheating girlfriend, how dare you!) would go and then have sex with her boyfriend an hour later.\n\n&#x200B;\n\nThank God I've never had to deal with false charges brought against me - and let's face it, the system would grind to a halt if it started getting out of hand - but just the fear of false claim again is used to oppress and strike fear into the hearts of men. I'm not that worried by it, but mostly because I don't want to have flings with tarty looking girls with bad histories, and I think every man in his right mind would be aware of this and have some sort of risk management plan for it - this, itself, is fear.\n\n&#x200B;\n\nLook, I've gone on and on, and I could go on and on even further. But I won't. I would celebrate Women's Day if it wasn't for the fact that it's really, 'help women, harm men' day. It doesn't have to be like this, but it likely will continue to be so for the rest of our lives. In summation I have one point:\n\n&#x200B;\n\nFeminists realise their objective is a ZERO SUM GAME where there is a definite winner (women) and loser (men). Men and women who are not feminists need to realise the same thing, and the sooner the better.",
    "title": "International Women are Good Men Are Bad Day",
    "subreddit": "MensRights",
    "timestamp": 1552081689,
    "score": 67,
    "keyword": "asian manager"
  },
  {
    "text": "Low pay gender discrimination in Australia If you live in Australia - and this applies generally in Western countries - you will hear the moaning and complaining about women having a pay gap with men. Women have all the bad jobs, men are arseholes who murder their wives, and we need to rape the reputation of men as a group and provide the good jobs to women not men on the basis of gender to make all this iniquity right.\n\n&#x200B;\n\nYou've heard the spiel, right.\n\n&#x200B;\n\nTo this I have two words of response: Taxi. Driver. \n\n&#x200B;\n\nOf course women usually primarily care for young children, and schools during the day primarily care for older children. Sure there are exceptions, higher earning mum goes out to work, dad stays home and enjoys himself with baby - good on them. Not many women want that, they want to mother the babies and they want hubby to earn well to make it easy. \n\n&#x200B;\n\nGiven this, and how competitive it is to reach senior positions in competitive workplaces (ie. all workplaces), I find it not surprising that there are so few married women with children in the highest levels of management, eg. board level or senior exec. I find it extraordinary and manipulated - although given the endless rounds of women promotion (literally, like into the juicy senior job everyone wants) and male reputation tarnishing I'm not surprised - that THAT THERE ARE SO MANY WOMEN IN VERY SENIOR POSITIONS. Sometimes you get a talented go-getter who gives up everything including family for career - Julie Bishop, the former foreign minister of Australia, is a good example of this. She earned it. However, given the time out for family commitments, it boggles my mind that married women with multiple children would make it to the top without being given the job based on their possession of a vagina. In other words, you need manipulation in the extreme in favour of female applicants and against male ones to get the numbers of senior women in the workplace we have now, let alone this being an example of discrimination AGAINST women.\n\n&#x200B;\n\nLet's get back to taxi drivers. In Australia being a taxi driver has been one of the lowest status jobs out there. They work insane hours to support families and typically earn somewhere around $8 an hour, in a socialist country like Australia where minimum wage is set at around the low $20s per hour. They have to sit all day long, which is awful for health and posture, they're exposed to the sun, they have to deal with sometimes drunk and abusive customers and not uncommonly physical assaults. Surely if we want to help low income earners, taxi drivers would be the perfect place to start. Surely a few rallies to parliament house, some politicians speaking out for them, the charities and social services organisations prioritizing taxi drivers income. Well....not exactly.\n\n&#x200B;\n\nAny guess why not? It wouldn't be anything to do with the fact that something like 98% of taxi drivers are men, would it? In Australia, Indian immigrant men, by the way.\n\n&#x200B;\n\nLook, if like me you have a dick, and one or two testicles swinging on either side of it, you're not going to get any airtime. You're the aresehole, remember? So that taxi driver who earns $8 an hour is the arsehole, oppressing that focused white or Asian early 40s women who gets promoted to chair of the board and earns a few million yearly. But he's got a dick, so we already know he's bad, so why am I even writing this?\n\n&#x200B;\n\nMen I have no idea what to do in a society that hates my gender so much. I mean for us as a group, on an individual personal level there's usually plenty we can do. The way I see it, things went so nuts so quickly all I can see is at least making men INTERNALLY aware of how the system is stacked against them. I share many others' skepticism of any positive change to men's conditions through the political process, or even a willingness to block their further erosion through more and more man-hatred expressed through law and social beliefs. The only thing I believe I can do beyond the personal level is to at least make as many men as possible aware of the how under siege we, as a gender, have become.\n\n&#x200B;\n\nGood luck to all, but most particularly to Indian male taxi drivers, and least particularly to wealthy early 40s CEOs of large companies who got there mainly because they had a vagina.",
    "title": "Low pay gender discrimination in Australia",
    "subreddit": "MensRights",
    "timestamp": 1550710749,
    "score": 17,
    "keyword": "asian manager"
  },
  {
    "text": "Men's Reproductive Options Dear oppressive tyrants, potential abusers, and willful Y chromosome possessors, let's talk babies.\n\nFeminism is, based on its record, all about the hatred of men. Not even in a personal sense, I am sure there are many happily married feminist women who love and support and value their husbands and sons, but ideologically they will generally advocate change that harms men or block change that helps men. And they are so good at it - after all, they've been getting everything they want for 50 years, they must feel like they are really on a roll. And boy are they.\n\nNow one of the best ways to harm men is to break down their connection to their family. It's hard/impossible to break down pre-existing family connections - a la family of origin - but the feminists have mastered destroying (most) men's capacity to to have and to have good relations with offspring.\n\nFor the feminist ideology - which I consider similar in no-God-required religious extremism to Bolshevism, and of course they share common roots - women must ascend over and at the expense of men in all spheres. It is not enough that now most college spaces are taken by women - and despite this many places are reserved for women, while none for men. It's not enough that girls from the earliest ages of elementary school and throughout school, on average, prosper relative to boys, or that the most disturbed and troubled and unsuccessful students are boys. (And of course, to the feminist, the education system isn't helping girls ENOUGH, hence the need for more propoganda and privileges for female students).\n\nIt's not enough that in the workplace, numerous - especially academic - workplaces are overwhelmingly female dominated, to the point that all senior positions are female held. It's not enough that we need board seats, directorship  seats, partnership seats, parliamentary quotas, public service quotas to give jobs to women. It's not enough that in many industries now if you're male and want to rise to the top you'd better forget it and go into private commerce. It's not enough that a male boss is terrified to discipline a wayward female employee, but a female boss can run the most abusive and unfair reign without anyone daring to challenge her.\n\nIt's not enough that men are portrayed in the media as inherently evil/untruthful, while women are portrayed as inherently virtuous/truthful, and it's not even enough that this is extended to college investigations, and even into the criminal justice system, where men are routinely convicted of assaults of women on her say-so alone notwithstanding enormous countervailing evidence.\n\nIt's not enough that young boys are ignored and miss out on college. It's not enough that those who men who make it through college have their career advancement blocked in many industries. It's not enough that they could go to prison for years if they get down and dirty with the wrong type of girl who is more than willing for some sex and fun today, but tomorrow may want a target for all the rage and angst she feels (a hardly surprising feeling given her crazy mother and the sexual revolution that falsely told her she can slut around without consequence). It's not enough a man might go to jail for another's  rage that bears no relation to him.\n\nBecause even a man whose promotion is capped can earn a steady income, in fact even a man who didn't complete college can pull himself up a bit by his bootstraps into financial security. Even a man who has been falsely accused - and less so, but even a man who has been falsely convicted can build a good family. He can put his family first, he can avoid vices and wastage of his earnings, and focus his emotional and financial attention on the betterment of his children. Now in a normal human system, this would mean he had a lot of good to look forward to over the years. The feminists can't allow this. They can't allow any man to fall through their net.\n\nSo the system (1) encourages women to sleep around before commitment (to weaken commitment) (2) financially rewards women for unfaithfulness - sexual or just vanilla desertion - by using (a) her husband's or (b) the taxpayer's money to fund her lifestyle should she choose to leave her husband. Hey hubby, you better not make too much of a fuss of your wife's couple of little adultery adventures if you know what is good for you.\n\nWhich leads me to the point of, what is a man to do if he wants to reproduce without being under the unfair thumb of a woman who knows the whole setup is exceedingly tilted to her advantage? Let me suggest options:\n\n1. Be a young person from the top 30% of families (money and non-craziness wise) AND be aware of the feminist gameplan - if you are both of these find another teen girl your own age and play your cards right. By the time you're in mid-20s if this is done she'll have so much to lose by ending it she wouldn't dream of it. Go ahead and enjoy your normal life as the maybe 10-20% of men in society who will be able to do this. When you're established financially, your kids grown, put a lot of effort into helping rearrange the system so men who weren't so lucky as you don't get screwed as much.\n2. If you're from a less good family or you started the relationship with women game later (ie. from early 20s onwards) sorry you're not going to be so lucky. You could marry, but the girl is going to have the upper hand and know it, and she's going to be likely a used tart with a bad attitude. Therefore although finding the right girl isn't out of the question, statistically its unlikely. In these circumstances I see two options\n\n(a) Surrogacy. Feminists are trying like crazy to shut it down as they realise how it changes power dynamics, ie. they can't use the family to terrorise and destroy men who go this route anymore. Two options here. 1. Do a self-planned surrogacy in California. There are basic costs you can't avoid for this - it will go up over time - but say $20,000 for eggs, $45,000 for surrogate, $20,000 for IVF (you can get guaranteed birth deals at some clinics). That's $85,000. I'd say it's theoretically possible to get a surrogate whose insurance covers pregnancy and labour medicals, and if you spent $15,000 by shopping around on legal costs, you could have it done for $100,000. I think this is an absolute minimum in Califronia, but likewise I'd think you were a fool to pay over $150,000 at today's prices. 2. Do surrogacy in a cheaper foreign jurisdiction, this could be done for $50,000 or conceivably even less. Colombia is a current popular cheaper destination, although its a bit like whack-a-mole with old jurisdictions closing and new ones opening as the feminists are forever trying to shut down this ungodly avenue for male joy. Note that nothing about taking this route would preclude you from either being a fag or marrying a woman  later on, although you might want to wait til your child's a teen to avoid a woman making some false allegation, a risk to consider.\n\n(b) Impregnate an 'iffy' girl because it's the cheapest way to reproduce. You go in knowing she's a crazy, bit of a slut, etc., but she's the best of a bad bunch. If you do this, do it while you're relatively young, late teens early 20s say. She might block you from seeing the kid, ever. She might make the kid hate you so much, even grown the kid wants nothing to do with you. She might fuck up the kid big time - this happens all the time and is the thing I hate most about feminism,because no matter how much better dad is he won't get custody. But at least you've reproduced. You could consider going overseas for a while and impregnating a woman who wants to keep the baby. This makes it much harder for them to use you as an involuntary meal ticket, as its hard for them to claim alimony when you live abroad. One option would be to have a baby with some Asian from the third world - whatever you do, refuse to acknowledge paternity, her hand is stronger if your paternity is recorded on the birth certificate, you can privately admit it while not signing anything - and later once the kid is a teen many countries allow rectifications of birth certificate, or DNA evidence could be used. Now you can have a nice normal arrangement where you pay her what for you is a minimal and manageable amount, what for her is enough for a (barely) lower middle-class lifestyle, and in return she gives you complete access to your kids when you come to visit on holidays. Just make sure she can't use her fornication and bastardry to try and claim residence in your rich country and whatever you do don't marry her - you can check your jurisdiction, not that many countries allow a woman residency just because she's bred in her home country with a man who is a citizen of the richer country, but I wouldn't be surprised if some Scandinavian countries or whatever would have allowed that. This can be successful but you must be tough but fair.\n\nThat's it guys. All these options suggest you've got your head screwed on properly, and your psyche in order. If you go into the kids/family thing without clarity about your goals and forethought, the 'poor victim angels' are going to bite your face off and the society will clap while it happens. Cheapest option: 1. have a baby with a not-so-innocent Asian women. She'll put the hard sell on you to marry her, help her migrate etc, don't buy it for a second, you're limited to seeing your kids for several weeks holiday per year under this model. That's while they're little - once they're teens, you could bring them over sans-mother, a lot of moms will go 'no way' on this, but I've seen many who genuinely care for their kids go 'great' and allow it despite them being lonely without the kid. Tried and tested option - surrogacy California. Cheapest option where you get full custody: surrogacy in a cheaper jurisdiction, I named Colombia, there are others. If you're not American, expect your government with its feminist orders to try to fuck you up around getting citizenship and passports for your kids from surrogacy. See a lawyer if you need to.",
    "title": "Men's Reproductive Options",
    "subreddit": "MensRights",
    "timestamp": 1573361975,
    "score": 15,
    "keyword": "asian manager"
  }
]