[
  {
    "text": "I'm tired of judging other women I'm honestly not that judgemental when it comes to other people. You've made certain life decisions? That's fine, you do you!\n\nBut I've started to notice that whenever I see certain women, I lowkey start judging them. My partner's ex? Ugh, I'm prettier than her, and she was a conniving bitch anyway. A girl from school I know got married to the love of her life? Aww cute, but she should've lost some weight for the wedding. The list goes on. I'm cringing just admitting that publicly.\n\nI came to realize that these are a reflection of the insecurities I have inside. I'm far from perfect, and whenever I see someone doing better than me, my mind instantly goes into defense mode and points out flaws that make me feel like they don't have it all, and I'm better than them (if that makes sense?). I never say things out loud, maybe I do to a close friend, but that's it.\n\nThe root of the problem is I've grown up in a society that constantly compares you to other women. I'm Asian (South Asian specifically), but I think this problem is world-wide. \"Look how skinny that girl is, you need to look like her\" \"She's accomplished everything, and you're not doing anything with your life\" \"My ex was a good person\", small things like that took a toll on me subconsciously, and I found myself **so** insecure and internally pulling down other women just to feel better about myself.\n\nThe problem is not only that, but also that I have low self-esteem. Whenever I see someone who has something that I want (like being with a guy I like, or rocking a particular outfit I wanted to rock but can't because I don't have a particular body type) I immediately find myself feeling an internal panic. Not crazy panic, but something pangs in my heart, and that something is often \"I'm not good enough bc of so and so reason\". I'm insecure about myself. But I'm changing that.\n\nSo I came here to say sorry, and that I am going to change. I'm tired of judging other women, and I'm tired of not being actually happy for them and being more understanding of the life choices they make. I will stop judging other women from now on, and I will learn to love myself more (including my flaws). I won't let myself or anyone else judge other women, and I will support and uplift you all.\n\nEdit 1: Thank you for all your wonderful replies! I feel so grateful to have such an amazing community of women with whom I can share this with and not be judged; it feels so empowering!\n\nEdit 2: Thank you to the kind strangers who gave me my first gold and silver!!\n\nEdit 3: There are so many responses to this post, and I'm so overwhelmed by the amount of positivity you all are showing! Thank you so much :) I will definitely read and reply to all your posts as soon as I can!",
    "title": "I'm tired of judging other women",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1567475565,
    "score": 5586,
    "keyword": "asian judge"
  },
  {
    "text": "God forbid an asian female to have a voice or different personality. So sick of a culture driven by shame and judging Being asian and female and wanting to act in any other way than what’s expected is just asking to be burned at the stake. I got so sick of the judgement and shame based lifestyle of my asian peers and the bubble they live in. The men crack down on any female that stands out. They see asian women as their right and property. My dad literally told me my body is his property when I was 16 and he got mad i told him I had my first bf. An asian male creepy therapist my parents hired for me constantly bullied and shamed me for dating as a millennial American girl, said really weird racial and misogynistic things to me constantly and about my non asian bf he was weirdly jealous of. It’s just a horribly oppressive culture and being born in the west doesn’t help",
    "title": "God forbid an asian female to have a voice or different personality. So sick of a culture driven by shame and judging",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1577555291,
    "score": 211,
    "keyword": "asian judge"
  },
  {
    "text": "Assault at Church **I’m writing this encounter nearly thirteen years after it happened. It’s sleepless nights like now when I’m compelled to reopen old memories. So, if you don’t mind reading about a naive preteen, asinine (and racist) adults and one sick pervert all mushed into one story, here goes:\n\n-\n\nIt all started in the summer of 2006 at a local teen bible study group (where really it was a place for teens to hang out and volunteer at). The location was held in an Asian Empowerment-Christian church so everyone was 99.9% Asian so my being not full Asian (I’m Japanese and Mexican), I nonetheless stood out like a sore thumb. And other church members often made jabs at my tan skin and high bridged nose, and adding things like “Sorry we don’t serve tacos! Just fried rice!” to even doubting my Japanese last name (“Did you take this name from an anime?”). I sound like I’m digressing but this information will be relevant in a bit. \n\nIn retrospect, I don’t know why I didn’t catch these red flags. I should’ve just left and enjoyed my summer at home. I sat alone most of the time anyway. No one noticed my discomfort save for one person. \n\nLogan.\n\nLogan was this tall Asian twenty-something year old man. He was related to one of the Bible study leaders but only showed up a few times a month. Logan was slim and tall, wore Hollister apparel and slick, black hair that parted at the middle. I remember his humor and laidback style made me feel comfortable around him. Logan even went as far as to ruffle my hair and sit next to me during bible study. He even went as far as commenting on my looks, saying he liked my eyes a lot. That I looked mature for a thirteen year old. Quite the charmer, I thought.\n\nOne day, we were supposed to meet up at a baseball game and Logan offered me and a few others a ride for carpool. As luck would have it, when I arrived at the church (our meet up location), he was the only car there. I asked him where the others were to which he replied that they they all left early since they didn’t want to wait up on us. I found it strange since it wasn’t even that late to begin with. Ignoring my gut, I silently went inside the car anyway.\n\n This is when it starts getting scary. \n\nAs I was opening the backdoor, he was motioning for me to sit in front. I usually didn’t feel comfortable sitting in front with non-family members at the time. I insisted that I was okay - I even joked that he was my chauffeur. But Logan’s face didn’t show that he took my awkward humor well. He turned around with a serious expression. Not saying a word. I stared back, wondering what was wrong. Before I was able to ask, Logan reached over for my hand and began smothering kisses on it. Stunned and confused, I immediately yanked my hand back. I was speechless, not even asking why he was doing what he was doing. His eyes were still glaring and his usual kind voice was now more hitched and deep. “It’s fine. You know me. You like me,” he whispered as he unclipped his seatbelt. He began lifting his body towards the backseat. In that split second, I knew I was in danger. I saw that the backdoor wasn’t locked and I opened the car to make a run for it. I don’t know what came over me that day but I remember losing control of my body at that moment. All senses were hazy. \n\nI later found myself in the pizza parlor that was down the street. I sat there in one of the booths. I just had to be around other people. Other strangers where I could feel immersed once again. Hidden away from Logan’s eyes. After what felt like an hour, I called my friend (who lived nearby) if she and her mom could pick me up. \n\nIt was the last time I ever stepped into those church grounds. I didn’t tell anyone immediately and I had planned it that way until I received a call from the church leader - Logan’s sister. She asked if I was alright and where I had been. It was then that I broke down and spilled the story about what happened to me. She didn’t say anything. Only silence hung around the atmosphere. I doubted at that moment if I made the right decision. \n\nLogan’s sister finally broke the silence and I wished she hadn’t.\n\n“You’re at that age when...we don’t know what we seek. We look for something to compensate what we’re missing...which is usually the case for Hispanic girls like you. It’s no wonder you guys get pregnant so early, you know? Break away from that, ok?”\n\nI didn’t even believe what I was hearing. She was insulting me in every way possible under the guise of a benevolent church leader. Someone who was meant to help - not judge you nor your race. I felt like throwing up. Is this really what my experience is worth to others?\n\nMy thirteen year old self didn’t say anything and just hung up. I hated myself for even trusting her - of all people. His sister. I had all these thoughts swirling over me. What did I do to deserve this unfair situation? I didn’t bother anyone. I was not trying to tempt anyone. Why did it matter whether I was Mexican too? Where is Logan now? Would he come back and show up to finish what he started?\n\nSuch thoughts accompanied me all throughout my teen years. I couldn’t help it. The damage was done. I was stupid and naive. \n\nFast forward to now, I am doing much better thankfully. I’m not fully absolved from my past unwanted memories but things have indeed improved. I have loving friends and a sweet significant other. My parents are still my greatest pride. \n\nI just hope that on nights like now that my idle mind doesn’t betray me anymore. I don’t ever want to meet or let alone think of Logan or his sister again.",
    "title": "Assault at Church",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554966681,
    "score": 16,
    "keyword": "asian judge"
  },
  {
    "text": "Obama Judge: Racial Diversity Demands Discriminating Against Asians",
    "title": "Obama Judge: Racial Diversity Demands Discriminating Against Asians",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1570200500,
    "score": 1,
    "keyword": "asian judge"
  },
  {
    "text": "Help - a bit embarrassed and need some advice Hi there\n\nThis is so embarrassing for me to ask anyone in real life so I am turning to you my fellow reditors because quite frankly I am freaking out.\n\nBasically, I was brought up in a super conservative Asian family - the whole arranged marriage, virgin till wedding night stuff. I was never allowed to date or be with anyone. Only had my first kiss at the age of 20 and have only been with one guy in my life.\n\nLong story short, the guy I was with was an abusive asshole and never really did anything for me. Instead he proceeded to break my self esteem into bits. This ended 2 years ago and I have slowly been working on regaining my self worth, not that it's been easy because most days I look at myself and just see stupid and overweight.\n\nAnyway as part of my rediscovering myself I've been travelling and I really want to experience what its like to meet people and hook up and just learn to enjoy my body and myself. Problem is, I've never done that. I've never hooked up with anyone. I don't know what's expected and I am too old to admit to being inexperienced.\n\nSo bear with me please and please please don't judge too hard - I already kind of hate myself at the moment and am blushing just writing this. But basically, it's the sort of taken for granted steps that I am unaware of.\n\nLike for example,\n\nI want to practice safe sex. Does that mean that I should insist that even things like blow jobs need a condom or something?\n\nIs there like anything I'm expected to have or do?\n\nI am legit in my head still a virgin. The guy I was with hurt me physically so badly it's taken me years to just think about being with someone else. Needless to say, there were no boundaries with him and it was always about his pleasure so no condoms, just me on birth control. I genuinely don't know what I can expect from someone else when having sex or hooking up.\n\nAnd honestly, as a lady who's been in so much physical pain from sex before (I still can't write it out properly. Let's just say therapy to get over what was done to me is still hard), I'm just terrified in general.\n\nI hope I don't sound stupid.\n\nHelp please? Thank you so much xx",
    "title": "Help - a bit embarrassed and need some advice",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1562833562,
    "score": 0,
    "keyword": "asian judge"
  },
  {
    "text": "I (26f) don't feel comfortable dating while living with family ADVICE Warning: this is going to be quite long.\n\nI mean the title is pretty self-explanatory, who wouldn't right? I currently live with family, we're of south asian descent. First of all, it's my mom (54), sister (23) and myself. My mom is a single immigrant mother, hasn't really dated around much, and it doesn't seem like she intends to either. She's been pretty religious since being divorced and she really hasn't pushed my sister and I into marriage either, she has just encouraged us to keep our heads on straight (i.e. not date through our entire school career) to be successful. Although I'm not directly from a south asian country I come from a fairly conservative family.\n\nI was previously away for school, and returned home (in a metro area) to get on my feet. When I was getting done with school my mom asked me if I'd be willing to assist with the rent, so we could get a bigger apartment. I agreed, but I knew from then I may regret that decision. And I do sorta. Since living at home I've gotten myself together and have finally started working. We recently found a bigger apartment and my mom and I have been splitting the rent. My sister hasn't made much of a contribution cause she's in undergrad and works for not that much money. My mom doesn't do much high-level or high wage work (she does work with kids/the elderly), so that's where I came in with the income. She currently has 2 jobs and I think if she did have to make it on her own (i.e. just living with my sister) she would be struggling. Our apartment isn't that big cause anything bigger and idk if we'd be affording the rent, or more of our income would just be going to the rent. The apartment is an okay size for the amount of us. My mom or sister isn't interested in moving to an area where the rent would be cheaper or where we'd have more space (cause my sister isn't done with undergrad and my mom has immigration issues leading her to prefer the metro area).\n\nAside from all this, I've been living here, somewhat out of obligation and not wanting to leave them stranded. Though I do wonder if I am feeding a sort of codependent/toxic relationship. My mom is somewhat religious and any hanging out late, going out to the bars, staying out for the night is generally just frowned upon and creates this tension in the atmosphere. I hate lying about all of it but if I do engage in it I just tell her I'm going out to a friends house, we're going to go out for dinner/movie and I'll just spend the night there.\n\nI know I definitely shouldn't need to do all of this, and it's absurd that I feel the need to tiptoe around all of it when I'm 26 and am working full time and could support myself on my own if needed.\n\nNow dating. When I was away for school I felt more freedom to just explore this aspect of the world. To date guys, not be afraid to be out late, have sex, stay over if anything. Since I've been back home I feel like I've retracted back into this shell, I'm barely social with friends and have done any dating because all I can think is how will I do any of it and explain it to my mother and sister. It doesn't feel healthy to me. If anything it just makes me feel more resentful. I feel limited in my freedom and ability to live and experiment (in life and in relationships) as I want. I'm not sure what the best way to go about this is. It feels like moving out is an easy end-all to the solution but I don't think it's so realistic (with my mom's immigration/financial situation) right now because I feel like I'd be abandoning my mom emotionally/financially. I know she knows its something that bothers me cause when we've gotten into arguments she has brought up that maybe me moving out would just make me happy. I would really like to start dating but I feel like there needs to be some sort of conversation first.\n\nAny advice would be helpful. I don't need any unnecessary judgment, I judge myself enough already. I've been doing therapy through betterhelp but idk if its really been helping me to develop boundaries, and clear communication, etc.\n\n**tl;dr** I wanna start dating but don't feel comfortable cause I live at home (but probably can't move out right now cause I feel obligated to my mom cause of her situation and but her kinda conservative lifestyle has sorta made me feel limited)\n\nP.S. I'm using a throwaway account, so I wouldn't be afraid to be as detailed as necessary. I didn't re-read this, sorry if there are errors. I have posted this elsewhere, but I'm looking for all of the advice/feedback as possible.",
    "title": "I (26f) don't feel comfortable dating while living with family ADVICE",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1566867902,
    "score": 0,
    "keyword": "asian judge"
  },
  {
    "text": "Suspecting abuse and violence: did I do the right thing or how can I do better? Help me out here. I've been ruminating all yesterday and today. I am in no way trying to generalize or judge any group, merely think through a scenario and reflect on how I can improve.\n\n**Context:** I recently started in a primary care setting with thousands of patients and dozens of doctors. One of my roles is to meet with new patients in order to gather the health history and populate charts. This appointment is set for an hour and allows me to dig in really deep and ask about their health history and current issues.\n\n**The situation:** The patient I was meeting with on this day was newly pregnant \\~ 8 weeks. My first impression was that she was very quiet and seemed uncomfortable. She didn't make much eye contact and this made some sense when I learned that she was a new immigrant from a South Asian country. She didn't speak much English but I was told she could understand some. Her husband accompanied her, presented the paperwork, and did most of the speaking/translation. He spoke English quite well. I learned that he has been here for 15+ years,  that they were married 3 years ago, and she immigrated here just a few months ago. This arrangement seemed a bit strange to me, but I am unsure if this is a common practice in this population/country.\n\nAs I worked through her health history, I learned that there was NOTHING to note. This was also a bit strange to me, but again, I am not sure what health care is like in this country (I assume she was somewhat affluent there as she had a university degree). She hadn't even had a PAP and she was certainly of age. I asked several times if she ever had anything wrong with her health, she denied this (via her husband's translation). \n\nBecause there was nothing to discuss, our appointment was short. She still seemed so uncomfortable, despite me trying to build a therapeutic relationship, follow her cues, yada yada yada. So I said, \"I just notice that you seem very uncomfortable. Is something wrong? Are you feeling sick?\" Her husband translated and what I got back was that she is experiencing nausea. Okay, cool. She continued to look uncomfortable and clutch her side (her VS were stable).\n\nAs the appointment wrapped up, I set them up with an appointment for the next day as she hadn't yet had any prenatal testing and needed her nausea addressed. When they got up to leave, she finally seemed to perk up a bit and smiled for the first time. She seemed relieved to be leaving. He grabbed her coat, helped her put it on, and they were on their way.\n\n**The red flags**: Maybe you also picked up some red flags when reading that, maybe not. These are some of the things that got my spidey senses tingling:\n\n* Her degree of discomfort and lack of engagement. She seemed very withdrawn and sad.\n* The husband's omnipresence over everything (handling the paperwork, acting as a translator)\n* The whole marriage set up. I thought it was kind of strange that he has been here for 15+ years, but they only got married in the last 3 (her presumably staying in her home country for the first 3 years of the marriage)\n* I just felt weird about not being able to ask her direct questions or get direct answers. If the husband hadn't been there, I would have tried to ask her some simple yes/no questions, but the husband stayed the whole time.\n* The lack of health history (and presumably medical care). She had no vaccination record, had gotten no vaccines coming into the country.\n* The husband seemed very focused on the baby and not so much on her (the appointment was for HER health, but the only concerns raised were regarding the baby's health).\n* I spoke to the receptionist after and she had weird vibes too. She said that she didn't even come up to the desk with him to check in, the husband did everything.\n\n**What I did**: I charted my impression (without directly stating my suspicions) and spoke with the doctor face-to-face about my concerns.\n\n&#x200B;\n\nI am curious to know if anyone has had a similar experience, or if they have more knowledge of the culture of South asian countries that could clarify why the patient presented in this way? This was a very thought-provoking experience for me. I also know about how if violence does exist in a relationship, it can be worsened during pregnancy. Thank you for reading and contributing to this discussion.",
    "title": "Suspecting abuse and violence: did I do the right thing or how can I do better?",
    "subreddit": "nursing",
    "timestamp": 1556377280,
    "score": 11,
    "keyword": "asian judge"
  },
  {
    "text": "Shall I continue to study my degree？I’m 22 alrd，but got my student visa rejected in the middle of 2nd yr. Shall I apply university in other countries? Reddit friends,\nI’ve been studying my uni degree for almost two years, it’s a double degree course combined Finance&amp;film studies. I really enjoyed the studying process there&amp;work pretty well in finance units, but I cannot do well in film studies. In a result, I have a very low GPA at the end. Causes Immigration rejected of my student visa renewal. I really want to finish my degree, then I applied another uni &amp;got accepted. However I got rejected by immigration again, for some dramatic reasons.. I feel I have wasted a lot of time and very confuse about the future .\nOn the one hand, there are many ppl become successful without their university degree.  Job some ppl are doing is not related to their major as well. On the other hand, I found it is really hard to find job without a uni degree. I also feel less confident as I was, because I had a high expectation for myself but end up with a worst result.\nNow I’m thinking about studying in Singapore. &lt;Computer Science&gt; course in a private university. (SIM/UOL) The reason wanna shift my career preferences is that I have seen there is a tendency that AI will replace manually job in a large-scale, including job in financial area. Despite the rejection rate by any possible reason. Will it be a worthy trying choice for another 3 years? Any friend here studying this programme or in this uni? Can share some of thoughts about your study experience there.(how do u feel like when studying CS, the most exciting parts &amp;amp; disappointing parts. how do you feel like studying in SIM, have nice atmosphere? Professor really teaching useful things? How is the environment there, convenient transportation?) or any idea or advice to me? (I feel too old to start uni again because I’m 22 alrd..seems has less courage now &feel lot of pressures. In a typical Asian parent’s eyes, I’m a failure product alrd. I know I shouldn’t let other ppl judge my life easily, but sometimes u can feel their negativity&contempt physically, the negative atmosphere around you)",
    "title": "Shall I continue to study my degree？I’m 22 alrd，but got my student visa rejected in the middle of 2nd yr. Shall I apply university in other countries?",
    "subreddit": "careerguidance",
    "timestamp": 1575492546,
    "score": 0,
    "keyword": "asian judge"
  },
  {
    "text": "American Born Taiwanese but from my Mainland China friends, I get \"it's a shame your parents didn't teach you Mandarin\". Hello, Born and raised in US. My parents are from Taiwan. I grew up speaking Taiwanese never Mandarin. I guess it's because my parents feel more Taiwanese than Chinese. Taiwanese is how they spoke to each other and all my relatives. \n\nI grew up in New Jersey in a community where me and my family were the only Asians so my challenges growing up were mostly about being judged for being Asian by non Asians. \n\nBut being in New York, more culturally and ethnically diverse community, I feel the judgement is coming from other Asians - specifically Mainland Chinese Asians. I have really close friends that came here from Mainland China for school and  I have known for years who I see eye to eye on so many things but I will constantly get the \"it's such a shame your parents didn't teach you Mandarin\".  \n\nWith the rise of China as a power, sure learning Mandarin would have been an advantage business wise but the comment  comes off more a judgement about how I was raised.. The little digs used to bother me a lot but now it just makes me angry because as friends we should be embracing each other's unique background and experiences rather than disparaging it. And who has control over how they were raised anyway. \n\nI think it is also such a China centric thing to say - that learning Taiwanese was waste of time.  Because to Mainlanders, Taiwan is part of China so of course everyone should know Mandarin instead. They refuse to acknowledge that there are people in Taiwan that might actually think differently. Strangely, they don't have this same close mindedness when it comes to my friends that only speak Cantonese and have parents from Hong Kong. \n\nAnyone else experience this or have insight into this?",
    "title": "American Born Taiwanese but from my Mainland China friends, I get \"it's a shame your parents didn't teach you Mandarin\".",
    "subreddit": "asianamerican",
    "timestamp": 1557556750,
    "score": 51,
    "keyword": "asian judge"
  },
  {
    "text": "'Welcome to the beginning of the fascist takeover': Asian-American judge was suspended without pay for making anti-Trump comments online and in court",
    "title": "'Welcome to the beginning of the fascist takeover': Asian-American judge was suspended without pay for making anti-Trump comments online and in court",
    "subreddit": "asianamerican",
    "timestamp": 1558931458,
    "score": 41,
    "keyword": "asian judge"
  },
  {
    "text": "Harvard announces high admittance of Asian Americans as judge weighs affirmative action",
    "title": "Harvard announces high admittance of Asian Americans as judge weighs affirmative action",
    "subreddit": "asianamerican",
    "timestamp": 1554472085,
    "score": 34,
    "keyword": "asian judge"
  },
  {
    "text": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist This post was created as a response to this thread and [comment](https://www.reddit.com/r/asianamerican/comments/bvxtgs/snapshot_of_miss_india_finalists_renews_debate/epuj6hq?utm_source=share&utm_medium=web2x) discussing beauty ideals\n\nI started typing up a message then lost it. I was gonna forget about it, but it really bothered me, as I see this kind of responses ALL the time in discussions involving asian beauty ideals. and judging from the replies and votes, the thread was no exception. So im typing up this post.\n\nFor some reason, we Asians have a hard time admitting that our beauty ideals have been heavily influenced by colonialism and eurocentricism. I think it happens because we don’t like to admit how much western ideals have been ingrained into us. Even as I’m writing this, I can’t help finding larger eyes, slimmer faces, and long legs more attractive than their counterparts.\n\nOther cultures have to face the self hate stemming from Western ideals outright, because they don’t have our convenient excuse of \"pale skin was always considered beautiful in Asia!!1\" I know I've said that more than a few times before I was forced to look beauty ideals beyond skin tone.\n\nI'm going to compare a few major old vs. modern beauty ideals below. Since I’m Korean, I’ll be mentioning a lot of modern Korean ideals and referencing older Korean texts, especially from the Choson period since that was the last period before Korea was introduced to the West, but I believe they’re pretty applicable to the rest of East Asia as well.\n\n&#x200B;\n\n1. Eyes\n\nLarge, double lidded eyes is the ideal eye shape in East Asia currently. However, this was not always the case. Many people will argue that large eyes are youthful and all cultures prefer large eyes, but this is an unsubstantiated claim.\n\nThe argument becomes even more unconvincing when we look at older Asian texts. In Korea, during the Choson era (which is the latest era before Western influences entered Korea), beauty was judged according to nine factors, called \\[gu-saek (구색)\\]([https://m.blog.naver.com/PostView.nhn?blogId=noa\\_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F](https://m.blog.naver.com/PostView.nhn?blogId=noa_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F)).\n\nThe text never mentions eye size or even differentiates between double lids and monolids. The only requirement is that the \"eyes must be dark like midnight\" and that \"the eyes must be spaces appropriately.\" Other texts also mention that the contrast between the black and the white of the eyes are important, but again, never size or double-lid.\n\nSome texts even specify that (monolids with a slight slant upwards is preferred.)\\[[https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\\] This is in direct opposition to the large, double-lidded, almond eyes that are hailed as “beautiful” in Asia today.\n\n&#x200B;\n\n2. Face shape\n\nThere’s all kinds of plastic surgery in Asia focused on narrowing your face. Having a small face and head is an important part of “having good proportions.”\n\nHowever, an ideal face shape in the past was a round one, like a “full moon,” with a straight, broad forehead.\n\n&#x200B;\n\n3. Body shape\n\nCurrent beauty ideal is tall, leggy, with a short torso. People with longer torsos are considered to have worse “proportions” and there are calf reduction surgery being done to elongate our “stubby” Asian legs.\n\nHowever, in the choson period, long waists highlighting a woman’s curves was considered beautiful.\n\nFinally, we have older paintings and photos to draw upon. None of these women would be considered beautiful in Asia today. \n\n* [https://www.instiz.net/pt/4393935](https://www.instiz.net/pt/4393935)\n* [https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\n* [http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document\\_srl=13409659](http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document_srl=13409659)\n\nI'm sure there are a lot more we could discuss, but the examples above clearly show how radically East Asia has been influenced by Western ideals of beauty as much as any other cultures. It’s time for us to start confronting our self-hate of our natural, predominantly occurring asian features instead of trying to deny it.",
    "title": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist",
    "subreddit": "asianamerican",
    "timestamp": 1560845348,
    "score": 27,
    "keyword": "asian judge"
  },
  {
    "text": "The Many Sins of College Admissions: Jeannie Suk Gersen writes about the conclusion to the court ruling on Harvard University’s use of race in admissions, which alleged that the school discriminated against Asian-American applicants, from the federal judge Allison Burroughs.",
    "title": "The Many Sins of College Admissions: Jeannie Suk Gersen writes about the conclusion to the court ruling on Harvard University’s use of race in admissions, which alleged that the school discriminated against Asian-American applicants, from the federal judge Allison Burroughs.",
    "subreddit": "asianamerican",
    "timestamp": 1570552134,
    "score": 25,
    "keyword": "asian judge"
  },
  {
    "text": "Introducing Baked! The Musical – An All Asian Musical @ Chicago Musical Theatre Festival Hello friends!\n\nFor the last several years, my good friend and co-writer Jordan Liu and I have been writing a musical that features an **all Asian cast!** I'm really happy to share that it was recently accepted to the Chicago Musical Theatre Festival, where it was selected by a panel of judges out of over 50 submissions to get a THREE WEEK RUN at the Edge Theatre in Chicago!\n\nThe themes in the story are inspired by our experiences growing up as first-gen Asian American immigrants. It's a story about family, friendship, failure, and the question of what we owe the people we love. We think it's a story a lot of you will really enjoy, especially in this slice of reddit :)\n\nWe're currently fundraising, because putting on a musical is apparently really expensive. Go figure. If you're able to throw a little money our way to support the CMTF production, we'd super duper appreciate it: [https://igg.me/at/bakedcmtf](https://l.facebook.com/l.php?u=https%3A%2F%2Figg.me%2Fat%2Fbakedcmtf%3Ffbclid%3DIwAR1cmlVDqkEoQOJ75EZ30LJ3YZbxbGW42P5wttAPgiuovqBbY3jOgr8fjxE&h=AT2tdyqeKmZyet26hnKdMnuerwK4yOrtPyvib1BWKmKapCxG6xEo39-K-WXGI0k5w7D5V_loRuI4GfTeNGWUkGB_tOQyVqFfCxq9Z1W0kFQk8P2wq6ElaJWba76UDBsNST91HSr2cPLwLn3DqsreF15A)\n\nEven if you can't, that's totally okay! We hope that those of you in the area will consider checking out the show when it premieres at the Edge Theatre in Chicago next February. Please reach out to me if you're interested in learning more about the project – we love talking about this show.\n\nThanks for carving out this little space on the Internet. It's really awesome.\n\nCheers,\n\nDeepak",
    "title": "Introducing Baked! The Musical – An All Asian Musical @ Chicago Musical Theatre Festival",
    "subreddit": "asianamerican",
    "timestamp": 1569269335,
    "score": 9,
    "keyword": "asian judge"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 126,
    "keyword": "asian judge"
  },
  {
    "text": "Asian Students lose Harvard Affirmative actions lawsuit--affirmative action is legal and so likely also legal to 'discriminate against men' [Federal Judge Rules Against Asian Students In Harvard Race-Based Admissions Trial](https://www.dailycaller.com/2019/10/01/harvard-affirmative-action-ruling/)\n\naddendum on 2019/10/04:\n[Harvard Affirmative Action Case Will Go to SUPREME COURT](https://www.youtube.com/watch?v=X-oudkDw2SI)",
    "title": "Asian Students lose Harvard Affirmative actions lawsuit--affirmative action is legal and so likely also legal to 'discriminate against men'",
    "subreddit": "MensRights",
    "timestamp": 1570071287,
    "score": 101,
    "keyword": "asian judge"
  },
  {
    "text": "Is this some kind of \"hypergamy culture\" or just my imagination? Hi Men's Rights:\n\nSo I've been musing on something tonight. I'm 32 years old and single (by choice.) I've never really had an American girlfriend, or Western girlfriend for that matter. I've dated Brazilian, East European, and Southeast Asian women among other ethnicities. Even back in university, in the states, it was the foreign exchange students who were interested in me and vice versa. I'm usually invisible to American women. But I don't care so much because it's not like I have a lack of options, and besides I'm much more attracted to exotic women with accents etc so... no complaints with my love life.\n\nSo I'm back to living out of a backpack and traveling around the world. Here's what I've noticed: wherever I go, hanging out in hostels, it's always the shorter stature guys like me or shorter (I'm 5'8-5'9) who are single OR have non-Western girlfriends with them. So if I see a guy who looks like me, \\[is American or Western\\] and he's with his girlfriend, it's always like \"this is Yuko from Japan\" or something. But every time I see some pretty Aussie, English or American girl, her boyfriend is ALWAYS some huge guy... 6'3, 6'4, with a pretty face, and either really masculine looking OR completely immasculated and she's bossing him around constantly. Both dynamics I find a bit odd.\n\nI don't think I've ever seen a Western couple where the guy wasn't hitting all those criteria. Otherwise, the pretty Western women are single. So, it's either they're with that X-perfect guy, or no guy at all. Most often, they're by themselves or with girlfriends, but I've never seen a Western woman with a guy who looks even similar to me. And that's really an observation from years of traveling.\n\nDoes this mean I am being \"weeded out\" of Western rampant hypergamy, or is it my imagination? Is the fact foreign women don't seem to care evidence that it's Western culture promoting this to an extreme level and resulting in this phenomenon? Basically, in my experience, including my failed days trying to be a kind of pickup artist back in the states, fellow American women are open to talk to me or become friends but very closed off romantically. With foreign women, things turn romantic quite naturally and it happens more often than not and doesn't even require a lot of thought. It's a bit like, eh, I'm being hardcore judged by fellow Westerners and being systematically weeded for not being a pretty enough, tall enough bloke.\n\n(I might add, given I've dated some really beautiful women in my life, the fact Western women immediately rule me out means I feel bad for those \"alpha males\" who get stuck with the Americans while I get the better girls!!)\n\nIs this just me going crazy or is this a real thing?",
    "title": "Is this some kind of \"hypergamy culture\" or just my imagination?",
    "subreddit": "MensRights",
    "timestamp": 1552677502,
    "score": 25,
    "keyword": "asian judge"
  }
]