[
  {
    "text": "From a student: wtf is WRONG with admin? UPTATe: a different person from admin emailed my parents and me so we could have a sit down about the administrators (and my subsequent) actions. We can decide if the original admin attends this meeting. I think they’re doing damage control. \n\nRecently almost all the copiers in the school broke except for two. One of my favorite teachers said she’d give me extra credit + community service hours if I helped her after school by going from her class to the copier 3 floors down and across the school. \n\nApparently I’m really good at blending into the walls because one of our three vice principals walked in and started having a conversation that I clearly wasn’t meant to hear. Apparently Ms. L had kicked a student out of her class that day. Why? Because he kept calling Asian people orientals. According to the admin, she shouldn’t have kicked him out because this was a “teachable moment” for him and she was “hindering his education” \n\nI’m half Asian, and I also know this kid. He’s a year below me, super good at sports, and around thanksgiving asked me if I was going to be eating  dog. It’s clear he does it to get attention, and one day I hope that attention comes in the form of a kick to the nuts. \n\nMs. L explained how his behavior was hindering the other students in the classes education and ability to feel safe at school and that she doesn’t tolerate racism in her class, but after trying several times he wouldn’t stop, so she made him leave. At this point I’m full on watching their conversation and I would have thought he just didn’t care I was there, except for what he said next. \n\nAccording to Mr. Admin, oriental might not be a polite term, but it isn’t really a “bad word” or slur, it’s just a bit outdated. And yeah, oriental used to be perfectly fine to use and some people today argue that it still is. But oriental is also a term used to group a ton of ethnicities into one little term so white people didn’t have to bother learning. It’s also a word that historically was used in order to promote racism against Asians. \n\nI decided to voice these arguments with a loud “The fuck you just say?!” \n\nI now have a meeting with this admin to discuss the disciplinary actions that I get, while this kid gets away scot free. Ironically we have a “discrimination hotline” so maybe I should call this in.",
    "title": "From a student: wtf is WRONG with admin?",
    "subreddit": "Teachers",
    "timestamp": 1675236068,
    "score": 678,
    "keyword": "asian principal"
  },
  {
    "text": "Wrangling Chatty Cathys Hey guys, I really need some help.\n\nI've been on this sub for a while, just trying to engage with teachers, and also learn some.\n\nI've been in education for a while, but 6 years as a para, and now I'm a sub teacher.\n\nI've finished my MAT and credentialing program, but haven't cleared the TPA's.\n\nI'm struggling with classroom management.\n\nI'm good at directing a group of up to 10.  Not that difficult.  However, I'm consistently loosing people at the 20+ mark.\n\nLike, literally within a minute or two of one call to listen, the kids are back to ignoring me or the video or etc.  It's not totally consistent.  Even at the same school, I'll have some classes where I'm able to go the whole lesson without issue, but then other classes I can't seem to maintain attention at all.\n\nWhen I've asked advisors and experienced teachers for advice, I get conflicting responses.\n\n\"You're too nice.  You jump to help too quickly, and you don't nip problems in the butt at the start.  Kids start talking to each other because you aren't pulling them back enough.\"  Even at the same discussion, another teacher will say, \"You're too demanding and condescending.  Don't be petty and ask for quiet so much.\"\n\nCan someone help me reconcile these?\n\nPart of my issue is my background.  I'm white and American, but I didn't grow up here.  I grew up in a South East Asian context.  Many of the axioms/attitudes of American education are very foreign to me, despite my time as a para.  One of these is the idea that students can talk to each other during direct instruction/a video.  That wasn't allowed... at all at my school.  You'd get sent to principal for 3 vocal/noisy disruptions.  Using the restroom/sharpening your pencil/whispering to your table partner during lecture were all infractions that were penalized.  That was my life k-5th grade.  I was homeschooled/in american schools for middle school, and high school rest of the time was very similar to elementary.\n\nI was in college and still asked the professor at the break in the middle of class if I could use the restroom.  I didn't realize I didn't have to ask.\n\nMy teachers never had to \"buy\" or \"earn\" my respect or attention.  The entire community enforced that teachers were to be held on high.\n\nI'm not saying this is the right way, I actually think there are significant flaws.\n\nBut I've got alot of my own hangups.  I struggle especially with early primary and middle school students.  3-6th seem to be fine.  But I struggle consistently with 1, 2, 7, and 8.  I cannot seem to hold their attention.  I feel like every 2-3 minutes I'm calling loudly for them to be quiet.  I don't even ask that they be silent, as in no talking.  I ask that they be quiet.  Like, whispering or just a bit louder.  Not so loud that I can hear them across the room.\n\nLong post, I know.\n\nBut I'm struggling.  How can I hold their attention long enough to present the lessons?  I don't even know what parts of the lessons are engaging to them because.... it doesn't seem any of it is.  I'm not learning what parts of the lessons went well/poorly.",
    "title": "Wrangling Chatty Cathys",
    "subreddit": "Teachers",
    "timestamp": 1673584727,
    "score": 0,
    "keyword": "asian principal"
  },
  {
    "text": "Is early start times a petty reason to leave an otherwise fantastic school? I'm a first-year teacher and ever since the first day of the Spring semester, every time I wake up I've had thoughts of moving schools, literally every morning.\n\nThis is a school I picked mostly because they were the only school I applied to that accepted me, and I am grateful for the opportunity. I've come to really enjoy being at this school, and it has a lot of positives you couldn't get in many other schools.\n\nThe best parts about the school is:\n\n1. Great admin team who actually sides with teachers before students. The principal himself helped me out of some sticky situations with some students, even listening to my request to split 2 boys away from the same period and into different periods.\n2. Great coworkers who are all pleasant to work with\n3. Fantastic diversity. There is a very healthy mix of white, black, hispanic, and asian students. About a 50/10/20/20 split. No other school in the state has ratios like this school.\n4. Insanely early release. Students leave at 1:45 and teachers are allowed to go home at 2:15.\n\nHowever, I just can't deal with the early start times. Classes start at 7:00 but teachers are obligated to arrive at 6:35. Add in commute time and I have to wake up a little before 6 just to get everything ready and arrive at 6:35.\n\nI've never been a morning person and I don't think I ever will be. I've tried going to sleep at 9 and my body just doesn't go to sleep. Even if I somehow manage, I still wake up tired. I really do love every other aspect about the school but I can't lie to myself; waking up at 6 every morning is mentally killing me.\n\nDo you think leaving schools only because of the start time is a good enough reason? Should I try to tough it out? If this was your predicament, what would you do?",
    "title": "Is early start times a petty reason to leave an otherwise fantastic school?",
    "subreddit": "Teachers",
    "timestamp": 1682865730,
    "score": 1,
    "keyword": "asian principal"
  },
  {
    "text": "My thoughts on Female-only wagons Some countries like India, Japan, and Brazil have wagons exclusive for women. That means only women are legally allowed to enter. If you're a man and enter a Female-only wagon, you're charged for a crime and receive punishments. The countries have different punishments, and a video shows a man in India being slapped all the way out and forced to do squats in public with the hands on his ears by an apparent female cop. https://youtu.be/ggWy50I9et8\n(I couldn't find the neat video, so this link is a report on it. This report had even the guts to defend the law and authorities who did this. Not even if you're caught stealing it's considered right to do this. He received that punishment for being a man). In India, there are not only entire trains dedicated to women, but they also have bus seats reserved to them, among many other things, not to mention the \"women-only\" facilities. I was surprised to see that a bunch of MRAs agreed or sympathized with these laws. So I've decided many years later to make this post telling my thoughts about it. One of the reasons they (MRAs) defended those laws was due to Japan's and India's massive number of passengers, making it nearly impossible to identify abuse. However, we have to understand that there aren't wagons reserved for men like male and female restrooms. Those facilities are reserved for women, and we don't have a similar thing for men. That is, women have the option to opt for the cars, trains, seats, and facilities that are available for everyone or the ones available only for women, while men don't have a similar option. This is practically a manifestation of the thought that women are pure, innocent, and/or victims. This contradiction (the lack of choice for men and women being free to choose) is important for us to comprehend the nature of the discussion, rather than thinking we're being \"equaly\" split (like men and women are commonly match with same-sex roommates, cellmate, etc. or the existente of male and female restrooms, in this case, the discussion takes other parameters. And I'm not saying that it's \"equal\", since women inmates receive better treatment in prison than men does and female restrooms are sometimes better built or has better care than male ones do.) That's why I believe those are just one more female privilege.\nhttps://at.tumblr.com/batatafrita1936/710237251503800320/53jq9jlh9awb\n\nSo, as feminists obviously turn every issue that majorly affects men into a consequence of social cheuverism, sexism against women or other terms, that case would be no different even as you're surprised for common sense saying it's completely absurd. Feminists groups basically split into two positions; those who advocate for female-only wagon as it'd be a need since men represents a danger to women in the train; and the other feminist group that don't accept Female-only wagon as they define it as \"women segregation\".\nIf you're asking yourself how feminists still think it's segregating women by giving them a place only they can access and prevent men from entering it, \"feminism\" is the only answer I can possibly give you.\nIf you have to teach a young boy, \"That train, you're not allowed to go there.\"But why, Daddy?\" \"Only women are allowed in there\" I don't think that's exactly \"segregating women\" as they (women) can legally go anywhere men are (except those who have a similar place for them, where men also cannot go like separated male and female restrooms) and are socially accepted to do so. But that's just an inequality society pretends not to see and they would label it childish if you complain that as a teenager (greetings from a teenager boy who just turned 18 and is forced into the military).\nAnd for the other group of feminists who points out (sometimes biased) numbers of women being abused on the train, or posting on tweeter news that they found a man spying under women's skirt using a camera, I have an answer that will even churn up many MRAs. Yes, I'm very sorry for this, but sometimes, reason has to overcome feelings. My answer to this group would be \"f*** them, it's their problem.\" Honestly, if you're angry about that, congratulations, you just committed a double-standard. If you think a male abusing woman or a male spying women's underwear are a reason to prevent men from entering a place, why don't you prevent black people from entering places as they're the majority of the accused and the majority of inmates in several places of the world? Black people are obviously victims of the social system. That's why they're often targeted as offenders (for instance, everyone knows police tend to target black people more). Men, however, have different views towards them. The reason for that is that we don't simply let aside all moral and ethical principles when it comes to black people. For men, however, society doesn't care about moral principal since they're not considered human to begin with. In some places of the world, a woman is arrested for sexually abusing a dog but can legally rape a man without committing any crime. If a black, asian, christian, or muslim person pulls a gun in the supermarket, it'll never be a reason to prevent that religion or race from entering that place or beginning the new apartheid. I come to the conclusion that every argument feminist or female only facilities advocates make is simply justifying the unjustifiable. And that women only facilities should not exist regardless of the conditions as it's against all equalities principles and moral principles (which are useless when the ones damaged are males) and nothing can justify such vileness.\nPlease share your thoughts or any other additional information you have.",
    "title": "My thoughts on Female-only wagons",
    "subreddit": "MensRights",
    "timestamp": 1677349689,
    "score": 5,
    "keyword": "asian principal"
  }
]