[
  {
    "text": "Thank you to the officer who helped me out today. I (21F) finally had the courage to talk about being raped. I had been very depressed for a while and couldn't understand myself until I recently processed this with my BF (21M), who asked me if I felt unsafe and if I wanted to go to my local police station. I wasn't looking to ruin my rapist's life but I wanted to see what options I had to ensure the safety of myself and my family. \n\nThe police officer who greeted me was a tough East Asian guy (I'm also East Asian) and really emphathized with my situation (he understood why I couldn't tell my parents). It made me feel very heard and very validated for once as I tend to get very anxious in general. Even though I am unable to press charges (this happened a while ago and I never went to the doctor to get it examined), I do feel as though I can move on with my life with a bit more ease. \n\nI've had a lot of mistrust in the past when talking to adults (I was bullied in high school and the vice principal I spoke to made me feel like it was my fault) when I faced problems in the past, but I felt very safe and supported. I wish more people in the world (especially in a very traditional East Asian community) were this kind.",
    "title": "Thank you to the officer who helped me out today.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1565623129,
    "score": 188,
    "keyword": "asian principal"
  },
  {
    "text": "This is what supportive admin is like?! At my school we have a high population of Chaldean families. I’m used to high Hispanic and Asian populations but this is a new experience for me. We have a parent support person who is also Chaldean to help with translation and to help us get across what we want to the parents since some parents may speak English, and act like they understand us, but they really don’t. \n\nAnyway, I have a student who is showing signs of just outright defiance. I teach first grade and want to try and nip these ASAP not only for myself but for his future teachers. He’ll argue about things I ask him to do or not do, he’ll argue or question when I do seat checks on the carpet, tell me “but it’s not bad!” Or “but it’s just fake!” When he continuously bothers a kid who has asked him multiple times to stop. He also won’t complete his work unless I’m standing there watching him.... but he’s capable. I’ve tried positive reinforcement, consequences, more brain breaks, etc. You get the idea. We all know those kids. \n\nI had a brief conversation about him with our parent support person yesterday and went to see her during one of my prep times. She called his mom right then and there and flat out told her how unacceptable this is. Not only that, she TOLD HER how she is going to handle this in terms of at home consequences. I know you’re probably thinking that that’s over stepping, but 1) it’s their culture to be this firm and direct, and 2) mom has said in the past that she doesn’t know what to do with him because his older siblings are very different from him and well behaved. Not only that, she also mentioned if he doesn’t get it together, our principal will be calling because she takes this stuff seriously. \n\nI was in shock. At my last school I would’ve had to deal with it alone. It’s a good feeling to feel supported, and not questioned when I say a behavior needs to be dealt with outside of the classroom as well.",
    "title": "This is what supportive admin is like?!",
    "subreddit": "Teachers",
    "timestamp": 1568778192,
    "score": 23,
    "keyword": "asian principal"
  },
  {
    "text": "25 years ago, 14-year-old Jenny Lin was murdered in her own home. No killer has been named to this day. **TL;DR:** On May 27, 1994, two days after her 14th birthday, Jenny Lin had come home from school, talked on the phone with a friend until 5:15pm, and then been murdered shortly afterwards. At around 6:45pm, John Lin returned from work to find his daughter partially naked and repeatedly stabbed in their second floor bathroom. She was dead, and the killer hasn't been found since.\n\n**NOTE:** I [wrote more](https://www.reddit.com/r/UnresolvedMysteries/comments/btlc9a/25_years_ago_someone_fatally_stabbed_14yearold/) about the actual facts of the case and the murder in /r/UnresolvedMysteries, however for this post I'd like to focus more on Jenny herself as well as her family.\n\nI don't know about you guys, but I've found that there aren't very many unresolved murders involving Asian-Americans. So I took a special interest yesterday when I saw [this tweet](https://twitter.com/henrykleeKTVU/status/1132123234898305026).\n\nAccording to the [About Jenny](https://jennylinfoundation.org/about-us/about-jenny/) page on the Jenny Lin Foundation site (more on that later), Jenny was a bright young lady with lots of potential. She was born in Castro Valley, California; started dance lessons at age 3 and continued until she was 12; did piano for 8 years; and played the viola starting in grade 6, doing so well that by eighth grade she had become the sole and principal violist of the middle school orchestra, been invited to play in the Castro Valley Chamber Orchestra, and won a few awards. She also apparently loved school, especially math, reading and writing, and had been planning to attend U.C. Berkeley’s Academic Talent Development Program to study marine biology. And like all us other growing Asian-Americans preteens, she had her own personal interests in music (\"Phantom of the Opera\" and U2), fashion (she was fascinated with her older sister's clothes), extracurriculars (running and playing tennis), and hanging out with friends.\n\nAs for her family, [this paragraph from one of the articles I've read](http://www.sddt.com/News/article.cfm?SourceCode=19980929cg) sticks out to me:\n\n>The Lin home was on top of a hill, at the end of a quiet street. It's a neighborhood with little foot traffic. There's no reason to be there unless you live there or know someone who does.\n>\n>Five years ago, that home was at the heart of the Lins' American Dream. The Lins were successful professionals, their two daughters pretty and bright.\n>\n>Jenny was a straight-A student with a dazzling smile who liked the band U2. A musician herself, she played both the piano and the viola.\n>\n>\"As I sit on my front porch looking out I feel totally safe and free,\" she wrote once in a poem she titled \"Sunset.\" \"It is a strange feeling. It's just my head gets light and my whole body gets a warm chill.\"\n>\n>Her mother remembers those days, carefully choosing the words to describe them.\n>\n>\"Everything in our lives was like heaven. We used to ask each other, 'I wonder what we did in a past life to deserve such happiness?'\" Mrs. Lin said. \"Then all of the sudden it dropped from heaven to hell.\"\n\nThe Jenny Lin Foundation is a foundation that her parents started in her honour. The foundation sponsors several music and safety events in the East Bay area, including a free annual youth music camp and concert and scholarships for young musicians.\n\nEvery year since Jenny died, her parents have also held a memorial service and walk in her memory, in hopes of generating information that will help investigators identify and arrest Jenny's killer, who has never been officially found. From [this article posted a few days ago](http://www.ktvu.com/news/renewed-hope-that-dna-advances-will-solve-jenny-lin-case-as-family-holds-vigil-25-years-later):\n\n>On Friday night, the Lins held their annual event at the Castro Valley library.\n>\n>They say they believe it's only a matter of time before they get justice for Jenny.\n>\n>Young musicians performed during the memorial service.\n>\n>The Lins say through them, they find hope amidst the pain of losing their daughter who loved playing the viola. 　\n>\n>Mei-Lian Lin describes her emotions, \"Disappointment, frustration, desparate.\"\n>\n>Jenny was killed two days after turning 14-years-old.  \n>\n>\"Ever since then, every day is torture for us,\" says John Lin, Jenny's father.\n>\n>[...]\n>\n>Among those at the memorial was a classmate and friend of Jenny's. 39-year-old Yen Truong is now a mother of two.\n>\n>\"I think of her parents and the years they lost with her,\" says Truong.\n>\n>Jenny's parents have moved to Southern California, but they return every year to hold a memorial service.\n>\n>\"I made a promise to Jenny at Jenny's grave that I vow to solve this case for her no matter what it takes,\" says John Lin.\n\nI don't know Jenny or the Lin family personally, but I do feel especially sad after reading all of this. I am glad that some small good (i.e., the Jenny Lin Foundation) came out of such an incident, but it's heartbreaking that something so dark and awful occurred at all. I hope that Jenny and her family eventually find peace.",
    "title": "25 years ago, 14-year-old Jenny Lin was murdered in her own home. No killer has been named to this day.",
    "subreddit": "asianamerican",
    "timestamp": 1559007414,
    "score": 244,
    "keyword": "asian principal"
  }
]