[
  {
    "text": "Recent job rejection received, being an Asain woman was accused lacking confidence Hello all, this is actually my first time posting here, just wanna get some opinions here. Recently I received a job application, the email is attached in the post. I'll briefly introduce the background, basically, this is a local UK company, consulting, small size(50ish people), not diversity (all employees are white, 90% are men). I'm an Asain female, recent graduate, with a relevant degree, qualifications, and based on what they said, an amazing resume. In the first few interviews, they seem very nice, very keen to hire someone. I just went my last interview on Friday last week, it was a coffee interview, not very formal. I was being very honest, calm, and showed my professionalist and confidence. Today I got this rejection. I honestly feel quite insulting, I was trying to build a connection with the person at the meeting but it has to happen from both ends, and they have accused me failed their effort. What I feel is that the truth is they are just not used to receive a calm honest and confident Asian woman, and they don't know how to interpret it. \n\nThe whole fact I just realized now is that the people they have and people they are looking for are always white men, who were growing in a space where society just encourages them to always bragging about themselves, showing off, and talk about themselves all the time. I'm not that kind of person and I don't want to be like that. The whole thing for me is that I showed my confidence but if they don't feel comfortable because they don't use to diversity. If it's because I'm lacking some specific experience or practical shortage I'm totally fine to get rejected but this just doesn't make sense to me. I don't know what's their standard but they can't judge me based on white men's level, that was not fair. \n\nI'm jusy very down like honestly everytime I thought something good will happen it just won't, and I don't know how to deal with it, now I feel like this kind of rejection really hurts my confidence. I just kept questioning myself is it really my fault? I used to believe I'm good at communicating and every feedback I received were saying i'm fun, confident and nice to get along. I didn't understand where did this go wrong...Feel I might need some help here.",
    "title": "Recent job rejection received, being an Asain woman was accused lacking confidence",
    "subreddit": "jobs",
    "timestamp": 1627429255,
    "score": 5,
    "keyword": "asian judge"
  },
  {
    "text": "I don't think people have a grasp on how bad it is to be a girl. I'm not saying being a girl is bad, but sometimes I'd rather not be. And I guess this post is to just to vent it out.\n\nI was walking the lady's kids to the bus stop when it hit me. Being a girl sucks. \n\nI've been alive for 18 years and I feel like quitting. So much is expected from us. So many things we're *supposed to do* as a girl.\n\nNot to mention how bad growing up as a girl is. My mother constantly reminded me that there are people who will *FUCKING RAPE YOU* if *YOU* aren't careful.  \"Boys get sexual assaulted too!\" Yes, yes I know. But not to the extent for females. 1 in every 3 or 1 in every 6 girls have been assaulted in some sexual way. As infants, as toddlers, and teens, as grown women.\n\nAnd you know what???\n\nI'm one of those 1 and every 3. I was 7, fucking 7. By who? My own family. \"Don't wear skimpy clothes\", \"stop giving signals\", \"stop acting like a slut\", excuses by men and traitorous women. Trying to *JUSTIFY* why it's mine, your, our fault we were hurt. Wtf is going on?!\n\nThis is the first time I came out about it in a public platform. Why did it take so long? I don't know. That is the problem, we're afraid. I was afraid. But I guess I don't care anymore. I won't stay stuck on it. Those two teens became men with families. They have daughters who they love and cherish. But they know what they did. And I hope they remember it each time they see my face. I hope they remember how disgusting they were. They might've even thought I forgot about it. But I didn't. \n\nI hate my past, but I hate my future even more. All this toxic \"if you're my girlfriend, I *own* you.\" These young teen boys who are feeding and being fed this fantasy that girls are to be kept, to be owned. No. I want to be with you, not *for you*. These poor Asian women who are labeled as submissive house wives and child like. Black women labeled as side girls and hoes. Hispanic women being labeled as aggressive and bitches. No, no, no, no. Wtf is happening?!\n\nDon't even get me started on the Pink Tax. I'm not going to pay $4 more for a pink razor! I don't want want to spend $100 a year for pads and tampons. I don't want your targeted ads. I DONT WANT YOU TO PROFIT OFF MY GENDER!!!\n\nI'm tired of girls judging others girls for not *fixing themselves up.* Some girls wear what they wear because of past experiences. Why don't wear makeup? Because I don't want attention. Throughout highschool, my fellow peers have looked at me like I'm meat on display. I've been catcalled. I've been ass tapped and was told by him \"sorry, I didn't mean to!\" MOTHERFUCKER you're a like a foot taller than me! And you tagged my ass? Do you know how far down you have to go to make that possible? The waist, fine. The shoulder, fine. But my ass?! No, you know what you did. I know what you did. And I wasn't the only one, the week after another boy did the same *accident*. I wish I had the strength and fire she had, she called him out. When the gym teacher asked if she could forgive him, \"fuck no!\" I wish I had that strength.\n\nShit like this is why I wear baggy clothes, so I don't get that attention. So no one will see *what my mama gave me*. Don't judge a girl for looking the way she does. Don't judge her for wearing makeup or lack of. I degrade myself so I won't be treated like meat. When I dress up, it's not for you. It's. For. Me.\n\nI'm going to stop before it gets too long.\n\nIf anyone reads this, thank you. Thank you so much. I can't vent an essay to my friends, but reddit is a little different.\n\nAnyways, sorry for bad formatting and grammar.\n\nThank you,\n\nSam ʕ·ᴥ·ʔ",
    "title": "I don't think people have a grasp on how bad it is to be a girl.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1620135204,
    "score": 855,
    "keyword": "asian judge"
  },
  {
    "text": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us? It kinda hurts a bit. I'm already an awkward kinda person, and I do know stats say black women and Asian men are the least desirable in the dating world. But it's like, a punch in the face when there's black men out there who refuses to even consider someone looking like you, while in the same breath want to be treated fairly, not judged and have their skin color not be an issue to the world.\n\nAnd then there's the colorism in it. \"I only go for light skinned girls/mixed.\" Everyone has preferences, but this is on par with racists who particularly don't date a specific race because [bigoted racist reason] if not worse because like.... These dudes *know* the struggle of being discriminated on and are actively doing it.\n\nI guess it's something that's been bothering me and I dunno how much it gets discussed. It just makes me feel ugly because I haven't done anything yet, black men already cross me and many women off just based off stereotypes. So much shit gets thrown in about us just by appearance alone without even saying a hi.\n\nNot quite the same, but it made me think of when I was inpatient at a hospital. Young gay black man assumed all this stuff about me just due to my appearance (dunno how because we all look beat up coming into the hospital at all times in the day) and when he actually got to know me, whole new opinion. Thought I was loud, \"ghetto\" etc while uh, I wasn't? But I know he wouldn't like it if people assumed he was in a gang, drug dealer, and likes to watch grab dicks for fun. It's a real slap in the face. But, it's nothing new for me and many other black women out there.",
    "title": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625608005,
    "score": 136,
    "keyword": "asian judge"
  },
  {
    "text": "I just want to wear cute clothing without having weird comments about it I’m 14, so i don’t have my own job rn, so i can’t but my own stuff yet.\n\nYes ik this is probably such a small problem but, i just want to wear cute cardigans with sheep on it, or one where it has a duck and her family with hearts on it, and not be called childish or “asian-obsessed” by my own mother because half of the models are either asian or the style is based off some japanese characters.\n\nI also get the weird comments about how i’ll attract p*dos or creeps in general because the way i dress, to which i can say i’ll attract too many sick people to count just from me being in my lumberjack outfit that shows nothing and doesn’t really show my body shape. so no. it’s not clothing that’s the problem it’s creeps thinking they’re entitled to a minors time.\n\nI just wish i could have more freedom with clothes even if my style goes to medium crop tops to old lady clothing, i just wanna be less paranoid i’ll be judged by my family..\n\nsorry for this kinda weird rant. hope you all stay safe.",
    "title": "I just want to wear cute clothing without having weird comments about it",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1609981122,
    "score": 11,
    "keyword": "asian judge"
  },
  {
    "text": "Opinions On Ethnic Women Having Blonde Hair So, here's the situation. I recently dyed my hair blonde, and it took a lot for me to muster up the courage to not care about having blonde hair as an Asian-American. Of course, you see a bunch of Asian American women with a blonde balayage, and they look amazing with it. I have had light brown hair for over a year, and I just really felt inclined to switch it up late last year because I needed a fresh new start (things ended badly with the guy I was dating). I thought going blonde would help me feel more confident, but instead it makes me feel so weird about myself in public (especially when I am hanging out with my white friends). I have this perception that people think I am trying to be something I am not (\"act white\") and that as an Asian American, I should stick to the darker hair colors. I know that so many non-white women can rock the blonde hair (I was inspired by yanyanchan on IG) and that wanting to be blonde does not stem from a desire to look Caucasian. The blonde color is just pretty (especially when you wear so much black clothing) and can spice up your hair.\n\nI was just wondering what everyone's views are on this. Have any of you guys regretted going blonde or felt weird about being a blonde when you aren't white? I spent hundreds of dollars to go blonde, and now that I am, I feel like I should just go back to the salon and dye it brown/black again. I hate that I feel like this, but I've spent way too much time thinking about my hair. Even though my hair looks great and that I still think I look pretty, I just feel weirdly judged when I see people look at me in public.",
    "title": "Opinions On Ethnic Women Having Blonde Hair",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613283524,
    "score": 13,
    "keyword": "asian judge"
  },
  {
    "text": "Saw the one and only black female obgyn in the area - and it didn’t go well Little background bout me - I’m 22 years old, and pretty anti western medicine to begin with. I’m also pro-choice and needed someone to talk to about BC options for me. Had a bad experience with white male docs last summer and I wasn’t trying to subject myself to that again.\n\nI don’t want to get too deep into it, but basically I live in a very predominantly white + Asian area (bay area CA) and needed to see an obgyn. I searched all over the internet to find this woman, and I guessed judged a book by its cover.\n\nWent in last week and the first thing I saw in the office were mommy magazines and tiny figurines of what I assume was the birth of baby Jesus on the front desk. I should’ve known from that point that I didn’t need to be there. 😅 When she saw me it was like the nice act immediately dropped once it was clear I wasn’t looking to have a baby anytime soon. She was very cold and matter of fact with me, and wasn’t very welcoming or understanding. Didn’t show any compassion when I told her my story. I even tried to hint at how hard it is to find the right doctor as a black woman and she didn’t really pick up on that. She did my Pap smear (didn’t warn me about the discomfort either) and then had her nurse tell me days later I had BV and needed to pick up a prescription that has since been giving me terrible nausea. \n\nNow I know not all black women are the same, and that maybe I shouldn’t have expected a grandmotherly experience just because we share skin color. But I just feel like given the context of this past year alone, the statistics around black women and reproductive health, and the fact that she’s the only black female obgyn in the area.... like am I wrong to have wanted a little more warmth from her?? I’m very disappointed and honestly have had better experiences at my local underfunded planned parenthood 🥴",
    "title": "Saw the one and only black female obgyn in the area - and it didn’t go well",
    "subreddit": "blackladies",
    "timestamp": 1610492714,
    "score": 59,
    "keyword": "asian judge"
  },
  {
    "text": "Attorney Tana Lin is now the first Asian American U.S. judge in Washington state",
    "title": "Attorney Tana Lin is now the first Asian American U.S. judge in Washington state",
    "subreddit": "asianamerican",
    "timestamp": 1635004114,
    "score": 175,
    "keyword": "asian judge"
  },
  {
    "text": "My Vietnamese family has become extremely hostile towards me, and I'm not really sure what did it. Can you guys give me any input? I'd really really appreciate it. *wall of text warning* I'm not really sure where else to post this, so forgive me if this board isn't the correct one for it.  I'm just genuinely curious what happened and hoping that those with experience with asian cultures can give me input.  \n\nI was born and raised in Brooklyn, I grew up working class in a black neighborhood, my parents were Vietnamese.  My upbringing was rough, but believe it or not I'm adaptable and thrived, it was fine., I loved it.  I was actually very popular growing up, even amongst the hood goons (not bragging, part of the story)\n\nWe were close to my family growing up in Pennsylvania and would visit quite often and they were very caring and loving towards me growing up.  \n\nThen 2019/2020 came along, which were very hard years in my life.  \n\nMy mom had a stroke in mid 2019 and I had to have her placed into a good care facility in PA which costs a large chunk of my salary every month (also NYC facilities are trash unless you can afford 30k a month), but my siblings all chip in and she can stay there for as long as she needs.  My dad died in mid 2019, pre-covid, he had a bunch of health conditions that finally caught up to him.  So more or less, my parents are effectively gone in terms of being in the picture.  \n\nSo when my dad died, my family was still nice and supportive.  And when my mom was placed into the nice home, they would come and visit.  \n\nCue the Trump election / Covid mess.  My family went extreme right wing and became covid deniers.  \n\nI came to PA and stayed with an aunt to quarantine before seeing my mom.  She refused to wear masks, did not let me leave the house without touching me, and telling me I was a communist for listening to the racist left wing media.  I was able to avoid her for the 14 days of quarantine, and the day before I left to go see my mom they threw a party and everyone touches me and calls me a dumbass for believing in democrats, etc.  \n\nAfter that, I couldn't visit my mom (who they have quit talking to and quit visiting), and I went back to NYC to quarantine.  That was a year ago, they haven't spoken to me since.  \n\nMy cousins and other family that are still sane, told me that they've been complaining about me being cheap, abandoning family, hanging out with blacks and being brainwashed by BLM, and that I should not be welcome around a family that knows their place in society and works for money instead of taking handouts.  They repeat the phrase about me being cheap daily.  \n\nI don't know where this came from, and I'm wondering if anyone else had the same experience. \n\nI worked hard to get a decent career, that is pretty stressful and annoying.  I'm not rich, I still live in a hood area because I'm used to it.  And I don't know exactly what cheap means.  I have alot of black friends due to where I grew up, but I'm not brainwashed, I judge people based on their character.  I don't know how I abandoned my family, when they were the ones that told me more or less I wasn't welcome.  And I don't really take any handouts, considering I was lucky enough to work remotely during the pandemic.  \n\nI can't even visit my family anymore, the second I walk in the door its silent treatment or nagging about being abandoning family, but with no concrete evidence as to how I've done that when I ask.  \n\nWhy did this happen?  I'm not really sure what to blame it on.",
    "title": "My Vietnamese family has become extremely hostile towards me, and I'm not really sure what did it. Can you guys give me any input? I'd really really appreciate it. *wall of text warning*",
    "subreddit": "asianamerican",
    "timestamp": 1628958029,
    "score": 106,
    "keyword": "asian judge"
  },
  {
    "text": "Judge: Black School Board Member Demoted for Anti-Asian Tweets Did Not Suffer First Amendment Violation; Claims Barred by Qualified Immunity",
    "title": "Judge: Black School Board Member Demoted for Anti-Asian Tweets Did Not Suffer First Amendment Violation; Claims Barred by Qualified Immunity",
    "subreddit": "asianamerican",
    "timestamp": 1629292845,
    "score": 68,
    "keyword": "asian judge"
  },
  {
    "text": "My list of studies showing we care more about women than men. Science!\n\n* [Men lack an in-group bias based on gender](https://archive.vn/AHfJo)\n* [Men are more willing to sacrifice men than women](https://archive.ph/kf6f2)\n* [Men and women have a negative reaction to studies that show sex differences favouring men. But positive reaction for the opposite.](https://www.researchgate.net/publication/334751470_Reactions_to_Male-Favouring_vs_Female-Favouring_Sex_Differences_A_Preregistered_Experiment_and_Southeast_Asian_Replication)\n* [Stereotypes have changed over time and now more people think women are superior to men than the other way around.](https://www.apa.org/pubs/journals/releases/amp-amp0000494.pdf)\n* [Men are more likely to be altruistic to women than to men.](https://link.springer.com/article/10.1023/A:1020583425623)\n* [People are particularly concerned when men are violent to women.](https://pubmed.ncbi.nlm.nih.gov/19746441/)\n* [People are less concerned about male suffering](https://www.sciencedirect.com/science/article/abs/pii/S0749597820303630)\n* [Male and female adolescents feel more empathy for female peers.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5112287/)\n* [People are more supportive of women in male-dominated professions than vice versa.](https://www.sciencedirect.com/science/article/abs/pii/S0022103118304633)\n* [People who classify groups as oppressed and privileged cannot make unbiased judgements about privileged groups even when they think they should.](https://www.researchgate.net/publication/325033477_Equalitarianism_A_Source_of_Liberal_Bias)\n* [People underestimate men's support for women.](https://www.sciencedirect.com/science/article/abs/pii/S0022103101915112)\n* [Male victims of sexual coercion against men is not taken as seriously as against women](https://www.tandfonline.com/doi/full/10.1080/13552600.2016.1159343)\n* [Male sexual harassment victims are viewed as suffering less than female victims.](https://www.sciencedirect.com/science/article/pii/S2666518220300061?via%3Dihub)\n* [People don't like affirmative action but especially for men.](https://spssi.onlinelibrary.wiley.com/doi/full/10.1111/asap.12236?campaign=wolearlyview)\n* [Female chatbots are seen as more human than male ones](https://onlinelibrary.wiley.com/doi/abs/10.1002/mar.21480)\n* [Male teachers who have sexual relations with students judged more harshly than female ones.](https://www.academia.edu/5855265/The_Reverse_Double_Standard_in_Perceptions_of_Student_Teacher_Sexual_Relationships_The_Role_of_Gender_Initiation_and_Power)\n* [Both men and women are against double standards that favour men, but support some double standards that favour women.](https://mspace.lib.umanitoba.ca/bitstream/handle/1993/20367/Fortune_Double_standards.pdf?sequence=1) People think men favour double standards that favour men but they don't.",
    "title": "My list of studies showing we care more about women than men.",
    "subreddit": "MensRights",
    "timestamp": 1620545244,
    "score": 1185,
    "keyword": "asian judge"
  },
  {
    "text": "For any queer south asian women that may by part of this group. A new space for you to connect with the community incase you're feeling alone / minority 🌈♥️✌🏽 It always fascinates me that although there are millions of south asians in the world we are still a minority group in the queer community. \n\nA lot of us may want to remain anonymous, are late bloomers, may be confused by heteronormativity in south asian culture or totally deny this part of their identity.\n\nI get it.\nI understand.\nIt's hard.\nAnd it's frustrating. \n\nBut I'm determined to make a little space for us on the wonderful world of Reddit so we don't need to feel alone. \n\nIntroducing: \n[r/QueerDesiWomen](https://np.reddit.com/r/QueerDesiWomen)\n\nA space where we can dwell into this part of our identity without feeling judged. If you know someone in real life also that would benefit from this space then please get them here too! \n\nPlus south asian women are amazing! We're smart and beautiful. So this group of wonderful people deserve to meet more of us. Please get started by introducing yourself in the space We're all interested to learn about each other. \n\nAlso, if you know someone on Reddit who identifies this way then I ask you to please reach out and share this space with them so we can try and expand this group as quickly as possible. \n\nI already know people have tried to make a group before and its been pretty dead but I'm determined to succeed here. So, wish me luck 🥳\n\nIf you join then I'll say thank you in advance ✌🏽\n\nLastly, I am sending love to anyone and everyone who reads this post 🌈\n\nPS: I'm fairly new to Reddit so if you'd like to help me spread the word or contribute then let me know.",
    "title": "For any queer south asian women that may by part of this group. A new space for you to connect with the community incase you're feeling alone / minority 🌈♥️✌🏽",
    "subreddit": "Feminism",
    "timestamp": 1610616717,
    "score": 10,
    "keyword": "asian judge"
  },
  {
    "text": "An imaginary letter to Candace Owens and Shapiro \"we live in a society where femininity is looked down upon and masculinity is admired\" This is a mental letter i wrote to shapiro and candace owens after the harry styles wearing a dress episode. \n\n\nHi Ben and Candace, \n\n\nThis is a letter regarding your and candace owen's opinion on Harry Styles wearing a dress. I have, from watching your videos, come to the conclusion that you and candace are honest people who have well thought out opinions and actually care about society. Due to this, you donot hesitate to express opinions that earn you flak because you care about the truth. However, your opinion on this particular subject, is actually harmful to society, men and women in such a profound way, that I decided to write this email.\n\n\nToday we are living in a society of political equality, equality of oppurtunity, morality and availability of choices between men and women. But for centuries the world has not only enslaved and exploited women, but also this negative attitude towards women also extended to a negative attitude towards femininity and feminine traits. Slaves were often castrated before being owned, as once un-masculinized, a man becomes someone who doesn't deserve agency and can be owned.\n\n\nBut femininity is not weakness. If masculinity helps defend civilization against threats, femininity helps build up a society of harmony that is protected by masculinity. For healthy adulthood and functioning, both men and women must inculcate both masculine and feminine traits within themselves. So many feminine/female typical traits actually help build better leadership like conscientiousness, introspection, ability to process and work with limitations/ vulnerability and emotions, and empathy. Masculine traits like assertiveness, and ability to draw boundaries are also very valuable. \n\n\nBut men are shunned if feminine. For eg: Justin Bieber was harrassed online for several years for having a not yet masculine voice, singing about love and having a female fan base. It wasn't until he cheated on his girlfriend, had stupid anger bursts and behaved like a spoilt, bratty jerk (code words for hypersexuality and aggression) that he won male respect. 1Direction faced the exact same fate. The word gay was used against them as an insult. (Since gay means feminine and hence condemnable. I have never seen lesbian used as a insult in this sense)\n\n\nEven women are victims of this issue. If you read YA fiction, you will see it filled with aggressive, impulsive women who are not exactly strong, per my opinion. An example would be the characterization of bella from twilight, a hollywood movie, as a woman who punches werewolves when she is 'pissed' off at them and could not get along with other girls so now she is a 'strong' woman. (she was nothing like that in the books) And the \"cool girl\", \"not like other girls\" phenomena. Eg: Ginny weasley in Harry Potter novels. Which is why the movie legally blonde is the greatest feminist statement in recent times, because the movie does not merely show a strong woman, it shows a pink donning, blonde, fashionista in a strong, intelligent light. Which is simply revolutionary.\n\n\nFemininity is healthy. You may disagree, but femininity is not obedience or subservience. Women calculate for risk better and are less likely to fall for financial scams like Game stop. Women are better empathisers and communicators ( women are less likely to laugh at prank videos and more likely to feel bad for a hurt football team player in a football game while men respond with disappointment than sympathy) This makes women better leaders, negotiators, organizers, doctors, psychologists, etc.. There are also male typical/masculine traits that are admirable, like assertiveness, but masculine traits are already admired by society, but feminine traits are somehow looked down upon. To the point where girls are now hesitant to say they like pink. Yes, saying that you like pink is considered girly and shameful amongst women, girls prefer to say that they like black, as it is more cool.  Girls just hate being girly girls because it is considered to be weak and subservient. \n\n\nYou say asian societies donot feminize their men. Asian societies choose to build so called strong men but tell women to enslave themselves. Women are killed in female foeticide or people cry when they are born as they are considered 'weak liabilities.'\n\n\nThe sucide rate amongst men is 4 times higher than women. This is because to be in touch with your emotions or to seek help is 'feminine.' There was recently an incident in which a school boy was 'humped' by his classmates (it would have been rape had he been a woman). He held his phone trying to call his mother to cry for help, but did not know how.  Men are repeatedly raped and abused, but hesitate to even admit it to themselves. Horrible male on male bullying of gender atypical \"sissies\" is disturbingly common.\n\n\nWhen Harry Styles wore that dress, when men are allowed to cry/exhibit emotion by society, it is empowering. As for once, femininity is not weak. Femininity is not lack of leadership/achievement. Femininity is not lack of agency/stupidity/subservience.\n\n\n\nA strong man loves a strong woman and isn't threatened by her. A strong man isn't threatened by femininity, in clothing or jewellery. A man is not \"weakened\" by a dress. If you believe that when a man wears a dress, he loses agency, strength, and ability to defend the civilization, do you believe that women, since they wear dresses, lack agency and strength? To me, you saying feminizing men is a problem is saying that femininity is a problem...ie., it is bad/weak and not meant for 'strong, proper' men.\n\n\nBut you say, men and women are meant for different roles? How did these roles help the self esteem of women? Thanks to these roles, women could not pursue a career, make money, choose/judge their partners, or achieve things. It was the 'role' of men. If you feel it is perfectly fine for women to do the afore mentioned things, then that means women are strong and admirable, and men are not weakened by femininity. Please reconsider your ideas on femininity. \n\nRegards,\n\nA person who cannot afford a daily wire subscription to contact you directly.",
    "title": "An imaginary letter to Candace Owens and Shapiro \"we live in a society where femininity is looked down upon and masculinity is admired\"",
    "subreddit": "Feminism",
    "timestamp": 1616173144,
    "score": 8,
    "keyword": "asian judge"
  }
]