[
  {
    "text": "Rejected again, what I've learnt so far. tl;dr - IT student, companies don't really care for my skillset, how do I improve and become job ready?\n\nMy skills:- C/C++, java, J2EE, python, asp.net, C#, html, sass, js, learning react.js and react native, android app, git, \n\nMy experience- 1 year graphic designing for a company taking care of its social media as well as website requirements.\n\nWant to - work as a web developer, but now I'm thinking maybe looking at data science or machine learning, I'm Asian so know math, but I'll have to brush up on that, sounds like worth it if I'm atleast learning a skill that'll go up in demand. \n\n\n\nI just appeared for my second interview for an actual job. I'm currently in my final year but there are companies that come to out college looking for freshers. This post is just to collect my thoughts on what I've learn so far and to get some advice to pick myself up and move on.\n\nSo firstly, I created a resume with all the programming languages I've learnt or created projects in. I don't think it's a good idea. The first role was for hr actually but it was a tech recruitment company so I thought I might be placed somewhere atleast. They asked me questions about python and Java frameworks at a hr interview because I've listed them on my resume. My bad. I only knew the names an what they're used for, nothing more. I could only answer in a few words because that's all I could about the question. I also got super nervous and the CEO(interviewer) noticed that. I asked him how I did, he said good upto now. I had cleared written test and group discussion prior. I wanted to ask him how must I improve but was too shattered. That's the end of that.\n\nThe next interview, was for a web hosting company, for the role of web solution specialist. I'm ok at front end development, I'm learning react currently, very beginner actually, and not that great in js. I should be looking for a front end job but demand is very low and freelancing looks like the way to go. I obviously accept the interview. Same as last time pass the written test, get selected for the interview. I was nervous again but I tried to speak as much as I can. I fumbled but I think I was ok. They asked me to show them how the DNS server works, I showed them using a diagram. Explained it correctly. But still they weren't satisfied. Important note: if you want to show any work you've done, have it at hand atleast on your phone, because things can go wrong. They asked me if I've hosted any website. I said I've not paid for a service, but I've used GitHub pages. Explained my project. But couldn't recall the link for that. I'm sure it's hosted but don't know the link. I logged in to GitHub but the settings section was missing or maybe I was too nervous to see clearly. Anyways messed up. I showed them my online portfolio I created on crevado, didn't impress them. \n\nAt this point I think I'm just decent at a few things. I'm at a crossroad about whether to continue learning front end development or start learning an in demand skill. I used to like front end dev but now it feels like the jobs are dying and I'm getting obsolete even before starting. Any advise? I'm open to all suggestions. I'm from Mumbai, India but there shouldn't be much of a difference. Also, I'm currently completing my bachelor's in IT, but the curriculum is very obsolete. I'm learning that the hard way. I've started learning CS50 and just love it, and that it's made available free for the world makes it so much special. One lecture amounts to one subject SEM in my college in terms of job ready knowledge. \n\nSuggestions?",
    "title": "Rejected again, what I've learnt so far.",
    "subreddit": "cscareerquestions",
    "timestamp": 1572516795,
    "score": 0,
    "keyword": "asian ceo"
  },
  {
    "text": "Wayfair CEO (South Asian) Refuses to Stop Furnishing Concentration Camps [Wayfair CEO Refuses to Stop Furnishing Concentration Camps](https://gizmodo.com/wayfair-ceo-refuses-to-stop-furnishing-concentration-ca-1835850790)\n\n&#x200B;\n\nThis is an unexpected, but substantial entry, into Disgrasian of the Year.\n\nAAPI's should NEVER be on the side of concentration camps.  I don't give a fuck.  If there has to be one goddamn rule that all Asian-Americans have to follow, \"Fuck concentration camps\" is a contender.",
    "title": "Wayfair CEO (South Asian) Refuses to Stop Furnishing Concentration Camps",
    "subreddit": "asianamerican",
    "timestamp": 1561509898,
    "score": 100,
    "keyword": "asian ceo"
  },
  {
    "text": "Seibo Shen from tech to Cannabis entrepreneur to Happy Asian Male Hello everyone! My name is Seibo Shen and I found this sub reddit based on a recommendation from a friend.  A little bit about myself, I graduated with a degree in Asian American studies from UCLA in 2000, I worked as a stuntman then became a law school drop out before working for 5 tech companies that had successful exits. I am currently the CEO of Hanu Labs, a cannabis hardware company in California and I am very focused on mental health in the Asian American community. \n\nOver the last twenty years, I've seen my Asian peers become quite successful but something always seemed to be missing. Whether they were just following their parents dream, or just didn't like what they did, there was something that wasn't fulfilling about our lives. I know I went through that as I worked for company after company that had successful exits, only to find myself temporarily excited and then it would be back to the grind. \n\nI looked for a lot of resources that would talk about taboo topics in the Asian community but couldn't find too many. Because of this, we (Brandon Chien, sex coach) started a podcast called the Happy Asian Males where we discuss various topics including mental health, human optimization, vulnerability, and even dive into topics like psychedelics and what they can do for Asians. I'd love to hear your feedback on what we are doing and hopefully you find it a positive contribution to the Asian community.\n\n[https://podcasts.apple.com/us/podcast/ham-episode-27-mental-health/id1272938949?i=1000408183336](https://podcasts.apple.com/us/podcast/ham-episode-27-mental-health/id1272938949?i=1000408183336)",
    "title": "Seibo Shen from tech to Cannabis entrepreneur to Happy Asian Male",
    "subreddit": "asianamerican",
    "timestamp": 1567003341,
    "score": 3,
    "keyword": "asian ceo"
  },
  {
    "text": "Low pay gender discrimination in Australia If you live in Australia - and this applies generally in Western countries - you will hear the moaning and complaining about women having a pay gap with men. Women have all the bad jobs, men are arseholes who murder their wives, and we need to rape the reputation of men as a group and provide the good jobs to women not men on the basis of gender to make all this iniquity right.\n\n&#x200B;\n\nYou've heard the spiel, right.\n\n&#x200B;\n\nTo this I have two words of response: Taxi. Driver. \n\n&#x200B;\n\nOf course women usually primarily care for young children, and schools during the day primarily care for older children. Sure there are exceptions, higher earning mum goes out to work, dad stays home and enjoys himself with baby - good on them. Not many women want that, they want to mother the babies and they want hubby to earn well to make it easy. \n\n&#x200B;\n\nGiven this, and how competitive it is to reach senior positions in competitive workplaces (ie. all workplaces), I find it not surprising that there are so few married women with children in the highest levels of management, eg. board level or senior exec. I find it extraordinary and manipulated - although given the endless rounds of women promotion (literally, like into the juicy senior job everyone wants) and male reputation tarnishing I'm not surprised - that THAT THERE ARE SO MANY WOMEN IN VERY SENIOR POSITIONS. Sometimes you get a talented go-getter who gives up everything including family for career - Julie Bishop, the former foreign minister of Australia, is a good example of this. She earned it. However, given the time out for family commitments, it boggles my mind that married women with multiple children would make it to the top without being given the job based on their possession of a vagina. In other words, you need manipulation in the extreme in favour of female applicants and against male ones to get the numbers of senior women in the workplace we have now, let alone this being an example of discrimination AGAINST women.\n\n&#x200B;\n\nLet's get back to taxi drivers. In Australia being a taxi driver has been one of the lowest status jobs out there. They work insane hours to support families and typically earn somewhere around $8 an hour, in a socialist country like Australia where minimum wage is set at around the low $20s per hour. They have to sit all day long, which is awful for health and posture, they're exposed to the sun, they have to deal with sometimes drunk and abusive customers and not uncommonly physical assaults. Surely if we want to help low income earners, taxi drivers would be the perfect place to start. Surely a few rallies to parliament house, some politicians speaking out for them, the charities and social services organisations prioritizing taxi drivers income. Well....not exactly.\n\n&#x200B;\n\nAny guess why not? It wouldn't be anything to do with the fact that something like 98% of taxi drivers are men, would it? In Australia, Indian immigrant men, by the way.\n\n&#x200B;\n\nLook, if like me you have a dick, and one or two testicles swinging on either side of it, you're not going to get any airtime. You're the aresehole, remember? So that taxi driver who earns $8 an hour is the arsehole, oppressing that focused white or Asian early 40s women who gets promoted to chair of the board and earns a few million yearly. But he's got a dick, so we already know he's bad, so why am I even writing this?\n\n&#x200B;\n\nMen I have no idea what to do in a society that hates my gender so much. I mean for us as a group, on an individual personal level there's usually plenty we can do. The way I see it, things went so nuts so quickly all I can see is at least making men INTERNALLY aware of how the system is stacked against them. I share many others' skepticism of any positive change to men's conditions through the political process, or even a willingness to block their further erosion through more and more man-hatred expressed through law and social beliefs. The only thing I believe I can do beyond the personal level is to at least make as many men as possible aware of the how under siege we, as a gender, have become.\n\n&#x200B;\n\nGood luck to all, but most particularly to Indian male taxi drivers, and least particularly to wealthy early 40s CEOs of large companies who got there mainly because they had a vagina.",
    "title": "Low pay gender discrimination in Australia",
    "subreddit": "MensRights",
    "timestamp": 1550710749,
    "score": 18,
    "keyword": "asian ceo"
  }
]