[
  {
    "text": "What advice will you give to an asian person who's afraid of being judged by americans ?",
    "title": "What advice will you give to an asian person who's afraid of being judged by americans ?",
    "subreddit": "AskReddit",
    "timestamp": 1677195032,
    "score": 1,
    "keyword": "asian judge"
  },
  {
    "text": "Senate confirms Cindy Chung 3rd Circuit's first Asian American judge | 🥂 a good one to start the day cheers to her and to all the people that made it possible 🥂",
    "title": "Senate confirms Cindy Chung 3rd Circuit's first Asian American judge | 🥂 a good one to start the day cheers to her and to all the people that made it possible 🥂",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676633362,
    "score": 242,
    "keyword": "asian judge"
  },
  {
    "text": "Still dealing with the stigma of Asian women being \"golddiggers\" after almost a decade of marriage I'm not really looking for any specific advice with this post, just want some support.\n\nI'm (31F) from South-East Asian descent and my husband (50M) is from the US. I met my husband when I was 22 back in my home country, he was 41 at the time.  He was there for a few months for his work. When we met eachother, despite our age difference, we really hit it off and had amazing chemistry. We pretty much started dating instantly from when we met and continued for as long as he was in my country. After a few months, he had to go back to the US and we wanted to stay with eachother so I moved with him to the US and we got married. I know that this sounds like the typical story of older Western man finds young Asian woman who is after his money and a greencard, but that was completely not the case for us. Our relationship started completely organic and we genuinely love eachother and there was never any form of transaction between us. We know that despite that we know that our love is real, people are always going to judge us and this will be something we will have to deal with.\n\nA few of my husband's family members were initially suspicious and gave me a hard time at first. But thanks to my husband sticking up for me and them getting to know who I am, everything turned out good. When I got to the US, we decided that I would stay at home and take care of the house and my 2 stepdaughters my husband has from his previous marriage. Now 9 years later, we have 3 children of our own and nr 4 is currently on the way! Our marriage has been great and there is nothing I would change about it.\n\nBut recently my husband had a big family gathering with a lot of family members who are more religious and conservative that I had never met before, so I was definitely nervous attending. It turned out to be a complete disaster. One of my Husband's strict religious uncles straight up started accusing me of going after the family whealth and my husband's inheritance and started saying that I would leave as soon as I had acces to that money. I was completely frozen in the moment but luckly my husband stuck up for me. It turned into a huge shouting fight and ended with my husband and I leaving. \n\nAt this point I just feel sad about all of this. After almost a decade of marriage and 4 children together, I'm still somehow seen as some monstrous person who is out for nothing else but money. It's sad that  Asian women have to deal with this stereotype despite most of them having pure intentions and searching for genuine connections.",
    "title": "Still dealing with the stigma of Asian women being \"golddiggers\" after almost a decade of marriage",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1674137287,
    "score": 10,
    "keyword": "asian judge"
  },
  {
    "text": "My mum won't stop talking about marrying my boyfriend Hi everyone,\n\nI (20F) have a boyfriend (20M). We met at university and went fairly fast. He met my parents by coincidence about 2 months in and it went fine. However, I ended up getting a UTI after having sex and my mum found out and slutshamed the shit out of me. Her first question  was \"did the hymen break\" and then after I got medical attention ( I was bleeding) she went on a 30 minute talk on the phone asking me why I was so stupid and easy to have sex and now we're linked or something. I love my boyfriend but she made it sound so much heavier and that's when the pressure set in. \n\nThen I went through my year and when summer rolled around and I was going home my mum wouldn't shut up about how we should be engaged by the end of uni and I know I don't want that yet and my BF doesn't know if he wants that yet. My mum said that everything I did was wrong without the intention of marriage and I'm mentally ill for doing this if I don't.  \n\nThen I had an IUD put in without telling her, got a bad reaction (severe anxiety) then when I asked her for help she started by telling me that I was a fucking idiot and that I was ruining my body because I was having sex too early for someone who didn't even want to marry me. She said the UTIs were part of this and that I was wasting time on relationships when I should be studying. \n\nMy boyfriend is normal, he had a normal upbringing without sexual shame outside of marriage marking every fucking angle and sometimes I'm a bit jealous he never had that pressure. I'm happy he had experiences but the unrelenting pressure around my sex is life is scaring me. I hate that I can't just date for fun and I have all these sexual hang ups. I feel like whatever relationship I get into, the other person with a healthy relationship history without all the pressure of marriage on their head is just going to leave me or the hassle of my family is going to get too much. It's so much pressure on me and I just want to be able to enjoy myself. She's against any birth control that isn't condoms and family planning which makes this even more stressful. \n\nI can't talk to my boyfriend about this because his family is just normal. They treat me normally since my bf has had girlfriends before me  rather than assuming I'm getting married and judging me that way and it's so strange having a relationship be treated lightly. I feel like if I had that from my parents that would be fine but the unrelenting pressure on my end and the nonchalance on the other makes me feel like I keep taking a lot more emotional pressure for this relationship. I can't explain this because my boyfriend is struggling with his father's health so I don't want to add extra pressure to his life. I'm praying every night for their health. \n\nIt just feels like I can't ever just be happy  someone has to force their beliefs down my throat about sex. I just want to enjoy my loving relationship here and now. My boyfriend made marriage a no discussion topic and i can't tell him how I feel. He felt like I mentioned it often but I never mentioned it between us, just from posts and things or confusion about actions in other marriages. I feel like he doesn't understand what it's like when you're slutshamed into having to think about marriage all the time. I don't want to but I can't get away from it. It's slowly destroying me bit by bit that I'll never be free from the expectations of my society. It's made my life so much harder and it feels like I'll never escape. \n\nI'm south Asian for context.",
    "title": "My mum won't stop talking about marrying my boyfriend",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690281192,
    "score": 7,
    "keyword": "asian judge"
  },
  {
    "text": "Feeling quite upset with how women's pain is dismissed and we're expected to bear worse without comfort or break... I've struggled with painful heavy periods for a while, to the point that I've had to take days off uni and work on the first two days and I am sometimes writhing in pain, fainting, throwing up despite having tried nearly every pain medication under the sun and trying all of the 'herbal' remedies. I went to doctors who all either turned me down saying it was normal and I'd just have to deal with it after 'normal' ultrasounds, or recommended an IUD or other forms of birth control (which I can't have because of my medical history). Finally an OBGYN put me on a list of investigations for suspected endometriosis, after a particularly nasty period where I was hospitalised for an ovarian cyst.\n\nI am all for supporting women with different experiences and pushing the experience that we can be strong and capable,  work and study and travel and even care for kids all while on our period, because I want that more than anything in the world. I sincerely do believe that promoting the capabilities of women to persist through life's tribulations is not exclusive to being considerate to women with different medical, cultural and financial backgrounds. I'm in the medical field myself and try to take less time off whenever possible. I've had my periods everywhere and time possible, even the worst of times - exams, operations, flights, lectures. And I'm alive, I guess.\n\nBut when I have moments like these - when I feel so exasperated, paranoid and upset with my body - I can't help but feel...lesser. Nearly all the woman in my life tell me that my body was made for this like every other woman's was - they tell me all these horror stories of how they were giving birth at 17 or cooking for their husbands after just having miscarried (South Asian but my friends from other cultures have told me similar experiences from their relatives), \"and we're fine\". When I came to the West, a lot of girls told me they were sick of period ads because some of them portrayed girls going through periods as 'weak' or pathetic, and WOW that hurt even though I know they meant no harm by it. I wasn't expecting much better stories, but I don't think I can really find proper closure anywhere. The only place I feel comforted is with my mom and sisters, as they don't judge me or make me feel horrible, but even then, she occasionally tells me there's \"no point in complaining because it's a natural process.\" One nice friend I had looked pretty alarmed when I told her my symptoms and urged me to try one more doctor. Another not-so-nice friend laughed at me when I said I wouldn't marry a man who expected me to cook and clean for him while suffering from this, saying \"women do it all the time, you're not special.\"\n\nI feel like I'm supposed to be as great and tolerate that pain without 'needing' anyone to comfort me, but I'm somehow failing as a woman when I'm crying from it or fainting. There's this strong expectation - from family, from friends,  from colleagues, even from the world, that I can just walk up and continue my day - and I feel like I'm failing them when I can't do what I usually can for even a few days every month. A part of me recognises I don't owe them anything and couldn't control the fact that I have a chronic painful condition, but a much more vocal and yearning part of me wants to be that 'do-it-all' woman who doesn't disappoint people, especially my own gender. And though there are times I'm grateful to be a woman, there are other times I realise that if I were a man suffering from any other chronic condition, I would never  think that I'd be \"letting my gender down\". Yes, I'd still have problems with health and limitations to what I could do, but I wouldn't feel this conflicting guilt and shame over my body.\n\nIs it so wrong to lie in bed for one day and sleep the pain away? Is it so pathetic that I feel too exhausted to walk to uni or drive to work? Is it so bad that I don't want my pain to be dismissed as a simple inconvenience I can \"walk through\"? Is it so bad that if I did have a companion, I'd want them to support me, or am I just meant to walk through this life alone and keep this pain to myself?",
    "title": "Feeling quite upset with how women's pain is dismissed and we're expected to bear worse without comfort or break...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1697719348,
    "score": 4,
    "keyword": "asian judge"
  },
  {
    "text": "advice please!!  \n\nhellooooo. i need some advice from yall girls on some stuff.\n\nokay so, our school has these leadership positions, where basically you run studnet councils like academics council, student life, etc. I applied for interationalism and student life. student life was pretty much a backup i didnt expect much from, but i did expect more from internationaoism. i was on the council this year, ive had leadership experience in all 4 years, good skills, and a pretty good cover letter and resume. But, all this is pretty much shit when it comes to who actually decides who goes forward. basically, we submit our resume, cover letter, and a fligrid vid for the commitee to judge, and then they choose ppl to inetriew, and then from there they choose ppl to go on the ballot for everyone in the school to vote on.. the committee is basically the currrent captain/prefects, plus the superivising teacher. the more dominant prefect does not like me AT ALL. basically, when we were planning intl week, she started being kinda rude to me, and me being me, i kinda gave it back. i also told the superivisng teacher, so she prob didnt like that. karmas a bitch, idk what she expected. acc i do, she like speople who are more subservient, and just kinda do everythng she asks. im sure if it were up to her, shed just have everyone do what she wants them to. i had been opinatned and outspoken from the start, ig she didnt like that. anyways, the supervising teacher also does not like me for some reason. my friend whos also on the council thinks its cuz i dindt lead asian heriatge month, and that kinda annoyed her for some reason (i did it last year, it was too much work, i was pretty much left to do it on my own, and school didnt care so i opted out of doing it this year). the other prefect is just kinda eh. doesnt hate me doesnt love me.\n\nnow, here are the ppl im competing against:\n\nperson a - my very good friend, she doesnt have any leadership expreicne except asian heritage month this year (she kept trying to cinvice me to do it with her)\n\nperson b - also a good friend, same as a, doesnt have much experience, also doing ahm for first time this year\n\nperson c - dominant prefect's best friend. supervising teacher loves her. second year on council, a bit, but not much of leadership experience.\n\nand then im person d - leadership experince for 4 years, demonstrated skills, expreince in teh cultural awarness stuff (ahm), council for 1 year.\n\nand guess what. i got rejected. i didnt even get an interview. to not get an interview, youve gotta have a prettyyyy bad application imo. im not sur ewhat it was that made me SUCH a bad applicant i couldnt even get an interview, but alas that is what happened. and not to sound cocky but like i had a good chance. i had a good cover letter and resume. idk what happened\n\nanwyas, i contacted the supervising teacher today, asked her if we could meet to go over EXACTLY why i didnt get it. she said yes, im just wondering hwo i should go about it, especially if i want to convince her i desreve an interview? i dont want it to be ovbi, since i acc said im not looking for you to give me an interview or anything. but i wanna show that im a good applicnat and a good candidate. i swear on my life, i have never done anything to cross these people, but for some reaosn they do not like me. any advice would be EXTREMELY appreciated!!",
    "title": "advice please!!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1681782371,
    "score": 0,
    "keyword": "asian judge"
  },
  {
    "text": "Do you prefer black therapists? I am on this arduous journey of healing, growth, and self-improvement, and one of my biggest challenges up till now was picking a therapist that served me well. Therapy is expensive for me, and I want to make sure I'm getting my money's worth. \nI consider it a privilege that I can even afford to pay for a therapist, but when it comes down to it, I've not had good experiences with black therapists I've had in the past. It's especially tough for me because I try my best to support black people/businesses when I can, but I haven't had much luck here. \n\nI'm bringing this to our r/blackladies space to find out if this might be an isolated incidence for me or if my experience is similar to others. \n\nMy current therapist is Asian, and I've had significant growth and improvement in such a short time compared to my time/experience with my past therapist who was black; specifically, a black man.\n\nI felt like he relied too much on our shared racial identity to establish familiarity, and he seemed to always want to tell me what to do instead of helping me figure out how to make better decisions by myself and how to be a better person. I often felt like I was being judged too harshly or being ridiculed in some way for my mental and emotional incompetences. \n\nTherapy sessions with him left me feeling indifferent and unfulfilled because although he validated my mental health challenges, I don't think he did much else to help me be better besides just reiterating that \"It's tough for a black woman in America\".\n\nWith my current therapist, there seems to be less judgment, and a lot of empathy and patience - more than I've ever received. I'm also being held accountable for making better decisions, understanding that the decisions I make do not always guarantee the outcome, and being aware that I am ultimately going to deal with the consequences of any decisions I make no matter how good or bad they may be. My self-awareness seems to have significantly improved, and I seem to have way more grace dealing with difficult situations now than I used to, but there's always room for improvement.\n\nSo, how has your experience been so far with therapy, and do you prefer black therapists? Why or why not?",
    "title": "Do you prefer black therapists?",
    "subreddit": "blackladies",
    "timestamp": 1697749918,
    "score": 63,
    "keyword": "asian judge"
  },
  {
    "text": "I’m getting social anxiety from non-black people hiding their bags / phones when I am around I’m not sure how to let go of this anxiety and feel more at ease in public when I am out alone. \n\nIt is mostly white and asian women who do this. I feel it’s really unfair for them to have the power to make me feel out of place / unwanted. \n\nI am always hyper aware of my body language and positioning relative to others. While in public I am constantly thinking about how I can look less threatening and I feel uncomfortable in my own skin while out. As a result, I think I am looking at people more intensely to gauge their reactions.\n\n\nFor context, I am a dark brown, attractive girl in my 20s. I dress well, quite chic and often wear designer bags and clothes. I often have makeup on. I don’t think it’s that I look sketchy, it’s just that people see dark skin and judge right away. Unfortunately in the city I live in most all of the homeless people are black so I even catch myself being on guard around other black people on occasion. \n\nI’d appreciate any tips on letting go of the anxiety so I can feel relaxed in public and 100% myself. I asked a few black friends and they said they’re pretty aloof and don’t pay attention to this.\n\na few examples:\n\n- I’m walking down the street, someone passing me will look up and see me and either put their phone away, grip their bag, or eye me until we pass as if to watch for any sudden movement \n\n- when I join a line at checkout or for a bathroom, someone hides their phone or moves their cross body bag to their front side or back side so it’s further than me. once I was in the check out line at zara and turned around to see how much longer the line was. the woman behind me was busy texting and quickly put her phone away and started eyeing me",
    "title": "I’m getting social anxiety from non-black people hiding their bags / phones when I am around",
    "subreddit": "blackladies",
    "timestamp": 1693844898,
    "score": 39,
    "keyword": "asian judge"
  },
  {
    "text": "Truly zero white cast sunscreen? Hi beautiful ladies! I am not a black lady, but my sister-in-law is. \n\nWe live in East Africa, and it's nearly impossible to find cosmetically elegant, no white cast sunscreen here.\n\nI am visiting the States and I really would like to get her some sunscreen, but I'm not the best judge of which types have no white cast.\n\nI'm looking for something that is not necessarily extremely expensive, but certainly feels nice on the skin. Physical or chemical, also Asian beauty! \n\nThank you so much for your suggestions 🩵",
    "title": "Truly zero white cast sunscreen?",
    "subreddit": "blackladies",
    "timestamp": 1688658061,
    "score": 17,
    "keyword": "asian judge"
  },
  {
    "text": "Can I call myself Chinese? I'm half Chinese and half white. Whenever it's relevant I always refer to myself as \"half Chinese\" because I'm a little worried I'd be judged for calling myself Chinese. I'm not 100% sure if I'm supposed to post this here, but I think this is the best place I can get unbiased and honest judgment. The question has been bugging me for a while. \n\nI'll just note some things that are probably relevant. \n\n- I cannot speak fluent Mandarin Chinese, though I am currently learning it. \n- I've been to China (Xi'an, Beijing, and Shanxi province) 2 times that I remember, and a few times when I was a baby. \n- I grew up in a 60% Asian neighborhood. \n- Some people think I look very Asian, while many others don't realize at all. \n- I've read many books on Chinese history, mostly modern history. \n- I currently live in a mostly white area.\n\nEdit: I want to say, I really appreciate all of the responses. I'm seeing a lot of new perspectives.",
    "title": "Can I call myself Chinese?",
    "subreddit": "asianamerican",
    "timestamp": 1693863241,
    "score": 162,
    "keyword": "asian judge"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 69,
    "keyword": "asian judge"
  },
  {
    "text": "I'm middle aged but sometimes, I still feel like I don't belong I'm in my mid-40s and by now, I should have it figured out but I don't. I mean, I think generally I do but I got so triggered today. We're heading to Japan in a couple weeks and I know gratuity is not generally accepted.  There are exceptions though and I was asking about those exceptions on a visiting Japan FB group I'm in.\n\n95% of the comments were of disdain and admonishment.  I was accused of feeling superior to the Japanese, of wanting to change their culture, of not wanting to accept other cultures, of not giving a shit about anybody but myself and how so fucking American I am, which given the context, I translated that to how close-minded I am.\n\nWherever their anger is coming from, I'm not judging but it just got me thinking again about how being Asian and not really feeling like you belong anywhere, something I have struggled with my entire life but really it's been  years since I've even thought about. \n You get married, you have kids, your identity shifts to parenthood and raising children but their comments was a stark reminder: I'm too Asian in America and too American in Asia.  Last time I felt that way was in 1998 when I went on Taiwan Loveboat.\n\nI just needed to vent a little and didn't really have a place to do it.  I'm not teaching my kids anything about our heritage.  They're not learning Chinese and while I justify it to myself that, \"I just don't have the time,\" while partially true, if I'm having a hard time as a full ABC, how will my half AA/1/4 German 1/4 Irish/English kids deal with identity when they are older? \n\nI thought I was so over this identity crisis.  Leave it to some internet strangers into shaming me for not being stingy. My terrible attempt at trying to be funny.",
    "title": "I'm middle aged but sometimes, I still feel like I don't belong",
    "subreddit": "asianamerican",
    "timestamp": 1676952510,
    "score": 29,
    "keyword": "asian judge"
  },
  {
    "text": "By a vote of 52-46, the #Senate confirmed the nomination of Myong Joun to be US District Judge for the District of Massachusetts (first Asian-American judge on this bench)",
    "title": "By a vote of 52-46, the #Senate confirmed the nomination of Myong Joun to be US District Judge for the District of Massachusetts (first Asian-American judge on this bench)",
    "subreddit": "asianamerican",
    "timestamp": 1689201892,
    "score": 9,
    "keyword": "asian judge"
  },
  {
    "text": "Many studies show black men face more discrimination than black women. Here is the evidence: Intersectional feminists often argue that black women have it the worst, and they suffer worse than black men because they're black and a woman. Well guess what? There's lots of evidence that shows black men face more discrimination than black women.\n\nThis [article](https://theconversation.com/black-men-face-high-discrimination-and-depression-even-as-their-education-and-incomes-rise-141027) by *The Conversation* elaborates on what black men deal with. According to study 1, black boys from the wealthiest families were the most depressed. Study 2 found that for black men, the highest education credentials were associated with an increase, not decrease, in depressive symptoms. Study 3 found that in a nationally representative sample of American adults, black men with the highest income had the highest risk of depression, specifically major depressive disorder. Interpersonal or one-on-one discrimination was not found to be a factor. Study 4 found that 700 black teenagers were followed for two decades in Flint, Michigan. Perceived racial discrimination was measured in 1999 and 2002. Discrimination as teens was a predictor of depressive symptoms in people transitioned to young adulthood a decade later. Nonetheless, this was only true for black men, but not black women. In that same study in Flint, an increase in perceived neighborhood fear, defined as being scared of the crime and violence in the neighborhood, was linked with an increase in depressive symptoms for black men, but not black women. Study 6 found on IAT tests that white men had higher racist attitudes towards black people than white women, but the difference wasn't particularly extreme, but statistically significant. Nonetheless, white women also can be really racist towards black people, too.\n\nBlack men also get arrested, incarcerated and stopped or profiled far more than black women. Even white men experience being arrested and incarcerated far more than black women. And the reason why most prisoners are men isn't simply because men commit crime more. [A significant minority of criminals are women](https://www.reddit.com/r/MensRights/comments/xyl5wb/statistics_cited_women_are_more_likely_to_commit/), but female criminals are severely underreported, get arrested less when reported, are less likely to be incarcerated when convicted, are paroled earlier, and given more lenient sentences compared to men. Additionally, black men are far more likely than anyone else to be killed by police. [In fact](https://www.bloomberg.com/news/articles/2019-08-06/race-and-police-shootings-what-new-research-says), white and Asian men were much more likely than even black or Native American women to be killed by police. Almost all police homicide victims were men! [Black men were also much more likely than anyone, even black women, to be murdered in general](https://www.niussp.org/health-and-mortality/americas-high-homicide-rate/?print=print). [Black men are also more likely than black women to be victims of crime in general](https://bjs.ojp.gov/content/pub/pdf/bvvc.pdf). [Black men also were](https://www.pewresearch.org/short-reads/2019/05/02/for-black-americans-experiences-of-racial-discrimination-vary-by-education-level-gender/) more likely to be subject to racial slurs/jokes, be unfairly stopped by a police officer, have people act suspicious towards them, been assumed to be prejudiced, or to have feared for their personal safety. In fact, 59% of black men had been unfairly stopped by police, compared to just 31% of black women.\n\nAnother study called \"[Gender Matters Too](https://psycnet.apa.org/buy/2008-05171-002)\" found black men and women in 11th grade classrooms differed in their perception of peer and classroom discrimination. For boys, discrimination harmed their grades, attitudes and their regard for the importance of school. For girls, however, the effects generally had a positive impact. Another [study](https://psycnet.apa.org/doiLanding?doi=10.1037%2Fpspa0000288) found that the real root of racism towards blacks was perceived threat, not dislike, and that people were racist toward black people not due to negativity towards them but feeling threatened by them, especially black men. When isolating negativity from threat, they found no automatic black-negativity link. Negativity towards blacks was associated with viewing them as a threat. [In fact](https://polisci.osu.edu/sites/polisci.osu.edu/files/mcconnaughy_white.pdf), another study found that people viewed black men as particularly violent, and viewed white men as more violent than black women. They ascribed a low amount of violent personalities to black women and an especially low amount of it to white women. They viewed black men as more promiscuous than white men, white men as more promiscuous than black women, white women slightly more promiscuous than black women! They viewed black men as less intelligent than black women, and viewed black men as less ambitious than black women. Fast responders gave unpleasant responses to black men far more than to black women. All responders gave black men the most unpleasant responses compared to black women and white men and women, and black women slightly less unpleasant responses compared to both white men and white women! Another [study](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.848.1523&rep=rep1&type=pdf) found that even both male and female participants were equally likely as each other to be more willing to shoot a black unarmed suspect than a white female armed suspect or black female armed suspect. Men and women equally were likely (when not even looking at race) to prefer shooting unarmed male suspects over armed female suspects. An implicit racial bias [study](https://journals.sagepub.com/doi/epub/10.1177/0146167219829182) found that black women were seen as more dangerous than white women by participants of all races, but they still viewed black men as more dangerous than black women. Even when looking at black children, they viewed black boys as more dangerous than black girls.\n\n**Black men had it worse during slavery**\n\nThis thread I made a year ago talks about how there were more male than female black people enslaved in the United States, and the black women were more likely to be free. In 19th century United States, [more men than women were slaves and more women than men were freed slaves](https://www.statista.com/statistics/1010277/black-and-slave-population-us-by-gender/). Although there was always a difference, the difference increased in the Civil War because of all the black male soldiers who died, and women weren't sent off to war as soldiers.\n\nThis only looks at the ones in the US. Believe it or not, the vast majority of enslaved black people were sent to places like South America or the Caribbeans, and a minuscule percentage were in the US. [When looking at all the enslaved black people from the 17th to 19th century](https://www.statista.com/statistics/1183869/ratio-male-female-slaves-by-route-1636-1867/), they found that in any region, men outnumbered women, with the gap being quite large in most regions. Many historians think all slave owners were white men, but evidence found that 40% were white women. They were often cruel and violent just like male slave owners. In fact, George Washington's wife owned way more enslaved people than him. White women were trained to enslave black people from a very young age, and they even were often given slaves as early as 9 months old! [According to](https://www.history.com/news/white-women-slaveowners-they-were-her-property) History.com:\n\n>White women were active and violent participants in the slave market. They bought, sold, managed and sought the return of enslaved people, in whom they had a vested economic interest. Owning a large number of enslaved people made a woman a better marriage prospect. Once married, white women fought in courts to preserve their legal ownership over enslaved people (as opposed to their husband’s ownership), and often won. “For them, slavery was their freedom,” Jones-Rogers observes in her book.\n\n**Black men were raped, too.**\n\nWe often hear about female slaves being raped, and how it was legal to rape black women. [What we don't hear about is how often black men were raped by slave owners](https://muse.jhu.edu/article/448992/pdf). [They often were](https://shareok.org/handle/11244.46/1279). They also were stripped naked and white people laughed at their genitals (i.e.: body shaming of men for their penis size even though they have no control or choice of their penis size). According to the [AAIHS](https://www.aaihs.org/sexual-violence-against-enslaved-men/),\n\n>Foster begins *Rethinking Rufus* by examining how enslaved men’s bodies were depicted in Western art and sculptures that were widespread in the visual culture of slavery. Foster argues that enslaved men’s bodies were “symbols of enslaved manhood and sites of violation” that were objectified through a number of cultural forms including art and literature (12). The objectification of enslaved men depicted in paintings often resembled everyday acts of terror including the public inspection of Black men’s genitals, whippings and lashings, and bodily exposure due to lack of adequate clothing. Visual depictions of enslaved men that emphasized their genitalia and sexual prowess gave way to the prevailing myths of Black hypersexuality and the Black male rapist, an archetype that ensured the extralegal protection of white women from Black men who purportedly lacked control over their sexual urges. Foster also argues that while visual depictions of enslaved men’s bodies often highlighted their athleticism, strength, and muscularity, this same imagery eroticized enslaved men’s bodies in ways that fueled the physical abuses and sexual exploitation of enslaved men. Foster notes that these stereotypes found in eighteenth-century visual art contributed to the eventual punishment and national disenfranchisement of Black men.\n\n**White women also raped or sexually preyed on black men, too.**\n\n[White women also had sexually abused black men, too](http://www.inquiriesjournal.com/articles/1674/sexual-relations-between-elite-white-women-and-enslaved-men-in-the-antebellum-south-a-socio-historical-analysis). White women were authority figures or in a position of power over these black men, and white women had sex with black men, often even raping them forcibly. White women also threatened to falsely accuse black men of rape if black men didn't have sex with them. Because abortion was unregulated, and any woman was able to get an abortion back then, many white women used this advantage to sexually abuse black men without people knowing she fornicated out of wedlock, and was able to abortion \"illegitimate\" children, hiding the evidence that she sexually abused black men. As a result of this and the fact that men could not speak about being raped because people believe men cannot be raped, historical records of white women raping black men are often overlooked, and it could've been more common than we think, perhaps as common as white men raping enslaved black women.\n\n**Almost all lynching victims were men whereas a significant minority of victims were white.**\n\n[Another interesting fact](https://www.newspapers.com/clip/5803482/lynching-nj-1901/): virtually all lynching victims were men. Of all the 2,516 lynchings that happened from 1885 to 1901 in the US, 82.67% happened in the South and 13.75% happened in the North. 66.69% were black and 31.84% were white. 97.97% were men and 2.03% were women. Just 51 women lynched compared to 2,465 men. We always hear about how most victims were black, but no information about how virtually all were men. White men got lynched far more than black women. Black women rarely were lynched, and almost no white women got lynched.\n\n**Black people also face discrimination when it comes to rape.**\n\nIt is true that people are less responsive to black women who got raped than white female rape victims, but if people knew how common it was for men to be raped, and women rape men as just as much as men rape women (cited in a thread I cited above about women being more likely to commit crime than people think), then I'm sure they'd respond less to black male rape victims than white male or black female rape victims. In fact, they'd probably care for black women who are raped than white men who raped. Black men also are viewed as hypersexual, promiscuous, unable to control sexual urges, and always wanting sexual intercourse.\n\nAlso, false accusations happen a lot more than feminists admit, and I cite evidence for it in this [thread](https://www.reddit.com/r/MensRights/comments/xzb7d8/statistics_show_that_false_accusations_are_quite/) of mine, and black men especially are affected. Black prisoners incarcerated for rape are especially likely to be innocent, especially when their accuser is a white woman. White women historically falsely accused black men of rape to get them lynched, and they still falsely accuse them, and while most rapists get away with it, black men who are accused by white women are more likely to be incarcerated even if they're innocent. It was considered rape historically for black men to have consensual sexual intercourse with white women, and there was a double standard for a while where people judged black men marrying white women more harshly than white men marrying black women because black men were viewed as predatory.\n\n**Education/life expectancy**\n\nBlack women also have a higher life expectancy than white men and especially black men, and are less likely to go to college than white men but [go more than black men](https://www.brookings.edu/articles/black-women-are-earning-more-college-degrees-but-that-alone-wont-close-race-gaps/).\n\n**Feminists don't care about black people, not even black women.**\n\nFeminists often don't pay attention much to black women's struggles. Even first wave feminists disregarded them and didn't want them to vote, let alone allow black men to vote, and that motivated them and was a reason why they wanted to vote, because they worried black men were technically allowed to vote despite Jim Crow laws and didn't want them to have the complete ability to vote before white women.\n\nNonetheless, many stereotypes feminists make about men are especially applied to black men due to society historically portraying them as hypermasculine, hypersexual and prone to violence or crime. Feminists' portrayal of men harms black men especially. They also ignore false rape accusations despite that white women still, to this day, falsely accuse black men of rape which is why so many black prisoners are falsely incarcerated for rape, and yet feminists expect every reported person for rape to be imprisoned. They also widely ignore how black women are associated more with the term black than with women, and aren't viewed as normal women.\n\nThis is why womanism (black feminism) was started.\n\n**Conclusion**\n\nDoes anyone notice how people hate black men more than black women? Yeah black women face pregnancy discrimination with prenatal care and dealing with more abortions and unwanted pregnancies, but black men usually don't ever get to see their kids, and often cannot afford to pay child support. Many black children are raised by single moms and barely knew their dad, if at all.\n\nThe reason black men face more discrimination than black women is due to people's racism towards black people being associated with seeing them as a threat, not dislike, and being a woman prevents black women from being seen as a threat as much as black men. Nonetheless, people might see black women as more dangerous than white women and be racist towards them due to a guilt by association mindset. In spite of that, people still are more racist towards black men because when racial attitudes are mostly about feeling threatened, people tend to view women in general as harmless, which is different from how they view men in general.",
    "title": "Many studies show black men face more discrimination than black women. Here is the evidence:",
    "subreddit": "MensRights",
    "timestamp": 1699982481,
    "score": 196,
    "keyword": "asian judge"
  },
  {
    "text": "Military False Accuser: Is There Any Justification? BLUF: Big Black Active Duty service member VS Cute Little Asian girl. I was facing 30 years for a crime I did not commit, do you think I stood a chance against my false accuser? Who would you put your money on to win that battle? I had to start training for that Prisoners Vs Guards annual football game, I was going to try out for Cornerback.\n\nI was falsely accused of Rape/Sexual Assault (Article 120 of the UCMJ) by a fellow service member. My NCIS investigation lasted several months. During that time, I thought my life was over, I thought my career that I had spent years building was over, and I was sure that she would be believed without question simply because she was an attractive female and she’s very well-liked as far as I can see (she has no shortage of white knights looking out for her). Objectively, superiors would consider me a top Sailor not only in the Navy but also within a Joint service environment, I’m not saying that to brag, I’m just trying to paint the picture for you that I’m the furthest thing from what I was accused of. \n\nOnce NCIS brought me in for questioning, that is when I found out what I had been accused of. Up until that point, I just had a No-Contact order issued to me that didn’t state why. NCIS had a Chief escort me in then asked me some biographical information and showed me the form that revealed the accusation and my accuser. I looked at the paper, then I acknowledged it and signed with no reaction. Inside I was furious to see I was being accused of such a heinous act even though if you asked anyone who worked with us (other than her confidante who probably believed her), I would be the last person people would say could have sexually assaulted someone, but I still had no idea what she said I did. The agent then said to me, “we just want to give you the opportunity to tell your side of the story”. At that point I invoked my right to remain silent and have legal representation. The agents then let me go. I then called and retained the best UCMJ lawyers I could. \n\nThere was nothing for the attorneys to work with since I hadn’t been charged, but I was fully expecting this case to go all the way to court martial, not because I was guilty, but because I knew she would be believed even though she came forward with the allegation almost a full year after we had last spoken. I spent months preparing for all of the possible charges I could think of, I made a PowerPoint, constructed a video with hours of analysis giving everything that happened between us which proved that I never sexually assaulted her. I was ready for battle to say the least.\n\nEventually my command legal Officer would randomly reveal to me that the NCIS investigation had finished and the Staff Judge Advocate (SJA is basically the prosecutor) had chosen not to charge me with anything and my Command chose not to take ANY adverse action against me (I interpret that as they know I did nothing wrong but they had to go through the motions). \n\nNone of my friends or family were ever even interviewed. I couldn’t even tell my mom because she wouldn’t have been able to handle it. She nearly had a mental breakdown once I revealed at his whole situation to her. She commended me for keeping this from her because I protected her from herself.\n\nI’m waiting for the Freedom of Information Act (FOIA) request for my investigation to see why I wasn’t charged because there must be something that they found revealing she lied and was an unreliable witness. I want some type of justice, I will continue to be the best that I can be and remain successful in the military, striving to take care of my shipmates, but I’d be lying if I told you I didn’t have thoughts of taking the law into my own hands at some point.\n\nThis was a good result, but it’s bittersweet that I didn’t get to face my accuser and she’ll get away with trying to ruin my life. It cost me a fortune in legal fees since I was facing 30 years in prison 30 years of probation so I didn’t want to leave my fate up to a free military lawyer who wouldn’t represent me until I was charged. The cost of defending myself pushed my family’s wealth back years and it’s going to be an uphill battle trying to recover. It also cost me sleepless nights of wondering when the police would come take me to jail. Aside from the mental health anguish it cost me and my wife who was diagnosed with stage 4 cancer during this time, I can’t interact with women the same anymore. I came from absolutely nothing and made it to briefings where I’m advising Generals and Admirals on adversarial matters of National  Security with high priority targets. I never even thought I’d make it this far coming from the projects, so for someone to be able to take all of that away with a lie is unconscionable. If I worked this hard to get what I’ve earned, what do do you think I was willing to do to keep it? The military has no recourse for false rape accusation victims so I’m wondering if anyone has ever sued their false-accuser and won! \n\nI’m a YouTuber and I’d love to do a video about this, but now may not be the time. I’ll need to consult with a lawyer after the FOIA comes back and then check to see if it would be a good idea. I don’t want a defamation suit against me for something that is avoidable. Now that the case is dropped, what resource do you recommend for justice? If you have no resource, that is fine, I’ll still appreciate your kind words, and I’ll still push forward and kill ‘em with success.\n\nTLDR: In the words of Cassidy, “I’m an innocent man, I’m just from the hood”.",
    "title": "Military False Accuser: Is There Any Justification?",
    "subreddit": "MensRights",
    "timestamp": 1679758326,
    "score": 46,
    "keyword": "asian judge"
  }
]