[
  {
    "text": "NYC coffee CEO, child of Vietnamese refugees, is using her influence to fight anti-Asian violence",
    "title": "NYC coffee CEO, child of Vietnamese refugees, is using her influence to fight anti-Asian violence",
    "subreddit": "asianamerican",
    "timestamp": 1615304408,
    "score": 109,
    "keyword": "asian ceo"
  },
  {
    "text": "Asian American CEOs Are Rare Due to Lack of Promotions",
    "title": "Asian American CEOs Are Rare Due to Lack of Promotions",
    "subreddit": "asianamerican",
    "timestamp": 1622055219,
    "score": 92,
    "keyword": "asian ceo"
  },
  {
    "text": "Out of the Loop: What happened this weekend with Jay Caspian Kang? A friend of mine asked me what I thought about the Twitter drama over the weekend around Jay Caspian Kang's new book. I see that Ellen Pao (former Reddit CEO) has tweeted critically of him, and that some of the Kang critics seem to be proud of the fact that they don't have to read the book anymore. \n\n1. What's the controversy? Does he paint \"Men's Rights Activists\" in too sympathetic a light? Is it about his argument that Asian American activism tends to make the most noise around stuff that affects the richest Asian Americans, rather than the high stakes stuff about health/safety of the poorer Asian Americans? Is it something else?\n2. There's some reference to Kang's past pandering to white supremacists. What's that about?",
    "title": "Out of the Loop: What happened this weekend with Jay Caspian Kang?",
    "subreddit": "asianamerican",
    "timestamp": 1634694472,
    "score": 68,
    "keyword": "asian ceo"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 35,
    "keyword": "asian ceo"
  },
  {
    "text": "A couple months ago, I asked for your guys' support to make a short film to raise awareness on anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. Today, the film is out- Watch it here.",
    "title": "A couple months ago, I asked for your guys' support to make a short film to raise awareness on anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. Today, the film is out- Watch it here.",
    "subreddit": "asianamerican",
    "timestamp": 1622230768,
    "score": 22,
    "keyword": "asian ceo"
  },
  {
    "text": "I’m Kristy Kim, and I’m an Asian CEO defying the bamboo ceiling. TomoCredit just raised a seed round of $7 million and we are ready to issue 1 million cards. I'm doing another AMA right now!",
    "title": "I’m Kristy Kim, and I’m an Asian CEO defying the bamboo ceiling. TomoCredit just raised a seed round of $7 million and we are ready to issue 1 million cards. I'm doing another AMA right now!",
    "subreddit": "asianamerican",
    "timestamp": 1614470215,
    "score": 18,
    "keyword": "asian ceo"
  }
]