[
  {
    "text": "I'm getting a D&E at 18weeks. We need not get into the hows of I got pregnant. Sufficed to say it is unplanned. I am chronicling the experience and sharing with you in hopes that I may be able to help someone else through my story.\n\nI am 34 and living in an Asian country that prohibits termination of pregnancy. I have tried to seek help within my own country but the fear of the illegality of it outweighed the fact that the science is sound. I do not judge the women who have chosen to take the option. You are far braver than I could ever be. I stand with my sisters in owning your own body and making your own decisions.\n\nI have flown to another country to ask for help. Since I'm too far along for any other procedure, it's going to have to be surgical. The cost is 10x more expensive. I can only cry at the hit my savings is taking.\n\nI've just come from a consultation with the doctor. He was really nice and tried to be as reassuring as he could. It was 10 minutes tops. I've read up on it prior and the procedure \"seems\" straightforward.\n\nI'm now lying in a hostel, gathering my thoughts, hoping that I am making the right decision.",
    "title": "I'm getting a D&E at 18weeks.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1495708804,
    "score": 13,
    "keyword": "asian judge"
  },
  {
    "text": "How to deal with catcalling-it's made me a reactive hot mess Twoxchromosomes, I need some advice on how to deal with catcalling? I know some women like it, and having spent time in countries where machismo culture is very strong I didn't feel endangered or nearly as angry in those cultures. I don't judge the women who feel sexy because of it.  But for me, I can't help but feel ashamed, righteous, humiliated and angry when it happens in my home city. Catcalling happens to me several times a day, no surprise here in New York.\n\n I'll go out of my way to avoid construction sites if there's one up ahead or if there's a group of men hanging out on the block. I try to dress so that I don't attract attention, and god help me when summer time shorts become necessary. I wish I could wear less covered clothing but every time I do I get way more attention and I regret my wardrobe choices. If I can \"feel\" a man's eyes on me as I pass by I can't help feeling disgusted, especially if he sticks his head in my path to leer at me as I pass. Some days I hate my face and body for attracting men, which duh isn't healthy. Among the most horrifying memories have been being followed down the street in the dark, cornered by groups of white men speaking to me in Mandarin (which isn't even a dialect I understand), Konichiwa-ed, grabbed on the ass, and jacked off to pants on and pants off. One time I gave some change to a guy and he had a blanket, I didn't realize he was jacking off as I spoke to him for a minute until he broke off mid-sentence saying \"UHN, I'm gonna come!\"\n\nIn part, I am angry because 3/4 of the time the comment I receive is about me being Asian, which I don't identify with as strongly because I'm a native New Yorker--not here to fill your passive Asian sex doll fantasy because I know just about as much as you do about China. Today, I lost control and I crossed a line for myself.\n\nA man was on his electric bike and whispered behind my ear, \"Hey pretty. Wanna come to bed sexy?\" Which I'm sad to say I don't consider that bad. But I reacted without thinking- turned around and shoved his bike down. He didn't even fall off, just put a foot down to catch himself and I lost my cool. Started yelling to him about how women don't like to be treated like objects. And he said, \"Don't take it so personally. YOU don't like it. YOU. You shouldn't be out here pushing people on the street.\" And then another guy came to his rescue and was like, \"calm down Mami, calm down\" (to further my outrage) and grabbed me by the shoulders and pushed me away from bike man. I walked away.\n\nUgh, what should I do? I've crossed my own threshold here--My reaction was rash and violent, and when I get catcalled I frequently replay violent scenes in my head of what I could have done instead of just walking away and ignoring them. I don't normally spend time thinking about the attention I get from men, and my anger usually subsides pretty quickly. But today was a game changer--I reacted with the intention of violence, and even though he wasn't hurt it's clear this whole catcalling situation is clearly messing with my thoughts and behavior. If you also hate catcalling, how do you deal?\n\nTLDR; sick of getting catcalled to the point where it's fucking with me big time and I don't want to think or act violently, advice?",
    "title": "How to deal with catcalling-it's made me a reactive hot mess",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1494464951,
    "score": 11,
    "keyword": "asian judge"
  },
  {
    "text": "Experienced a ton of sexism and racism in South Korea and need to vent You'd think this was a more appropriate post for the country's sub but, having read so many ~~white men~~ people there apologize for racism, I thought the sexism aspect would at least be appropriate here. **TL:DR at the bottom.**\n\nIt's probably my fault for not reading up on the 'bad' aspects of Korean culture, but I don't know many people who look for those things before visiting a country that has a modern-looking society. Being half Asian the racism and sexism I receive from my mother's homeland is minimal and tolerable. At 5'8\" I stand out. My plain features, brown skin and lankiness draw judgement because 'mixies' are meant to be pale and have more Anglo features. My bad. \n\nAnyway, my stay in Hong Kong and Taiwan was dope. So much to see and so much good food to eat! Shopping was cheaper than back home. Nice. The last leg was South Korea, the source of my mother's beloved K-Dramas and my opportunity to see snow for the first time. What I actually experienced was the opposite of dope. \n\nIt started as I got off of the plane. By far I was the tallest woman there. I stood near the exit and three people approached from behind whispering. I turn around to face my friend and the group glances at me with an audible sigh 'oh, negro'. It was a shock to hear someone refer disdainfully, out loud, to a person as negro. I wondered if they were seeing people who had dark skin or were African (American) around. When there was no person with brown skin other than myself close by I jumped to the conclusion that they might be talking about me and judged based on my features - big lips, booty and wide-ish nose. I dismissed it as me imagining things. \n\nThe next day I was in Meyongdong, a big tourist area, near my hotel. We rushed about and it was packed with stylish people and all the cheap makeup and street food we wanted. As I got bored I tuned in to the crowd around me. So, FYI, the locals LOVE to stare and make comments about foreigners in Hangul, and if they really want to speak their mind a descriptor or two in English as you walk by. By the time I made it back to the hotel I'd been called Japanese (called, not asked) and Chinese and Americano (anyone who can speak English) and... ni**er, once. I saw an African family on a train later with such miserable looks on their faces that I wondered if they were getting the same treatment.  \n\nNow sexism and internalized-mysogyny. Going in I knew Korea has impossibly high beauty standards and I was not exempt from judgement; not that I could hide given I was taller than most people as well as having brown skin. I believe women did not like that I was tall and thin as that is a huge ideal and the vast majority are smaller than 5'8\". Two other girlfriends who were with me have typical Asian height and features and were mostly ignored. Men especially didn't like that I was tall. Contrary to reports, Korean men did not appear any taller to me than other Asian men. So while women laughed as I walked by and grabbed their boyfriends to drag them further away, men got aggressive, like intentional shoves in crowds and 'tch-ing' as they would walk past. Old men turned around after seeing me as I approached. If I stood next to them in a crowd they'd move elsewhere. A kid walked by and called me a giant monster as his parents smirked. It was bewildering how frequent and constant this behavior was. Almost everyone I walked past was laughing or giving dirty looks. Even people some distance away. Christ. By the end of my 2nd day I tired of what was happening and concluded this was top of the range sexism and racism. [I Googled this shit and found that I wasn't alone and the issue is swept under the rug.](http://ireport.cnn.com/docs/DOC-1221602) [Open discrimination is not legislated against and foreigners complaints are dismissed](http://www.koreaobserver.com/nearly-all-foreigners-victim-of-discrimination-in-seoul-29001/). Great. Also found out that speaking English when not white invites scorn for being a snob and 'better' than Koreans, which they mocked me for too. Another layer of bullshit to deal with.\n\nOn the 4th day I had enough and stayed in my hotel. It was great tbh, but my travel companions who had typical Asian appearances thought I was crazy. I was fine with watching action movies all day instead of looking at the ground to try in an attempt to hide myself.\n\nBy the 7th day I was willing to face the music and go on the DMZ tour, which was amazing, then I had dinner and it was back to the bullshit. I decided to go out for the remaining couple of days anyway as I had recharged my spirit staying in the hotel and wanted to see what I could, which was a bad decision. I only remembered Gangnam was the capital of superficiality once I saw all the plastic surgery ads in the train station. Walking around there the laughs were louder and the men yelling 'You're a big girl!' was just enough evidence for my friends to start believing me. \n\nBy the end I was emotionally worn down. I was happy my flight was early morning but the abuse from other Korean travelers continued until I got off the plane in Singapore. The biggest irony was sitting in the departure lounge as a Korean woman walked past with a bag that said 'RACISM' with a cross through it. If I weren't so demoralized I would've laughed. \n\n**TL:DR - Beware of rampant, open, sexism and racism in Korea, and by all means do not be brown, tall and female. People defend Korea's nationalist monoculture and say 'you just have to deal with it' but you'd think there'd at least be some tiny courtesy to keep the racist and sexist comments quieter. Even sadder is that it's being taught to children. I don't hate Korea, it's a beautiful country, but I wish their culture did not foster so much ignorance. For *anyone* visiting there you'll need something tougher than thick skin.**",
    "title": "Experienced a ton of sexism and racism in South Korea and need to vent",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1484496487,
    "score": 4,
    "keyword": "asian judge"
  },
  {
    "text": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts https://sanfrancisco.cbslocal.com/2017/11/30/judge-suspensions-ok-albany-high-students-racist-posts/\n\nSAN FRANCISCO (AP) — An East Bay school district acted properly when it suspended five students who “liked” or commented on racist images on another student’s Instagram account that included nooses drawn around the necks of a black student and coach and comparisons of African-American women and students to gorillas, a judge has ruled.\n\nThe case raised thorny questions about how strictly schools can regulate student speech and whether “likes” on social media should be treated similarly to the original posts.\n\nU.S. District Judge James Donato said in his decision late Wednesday the five students contributed to disruption at Albany High School in the San Francisco Bay Area.\n\nThe judge rejected arguments that the Albany Unified School District violated the students’ free speech rights because the offensive posts were on a private account and made off campus.\n\nDonato said the accounts’ followers were mainly Albany High School students. The posts pictured students and school employees and created a risk of substantial disruption at the school, the judge said.\n\n“These cases establish that students have the right to be free of online posts that denigrate their race, ethnicity or physical appearance, or threaten violence,” he said. “They have an equivalent right to enjoy an education in a civil, secure, and safe school environment.”\n\nAn attorney for three of the students had no immediate comment. An attorney for the other two, Darryl Yorkey, said “liking” images does not necessarily express approval.\n\n“I think the judge took an opinion that many of us do in the older generations in assuming that a ‘like’ on its face is just that, ‘I like it, I approve of it,'” he said.\n\nHe said many of the students who were suspended over the images were Asian and were just trying to shock each other.\n\n“Taken out of that context, it definitely looks really bad,” he said. He did not immediately know whether his clients would appeal Donato’s ruling.\n\nA phone message left with the school district seeking comment on the ruling was not immediately returned.\n\nA male student identified in court documents only as “C.E.” created the account in November 2016 and posted on it over the next several months.\n\nOne post showed a screenshot of a female African American student that she had captioned, “I wanna go back to the old way.”\n\nC.E. juxtaposed an image on the student’s post of a white man beating a black slave hung by his hands, according to Donato’s ruling.\n\nSchool officials learned about the account in March. They called in mental health counselors to help calm students and contacted police over concerns references to lynching, nooses and the Ku Klux Klan in the posts could constitute threats of violence, Donato said.\n\nC.E. was suspended and later expelled. Donato upheld his discipline as well on Wednesday.\n\nBut the judge said the district went too far when it disciplined two other students. One followed the account but appeared to have done nothing else and the other commented that the account was “racism solely directed at black people” with an emoji of a laughing face, the judge said.\n\nThe judge overturned their suspensions.",
    "title": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts",
    "subreddit": "blackladies",
    "timestamp": 1512146276,
    "score": 28,
    "keyword": "asian judge"
  },
  {
    "text": "Dating question (possibly controversial) Throwaway because I know it's a bad attitude to have and the post may seem inflammatory, but I can't talk about this to my girl friends and I wonder if it's ever happened/currently happens to other black ladies.\n\n\nDo you or did you in the past refuse to date black men as a knee-jerk reaction to them taking us for granted, especially if we're dark skinned? Growing up, I was made fun of, ignored or overlooked by my fellow black classmates and the only boys who had anything nice to say about me were either mixed with a black mom or born of mixed parents themselves or not black at all.\n\n\nIn college, black guys finally seemed interested but only because they had noticed men of other races being interested in me. Some good black male friends of mine acknowledged that this was true, too. I didn't like that at all, it felt like I was only good if I was vetted by other races of men. Deep down, they weren't really attracted to me, they still thought I was inferior for being darkskinned and black (the same rules didn't apply to dark Indian or South East Asian women of course) but thought that surely, I couldn't be this ugly if I was popular with men of \"better\" races (according to them). Combined with seeing everywhere black men worshipping non black women (or playing the \"I have no preference\" card when literally every other race of men prefers their own) in general in the media as well as in my life, I immediately judge any black guy who shows interest in me and know from the beginning I won't date them. I feel like I'm \"sloppy seconds\" and the second a(nother) non-black (or mixed/light skinned) woman comes along, I'm gonna be dumped like hot coffee. It overrides their looks and personality, however pleasing they may be.\n\n\nI also don't want to reinforce their notion that dark black women will always be there and that they can always fall back on us and be welcomed with open arms, no matter how dismissive they've been on us beforehand.\n\n\nNow, I know that it's somewhat unfair to paint all black guys with such a brush. That's why I'm posting. I don't have problems with dating at all otherwise, but I know such thinking is problematic and wonder if other women have been in similar situations.",
    "title": "Dating question (possibly controversial)",
    "subreddit": "blackladies",
    "timestamp": 1492899682,
    "score": 19,
    "keyword": "asian judge"
  },
  {
    "text": "Law schools are filled with Asian Americans. So why aren’t there more Asian judges?",
    "title": "Law schools are filled with Asian Americans. So why aren’t there more Asian judges?",
    "subreddit": "asianamerican",
    "timestamp": 1500389784,
    "score": 111,
    "keyword": "asian judge"
  },
  {
    "text": "There are many Asian American attorneys, yet few are judges",
    "title": "There are many Asian American attorneys, yet few are judges",
    "subreddit": "asianamerican",
    "timestamp": 1489075176,
    "score": 81,
    "keyword": "asian judge"
  },
  {
    "text": "Born and raised As-Am but I refuse to be ashamed of who I am. I'm Chinese - and China has been stereotyped as the world's sweatshop, people with weird eyes, dog eaters and other undesirable things. I also grew up an Asian American, who didn't see race until late high school, but before I could fully understand it, I went back home to China. \n\nMy mom used to microwave vegetable buns she bought from Chinatown for my lunch and I used to bring all sorts of Chinese food for lunch. It got to a point where even other Asians in class started blaming me whenever they smelled something funky. I never once assumed that the way I looked or the food I ate was weird because that's who I was, though luckily for me, nobody made a big deal out of it because I grew up in a diverse neighborhood.\n\nBut as I grew older and traveled beyond my racially diverse, lower-middle class coastal American city, I've noticed that I've slowly become the \"other\" in society. I've begun slight changes in the way people approached me, a certain coldness or strangers acting weirdly confident around me because they assumed or knew I wasn't a local.\n\nWell, I now live in China and I'm past the age where anger was my response to the world. I've accepted that this is the way things are, and all I can say is - it's made things a lot easier for me. I'm a Chinese person who speaks great English and that's who I am - no more dwelling on what my cultural identity is or how I should change who I am just so I can fit in with everyone else. I don't have to be sorry for being Chinese abroad or the fact that I speak great English in China, and I do feel sorry for anyone who doesn't agree. What's there to lose? They'll judge you anyway, do as you wish.\n\nEven though I live in China now, I am still a citizen of another country in the anglosphere, and through that I hope to retain my Westernized Asian identity to the best I can. I also hope I can make friends with other non-Asians who settle in China, but only if they show they have a basic respect of the local culture. I also hope that, through charitable organizations, I can support non-Chinese, non-Han minorities who are born and raised here but sadly isolated from the rest of our society. Is it only because of my experience as an Asian American do I understand what it means to be \"other\", and I am better because of it.\n\nI will respect you when I'm in your house, and you will too when you're in mine - but I will make no concessions regarding who I am, and that applies wherever I go. Place your two feet firmly on the ground and make the world move for you. \n\nIt's that simple.",
    "title": "Born and raised As-Am but I refuse to be ashamed of who I am.",
    "subreddit": "asianamerican",
    "timestamp": 1486668786,
    "score": 39,
    "keyword": "asian judge"
  },
  {
    "text": "Mental Health. Dealing with shitty/racist stuff online So in this age it's easy to find stuff online that will outrage you, especially with the whole \"edgy culture\" and current polarized political situation right now. But I'm just curious how y'all dealing with shit online that you disagree or just find abhorrent. \n\nLike usually I stay away from this, but have yall seen YouTube comments before? Especially on videos relating to Asians it's downright vile & there's often to \"humor\" to it. Just insults, racism & punching down - esp with that whole uprising of \"alt\" ppl\n\nAn example of this is just a vid like [this.](https://youtu.be/k_Az5FCe6yc) Tell me what y'all think about this. It kinda saddens/infuriates me that the host in the vid is judging all these Asian-American comedians by just insulting their backgrounds \"You think America is bigoted against Muslims? Well India & Asia suck even more!! You are ungrateful minorities!\" and things of that nature.\n\nI usually try to stay away from vids & dark parts of the net like that where I know it'll get me mad/depressed or affect my mental health. But sometimes I get morbidly curious about this kinda stuff, look it up, and the shitty/racist nature of it all just kinda makes me hopeless. \n\nSo how do y'all deal with it? I feel like it takes a toll on my mental health and it lingers in my head for too long. Ugh, what do y'all do/think bout all this? \n\n**Tldr:** See bad/racist/bigoted stuff online (or shit I vehemently disagree with). Get mad & sad. Affects my mental health - stays in my head & thoughts too long. How do I deal with it? ^^help",
    "title": "Mental Health. Dealing with shitty/racist stuff online",
    "subreddit": "asianamerican",
    "timestamp": 1513967357,
    "score": 24,
    "keyword": "asian judge"
  },
  {
    "text": "Anyone ever go back to visit your respective Asian countries and felt more at home there than in the US? Went on vacation with my family in China recently and just got back. Find myself really missing my time there, though it may just be post-vacation blues. For once in my life, I did not stand out in a crowd, everyone looked like me. I didn't feel like I was being judged, even though that's probably not the case in the US but I just *feel* differently here. I have a good job in the US though I hate my coworkers but I could see myself working in China (specifically Hong Kong). I'm hoping to go back already sometime this year.\n\n\nMaybe it's because I'm not enjoying my current job, which takes up a lot of my time. My close friends here are all white and though we've known each other for a long time, it's just different not having any Asian or Asian American friends may who have gone through the same experiences I have. \n\n\nAnyone feel similarly after visiting their roots in Asia?",
    "title": "Anyone ever go back to visit your respective Asian countries and felt more at home there than in the US?",
    "subreddit": "asianamerican",
    "timestamp": 1490114314,
    "score": 15,
    "keyword": "asian judge"
  },
  {
    "text": "The real reason women are not represented in tech First, I want to clarify I do not agree with the basis that women are not biologically suitable for roles in tech. I am much more inclined to believe it has to do with culture, and a good hard example against women being biologically inferior would be the country of Iran, where women make up the majority of engineers. Now granted, Iran has segregated schools between men and women, and they are under a theocracy, but if your basis was of biological merit, then this would be a good hard example to prove otherwise.\n\nNow, I will say that culture, primarily American culture, plays a huge role. \n\nLet's think back to middle school tech-ed courses, and think of the demographic in play. White/Asian nerdy boys primarily, a few hispanic and black nerds, and once in a while a nerdy girl. \n\nThis demographic holds true throughout high school. I would know, I was a guy who took tech ed courses in middle school/high school between two secondary schools, and this demographic holds true in hackathons, coding conventions, tech conventions, and..... tech jobs!\n\nBut why? Why do women, aside from a minority number, shy away from tech? Because of nerd culture. Yep, I'm just keeping it 100% honest here. Nobody likes nerds, besides other nerds. As someone who graduated from high school in 2015, the same stereotypes from 2-3 decades ago still hold true.\n\nNerds don't have friends to sit with at lunch, they are too autistic to make friends, and ESPECIALLY girlfriends, they are easy to pick on, and on the social hierarchy in high school they are at the very bottom.\n\nSo they fall back on tech, video games, and porn. And now you know why 90% of league players are males, just as the majority of competitive PC gamers are males. Men have a culture to fall back on, women do not. If women try to join this culture, lets say they play league, they will get hit on constantly for being a women. It's not fun, unless your aim is to make money from it by being a titty streamer of course.\n\nCompare this to a country like Iran, where western high school culture is non-existent, girls and boys are separate until 18, and girls are brought into tech collectively, where they can enjoy the subject without being hit on constantly, and without being judged.\n\nThis is not to say we need a theocracy. Hell, I'm agnostic myself. But I am saying that different cultures breed different peoples, and that our current nerd-normal people-jock culture cannot produce an equal outcome for both genders.\n\nUnless of course we mandate the subject, which could change things drastically. \n\nLooking forward to hearing your thoughts.",
    "title": "The real reason women are not represented in tech",
    "subreddit": "Feminism",
    "timestamp": 1502563805,
    "score": 9,
    "keyword": "asian judge"
  },
  {
    "text": "Ontological Commitments, Sex and Gender, by Mari Mikkola Excerpt from \"Feminist Metaphysics - Explorations in the Ontology of Sex, Gender and the Self\", edited by Charlotte Witt.\n\n***\n\n\n**Abstract**\n\n\nThis chapter develops an alternative for (what feminists call) “the sex/gender distinction”. I do so in order to avoid certain problematic implications the distinction underpins. First, the sex/gender distinction paradigmatically holds that some social conditions determine one’s gender (whether one is a woman or a man), and that some biological conditions determine one’s sex (whether one is female or male). Further, sex and gender come apart. Taking gender as socially constructed, this implies that women exist mind-dependently, or due to productive human social activities; thus, it should be possible to do away with them just by altering the social conditions on which gender depends. In addition, some feminists take gender to depend on oppressive social conditions. Changing our social environments, then, would not only unwittingly eradicate women; doing away with women should be feminism’s political goal. I argue that both implications are unacceptable. In response, I argue for a view that is more congenial to ordinary thinking and that doesn’t have the goal of eradicating women.\n\n**Introduction**\n\nThis chapter develops a model, which I will call “the trait/norm covariance model”, as an alternative for understanding the phenomena feminists usually discuss under the rubric of the sex/gender distinction. This well-known distinction gives rise to certain problems that motivate the formulation of my alternative model. Specifically, I have in mind here problems arising from the conventionalist and abolitionist implications that the distinction underpins. First, consider the conventionalist implications: paradigmatically, some social conditions must be met in order for one to count as a woman or a man because gender is (as the slogan goes) socially constructed. One need not satisfy any biological or anatomical conditions; they are relevant only for counting as female or male. On this understanding “woman” and “man” are used as gender terms, “female” and “male” as sex terms.  The implication is that women and men exist mind-dependently or due to productive human social activities: that there are women and men ontologically depends on some social institutions and agents, their beliefs, practices and/or conventions in that women and men could not exist unless the relevant institutions, practices and conventions (with conscious agents upholding them) existed. Women and men are akin to wives, husbands and US senators that also depend on us for their existence.  This being so, it should be possible to do away with women and men while leaving the individuals we call “women” and “men” otherwise intact–we simply alter those social conditions on which gender depends so that individuals no longer count as women and men. Consider a parallel to US senators: their existence depends on certain sociopolitical conventions so that were a political revolution to alter those conventions by abolishing the US Senate, US senators would literally vanish overnight. Those individuals who previously counted as US senators would no longer do so despite being otherwise physically intact (presuming the revolution were a bloodless one). Just as one need not execute US senators in order to eradicate them, the thought is, eradicating women and men does not require physically altering those individuals we think of as women and men. Second, consider the abolitionist implication: in addition to holding a conventionalist view, some feminists take gender to depend ontologically on oppressive social conditions. As a result, changing our social environments would not only unwittingly eradicate women and men: doing away with gender should be feminism’s political goal.  \n\n\nAs I see it, both implications are problematic and ones that many ordinary social agents are unwilling to accept. Ordinarily, women are thought to be human females, men human males. As a result, their existence is not thought to depend on productive human social conventions, practices and institutions so that we could abolish women and men leaving intact females and males simply by altering our social landscapes. Conventionalist implications, then, are unintuitive. Further, ordinary social agents often find the abolitionist implication that “after the revolution” women and men will no longer exist objectionable. Many of my students, along with other feminist philosophers, do not see being a woman or a man as problematic per se. Rather, the problem is how we are viewed and treated as women and men. For ordinary thinking, then, the idea that feminists should aim to do away with women and men harbors undesirable ontological commitments.\n\nThese problems are generated by a clash between the paradigmatic feminist and everyday conceptions of sex and gender. Ordinary thinking does not separate sex and gender in the way many feminists do, thus neither seeing the existence of women and men as mind-dependent nor holding that gender is something to be eradicated. We can avoid this clash in one of two ways: either feminists work hard to modify everyday conceptions of sex and gender so that they are in line with the conventionalist and abolitionist views, or feminists modify their conceptions of sex and gender so that they are closer to everyday thinking. Here I will endorse the latter option and propose a way to conceptualize the phenomena usually discussed under the sex/gender distinction to avoid the unintuitive and undesirable ontological commitments. I will do so by developing what I will call “the trait/norm covariance model” to replace the usual sex/gender distinction. My alternative model will involve redrawing the boundaries of the sets of gender and sex traits and dividing these traits into new sets: descriptive traits (traits of which there is “a fact of the matter”) and evaluative norms (norms that express judgments about descriptive traits). For instance, the paradigmatic gender trait of wearing make-up and the paradigmatic sex trait of having ovaries will both count as descriptive traits (one either has ovaries/regularly wears make-up or not). But, my model also acknowledges the influence of social norms: certain evaluations (like being judged to act, be or appear “feminine”) can be seen to covary with particular descriptive traits, which accounts for why some traits are supposedly appropriate for women and others for men.4\n\n \n\n\n4\nBy way of illustration, I will consider Sally Haslanger’s fascinating and innovative recent account of gender (“Gender and Race”; “Future Genders”; “Social Construction”), which has the conventionalist and abolitionist implications. Next, I will examine what precisely is problematic about these implications in order to motivate my alternative model. I will then outline my trait/norm covariance model, ending with a discussion of how it avoids the problematic ontological commitments considered.\n\n**Haslanger on Gender: An Example**\n\nHaslanger’s account of gender has conventionalist and abolitionist implications: it takes the existence of women and men to be mind-dependent in the sense of depending on human social practices and conventions, and it takes these conventions and practices to be oppressive—for her, since gender is a product of oppressive social forces feminists should aim to eradicate it. These implications are underpinned by a distinction between sex and gender that many feminists have historically endorsed. Paradigmatically: “sex” denotes human females and males depending on some biological features (like chromosomes, sex organs, hormones or other physical features to do with reproduction) whereas “gender” denotes women and men depending on some social factors (like social role, position, behaviour or identity). As is well known, the motivation for drawing the sex/gender distinction was to counter biological determinism that took some (supposedly) biological facts to explain behavioural and psychological differences between women and men. Instead, feminists argued that these differences have social causes. They distinguished biological and social/psychological differences and began using the term “gender” to denote the latter. For instance, Gayle Rubin (who was one of the first feminists to articulate this distinction) used the phrase “sex/gender system” in order to describe “a set of arrangements by which the biological raw material of human sex and procreation is shaped by human, social intervention” (165). For Rubin, although sex differences are fixed, gender differences are the oppressive results of social interventions that dictate how women and men should behave: women are oppressed as women and “by having to be women” (204). For her, gender is the social interpretation of sex and an oppressive one at that. However, women’s oppression is mutable by political and social reform that abolishes gender. As Rubin saw it, feminism should aim to create a “genderless (though not sexless) society, in which one’s sexual anatomy is irrelevant to who one is, what one does, and with whom one makes love” (204).\n\nFor Haslanger, gender is constitutively constructed: in defining it we must make reference to social factors (“Ontology and Social Construction” 98), and, in particular, we must make reference to unequal social positions (“Gender and Race” 37–43). In so doing, Haslanger aims to debunk the ordinary view that gender classification is a matter of anatomy. Commonly, being female is thought to be sufficient for womanhood; Haslanger, on the other hand, takes the conditions for satisfying “woman” to be social rather than biological. Her project involves showing that although the use of the term “woman” is thought to track a group of “individuals defined by a set of physical ... conditions [it] is better understood as capturing a group that occupies a certain ... social position” (“Social Construction” 318). And the social positions that our gendered classification scheme tracks and that make gender ascriptions apt crucially involve reference to subordination and privilege. For Haslanger, societies in general tend to “privilege individuals with male bodies” (“Gender and Race” 38) so that the social positions they subsequently occupy are better than the social positions of those with female bodies. And this generates sexist injustices. For her:\n\n>S is a woman if [by definition] S is systematically subordinated along some dimension (economic, political, legal, social, etc.), and S is “marked” as a target for this treatment by observed or imagined bodily features presumed to be evidence of a female’s biological role in reproduction.\n\n>S is a man if [by definition] S is systematically privileged along some dimension (economic, political, legal, social, etc.), and S is “marked” as a target for this treatment by observed or imagined bodily features presumed to be evidence of a male’s biological role in reproduction (“Future Genders” 6–7).\n\nThese are constitutive of being a woman or a man: what makes calling S a woman apt is not that S is female, but that S is oppressed on sex-marked grounds; what makes calling S a man apt is not that S is male, but that S is privileged on sex-marked grounds.\n\nHaslanger acknowledges that debunking projects like hers sometimes require a “radical change in our thinking” (“Social Construction” 319). After all, her proposal is counterintuitive: privileged females like, arguably, the Queen of England would not count as women on this view. But Haslanger’s project does not aim to capture what ordinary language users intuitively have in mind and her aim is not to illuminate our commonsense understandings of gender terms. Haslanger’s analysis is, in her terms, ameliorative: it aims to elucidate which gender concepts best help feminists achieve their legitimate purposes thereby elucidating those concepts feminists should be using (“Gender and Race” 33).  That is, endorsing her classification scheme is a pragmatic political choice. And (Haslanger holds) feminists should choose her account of gender since it will be helpful in feminist fights against sexist injustices enabling feminists to identify and explain persistent inequalities between women and men in terms of their social positions. Insofar as Haslanger takes being a woman to be a social matter crucially tied to oppression, she holds that “it is part of the project of feminism to bring about a day when there are no more women (though, of course, we should not aim to do away with females!)” (“Gender and Race” 46). Since what it is to be a woman is by definition tied to sexist oppression, gender justice would eradicate women by abolishing those social structures that are responsible for sex-marked oppression. Women and men could not exist, unless sexist oppression existed; that women and men exist is mind-dependent being the result of oppressive human social activities. And feminism’s goal should be to dismantle those social structures responsible for gender and, by extension, women and men.\n\nProblems with the Conventionalist and Abolitionist Implications\n\nEarlier I claimed that ordinary thinking finds the conventionalist and abolitionist implications of accounts like Haslanger’s problematic. I also claimed that these problems are underpinned by a clash between different conceptions of sex and gender. Let’s examine the worries in more detail.\n\nThe Conventionalist View Is Unintuitive\n\nFor Haslanger (among others) gender depends on something social and not on anything biological. This prima facie makes being a woman ontologically on a par with being a US senator, a wife or a landlord. And, it seems, just as one can cease to be a wife by changing one’s social relations (by getting a divorce), one should be able to cease to be a woman by changing those social relations constitutive of womanhood. But a closer examination suggests that being a woman is not ontologically on a par with (say) being a wife. To tease this out, consider the following claims:\n\n(1)\tFor a week last summer, James was a woman.\n\n(2)\tFor a week last summer, James was a US senator.\n\nThese statements take “woman” and “US senator” as social notions. The first takes womanhood to be about easily perceptible gender markers like clothing and appearance (James lived “as a woman” for a week last summer). The second takes James to have been treated in ways that enabled him to count as a US senator for a week (for instance, James was elected to the US Senate, but due to a political scandal lost his position very quickly). Now, consider:\n\n(3)\tAfter seeing John’s body, I realised that John is a woman.\n\n(4)\tAfter seeing John’s body, I realised that John is a US senator.\n\nThese claims are not about social factors. We can understand claim (3) and it makes sense to us, although we are clearly using “woman” as a biological term. However, when we substitute “woman” for “US senator” in (4), the statement no longer makes sense to us. After all, just by looking at one’s body, it’s not possible to know that one is a US senator. That is, when used as a social term, “woman” is on a par with “US senator”. But we can also use “woman” as a biological term, which makes “woman” and “US senator” come apart. The upshot of this is that “woman” is not a purely social term ; for ordinary thinking, then, being a woman is not on a par ontologically with what it is to be a member of some other social kind. And this suggests that it is not obviously true that women and men’s existence is minddependent in that one can cease to be a woman (or a man) just by altering one’s social environment. Because ordinary thinking does not see being a woman as a purely social matter, conventionalist implications (like the implication that we can eradicate women and men via change in our social environments) are hard to accept. The paradigmatic feminist distinction between sex and gender clashes with everyday thinking. Due to this, ordinary thinking doubts the possibility of eradicating gender via social change, because it ties sex and gender together.\n\nA defender of the conventionalist view might hold that claim (3) doesn’t really make sense either, but we are fooled into believing that it does precisely because ordinary thinking ties sex and gender together when it shouldn’t. So, if we thought about womanhood in the right way, we would see that (3) is also senseless. That would leave claim (1) where “woman” is a social notion making it akin to “US senator”. My worries about unintuitive ontological commitments are dispelled prima facie making it possible for one to cease to be a woman just by altering one’s social environment. But this raises some further questions that the defender of the conventionalist view must answer: Precisely what kind of social change would abolish women and men? Which beliefs, social conventions, linguistic practices and relations would have to be altered for one to no longer count as a woman or a man? And which social institutions, relations and structures would have to be dismantled so that women and men were to cease to exist wholesale? These questions cannot be answered in any intuitively obvious introspective manner. In fact, answering them is the stuff of feminist philosophy and a huge point of contention. Admittedly, this contention may be generated by gender being such an incredibly complex phenomenon that discerning the kind of social change that would eradicate it is extremely difficult; we may simply be ignorant of the kind of change needed, but it is possible to eradicate gender via social change. This may be so. But it may also be that feminists cannot agree on what social changes would do away with women and men because doing so just by altering one’s social environment is not possible. Bluntly put, perhaps it is just plain wrong to think that women and men’s existence ontologically depends on some social factors. I am not concluding that it is; I am merely making a strategic point. The issue of, on which social conditions the existence of women and men depends, is so intractable as to be unhelpful. If gender really is such a complex issue that it is hugely difficult (if not impossible) to articulate and agree on what sort of social change would eradicate it, the most useful move would seem to be to give up the quest. Pragmatically, feminists should not try to uncover which social factors are responsible for the existence of women and men, but, instead, should settle for the much less contentious view that human actions significantly shape the way we are as women and men. No feminist (to the best of my knowledge) denies this claim. The concerns I have raised here are not decisive and do not rule out conventionalism about gender altogether. But, as I see it, the less contentious view I have floated here is the one that feminists ought to endorse precisely because of its less contentious commitments. \n\n**The Abolitionist Implication Is Undesirable**\n\nOn views like Haslanger’s, gender is also a product of oppressive social conditions and, thus, something feminists should seek to abolish. But this abolitionist view may not be conducive to feminist interests since for ordinary thinking it harbours undesirable ontological commitments. To tease this out, contrast such abolitionist strategies with a different (what I will call) “re-evaluative” strategy. They both have the same starting point: feminism is about ending oppression that women as women face. But their ways of achieving this goal differ, which alters the strategies’ outcomes. Abolitionist accounts take womanhood to be by definition tied to oppression so that it is not possible to be a woman and not be (in some sense) oppressed. Reevaluative accounts do not take being a woman to be per se oppressive. Instead, they recognise that our social circumstances create environments where women are viewed and treated in ways that disadvantage them, perhaps by associating some traits with women and using this association to justify disadvantageous treatment. Nonetheless, by altering how women are viewed and treated it is possible to be a woman and yet not be oppressed. So, on the former view, gender justice would dismantle unjust social hierarchies thus doing away with women and men; on the latter, it would dismantle such hierarchies while retaining women and men (roughly) in a re-evaluated sense.\n\nThe strategy to follow comes down to a pragmatic political choice. But if ordinary social agents think that eradicating gender is undesirable, it may be strategically wrongheaded to endorse an account of gender that has abolitionist implications. Some anecdotal evidence supports this: my feminism students tell me time and again that they think the abolitionist strategy is aiming to eradicate something that need not be eradicated—the “feminist revolution” need not do away with gender and doing so would result in (at least some) good being unnecessarily lost. Many insist that the ways in which people are treated as woman and men is the problem feminists should focus on—being a woman or a man is not primarily the problem. And many claim to find their gender a source of positive value. After all, it is certainly true that, although one may be discriminated against due to one’s gender, it can still be something one values positively; in a similar sense, one can take pride in one’s racial group membership despite being socially disadvantaged by it. The everyday conception of gender clashes with feminist conceptions like Haslanger’s. As a result, ordinary thinking doubts the viability of eradicating gender because it sees gender as being at least partly a positive social identity rather than being a wholly negative one.\n\nProjects like Haslanger’s do, of course, start by aiming to alter the ways in which we are viewed and treated as women and men. So, in a sense, the abolitionist and re-evaluative routes go hand-in-hand to begin with. But the abolitionist strategy runs into difficulties if many social agents are unwilling to follow it through. Haslanger is asking for a significant shift in people’s self-conceptions and acknowledges that she is asking social agents to understand themselves in ways that are not ordinarily part of their gendered self-understandings (“Gender and Race” 48). In so doing, she is “call[ing] upon us to reject what seemed to be positive social identities” and to refuse to be gendered women and men (“Gender and Race” 48). I agree with Haslanger that a change in our self-understandings is called for; but I wonder if the change that she is calling for is the right kind of change given that ordinary thinking does not see the viability of eradicating gender. Again, my point is strategic: accounts that have abolitionist implications are likely to be extremely demanding. It will take a lot of convincing to make ordinary social agents view their gender as not being even in part a positive social identity and to make them refuse to be gendered women and men, if social agents do not believe to begin with that this is necessary. And, one might wonder, whether scarce feminist resources should be directed at something other than trying to convince social agents to revise their self-understandings in this manner.\n\nFortunately my students always do express a desire to see an end to gendered oppression. And clearly this is what Haslanger also wants, which may suggest that really the parties to the debate are just talking past each other. Everyone wants the same thing: gender justice. Haslanger’s rhetoric just differs from how we ordinarily talk about women and men. Usually, acknowledging this does not dispel my students’ worries; they still find it puzzling that Haslanger doesn’t use gender terms as people ordinarily do and wonder why she is confusing matters with her conception of gender. Of course, Haslanger’s rhetoric has a specific, valuable purpose: to motivate a certain kind of social and political response that undermines sexist oppression. But, given the kinds of worries I have mentioned here, strategically I think that this kind of response can be better motivated by understanding the phenomena feminists discuss under the rubric of sex and gender in a way that does not imply women and men no longer exist “after the revolution”. The worry is that accounts with abolitionist implications probably would not motivate positive social change, if this change requires that social agents must give up something they do not want to give up.\n\n**The Trait/Norm Covariance Model**\n\nThis section develops my trait/norm covariance model as an alternative to the sex/gender distinction. To begin with, it is important to note that, contrary to traditional feminist views, I do not take the term “woman” to be a purely social gender term. Ordinary speakers have, to use Ron Mallon’s terminology, indicative features in mind when they call someone a “woman”:\n\n>there is a distinction between those properties that are indicative of category membership (such as easily perceptible racial [or gender] markers), and those that are central. A property is indicative of category membership if having the property increases the likelihood that one is a member of a category. In the United States wearing a dress is indicative of being a woman ... [But w]earing a dress is neither necessary nor sufficient for being a woman.\n\n(652–3)\n\nIndicative features of womanhood include one’s appearance (clothing, hairstyles, make-up); behavioural patterns; social roles; and anatomical and bodily features (body type, shape, size, amount of body hair and how one “carries” one’s body). These features are conceivably involved in everyday gender ascriptions. Paradigmatically, feminists hold that the indicative features mentioned are not exclusively gender traits in that they include features which are taken to be paradigmatic sex traits (to do with being female or male). But, ordinary language users often deploy “woman” on the basis of anatomical sex features such as body type; “woman” is not a purely gender term for them, but (bluntly put) a mixture of sex and gender. So, ordinarily “woman” denotes individuals who are taken to possess features indicative of womanhood. This does not (and certainly should not) limit the application of “woman” to women-born-female; the term also applies to trans women, individuals “assigned male at birth whose gender presentation may be construed as ‘unambiguously’ female” (Bettcher 46), who call themselves “women”.\n\nMy contention is that feminists should use the term “woman” as ordinarily as possible. And the trait/norm covariance model that I will outline next will be sensitive to these reflections about ordinary language use. The model I am proposing deals roughly with the same phenomena that the sex/gender distinction does. It just understands that phenomena in a different way that is, I submit, more fruitful in being more congenial to everyday thinking. On my view, we redraw the boundaries of the sets of gender traits and sex traits giving up the labels “sex” and “gender” to denote those traits. Instead, the traits are divided into sets of descriptive traits and evaluative norms. The former (in a sense) describe “the way the world is” and include physical and anatomical traits (e.g., chromosomes, ovaries, testes, genitalia, body shape and size), one’s appearance (e.g., one’s clothing, make-up, haircut, amount of body hair), roles (e.g., whether one undertakes caretaking roles, engages in childrearing tasks) and self-conceptions (calling oneself a woman or a man). These are features of which there are “facts of the matter”—it isn’t in any sense mysterious or down to value judgements whether one has ovaries, undertakes childrearing tasks, or calls oneself a woman. (This does not mean that values were not involved in singling out descriptive features, like anatomical traits, or that descriptive features are not socially malleable; but more on this shortly.) Evaluative norms are to do with stereotypical judgements: whether one is judged to be, to appear to be and/or to act in ”feminine”, ”masculine” or “neutral” ways. Evaluative norms attributed reflect value judgements and cultural norms. So, on my and the paradigmatic feminist schemas:\n\n Paradigmatic feministmodel|.. |Trait/normcovariancemodel | ..\n--------------------|----------------------|--------------------------|----------\nSex\t               |Gender                 |Descriptive traits\t   |Evaluative norms\nHaving ovaries\t|Wearing make-up |Having ovaries\t           |Being “feminine”\n\t                |Being “feminine”   |Wearing make-up\t|\n\nWhat does it mean to say that evaluative norms covary with descriptive traits? Just that we take certain traits to be of certain kind. So, the trait/norm covariance relation is constituted by particular descriptive traits being viewed in a particular manner by us. I take “femininity” to mean “associated with women”, “masculinity” to mean “associated with men” and “neutrality” to mean “associated with neither or both”. That is, depending on how we view particular descriptive traits, they either covary with femininity, masculinity or neutrality. And certain trait/norm pairings are currently linked to women, others to men and still others to neither or both. They can be so linked in a global or (more often than not) in a local manner. For instance, being short-sighted is globally neutral: as far as I know, the trait is nowhere associated exclusively with either women or men thereby globally covarying with neutrality. Then again, possession of testes appears to be globally masculine, possession of ovaries globally feminine. Quite often, though, the trait/norm pairings are local differing from one context to the next and depending on social and cultural factors. So, although all cultures have traits that covary with femininity and others that covary with masculinity, the configurations of these trait/norm pairings can differ depending on their location. To illustrate, take long hair. In many UK communities it is no longer strongly associated with women and often covaries with neutrality. However, in UK Asian-Indian communities that do not consider it appropriate for those picked out by “woman” to have short hair, having long hair covaries more strongly with femininity. But, of course, other social and cultural axes affect this covariance relation even within a culture: in many UK Indian Sikh contexts, neither men nor women are expected to cut their hair, which suggests that (in these social contexts) having long hair covaries with neutrality. However, in these contexts, other practices to do with hair covary with femininity and masculinity, like the practice of Sikh men wearing turbans. The trait/norm pairings are interrelated: with those picked out by “man”, the pairing “having long hair/neutrality” is interrelated with “wearing a turban/masculinity”; but for those picked out by “woman” the former pairing is not interrelated with the latter pairing. (For more on Asian social conventions to do with hair, see Hiltebeitel and Miller.) The trait/norm covariance relations can also change over time. Wearing trousers is a good example: until quite recently in many Western Anglo-European contexts, masculinity covaried with it. But, relatively quickly, in many contexts it has become neutral. It is now socially acceptable for someone ordinarily picked out by “woman” to wear trousers. The same social value is no longer attached to this trait. Of course, this all further demonstrates that the ways in which the trait/norm covariance relations pan out are not always straightforward. Since the relations depend on beliefs and conventions that change over time and place, they will usually be manifestations of some local and contextspecific beliefs and conventions. There are many complications not least because of differences in contexts and in what norms social agents project on descriptive traits. Nevertheless, it seems fair to say that sometimes seeing how the relations pan out is not complicated and that sometimes social agents do not differ significantly in their ascriptions of norms.\n\nI have said that certain descriptive traits covary with certain evaluative norms, but what explains this covariance relation? I take the existence of this relation to be a thoroughly mind-dependent matter. If you like, wearing make-up and engaging in child-care (to name two descriptive traits) are not inherently or mind-independently feminine–that femininity covaries with them is something that depends for its existence on social factors and obtains because of us. The classification scheme of feminine, masculine and neutral evaluative norms is a strong pragmatic construction; that is, social factors wholly determine our use of the scheme and the scheme fails to represent accurately any “facts of the matter” (Haslanger, “Ontology and Social Construction” 100). So, the classification scheme does not pick out any mind-independent facts about descriptive traits. That some traits are viewed as feminine, masculine or neutral is a consequence of “human-made” fashions, styles, cultural beliefs, social conventions and linguistic practices, which determine what features are judged to be of what kind. The classification scheme of feminine/masculine/neutral is a mere social construction. Furthermore, this scheme tends to be hierarchal in grading traits; this is evident from the devaluing of many activities and features with which femininity covaries (like the devaluing of caretaking work).\n\nOn my model the claim “Jane is feminine because Jane wears make-up” does not capture any mind-independent fact about the world. Yet, my model also takes wearing make-up to be a descriptive trait of which there is “a fact of the matter”. So, it appears that saying Jane wears make-up does capture something mind-independent about the world. It is worth clarifying the notion of mind-independence here to avoid an air of inconsistency. Consider driving. In the United Kingdom, people drive on the left-hand side of the road; in the United States, they drive on the right. Which convention is the correct or true one? We cannot say because the context-specific conventions that govern driving are mind-dependent: they depend for their existence on productive human social practices and require that certain human-made background conditions are in place. Such conventions are, of course, mutable. The UK government could just decide to alter conventions governing driving. Obviously doing so in practice would be hugely difficult and certainly no easy feat. But the point is that ultimately conventions come down to us—there is no mind-independent fact about which side of the road is the correct side for driving. However, that people drive on the left in the United Kingdom is mind-independent in another sense. When I state “People in the United Kingdom drive on the left” I am stating something that is true mind-independently: the truth of the statement is not (if you like) up for grabs. I cannot just decide that the statement is false and drive on the right. (Or, I could, but probably with quite tragic results.) So, given certain background conditions, it is a mind-independent fact that in the United Kingdom people drive on the left irrespective of the fact that the convention to drive on the left is minddependent.\n\nThe descriptive trait of wearing make-up is akin to the convention of driving on the left: it is mind-dependent in that it is a trait that depends for its existence on particular human-made social conditions (it requires that certain human-made background conditions are in place). The trait is also socially mutable: wearing make-up might, for example, go out of fashion thus prompting people to abandon the practice. Nonetheless, that Jane wears make-up is (in another sense) mind-independent. The truth or falsity of the statement “Jane wears make-up” is not up for grabs: either she does or she doesn’t. This is akin to the claim “People in the United Kingdom drive on the left”: however mind-dependent—due to productive human activities— the respective conventions (to drive on the left and to wear make-up) are, whether the statements “Jane wears make-up” and “People in the United Kingdom drive on the left” are true or false is not open to debate given our current conventions. By contrast, the claim “The convention to drive on the left is better than the convention to drive on the right” is utterly mind-dependent. Whether this statement is thought to be true or false depends on one’s view or opinion, in addition to the convention to drive on the left being a product of human social practices. \n\nNow, although it is a mind-independent feature of reality that Jane wears makeup, that Jane acts in a feminine way because she wears make-up is mind-dependent. It does not capture any mind-independent facts about the world, like some supposed fact that the practice of wearing make-up is inherently feminine. That femininity covaries with wearing make-up is mind-dependent obtaining due to productive human activities—because of us. This further illustrates that the trait/norm covariance relation is not a causal relation in the sense that the former causes the latter.\n\nChildcare activities or the practice of wearing make-up do not cause femininity to covary with them; rather, our beliefs and judgements cause this. To illustrate, think about morality. Standardly moral philosophers agree that the act of giving to charity covaries with moral goodness. But does the act cause moral goodness? This depends on one’s metaethical commitments. For some moral realists, the answer might be yes: the act of giving to charity instantiates a realist (non-natural) moral property of goodness. So, the act of giving to charity literally causes moral goodness to pop up in the world because one’s actions instantiate the property of goodness. For moral constructivists, however, the answer might be no: the act of giving to charity covaries with moral goodness because we project moral goodness onto the act of giving to charity. Roughly, we have constructed a moral world in which giving to charity is considered good. So, the relation between giving to charity and moral goodness is not a causal one in that the former causes the latter. That giving to charity is considered to be morally good is down to us. The same appears to be true of what I have said about descriptive traits and evaluative norms: we have constructed a gendered world in which childcare and wearing make-up are considered to be feminine. That is, we— human social agents—are responsible for these covariance relations. And this being fortunately the case, we can also alter them so that childcare, for instance, no longer covaries with femininity.\n\n[continued below](https://www.reddit.com/r/Feminism/comments/6yp60e/ontological_commitments_sex_and_gender_by_mari/dmp1uid/)",
    "title": "Ontological Commitments, Sex and Gender, by Mari Mikkola",
    "subreddit": "Feminism",
    "timestamp": 1504809523,
    "score": 5,
    "keyword": "asian judge"
  }
]