[
  {
    "text": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me So I started a new job. I'm a teacher (technically curriculum director but just a fancy title for writing repots while teaching) . My second day my supervisor held a meeting to yell at us all for not replying to his text message. I just sat there to gauge how everyone reacts. No one said anything. I have been here now 2 months and he is not a nice person.\n\nThings he doesn't like or respect: women, Asian people, African people, or his own wife (he jokingly called her an uneducated hillbilly)\n\nHe told me yesterday he paid for my time so he can text me whenever he feels like it after I told him to not text me at home about work stuff. He cannot fire me as he needs to provide proof to HR that I did something illegal or neglected my work as I am under contract for the next year and a half. \n\nI do not like him and just want to annoy him so much that he avoids me like the plague cause I am not quitting this job because I like everything about it but him. Also forgot to mention, principal is on autopilot, so going to her is no good. Any good ideas?",
    "title": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me",
    "subreddit": "jobs",
    "timestamp": 1614441321,
    "score": 3,
    "keyword": "asian director"
  },
  {
    "text": "Did this company reject me [25F] without saying outright that they rejected me? I'd agreed to take a 6-hour test and am irritated by their behavior. I applied to an analyst position at a registered investment advisor on LinkedIn and went through multiple rounds of Zoom interviews. They were supposedly interested in me because they then also asked me to take a 6-hour exam, which I then took.\n\nI didn't know if I did well on it or not, but then they also asked me to grab lunch with 4 directors and the chief investment officer. The lunch was pretty bizarre because I was this 25-year old Asian American woman eating with five Caucasian men who were all 35-60 years old. I struggled to insert myself into their conversations, which were 80% about their kids. I think I screwed up my chances after asking a question about their company's diversity initiatives - I was pretty concerned about potentially being on a team of 15 men (not to mention they were all Caucasian and extremely tall/attractive) and no women.\n\nAfter the lunch, HR emailed me to tell me that they would get back to me extremely soon. Well, a week went by and they didn't get back to me! I'd emailed one of the directors in the meantime to thank him for lunch but didn't get any information about next steps. Then I noticed that they'd recently posted an analyst position on LinkedIn (whether or not it was the same one as the one I'd interviewed for, I couldn't tell), and within 24 hours it'd gotten 200+ applications.\n\nI then applied to the company's newly posted job on LinkedIn just to alert them that I'm aware, and HR called me an hour later to tell me that I didn't get the job, but that I was being considered for this \"new\" job and that they'd throw my application into the mix. I talked to someone who'd vacated this position and he'd said that there's only ONE open spot. Did this company reject me \\[25F\\] without saying outright that they rejected me? I'm tired of not just being rejected outright.",
    "title": "Did this company reject me [25F] without saying outright that they rejected me? I'd agreed to take a 6-hour test and am irritated by their behavior.",
    "subreddit": "jobs",
    "timestamp": 1628212854,
    "score": 2,
    "keyword": "asian director"
  },
  {
    "text": "Waiting for decision for a job I really want (+2 days and counting) I was terminated last December from a hedge fund due to a very toxic fallout (the person doing the firing couldn't look me in the eyes). And I spent about a month and a half after that trying to heal from the situation. I was burnt out going into the job search, and only applied to 2 companies that I was sure would not be toxic (I am in tech so there are always jobs available and almost every well-known place there is reputation of a bro culture). One of them turned out to be a dream job. I never knew I would be excited to work again. Anyways, final round went smoothly, or so I thought, and the recruiter said they'd reach a decision sometime a week later. It's now been 8 days and a follow-up email later, and I still haven't heard back anything. I restarted the application process, now armed with the optimism that maybe I can find a job that I love in an environment that doesn't belittle or despise me. It was hard coming to terms with a job that felt so right was not meant to be yesterday, but I suppose that is a part of life.\n\nEdit (Context): I am an Asian female in STEM. As the only woman on all teams I've been in, it feels like I've been fighting to belong my whole life. Yesterday I watched a tiktok video of a black woman receiving feedback about being perceived as aggressive and threatening despite sitting at a meeting quietly and saying nothing while a white guy jumped up and down and cursed at the same meeting and received no feedback. My problems are probably not as egregious, but I am struggling with the same question: how do you act on feedback that is about what you are instead of what  you did? My mother tells me that it is okay and just do my best. But today when I talked to recruiters that don't see any limits for me and were talking about aiming for directors and principals, I just feel like crying ||\\_\\_\\_\\_||.",
    "title": "Waiting for decision for a job I really want (+2 days and counting)",
    "subreddit": "jobs",
    "timestamp": 1613688212,
    "score": 1,
    "keyword": "asian director"
  },
  {
    "text": "Job Interviewees are showing up with camera turned OFF My company posted for a database ops position earlier this year, we ended up with 6 candidates that we interviewed and TWO showed up and didn't turn on their cameras. Is this a thing? It made me wonder if they are running some sort of remote worker scam where the person interviewed is not the one that ends up doing the work. If it matters, they were both men of Asian descent.\n\nIn general, we've had poor interview behavior. A couple resumes were unreadable and we had one well qualified candidate show up looking like he had just gotten out of bed, even after he was given the benefit of the doubt he showed up the same way to the 2nd interview with the director!\n\nOn a side note, Reddit came to the rescue. I ended up posting about the role and looks like we're making an offer next week to a candidate that replied to my post! I get a $500 finders bonus. Thanks Reddit!",
    "title": "Job Interviewees are showing up with camera turned OFF",
    "subreddit": "jobs",
    "timestamp": 1619979411,
    "score": 1,
    "keyword": "asian director"
  },
  {
    "text": "FBI Director Wray Interview: Capitol Attack, Atlanta Shootings : NPR Direct quote:  \"And while the motive remains still under investigation at the moment, *it does not appear that the motive was racially motivated*. But I really would defer to the state and local investigation on that for now.\"  \n\nWhat now, head of the FBI?  Six of the victims were Asian women.  If it were random, at least half of the victims would be white and half would be men. Why even say that if it hasn't been assessed? Why even say it if he defers to local law enforcement? Because a white guy said it the motive was sex addiction? \n\nPrivilege makes you blind.     \n\nSally Yates for next Director of the FBI.",
    "title": "FBI Director Wray Interview: Capitol Attack, Atlanta Shootings : NPR",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616167011,
    "score": 0,
    "keyword": "asian director"
  },
  {
    "text": "Help dealing with a super toxic/ racist work environment For background im black 23 year old Muslim woman and work for a super large media company based in London.  Its my second corporate job after university.  My last role was for the same company but in a start up section (if that makes sense) and the vibe was super chill.  We could work from home, the director wore jeans and t shirts and everyone was super chill and pretty diverse.\n\nI have now moved to a different role in the company in the main area of business and it is super corporate.  It is mostly white and most of these people are straight out of Oxford and private schools.  I am the only black woman out of 90 people and 1 of 2 black people and I cannot help but feel like I stand out especially because in my old team I had a older black woman who acted as my big sister.  In my first week whilst on a call with the Italian and German markets they remarked they could not have a 'black man' in a TV ad as it doesn't work in their markets I had my camera off so they weren't aware a black person was  on the call ( my name is generically ethnic) however I was told this was going to be taken very seriously and had a meeting with my team director who remarked that he was indian and one of the people on the call had a black husband.  This made me feel super disheartened as they were once again resorting to the black friend trope but I tried my hardest to move on.\n\nThe next week I was sitting in a communal area when another director was speaking to two white colleagues, he remarked that he used to live in a area of North London ( which is very nice but has a significant black population) and joked that he called the area stab central before laughing.  This hit very close to home as I am from a neighbourhood where stabbings are unfortunately quite common, one of my friends was stabbed a couple of years ago and now is paraplegic and my younger sister witnessed a classmate being stabbed to death on the train and is still traumatised.  This white privileged man joking about London's stabbing epidemic made me so mad and disgusted and I spoke to a colleague who was active in the diversity network (east asian male) about how horrified I was.  He proceeded to say that this kind of language is normal and he has heard way worse, so much for POC solidarity.  I spoke to a colleague and she said it was horrible but I don't think anything is being done about this. \n\n I am 3 weeks into the job and honestly I feel like the environment is so toxic I don't think I can last much longer.  What should I do, its a very hierarchical organisation so people will be scared to talk against directors if I need witnesses and such but I really don't want this to be swept under the rug and I really want to make things better for the other young working class black girls coming up after me. Any advice is appreciated.  Thanks so much!!",
    "title": "Help dealing with a super toxic/ racist work environment",
    "subreddit": "blackladies",
    "timestamp": 1638981406,
    "score": 18,
    "keyword": "asian director"
  },
  {
    "text": "Gah that American \"math\" team post on the front page really bothered me. I get it, it's a casual joke. Asians tend to dominate math competitions. But more importantly, the sense that even though you're winning a competition for America and are American through and through, you're still a foreigner in your own country.\n\nIt used to drive me insane when people asked me \"where are you really from\". I'd want to reply well started in Alabama, moved to Chicago when I was still young before school, and now I work in New York. I would carry my passports out in airports like a badge of honor so people would know I'm \"american\". \n\nAnd it took me decades to unfurl the toxic defense mechanisms I spent my life throwing up. Growing up, I vehemently rejected Asian culture. I hated my name so I changed it legally. I beat the shit out of my body playing lacrosse at a high level because it was the whitest sport (all conference and even then I was known in the conference as the \"asian kid\" or the \"chinky boy with skills\"). I attended a fucking US military academy for a year instead of a top 5 school initially because I wanted to show the world how American I was. \n\nIt took me until 25 and working in Asia on projects for half the year to finally get it. To finally be in a place where the assumption isn't I'm a math guru or code monkey. Where my managing directors don't assume I'm a work horse and nothing more. Where instead of preparing the deck for sales meetings, I got to actual drive the meetings and lead. But more importantly, as I matured, I understood so much more about myself and why I am the way I am.\n\nI never realized how much growing up in the midwest as one of the only Asians in my school would impact my sense of self. My obsession with fitting in and being \"american\" led me to completely reject so much of what makes me well, me. \n\nThis current movement of Asians standing up for themselves and doing it together makes me so fucking proud. I now realize my history and culture isn't just that of China but it's about the workers brought here to build the railroads. The asian communities that popped up early on that suffered untold racism and abuse. The Chinese exclusion act and the Japanese internment camps are some of the most atrocious decisions by my country. But I'm so fucking proud to be part of that history. To know that the strength to endure untold hardship and sacrifice for the future generations flows through me and is part of my history and culture means everything. So thank you to all the activists and people stronger than me who push the narrative. You guys have made me so proud to be Asian American and my children will love and embrace their culture and heritage in a way I never allowed myself to. So thank you.",
    "title": "Gah that American \"math\" team post on the front page really bothered me.",
    "subreddit": "asianamerican",
    "timestamp": 1621955598,
    "score": 116,
    "keyword": "asian director"
  },
  {
    "text": "The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead",
    "title": "The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead",
    "subreddit": "asianamerican",
    "timestamp": 1617918532,
    "score": 109,
    "keyword": "asian director"
  },
  {
    "text": "Game Changers: 'Crazy Rich Asians' filmmaker Jon M. Chu is 'no longer scared of being called an Asian American director'",
    "title": "Game Changers: 'Crazy Rich Asians' filmmaker Jon M. Chu is 'no longer scared of being called an Asian American director'",
    "subreddit": "asianamerican",
    "timestamp": 1622294593,
    "score": 105,
    "keyword": "asian director"
  },
  {
    "text": "'Crazy Rich Asians' Director Wishes He Made South Asian Roles 'More Human'",
    "title": "'Crazy Rich Asians' Director Wishes He Made South Asian Roles 'More Human'",
    "subreddit": "asianamerican",
    "timestamp": 1623181996,
    "score": 49,
    "keyword": "asian director"
  },
  {
    "text": "'Crazy Rich Asians' director Jon M. Chu: 'The American dream is not a given'",
    "title": "'Crazy Rich Asians' director Jon M. Chu: 'The American dream is not a given'",
    "subreddit": "asianamerican",
    "timestamp": 1620132198,
    "score": 39,
    "keyword": "asian director"
  },
  {
    "text": "List of Asian leads in North American movies and TV in 2021 Asian and Pacific Islander*\n\nProbably missing some, but these are ones I know of:\n\n**Movies**\n\n* **January 29:** Finding Ohana\n* **February 12:** Minari (limited theatrical release)\n* **March 5:** Boogie\n* **March 5:** Raya and the Last Dragon (animation)\n* **April 26:** Mortal Kombat\n* **May 7:** [The Paper Tigers](https://old.reddit.com/r/asianamerican/comments/mzs5ai/quoc_bao_trans_the_paper_tigers_movie_screening/) (limited theatrical release) - tomorrow!\n* **May 14:**  Army of the Dead\n* **June 11:** Wish Dragon (animation - English dubbed)\n* **July 23:** Snake Eyes: G.I. Joe Origins\n* **September 3:** Shang-Chi and the Legend of the Ten Rings\n* **November 5:** Eternals\n* **December 1:** Fistful of Vengeance (Wu Assassins)\n\n**TV Shows**\n\n* **January 5:** Kim's Convenience (season 5 - final season)\n* **January 15:** Bling Empire\n* **March 26:** Invincible (animation)\n* **March 26:** The Irregulars (recently canceled)\n* **April 7:** Kung Fu (reboot - recently renewed for season 2)\n* **April 14:** Announcement for Warrior season 3 (will return in 2023)\n* **July:** Never Have I Ever (season 2)\n* **TBA:** Cowboy Bebop live action series\n* **TBA:** Ms. Marvel\n* **TBA:** After Yang (by the same director, Kogonada, who made Columbus)\n\n**Honorable mentions**\n\n* \"**The Six**\" documentary: About the untold story of Chinese passengers on the Titanic. Released in China in April. International release date still pending.\n* \"**Far East Deep South**\" is a documentary about Chinese-Americans in the Mississippi Delta (on America ReFramed - currently available on PBS website until June)\n* May 23: **Master of None** season 3. Aziz Ansari won't be the main lead for the new season, but will still write and direct. New season will focus on another POC character, Denise, played by Lena Waithe who is also a writer on the show.\n* **Nomadland** was directed by Chloe Zhao who won several awards for this film including Best Director at the Oscars. She will also direct a Marvel movie, **Eternals**.",
    "title": "List of Asian leads in North American movies and TV in 2021",
    "subreddit": "asianamerican",
    "timestamp": 1620330077,
    "score": 37,
    "keyword": "asian director"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 36,
    "keyword": "asian director"
  },
  {
    "text": "Director Anne Hu Returns to Native Cleveland to Film New Short on Growing Up Asian-American and Family",
    "title": "Director Anne Hu Returns to Native Cleveland to Film New Short on Growing Up Asian-American and Family",
    "subreddit": "asianamerican",
    "timestamp": 1624971032,
    "score": 11,
    "keyword": "asian director"
  },
  {
    "text": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community Related post: [Bao Tran: Hollywood Wanted Me to Make My Martial Arts Characters White, But My Ancestors Wouldn’t Have It](https://np.reddit.com/r/asianamerican/comments/n6vh71/bao_tran_hollywood_wanted_me_to_make_my_martial/)\n\nNotes from [Well Go USA's press kit](https://www.wellgousa.com/films/the-paper-tigers):\n\n**DIRECTOR’S STATEMENT**\n\nTell someone you’re making a Kung Fu movie and everybody has a clear idea of what they’re in for. For a  genre that has such vivid connotations also comes preconceived expectations and, dare I say,  stereotypes.\n\nA Kung Fu movie about out-of-shape fighters should have been easy for us to finance, but it took us 9  years of conversations like this:\n\n**Savvy White Financier**: “I love the Kung Fu movies. Love the wirework where they fly around, so  cool.”\n\n**Me**: “Great. Except we’re not doing wirework, our characters are schlubs past their prime. We want to  show them struggle with gravity, not defy it.”\n\n**SWF**: “But you gotta have the dubbing, that’s so hilarious.” \\*mimes dialogue while contorting their  mouths\\*\n\n**Me**: “Yeah no, our characters speak English in their own voices without any accents.”\n\n**SWF**: “They’re all American?”\n\n**Me**: “Ensemble piece with Asian and Black American lead characters. See, it’s a reflection of how I grew  up in Seattle…”\n\n**SWF**: “Can you change them to be white?”\n\n**Me**: “Hm. Okay. Well, this is about characters stuck between two cultures. The Kung Fu world is steeped  in Confucian, arcane, hierarchical values that is so at odds with modern American sensibilities.”\n\n**SWF**: “Bruce Willis!”\n\n**Me**: “Sorry?”\n\n**SWF**: “If you get Bruce Willis, we’ll fund your movie. Right now it’s too risky with no real names  attached. There’s no bankable Asian or Black stars that can sell your movie.”\n\nThen you have the militant fellow Asian American:\n\n**Militant Asian American:** “Why are you setting our people back? Hollywood has only portrayed us  Asian men as Kung Fu masters or Triad henchmen. We have to tell different stories.  #RepresentationMatters!”\n\n**Me:** “But I like Kung Fu. And Jackie Chan was really the one who inspired me to make movies.”\n\n**MAA:** “No, you need to do something like The Farewell or Saving Face. You know, real Asian American  experience stories.”\n\n**Me:** “Can’t we do it all and support each other in telling whatever stories we want to tell? This is not  Highlander, there can be more than one.”\n\n**MAA:** “You’re just perpetuating stereotypes. Bullies used to call me Bruce Lee and tease me because  they thought all Asians could do Kung Fu.”\n\nSo if your tribe doesn’t find you, you go out and build it. We eventually turned to Kickstarter and our local  community of private investors. The ones who “got it” recognized themselves in the story and/or Asian Americans in lead acting, producer, and director roles. But through it all, we always aimed for more,  hoping to expand the idea of what a Kung Fu movie or an Asian American film could be.\n\nI found this in my old director notes, written for various grant proposals or some investor documents  throughout the years: “We want that blue-haired grandma in Iowa, who has not a mean bone in her  body, to root for Danny by the end of the movie.”\n\nAt the end of the day, you can’t please everyone, but watch us try. Grannies of Iowa, be ready!\n\n\\--\n\nBao Tran",
    "title": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community",
    "subreddit": "asianamerican",
    "timestamp": 1622247264,
    "score": 9,
    "keyword": "asian director"
  },
  {
    "text": "Quoc Bao Tran's \"The Paper Tigers\" movie screening locations and streaming options for next week * [List of screening locations](https://www.facebook.com/tranquocbao/posts/10161539002213636) - Opens May 7\n\n(The director will update that post if he adds more confirmed theaters)\n\nStates not in alphabetical order. Cinemark also has an option to book a screening for yourself and a group up to 20 people for $149\n\n\n**Rental streaming options:**\n\n* Apple TV / iTunes\n* Prime Video (Amazon)\n* Google Play / YouTube Movies\n* Vudu\n* Microsoft Store / Xbox\n* Sony / PlayStation\n* FandangoNOW\n* Comcast Xfinity\n* Charter / Spectrum\n* DirecTV\n* AT&T U-verse\n* Cox Communications\n* Verizon\n* Frontier Communications\n\n**Other info:**\n\nYuji Okumoto from The Karate Kid 2, Cobra Kai is one of the producers and guest appearances. Other appearances include MartialClub (YouTube), Roger Yuan and other martial artists.\n\n**Previous threads:**\n\n* [The Paper Tigers (May 7) - crowdfunded martial arts indie film. Asian-American director and producers who made this rejected a $4 million offer from Hollywood because Hollywood wanted a white lead](https://np.reddit.com/r/asianamerican/comments/mn2exb/the_paper_tigers_may_7_crowdfunded_martial_arts/)\n\n* [The Paper Tigers - Kickstarter for Kung Fu Indie Film](https://np.reddit.com/r/asianamerican/comments/9tdb74/the_paper_tigers_kickstarter_for_kung_fu_indie/) - The director posted on here a couple years ago with their Kickstarter",
    "title": "Quoc Bao Tran's \"The Paper Tigers\" movie screening locations and streaming options for next week",
    "subreddit": "asianamerican",
    "timestamp": 1619540356,
    "score": 8,
    "keyword": "asian director"
  },
  {
    "text": "[Remote Job] IMPACT DIRECTOR - Asian American Documentary Network (A-Doc)",
    "title": "[Remote Job] IMPACT DIRECTOR - Asian American Documentary Network (A-Doc)",
    "subreddit": "asianamerican",
    "timestamp": 1631205685,
    "score": 8,
    "keyword": "asian director"
  },
  {
    "text": "Meet the co-directors of the Coalition for Asian American Children and Families",
    "title": "Meet the co-directors of the Coalition for Asian American Children and Families",
    "subreddit": "asianamerican",
    "timestamp": 1615652694,
    "score": 8,
    "keyword": "asian director"
  }
]