[
  {
    "text": "Conflicted: I was offered a job but they kept mentioning diversity TL;DR: Recruiter from the phone screen mentioned how proud they were of their diversity and throughout the process of my interviews different individuals would mention they highly value diversity, I’m a biracial woman and I feel like I was offered a job to fill a void on their diversity/inclusion ratio.\n\nSome details:\nI’m applying for a type of job I have proxy experience in. I’ve worked in startups for the last 6 years so I wore lots of hats but my title was never the job I’m going for now. The job is more technical than I’m used to but I figured I’d try because you’ll never know if someone is willing to gamble on you if you don’t try. \n\nSo I get a phone screen call and I feel like I bombed it but then the recruiter jumps into all the company benefits and mentions they value diversity and inclusion, so much so their company is 35% women. I reply with “oh nice!” That’s it…and we kind of conclude and she sets up the next interview.\n\nOkay so there’s 4 interviews total, in each one (with management or higher positions always present) a manager would mention how they value diversity and different backgrounds. By the 3rd interview I thought it was odd that each interview was ending on this note and discussion.\n\nI’m weary on accepting this position because I feel like maybe they are just hiring me to fill a diversity void and bring some color to their about page. Am I overthinking this? I haven’t interviewed for a job (especially one with 300+ employees) in 5 years, is this the new normal? Thoughts?\n\nEdit: I wanted to add [this article](https://aninjusticemag.com/being-a-diversity-hire-as-an-asian-ab4bc0d23e7e) to address some of the comments like “what’s the big deal” that I was getting. I wasn’t able to articulate my feelings as well as this article that was shared with me by u/Original-Sense-6986 . If you get an opportunity and have 5ish mins to spare, this is a good little insight into what it’s like to look for work as a minority. (At least this mirrors my experience. I’m sure there is a vast spectrum of experiences but I thought I would share.) I like this conversation though, I hope we can have more candid discussions not just online but in person to our coworkers and employers.",
    "title": "Conflicted: I was offered a job but they kept mentioning diversity",
    "subreddit": "jobs",
    "timestamp": 1640391691,
    "score": 462,
    "keyword": "asian manager"
  },
  {
    "text": "What was the job interview that changed your life? Here's mine:\n\nAbout 4 years ago, I graduated from a local community college with an associate's degree, and I was planning on transferring to a university for a bachelor's.  I had no idea what to do next, so by default, I decided to go for a degree in Business Admin, without any passion for it. Like any Asian parents, my parents wanted me to go to med school, but I hated biology and chemistry with a passion, so I didn't listen to them. Thankfully, they let me do whatever and didn't disown me haha.\n\nAt the time, I was working to support myself. I was tired of my cashier job, so I applied for a waiter job at a local Japanese restaurant, hoping for a change of scenery. The manager gave me a call, and asked me to come to the restaurant for an interview. During the interview, he looked at my resume and asked me what I was doing next for my bachelor's degree, and I told him Business Admin. He asked why, I said I didn't know exactly what I wanted to do next, so I went with the most popular degree out there. He started getting very condescending about my choice, and told me that I should have gone with medical, or engineering, or something to do with computer and technology (he's also Asian). In my mind, I thought it was none of his business, that only my parents can talk to me like that, but I kept my mouth shut and sat through the entire interview. I found out a couple days later that I didn't get the job.\n\nThat night I went home, I was still very upset about what the restaurant manager said, and I couldn't sleep as I kept thinking about his words. No one had confronted me like that before, let alone a stranger. I started second-guessing my decision, that if it was the right choice for me. I knew he was right, I knew I picked business admin only for the sake of going to a university. I started looking back, and trying to figure out what I was good at, so I could at least base on that for my next degree. I realized I enjoyed building computers (I had built a couple before), so it only made sense for me to go for a computer engineering degree right? But it wasn't as simple as that. Since I took the easy courses to get my associate's, and didn't take any advanced physics or math courses, which are the pre-requisites for most engineering programs, I would have to start all over again at community college, and it would take me an additional 2-3 years, on top of the core courses of the undergrad program, to graduate. \n\nBecause I was impatient and didn't want to hear my parents nagging about when I'm going to university again, I decided to go for a different path. I talked to my advisor, and explained to him that I wanted to work with technology. He recommended this Information Systems program at a university that's an hour of driving from where I lived. The program was a combination of business and technology, and it accepted most of my pre-requisite classes from my community college. It was a no brainer for me. I applied and got accepted. I moved to a new city, and continued working part time to support myself. During the program, I was introduced to database, IT infrastructures, project management, a little bit of programming, and I had the best time there. Fast forward 3 years, I graduated during the covid-19 pandemic. It took me hundreds of applications, but I finally landed my dream job as a business systems analyst. I find joy in what I'm doing, and I'm proud of the work I deliver everyday. I know what my career path is going to look like in the next 3, 5, 10 years; and what it's going to take to advance my career.\n\nLooking back, I'm very grateful for that fateful night, where I was confronted by a stranger in the middle of a restaurant. I'm very grateful for that manager, whether he was saying it from the heart, or he was just looking down on me. If it hadn't happened, I still wouldn't have known what to do with my life, and I wouldn't have been where I am today. It was one of the best things that have ever happened to me. I went back to the restaurant to see if he was still working there, but found out he'd left. Thank you for reading my story.",
    "title": "What was the job interview that changed your life?",
    "subreddit": "jobs",
    "timestamp": 1615002329,
    "score": 212,
    "keyword": "asian manager"
  },
  {
    "text": "27 yo with a Master’s degree | 2 years of job search with hundreds of applications = 1 interview Dear r/jobs\n\nAs the title says, I have a Master’s degree (Biology-related STEM degree). I have graduated in May 2019 and had been looking for a Ph.D. for more than a year. After realizing that it is not gonna happen anytime soon, I’ve decided to apply for research assistant and technician positions in labs. Again it’s been more than a year… I have changed my CV/resume and cover letter more than 5 times throughout my applications and even though I came a long way from my 5-page long CV that had a picture of me and my 2-page long cover letter (yeah… I know) about two months ago I have realized that I still don’t know a lot of things about resumes. Just to give an example, I’ve learned about ATS just about 2 months ago.\n\nSince then, I’ve been reading and reading and reading different job forums, Reddit, a lot of books, Ask a manager, and so on because I don’t wanna miss anything that might affect my chances of getting recruited. \\[Insert venting\\] I am 27 and living with my parents for the last 2 years without earning a reasonable amount of money… I think they see how hard I try every single day to apply for numerous jobs in different places. For my Master’s thesis, I’ve worked until night numerous times, worked during weekends, and even slept in the office 2 times… I feel like I’ve wasted more than 4 years of my life (including the time for the Master’s degree) and I don’t even know what to do anymore \\[end of venting\\].\n\nI am aware of the length of this post but I have no one to ask these things. Every time I changed my resume/CV I expected to be invited for interviews and get a job so I kept applying for months before realizing that I had to write a better resume. That's one of the reasons why it is taking me more than 2 years. I don't wanna waste time anymore hence the length of the post. I have categorized them according to their priority -for me- and I’ll really appreciate it if you can take your time to answer them.\n\n&#x200B;\n\n**-High Priority-**\n\n&#x200B;\n\n* Applying late\n\nI’ve read somewhere that the recruiters may stop looking at the resumes after they invite a handful of people. If that’s true, it means my chances had always been almost zero because I have always been applying on the day of the deadline which was at least a month after the publication of the ad. So, does it matter if I apply a week or a month after the publication of the ad even if the deadline is far future?\n\n&#x200B;\n\n* ATS\n\nPlease stop rolling your eyes. There is a lot of different and often conflicting information out there written by job searchers, resume writers, and hiring managers. As far as I understood, all the resumes pass the ATS as long as the applicants have all the required qualifications. However, does the ATS rank or at least change the order of the resumes according to the number of the keywords mentioned on the resumes? Connected to the previous point, if the recruiters invite only a handful of people, even just changing the order of the resumes without ranking can affect applications. In other words, what are the chances of a resume to be seen (or seen early) by the recruiters if the keywords are written 5 times, 3 times, or only one time? If it doesn’t change or affect anything, why do you use ATS?\n\n&#x200B;\n\n* Can I repeat the keywords in every section of my work experience?\n\nFor example, PCR is one of the most basic and often asked technical skills. If PCR is mentioned in the requirements or desired section, can I write “Cloned \\[gene X\\] by using PCR…”, “Determined the gene expression change by using RT-qPCR…”, and so on (i.e. different sentences and examples) under different employment sections? Including the internships, I have about 4 sections in the work experience part and I feel that it may sound redundant to repeat the same technique 4 times but at the same time, it might show that I have a lot of experience using the technique.\n\n&#x200B;\n\n* Bold keywords\n\nSince recruiters look for keywords and they just skim the resume, I’ve been thinking of highlighting my keywords to get the attention of the recruiter and make it easy for them to skim my resume. Does it make sense or is it a no-no?\n\n&#x200B;\n\n* Tailoring resume\n\nApart from mentioning the keywords in the job ad, how can I tailor my resume for a specific position/ad? Also, I don’t know what people mean by “culture of the company”. Does that really mean anything or is it used as an excuse to eliminate some candidates? Another thing is the “mission” or “values” of the company/university. If I write some of those words people would scold me for sounding boring, using cliches, and writing subjective things.\n\n&#x200B;\n\n* To relocate\n\nI have seen a lot of times that the ATS or recruiters could discard a resume without looking any further if the candidate writes a different state and I am in a different country… Is there anything I can do about it? For example, I had been to the US (J-1 visa). Would it help if I just write “J-1 visa” right next to my internship while applying for the jobs in the US? Also, I want to learn the reason why the hiring managers dismiss the resumes coming from other states and countries so that I can address the issues in my resume and cover letter.\n\n&#x200B;\n\n* How can I integrate the praises I’ve received into my resume?\n\nNaturally, some of them were verbal and I am not sure if it is okay to include them because practically I have no proof. But some of them were written. For example: “\\[OP\\] completed the assigned experimental work in an outstanding manner. \\[…\\] immediately highly motivated and finished this in the same way!” I think you can understand why I want to use quotes in my resume.\n\n&#x200B;\n\n**-Normal Priority-**\n\n&#x200B;\n\n* How can I integrate soft skills into my resume?\n\nI certainly don’t want to write self-motivated and leave it at that. But I feel like I would waste space if I write “Self-motivated: Worked independently for project X. Communication skills: Presented results in lab and institute meetings”.\n\n&#x200B;\n\n* Filling work experience boxes after uploading a resume\n\nAs you most likely already know, most of the time the recruiters ask to fill profile, education, and work experience even though the resumes are uploaded to the system. I have no idea if I should just copy and paste the content of my work experience (to the respective sections of course) or write different bullet points.\n\n&#x200B;\n\n* Name change\n\nI have an ethnic name that is not difficult to read or write but still unusual. I have seen a couple of times people changing their names to “Bob” and “James” and they start to get significantly more invitations to interviews. It is not like all the recruiters and hiring managers are racists, don't want to hire Asians or African Americans… So, why is that the issue? I want to learn because I want to address the issues that might come with an unusual name. Also, do you know if this is the case in academia as well?\n\n&#x200B;\n\n* Changing previous job titles to suit the job title of the application\n\nI’ve seen some people writing their internships as “Student researcher” or “Research assistant” to fit the ad. Can I change the title of my internships?\n\n&#x200B;\n\n* Jokes or hobbies to stand out\n\nSome people mentioned they were invited (or inviting if they are recruiters) because they wrote “cook a minute rice in 58 seconds” or because they had interesting hobbies like wrestling. Does it really work? By the way, I can come up with original jokes so I won’t write cliche on my resume.\n\n&#x200B;\n\n* Repeating resume on cover letter\n\nI understood that I should address the keywords mentioned in the ad. But if I do that both in my resume and cover letter, the letter would be just a repetition of the resume. How can I avoid that?\n\n&#x200B;\n\n* Salutation and signature on cover letter\n\nI am afraid to address the wrong person in my cover letter. Is it okay if I address my letter to the owner of the lab whom I’ll work for if I get hired? Also, do I need to sign cover letters?\n\n&#x200B;\n\n* Do these work?\n\nI’ve read that information interviews can help networking which in turn can help recruitment. Also, I’ve read about pain letters that **should be sent by snail mail (??)** Do they really work? I thought of starting a blog to “share my expertise” so that the recruiters can notice my blog or at least be aware that I am knowledgeable in my area. Would it help with my application?\n\n&#x200B;\n\n**Thank you so much for reading the whole thing or a part of it. It would make me really happy if you can address even one of the points I've mentioned in the post. Thank you in advance.**",
    "title": "27 yo with a Master’s degree | 2 years of job search with hundreds of applications = 1 interview",
    "subreddit": "jobs",
    "timestamp": 1616508293,
    "score": 16,
    "keyword": "asian manager"
  },
  {
    "text": "I left my toxic workplace without notice and I feel so relieved TL;DR - My quit without notice on Friday at end of day, because the environment was so toxic at work. I start my new job next Monday and I am helping my co-worker find a new job. \n\nI took a temporary job as a hospital screener mid-December 30 miles away from my residence due to the scarcity of jobs during the pandemic. Since then, I've been applying and sending résumés every day and stressing about landing a permanent position. Around 15 applications per day, at least 6-7 days a week. After 4 months of searching, I received a generous offer from a company who paid my asking salary starting, with a 3% cost of living raise annually with health insurance benefits. \n\nMy last job treated us (my co-worker and I) poorly. The client had warned us that we needed to have a thick skin, as the area was full of anti-maskers. I thought nothing much of it, because my background was in customer service, particularly de-escalating angry customers, so I thought I'd be fine. Within 2 weeks of being on the job, we had to deal with not only anti-maskers, but ones who would sometimes get physically aggressive that we had to call security and file 3 reports. We dealt with sexually harrassing comments and being touched inappropriately (one nurse at another station would hide when a particular patient came, because he would always sexually harrass her too), and even ones who would make sexist and racist remarks not only to us (we're Asian) but to one of the security officers, who was African-American. At one point, I was advised by one of the primary care staff to call the police on a relentless harrasser, who refused to listen to the clinic manager (she was a Caucasian female; this patient would address the male security officer while she was speaking to this patient, who refused to acknowledge her). He filed a complaint on us, so we had to write an incident report on him, and of course like usual, the police really did nothing. \n\nThe hospital itself didn't really care about its employees, either. If a manager or employee was reported, as long as that person was friends with HR personnel, the issue was swept under the rug. We also had at least 3 doctors from podiatry, vision, and orthopedics, who believed that COVID-19 was an over-hyped flu being used by the government to control US citizens (the few patients who actually cared about the pandemic told us, and so did other employees who worked with them). Worse yet, every time I vented to friends, they would tell me they had similar experiences (dealing with racism and sexism) while working at that town. There were so many instances I wanted to quit on the spot, and thanks to this job offer, I was finally able to, and so did my co-worker. She didn't have a job lined up, but it was damaging both our mental health so she refused to work without me. In the morning, she sent her resignation email. At first everything seemed fine, because they thought I'd still be there to screen patients but at the end of the day, I sent mine: \n\n\"Hello (recruiter) \n\nI quit effective today. I turned in my badges at the (town I worked at) location. \n\nThanks,\n(my name)\"\n\nWithin 5 minutes, an unknown number called my phone, followed by an irate text from my recruiter, demanding the reason why I quit so suddenly. I simply told her that I found a new job closer to me, and they wanted me to start ASAP (which was true). I'm so glad to be done with them.\n\nEdit: grammar",
    "title": "I left my toxic workplace without notice and I feel so relieved",
    "subreddit": "jobs",
    "timestamp": 1616012624,
    "score": 12,
    "keyword": "asian manager"
  },
  {
    "text": "How do I justify quitting a job during the probationary period to a new potential employer? I recently started a new job as an office manager working for a nonprofit organization and am in my 6th week. I am their second full time employee after 28 years in operation. Prior to this job, I had worked part-time in retail for \\~8 months after graduating from a 4 year university just to pay my bills. \n\nWhen I initially started this office manager job, I was super excited and I even considered pursuing a career in nonprofit in the long run since I had 4 years of experience volunteering with a nonprofit that served the same community.\n\nHowever, after starting this job, reality hit me that the organization is extremely understaffed and the work environment is not ideal. For example, the founder works for about 20 hours a day, even on weekends. They have no work life balance and it feels as though I am being pushed into that direction. I work more than 40 hours a week while being on a salary and the founder is not very mindful of other people's time. For example, she always arrives at the office later than me and then she had me spend 2 hours cleaning the outside of our office instead of sitting down to go over work with me. Then, she proceeds to schedule a 2 hour meeting with me on my day off only to assign me time sensitive work. We are a cultural organization(Asian) and I feel like she is taking advantage of the fact that it is more difficult to speak up or say no as a younger individual within this culture. I also feel like I can't say no to her requests because I am still on my probationary period until we hit the 90 day mark,. \n\nShe is very disorganized and it feels like we are constantly doing work to catch up rather than plan ahead. She told me to attend a meeting on behalf of her 15 minutes prior to its start time and she tells me to do time sensitive work at the end of my shift (or on my day off). I can't even schedule time to sit and plan work ahead with her because she is in meetings all the time or on the phone with clients all the time. \n\nThis is really not what I signed up for and I can feel my mental health deteriorating over this job. It is very difficult for me to draw boundaries due to the fear of being fired during the probationary period and I've been having a lot of anxiety attacks due to feeling powerless in this situation. \n\nI am looking for ways to get out, but I'm not sure how to explain my departure to potential new employers or even how to list this job on my resume (should I even list it?). I am also worried that if I don't list this job, the future potential employer would still see it on the background check anyways. \n\nAny help or guidance would be greatly appreciated! \n\nTLDR: How to explain a short-lived job (toxic work environment) to a potential employer and on a resume?",
    "title": "How do I justify quitting a job during the probationary period to a new potential employer?",
    "subreddit": "jobs",
    "timestamp": 1616522860,
    "score": 4,
    "keyword": "asian manager"
  },
  {
    "text": "Started a 70k position 2 months ago. In talks with a recruiter for a 100k position. I love the company I’m at now, but I have a goal to make 6 figures before 30. 28 years old now. Here is the rundown:\n\nCurrent role: \n70 K base, with 10% bonus (according to company performance) \n25 days PTO, unlimited sick\nHybrid-3 days a week \nLarge opportunity of advancement\nInternational placement opportunities \nAsian company\nTook a lower position due to role\nGreat manager but not so amazing company \n\n\nNew Role:\n\n100k base 20% bonus (dependent on company performance)\n20 days PTO, unknown sick days\nHigher position\n100% remote \nGreat company culture, unknown manager \n\n\nShould I interview ?",
    "title": "Started a 70k position 2 months ago. In talks with a recruiter for a 100k position. I love the company I’m at now, but I have a goal to make 6 figures before 30. 28 years old now.",
    "subreddit": "jobs",
    "timestamp": 1629493752,
    "score": 4,
    "keyword": "asian manager"
  },
  {
    "text": "Unpaid overtime. Leaving the job on the exact hour with lots of pending task. Now they are telling me to continue working overtime. First of all i would like to apologize if some of my sentences are not understanble for english is not my first language.\n\nI would like to hear your advice/opinion regarding my situation.\n\nTo start, ive been working in this company for more than 6yrs now and half of it is working with overtime. So far they've been paying my overtime until now that i am planning to resign. I already planning to leave the company this coming September and i already filed my resignation via online portal. My supervisor adviced me to file early so that the transition of work will also be early coz the task will take a lot of memorization and its better for us to train my replacement as early as possible to avoid errors.\n\nSo as you can see, i have 2 months unpaid overtime coming from May and June (133 hours total),. Last thursday i didnt do overtime and since our restday is friday they were shocked of how many pending task left on saturday. I work as a logistics customer service agent, nightshift. I just recieved an email coming from our manager telling me to continue overtime and whats worst is he said \"as if the company is not paying\". A couple of hours later my supervisor from morning shift called me 2 times but i didnt answer it but he proceeds to leaving a message telling me the same as what in the email have said, this time with some sort of emotional black mailing. He told me his work load like he wants me to emphatize. I also didnt reply to his message 😂\n\nI really needed that money to be honest coz i am saving money for my future goals, i am planning to study programming. For now i dont want to do overtime until my days here are finish but im afraid they be mad at me and give me a problem. My job is suppose to be 2 man task but since there is a short of a manpower i offered myself to do in exchance of overtime. \nIm afraid they will give me problem like delaying my benefits or my planeticket going home. I work in the middle east btw and i am from asian country. \n\nThank you.",
    "title": "Unpaid overtime. Leaving the job on the exact hour with lots of pending task. Now they are telling me to continue working overtime.",
    "subreddit": "jobs",
    "timestamp": 1624749499,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "Is this normal for a server interview? Hi,\n\nI was invited for an interview at this chef owned restaurant and I was really excited for. Restaurant manager is new but apparently he told me he has managed restaurants before and how great he is. Regardless we sat down and he said he assumed I was part Asian or Hawaiian at least and I said no. He continued by asking me to remove my mask to see my face and after doing so he asked me how old am I. I am not really old and it still made me feel uncomfortable like, was he really looking for a server or something else?\n\nI told him about my skills and all of that and asked him questions about his work at the place and he told me I talk a lot...\nHe kept telling me he has sooo many people to interview today and he is gonna choose 5 to bring in for a trial and choose 1.\n\nThe trial thing I understand it happens but what about the rest? I am just feeling disappointed.\n\nOh I forgot based California.",
    "title": "Is this normal for a server interview?",
    "subreddit": "jobs",
    "timestamp": 1614800752,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Panasonic (Newark) vs. Samsung Electronics (NJ Headquarters) any advice on these companies? Hi guys - a recent Supply Chain Management degree grad here.. I'm looking for some advice/opinion before making a job offer decision. Anything I'd really appreciate!\n\nPanasonic (Newark, NJ office)\n\n* entry level, non exempt role, got offered around $54k \n* bonus based on performance 10%\n* typical company medical benefits, 401K etc. \n\nSamsung Electronics (Ridgefield Park NA Headquarters)\n\n* interviewed with hiring manager, no offer yet\n* also non exempt position, salary in high $50k \n\nAgain, I'm a recent grad in the NY/NJ area, 1.5 years of experience in pharmaceuticals in supply chain planning.\n\n&#x200B;\n\nI have a feeling that since both companies are \"Asian\" companies, I can't expect much from the work life balance and the Asian corporate culture.. and I haven't gotten an offer from Samsung yet, so it's too quick to decide anything. Any advice/opinions on the overall company and the work? \n\nThanks!",
    "title": "Panasonic (Newark) vs. Samsung Electronics (NJ Headquarters) any advice on these companies?",
    "subreddit": "jobs",
    "timestamp": 1628878448,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "I got “asked” to take on more responsibility of the another team lead who’s leaving, is it appropriate to ask for a raise? A team lead is leaving soon and last week my reporting manager “asked” me if I’m okay to take on her portfolio including the junior members on her team (we’re both team leads) I said yes of course because:\n1)I think the job scope is closest to my current portfolios plus I was in charge of those projects a few years back so I should be able to pick things up the fastest comparing to other team leads\n2)Other team leads on my teams are already very very swamped with work (but to be fair, we all are)\n\nWith 1) and partly 2), i decided to take on her portfolio (another factor is probably I’m working in an Asian company and the ‘yes man’ culture is a tad bit intense, you’re expected to respect the chain of command,basically you don’t say ‘no’ to your reporting manager)\n\nThen I just learned today from the reporting manager that this arrangement will be a permanent one, meaning he’s not looking for more people to take over this portfolio from my plate.\n\nAfter learning this, I can’t help but think I want to be compensated more for the added responsibility.\n\nSo I would like to hear some opinions on\n1. Is it appropriate to bring up this conversation to my reporting manager?\n2. Is it too late to bring up this conversation? Because I already said yes, although we still have 2 months handover period until I fully take over when she leaves\n3. How should I start this convo? Never came across this kind of situation before\n4. What if he comes back with replies like “well, you just have to manage the new work within your work week, I’m not asking you to work longer hours” how to properly handle that?\n\nThank you in advance guys!",
    "title": "I got “asked” to take on more responsibility of the another team lead who’s leaving, is it appropriate to ask for a raise?",
    "subreddit": "jobs",
    "timestamp": 1616807161,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "Should I change a job within six months? I am from a South Asian country, I work in the nonprofit sector. My previous workplace was pretty toxic, and after 3 years I had the chance to change it. \n\nMy current workplace is kind of a dream place. My manager super cool person to work with, also the workplace is. I have a pretty good work-life balance. But I do miss the hustle and being in the field.\n\nRecently, I got another opportunity. The salary is good. But it comes with a lot more work. I am not sure about the work environment, but hopefully, it will be good.\n\nThe catch is for this job I have to relocate to another city, without my family. Currently, I am living in my own house with my family. \n\nAlso, last six months my current organization invested a lot into me. I am just about to produce some good quality works. I feel like it will kind of betrayal to them.\n\nPlease enlightened me with your words.",
    "title": "Should I change a job within six months?",
    "subreddit": "jobs",
    "timestamp": 1633953475,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "My job is wrecking my health  (Repost with some parts taken out. I'm not sure where I should be posting this really...)\n\n**Semi-rant, semi-seeking advice.** I thank you for any advice. I'm so sorry for ranting and so sorry this is long. I'm only 24 and a year into my career but already burnt out with everything. Life and job. TLDR is at the end for you.\n\n&#x200B;\n\nHi everyone. I need a little advice. I posted a while back in another subreddit about how much I feel like a failure at my job and after a big ol' discussion, I learned that perhaps my job is uh...wee bit toxic. I felt better for a bit and my friends told me my boss can be a bit gas-lightish. I felt more \"sane\" and started to job hunt. Coupled with the fact that I get paid 48K in NYC (I got chewed out in the thread too because my wages are so low in the cities too) I felt like maybe it's the job and not me. I thought I finally had my answer. Get a new job and my life will be better.\n\nI slept this entire weekend. Like. I couldn't move or get out of bed with the exception of needing to pee or getting up for a quick stretch cause I was getting sore staying in bed all day. Not in a depressed way (as I've experienced before) but more in a I couldn't stay away, couldn't leave my bed, conscious for 10 minutes to play on phone, then back to sleep, etc. My health isn't doing well either and I started to work out every day in the evening (20-25 minutes) because I'm sitting anywhere from 8-10 hours during my shifts.\n\nOn Saturday, I slept my day away. I essentially slept from 2am (night before) to 2pm and then got up for a quick breakfast and somehow found myself in bed after breakfast until 5pm where I finally made myself get out of bed. Sunday was a repeat of Saturday but I managed to kick myself out of bed at 1:30pm for breakfast and then kicked myself back out at 3pm because I went back to bed.\n\nI hate my job. The coworkers are great, management though is toxic. Mean. Rude. Humiliating and petty. The clients are VERY demanding. Workload is nearly impossible to handle on some days. I can tolerate my job occasionally, but after a year in the job watching people come in and quickly jump ship, I'm starting to look for a new job myself. The other (of the two bosses) says I can \"always ask for more help\" but he's talking to a total workforce of maybe 10 people, all of whom are swamped. Not to mention, some of us use systems the other workers don't use for their clients (every client is individual and can be completely different). It would mean taking the time to teach someone a brand new system, in which I might as well get the job done myself.\n\nThe new job search is getting a little hard because of the current situation, but I check every night after work. Linkedin. Indeed. Haven't had the heart to leave yet (see below about my \"cycle\") and don't have the energy to redo my resume and cover letter.\n\nI am being picky of course...I live in a place where commuting by public transport is kinda hard but also driving means someone needs to drive me to and from work and there's only 1 car and that family member needs the car more than I do. So I've been searching for full remote jobs. It's going a bit slow. Very slow.\n\nThe thing with my job is that my manager can be pretty toxic but makes up for it with big ol' smiles and compliments days later. It reminds me of an abusive family member when I was a kid. Where it was scream, glares, or anger one day and then smiles the next day. On the good days I want to stay for this *lovely company* and on the bad days I want to either die or just quit.\n\nShe does this annoying thing where, with no proper training in this small firm, I'll ask for help, she'll tell me to figure it out myself and when I bring her the results, she's horrified and says \"This is...all wrong! OMG. We need to do it ALL over. Why don't you know this? It's so easy. What don't you get?? OMG we have restart. OMG...why didn't you ask me for help??\"\n\nIn short:\n\nMy manager/boss' cycles between sweetheart and mean.  \nI cycle between thoughts staying and leaving.\n\nAnd then there's my career choice.\n\nI keep saying that leaving this job will make my life better. I will no longer face the one boss who has literally yelled at me in my nightmares and in person. But what if I don't like my career? I didn't choose this career in the first place. I had science in mind and ended up in business. I can't sit still for long. I rather be bustling about. Instead I'm in an office chair for 10 hours a day. I did this to please my asian parents because they wanted me in this job secured career field. Sure there are pieces of this job I like, but it isn't enough to make me love this job OR this career.\n\nPicky or not, I'm afraid that even if I do manage to land my next job, I'll be just as miserable. There's no guarantee that my next boss isn't as ruthless. There's no guarantee I'll like my job then too. Or ever. I'm just sick of waking up and realizing I have to go through emails where I'm sitting there wasting time on trying to solve a problem I wasn't trained for only to get yelled at.\n\n**TLDR**: I slept all weekend. I couldn't focus on games or reading because I kept thinking about work. In January I worked nearly every single day (tax season). Most days I work 9-10 hours. My job is toxic. I'm not sure I want to leave and even if I left, there's no guarantee that it was this job that was causing all of my problems. I might hate my next job too. With corona, the market isn't doing too good. I'm just so stressed and sleeping all day just feels so so good.",
    "title": "My job is wrecking my health",
    "subreddit": "jobs",
    "timestamp": 1614021997,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "How do I best handle a colleague who's obsessed with me and my race, but also kinda hates me? I have a Japanese colleague who when she first met me was under the impression I must have had some Japanese ancestry. I do not but I am one of those brown skinned racially ambiguous women who get mistaken for literally everything under the sun and who some people become really fascinated by my looks and fetishize me.\n\nThis woman started off our work relationship by telling me if I need more work she can hand off some of her petsitting jobs to me, then proceeded to ask me my age, and when I told her she cooed \"your skin is so dewy, you look so young!\" (i'm barely in my 30s.)\n\nAnd then she proceeded to assume I was part Japanese and asked me literally dozens of questions over the next couple weeks like \"so did you watch Pokemon growing up? I didn't because I grew up here speaking English\" and all sorts of other weird shit. When I brought in one of those cutesy Japanese animal pens, she asked where it was from. I said some company in Texas, and she asked if that's where my family was from. I told her no it was some website in Texas. Every conversation had my family's origins as a subtext and shoehorned in.\n\n I told her I am not Japanese, I do not speak Japanese, that this is your culture and your people.\n\nAnd never have I ever been mistaken as having English as a second language either. The weird thing about that example is that months later I'd learn she actually didn't grow up speaking English and grew up in Japan. So not sure why she lied about that. There were other times I just walked away because I was so uncomfortable by her questions and race related chatter.\n\nWhen she cornered me and just point blank asked me where my family was from, I said California. She was like wow cool Cali girl, WHAT ARE YOU??? \n\nI just walked away. \n\nI also noticed by then that she mimics how I talk. She mimics how I talk to customers, VERBATIM, and in the same tone. I don't code switch sometimes and will say y'all or ain't, etc, and she has started to talk like that too.\n\nFrom then on I would disinterestedly say hi to her and answer her work related questions, but I would never have a conversation with her. She started mispronouncing my name all the time when she hadn't before, then she stopped talking to me. She also talked shit behind my back like I was the problem here. I'm guessing this included to the owner, who she's close with.\n\nIn December where there was a work related shitfight among the whole group she called me \"snarky\" when I said I felt marginalized in this group. She then called me a waste of time for stating she made me uncomfortable with her dozens of personal questions and that was why didn't answer her phone call, and because I said I could not pay my rent if we went on strike for two weeks.\n\nShe ignored me and was passively hostile for a few months until April this year when she became super friendly and then started talking non-stop about how woke she is, how she translates anti-racist literature etc. She stopped when I pointed out to her she LOVED our last manager, who was really racist and screamed at Black women, and screamed at us non-Asian WOC.\n\nI did get a slight sexual vibe off her obsessive questioning, which made me surprised she has a boyfriend and was straight. Having said that it's an open relationship and now that we get along again, I have seen how she falls in love with anyone who comes into our store and finds attractive.\n\nI think she is obsessed with me and my race, but considering dozens of Black men come in asking for her, and how she mimics everything I do, I also wonder if she's trying to find out how to snag a Black boyfriend.\n\nI need to make clear I don't think this woman really likes me. I think she still hates me for the perceived rejection last year and because I won't admit to being Japanese, which I'm not, but I also do think she's obsessed with me.\n\nI don't know what to do at this point other than maintain a distance and don't really engage but in a far more diplomatic way than last fall, when saying nothing more than hi and one word answers made me her worst enemy. I'm also at a loss because the boss seems to like her, though I made sure I let the boss know over the winter that this woman really hates her and was going to wage a social media campaign against her with burner accounts as a way to discredit the garbage she was telling people about me.",
    "title": "How do I best handle a colleague who's obsessed with me and my race, but also kinda hates me?",
    "subreddit": "jobs",
    "timestamp": 1625323435,
    "score": 0,
    "keyword": "asian manager"
  },
  {
    "text": "Rant: friend was bullied into breastfeeding by lactation consultants after traumatic birth A dear friend, “Vera,” and her husband just had their first baby. Like all new parents, they obsessed over every little detail to keep baby happy, healthy, and safe. They spent five years and many rounds of fertility treatment to get pregnant; they’ve had plenty of time to do their homework. She was ready for the turning over of her needs to baby … with one exception: __her hard boundary was not breastfeeding.__ For many reasons - including a past history of abuse and mental health medication she can’t take while pregnant or BFing - this was the one piece of her body and autonomy she wanted to be left alone. \n\nMuch to my surprise when I visited for the first time post birth, her house had a bunch of hastily arranged breast feeding items including a pump. Because it’s HER body, and HER choice, I didn’t bring it up. But she did. And did I get an earful. \n\nShe told me that after the traumatic birth — she lost a ton of blood and had to be rushed into surgery to save her life — she was too exhausted to argue when the lactation consultants (LC) kept appearing in her room to hound her about “Breast Is Best.” __Vera was in the hospital for five days and said that after day three she just lost the will to fight back. This is her and her husband’s account of what happened during those five days:__\n\nDAY 1: the LC wheeled in a white board with a T chart that had all smiley faces under the Breast Is Best column, and a bunch of scary things under Formula = Artificial Milk. __Apparently the LC said flippantly that the only “benefit” (and actually used her hands for the air quotes) to formula was that it catered to men who wanted to keep their wive’s breasts to themselves.__ 🤯 LC also went on a rant about the formula-industrial complex… just after providing a list of “Recommended Breast Feeding Supplies Brands!” Pretty rich coming from somebody peddling a certain brand of pumps and nipple cream. Vera was so drugged up from the surgery she said all she could manage was barely nod. Vera’s husband knew she didn’t want to breastfeed but had the stance that it’s her body, her decision — so he was looking to Vera for an SOS, which, of course, didn’t come from a woman who couldn’t even speak. Plus the swipe about husbands wanting to keep their wife’s breasts to themselves really got under his skin … so he stayed quiet. \n\nDAY 2: the LC brought in an iPad with a video of an Asian mother breastfeeding and talking about the cultural bond of breastfeeding and how it honors their family’s roots of women who breastfed babies while working in difficult conditions …. Vera and her husband are Asian. She said they knew they were being grossly manipulated but, again, were just trying to survive. So they told the LC they’d think about it and asked her to leave. \n\nDAY 3: what finally broke Vera was the moment when her husband had stepped out, and *conveniently* the nurse and LC came in WITH her crying newborn and THEY physically removed her gown to place him at her breast. Which, of course, meant he quieted down the moment he started nursing. I actually gasped at the cruelty, violation, and manipulation of that maneuver. \n\nDAY 4: the LC came in to “helpfully supervise” a breastfeeding and reiterated all the reasons why it was the best course and to share some horror stories of women who used formula. Including one about contaminated formula that resulted in infant deaths. Her tagline on that one was that you always know what’s in breastmilk but NEVER know for sure what’s in formula. \n\nDAY 5: just to add insult to injury, as she was being discharged the LC breezily came by to tell her and her husband that *she was so glad* they changed their minds and were instead going to be “responsible parents” by breastfeeding their baby. The LC actually patted her on the shoulder condescendingly. \n\n——\n\nThis couple aren’t shrinking violets or stupid people: he’s a successful prosecutor and she’s a college professor in a male dominated environment. __But the trauma and exhaustion of the birth followed by the relentless tactics of the LC just sapped their will to fight back on what’s best for mom.__ \n\nVera’s beside herself. She feels stuck and is terrified that if she stops breastfeeding that her baby — who is a *smidge* on the small side — is going to die of malnutrition or contaminated formula … or be developmentally delayed … or spout green horns and become an Ayn Rand Marxist or something. \n\n——\n\nI stayed neutral about what she should do because, again, it’s HER body. Told her I was sorry that things didn’t go according to plan and that I’m in favor of her doing whatever the hell is best for her recovery and sanity. I did tell her I thought the approach of the LC and nurses was really shitty. Left it at that. \n\n__I’ve been thinking about this for days, and I’m just mad.__ I’m mad that her doctor (who knew she didn’t want to BF) didn’t intervene. I’m mad that the hospital doesn’t have a firm policy that puts on her chart something like “Patient Not BFing” and have it be respected. I’m mad that my sweet, intelligent friend was taken advantage of at her most vulnerable moments to be bullied into doing something she didn’t want. \n\n__And I’m MOST mad that it was other women who exerted their will over her body.__ \n\nThat’s my rant of the year.",
    "title": "Rant: friend was bullied into breastfeeding by lactation consultants after traumatic birth",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1629487268,
    "score": 772,
    "keyword": "asian manager"
  },
  {
    "text": "Going to HR got me labeled a trouble maker Please forgive any typos, I'm on my phone. TLDR at the bottom. \n\nI work for a very large corporation with a reputation for inclusion. But we were a much smaller company that was purchased and still has a pretty toxic internal structure. \n\nMy boss is an example of that toxic structure.    In many instances they have made open comments (think of the boss from the office) that should get someone fired. Most of which they genuinely believe so whole heartedly they don't understand how anyone would find it offensive. (Ex. Asians can't drive, no one believes the \"me too's\" anyway, all lives matter, some things men just can't do and some things women just can't or shouldn't do, if a women leaves the house without makeup she doesn't look put together she looks sick.) Did I mention this is a female engineer!?!? \n\nSo one day I have had enough and I go to HR to report her anonymously. It becomes a long inquisition where I'm interviewed several times. Half my department is interviewed, including managers up to the top of our site. \n\nIn the end I was informed that \"what I have claimed was at least partially substantiated\"... And that was it. No actions, no closure or resolution. They said it was confidential and they couldn't share anything further. \n\nIt's been a year. My boss clearly knows who it was that reported them and hates me for it. As far as I'm aware they might have had some discussions but she is still awful. She just talks to me as little as possible. This makes my job harder but I'd prefer it over her B.S. \n\nI'm miserable in my job and since I'm not taking to my boss it gives them justification to give me poor reviews. Now I've been told this role isn't a good match for me and I have 90 days to find a new position internally or externally. It's the most slow and pc way of saying I'll be fired if I don't leave on my own. They are doing everything they can to get rid of me now that I've burned a bridge with my boss and other departments don't want the same drama.\n\n As a highly marketable engineer with an impressive resume, it pisses me off that other positions in this company don't want to take me based on my managers drama. I can only hope they at least learn to hold thier tongue sometimes.\n\nMy advice to anyone with a toxic boss... Just leave the role. You cannot change them, and HR isn't there to help you, it's there to keep the company from getting sued. \n\nTLDR: My boss was awful so I took them to HR. After a year, nothing has changed except my boss hates me and has made me miserable. I've gained a reputation for not playing well with others and they want to push me out.\n\nEdit: thank you to everyone for your support. I honestly don't know if I'm willing to go to the steps of getting a lawyer. I understand I'm justified but I feel like it's the same as going to HR but on a bigger scale. I'm justified... The courts might even rule that I'm justified... But then I have a very public history of being a trouble maker. In my industry and city it feels like a small world. I don't want to trade my career opportunities for a settlement.",
    "title": "Going to HR got me labeled a trouble maker",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1619616801,
    "score": 63,
    "keyword": "asian manager"
  },
  {
    "text": "Parents make fun of almost everything I eat. 26F here still living at home because of grad school and That Millennial Life™️. Please hold the judgements about my living situation. \n\n\nI’ve been mild-moderately overweight most of my life. Grew up not learning good eating habits and the family I live with is likes to eat frozen foods, pizza, pasta’s, etc 6-7days/week. As I got older I began to understand what healthy food looks like. I did gain 40 pounds about 4 years ago but lost it with diet and exercise over 1 summer. I’ve stayed relatively the same since, although it is still a higher BMI. \n\n\nI’ve struggled with my self-esteem for a long time because I was bullied for being overweight, and I’ve been working with a therapist for a year to manage. I’m just now trying to explore the world of healthy eating and weight management from a mindset of self-love rather than self-hatred. It’s really hard and there’s a lot of mental barriers I need to break down for me to feel like I can do that successfully. I have PCOS on top of this so I need to lose weight to help manage that. Also working with a dietician, and just dipping my toes into this entire concept of “physically healthy because i love myself” thing. \n\n\nAnyway, I love “good” food. I like salads, avocados, leafy vegetables, etc. I also really love asian foods like bibimap, sushi, pho, etc. According to my parents these foods are “weird” or gross. Whenever I bring left overs home or have the money to make myself something, someone will always go out of their way to look at the food I’ve made, point at it, and tell me “Eww! What is that?! You like such weird stuff.” Just today I made myself an egg salad sandwich and my father takes one look at it and exclaims his disgust.  I get that may not be everyones first choice, but what’s the point in making fun of something I eat?\n\n\nAll of these comments make it really hard to want to eat healthy and feeling okay about myself when I’m constantly being shamed, on top of being in an environment where I don’t normally have access to a lot of healthy choices, and have to actively avoid eating what I do have access to. I’m happy I’m working with a therapist on my body image and self care. \n\n\nHonestly, if anyone had any advice on how to detach myself from this, I’d appreciate it. But if not, I hope I’m at least not alone in my experiences. \n\n\n\n**TLDR;** My parents shame me for the things I eat when they themselves eat very unhealthy. It’s taking a toll on my self worth as I struggle with my weight and self esteem.",
    "title": "Parents make fun of almost everything I eat.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1612894695,
    "score": 22,
    "keyword": "asian manager"
  },
  {
    "text": "My (23f) manager (55?m) is a creep. I filed a complaint and my boss supports me, but I'm not sure how to proceed Hi guys. I'm in a strange situation I've never been in before, so forgive me if this is scattered, but I'd love any insight or advice anyone wants to share. \n\nBasically, I work at a retail store and my manager is a creep. I'm going to change all names etc, let's call this guy Darren. Darren is a single, divorced man of about 55 who's extremely overweight, misogynistic, bitter, and dirty minded. Think boomer making jokes about hating his ex wife and nonstop making sexual jokes. \n\nI was warned about him when I first started working there, because I'm a young woman and the only woman in my male dominated workplace. it's a very old school  work place with an old school mentality (read: low-key sexist and racist remarks common) so his behaviour isn't hugely unusual, although he's definitely the worst offender. \n\nWhen I first started, he was the worst, and has since mellowed out a bit, and would routinely try to push my boundaries to see what he could get away with. I'm gonna list what he's done below:\n\n-i broke my pinkie toe and he's the only one first aid certified so he splinted and wrapped my toe, said \"I'd so have those toes in my mouth if I could, I have such a foot fetish\" WHILE TOUCHING MY FEET AND BROKEN TOE\n\n-stared at me for 30 sec then when I noticed and said what, he said \"you would be so hot if you got all muscly, you'd carry it really well\"\n\n-i had a red mark on my chest from itching, I'm really pale so I go red any time my skin is touched, he said \"I'd love to 'play' and see how much I could mark you up\" (play meaning bdsm or sex)\n\n-without my knowledge, looked into my BF's car when he picked me up after work and watched us make out for several minutes, then accidentally let it slip later that he'd done that \n\n-stares at me whenever he thinks I don't notice..... I mean constantly. no matter what I look like that day or what I'm doing. \n\n-stares at me to assess my outfit and comment on it almost every single day\n\n-constantly talks about sex, bdsm, his kinks\n\n-objectifies women, especially Asian women, and if one comes into the store, acts nice to their face but makes disgusting comments about them when they're gone\n\n-has repeatedly commented on my butt, calling me \"callapigian\" meaning \"has a big butt\"\n\n-has repeatedly shown me photos of women in bondage and ropes, talking about how he thinks it's so beautiful and artistic and how he would love to run a workshop about bondage etc\n\n-constantly, and I mean CONSTANTLY, makes sex jokes\n\nAny time he crosses a boundary or does something I don't like, I either make a face, roll my eyes, walk away, say \"that's not funny/appropriate\", tell him he's crossed a boundary and that's not ok, etc. You get the idea. Basically I've been vocal that I'm not into him, I don't like talking about sex especially not BDSM related things. I don't actually think he'd do anything to me, like he isn't a danger, but he does make me feel so insanely uncomfortable that I don't want to go to work. \n\nI've spoken to multiple coworkers about this, those who are reasonable and progressive and cool, not the boomer dudes. They've all told me he makes creepy remarks about me and other women when I'm not there, and that they notice his behaviour toward me and it makes them uncomfortable just watching it. \n\nI went to the boss, Darren's boss, Andrew, about this. I basically told him, look, I'm used to working in male dominated environments (sports and the music industry jobs in the past) and I'm difficult to freak out or offend. But with Darren it's getting to the point where I am so uncomfortable I don't want to come into work anymore, and my history of missing work especially lately corroborates that. Andrew heard me out, said this isn't surprising nor the first time he's been written up for being inappropriate (he didn't specify with staff or customers). He said he believed me fully, and he would support me with whatever I want to do. That said, what do I want to do? I believe Andrew would escalate this to head office or even my provinces human rights commission if that's what I wanted. My plan as of right now is to write Darren a letter outlining what he's done, why it makes me uncomfortable, how it needs to stop, and what my expectations are going forward, and that it it doesn't stop, there will be real consequences. \n\nThe ONLY things I'm worried about are:\n\n1) Darren and I have a tentative friendship. We buy each other coffee sometimes in the morning, well bring each other lunch if we made extra, we talk about music and our lives and he has been very understanding of me missing work for family and medical reasons. I do like the guy even if he's a creep, and I know he's so lonely and everyone hates him for being a creep, that I would feel bad going forward with this complaint because I genuinely think I'm the closest thing he has to a friend \n\n2) we have a VERY small staff and he's my direct manager. it's a small family business and since COVID we only have about 5 staff, including me and Darren. I don't know how to word this letter to him without making things weird or him retaliating against me.\n\nSorry for the long post guys. This isn't everything but I'm honestly kind of rattled and not thinking super clearly, so I'd love any advice. Thank you for reading. \n\nTL;DR: my manager is a creep, I filed a complaint and my boss supports me, but I'm not sure how to proceed.",
    "title": "My (23f) manager (55?m) is a creep. I filed a complaint and my boss supports me, but I'm not sure how to proceed",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1614293482,
    "score": 13,
    "keyword": "asian manager"
  },
  {
    "text": "Deeply disappointed in a close friend. Turns out one of my best friends is a sexist POS. I've kind of felt it for a while now, but he's made it clearer as of late...I don't know what to do.\n\nIt's so uncomfortable talking to him most of the time. No matter what I'm saying or what memes I'm sharing, or what annoying thing I'm complaining about, he manages to twist it into a political or gender-political argument half the time. That is not what I want to talk about, dude, just wanted to rant about sexism, but sure, make it about you!\n\nJust recently, he's...\n1) Claimed that the typical Scandinavian woman is \"exceptionally hot\" because of a history of pillaging and raping, and \"would you rather rape the hot girl or the ugly one\"\n2) Called women who cut contact with him after he came on way too strong \"bitches\" and, once, \"whore\"\n3) Made frequent jokes towards another friend to \"don't help her, she's a woman,\" which did cause people not to show her simple kindnesses where they otherwise would have\n4) Zeroed in on an immigrant friend who just escaped China and whose English is still developing such that a conversation with his enthusiastic ass gave her a literal headache; he was, as he told us, excited that she's Asian. Made her deeply uncomfortable, which he didn't pick up on or believe me about\n5) Stayed friends with someone who he knows has frequently harassed me to the point of me, an anxiety-freak, having to stage a confrontation with said person\n\nI genuinely have no idea what to do. This guy has been like a brother to me for four years, and all of a sudden, he's showing his true colors. I almost don't want to act on it because we're graduating and going to college soon anyway... Ugh. This is living rent-free in my head right now. I needed to rant.",
    "title": "Deeply disappointed in a close friend.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1637207695,
    "score": 6,
    "keyword": "asian manager"
  },
  {
    "text": "The USA's Status Quo Has Got To Go (And How You Can Bring Change) This is a message written to every physician, nurse, aide, tech, and (most importantly), patient.\n\n**TL;DR:** While practicing medicine in the US may equip you with some of the most advanced technologies and treatments available, there are a number of barriers that render these advances inaccessible to many of our patients.  I'm going to try to outline some of these areas of weakness, and close by summarizing steps we can take to fix our system *for our patients.* Change is going to take all of us.\n\n# High Cost But Poor Value: The US Healthcare System Today\n\nOur patients experience insufficient access to care.\n\n[The US spends a much higher percentage of its gross domestic product (GDP) on health care than other wealthy countries](https://www.census.gov/library/publications/2020/demo/p60-271.html).  However, the US performs poorly on many quality measures compared to other countries, including avoidable hospitalizations and deaths.  Why practice medicine, if we can't *get access* to help our patients?\n\n On a per capita basis, the U.S. spends more than double the $3,453 average of all OECD countries.\n\n[https:\\/\\/www.dpeaflcio.org\\/factsheets\\/the-us-health-care-system-an-international-perspective](https://preview.redd.it/wi3ii0hlvle71.png?width=750&format=png&auto=webp&s=28b7b0793319f64994e52338060e34834c3157e9)\n\n[**Health care access, quality, cost, and outcomes vary** between different regions and states within the US.](https://www.medicare.gov/)  For example, [12 states did not expand their Medicaid coverage under the Affordable Care Act of 2010](https://www.medicaid.gov/), creating a coverage gap for people in these states who do not qualify for either Medicaid or subsidies with the purchase of private health insurance. Further, [prices for an identical health care service can vary dramatically by region](https://www.amazon.com/Understanding-Healthcare-Financial-Management-Seventh/dp/1567937063). (Read about this USA Today article on the same care in [different states](https://www.usatoday.com/story/news/nation/2013/12/01/health-exchange-prices/3797039/), as an example). There is [no universal health care coverage](https://www.commonwealthfund.org/international-health-policy-center/system-features/how-does-universal-health-coverage-work), and a [significant number of individuals do not have health insurance](https://aspe.hhs.gov/sites/default/files/private/pdf/265041/trends-in-the-us-uninsured.pdf). This disparity causes [earlier onset of illness, more severe disease, poorer quality of care, and a significantly reduced lifespan in those affected by poor social determinants of health.](https://www.ncbi.nlm.nih.gov/books/NBK425844/)\n\n# [Overall quality of care, by state, 2014-2015](https://www.ahrq.gov/research/findings/nhqrdr/nhqdr16/overview.html)\n\n[ Some states in the Midwest \\(Iowa, Minnesota, Nebraska, North Dakota, and Wisconsin\\) and some in the Northeast \\(Delaware, Maine, Massachusetts, New Hampshire, New Jersey, Pennsylvania, and Rhode Island\\) had the highest overall quality scores. Scores were based on the number of measures that were better, same, or worse than the national average for each measure. Many Southern and Southwestern states \\(Arkansas, Kentucky, Louisiana, Mississippi, New Mexico, Oklahoma, Texas, and West Virginia\\), several Western states \\(Nevada, Oregon, and Wyoming\\), and one Midwestern state \\(Indiana\\) had the lowest overall quality scores.](https://preview.redd.it/cebbev6esle71.png?width=699&format=png&auto=webp&s=6fc8ec5045f8f8874cf462a1083d189f5cc8ce32)\n\n# [Average differences in quality of care for Blacks, Hispanics, and Asians compared with Whites, by state, 2014-2015](https://www.ahrq.gov/research/findings/nhqrdr/nhqdr16/overview.html)\n\n[ Some Western and Midwestern states \\(Idaho, Kansas, North Dakota, South Dakota, Utah, and Wyoming and several Southern states \\(Kentucky, Tennessee, and Virginia\\) had the fewest racial and ethnic disparities overall. Several Northeastern states \\(Massachusetts, New York, and Pennsylvania\\), some Midwestern states \\(Illinois, Indiana, Iowa, Minnesota, Ohio, and Wisconsin\\), one Southern state \\(North Carolina\\), one Southwestern state \\(Texas\\), and one Western state \\(Arizona\\) had the most racial and ethnic disparities overall.](https://preview.redd.it/giujjwfssle71.png?width=700&format=png&auto=webp&s=a6e0b7d0d79caec7788ef9565f9a2681ec2cf139)\n\nAccording to the [US Census Bureau reports](https://www.census.gov/content/dam/Census/library/publications/2020/demo/p60-271.pdf) published in September 2020, 8% (26.1 million) of Americans did not have health insurance during 2019. 92% of Americans had health insurance coverage during 2019 (68% via private insurance, and 34.1% via public insurance). Now, [around 30 million people in the US remain uninsured](https://www.healthcare.gov/glossary/). Many more are underinsured, with [half of US adults reporting having delayed or skipped medical care due to costs.](https://www.healthcare.gov/glossary/)  Why? Well, for example... The average cost of an inpatient admission was [$25,000 in 2018](http://www.ncsl.org/research/health/global-payments-to-health-providers.aspx). Common and essential drugs, such as insulin and epinephrine autoinjectors, can cost hundreds of dollars each. [Drug prices in the U.S. are twice as high as in other countries](https://www.healthline.com/health-news/prescription-drug-prices-in-the-u-s-are-twice-as-high-heres-why). Experts say brand-name drugs are the main driver of higher prices, and note that actual out-of-pocket costs is difficult to gauge. (This is beyond the scope of today's post).\n\n[ In 2015, the U.S. spent $325 billion on retail prescription drugs, equivalent to 1.8&#37; of GDP, or 10&#37; of total national health expenditures. Spending has grown considerably since the 1980s ](https://preview.redd.it/6hvld691tle71.png?width=768&format=png&auto=webp&s=b0da12f78ca2b33d95765e3d8da63099514c09e9)\n\n[The U.S. spends substantially more per capita than other countries. According to the OECD, the U.S. spent $1,112 on retail pharmaceuticals per person in 2014, while the next highest spender was Canada, at $772, followed by Germany at $741 and France at $659. ](https://preview.redd.it/hbb2lhh2tle71.png?width=768&format=png&auto=webp&s=fba1ef0ad5d392620caa5749cd09dcb2adcee6c0)\n\n[Source](https://www.bruegel.org/2017/08/the-issue-of-u-s-prescription-drug-prices/) \n\nPolicymakers aren't going to require changes without pressure from a coordinated movement.  You can use the [social determinants of health](https://www.cdc.gov/socialdeterminants/index.htm) as an example of how our system is failing. These political, cultural, and socioeconomic conditions into which individuals are born and with which they live impact health.  We have found that one's education, the environment, nutrition, wealth distribution, gender, race, and/or access to health care [are not very well addressed in the current system](https://www.healthleadersmedia.com/welcome-ad?toURL=/clinical-care/5-ways-healthcare-organizations-can-address-social-determinants-health). Do you know anyone affected by any of these?\n\n# The US population has a higher chronic disease burden than other 1st world countries, yet spends more money than other countries\n\n[https:\\/\\/mpkb.org\\/home\\/pathogenesis\\/epidemiology](https://preview.redd.it/dvmyxaixule71.png?width=800&format=png&auto=webp&s=1d943fec8695a704a17c6c7bb728e165320cecb0)\n\nHow embarrassing! US politicians, health care administrators, and investors are failing us. Most would argue that a just and equitable health care system benefits a society as a whole.  You can measure that by looking at chronic disease burden. How are we doing? \n\n[28% of US adults report](https://www.census.gov/library/publications/2020/demo/p60-271.html) having been diagnosed with two or more chronic diseases (e.g., hypertension, diabetes) in their life, compared to an average of 18% of adults in other wealthy countries.  [This is a huge red flag about a failing system, but the causes are beyond the scope of today's post (you can read more about them here).](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5876976/)\n\n[https:\\/\\/mpkb.org\\/home\\/pathogenesis\\/epidemiology](https://preview.redd.it/txbpns0evle71.png?width=400&format=png&auto=webp&s=bfa73dd0f49a3f8b08051eac456ad91c5ac19920)\n\nA just and equitable system ensures certain standards of public health that, in turn, [reduce the burden of disease on the entire population.](https://health.usnews.com/health-care/for-better/articles/the-case-for-universal-health-care) (This is [how universal health care pays for itself](https://www.healthcare-now.org/blog/how-single-payer-health-care-pays-for-itself/)). Accordingly, a health care system should strive to provide access and treatment to all population groups regardless of identity and socioeconomic status, while ensuring that underprivileged groups are not ignored.\n\nRecognizing and addressing inequalities due to social health determinants can improve the health of the most vulnerable and at-risk groups. For example, [social justice](https://www.apha.org/what-is-public-health/generation-public-health/our-work/social-justice) in health care is the delivery of high-quality and fair treatment, regardless of an individual's age, race, ethnicity, economic status, disability, or sexual orientation.\n\n# What can be done about all of this?\n\nThe most important step is to learn how our system (and specifically it's failings) are influencing the health of our patients.  We must acknowledge and address our role in changing it.  We need to look at how other countries allocate resources in ways that benefit more people (e.g., set up a budget inclusive of underserved populations). We need to provide training to ensure health care providers are culturally competent and advocate for patient rights.  We also need to create diverse care delivery models.\n\n# It starts with each of us.\n\n**You can** help fix the illogical things the USA is doing in medicine, medical education, and healthcare policy without sacrificing as much as you think. Where to start? Talk to each other. Share your goals, struggles, and challenges. Join together. Drop the poisonous attitudes, the fights, and the competition. Smell the roses. It just takes some common sense, optimism, communication, and compromise. It takes all of us working for our patients.\n\n**Today, I'm hoping to encourage all of you to** seek progress. We need to acknowledge this responsibility before things worsen. Perhaps you're discouraged, isolated, and overworked. You're not alone. We are waiting for others to fix medicine, but it's got to be us.  The status quo has got to go. How will you stand up to it?\n\n[Healthcare workers \\(and our patients\\) need to get more active in politics. ](https://preview.redd.it/c71gv3x4sle71.png?width=506&format=png&auto=webp&s=4f3e7ca0da93541a075af89a3210db36b8ccd43e)",
    "title": "The USA's Status Quo Has Got To Go (And How You Can Bring Change)",
    "subreddit": "medicine",
    "timestamp": 1627762376,
    "score": 134,
    "keyword": "asian manager"
  },
  {
    "text": "In 4th of nursing school, but don’t like nursing what should I do? (Kind of long sorry, please don’t be mean) Hi, so I’m in my 4th year since I’m doing a BSN. I initially went into nursing since I really like the science courses I took in high school and I’m going to admit, I also chose it this career because of the money. Have always been good at math, physics, bio and chem. I took the first year courses like anatomy, physiology, microbiology, patho physiology and pharmacology in my second year and I really liked them. For our school we started clinicals in 2nd year at a long term care facility. It was for us to learn things like how to give a bed bath, feeding, how to change briefs, and how to use mechanical lifts and transfer belts. I did not enjoy doing these things and this was when I first wanted to switch out of the program and pursue a different career. People were telling me to just stick with it since it I was still in my first semester of second year and that it might “grow on me”, and the problem is it never did. I’ve done acute care (they call med-surg in the states apparently), mental health, and community health rotations and now I am finally in my nursing leadership and management rotation in my 4th year starting Monday.\n\n In my 3rd year I actually failed my first acute care (med-surg) rotation only 4 days into the rotations. The main issue was my instructor who singled me out because of my race, I am asian by the way, and everyone in my clinical group was white. She would always nick-pick at things such as correct me on my words when I would say wash my hands and she would correct me and be like “no one has time to wash their hands all the time its called hand hygiene”. She also made comments about why I dyed my hair blonde to try to fit in with caucasian people and that its too long and I need to cut it. She accused me of neglecting my patient because a nurse on that floor offered me the opportunity to do a wound dressing on her patient and I went to go do it. There were a bunch of other things as well but I’m not going to go into it too much since this post is already so long, but most of the other members of my clinical group also had issues with her but they did recognize that our instructor kept singling me out. After she failed me, I had to go to the student advisor to get my schedule revised since they change our curriculum, added in the leadership and management rotation and took out our OB rotation, which then meant I had to do an extra year of school, so 5 years in total.\n\n I continued with my schooling and rotations and never felt that spark or passion for nursing, I was just doing them in order to get a good mark and pass. A lot of the students seemed to have this nurturing personality and genuinely loved the relationships they have created with their patients and they always share stories during post-conference at the end of our clinical shift, and I always had nothing to share because I didn’t really care, I just wanted to go home and study for other classes. \n\nI was doing my preceptorship on a cardiac surgery unit in the fall term 2020 (Sept to December) and my preceptor did not pass me, she even asked me during our zoom meeting if I liked nursing or not and that she sees my heart is not in it and its kind of sad. So I have to repeat this preceptorship in the spring/summer semester (May to august) after I do this leadership and management rotation from January to April, which makes it 5.5 years in university in total I'm going to be in by the end. I’ve realized I don’t really love nursing and should of switched out during my very first clinical rotation I’ve ever had to save time and money. But I have two semesters left to do and the smart thing is just to finish it so at least I have a bachelor’s degree and then pursue something else. I was thinking of doing computer science, engineering, or pharmacy but I’m already 22 years old and don’t have much time left. \n\nI know I’m going to get a lot of people who are mad at the reason why I choose nursing, but believe me when I say I really wanted to love nursing, but I just didn’t. I’m literally crying as I write this because I’m so miserable, I can’t see myself doing this for 45 years. I’ve googled non-bedside nursing jobs and they all seem to need years (like 5-7 years) of experience as a bedside RN and I don’t want to put myself through that suffering just to get a job in public health or informatics. So I just need some help here on options :(",
    "title": "In 4th of nursing school, but don’t like nursing what should I do? (Kind of long sorry, please don’t be mean)",
    "subreddit": "nursing",
    "timestamp": 1610240841,
    "score": 4,
    "keyword": "asian manager"
  },
  {
    "text": "That does it. I'm out. I've had enough.\n\nFirst it was getting screwed out of a promotion when new management came in.  I busted my ass for this time and earned my stripes with the previous management,  for which I was offered a department lead position.  I wouldn't have cared if they said \"Look, you've only been working here for two-and-a-half years and Alice has been working here for 5.  We believe the most senior person should get promoted.\"  But they went out of their way to show that Alice (not her real name) is the new golden child (she's the only member of the old staff who got promoted - they brought their own people in for other leadership/management roles).\n\nNew admin is cliquey.  They show no sign of wanting to support the teachers who are already here, who have been building the school for the last 5 years.  They've made it clear that they have no faith in certain teachers (in particular former military and industry), since they prefer the \"traditional path\" teachers.\n\nNow this:\n\nOur school is divided between students who are above-average to pretty strong academically and students who really struggle to keep up.  30% are pretty strong academically, and 50% are just average, and 20% are lagging behind.  Recently new management has decided something has to be done about the disparity.  They claim that there is a disparity among achievement among ethnic groups.  Asian, Latino and White students tend to do better than Black students.  They want to correct this.  Most teachers agree that something should be done, but we just don't agree about HOW it has to be done.\n\nNew admin suggests what essentially amounts to cooking the books.  Since we're private, we don't have IEP's.  Kids who are struggling are placed in a special \"Learning Assistance Program\".  Students in this program cannot be given lower than a 60 on any assignment as long as that assignment is turned in.  They can't be failed for a class until we've met with the parents three times, and a reams of paperwork are signed.  Electives and sports count towards GPA, and we're to make accomodations in grading as well.  Kids in the Learning Assistance Program can't be suspended.  They get special projects that basically boost their GPA.  Teachers have to bump up grades sometimes by more than an entire letter grade at the request of admin for these projects, which for whatever reason, we're not allowed to see.  Honors classes will no longer be weighted.\n\nThe result is that even less than one month in, in the Learning Assistance Program are basically starting to game the system.  In some cases I was basically requested to dictate the correct answers to students during tests, or to upload homework answers to Moodle so that the students could \"print that out and submit it\".  Literally all they're doing is printing stuff out, putting their name on it, and I'm required to give them an A because they've answered everything correctly.\n\nNot to mention that we now have kids intentionally acting up in class (e.g. dancing in the aisles  or bouncing a basketball to get on teachers' nerves), or in some instances verbally threatening teachers.  Some students have been openly defiant and admin shrugs it off because \"different cultures have different attitudes towards authority\".  These kids are acting up are either white or black American.  The \"different culture\" kids are more or less respectful.\n\nNeedless to say, some people think it's unfair.  We have a lot of first-generation Asian and Latino immigrants who came to this country with the dream of \"making something of themselves\".  These kids are driven as heck to perform well academically.  But they are not given Learning Assistance.\n\nAdmin doesn't want to backpedal on the policy and demands that we check our privilege, ignoring that our student body and current academic team is pretty diverse already.\n\nI refuse to lie just so my admins can look good and appear as some great humanitarians when they are chasing their own ego.  As soon as I've secured a job for next year, I'm out.",
    "title": "That does it. I'm out.",
    "subreddit": "Teachers",
    "timestamp": 1611819247,
    "score": 32,
    "keyword": "asian manager"
  },
  {
    "text": "Minority teachers Can you please tell me your experiences in predominantly white districts? As I was doing research for an interview I have coming up, I noticed that there were articles about the effort of this district to hire black teachers as well as some incidences of racism. \n\nThere is a whole movement on FB about it actually. I also saw statistics of there being 1 black administrator and 1 Asian one in the district of about 7 schools. Also there are supposedly 14 black teachers and 350 white teachers. \n\nNow, I do not know how to feel. I would be leaving a predominately black and Hispanic school for this one. The title 1 school I’m at just lacks resources as far as good curriculum guides, students are progressing to grades without the right skill set for whatever reason, old and broken down equipment and classrooms, and I’ve been pretty frustrated with the lack of teacher support as a first year teacher. However, I’ve managed to take it all on and do a pretty good job considering what I was dealt and the lack of support for a new teacher. I mean this may seem small but I constantly get emails referencing things that need to be completed and I have no idea about it and that is frustrating but I guess to be expected?\n\nAnyway, what are your experiences as minority and especially black teachers (I am a black female teacher) in these districts?",
    "title": "Minority teachers",
    "subreddit": "Teachers",
    "timestamp": 1623225560,
    "score": 5,
    "keyword": "asian manager"
  },
  {
    "text": "Classroom Management for Young Teachers Hey everyone, I’m getting ready to become a substitute teacher with the possibility of becoming a full teacher by the next school year. I’m 21 (M) and was told that the most important thing administration looks at with young teachers is their classroom management skills. Any advice? I’ll be subbing for Middle/High school and I have a lot of Asian features (meaning I look very younger).\n\nThanks !",
    "title": "Classroom Management for Young Teachers",
    "subreddit": "Teachers",
    "timestamp": 1618852681,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "What careers are in demand right now? i’m currently a senior in highschool with some ideas of what i’d like to go into but i’m very worried about job saturation and picking the “right job” (something that is easier to find a job in after i graduate!)\n\ni don’t have any particularly specific interests/hobbies !! \n\nthe main thing is i want \n- a job with 100k+ salary\n- good job stability (won’t be replaced with young fresh workers quickly)\n- can get job (job is in demand)\n\nmy own skills:\n- effortless terribly good memorization\n- visuals visuals !!\n- great at communicating\n\n- not the best at writing \n- uncomfortable public speaking (ok i’m working on this one i’ll put myself out there in uni !!)\n\ncareers: \n- teaching: yes hear me out, in canada after 10 years of teaching i think the numbers are like 95k a year plus lots of pension benefits etc, and this would be a fun one! however i feel that myself doing this job would be a bit wasted potential u know ?\n\n- ui/ux designer/graphic designer: this is sort of a new career i’ve only recently heard of but from what i can see,,, there’s no big university degrees i need and the thought of freelancing gives me insane amounts of anxiety, i have a knack for visuals and designing, but i’d like job stability, if i can find job security with this one then i’ll be terribly happy \n\n- comp sci: uhh i’ve never coded anything in my life but u know what they say theres job saturation but there’s more jobs coming or something like that !!!! i feel that i am a bit behind my peers who participate in hackathons and constantly are up at 3am terribly angry over “bugs in their code” so i might not be able to compete at all ?? but if this career isn’t miserable then i’ll give it a shot (aka take an intro class in uni and see)\n\n- business: not too sure what business is but i know that accounting is kind of hard for me (took a dumb option class in freshman year and nearly died because i just could not balance the two sides) and i’m not white nor a male so i’m not too sure how i’d do climbing up that corporate ladder but i do have a genuine interest in business\n\n- start my own business: hear me out on this one, imagine i start the next “anti social social club” that terrible quality hypebeast clothing brand that charges like $100 for a thin hoodie, that would be great! i’m going to try it during my uni years as i already have design ideas! (of course i’ll go for high quality materials as i’m genuinely passionate about this!)\n\n- or open some sort of coffee/boba place - i currently work at one for minimum wage and after snooping around and doing some calculations, i’m certain that my manager makes at least 200k+ a year, who knew you could operate an overpriced boba shop in a small city and actually profit?\n\nmy mother recommends law and pharmacy but they both sound like jobs i would never enjoy so i’m not really considering them\n\n??? twitch streamer: hey if being a twitch streamer brings in enough income during my “prime” and i invest it, i’m totally ok with the terrible job stability (you’re basically only good for 5, 10 years max but if the money’s giant thennn)\n\ni also do know about investing, stocks, real estate, crypto, and will most definitely invest and go into real estate, but before all that i really need to choose a major\n\ni’m open to any career suggestions! \n(maybe not trades i’m a 5’7 105lb asian female equivalent to a stick so that’s not really my path but i know they do be paying wellll)\n\nanything can be suggested !!\n\nedit: located in canada",
    "title": "What careers are in demand right now?",
    "subreddit": "careerguidance",
    "timestamp": 1628179564,
    "score": 8,
    "keyword": "asian manager"
  },
  {
    "text": "Did a BS in Health Science (emphasis in Nursing), but I don't really know what options I have. I initially wanted to do Physician Assistant studies or continue into Nursing, but I could not see myself as one. What can I do with my degree within healthcare? I just graduated about a month ago with my degree in Health Sciences with an emphasis in Nursing and a Psychology minor. I come from your typical Asian family with the four Asian pillars (Doctor, dentist, lawyer, engineer) and both my parents are engineers. It sucks cause I think my parents constantly guilt trip me when I try and say I want to find something else I want to do in my life, but I kept sticking with it and now I just feel stuck to be honest. Throughout college, I kept lowering my standards after doing research over time about the amount of stress and effort it would take to become one of these job titles, but I mainly realized it is because I wasn't entirely invested in the \"medical\" part of healthcare. I got burnt out of school, but I somehow pulled off above a 3.0. \n\nDuring the pandemic, my work ethic suffered, and I don't want to blame it on ADHD or whatever, but I struggled to attend classes online. I didn't really understand the gravity of the situation I was in until my last semester, when I was job searching, and entry level jobs required years of experience which I don't have as a fresh graduate. (Also I think I also felt dumber during quarantine and online classes because I didn't feel like I had to put in much effort into school.) Also some negative qualities that I had got even worse during my last semester, including anxiety and overthinking. Right now I just feel burnt out of life, and I just don't really know what to do. \n\nI have two really great friends who continue to try and motivate me, but it just sucks cause we all had plans to move to a city together and I couldn't find a research job (which is the field I am applying for now) that paid well enough for me to move. Don't get me wrong, my parents are still willing to support me, but I know I need to push myself into becoming more independent than I was in the past. I've always had that fear of the unknown, and I like stability, but not even having a possible next step is really stressing me out. \n\nOne thing that I had in mind was that last year I interned for a candidate for state congress as a field manager, and I had to work with my team to promote his policies through phone banking and canvassing. While I did not like the actual political aspect of the internship, I loved working with several people to come up with ideas on different tactics and approaches when it came to the work. I loved the feeling when we were able to accomplish certain tasks together, and I felt like maybe a field related to my major would be healthcare management? I researched the role descriptions and it seemed similar to what I could envision myself doing, but that is entirely different from reality. I just don't know where to start I guess. Finding a decent job is difficult and I don't have the work experience or high enough gpa for graduate school. I would appreciate some advice on what to do. Apologies for the lack of consistency in my paragraphs I'm just barfing my thoughts onto this page. \n\nWhat I've come to realize about myself is that I would rather work a job that I am good at, and that would give me joy than some other bull\\*\\*\\*\\* field within healthcare that I just don't really care about. I just had a job interview today at my mom's company for a research chemist 1 job and the hiring manager told me that he liked me, and if his division was in research and development, he would hire me, but his division was in quality care meaning he needed experienced individuals, not recent college graduates. Again, I won't mind harsh criticism either, but if it could be constructive I would really appreciate that as well.",
    "title": "Did a BS in Health Science (emphasis in Nursing), but I don't really know what options I have. I initially wanted to do Physician Assistant studies or continue into Nursing, but I could not see myself as one. What can I do with my degree within healthcare?",
    "subreddit": "careerguidance",
    "timestamp": 1624508820,
    "score": 2,
    "keyword": "asian manager"
  },
  {
    "text": "I quit. I think I did the right thing.. but i feel guilty? So... I worked at this oral surgery office. I was one of the admin assistant. \n\nIn the beginning, things were alright, I worked with all girls, and everyone seemed pretty friendly. I've always been the quiet kind, (since HS), and I always keep to myself. Let my work speak for myself. Though, I observed how catty the girls can be behind each others' backs, and there's only maybe.. 9 of us in total. During my first few months there, there were girls who quit on the spot or never showed back up because of how condescending our two managers can be, and the other employees trying to get on the doctor's good side. There were two sides, the back girls (who help the doctor) and front desk girls. I never had issues with anyone cause I would do my work and leave. Make small talk with other front desk girls. (There were only 3 of us). \n\nAfter a few months.. I became the \"favorite\" to the doctor and manager for front desk because of how I spoke with patients, doctor offices and how I poised myself in a professional matter. They would make me decide on what should be done, what I thought, asking for suggestions on how to make the front desk run more smoothly, etc. But there were back girls who got a bit jealous of how front desk girls were getting treated.. so some times they would \"forget\" or add on procedure codes, which would mess us up when quoting patients - which would delay payment and make the doctor mad for waiting on surgeries, since we also have hectic scheds. \n\nI would brush it aside because I was told how the back girls were, and I spoke to my manager. She said she would handle it. But because they're all older and worked together for years.. no change really happened. And they would talk behind the front desk girls', saying how lazy they are, how ugly one of the girls were and that she has ugly hair. My manager would talk bad about them to me, even. But when one of us makes a mistake, we all do. Which I agree. I just don't appreciate the negativity and cattiness because it's pointless, but I'm also sensitive even if it's not about me. I hate how they would put me in the middle of it. \n\n Then I found out from the new girl, who was also asian (my coworkers and manger were white) - (we became pretty good friends, and would talk outside of work) that the back girls told her that me and other girl were talking about her, and that they noticed we were harassing her.  \n\nThe new girl called me after her shift to let me know, and she was laughing about it.. but it still hurt my feelings that people would do that. \n\nSo.. the worst part of it all.. my manager would give me extra work because I was the 'responsible' one. And so I would do claims, billing, etc. Which I didn't mind helping out, it would be more experience to learn - especially since this isn't my forever job. One day, I was on the phone with this insurance and they told me that a patient was covered for a procedure. Though, my manager and the billing coordinator \"corrected\" my work and put down that he wasn't covered. I found out they would do this with majority patients, telling them they're not covered to pay out of pocket and then collect money from insurance. And then fixing up claims that were being sent. \n\nI speak with patients. I let them know what their out of pockets are... patients cry when they're in pain, and need to get it done but can't afford it. It honestly breaks my heart.\n\nI would come home crying every day. From the bullying of the coworkers and the manager to lying to patients and stealing from them. I told the other front desk girl about the lying to patients, but she didn't seem to care, it wasn't a moral or ethic issue for her- she's more upset that our coworkers are mean to us. It's not like the work is hard, I didn't mind doing it, I liked it... but lying and all of it put such a strain on my mental health. \n\nOne day, on impulse - after my shift.. I cleaned my station, took my folders. Clocked out, and never showed back up. I would give them the courtesy of two weeks, but I know I would have such a passive aggressive attitude towards me during those days. The front desk girl was telling me to stick it through, and she wouldn't make it there without me. (We would always joke about quitting together, but never actually had the balls to do it).\n\nI never understood why people would just up and never show up, but I did the same because of how bad it got. And now I've been unemployed for the past few months.. and now I'm wondering if I should've stayed, at least I would get an income to help pay for my dogs (blessed I still live at home). \n\n&#x200B;\n\nTL;DR- quit a job because of the coworkers and office was lying and stealing from patients.. now I'm unemployed for months and I don't regret my decision, but I regret not having an income.",
    "title": "I quit. I think I did the right thing.. but i feel guilty?",
    "subreddit": "careerguidance",
    "timestamp": 1628777323,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "A journey from one year of unemployment to multiple job offers **TL;DR:**\n\nI quit my job as an entry level QA/STE/SDET/whatever you want to call it last June. Life doesn't go quite as planned, so I spent last July to March of this year being sad and doing nothing. I decide to go all in on LeetCode for \\~3-4 months, and land multiple offers from big tech companies, learning a bit about myself & the study process along the way.\n\n**Where it all began:**\n\nI left my job in testing almost exactly 1 year ago today for a handful of reasons. I would say the biggest reasons were that I wanted to make a transition into SWE and burnout from poor WFH practices that I had. I told myself I would take a \\~2 month mental break before getting back to the grind. The day after I put in my 2 week notice, I get dumped by my girlfriend. This makes me sad.\n\nThe 2 months I set aside for myself pass, and I start trying to do LeetCode (henceforth abbreviated LC). It was hard and I felt like it was going nowhere. At some point in November I began applying to jobs, hoping that having an interview would push me to study. I get ghosted/rejected by every company. This makes me even sadder and I sink into a slump that lasts until March, where I do not accomplish anything career related.\n\nI instead sunk all of my time into playing video games, because I was good at these. Eventually I realized that I was deriving almost all of my happiness and self value from how good I was at these games. This made me very scared about the direction I was heading in my life and I decided to make some major changes.\n\n**The power of habit:**\n\nI had about \\~100 LC problems solved prior to all of this. Link to my LC profile if you want to see just how closely the submission history matches the story I am telling: [https://leetcode.com/aTastyStrawberry/](https://leetcode.com/aTastyStrawberry/)\n\nIn mid-late February, I logged in to LC hoping to change the direction of my life. I attempted to do some problems but struggled as expected. I was getting pretty frustrated, but then I noticed something called \"February LeetCoding Challenge 2021\". I clicked on the link and read about it. The challenge advertised itself as a beginner-friendly challenge that is essentially just solving 1 question per day. I thought this sounded pretty cool, but since it was already mid-late February, I told myself I would just do the March daily challenges.\n\nMarch comes by and I actually forget to do the first few days, but I've had enough at this point and I refused to wait until April to make a change so I decided to just start a few days late. I actually got kind of lucky with this, because in more recent months some of the problems at the start have been a bit too difficult to consider \"beginner friendly\". I promised myself that no matter what, I would solve at least the daily problem every day. I found my confidence growing over time as I began to remember old concepts about DS&A. This eventually snowballed into a system where I was solving several problems per day, every single day.\n\n\"Alright, time to log in and do my daily problem. Oh, this problem is pretty similar to what I just did. Might as well do this problem too. Oh, well I'm already on the website, and it did feel kind of good to solve those other problems. Might as well do some other problems while I'm here.\"\n\nThere are 3 major learnings here, which I will touch on. Some of these are really obvious and you probably already know them to be true.\n\n1. The hardest part about building any habit is starting. After you establish the habit, everything after just seems to fall into place with a fraction of the effort.\n2. If you're struggling with LC, you probably aren't as stupid as you are making yourself out to be. In most cases, it just means you haven't learned a fundamental concept or you're a bit rusty. When I was a kid I watched a show called \"Are you smarter than 5th grader?\" and I always remembered thinking adults were so stupid for not being to get basic trivia. Looking back at this, it's clear that it's absurd to expect somebody to be able to recall some obscure fact that they may or may not have learned 20+ years ago.\n3. I didn't hate/dread LC itself. Turns out I LIKE doing LC. I just hated being bad at LC. If you really hate doing LC, try doing it seriously for a bit. If you still hate it afterwards, that is fair and understandable. But who knows? Maybe you'll come to enjoy it.\n\n**The first offer:**\n\nMy resume went through \\~8 revisions between February and April. I was beginning to get interviews, and oh man did I bomb my first few. I had an interview where I knew that I was going to fail about 5 minutes in. I had a phone interview where my interviewer asked me a multithreading question that I didn't know the answer to, and I spent the next 15 minutes more or less guessing what to do with 0 feedback/mercy from him. It felt really bad, but I remained optimistic by telling myself that no matter what, I was improving over time.\n\nTwo months in to my LC grind, I had the good fortune of being given a referral to interview for a big tech company by a hiring manager. I'm comfortable enough with LC at this point. I could solve most medium problems in < 15 minutes. I breezed through the OA and get invited to the final round. Despite failing a bunch of interviews before this, I actually felt somewhat confident for this interview. The reason I felt confident for this interview specifically was because these types of interviews are pretty well documented. I knew that I was going to be asked these LC style questions that I was so familiar with at this point. In order to not burn myself out prior to the interview, I instead shifted my focus over to behavioral elements of the interviews.\n\nEvery other day or so, I read a post that is titled something like \"I am a QA engineer right now, how hard will it be to get into SWE?\" My answer to this question is that you will either be at an advantage or a disadvantage, but you are the one mostly in control of which one that is. Learning to talk about your own experiences is an important skill that should not be overlooked. Take time to practice talking yourself up and build confidence in whatever it is that you did. Learn to spin your experiences in ways that are relevant to where you are applying to. The worst thing that can happen in this position is you convey to the interviewers that you do not think you have what it takes to succeed. Do not let this happen under any circumstances.\n\nThe day of the interview arrived and I completely crush it. I signed an NDA so I can't give out the exact problems, but what I can say is that I was asked questions between the medium and hard difficult on LC. Funnily enough, I had actually done none of the exact problems before on LC, but my fundamentals were strong enough to work through the problems extremely comfortably in the time allotted.\n\nI receive an offer. It's a really good one for an entry level position according to [levels.fyi](https://levels.fyi). I tell my Asian parents the good news. They verbally abuse me for only 5 minutes compared to the usual 30. Life is good. The story has come to a close, seemingly.\n\n**The second offer:**\n\nI had some other interviews lined up still when I received my initial offer. I knew that if I could get a competing offer, I could maybe up my TC by a fair amount of money. Or better yet, maybe I could get an offer from somewhere I'd want to work for even more. I had already done all of the studying, so I figured it just made sense to interview while my LC skills are still fresh and at their peak. I was in the loop with two big tech companies, who I will refer to from now on as Company A and Company B.\n\nI had final interviews scheduled with Company A. After acing a phone interview with Company B, a recruiter calls me and tells me that I'm invited to a final round with them. I'm ecstatic, and then the recruiter drops a bomb on me. I'm not interviewing for an entry level position. I'm interviewing for a level 2 position, and down levelling is not an option since there are supposedly no available spots.\n\nPanic. I had geared all of my preparation towards finding an entry level position. I haven't studied system design at all. The recruiter tells me that she understood the nerves, but to try my best and that I might surprise myself. After talking to a few friends about the situation, I made the decision to cancel my final interviews with Company A and go all in on studying system design. I studied 55+ hours of system design over the next 5 days.\n\nI went into these interviews with a win-win, learning attitude. I told myself \"If I do well on this interview and get an offer, that's cool. If I don't, that's OK because now I know what to expect when I interview for the next level up 1-2 years from now.\" Funnily enough, I had 0 nerves because I was expecting to completely fail.\n\nI tried my best in these interviews, and I know for a fact that I had a strong performance on the coding interviews, but wasn't so sure about the others. I also signed an NDA for this, but I would say that this interview difficulty mostly fell between medium and hard LC questions as well. And once again, I've done none of the exact problems before. I get a call back from the recruiter the next day.\n\nI've done well enough in the interviews to skip a few steps and I am given an offer on the spot. I don't believe it. I pinch myself, I don't wake up. One and a half months ago I had woken up from a dream that I got an offer from one of my dream companies. That hurt to wake up from, and I wanted to make sure this wasn't just deja vu. I take some time to process the info and think about it. Over the next 48 hours, my offer's compensation changes and I was really happy with it. I also spent a lot of time talking to a few friends and mentors before deciding to take the leap and sign on with Company B.\n\n**On interviewing & software engineering:**\n\nI'm not here to debate/discuss the current state of tech interviews. Do I personally think it's silly that some random NEET can study LC and cram system design in 5 days and get a SWE2 offer, while somebody who has been working hard as a SWE1 for 2 years might have difficulties getting naturally promoted? Yes, but that talk is not for now.\n\nInterviewing is a skill. It does not definitively say anything about your software engineering skills. Do not let rejection from these interviews bring you down about your potential as a software engineer. Similarly, I do not believe passing these interviews makes me a better software engineer than anyone else. I've never even had the title of \"Software Engineer\" in my life before!\n\n**On shortcuts and \"the secret sauce\":**\n\nShortly after receiving my offers and telling a few people about it, I suddenly had a lot of people reach out to me asking me for any tips and tricks I had. How did you do it? What's the secret sauce? The funny thing is, a good number of these people are people I had asked to study with from day 1. They gave me a number of excuses that I won't go into detail about in this post. They saw me studying day and night. I told these people that the \"secret\" was right in front of them the whole time.\n\nOutside of a few things like the Blind 75 list and LC premium telling you what problems are frequently asked, there is no secret sauce. It just comes down to how much you are willing to put in.\n\n**Personal tips for LeetCode:**\n\nBelow I will list a couple of the strategies & tips that I utilized throughout my 3-4 months of daily LCing. I just want to quickly say that this is what worked for me. As you dive into your own LC journey, it's entirely possible that you develop a system completely different from mine, and that's ok if it works for you!\n\n1. The most important thing is sustainability. A lot of people who start new habits tend to go extremely hard and burn themselves out all too soon. To avoid this, I asked myself this question: \"Can I see myself repeating the same level of grinding tomorrow?\" If there was any doubt, I usually would stop.\n2. Pick your problems wisely. Do not do problems for the sake of increasing your problem count unless you are just starting out and need a confidence boost. Challenge yourself. Problems you solve should accomplish one or more of these things: teach you a new concept, teach you to apply a familiar concept a different way, reinforce your understanding of a concept, or combine multiple concepts you've learned already.\n3. Don't cheat. Remember the goal. We are here to learn, not to specifically solve problems.  If you've been stuck on a problem for a long time, it can be tempting to go look for \"just a hint\" by looking at what the beginning of the solution might look like. I felt this too, and I realized that this was just my fragile ego speaking. My ego wanted to be able to say \"oh yeah, I knew that\". Remember, you are here to learn. If you're stuck on a problem, chances are you don't understand certain concepts well enough to move on. And that's OK! Move on to other problems and come back maybe a month later. Maybe you'll understand it then. The problems that challenge us the most are often the most valuable-do not cheat yourself out of a valuable learning experience. \n4. Work on your coding style as you do LC. When I first began the grind, I know for a fact that I was typing pure garbage. It was tempting to move on from a problem the moment I saw that my solution was accepted. Remember, LC is merely a means to practice for the technical coding interview. You should revise your code until you would consider itself presentable in an interview. I remember thinking to myself that this was so time consuming, but honestly this saved time as the months flew by, since cleaner code is easier to debug and think about. Being able to write readable & stylistically good code is a skill in itself that should not be ignored.\n5. If you can get a friend to study with you, do it. Having somebody hold you accountable is a proven tactic to work in just about anything. If you can, discuss problems with them too. Being able to talk about problems is a skill that is arguably just as important as being able to come to the optimal solution. I owe so much of my success to the people who have studied and discussed problems with me.\n6. If you are somebody who chokes under pressure, you should consider doing the LeetCode weekly contests. As somebody who does not perform well under intense pressure, I began doing the contests every week to simulate a situation where I need to code under pressure. I believe this was a huge contributor in me being able to perform in a stressful interview setting.\n7. This is a more personal thing, but I cared a lot about my acceptance rate. After I've written a solution to a problem and pass the base cases, I never immediately hit Submit. I always add a few test cases of my own to make sure I've done my due diligence on some obvious edge cases. I think this habit made me very good at spotting things that could go wrong. This proved to be very valuable to me in the interview process because I was able to catch bugs in my code logically and independently.\n\nAgain, these are just rules that I followed. There are a handful of others but this post is just so god damn long already I don't want to go into more depth.\n\n**Closing thoughts:**\n\nI also often get asked what I would do differently if I could do all of this over again. Honestly, I would keep most of it the same. The biggest thing I would change is my levels of physical activity throughout this grind. I wish I went to the gym/outside more, and that I ate healthier throughout the process. I feel so physically sick and unhealthy, but that's the next grind I guess.\n\nIt's crazy to think about, really. If you told me four months ago that I would one day be in this position I would probably tell you not to make mean jokes. I'm still processing it to be completely honest. In a conversation with my parents, they recommended that I reflect on the experiences and what I learned. \n\nI figured that one way I could do this via a Reddit post. Honestly, it would be so cool if just one person gains something from this. I'm a pretty big lurker on Reddit and I'm a noob at making posts, so I'm just going to say some things now that feel like natural ways to end posts. Apologies if the formatting is complete garbage. English isn't my first language (technically true), so please go easy on me.",
    "title": "A journey from one year of unemployment to multiple job offers",
    "subreddit": "cscareerquestions",
    "timestamp": 1624140404,
    "score": 527,
    "keyword": "asian manager"
  },
  {
    "text": "What are my options for taking a breather to figure out what's happening in my life? I work for a tech company that's famous for PIPs and obsessing over metrics. I've been here for 1 year, and I'm actually finding my work very engaging, but there are just some issues I've noticed in this job for the past few months that make me feel like I can't work here anymore.\n\nThis discussion is not intended to be offensive, but I don't really know of a \"good\" way to describe my predicament.\n\nAlthough our site is based in the US, 80% of our employees are on visa from a certain southeast Asian country. Some of my American coworkers who were on track for promotion and exceeding expectations under American-born managment were suddenly let go when management randomly got rearranged recently to be a supermajority of people from said country. They were all terminated  within two weeks of the permutation for \"exceptionally poor performance\", and never were they asked to improve/put on PIP. No one who was from this southeast Asian country was let go, even though I'm aware of a few people who are certainly not pulling their own weight. (for example, there's a girl who's been here two years who's still under the trainee permissions group only)\n\nI'm currently under the last remaining American manager, but I'm receiving hints it's only a matter of time before I get moved to one of the other managers, and it's creating a silent sense of hostility that I'm not welcome here because I'm not \"one of them\". I'm not currently on PIP, but I think I only have about 3-4 months left here. I need some time to decompress, not worry about meeting my metrics, and start applying for new jobs, but I don't know how to do that. If I take PTO for a few days to do so, my metrics will fall. We're told that'll be taken into account in our 1-on-1 meetings if our performance suffers, but I feel like it'll just be turned around on me, saying I should be performing well enough that taking PTO shouldn't cause me to fail to meet my monthly goals.\n\n**Questions**:\n\n* Is my only option to just try the PTO route and hope management doesn't try singling me out for it?\n* With about one YOE, am I likely to be able to get out of here in 3-4 months, or do I need to take something else temporarily in the meantime, and try again later? Would that hurt my prospects to quit ***this*** job, go do something irrelevant for a few months, and apply to relevant jobs again afterwards?",
    "title": "What are my options for taking a breather to figure out what's happening in my life?",
    "subreddit": "cscareerquestions",
    "timestamp": 1620810131,
    "score": 3,
    "keyword": "asian manager"
  },
  {
    "text": "Should I quit my first engineering job? TLDR: first engineering job is toxic and I feel isolated and depressed. Got stuck doing shitty work and not learning. Working with senior dev who drives good engineers away and management has no intention to address it. Should I quit and focus on my mental health and interviewing? Or will that hurt my second job hunt a lot 🤔 \n\nHi all. I’ve been in my first engineering job for about 10 months and I’ve been seriously contemplating quitting for about a month. It started off as a good experience because I had a great senior engineer mentor on my team but once she left I realized that she shielded me from working with the senior developer who everyone dislikes. She left during a reorg where both my supportive manager and coworkers that I like got moved to a different team and I was left working with people who are all doing their own things. The senior developer is the only one I get to work with and his code is bad, the whole team depends on him, and I got stuck doing shit work for months (moving an app to production) so I basically just spend all day trying to get his code to run on my computer and he’s constantly changing it so I have to constantly meet with him. All of the code stuff I’m doing is shitty configuration stuff and it’s never ending. I’m not learning or building and everyday I have to say “still working on the same thing” in scrum. The senior dev is not friendly, very condescending, mansplained the terminal to me, and basically just does what he wants since he’s been here forever. Adding on to all of that, I started my first job during the pandemic and throughout everything that’s been going on with BLM, Stop asian hate, etc. no one on my team talks about what’s going on. Add on to that that I’m the only woman of color on a team of 20 men and I’ve started hating and resenting my job to the point where I have crying breakdowns everyday. I’ve also expressed my frustrations to my manager months ago and asked to get put on a different project but nothing has happened. I hate the company culture and a bunch of people have left my team as well. I’ve given up on pushing for change here and I’ve started job hunting. I’m trying to hold out longer but part of me is wondering if I should just quit and focus on my mental health and interviewing. I have about 3-4 months of savings saved up as well. I’m mostly concerned about losing negotiating power or having to job hunt/explain my situation in interviews. I’m also concerned about not having my first job tenure be a whole year & the idea of potentially not finding a job for months. Any thoughts? I’m trying to hold out but my mental health is worse than it’s ever been. \n\nAdvice would be much appreciated especially from people who have found a second eng job during Covid!",
    "title": "Should I quit my first engineering job?",
    "subreddit": "cscareerquestions",
    "timestamp": 1620355700,
    "score": 1,
    "keyword": "asian manager"
  },
  {
    "text": "About the Excel guidebook… Real talk: I didn’t think this would become a meme, even if it is a small one. It’s funny, guys, but I thought the sub would be long over it by now. Clearly you guys have too much spare time and I’ll be notifying your managers that you have openings on your schedules. \n\n\nStory time:\n\nDuring my undergrad I thought I was hot shit. Sophomore, with A’s in both Accounting Principles and Excel Basics, I thought I must be an accounting prodigy. I’m Asian, and everyone told me Asians were smart, and I legit let it get to my head. So much so that I started applying to companies as an intern. Hadn’t even had Accounting Intermediate yet, and I probably thought it was ok to depreciate land. \n\nOut of 30 or so applications, I got ONE interview. During which I was asked, between 1 and 10, how I would rate my Excel proficiency. My arrogant bitch ass, of course, said 10. Obviously. \n\n“Oh. Ok. You have experience with pivot tables?”\n\n…no. But gimme 10 min with Google and I’ll tell you all you need to know. \n\nThey offered the job to someone else. Of course they would. He said no. So they reached out to their second choice. And then their third. And then, me. I must’ve been the last option. \n\nFirst day, my new boss handed me an Excel book he kept on his desk. He didn’t call me out on my interview bullshit, but it was implied—I was NO 10/10 Excel guru. He went on to teach me a LOT about Excel, finance, etc. He ended up fixing me up with internships at several other departments to float me until I graduated, pulled some strings to get me into a public firm despite poor school grades (I was not the accounting prodigy I thought I was, clearly), and then poached me a few years later to join another company, where I work now. \n\nEvery place I’ve worked at since that internship, I’ve kept the book he gave me. I’ve not actually read it since that first internship, cuz the internet is a thing. But I brought it along because it represented my biggest character flaw—my arrogance. Every time I looked at it I remembered how cocky I was and still am, and I would remind myself I am not as smart as I think I am. Yes, it was sentimental, but not as nerdy as it sounded (I think?). \n\nThe fact that the book was taken struck me as weird because it wasn’t really a book to me. The contents are easily obtainable online, not to mention a little outdated, so why borrow it in the first place? I thought of it the same way you’d think of a coffee mug from your kid, and so the fact it was borrowed and then (accidentally) taken struck me as weird and a bit of an invasion of space. But no, I will not be asking for it back. That sounds like a lot of work, tbh, and my boss (the same boss as before) ordered me a new book to replace it. \n\nSo there it is, guys. You can stop memeing about it and go back to bitching about “unlimited” PTO and the myth of work life balance. Please go back to hating on public so I can feel superior about being industry. \n\nAlso, it was the Excel 2010 Bible. I don’t think there was ever an Excel 2008, except in Mac. The fact that I couldn’t properly remember the correct year is telling lol",
    "title": "About the Excel guidebook…",
    "subreddit": "Accounting",
    "timestamp": 1638639067,
    "score": 422,
    "keyword": "asian manager"
  },
  {
    "text": "Have any minority males here experienced racism/discrimination at work? I know many might not consider this a serious issue, and I do not wish to make light of this issue but I'm in need of help due to a couple of hurtful comments made by my coworker with regards to race.\n\nI'm afraid of getting into the details of the situation here but I\"m facing issues because 1) I'm a male and the system is absent from helping us with whatever mental health problems we have 2) I'm a minority - while the system has gotten better to help minorities in general, I have an ethnic name and I feel that if I make a complaint to HR, I could get fired.  It's very hard for me to find a job with my ethnic name.\n\nI'm just briefly going to say that a female coworker made a couple of comments about a certain race that I visibly resemble that has a negative stereotype in society.  Those comments were negative.  I spoke to the manager about this and she brought us together over a zoom call where the coworker apologized.  That coworker has now been promoted to supervisor.\n\nThere are times where I just cannot focus on my job due to her comments.  I have had thoughts about quitting my job or thoughts about suicide because I didn't feel like my career was progressing.  I'm hurt and I'm depressed, but I try to be as friendly, pleasant and happy as I can be to ensure that the signs of depression are not visibly seen.\n\nI don't know where to go from here without being put on the spotlight to get fired by HR.  I feel alone.  I don't want to blame any race (white, black, brown, Asian).  White people have come a long way to help minorities get adjusted.  Please do not assume that the person who has affected me is white.",
    "title": "Have any minority males here experienced racism/discrimination at work?",
    "subreddit": "Accounting",
    "timestamp": 1615396526,
    "score": 11,
    "keyword": "asian manager"
  },
  {
    "text": "AMA: Small firm -> CPA -> Big 4-> MBA -> Snr Mgr Industry Hi All,\n\nBeen wanting to do this for a while. I frequent this sub a lot on my alt and thought it could be helpful for people. Below is a brief background. Feel free to ask me anything. \n\nStarted off in Canada earning minimum wage out of undergrad (rejected at B4).\n\nPromoted at small firm I was working with doing small business taxes/accounting. Firm paid for US CPA. I invested some money into a new office/ branch in US and managed new location. Left after 1 year because partner was just using me. Earning 36k USD at this point. \n\nMove to mid size firm for 6 months back in Canada. Making 48k USD now. Poached by big 4 pretty quickly. \n\nSpent 1 yr in big 4 as snr analyst doing niche tax work. Earning 64k USD. Great reviews and set to be promoted but I didn't think i was doing any value added work and felt confined to a niche. \n\nI had written my GMAT several years ago and the score was about to expire (700/800). It's a good score so i gave it a shot and applied to European B- schools. Didn't apply US schools cuz visa process is a pain and Canadian schools have very bad ROI. Got into a top school and sunk 110k USD into tuition. \n\nHad a blast at school, great memories. Recruited gaming, big tech, consulting, and random one off companies i thought were interesting. 1 offer each from consulting, big tech, and industry. Chose industry because pay was great, in a location i preferred. Now living in an Asian city, earning 150k USD but the money goes quite far because my expenses are low. Internal reporting role but they hire mba's for leadership pipeline with intent to rotate roles and become general managers. Work life balance is non existent during weekdays but weekends are easier. \n\nAMA!",
    "title": "AMA: Small firm -> CPA -> Big 4-> MBA -> Snr Mgr Industry",
    "subreddit": "Accounting",
    "timestamp": 1616504421,
    "score": 9,
    "keyword": "asian manager"
  },
  {
    "text": "Is this normal? If it is, I don't think this career path is for me. Hi guys! New lurker after starting as a Fresh grad with my first permanent job as a assistant auditor in a small audit firm. The firm consist of accounting and audit department that are basically working in the same workspace.   \n\n\nI was told during the interview process that the work will be strenuous and tiring and to expect lots of overtime to complete a my tasks. This was a given and I already expected it. However, when asking about the working environment they brushed my question aside. In hindsight, I should've known this will happen when they did that but I was new and the pay was above average (2.4k vs our min wage of 1.5k in our country).  \n\n\nMy overall experience here made me question this career path.\n\n&#x200B;\n\nThey knew I was a fresh grad with no experience but they immediately threw a company to begin auditing from the base. I've never felt so stupid and useless before in my life. Had basically no idea what was happening most of the time but could not ask for help anywhere ( My manager actually called me out on my first day and \"softly\" suggested that I should not converse with my co-workers and to go to her directly.) Asking for help directly from my supervising manager wasn't any better either, she would either dismiss me or ask me to think about by myself. \n\n  \nNaturally, I couldn't even decipher what the hell was happening in most excel worksheets but I really tried my best and referred to the past year audit report to try and make sense of all the items I saw. Only to have my ass chewed out in front of the whole company for screwing up such an \"easy\" task when I handed it in for a review. I've never felt so humiliated in my whole life and I was raised by Asian parents that would put me down wherever they could. That was how terrible I felt for the entire week after the incident.  \n\n\nThings only went south from there. I wasn't assigned proper equipment on the first day on job and was provided a laptop with outdated formats all audit fieldwork forms and documents which lead to more ass chewing by my supervisor. I've never received an up-to-date format of the current year audit report for referencing which guess what? Led to more ass chewing. I was not provided the guidance to apply and fill up statutory auditing checklists which lead to you-know-what. And these are just the tip of the iceberg.  \n\n\nTo be fair, I understand I shouldn't be coddled in the workplace and maybe I should've studied harder so I could at least understand the documents I was reading. I'm not perfect and I do make some silly mistakes, but please believe me when I say I was trying my damn hardest and work through whole nights just to make some sense as to what I was doing.  \n\n\nI've only worked here for just shy of a quarter of the year and I've been thinking of crashing my car every time I drive to work (WFH is a thing here too, but I don't have the proper equipment to do it and it would lead to more confusion on my part). I don't think I've learned anything from my job and still feel as useless as ever. I can tolerate the workload and do my best to finish what I can but what gets to me the most is the verbal abuse I've been taking every other day. From being called immature, to inefficient, to even asking if I could use my brain more really takes a toll on my mental health. It got to a point where I would have anxiety on Sundays when I thought of going to work the next day.  \n\n\nIs this supposed to be normal? Or is this just an outlier. I'm planning to hand over my resignation soon due to another workplace politics issue that has singled me out and I seriously question my ability as an accountant/ auditor. I don't want to waste another companies time and manpower by applying and being useless all over again. Thanks for reading about my rant/ question.   \n\n\nBTW: I'm sorry if there's any weird grammar mistakes. English is not my native language.",
    "title": "Is this normal? If it is, I don't think this career path is for me.",
    "subreddit": "Accounting",
    "timestamp": 1627477745,
    "score": 6,
    "keyword": "asian manager"
  },
  {
    "text": "Is this a valid tax planning strategy for a non-american? I found this on a  website from a business consultant. The author is a lawyer from Texas and I want to know if accountants who have experience in this stuff think it's a viable plan.\n\nI am not sure if I can paste the link Here so I copy and pasted directly from the article:\n\n&#x200B;\n\n**A Ve****r****y PRIVATE Model for E-Commerce in the USA!**\n\nPosted on **November 8, 2018**\n\nYesterday, I was talking to a prospective client from Israel who owns and operates an E-Commerce store, and wanted to know how would be the best way to set it up. He does not live in the USA, does not maintain any facilities in the USA, and drop ships everything that is purchased directly from service providers in Asia. He needed a way to accept online payments from customers.\n\nThere are two issues here:\n\n1. How to best obtain merchant account services so that you can easily accept payments using the primary online payment systems: PayPal, Stripe, and Shopify.\n2. How to best reduce taxes without getting into any trouble with your home country’s tax authority.\n\nIn the case of an Israeli there are a lot of problems. There are few countries with a more demanding tax system than Israel. The taxes are high, and the rules are very complicated.\n\nLet us begin with Issue #1 above. In the past I would have suggested that the client simply establish a US LLC that will be treated as a ‘disregarded’ or ‘pass through’ tax entity. What this means is that the IRS does not recognize the existence of the company for tax purposes, but instead looks to the actual owner(s). If you are a non-citizen and a non-resident of the USA this can be very advantageous! In the case of this prospective client such a structure would mean he could set up a bank account in the USA for the US company, and not owe any taxes in the USA since he was not earning any “effectively connected US source income”. Also, in the past it would have been very easy to register such a company with PayPal, Stripe or Shopify.\n\n***PROBLEM: It is no longer easy to setup PayPal, Stripe or Shopify using a ‘disregarded’ US LLC. For more information on this \\[CLICK HERE\\].***\n\nThere is still no taxes due for a ‘disregarded’ LLC, and it is still possible to open a bank account such a company. However, the US now requires the ‘payors’ (PayPal, Stripe or Shopify) to  maintain such complicated records on these type of companies, and has placed such high penalties upon them if they make any mistake that most ‘payors’ have decided to discontinue servicing such ‘disregarded’ LLCs, and instead require that the company be a ‘taxable’ entity that only requires a simple W-9 form that can be filled out and executed online in a matter of minutes.\n\nIf your only interest is in solving Issue #1 then the solution is easy. Establish a company in the USA that will be a ‘taxable’ entity that can quickly and easily fill out an online W-9. I would suggest using an LLC and elect to have the company treated as a ‘taxable association’ rather than a ‘disregarded entity’. Avoid setting up a corporation as that is more complicated to establish, manage, and deal with the taxes. In this way you get all the management benefits of using an LLC while still getting treated like a C Corporation.\n\nHere is where Issue #2 might comes in.\n\nIf an Israeli sets up a foreign company he must pay the same taxes on that company as if it were established in Israel. In the USA the tax rate for a C Corporation (or an LLC treated as a ‘taxable association’) is 21%. Because there is a tax treaty between the USA and Israel the client would pay 21% in taxes to the USA, and an additional 3% in taxes to Israel because the corporate tax rate in Israel is 24%. Other than having to file two tax returns in different countries, I suppose that is not so bad. However, tax laws in Israel are more complicated than that..\n\nLet’s say that the client wants to take a very small salary and reinvest the rest into the company… or perhaps even just let the money sit there. That could get him into trouble. The Israeli government wants you to behave in a manner that results in the maximum amount of possible taxation. So he may be required to pay personal taxes on all the net profits of the company whether or not he takes those profits as a salary or profit distribution. Personal tax rates in Israel are extremely high!\n\nOUCH!\n\nSo is there a solution?\n\nYes. The Israeli government is not going to like this, but there is nothing they can do about. It is legal.\n\nTo help with Issue #2, reducing the taxes for the client, instead of setting up one company that is owned by the client, we instead setup two companies that are NOT owned by the client.\n\nCompany Number 1, from now on the ‘Taxable Company’, will be owned by a someone other than client. It will be this company that operates the E-Commerce Store, and pays any taxes that may be due. Other than ownership it will be just the same as the above company. The client will receive a salary from this company sufficient to satisfy his basic needs. The rest of the revenue of the company will go primarily to two expense items:\n\n* Costs of operations (transaction costs, professional fees, etc.), and\n* Cost of goods or cost of sales (wholesale price of goods to be sold).\n\nCompany Number 2, from now on the ‘Non-Taxable Company’, will be owned by an International Privacy Trust that the client can take over at any time, but does not own now. This company will be acting as a middle man, buying the goods from the Asian service provider and drop shipping them directly to the buyers.\n\nThe Taxable Company receives the payments from the buyers, and pays the Non-Taxable Company the reasonable wholesale price for the goods.\n\n>*Example: Taxable Company sells a widget to Buyer for $100 USD. Taxable Company pays a reasonable wholesale price to the Non-Taxable Company of $70 USD. That will leave $30 USD in the Taxable Company to cover operating expenses and the salary for the client. The actual cost of the item was only $20 USD so the remaining profit of $50 USD in the Non-Taxable Company is tax free. (These numbers may change for different situations — it will depend upon the costs of goods, the margin of profits, and the requirement of the client for a monthly salary.)*  \n***NOTE****: In this case it is very important that the client understand the real costs involved and how much he is going to need as a salary because he does not want to touch the money that accumulates in the Non-Taxable Company until later. I will explain this further on.*\n\nThis system is a little bit more complicated to setup and perhaps to understand, but once in place it will be much easier to run on a day to day basis because there will be only one tax return that needs to be filed for the Taxable Company, not two.\n\nAbove I mentioned how the profits that pile up in the Non-Taxable Company are not touched by the client, at least not until the right time. This is because the client is an Israeli, and again Israel is a much more complicated country than most.\n\nThe treatment of the Taxable Company is simple and easy. The client does not own the company, and as such there is no requirement to deal with the added Israeli tax issues.\n\nThe issue of the Non-Taxable Company is not so clear. It is a grey area. The client does not own the Non-Taxable Company, a trust owns it. The client has an option to take over the trust, and thus the Non-Taxable Company at any time, but until he executes that option it is not his company. He is not taking any of the money from that company. He is not benefiting in any way whatsoever.\n\nYou may ask: ***Why in the World would you want to do that????***\n\n>*REASON: Israel has a policy of granting ‘one time’ Tax Forgiveness for Israelis who have money offshore and then bring the money into Israel. Usually there is a one time tax of 10%, any tax violations are forgiven, and the money is now in Israel free and clear. These Tax Forgiveness programs take place about every 2 to 3 years.*\n\nThat is why the profits that the Non-Taxable Company makes must remain in the Non-Taxable Company… at least until the next Tax Forgiveness program is announced.\n\n>***WARNING****: I believe this system is legal in Israel, but I would not suggest you to go to the Israeli tax authorities and ask them for their opinion. In this case it is much easier (and safer) to ask for forgiveness than for permission. If you ask them, I suspect they are going to decide that what you are doing is illegal, and require you to submit all the funds to Israeli taxation. You might win in Israeli tax court, but it might take years and a lot of legal fees. I would not suggest you do this. Keep it simple: Company Number 1 is not owned by you, is a US company that pays US taxes, and pays you a generous salary. Company Number 2 is a wholesaler that Company Number 1 uses as a middle man. It is really none of your business what they do. Then when there is enough money in Company Number 2, and a Tax Forgiveness program is announced, you then declare the money and pay the 10% tax, and get a blanket forgiveness for whatever happened in the past.*\n\nFor non-Israelis it might be a bit easier to access the funds in the Non-Taxable Company. It will just depend upon the client’s citizenship and residence status.\n\n**REAL LIFE EXAMPLE:**\n\nTaxable Company\n\n* Annual Sales for Taxable Company: $2,000,000 USD\n* Annual Cost of Sales: $1,400,000 USD\n* Annual Corporate Operating Costs: $100,000 – $200,000 USD\n* Annual Salary to Client: $300,000 USD\n* Annual Taxable Income for Taxable Company: $100,000 USD\n* Annual US Corporate Income tax (about): $21,000 USD.\n\nNon-Taxable Company\n\n* Annual Sales for Non-Taxable Company: $1,400,000 USD\n* Annual Cost of Sales: $400,000 USD\n* Annual Corporate Operating Costs (will vary): $25,000 – $50,000 USD\n* Annual Income for Non-Taxable Company: $950,000 USD\n* Annual Income Tax for Non-Taxable Company: $0.00 USD\n\nI suppose you could say that the above $950,000 USD is tax free, but I prefer to think of it as tax deferred. Eventually, you are going to pay taxes on it, but at a time and circumstance that results in less tax not more.",
    "title": "Is this a valid tax planning strategy for a non-american?",
    "subreddit": "Accounting",
    "timestamp": 1617704910,
    "score": 2,
    "keyword": "asian manager"
  },
  {
    "text": "Is business school really worth it? I left Deloitte a little over a year ago to join a Series B tech start-up in the mental health space that's since become a unicorn. I started writing down the things I wish I had known a year, a month, even a week ago. I've previously waxed poetic about [whether or not moving from consulting to start-up is a good play](https://bigrocks.substack.com/p/should-i-leave-consulting-and-join), and [how to go through a methodical 'priority stack' exercise when trying to figure your first \nmove in the consulting afterlife](https://bigrocks.substack.com/p/ive-decided-to-leave-consulting-now). This one in particular, as you may have guessed, covers the age-old question every consultant grapples with at one point or another: should you go to business school? \n\n\\--------------------\n\n21-year-old me had it all figured out. I had an air-tight plan: I’d graduate, do a few years in consulting (doing exclusively strategy work, of course), then go to a top-tier business school where I’d get a deep tan from group trips to exotic locations with 50 of my closest friends, finally get good at beer pong, and figure out what I really wanted to do with my life. In that order. Sounds straightforward enough, right?\n\nWell, dear reader, an undisclosed number of years later, I have no advanced degree, no tan to speak of (actually verging on transparency here as we come up on a year of lock-down), and remain criminally bad at beer pong. But somehow I’ve still managed to pivot to a career path that I very much enjoy and get fulfillment out of. On the other hand, many of my closest friends have gone to or are currently in business school and are loving their experiences. So there’s no real right or wrong answer here—that’s right! It depends—but I’ve included some pointers below to get you thinking about this choice from a few different lenses. The key underlying question is: **is business school the only way to get to where you want to be?**\n\n### Reasons to go to business school:\n\n* **You’re not enjoying consulting but you’re not sure what you’d** ***rather*** **do instead.** This is probably the most common reason I see from folks who are in the pipeline for business school sponsorship from their employers. And it’s not a bad play by any means. Business school—if leveraged correctly—can surely provide the time and space away from the hamster wheel of consulting (going from one project to the next, forever, until you quit or die) to Figure Things Out. Whether it’s really the most efficient way of doing that is up for debate, but you will certainly get a lot of exposure to different careers and a risk-free way to sample the goods (2+ internships) before you buy in. A friend currently at HBS also brought up the point that clubs, simulations, projects, and conferences are all great ways to learn and experiment with how you lead. Granted, you could find ways to accomplish all of this without b-school, but it would require some serious commitment and discipline.\n* **You** ***do*** **know what you want to do next, but it’s too great of a leap from where you are today.** For example, I see a lot of folks from consulting interested in jumping straight over to product. Product, however, can be incredibly competitive to break into—it’s definitely possible but tough to make that transition without going through at least one ‘in-between’ role (e.g., S&O or BizOps-type roles) first. However, there are companies like Amazon who directly hire a number of grads from select b-schools as product managers. So if you’ve done some sort of thought exercise to hone in on a few potential career options you’d like to explore but just don’t see a viable path to getting there (for example: you’re in healthcare consulting but want to go into UX design for a tech company), business school might be worth the investment.\n* **You feel like your network offers you limited reach**. “It’s the people!” everyone says about everything. It’s true though, I can’t think of a more compelling reason to go to business school than 1) ready access to a high-quality professional network with a lot of heavy-hitters; and 2) the “I’m a student” 👉🥺👈 card that you can play to get into pretty much anyone’s DMs.\n* **You’re looking for a specific dual-degree.** I’m talking JD/MBA, MD/MBA, MBA/MPH, etc. One of my friends has a very specific interest in founding or joining a machine-learning/AI health tech start-up, so he’s going back to school to get a masters in computer science (to compliment his BS in engineering) and MBA. If you’ve got conviction in the path you want, and it requires actual technical expertise, it could be worth getting an MBA while you’re at it.\n* **You just need a break.** Let me just say that there should be zero shame in wanting to go to business school because you’re ready for a damn break. Maybe that’s not the most compelling story to tell the admissions committee, but it’s completely valid. If the idea of going from one high-paced job to another sounds like it just might kill you, please take a break. As someone wise once told me (OK, I made it up): you can’t create value for others if you don’t value yourself first. Just know that you can be arguably just as busy in business school—if you so choose—since there’s infinite opportunity to get involved (and over-commit).\n\n### Reasons to not go to business school:\n\n* **You are already in a career path you like.** Note that I say career path, and not job, here. If you’ve done some reflection and think you know where you want to be in 2-3 roles and you’re already on a path to make that happen—ask yourself if it’s worth taking a 2-year time-out from advancing up that ladder. I personally aspire to becoming a GM at a B2C tech company, which means that working as a PM is a sweet spot for me to really get my chops in product-driven growth over the next few years. Through a combination of luck (right time, right place) and *enough* hard work, I did not have to go to business school to get there. So if, say, your medium-term goal is to nab an S&O role at a big tech company or a consumer brand… great news: nine times out of ten, you’d be able to do that without an MBA.\n* **You don’t want to go back to consulting after business school.** If you’re truly, truly over consulting and just can’t fathom spending another two years to get your golden handcuffs off, then don’t. If business school still seems like the right move for you, figure out a way to do it (e.g., financial aid, scholarships, or even finding another company that will sponsor you that you can actually see yourself working at for a couple of years) that doesn’t involve an extra two years of self-loathing. Not worth it!\n* **You feel like you have a diverse-enough network.** The key here is to not equate ‘network’ with ‘people you know.’ No, it’s not who *you* know—it’s who *the people you know* know. Think about how that applies in consulting: we’ve all been the eager new consultant with five networking calls each Friday with different managers or partners. But in the end, it’s much more useful to impress *one* well-connected person than to know five randos. Think about the folks you know both inside and out of consulting. Reflect on whether they are spread out across different industries and functions that are interesting to you. Did *they* go to business school and have colleagues they can connect you to?\n* **You’re not interested in re-entering a competitive, bubble-like environment**. From what I’ve heard, this varies to some degree (pun intended) from b-school to b-school, but make no mistake. Everyone is subtly comparing dick sizes to suss out who’s going to be the most helpful to know in the future. You’re re-entering a job ‘funnel’ where there is a recruitment ‘season’ with palms to grease, campus recruiters, gripping your fake leather portfolio with moist palms as you sit in an interviewing waiting room with three other classmates, the whole shebang.\n* **The ROI simply isn’t there for you**. Different firms handle the actual financial arrangements in different ways, but generally reimbursement for business school is credited to you as a bonus, which is taxable. So it’s not entirely fair to say that sponsorship means that business school is ‘free’, because ain’t nothing free in life, baby. The best way to do the math is to ring up some consultants from your firm who have already completed the end-to-end sponsorship experience and ask them point-blank how much the bottom-line cost of b-school was. I’ll bet you $218K that it wasn’t actually free. The ROI will look different for everyone, and business school doesn’t have to be free to be worth it, but be sure to pressure-test whether the career progression you think you’ll get as a result of an MBA will balance out two years’ of no income.\n* **Your reasons for going all boil down to wanting the credentials on your resume.** I get not wanting to miss out on opportunities simply because you *don’t* have a shiny MBA on hand. I mean, I have an Asian mom, right? How many times have I heard the theoretical scenario: *If you’re equally qualified as the next person, but she has an MBA and you don’t—you’re not going to get the job.* But first of all, there’s rarely going to be an instance where you are ‘equally qualified’ as another person. Even if you both went to the same undergrad and consulting firm, you’ve had different project experiences, extracurriculars/interests, oh and *personalities.* And secondly, I wouldn’t want to invest in a career at a company where a promotion would hinge solely on an MBA or the absence thereof.\n\nAgain, there’s no right or wrong answer here. Business school can be a powerful unblocker to getting to the career you want. Or it can be an unnecessary detour from the path you’re already on. Either way, I hope this post helps you be a little more confident about your decisions.\n\n\\--------------------\n\nB-school grads, what'd I miss? Anything you'd strongly disagree (or agree) with? Next I'll plan to cover questions to ask from every stage of the job search -- from information interview to post-offer, negotiating your compensation -- but would love to hear from you.  If you enjoyed this, why not subscribe [here](https://bigrocks.substack.com/welcome) so the next one lands in your inbox?",
    "title": "Is business school really worth it?",
    "subreddit": "consulting",
    "timestamp": 1613970024,
    "score": 38,
    "keyword": "asian manager"
  },
  {
    "text": "Falsely accused of stealing while at work Hello guys (TLDR at the bottom) . I'm in need of advice! I'm in a very tough situation. On Saturday I was falsely accused of stealing while working. I work at a retail store that sells clothes, makeup accessories etc. I've been working at this specific location for 4 months but worked for this company for 3 years as a whole. While I was working I was called over by one of my managers. She told me Alice  (another manager) and her wanted to have a word with me. I also want to note that Alice seemed very mad at me and I had noticed her watching me during that shift that day. (Both managers are asian) \n\nThey told me to follow them and took me to a private room. I had no idea what they pulled me over for. They both stood there in front of me and Sharon the one that called me over told me to empty out my pockets. I was a bit shocked. I followed as was said and emptied out my pockets. I showed them that my front and back pockets pockets were empty apart from the NYX lipstick I had in my pocket (one I was wearing that day) . They both seemed a bit surprised. They seemed to of expected for me to of stolen a lipstick from their company. (Which btw is literally sold for £1 so why would I bother stealing their low quality makeup? I don't own a single makeup product from the company I work at) . \n\nSharon then said \"Oh! Well Alice said she saw you put something from the makeup department into your pocket while doing the returns (putting clothes/ items back onto the shop floor) . Alice seemed extremely embarrassed I see her turning red. She was very quiet the whole time. I feel like if you have the guts to make such a big accusation you should have the guts to be the one saying it!\n\nSharon then had the audacity to ask me \"Do you know where to put the items when doing returns?\" \"Yes, I put them back onto the shop floor...\" such a dumb question asking as if the n*gga chip inside of me would suddenly activate and cause for me to steal. I've been returning clothes onto the shop floor for months with no issues for months!\n\nWhat really grinded my gears was that Sharon ended things saying \"Well, next time just make sure to not put that in your pocket incase it causes another misunderstanding\" . Basically making it seem like I caused this \"misunderstanding\" and projecting the blame onto me instead admitting THEY were in the wrong. When they falsely accused me! I just ended things saying that I've gotta go to my break.\n\nThis situation has left me feeling so upset and angry. Everytime I as a black person walk into a store I worry about people thinking I'm going to steal. I worry about the most innocent actions I make may be perceived as being suspicious. I worry about potentionally being falsely accused of stealing and that's EXACTLY what happened today. I never thought that I'd have to worry about this at a place I worked at. \n\nI talked to 5 other people and they quickly said racism and felt like race played a part in this accusation. I talked to 4 other black people and 1 Asian guy. I just don't know what to do. I feel saddened especially since I wasn't even given the benefit of the doubt. There is literally nothing about me, my character, my work ethic, the way I dress that would've ever indicated that I was the type of person to steal. Nothing apart from the fact that I'm black. I can't help but wonder what if it was a white coworker doing the same thing? Would anyone's mind quickly jump to stealing? Or would it of just been brushed aside and given the benefit of the doubt.\n\nI know some people will say this has nothing to do with race but black people are constantly being falsely accused of stealing! We're more likely to be falsely accused of stealing something that turned out to be our own belongings. What do you guys think? Do you think race potentionally played a part in influencing this assumption? I know that people have unconscious racial biases/stereotypes ingrained in them that influences how they see black people that they may not be consciously aware of.\n\nI saw Alice on the shop floor afterwards and she has not said a word to me since. Sharon tried to awkwardly sweep things under the rug by doing her job and giving me orders to do as normal. Neither have apologised.\n\nWhat would you do if you were in my position? Would you quit or keep going to work and move on? I already hated this job before this situation happened. They overwork us, always understaffed and the pay is only minimum wage. The only thing that I like about the job are the people I work with. I enjoy talking to them while I'm there. However this situation has left me in tears for days and feeling very uncomfortable.\n\nTLDR; Got accused of stealing at work by 2 Asian female managers at work. Called me me to empty out my pockets only to find out they were wrong and have since not apologised and have attempted to sweep things under the rug by acting normal and projecting the blame onto me.",
    "title": "Falsely accused of stealing while at work",
    "subreddit": "blackladies",
    "timestamp": 1635183096,
    "score": 282,
    "keyword": "asian manager"
  },
  {
    "text": "had racist slurs thrown at me from a member at Planet Fitness after I politely asked them to mask up. management wants to wait till the NEXT offense to terminate them, what can I do to make that happen before the fact? didn't know where to post this, other than here, where others would feel this as intimately as i do.\n\nI POLITELY asked a member in the free weights section at PF to put on their mask. I personally don't like to \"tattle\" and figured I would ask directly, before taking it to management. This is how the conversation went.\n\n* Me: \\*trying to wave him down to get his attention, while he actively tries to ignore me\\* hello, would you mind putting on your mask please?\n* Him: Can you see I'm trying to work out here? I put it on in between sets anyway.\n* Me: yes, I think that's what we're all doing here, and I don't see you putting it on at all.\n* Him: Why don't you mind your own fucking business ? I'm six feet away from you. You don't work here.\n* Me: I asked you politely, sir. Do I seriously need to tell someone that you're not wearing your mask?\n* Him: why don't you stop harassing me, b\\*\\*\\*\\*?\n* Me: wow, seriously? \\*tells management, and when management looks, member is wearing his gaiter across his mouth, and says he's wearing one. Manager says he'll talk to him if he's not wearing one. I walk back to the weights section, because fuck if I'm letting this guy steal my workout.\\*\n* Him: \\*looking at me through the mirror, shaking his head\\* you're fucking pathetic\n* Me: \\*giving two thumbs up\\* well fuck you too\n* Him: why don't you go back to china you fucking ch\\*\\*\\*\n* Me: what the fuck did you say? did you just seriously say that racist shit?\n\nI tell management, who happens to be a really buff POC, who walks over and starts talking to him. I'm shook, and take a bathroom break to collect myself. I don't want to be there for this. I walk back over to the weight area after, and that guy is still there. I tell myself I'm not going to let him bully me out of a place where I have every right to be. I continue my workout in the free weights section.\n\nHe continues glaring at me through the mirror, and across the gym. I used the bathroom again to wash my hands, and I could see he was keeping track of where I was.\n\nOn my way out, I checked to make sure he was in the gym and not waiting for me outside. I was legit scared, given all of the horrible, violent crimes that have been occurring throughout the nation. I stop to ask the manager on my way out about this guy. He looked at me annoyed, since he was in a meeting, and I could hear a video going on in the background of his laptop. He says he's keeping an eye on that guy, and that another offense will cause him to be terminated. ANOTHER OFFENSE. he wasn't even asked TO LEAVE. **what if this were to turn violent the next time?** what if another asian woman has to go through this because of this one guy?\n\nwhy protect him?? he was already breaking the rules. i feel like not wearing a mask constitutes a warning, but racism, aggression, and sexual harassment are grounds for immediate ejection. **if his daughter were afraid when leaving the gym or entering the parking lot, what expectations would he have of that institution?** people like this just need to be held accountable and CANCELLED. i intend on writing an email to the manager to appeal to him, but, after getting the response from PF FB's page, I don't have high hopes.\n\nI briefly described my experience on PF's FB page, on an old thread where they denounce racism, because I found it hypocritical AF. a rep PM'd me and asked me about the situation.. I got this response from their Social Media Team:\n\n>\"Here  at Planet Fitness, we always strive to provide a Judgement Free  atmosphere at all of our PF locations. From what we gathered, it sounds  like the manager has his eye on this member and will continue to assess  the situation moving forward. Please do not hesitate to approach the  manager if you suspect that this member is continuing to make you or  others feel uncomfortable.\"\n\nweakest fucking response ever. I asked them how they'd act if this was their daughter, and their next response was even worse:\n\n>We'd like to send your request to the management team at your local club. Can you please provide the following information:  1. Name on your Membership Agreement 2. Home Club Location  3. Contact Information (Phone and/or Email)   Thank you!\n\nrouting my messages to a manager I just talked to in person is not helpful AT ALL.\n\nSo my question to you guys is- **how do I get this member terminated? How the hell do I get justice? Do I just walk away, because I wouldn't feel safe there anyway?** I'm so emotionally drained from all this, and as the victim here, *I wanted to believe that I had allies who would CANCEL this type of behavior,* especially in this political climate. Right now, I feel like I just have to sit down and take it. I joined the gym despite COVID risks, due to my emotional health. I've gone through so many life changes in such a short amount of time, I needed sanctuary. I know this manager probably just sees a young, asian woman with little to no voice. I also understand that just because he's a POC, doesn't mean he empathized with me. I don't know what to do, I feel helpless and ANGRY. I know asian hate has been really prevalent across the US, but I had higher hopes for California.\n\nThank you for listening.",
    "title": "had racist slurs thrown at me from a member at Planet Fitness after I politely asked them to mask up. management wants to wait till the NEXT offense to terminate them, what can I do to make that happen before the fact?",
    "subreddit": "asianamerican",
    "timestamp": 1617764226,
    "score": 497,
    "keyword": "asian manager"
  },
  {
    "text": "Gah that American \"math\" team post on the front page really bothered me. I get it, it's a casual joke. Asians tend to dominate math competitions. But more importantly, the sense that even though you're winning a competition for America and are American through and through, you're still a foreigner in your own country.\n\nIt used to drive me insane when people asked me \"where are you really from\". I'd want to reply well started in Alabama, moved to Chicago when I was still young before school, and now I work in New York. I would carry my passports out in airports like a badge of honor so people would know I'm \"american\". \n\nAnd it took me decades to unfurl the toxic defense mechanisms I spent my life throwing up. Growing up, I vehemently rejected Asian culture. I hated my name so I changed it legally. I beat the shit out of my body playing lacrosse at a high level because it was the whitest sport (all conference and even then I was known in the conference as the \"asian kid\" or the \"chinky boy with skills\"). I attended a fucking US military academy for a year instead of a top 5 school initially because I wanted to show the world how American I was. \n\nIt took me until 25 and working in Asia on projects for half the year to finally get it. To finally be in a place where the assumption isn't I'm a math guru or code monkey. Where my managing directors don't assume I'm a work horse and nothing more. Where instead of preparing the deck for sales meetings, I got to actual drive the meetings and lead. But more importantly, as I matured, I understood so much more about myself and why I am the way I am.\n\nI never realized how much growing up in the midwest as one of the only Asians in my school would impact my sense of self. My obsession with fitting in and being \"american\" led me to completely reject so much of what makes me well, me. \n\nThis current movement of Asians standing up for themselves and doing it together makes me so fucking proud. I now realize my history and culture isn't just that of China but it's about the workers brought here to build the railroads. The asian communities that popped up early on that suffered untold racism and abuse. The Chinese exclusion act and the Japanese internment camps are some of the most atrocious decisions by my country. But I'm so fucking proud to be part of that history. To know that the strength to endure untold hardship and sacrifice for the future generations flows through me and is part of my history and culture means everything. So thank you to all the activists and people stronger than me who push the narrative. You guys have made me so proud to be Asian American and my children will love and embrace their culture and heritage in a way I never allowed myself to. So thank you.",
    "title": "Gah that American \"math\" team post on the front page really bothered me.",
    "subreddit": "asianamerican",
    "timestamp": 1621955598,
    "score": 114,
    "keyword": "asian manager"
  },
  {
    "text": "Do you think the bamboo ceiling still exists? [https://hbr.org/2018/05/asian-americans-are-the-least-likely-group-in-the-u-s-to-be-promoted-to-management](https://hbr.org/2018/05/asian-americans-are-the-least-likely-group-in-the-u-s-to-be-promoted-to-management)\n\n&#x200B;\n\nAccording to the above article, Asian Americans are the least likely group in the US to be promoted to management. I've asked this in a Korean-American community(more than 99% of them are 1st generation immigrants who were born and raised in Korea) and they said this is not because of racism but because 1) Asian Americans prefer remaining as an engineer rather than becoming a manager 2) 1st generation immigrants tend to lack the adequate English and communication skills to climb the corporate ladder. If they try harder to assimilate by hosting parties at their houses and watch American footballs, hockey, and basketballs(instead of soccer) and go out hunting with his or her colleagues, they will not be discriminated against at all. Also, he mentioned that Asian Americans born and raised in America do not face any institutional discrimination other than affirmative action because they understand American culture and are good with English.\n\n&#x200B;\n\nDo you agree with these opinions? It's kind of interesting because Asian Americans born and raised in the States generally agree that there are some kinds of bamboo ceilings but 1st generation Asian Americans tend to argue that there is no racism in the States and the Asian Americans who face racism are either 1) lack the adequate manner 2) not fluent in English 3) very unlucky or 4) should blame their lack of adequate skills rather than racism.\n\n&#x200B;\n\nDo you think the bamboo ceiling still exists?",
    "title": "Do you think the bamboo ceiling still exists?",
    "subreddit": "asianamerican",
    "timestamp": 1632590215,
    "score": 80,
    "keyword": "asian manager"
  },
  {
    "text": "What Was Your Favorite Childhood Food? Given the large number of negative posts (which is thoroughly understandable given the rise of anti-Asian rhetoric and violence going on in this country), I thought I would try to post something positive.\n\nI'm a 3rd generation ABC (American born Chinese). Although most of my relatives are doctors and attorneys, I became a teacher. I started out as an elementary teacher but after 17 years I burned out and went to culinary school. My father said I was having a mid-life crisis. After graduating and working in the food service industry for a few years, I returned to education as the chef instructor of a high school Culinary Arts program. I have now been teaching Culinary Arts for fourteen years.\n\nAlthough I grew up eating typical American breakfast foods i.e. bacon and eggs, pancakes, French toast, waffles, cereal, and oatmeal; one of my favorite food memories growing up was of my grandmother's sticky rice which we would often have for breakfast whenever we visited my paternal grandparents. Grandmother would steam glutinous rice and mix it with fried onions, crumbled hard boiled eggs, chopped Chinese sausages and other ingredients prior to wrapping it in banana leaves and steaming them.\n\n&#x200B;\n\nhttps://preview.redd.it/om2oe3qj50o61.jpg?width=610&format=pjpg&auto=webp&s=86149a4e55c2e3627c03028b5edfb5254b78dcb7\n\nSince grandmother had very conservative views of gender roles, I wasn't allowed in the kitchen to watch her make these because boys had no place in the kitchen (according to her worldview). Since my sister and my female cousins had no interest in cooking, I'm sorry to say that grandmother's recipe was lost when she passed on.\n\nAlthough I have done my best to replicate her recipe, I've never quite managed to get the taste right.\n\nWhat I have managed to get right is the production of chicken congee, though my family typically called this \"jook\". It'd be hard to mess up a jook since it's nothing more than rice boiled to pieces in what is usually a flavorful broth.\n\n&#x200B;\n\nhttps://preview.redd.it/a06p6sap70o61.jpg?width=258&format=pjpg&auto=webp&s=e149b6db2b1029e48744a9ad0c8a81d1ee0fc1cd\n\nMy father preferred a plain jook with a garnish of green onions. In contrast, my grandmother always had a wide variety of toppings to add. These toppings included pork floss (yuk sung), fried dough, and all sorts of vegetables. I personally liked cracking a raw egg into the bowl and pouring the hot jook over the egg. The heat from the soup would soft cook the egg and the first spoonful would typically break the yolk. When drizzled with some light soy sauce and a touch of sesame seed oil, I thought this dish was heavenly.\n\nWhat are your favorite childhood food memories?",
    "title": "What Was Your Favorite Childhood Food?",
    "subreddit": "asianamerican",
    "timestamp": 1616168495,
    "score": 16,
    "keyword": "asian manager"
  },
  {
    "text": "Los Angeles Dodgers manager Dave Roberts speaks out on rise of violence against Asian Americans",
    "title": "Los Angeles Dodgers manager Dave Roberts speaks out on rise of violence against Asian Americans",
    "subreddit": "asianamerican",
    "timestamp": 1615227818,
    "score": 13,
    "keyword": "asian manager"
  },
  {
    "text": "#WeArePeopleToo: A Proposal for a New Movement Hi everyone, this is my first post ever on Reddit despite being an avid Redditor. I apologize if I lack any specific Reddit-based decorum when it comes to making a post. I will definitely get better with time!\n\nMy name is Dae and I'm an NYC public school educator in my late 20s. I am a mixed race male and would like to share my story as well as establish my thoughts on a movement to better represent us as mixed-raced humans of the world.\n\n**My Story**\n\nI was born to a Trinidadian mother and a Korean father. As a result of their marriage, my father's side of the family became estranged and cut ties with us. As a result, I have only managed to forge a relationship with the Trinidadian side of my family. I grew up in a fairly Republican/Conservative area of NYC (Staten Island) in which white people were the majority.\n\nMy parents loved me but they had no idea how to deal with raising a multiracial son. They were stern and strict and did not believe in a coddling love. They did, however, believe in the merits of education and made sure that I knew to bring the best grades home. In school, other students stayed away from me. They were polite as young children but they often ostracized me and left me out of activities. At the time I didn't know it was because of how I looked but with time I began to see the relationship. I learned the power of being a fool, of being self-depreciating. As people laughed at me, I saw it as their acceptance. What I had actually done was prime them to note my difference, my mixed-race status, as being something comical, something to decry, deride, and deplore.\n\nI became the class clown and stood to make problems for the sake of other's entertainment. Teachers began to hate me and associate me as a problem child. They suggested mental and learning disabilities despite my high grades due to my parents and their iron fist approach to education. With every letter home, phone call, parent-teacher conference, I would receive a beating from my parents. Slaps in the face, beatings with belts, name calling, screaming in a child's face, bruises on my body. All done for the sake of being accepted by my peers. All for the sake of being loved by someone. I learned that people who love you are allowed to do whatever they want to your body so I let others do what they wanted to me. Friends treated me like a punching bag. At the age of 8 my 13 year-old babysitter blackmailed me into allowing her to rape me. I said nothing, scared more at the idea that I would be in trouble if people knew I had sex because I knew enough to know sex was wrong.\n\nBy the time I was 12 in middle school, I had tried to hurt myself for the first time. I was taken to the guidance counselor because I had told a friend who, doing the right thing, told an adult. In the process, I was treated like I was crazy. I was threatened to be committed because I was a danger to myself. All of this made me feel *different* and I already knew *different* was bad. I knew because of how I felt when people told me I was different. \"What are you?\" \"Who is black?\" \"How did that happen?\" \"Are you \\_\\_\\_\\_\\_\\_\\_\\_?\" The looks of confusion. Even worse was the looks of incredulity, like the fact that I existed couldn't be real. People, regardless of their own race, made me feel so ugly. Ugly because I was different, unique, and beautiful because of my uniqueness.\n\nI knew my parents' union was odd because people told me that. But I didn't know the history of miscegenation in America. I did not know that it was once a crime to be us or to engage in a union that results in the creation of one of us. What I did experience, however, was fetishization as I grew up and became sexually active again. I had a hard time finding someone who thought we had enough of a connection to date one another. When I did, I immediately agreed to date them, I was thirsty for love and affection. But this love was ugly too because it was different. This was even present in friendships. I had friends who told me they would only date black girls because they were black and wanted to have black babies. I had friends who told me I was smart because I was Asian and knew some rap and had rhythm because my mom was Black.\n\nMy girlfriends never, ever brought me home. I was a secret, forever to be hidden. I grew attached to a concept that white girls were the most beautiful. This was partially because of where I grew up but also out of jealousy. White people had such an ownership of their heritage. They knew what they were and forged relationships based on those identities. I wanted so badly to be white. I told my mother that I liked white girls and that in my next life I'd like to be white because they rule the world. My hatred of my blackness stemmed from the fact that society deemed black inferior which led me to believe that my blackness was probably why my interactions with society were so awful. If only I were fully Asian or White and had no blackness to me. I didn't realize it was just because I was mixed. The one girlfriend who took me home only told her family I was Asian. During the death of Eric Garner on Staten Island as racial tensions spilled out onto the streets, I visited her family and had to grimace as they joked about, \"Hands Up, Don't Shoot\". She said nothing. She did nothing. I didn't expect her to.\n\nMy life spiraled out of control as I got older and race became more important as a qualifier in making connections with people. I fell in deep love with a girl from a family who practiced the Islamic faith. She had difficulties accepting her role in the religion and found solace in me, a person with no ties to any culture because my culture was so shattered by my being multiracial. She would often tell me how \"cool\" it was that I was Black and Asian. How \"attractive\" it was. I didn't know what she was doing was fetishizing me, I was desperate to believe she loved me. After a few years, the relationship fell apart and, again, it was because I was different. This time, however, I knew it was because of my race. I never hated myself so much in my life. I cursed myself and my family, I wished I could be one thing.\n\nI drank a lot after the breakup. I wanted to die. I woke up face down in the gutter one night after binge-drinking. I tried to slice my wrists in my backyard, then I tried to fall on the knife. I tried to jump off the overpass by my house into traffic. I wanted my death to be certain. I gained so much weight my heartbeat became erratic. I was smoking a pack a day and developed a wheeze. I hated myself, I needed to punish myself. I fought my father, I ran away from home and became homeless. I hurt and hurt and hurt because love seemed impossible because acceptance was impossible.\n\nI became a teacher. First in Bed-Stuy, Brooklyn where my students, forever ready to curse me out and let me know when I wasn't being \"fair\", accepted me. Almost instantly. They asked what I was, were relieved when they heard \"Black\" because they knew we shared something common, and then made me one of their own. They joked with me, told me gossip, shared their fears, shared their dreams and their emotions. They asked me to share my stories and for the first time, **ever**, someone wanted to truly know me. Now I teach in the South Bronx where my students have yet to ask me what I am. Because it does not matter to them.\n\nI began a journey to heal. I lost weight though exercise, something I was so hesitant to do because I hated myself and wanted to die. I took a road trip from NY to Georgia, across to New Orleans, Louisiana then to Texas, then Cali. I got to see the Pacific Ocean and looked across to imagine my father's country. We drove back and I was refreshed with a new look on life. I educated myself on race relations in America as BLM became a massive presence following the death of George Floyd and learned to love my blackness. I attended my first protest on Staten Island with BLM and learned the importance of being outspoken. I learned to love myself and I learned how to share that love with others. I challenged my perceptions of education and decided to dedicate my life towards bringing a sense of ownership when it comes to science for BIPOC students. By providing students with a more hands-on experience, they learn that science is a gift for all humanity in the form of a community, one that it is honorable to be a part of. I have since been selected to work on a committee that brings more diversity toward l\n\n**The Movement**\n\nThrough my research, I have become extremely disillusioned with the lack of support provided to people of mixed race. I grew up with no one to turn to, no one to help me unpack the burden of being an oddity to society. I left social media, angry, vowing to never use it again because I didn't want to interact with a society that could not accept me. I likened it to being desperate, to chasing the desire to belong to something that has no desire to accept me.\n\nI fell upon Beverly Daniel Tatum's national bestseller, \"Why Are All The Black Kids Sitting Together In The Cafeteria?\" and noted that it was revised and updated. I had never had interest in reading this book before, despite it being mentioned in conversations with friends, teachers, etc. I did not belong to the black culture and so social issues of segregation were particularly damning to me. How could I sympathize with a culture that told me I wasn't black or black enough? At least they had one another in their culture to lean on. I had no one, I felt. In the revised edition, Dr. Tatum places attention to the role that Multiracial families bring to a discussion of race relations in America. Yet, in one fell swoop, she manages to disenfranchise me and other mixed-raced people, \"Given the unique historical and contemporary context, it is the biracial identity development of children of Black and White parents that I will focus on here.\" (Tatum, 304) I was not even enough to garner attention by a champion of Civil Rights and Equality in a book that was groundbreaking in its ability to unpack race relations in my country. I began to wonder how many other mixed-race people felt this way.\n\nI realized that we are under-represented and our lack of support allows us to be targets for confusion. It is this confusion to what we are, to how people treat us, that results in self-hatred, self-depreciation, self-loathing, and self-harm. And we cannot wait for others to be our voice because we are in need. As more attention is being placed towards identifying racism throughout the world, we need to be vocal, we need to stand to let people know: WE ARE THE DISENFRANCHISED TOO. WE ARE PEOPLE TOO.\n\nAnd that has been the movement I've been slowly pushing over social media. I want it to take off. I want us to unify and represent a community that has lacked a true community for so long. #wearepeopletoo\n\nAs people, we deserve to be treated like others. This means we deserve the freedom to be equals in society. We deserve to walk down the street or to make a new friendship without being asked for our race or ethnicity because #wearepeopletoo. We deserve to love and be loved not fetishized because #wearepeopletoo. We deserve to feel like we belong in our families, in our schools, in our government, in our country because #wearepeopletoo.\n\nRight now, the movement is just a hashtag. But even the largest movements begin somewhere. I will not pretend to know what I am doing. I will not pretend to be a leader or to stand as someone to look up to. I believe that this movement needs to be decentralized. No single leader, just a group of people, human beings, who see the need for a change. Right now I am using IG to push the hashtag but I want to begin moving to other platforms, putting out writing, establishing a website. I hoped we could establish [r/mixedrace](https://www.reddit.com/r/mixedrace) as a basis for a headquarters or begin to discuss a place to brainstorm. I stand with all people of the world and I want them to begin to see us as people too. #wearepeopletoo I know I need help, I need teammates and a community to support and be supported by. Even now as I tell people my idea for this movement they tell me I am being divisive, that I am causing more division in the world. But this was division that was forced on me, not one that I created. My goal is to end this division. I share that belief, that one they call utopic, that the world will be better when we see ourselves as one race: the human race.\n\nThank you for hearing me out,\n\nDae",
    "title": "#WeArePeopleToo: A Proposal for a New Movement",
    "subreddit": "asianamerican",
    "timestamp": 1614137067,
    "score": 12,
    "keyword": "asian manager"
  },
  {
    "text": "The terrible pronunciation of Asian languages on TV. Have anyone noticed how bad actors on TV pronounce Asian languages when they are suppose to be playing a character who's a fluent speaker?\n\n\nWith the amount of Asian immigrants in America, if casting managers actually made an effort, they could've found someone who can speak the language. Sometimes these actors only speak one or two liners, couldn't they at least find someone to teach the actors better pronunciation? \n\nI don't know how it is with other foreign languages, but as a Chinese Canadian I often have trouble understanding the Chinese they are trying to speak. I grew up with Asian Canadians, and while their pronunciation of the Asian language can't be compared to native speakers, they can at least be understood. Even my Caucasian friends can pronounce better Chinese when they are ordering dimsum than the actors on TV. It just irks me because it really doesn't take that much effort to find someone who can speak fluently or teach them to speak better. But I guess Asian representation was never important in mainstream media.",
    "title": "The terrible pronunciation of Asian languages on TV.",
    "subreddit": "asianamerican",
    "timestamp": 1616086914,
    "score": 7,
    "keyword": "asian manager"
  },
  {
    "text": "American Indian Music Artist? I just realized I don't know any American Indian music artists and when I google it I just get Native American music. I'm manage my uni's Asian American Association and wanted to get an Asian American playlist, but all the artists on the spotify playlists are all of east asian descent. \n\nI'm of HK lineage but it's always pissed me off when people would tell my Indian friends they're not Asian American. It's obvious that my American Indians feel excluded and I want to change that.",
    "title": "American Indian Music Artist?",
    "subreddit": "asianamerican",
    "timestamp": 1630443902,
    "score": 8,
    "keyword": "asian manager"
  },
  {
    "text": "My Pot Sticker Candle By day I teach Culinary Arts but by night, I produce candles and specialize in making candles that look and smell like real food. Here is my first potsticker candle. It's scented with bacon, beef, ginger, garlic, and a touch of cilantro.\n\n&#x200B;\n\nhttps://preview.redd.it/p9myod80w0t61.jpg?width=807&format=pjpg&auto=webp&s=e6ba1190aba0a4208dc12aa8cdfedf14dfe5d9aa\n\nTo make this candle more visually interesting, I added wax bok choy and baby corn. I also \"garnished\" it with simulated chopped parsley.\n\n&#x200B;\n\nhttps://preview.redd.it/vpsvyoq5w0t61.jpg?width=3024&format=pjpg&auto=webp&s=642a26f86f1532236155a8a42d9eb50afd69484e\n\nI thought about making a chicken foot candle but ultimately decided that non-Asians would find the image of a swollen inverted chicken foot to be offsetting. \n\nI don't currently sell any of my candles. I make these candles as a hobby and sometimes give them away to friends. Here are some other candles that I have made.\n\nThis is a hotdog candle.\n\n&#x200B;\n\nhttps://preview.redd.it/vogzd5zcw0t61.jpg?width=605&format=pjpg&auto=webp&s=b166028c2aa9fc70efb15808938c5fd7c4a44298\n\nThis is a burger and fries candle.\n\n&#x200B;\n\n[This candle was designed for placement in a glass votive. Picture below is a test burn.](https://preview.redd.it/xqg9799iw0t61.jpg?width=1210&format=pjpg&auto=webp&s=9fbb0a6189ae01e611c9dd062681830ed0e6ffa1)\n\n&#x200B;\n\nhttps://preview.redd.it/88qso5olw0t61.jpg?width=242&format=pjpg&auto=webp&s=c5d8eb4ff1322574f52e5d1f0a5d6b0e7ef2cce9\n\nHere is a berry tart candle.\n\n&#x200B;\n\nhttps://preview.redd.it/n4inc6tvw0t61.jpg?width=4032&format=pjpg&auto=webp&s=3f59b066f0f5fb29e3e790368c35d6ed68b182c6\n\nIn terms of what I plan to do with all of these candles, I'm going to approach the manager of a local casino resort towards the end of this summer to see about the possibility of selling my candles through a hotel gift shop.",
    "title": "My Pot Sticker Candle",
    "subreddit": "asianamerican",
    "timestamp": 1618355803,
    "score": 6,
    "keyword": "asian manager"
  },
  {
    "text": "Discrimination against Indian men in Western countris Hey Redditors,\n\nI am not Indian myself, however some friends of mine and aquaintances have described that they feel that the women have been specifically targetting them due to large amount of media surrounding rape allegations in India which is reported in the media.\n\nThey explained that there are issues in India in low educated areas, however this is a small proportion of the country concentrated in the south indian regions. India is obviously a vast country with many races. These areas do not at all represented the major cities and other developed educated areas. This being said the media will tend to publish as though it is widespread in India aswell exaggerating the actual incidents prior to any convictions causing stereotyping of Indian men.\n\nThey have been experiencing that white women (not Asians) in Australia tend to discriminate against them in their work places with one describing a situation where even their strata manager had not attended to a complaint they made within the building that they rent appropriately.\n\nTo the Indian men out there, is this something you have personally experienced?",
    "title": "Discrimination against Indian men in Western countris",
    "subreddit": "MensRights",
    "timestamp": 1637129634,
    "score": 35,
    "keyword": "asian manager"
  }
]