[
  {
    "text": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me So I started a new job. I'm a teacher (technically curriculum director but just a fancy title for writing repots while teaching) . My second day my supervisor held a meeting to yell at us all for not replying to his text message. I just sat there to gauge how everyone reacts. No one said anything. I have been here now 2 months and he is not a nice person.\n\nThings he doesn't like or respect: women, Asian people, African people, or his own wife (he jokingly called her an uneducated hillbilly)\n\nHe told me yesterday he paid for my time so he can text me whenever he feels like it after I told him to not text me at home about work stuff. He cannot fire me as he needs to provide proof to HR that I did something illegal or neglected my work as I am under contract for the next year and a half. \n\nI do not like him and just want to annoy him so much that he avoids me like the plague cause I am not quitting this job because I like everything about it but him. Also forgot to mention, principal is on autopilot, so going to her is no good. Any good ideas?",
    "title": "Advice: Deal with Verbally Abusive Supervisor who Can't Fire Me",
    "subreddit": "jobs",
    "timestamp": 1614441321,
    "score": 3,
    "keyword": "asian principal"
  },
  {
    "text": "Waiting for decision for a job I really want (+2 days and counting) I was terminated last December from a hedge fund due to a very toxic fallout (the person doing the firing couldn't look me in the eyes). And I spent about a month and a half after that trying to heal from the situation. I was burnt out going into the job search, and only applied to 2 companies that I was sure would not be toxic (I am in tech so there are always jobs available and almost every well-known place there is reputation of a bro culture). One of them turned out to be a dream job. I never knew I would be excited to work again. Anyways, final round went smoothly, or so I thought, and the recruiter said they'd reach a decision sometime a week later. It's now been 8 days and a follow-up email later, and I still haven't heard back anything. I restarted the application process, now armed with the optimism that maybe I can find a job that I love in an environment that doesn't belittle or despise me. It was hard coming to terms with a job that felt so right was not meant to be yesterday, but I suppose that is a part of life.\n\nEdit (Context): I am an Asian female in STEM. As the only woman on all teams I've been in, it feels like I've been fighting to belong my whole life. Yesterday I watched a tiktok video of a black woman receiving feedback about being perceived as aggressive and threatening despite sitting at a meeting quietly and saying nothing while a white guy jumped up and down and cursed at the same meeting and received no feedback. My problems are probably not as egregious, but I am struggling with the same question: how do you act on feedback that is about what you are instead of what  you did? My mother tells me that it is okay and just do my best. But today when I talked to recruiters that don't see any limits for me and were talking about aiming for directors and principals, I just feel like crying ||\\_\\_\\_\\_||.",
    "title": "Waiting for decision for a job I really want (+2 days and counting)",
    "subreddit": "jobs",
    "timestamp": 1613688212,
    "score": 1,
    "keyword": "asian principal"
  },
  {
    "text": "My students are far more attuned to issues of race than my admin Yesterday my principal emailed all staff about the murders in Georgia and repeated the police line that \"motives are unclear\" which absurdity aside just wasn't necessary. I'm one of the only Asian teachers but haven't heard a peep from admin besides that mass email and a text reminding me to schedule conferences.\n\nToday in breakout rooms a student one on one brought it up and told me to take care of myself and to be okay with taking time off and not invalidate my own feelings. Jaw-droppingly insightful and kind.\n\nAnyway just had to say that somewhere to get it off my chest that our admin is so inadequate my students are more thoughtful in recognizing what I might be going through and are more thoughtful in what they have to say about world events.",
    "title": "My students are far more attuned to issues of race than my admin",
    "subreddit": "Teachers",
    "timestamp": 1616092635,
    "score": 1620,
    "keyword": "asian principal"
  },
  {
    "text": "Angry Parent is Threatening Me I have a student named Derek (not his real name). Derek is not one of my favorite students, though I would certainly never indicate any of the kind to him or to any of my students.\n\nHe's something of a tattle tell and a trouble maker. During pre-Covid times, he would poke another student with a pencil. The student would ask him to stop. After he continued poking the other student, his pencil would be snatched away, snapped in half, and dropped on the floor.\n\n\"TEACHER! TEACHER!\" Derek would shout (even though he knows my name along with the fact that most of my students call me \"chef\" because I'm the chef instructor of a Culinary Arts program).\n\n\"\\_\\_\\_\\_\\_ stole my pencil and broke it!\"\n\n\"Were you poking him with it?\"\n\nDerek would study his feet. \"I dunno. Maybe.\"\n\n\"Did he ask you to stop?\"\n\n\"I don't remember.\"\n\n\"Did you poke him again after he asked you to stop?\"\n\n\"HE BROKE MY PENCIL!\"\n\nAfter telling the other student not to take pencils away from Derek or to snap them in half, I returned to my instruction. Derek had other plans. At home he tattled on me to his mother by offering a one sided perspective. \"And I wasn't doing ANYTHING and a bully took my pencil away and broke it. I told teacher and he didn't do ANYTHING.\"\n\nIncensed over how I had allowed her precious high school freshman to be \"bullied,\" Mama Bear would start to metaphorically poking me.\n\n\"WHY ARE YOU ALLOWING MY SON TO BE BULLIED?\" she would demand via email. \"RESPOND AT ONCE!\"\n\nI typically do not reply \"at once.\" I usually wait for 24 hours. Since I've had lots of prior experiences with this kid (who was also with me as an 8th grader), I knew that it didn't matter what I said because the truth doesn't matter. This parent was prepared to believe anything her son had to say. She was equally prepared to believe that anything I had to say was a lie.\n\nShe's played this game with other teachers. With other teachers she's also played the race card. \"YOU HATE MY CHILD BECAUSE HE'S BLACK!\" The other teachers have all been white.\n\nShe has NOT played this game with me because I'm not white. I'm Asian. I'm even more of a minority than this parent is.\n\nThis hasn't stopped her from relentlessly badgering me.\n\n\"MY SON CLAIMS HE TURNED AN ASSIGNMENT IN BUT HIS GRADE SAYS THAT IT'S MISSING. EXPLAIN!\"\n\nI checked and found that although I had graded an assignment on Canvas (our instructional platform), for reasons unknown, this grade wasn't carried over to our electronic gradebook (Infinite Campus). I sent Derek's mother a thank you note for having brought this to my attention. I explained that Canvas had not transferred these grades to Infinite Campus. I told her that I had reported this to IT and had updated Derek's grades.\n\n\"WHY DOES HE ONLY HAVE A 71?\"\n\nI explained that his low GPA came from the fact that he had only earned a 70 on a unit test. Since the district has required us to weight all tests at 90% of a student's GPA, all test grades are really important.\n\n\"WHY HAS HIS GRADE FLUCTUATED?\"\n\nI have no idea what she meant by this question. Grade point averages change as new grades are added. This is basic math. Instead of saying this to her, I told her firmly but politely that I had addressed her concern about a missing grade and thanked her again for bringing this matter to my attention.\n\nShe's now threatening to complain about me to the district office because I'm rude and I'm allegedly not answering her questions.\n\nI am not worried. She shot her credibility with the district many years ago after she tried to convince the assistant superintendent that our principal, the assistant principal, and all of Derek's teachers \"hate\" her son because he's black.\n\nThis woman has reportedly been screaming at teachers and building administrators ever since her son was enrolled in kindergarten. She will doubtlessly continue to complain so long as Derek remains enrolled in our school.\n\nLucky us.\n\n(sigh)",
    "title": "Angry Parent is Threatening Me",
    "subreddit": "Teachers",
    "timestamp": 1618881513,
    "score": 28,
    "keyword": "asian principal"
  },
  {
    "text": "Is it worth it? Dual Immersion. Looking for advice and encouragement. I'm working as a Korean Dual Immersion teacher. 2nd year as a teacher, 2nd year in the program. \n\nOur district is fairly new and I am one of the 4 teachers who are pioneering the program. I am the only person in my grade level. \n\nWe teach in a self contained classroom, so I have freedom in my classroom when it comes to the time and length I want to teach the language. \n\nI've been told by two teachers who teach a different language to not stay in this school. Admin expects so much from us dual immersion teachers, because we are in need of promoting the program. \n\nI feel that we can't eliminate the fact that culture has an influence in our work culture. I feel that asian teachers don't really say no and do what must be done to promote the program and culture. \n\nAll this is great, but I feel that I signed up for too much. \n\nLast year, I've had to use my weekends and many instructional minutes for my students' traditional dance performances. \n\nI'm now sitting here, having to work on editing a video with my partner and adding more to it a week before showcase. My principal told us last minute that we will be hosting an event that invites parents and students. \n\nMy last complaint is that we don't have a solid curriculum. We use a curriculum that our principal and some teachers believe in. However, it is not at all helpful for my classroom. I spend many hours looking up resources that aren't really available here in the States. Some days, I feel it's getting better, but some days I wonder if it's even worth it. \n\nI've really battled internally and I know I'm very thankful for my position. There are many pros to this specific position. However, the cons definitely creep up and slaps me in the face at times. \n\nBeing a dual immersion teacher gives me more stability. Should I stay or should I venture out? With this day and age with our pandemic, I'm just wondering if I should just accept the reality and suck it up. I had friends who have looked for 30 plus jobs and are still substituting. \n\n&#x200B;\n\nI'm really sorry for the long post. I hesitated writing about this here. I appreciate any advice or encouragement from you all. \n\n&#x200B;\n\nHappy Sunday and I hope you all have a victorious week.",
    "title": "Is it worth it? Dual Immersion. Looking for advice and encouragement.",
    "subreddit": "Teachers",
    "timestamp": 1612151211,
    "score": 2,
    "keyword": "asian principal"
  },
  {
    "text": "School PTA Member and a school Board Candidate Opposes Raising Asian Cultural Awareness In Bellevue, WA. School board candidate Gregg Smith calls cultural awareness a form of Critical Race Theory (CRT). Threatens legal action, and tries to get educator fired. He targeted:\n\nJing Mei Elementary. Smith calls cultural materials CRT, forwards Chris Rufo (anti CRT figurehead) work to principal. Threatens legal action. https://imgur.com/a/mNHtJZp,  https://imgur.com/a/OWrtuqn\n\nWoodridge Elementary. Smith wants principal fired for raising Asian cultural awareness. Takes complaint to the district. https://imgur.com/a/0fH0XBJ\n\nThe documentation on Smith was discovered through public records requests. Smiths paints a different image of himself on his campaign website. https://www.facebook.com/Gregg4Board/",
    "title": "School PTA Member and a school Board Candidate Opposes Raising Asian Cultural Awareness",
    "subreddit": "asianamerican",
    "timestamp": 1634253174,
    "score": 87,
    "keyword": "asian principal"
  }
]