[
  {
    "text": "(23M) Jack of all trades, master of none - what do I work towards? Not sure where I should be heading anymore. I changed my major from Asian Languages a year or two ago after realising I had only picked it because I didn't know what else to pick, and I'm one class away from completing my new major in Interactive Media - but I never completed any useful electives in this area as I'd already completed them in Asian Languages.\n\nI picked Interactive Media because I was interested in Virtual Reality specifically, and I still am and would love to work in the 'industry'. But, the VR industry is essentially the 3D Visualisation/Game Design industry and I'm only a beginner when it comes to creating game assets, and I can't code at all. I feel like it's slightly too late to start learning these skills to an employable level, and to be honest, I don't really want to slave away as a 3D modeller or coder. I would love to one day become a Producer or Director for VR/AR applications/games/experiences - but that's not exactly an entry level job. The 'industry' in my Australian city is almost non-existent, as the technology is new.\n\nI love tinkering and have pretty good skills in IT hardware and software troubleshooting, PC building and hardware installation, some basic electronics skills - I've played with computers all my life and I'm the IT guy in the family when ever something goes wrong. I also have skills in sound design and electronic music production - ambient soundscapes, cheesy scifi tunes.\n\nMy best skill would actually be writing, though it gives me little joy unless I am really working on something I love. I consider myself a good editor, copywriter, ghostwriter, creative writer, but don't have a portfolio of work nor an English degree.\n\nMy dream would be to work as a combination of the three - a futurist visual/digital artist working with Virtual and Augmented reality technologies, writing compelling storylines - a 'practical creative' able to switch between tasks to work towards a single goal, getting my hands dirty in building the artwork both physically and digitally - think scifi movie props, but in a gallery setting.\n\nI guess what I'm really looking for is a day job/freelance/casual gig that would fulfill me creatively and allow me to hone or learn skills that would facilitate generating an artistic career on the side. Can anyone see a common thread where I cannot?",
    "title": "(23M) Jack of all trades, master of none - what do I work towards?",
    "subreddit": "careerguidance",
    "timestamp": 1486627418,
    "score": 2,
    "keyword": "asian director"
  },
  {
    "text": "Are you stuck in accounting? Don't give up hope! Hey everyone, someone told me that I should share my story since it's quite unique. \n\nBackground: I'm 23, I'm Asian (yes minority classifications affect jobs), I graduated 2 years ago from a large state university with a degree in accountancy.\n\n I worked for almost 1 year as an auditor, 1 year as a advisory consultant, and now I just got an offer at an amazing consulting firm with a hefty pay raise and am making more than my audit senior did during his 5th year. My job is stable, I work half as much as an auditor at times, and I get more recognition.\n\nI entered the work force working in auditing. My job was very dull and tedious, and I hated it. It's just not the right thing for me. I know a lot of you love accounting, especially considering that I'm in the accounting subreddit, but I wanted something that was stable, had more income, had more flexibility, and was more fulfilling overall. \n\nI joined a Big 4 firm, and my office was not small. There were 50+ people in my start class for auditing. And in just 10 months, I transferred. \n\n---------\n\n**How I transferred**\n\nI didn't come in guns ablaze to HR or even my audit team. I didn't talk anyone to in audit. I approached a senior in my office's consulting team. I asked him about teams that had a need - a slot to fill. I got names - managers, directors, partners. I emailed every one of them and scheduled an interview/discussion. And I spoke with 5 people - a manager, two directors, a partner, and the senior. \n\nI asked them for a need. I promised I'd get my CPA (I did). I told them that I wanted to join. They were interested. They said they'll be glad to have me. It's so much easier when they're people in your firm. \n\nI talked to HR. HR contacted the partner, and the partner made it happen. I told my audit team, gave them 2 weeks notice. They didn't want to lose a cog-in-the-system associate, but they can't say no to a partner. Plus, I wanted to leave - it would benefit them to let me go. Keeping me would be even more detrimental, especially if I lost the motivation to do good work. \n\nThe switch happened within just 2 months. It was a bit dull, but overall amazing. I didn't get a pay raise. It was just advisory. I'm still called a consultant, but it was just advisory. Nonetheless, it began my journey into a new field of business.\n\n---------\n\n**How advisory worked for me**\n\nAdvisory was significantly better than audit. Most big 4's (and most other advisory wings) require the same thing: 40 hours a week with around extra time put into other works like proposals and development. Overall, it averaged about 45 hours per week. However, flexibility was far higher than audit. \n\nEvery consultant in the entire wing had at least one work-from-home day. It was also very common for people to request multiple WFH days during the week, so typically it's 2 days working from home. It was great, commute time was saved, and I felt far more comfortable. And no one expects you to be a machine at home either. \n\nMore importantly, I learned more - got more client exposure, got more deliverable/presentation experience, and became so much better at being a professional. Just by merely asking, I got put into almost-senior roles. And I was just a measly second year here. \n\n----------\n\n**The next offer** \n\nI thought I could do better. Plus I have a foot in the door of the consulting world now. But I also didn't want to work my ass off. MBB firms work you 60-90 hours a week. That's too much. I value my free time a LOT. \n\nI got an offer for another firm. Same work. More pay. Flexible. Acting senior role. Next year my pay will go up by 20% again. I'll be close to six figures, after just 3 years out of college. \n\n------------\n\nThese things might work for you. Or it might not. But one thing I have learned after all this: there are *always* opportunities and there's *always* a way into something better. You can get what you want as long as you make the connections and work for it. And no, I am not someone with a ton of connections that can get me in the door anywhere. I made those connections by just emailing people out of the blue. Start within your firm. Work your way out. Don't let nonresponses drag you down. If you're like me and hate audit, you can get out, and be far better off in every aspect.",
    "title": "Are you stuck in accounting? Don't give up hope!",
    "subreddit": "Accounting",
    "timestamp": 1492192697,
    "score": 48,
    "keyword": "asian director"
  },
  {
    "text": "We're Justin Chon and David So. Ask us anything! **Justin**:  Hey im Justin Chon. I was he asian kid in twilight, jeff chang in 21 and over, and sonny from revenge of the green dragons among other films. Im going to be on an abc show called DECEPTION.\n\nIm a graduate of USC business school but somehow ended becoming an actor/writer/director.\n\nMy new film GOOK is set during the 1st day of the 1992 LA RIOTS and is about the friendship between a 10 year old black girl and 2 korean american brothers.\n\nYou may also recognize my co star David So. He is a youtuber but now i consider him an actor.\n\nOur movie, GOOK, opens in most major cities at REGAL CINEMAS. AUGUST 25TH!!!!!\nASK US ANYTHINGGGGG!!!!\n\n**Proof**: https://twitter.com/justinchon/status/884487502299398144\n\nhttps://twitter.com/davidsocomedy/status/884488440997335040\n\nhttp://i.imgur.com/OwHeuIT.jpg\n\n~~**UPDATE**: Thanks everyone! We're going to take a break, but we should be back on around 8 pm (pacific time) or so. Feel free to keep asking us questions!~~\n\n**UPDATE #2** Hey im terribly sorry. I got caught up with some family stuff that needed attention so wasnt able to hop back on. I'll try continuing answering questions tomorrow. If not, ill probably do another one of these in August, closer to the release date  -JC",
    "title": "We're Justin Chon and David So. Ask us anything!",
    "subreddit": "asianamerican",
    "timestamp": 1499711831,
    "score": 214,
    "keyword": "asian director"
  },
  {
    "text": "Director, performer resign after Calgary Opera plans to cast white woman for Asian role",
    "title": "Director, performer resign after Calgary Opera plans to cast white woman for Asian role",
    "subreddit": "asianamerican",
    "timestamp": 1491711063,
    "score": 29,
    "keyword": "asian director"
  },
  {
    "text": "Telling our own stories, and our short film 'Ella\" Hi there,\n\nMy name is Dan Chen, and I'm a director and cinematographer. You may have seen a post about our film \"Ella\" a few weeks ago, when we had just launched our Kickstarter. I'm happy to announce that we've reached our funding goal, and we're going full steam ahead!\n\nIn recent years, I recall a conversation I had with several other friends who work in film. We came to the conclusion that any American movie with an Asian protagonist would most likely be categorized as an \"Asian\" movie, or a special interest film.\n\n\"What if I wanted to make something like Dazed and Confused, but the main characters just so happen to be Asian American?\"\n\n\"It's still going to be an Asian movie.\"\n\nThe question stayed with me. Maybe I hadn't fully embraced my own race and identity yet. But I didn't want to make a special interest movie. I just wanted to make a movie.\n\nIt took a lot of inspiration to get to making \"Ella.\" Part of it was seeing artistic, successful minority representation in media, with projects like Master of None and Moonlight paving the way. Another factor was my friend Doug Kim, a producer on our short, writing and starring in a pilot we worked on together, which dealt with his real struggles as an Asian American actor in a courageous and comedic way. Finally, I realized that any character driven story needs to take race into consideration, just as it should explore sex, class, age, and other very real factors that affect who we are and who we become.\n\nIn my view, we can't wait for Hollywood to cast Asian Americans in an interesting, complex way, although putting pressure on them can certainly make them reconsider their actions. We need more Asian creators, just as we need more black creators, more Hispanic creators, and most obviously, more women of all kinds in Hollywood. Because these creators will understand the importance and significance of representation.\n\nPlus they'd have experiences and perspectives that we haven't seen yet. That's not just good social justice... that's good entertainment.\n\nSo this short film is my humble contribution (and if all goes well, the first of many contributions). I'd love support, critique, or sharing if you dig the project. We're currently going for our first stretch goal which would afford us the opportunity to hire a great casting director to help us find our second lead, who'd play a fourteen year old Chinese boy who's seeking acceptance in his small Midwestern town.\n\n[Ella, a new coming of age story in the Midwest](https://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid)\n\nI'm glad to be a subscriber to the community, and look forward to sharing more dialogues and upvotes with ya'll.\n\ncheers,\nDan",
    "title": "Telling our own stories, and our short film 'Ella\"",
    "subreddit": "asianamerican",
    "timestamp": 1490220529,
    "score": 24,
    "keyword": "asian director"
  },
  {
    "text": "ELLA - independent short film about Asian Americans in the midwest! Hey, my name is Douglas Kim, I'm a writer/producer living in Los Angeles.\n\nI'm producing a short film of a coming of age story that takes place in small town America.  The film follows the unlikely bond between Abe, a high school recluse and Ella, a charismatic college dropout, as they navigate the streets and social groups of their community.\n\nThe film features a notable Asian TV actor (Nichole Bloom of NBC's \"Superstore\"), offers a new setting for an Asian American story, and follows Asian characters who are integrated in their community, going through universal struggles while dealing with their outsider status in subtle but real ways.\n\nThe film will use an experimental, one-of-a-kind, camera rig that allows for a digital IMAX image.\n\nWith the success of Moonlight and other independent films, it's my belief that film is the way Asian Americans become normalized in America, where we can be seen as Americans pursuing our own version of the American dream.  I think we can accomplish that and more with our film.\n\n\nhttps://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid\n\nWould love it if you can support and share our vision!\n\n\nmore from the director, Dan Chen:\n\nNichole Bloom and Dan Chen have been friends since they attended USC. After Nichole’s successful climb into American television, and Dan’s online awards for his short films (danchen.co), the two decided to collaborate once more on a character-driven project with the intention of festival recognition, online release, and a proof-of-concept for universal Asian American stories.\n\nDan, on the film’s story: “The underlying theme is one of “selling out,” as Abe distances himself from Ella to fit in with new kids he’s met. As an outsider, can he only fit in by submitting to the dominant views of his peers? Or is there a way he can stay loyal to his loved ones, without being left out of the larger community? The film’s story is character-driven and specific, but acts as a metaphor for the Asian American experience. Do we stay in our place, assimilate, or somehow find a third way of being?”\n\nThe camera rig was built by cinematographer Philips Shum, who has shot music videos featuring Diddy, Schoolboy Q, and Drake. It uses the principal of 35mm lens adapters, while increasing the size to accommodate a 56mm x 56mm frame, to create a low-budget solution for an IMAX field of view.\n\nElla is to be produced by Eric Cook and Douglas Kim with Evidence Films, Varient Entertainment, and Justice Tech Industries attached.",
    "title": "ELLA - independent short film about Asian Americans in the midwest!",
    "subreddit": "asianamerican",
    "timestamp": 1488496011,
    "score": 26,
    "keyword": "asian director"
  },
  {
    "text": "Hollywood Casting Directors Say Asian Movie Stars Are On Their Way",
    "title": "Hollywood Casting Directors Say Asian Movie Stars Are On Their Way",
    "subreddit": "asianamerican",
    "timestamp": 1493698848,
    "score": 15,
    "keyword": "asian director"
  }
]