[
  {
    "text": "Should I be worried if a freelancer contract for a demanding job says that I can't terminate the contract or else I'll be liable for damages, but the company can terminate at any time? After a long interview process for what was meant to be a salaried full time position, I got a remote freelance contract offer from a cool company based out of China.   \nHowever, their pay is lower than what I'm used to, but the company would look great on my resume and involves a product I love.   \nThe HR director claimed they are pretty chill about hours and fr most of the time I won't even be working on the Asian time zone so I can choose my own hours.   \nHowever, I've also seen reviews of the company that claim they have a 996 schedule expectation (9am-9pm, 6 days a week).   \nObviously, if they turn out to be that demanding, I have no interest in continuing to work there, especially for the low day rate they're paying me.   \n\n\nThey sent me the contract that's designated as lasting a year, and one section states they can terminate the contract at any time for any reason, but I can't. If I do without their authorization, I have to compensate them for all losses and damages.   \n\n\nI know freelancers are a bit less protected in California, which might be why they switched the role from salaried to freelance. However, is this contract term normal for freelancers? And does it mean if the job is more overwhelming than they claim, that I'd have to compensate them the rest or some of my contract value if I had to quit?",
    "title": "Should I be worried if a freelancer contract for a demanding job says that I can't terminate the contract or else I'll be liable for damages, but the company can terminate at any time?",
    "subreddit": "jobs",
    "timestamp": 1683903273,
    "score": 1,
    "keyword": "asian director"
  },
  {
    "text": "4-7 grade US and World History curriculum recommendations * Hi! I am teaching a summer program in an Asian country, the director has asked me to find curriculum material for 4-7th graders (non-native English speakers) on US and World History. I need entire unit plans not TPT style graphic organizers, meaning a scaffolding 2-6 week unit. However, the only resources I can find online are for Christian homeschoolers and I need something non-secular. \n\nI normally teach World Lit for high school so I'm wandering outside of my normal territory and don't have any resources. Does anyone have a source or a book they recommend? Thank you so much.",
    "title": "4-7 grade US and World History curriculum recommendations",
    "subreddit": "Teachers",
    "timestamp": 1685500332,
    "score": 2,
    "keyword": "asian director"
  },
  {
    "text": "How do I network at the conference and potentially land a job? How do I network with people at the conference and potentially land a job\n\nI attended a small conference hosted by a software company and one of the keynote speakers sat next to me during a session. He is the director of the XXX department from XXX company, which is the one I have been wanting to get a job from. He sometimes just talked briefly with me about what was presented at the session, even said “you know, that feature was actually requested by us”. I having been actively looking for another job for better pay, and dreamed about working in that department. At that moment, I really wanted to just give him my resume or at least my business card to introduce myself. But somehow I felt it might not be appropriate, because the whole event was not a job fair or something. But I didn’t know how to network with him, especially from a junior position, and maybe land a job simultaneously. I was not good at socializing, not very humorous and even not a native English speaker. As an immigrant from an Asian country, I felt socially awkward. But I know I need to network and put myself out there. I humbly ask for some advice. How do I network and in particular what should I do in that situation?",
    "title": "How do I network at the conference and potentially land a job?",
    "subreddit": "careerguidance",
    "timestamp": 1697509903,
    "score": 2,
    "keyword": "asian director"
  },
  {
    "text": "Left last job not very happy, HR contacts me after months for a call on ‘something I was involved in’- what to do? Hi everyone!\n\nI need advise on what’s the least harming thing I can do for myself and my career.\n\nPast:\n\nI left my last job because they kept giving me short contracts and didn’t want to give me a permanent one (we were only two people in the whole office in this precarious contract system). The director very very much dislikes me. My supervisor was super anxious about anything I did and micromanaged my breathing. Needless to say, I hated that job.\n\nToday:\n\nFast forward to yesterday, after 5 months out of that place and happily in a new job (yes, exactly like an ex that sees you thriving), ‘HR committee’ (yes, not  department even, just some people allocated extra work on top of theirs on something they have zero expertise on) contacts me to have a call about my views on ‘things that happened during my employment’. \n\nI feel like I’m in a lose-lose situation.\n\n- If I take the call, I lose control over whatever I say, and I don’t trust the person carrying the ‘investigation’. This means that she can and will use anything I say to frame either my former supervisor or director.\n- if I don’t take the call, this will certainly be framed as being non collaborative and set questions about what happened (which I don’t even know what it is)\n- If I inform my former supervisor that I’ve been contacted, I will set further rumors.\n\nBottom line: there’s no winning for me.\n\nFor context: \n\n* My sector is INCREDIBLY small. I work with the same companies and firms now, that I did in the past. Same calls, same meetings. So mouth to mouth is just a nightmare. \n* Office politics are beyond the actual offices. So if I want to keep working on this sector I need to be super careful on who I align with.\n* I know that regardless of where I put my loyalties, I’m gonna make someone talk shit about me. And I am definitely in the least powerful position right now.\n* I am an Asian woman working in political stuff. \n\nHelp!\n\n\nTLDR: After I left my job, fake HR wants to ask me questions about something. Whatever I do will likely play against me. So it’s rather about mitigation the harms.",
    "title": "Left last job not very happy, HR contacts me after months for a call on ‘something I was involved in’- what to do?",
    "subreddit": "careerguidance",
    "timestamp": 1687341051,
    "score": 1,
    "keyword": "asian director"
  },
  {
    "text": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies? Hi all, apologies for the long post below that is likely full of some grammatical errors! :)\n\nI have been with my partner for 5 years. He works for a very intense advertising company and is the only Black individual on his team. His managers are White/Asian and have started using terms such as, “disrespectful,” “angry”, “isolative.” I want to be clear, my partner is loved by his team/ “mini” managers (those who he supervises). He has received very good reviews and is extremely engaging/polite. He’s truly lovely. His colleague in the exact same position is vocal and will often raise his voice during calls, to which my partners bosses simply reply with, “that’s fine. We hear you.” \n\nToday, my partner worked from 7am-7pm and a 30 minute call was put on his calendar at 6pm. There has been some financial issues going on with their company, so everyone is feeling the pressure. My partner wrote in the teams chat, “I’m a bit blinded sided by this meeting. What is it in regards to?”  to which his manager said, “that is a disrespectful response. WE have been working harder than you the entire weekend.” My partner responded with: “Okay, let’s just do this then” to which they wrote “you’re so angry and disrespectful.”\n\nThis resulted in a very heated, 30 minute Teams call in which his superiors called him paranoid, disrespectful, and angry. He highlighted that his White colleague has said much worse and even hung up on calls, to which they responded, “we have no memory of this.” My partner refused to say that being labeled as such is damaging to but he did say he felt unsafe (they ignored it).\n\nI wanted to jump in this call SO fast but held my tongue. My partner was extremely defeated and I was livid the entire time. As Black women, how do you all navigate your partner experiencing bias, racism, labeling, etc? I am exhausted and this was just ONE 30 minute call.  He has been at this company for 4 months and wants to stay at LEAST 1-2 years to make Director. Part of me wants him to find a new job ASAP but I also know that isn’t feasible.\n\nI just feel defeated and watching him experience this hurts me deeply. Any tips?\n\n****EDIT:*** The only thing we can think of that has contributed to their perception of him changing is that he took a Monday off (approved leave) to move apartments. He didn’t log on at all to check accounts/budgeting and one of his Supervisee’s had made a mistake with an account. This was caught the next day but resulted in everyone having to work this error out. This was about two months ago.\n\nUpdate: Thanks so much everyone for your feedback! He has started documenting everything, as you all have noted. Not sure how this will turn out but it is definitely concerning. He’s also started updating his resume and making sure everything is followed up with an email documenting what was/has been talked about in meetings. He noted that he is fearful to use “the race card” because there is no coming back from that, which I understand but still I am still encouraging him to address how damaging language can be as the ONLY Black male on his team. It’s not the race card, it’s the reality and race is ALWAYS present (whether conscious or unconscious). \n\nFor right now, he is keeping his cool and maintaining professionalism.",
    "title": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies?",
    "subreddit": "blackladies",
    "timestamp": 1688601081,
    "score": 40,
    "keyword": "asian director"
  },
  {
    "text": "Shopping while Black I need help. I am being harrassed while shopping at my local grocery store. I have tried everything to get them to stop.  I have reached out to store directors, directors of operations, corporate you name it. It stops and then it escalates again. I live in a predominantly White/Hispanic/Asian area in California.  Its now at the point where I have to address the situation legally.  Any assistance would be greatly appreciated",
    "title": "Shopping while Black",
    "subreddit": "blackladies",
    "timestamp": 1679849089,
    "score": 11,
    "keyword": "asian director"
  },
  {
    "text": "I told /r/asianamerican a year ago we need more films with stories that happen to feature Asian people. I dropped out of film school with this mindset and directed my own film. One year later, I'm done! I'm having the world premiere in Los Angeles this Saturday, please join me! Hey everyone! My name is Reangsei Phos and I’m a 23 year old film director based in Toronto. Over a year ago, I posted to /r/asianamerican about this film and the support has been overwhelming. \n\nFor those of you who don't know I dropped out of film school three years ago and since then my views as a filmmaker have shifted from solely telling Asian stories about culture and identity - to telling compelling stories from an Asian-American viewpoint, involving Asian in front and behind the camera. With this new mindset, at the beginning of this 2022 I started working on a new short film.\n\nIt follows a couple on the verge of their one year anniversary, they get into an argument and end up locked in a diner with its strange owner. The film is heavily inspired by some of my favorites; the chaos of the Safdie brothers & the surrealism of Haruki Murakami and inspired by my last relationship. Unlike my previous film that highlights the Asian experience, this film highlights a unique story through an Asian cast, something that we need more of today.\n\nAfter a year of working on it, I'm finally ready to share it! I'm hosting a world premiere in Los Angeles Arts District on November 18th and I'd love for you to join me. It's free and all you have to do is RSVP [here](https://partiful.com/e/XeDpnxbcIntTrxxJWm4x)\n\nThank you everyone <3",
    "title": "I told /r/asianamerican a year ago we need more films with stories that happen to feature Asian people. I dropped out of film school with this mindset and directed my own film. One year later, I'm done! I'm having the world premiere in Los Angeles this Saturday, please join me!",
    "subreddit": "asianamerican",
    "timestamp": 1699914821,
    "score": 288,
    "keyword": "asian director"
  },
  {
    "text": "I’m jason chu - Asian American rapper heard on American Born Chinese, Joy Ride, Warrior & more. Also a passionate racial justice advocate with Hate Is a Virus. AMA! Hi everyone! My name's jason chu - I'm a rapper & activist based in LA.\n\nFor the last 8+ years, I've been a full-time recording & touring artist, with music on *American Born Chinese*, *Joy Ride*, *Warrior,* *Kung Fu*, and more. My new album [*We Were the Seeds*](https://fanlink.to/weweretheseeds) just came out this past weekend.\n\nAs an activist, I've done work around AANHPI history, interracial solidarity, mental health, and other topics, including tons of educational content on [IG](https://www.instagram.com/jasonchumusic/reels/) and [TikTok](https://tiktok.com/@jasonchumusic). I've been communications director at Hate Is a Virus for the last couple of years, and also worked with the LA Mayor's Office to help shape plans for a new monument to the 1871 Chinatown Massacre.\n\nI'm a Yale graduate, and did an MA in Asian American Theology, a hybrid of Christian liberation theology and Asian American Studies. More of my background is at [jasonchumusic.com/about](https://jasonchumusic.com/about)\n\nAfter a weekend of album release shows, I'm sitting at home working all day - lets chat about being Asian in hip-hop, being a full-time creative, racial justice & mental health, or anything else that comes to mind. AMA <3\n\nProof: [https://www.instagram.com/stories/jasonchumusic/3196213069907490849/](https://www.instagram.com/stories/jasonchumusic/3196213069907490849/)\n\n**Call To Action:** On December 30, 2020, Christian Hall, a Chinese American boy, was killed by PA State Troopers.\n\nPlease sign this petition to help ensure something like this never happens again: [bit.ly/j4chall](https://bit.ly/j4chall)\n\nAnyone who doesn't know about Christian - you can read up [here](https://www.cnn.com/2022/04/01/us/christian-hall-shooting-pennsylvania-lawsuit/index.html) and in [this statement from the family's attorney](https://act.bencrump.com/a/christian-hall) (TW: violence, police brutality, mental health crises)\n\n&#x200B;\n\n**Edit 9/22:** Think I answered most of the questions, thank you all for a great AMA! Honestly, going in i was nervous no one would really want to engage, so it was cool getting to chat with you folks and respond to some really thoughtful questions.\n\nIf you want to reach out, hit [my IG](https://www.instagram.com/jasonchumusic/) \\- and please take a listen to [*We Were the Seeds*](https://hypeddit.com/w8gi7m), out now on all platforms <3",
    "title": "I’m jason chu - Asian American rapper heard on American Born Chinese, Joy Ride, Warrior & more. Also a passionate racial justice advocate with Hate Is a Virus. AMA!",
    "subreddit": "asianamerican",
    "timestamp": 1695237656,
    "score": 265,
    "keyword": "asian director"
  },
  {
    "text": "Shoutout to The Whale for its Asian American portrayal Haven't seen The Whale mentioned so thought I'd bring it up. As I don't watch trailers, I didn't know there was gonna be a prominent Asian American character in it, just watched because I like the director Darren Aronofsky a lot. The Asian American character is just a regular Asian American living her regular life in the US like Asian Americans IRL, no \"hONoRR\", poor English, \"exoticness\", or other stereotypes often seen in American movies featuring Asian characters. As for the movie itself (no spoilers), it's the same director of Requiem for a Dream, Black Swan, The Wrestler so it falls under the same vibe of bleak yet amazing movie. The Whale has some really powerful delivery, even I teared up a bit during its climax and I'm pretty stoic (felt nothing watching Anohana lol). All the actors did an amazing job, the characters felt real, and it's beautiful how everything got tied together. Totally recommend",
    "title": "Shoutout to The Whale for its Asian American portrayal",
    "subreddit": "asianamerican",
    "timestamp": 1672692700,
    "score": 144,
    "keyword": "asian director"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 70,
    "keyword": "asian director"
  },
  {
    "text": "Writer-Directors Celine Song and Adele Lim on Reflecting the Complexity of Asian Identity On-Screen: The respective creators of Past Lives and Joy Ride discuss tapping into the universal human experience through hyper-specific stories",
    "title": "Writer-Directors Celine Song and Adele Lim on Reflecting the Complexity of Asian Identity On-Screen: The respective creators of Past Lives and Joy Ride discuss tapping into the universal human experience through hyper-specific stories",
    "subreddit": "asianamerican",
    "timestamp": 1703181107,
    "score": 7,
    "keyword": "asian director"
  },
  {
    "text": "Overtime! (Hockey documentary that's winning awards) Is today Asian Hockey Day? \n\nI'll rec *Overtime*, a movie about a Kelley Lee, a 60-year-old mother, wife, PhD doctor, and university  professor, as her team goes to the Canada 55 plus games. \n\nTrailer is here: [https://vimeo.com/785067477](https://vimeo.com/785067477)\n\nInfo from the Vancouver Asian Film Fest, where it won a few festival awards:   \n[https://2023festival.vaff.org/events/overtime/](https://2023festival.vaff.org/events/overtime/)   \n(The festival website is pretty awesome anyways, if you're looking for new Asian film titles.)\n\nThe same director also did Breakaway, an 8-minute short about a young Asian girl who's obsessed with hockey — [https://vimeo.com/339613844](https://vimeo.com/339613844) (this is the full video)",
    "title": "Overtime! (Hockey documentary that's winning awards)",
    "subreddit": "asianamerican",
    "timestamp": 1700345485,
    "score": 7,
    "keyword": "asian director"
  },
  {
    "text": "'Curse of Quon Gwon' (1916) - First Asian American film https://www.youtube.com/watch?v=o2-sMG3Qlt8\n\n“The Curse of Quon Gwon is the earliest known film directed by an Asian American, and one of the earliest films directed by a woman. The movie features an all-Chinese American cast, including the star, Violet Wong, who was director Marion Wong’s sister-in-law. Most of the film was shot in Oakland, a few miles of where it will be screened in Chinatown on Sunday. Their family came to the U.S. in the 1850s during the Gold Rush Era.”\n\nhttps://caamedia.org/blog/2015/08/04/caam-co-presents-earliest-known-asian-american-film-the-curse-of-quon-gwon/",
    "title": "'Curse of Quon Gwon' (1916) - First Asian American film",
    "subreddit": "asianamerican",
    "timestamp": 1693215067,
    "score": 6,
    "keyword": "asian director"
  },
  {
    "text": "Teen girls ‘engulfed’ in violence and trauma, CDC finds There was/has been an increase in domestic violence in general during the COVID pandemic. That fact is somewhat widely known. According to this Washington Post article, there has also been an increase is rape against teen girls and increased depression among teen girls.\n\n\"... Almost  15 percent of teen girls said they were forced to have sex, an increase  of 27 percent over two years and the first increase since the CDC began  tracking it.\n\n'If  you think about every 10 teen girls that you know, at least one and  possibly more has been raped, and that is the highest level we’ve ever seen,' said Kathleen Ethier, director of the CDC’s Division of  Adolescent and School Health, who said the rise of sexual violence  almost certainly contributed to the glaring spike of depressive  symptoms...\n\n... Ethier said it’s important to determine who is perpetrating the  violence, which the survey did not address, and how it can be stopped.\n\n... Lesbian, gay, bisexual and questioning students were significantly more  likely to experience violence than their heterosexual peers. They were  also more likely to be electronically bullied and to report persistent  sadness or hopelessness. \n\n... Black and Hispanic students were more likely than White and Asian students to avoid school because of safety concerns...\"\n\n[https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl\\_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp\\_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87](https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87)",
    "title": "Teen girls ‘engulfed’ in violence and trauma, CDC finds",
    "subreddit": "Feminism",
    "timestamp": 1676335624,
    "score": 631,
    "keyword": "asian director"
  },
  {
    "text": "Feminist review of The Creator I just saw Gareth Edwards The Creator and once again women are forgotten in sci-fi. Here are some quick highlights.\n\nIt doesn't pass the bechdel test. \n\nAll robots (except simulants) are male except for a few female stripper robots. Yes, you heard that right. \n\nThe whole movie starts with the fridge trope. \n\nThe amazing tech genius is celebrated more in a role as a mother than as a creator.\n\nThe Asian communities mainly talk English to each other, except the dehumanized police robots, making Asian portrayed as subhuman. \n\nWe're in year 2065 and still they only show female flight attendants. \n\nAll engineers at the Nomad control room are male. \n\nOh, and another fridging of the gf happens later in the movie. \n\nThis movie could have been amazing, but yet again, male directors miss the mark.\n\nAnyone else seen the movie? What are your thoughts?",
    "title": "Feminist review of The Creator",
    "subreddit": "Feminism",
    "timestamp": 1699387551,
    "score": 8,
    "keyword": "asian director"
  }
]