[
  {
    "text": "Can I Rely On My Current Role / End of Probation Negotiation Methods? (Software Development / UK Based) Hi all,\n\nI am in the UK and work as an iOS developer in a small sized tech business (not a startup).\n\nI took the job as my first software dev job having worked in marketing, the job was offering 25-30k so i said 25k as i wanted the experience and opportunity to get into the industry.\n\nSince then ive found the job to be not exactly what was promised, im the sole iOS developer when i was told id have a team, the CEO/Line manager who hired me hasnt spoken to me since my first day nearly 2 months ago and stays in his office.\n\nThe company isnt really making much money but has chinese money backing it which keeps it afloat, the management are totally incompetent but are paid highly despite doing no work and some are known to do their own companies work on company time...\n\nI work on the codebase for the iOS app alone, no guidance, no checks, totally solo. However I have removed all the crashes, fixed the bugs, rolled out several new features, and am working on a major user requested feature currently which I hope to complete before the end of probation.\n\nMy thoughts are that im not sure the companies intention, would they likely keep me on as im the only dev for iOS? its not a core part of their business (they make other hardware and iOS is the remote for it), further to this if i am offered the role fully, i really wanted to negotiate more money for the risk of working there.\n\nBased on what ive achieved and how i am not part of a team as promised, i was hoping to at least get the 30k allocated to the role when i started, and ideally, push for 34k as i want to be getting 2k a month post tax.\n\nI am 26 and wanted to move out so the salary and job security are important for me to progress my life. However i wasn't sure how to handle negotiation post probation, how can i approach the salary and should i be looking for job prospects elsewhere if they say no? The CEO is asian and the business operates in a pretty asian style.\n\nI can provide any further background needed, ive tried to be thorough, i just want to make sure i approach this correctly to achieve what I want in the best method!\n\nAppreciate time and help on this matter.",
    "title": "Can I Rely On My Current Role / End of Probation Negotiation Methods? (Software Development / UK Based)",
    "subreddit": "jobs",
    "timestamp": 1496073804,
    "score": 1,
    "keyword": "asian ceo"
  },
  {
    "text": "Tried making a joke at work, did I come across racist? \nI just started my job, I love it. It's in a field I've wanted to work in for a long time. The hours are flexible and the pay isn't bad. The people so far are nice enough and I get along really well with my manager. \n\nThe other day I saw the ceo of the company at a restaurant and I excitedly posted on a group chat that he was behind me at the restaurant. Someone asked where I was. I thought it'd be funny if I said the most unlikely restaurant he'd be at, and I named a cheap local fried chicken chain. I didn't get much response after that. \n\nThe next day I felt like my manager was kind of avoiding me and it dawned on me this weekend that perhaps I came across as racist. Most of my coworkers are African American, and I'm not [I'm Asian]. \n\nWas it racist of me to post that? Or am I over analyzing the situation? I would hate for things to be awkward at work given how great things are going. I know the rule is for jokes at work is, if you have to ask yourself if it's inappropriate, then it probably is. I really had no racist intent but I feel bad. What do you think? And what should I do about it?\n\nTL;DR made a joke on group chat, worried I came off racist, wondering what to do",
    "title": "Tried making a joke at work, did I come across racist?",
    "subreddit": "careerguidance",
    "timestamp": 1505103705,
    "score": 1,
    "keyword": "asian ceo"
  },
  {
    "text": "Immigration and CS jobs I live in Canada (although I'm not Canadian) and I had hopes of going to Cali for FT because lets face it, California or Washington (maybe NYC) are the only places where software engineers actually make money. Salaries are low in Canada, ~60k US after conversion. Why is the general consensus that immigrants steal US citizens' jobs? Tech is dominated by Asians, and although they may be \"American,\" they really aren't (they moved there some time). Google's CEO is Indian, Microsoft, Adobe, .... The simple reason I would like to move to USA is because of $$$. Period. What are your thoughts on this topic?",
    "title": "Immigration and CS jobs",
    "subreddit": "cscareerquestions",
    "timestamp": 1493281639,
    "score": 0,
    "keyword": "asian ceo"
  },
  {
    "text": "Despite what you might have heard, Asian American CEOs are the exception, not the norm",
    "title": "Despite what you might have heard, Asian American CEOs are the exception, not the norm",
    "subreddit": "asianamerican",
    "timestamp": 1508417677,
    "score": 24,
    "keyword": "asian ceo"
  },
  {
    "text": "Never Tolerate Disrespect Just Because She’s Powerful Several years ago, I was subjected to a level of disrespect from a fellow human being that I refused to let go unpunished. At the time, I was at a company weekend getaway that was held in a lavish resort. It was a glorified piss-up, and all expenses were paid by the corporate managers. On the second night the bar closed early, so we decided to go off in different groups throughout the resort, have more drinks, and enjoy the night. In the spirit of getting to know fellow members of the company from other branches, I went off to different groups and spent time with them. I was treated with respect by many of my fellow workers, and it turned out to be a great opportunity for networking. However, upon introducing myself to one group, I was treated with utter disrespect by one of the National Managers. She was a small Asian woman who was high on God-knows what, and drunk off her face. After I walked in and introduced myself to the others, she started screaming at me like an unstable maniac:\n\n\n\n\n“Who the fuck are you? Guys, seriously who the fuck is that in our room?! I’ve never seen him before – why the fuck is he looking at me? WHY THE FUCK ARE YOU LOOKING AT ME?!!” she then screamed in an utterly abusive tone. One of the guys came up to me and apologetically suggested that I leave; explaining that she had had too much to drink. I was very disappointed that I didn’t get to meet more of my co-workers, and also that a National Manager had treated me in such a way. I refused to let this go down without a fight. \n\n\n\n\n\nOn Monday I approached my boss and told her what had happened. She was outraged, and suggested that I make a formal complaint. The next day, I met up with the Deputy CEO and the General Manager of the company. I had no hope. Both of them were women, and they were on excellent terms with the National Manager who had abused me. According to them, the National Manager had a “natural charm”, and was “a lovely person” normally. Still, they got this unstable woman with a psychology degree to give me a call to apologize; which turned out to be very forced. I told that her that her behaviour had been unacceptable, and that the reason I had made a formal complaint was that I had been treated in such a way by a National Manager of all people. \n\n\n\n\nThree months later, I was out of the company, and the National Manager had been promoted.",
    "title": "Never Tolerate Disrespect Just Because She’s Powerful",
    "subreddit": "MensRights",
    "timestamp": 1513936059,
    "score": 58,
    "keyword": "asian ceo"
  }
]