[
  {
    "text": "Looking into this job at Harvard I applied recently to Harvard as a research assistant to the Weatherhead Center under the Program on US-Japan Relations.\n\nWhile I didn't make the initial cut (and the Executive Director thanked me for taking the time to consider applying in e-mail), I suddenly found the position of Program Coordinator at the Reischauer Institute of Japanese Studies.\n\n\\----\n\nDuties:\n\nWorks closely with the administrative leadership to coordinate the  activities of the Reischauer Institute of Japanese Studies. Primary  responsibility involves student support services. Plans and organizes  student information, orientation, returnee sessions, and other  student-related gatherings. Coordinates all aspects of application  intake/processing, review, placement/award, budgeting and orientation  for students traveling to Japan for internships, summer school, language  studies, and research. Maintains all student records relating to travel  abroad including release forms/waivers, and assists with record keeping  and analytics. Prepares correspondence relating to student placement  and programming with various units across campus and host organizations.  Produces materials – print, web, social media – to promote student programs in Japan. Position also involves support to designated faculty,  including calendar, correspondence, website, course materials,  committees, publications, travel arrangements, and files. Position also  includes event coordination and communication, including some website  maintenance. Occasional frontline responsibilities. Performs other  duties as required. Occasional overtime required.\n\n**Basic Qualifications**\n\n3+ years of administrative experience. Education may count towards experience.\n\n**Additional Qualifications**\n\nBachelor's degree with a concentration in East Asian  Studies or Japanese Studies strongly preferred. Excellent  writing/editing skills; communication and organizational skills are essential. Working knowledge of desktop publishing skills and  familiarity with computers and technology preferred. Candidates with cross-cultural experiences and/or experiences working/studying abroad a  plus. Knowledge of Japan and Japanese strongly preferred.\n\n\\----\n\nI only have two years of admin experience since I help out with a NGO as a volunteer aside from doing research stuff. Also did a BA in Vancouver, Canada towards Political Science. I can also hit some of the additional qualifications needed.\n\nIt's a tempting job ad, but I'm not sure if I can relate to it (I would like to, at some point, do research on East Asia/Japan from an academic/institute perspective someday). I did study upper level courses based on East Asia (One course is modern Japan).\n\nAnother question is for example, I have (maybe) minimal desktop publishing skills since I have my own blog to publish my own articles on what's happening in Japan.\n\nWould like some thoughts on whether I should give this a shot.",
    "title": "Looking into this job at Harvard",
    "subreddit": "jobs",
    "timestamp": 1564535863,
    "score": 0,
    "keyword": "asian director"
  },
  {
    "text": "How can I help make my company more diverse I am one of 2 HR managers in a tech company that employs 100 people in Taiwan.  Our company is growing but currently the majority of my company maybe 70% are cishet East Asian men.  I see this as problematic and I think that this needs to change.\n\nI have tried suggesting many different initiatives to bring on different people (non-East-Asians, women, members of the LGBTQIAP+ community).  For example I suggested that managers who recruit people from minority groups would receive a small bonus for each person they brought on.  Alternatively I suggested that a small \"bonus\" of about 10 points could be added to our KPIs for recruiting and promoting.  Both these ideas have been shot down by the other HR manager and the HR director.\n\nThey said they could look into hiring more women, and maybe people from other East Asian countries like China (yikes!) and Japan but they're not willing to go any further than that.  In contrast I would like to see the company become \"majority minority\" within 5 years.\n\nWhat can I do in order to create more diversity?",
    "title": "How can I help make my company more diverse",
    "subreddit": "jobs",
    "timestamp": 1565148174,
    "score": 0,
    "keyword": "asian director"
  },
  {
    "text": "Career Advice: Investment Banking --> Startups --> ... ? Hi !\n\n  \nI'm looking for career advice, please help. Please check CV here: [https://docdro.id/HY1qBbB](https://docdro.id/HY1qBbB)  \n\n\nPoint #1: I am 30y old, I come from Russia and need visa sponsorship everywhere I go, welcome  \nPoint #2: travelled to 40+ countries, MSc in UK, 7 years abroad, 5y in Asia (2 unicorns and more)  \nPoint #3: 3 investment banking internships (GS, MS, CS) --> startups (Director) --> own business  \nPoint #4: I failed with my business (generated USD2m tho), I am USD50k underwater, I am f%cked  \nPoint #5: I then got into 3 startups, it didn't work out (not my fault apart from poor due diligence)\n\n  \nI am fed up working in Startups. I feel like I learnt the basics already (Sales, Marketing, Operations, Legal, Finance, HR, Strategy). I am not getting anywhere (it's not a career and it's not my own thing). Money sucks (little pay in Asian / EU startups, bonuses and equity never materialize). Social status sucks (i feel like a hipster and I am not), lifestyle sucks. I enjoy life, love the grind and refuse to quit. Time to grow up now.\n\n  \nShort-term objectives: get back on track, seek stability (f%ck services agreements, I want proper employment contract), pay off high interest debt, restore financial position, restore social status\n\n  \nLong-term objectives: accumulate USD100-300k in a matter of 3-5 years, remain international, want to develop network in EU, strong brand on my CV, prepare for my business #2 (entrepreneur inside)\n\n  \nWhat I am selling:  \n1. finance background: education, internships in ibd, stint in PE - I still like finance  \n2. business development: sales & marketing, operations, strategy - done it all successfully  \n3. entrepreneurial experience: grew team to 40 people, USD2m in Sales, 0 profit (welcome)  \n\\* i like sales, figured it out only when 26y old, wish I started earlier  \n\\*\\* led international expansion 3 times successfully, like it - don't feel rewarded properly\n\n  \nQuestion: where to go ? which position ? how to get in ?  \n\\- Venture Capital (preferable): pre-seed-series B ? I fancy the idea; associate ?! how to break in ?  \n\\- Growth PE: too much modelling - they want bankers ? I can bring little value added ?  \n\\- IT Sales: I like selling a lot (no contacts book in EU), am interested in big commissions  \n\\- Equity Sales: i like sales but ... start from bottom ? too late ? no edge to get in back ?  \n\\- Consulting: no. i talked with Top-3 (and their Digital Units) and my answer is no, 0 culture fit\n\n  \nPlease help me out. Advice is appreciated.",
    "title": "Career Advice: Investment Banking --> Startups --> ... ?",
    "subreddit": "careerguidance",
    "timestamp": 1552936567,
    "score": 1,
    "keyword": "asian director"
  },
  {
    "text": "Bong Joon-ho's 'Parasite' wins Cannes' most prestigious award, marks first Korean film to win Palme and \"second straight Palme victory for an Asian director\"",
    "title": "Bong Joon-ho's 'Parasite' wins Cannes' most prestigious award, marks first Korean film to win Palme and \"second straight Palme victory for an Asian director\"",
    "subreddit": "asianamerican",
    "timestamp": 1558881083,
    "score": 132,
    "keyword": "asian director"
  },
  {
    "text": "Hollywood wanted ‘fewer Asians’ in a new kung fu film. This Seattle director stuck to his script",
    "title": "Hollywood wanted ‘fewer Asians’ in a new kung fu film. This Seattle director stuck to his script",
    "subreddit": "asianamerican",
    "timestamp": 1568663083,
    "score": 126,
    "keyword": "asian director"
  },
  {
    "text": "'Edge Of Tomorrow 2': Asian American organization asks director Doug Liman not to whitewash sequel",
    "title": "'Edge Of Tomorrow 2': Asian American organization asks director Doug Liman not to whitewash sequel",
    "subreddit": "asianamerican",
    "timestamp": 1569585529,
    "score": 113,
    "keyword": "asian director"
  },
  {
    "text": "Jon M. Chu, Director of 'Crazy Rich Asians': Young Filmmakers Don’t Have the Baggage of Self-Hatred",
    "title": "Jon M. Chu, Director of 'Crazy Rich Asians': Young Filmmakers Don’t Have the Baggage of Self-Hatred",
    "subreddit": "asianamerican",
    "timestamp": 1561417940,
    "score": 83,
    "keyword": "asian director"
  },
  {
    "text": "Crazy Rich Asians Director Wants to Make a Star Wars Rose Tico Series for Disney+",
    "title": "Crazy Rich Asians Director Wants to Make a Star Wars Rose Tico Series for Disney+",
    "subreddit": "asianamerican",
    "timestamp": 1577455538,
    "score": 51,
    "keyword": "asian director"
  },
  {
    "text": "Anybody ever felt the fear of being stereotyped? I was browsing through New York Times yesterday and I came across this [article](https://www.nytimes.com/2019/03/17/us/college-admissions-students.html). Karen Ge's experience especially rang a bell within me. \n\nIt reminded me of my own experience of being an Asian-American violinist, even though I wasn't as accomplished as Ge was with math.  Music has always been my passion and a core part of my identity, but yet at the same time, I grappled with insecurities. On one hand, I feared that I wasn't good enough (common concern among all musicians), and on the other hand, I feared about getting stereotyped. I worried about being viewed as the typical Asian nerd who plays the violin, coming off as emotionless and passive. I worried about my parents being perceived as aggressive \"tiger parents\" who mercilessly forced their daughter (which they never did)\n\nWhen I visited a college in Minnesota for a music audition last year, I felt internal pressure not to appear too nervous so I don't accidentally come off as that robotic asian being flanked by her tiger parents. I smiled and chatted with the music directors, act super friendly and interested, trying to wash away my uneasiness. \n\nAnybody else went through something similar?",
    "title": "Anybody ever felt the fear of being stereotyped?",
    "subreddit": "asianamerican",
    "timestamp": 1552969626,
    "score": 33,
    "keyword": "asian director"
  },
  {
    "text": "Crazy Rich Asians director Jon M. Chu responds to controversy over writers' pay disparity",
    "title": "Crazy Rich Asians director Jon M. Chu responds to controversy over writers' pay disparity",
    "subreddit": "asianamerican",
    "timestamp": 1568079955,
    "score": 29,
    "keyword": "asian director"
  },
  {
    "text": "'Crazy Rich Asians' Director Jon M. Chu Inks Overall Deal With Disney's 20th TV",
    "title": "'Crazy Rich Asians' Director Jon M. Chu Inks Overall Deal With Disney's 20th TV",
    "subreddit": "asianamerican",
    "timestamp": 1557170200,
    "score": 17,
    "keyword": "asian director"
  },
  {
    "text": "Korean-American director Kogonada on the town that inspired his debut feature (starring John Cho) and the need for more Asian-American male leads",
    "title": "Korean-American director Kogonada on the town that inspired his debut feature (starring John Cho) and the need for more Asian-American male leads",
    "subreddit": "asianamerican",
    "timestamp": 1562636823,
    "score": 15,
    "keyword": "asian director"
  },
  {
    "text": "Director dreams of day films aren’t labelled Asian-American",
    "title": "Director dreams of day films aren’t labelled Asian-American",
    "subreddit": "asianamerican",
    "timestamp": 1564749889,
    "score": 13,
    "keyword": "asian director"
  },
  {
    "text": "Asian Art Advocates Accuse the Shed's Kung-Fu Musical of 'Yellow-Face Casting.' But Its Director Says the Character Is White",
    "title": "Asian Art Advocates Accuse the Shed's Kung-Fu Musical of 'Yellow-Face Casting.' But Its Director Says the Character Is White",
    "subreddit": "asianamerican",
    "timestamp": 1564010168,
    "score": 6,
    "keyword": "asian director"
  }
]