[
  {
    "text": "Finished my first year teaching....and then got fired Spent my first year struggling through at a truly difficult school: title 1, sure, but the problem is really a truly toxic admin (think of over 60% teacher turn over in 2 years. Can only convince newbies to work there). I was teaching both SPED and Gen Ed because I'm dual certified.  Loved SpEd, but it was hard teaching both. Special Ed department lost several teachers and an administrator DURING the school year, adding to my case load and leading me to take over a class that hadn't had a teacher in 4 weeks. Still, I had perfect attendance, was an effective case-manager, and did the absolute best I could in the classroom. \n\n&#x200B;\n\nYet.... my observations both from my school and my alternative cert program didn't do great. I could have been more strategic, sure, and my practice was genuinely lacking in some ways. My final rating on the district system was 'developing', the category between ineffective and effective. My alternative certification program scored me, though, as \"not meeting expectations\" and decided to dismiss me. These were evaluations based only on classroom practice and now my provisional license is getting pulled.\n\n&#x200B;\n\nMy Principal could have EASILY brought me back on a different kind of temporary license. But she is not really the 'supports her teachers,' or the 'have your back' or the 'take a risk on someone' type.  Whole SpED department has my back and some wrote letters of appeal to my alternative cert-program but I am not optimistic. 4 special ed vacancies before this and the principal said she would be 'lucky' to fill two of those. I guess that shows where her priorities are: would rather not make waves with a program that gives her a pipeline of new teachers than have a functional special ed group.\n\n&#x200B;\n\nThe worst part about it is that I didn't get any of this confirmed until finals were winding down so I didn't really get to say goodbye to my students. They lose so many of their teachers and, even though the school is a total mess, I was excited to come back and to give them some consistency. To be honest I am not too worried about the future. I may be black-balled in the district I'm in now but surrounding districts will probably hire me for SOMETHING. The whole state has a shortage of special educators. Worst case is I stay in the district as a para while I find another way to finish my full certification. I am not posting for advice, just to vent. One of the few people in the world who wanted to work at the school I worked at and now I'm gone.I think I've heard enough about 'transformational change' from my certifying program....\n\n&#x200B;\n\nBut, it's summer!",
    "title": "Finished my first year teaching....and then got fired",
    "subreddit": "Teachers",
    "timestamp": 1561289430,
    "score": 276,
    "keyword": "black principal"
  },
  {
    "text": "Rant. Losing my mind over printing/copies. My school doesn't allow us to make copies. None. We share a printer for the whole team and we were told that once the toner runs out, they will not be replacing it. The principal just tells us not to teach using copied things. Have the students write their work instead.. but let's be realistic. It's not always possible. Sometimes you need to print or copy activities and various other things. So I've had to print my things at home. I have a cheaper little printer that is a piece of garbage and since school started on August 14th, I have replaced my black and color ink cartridges twice. I just ran out again tonight. I get maybe 40 pages to a cartridge if I'm lucky. I'm at the point where I want to cry over a darn printer issue because I can't afford to keep replacing these cartridges for $35 a piece every two weeks. I just can't do it. \n\nSo what do I do? Bore the hell out of my kids by never giving them any cut and paste activities, or any sort of things to paste into their journals, or sorting, or any centers puzzles (because I'd have to print them myself!)? They're below grade level 1st graders. They can barely write and the principal wants them to literally copy everything down in a notebook instead of me giving them templates?!\n\nI've only been in school a month and I am already at my wit's end. I literally can't afford this. My husband says to look into a laserjet printer so we can get more mileage out of a toner instead.. but to buy the printer itself is expensive and the toners are about $100 a pop.\n\nHow can a school lack money that badly to where we aren't allowed to print or copy things AT ALL? It's insane. I should have asked about their budget when I interviewed. Maybe I could have avoided this, because the school I student taught at last spring let the teachers copy whatever they wanted and they're just right down the street from this one.\n\nI shouldn't want to cry over copies.",
    "title": "Rant. Losing my mind over printing/copies.",
    "subreddit": "Teachers",
    "timestamp": 1567989520,
    "score": 70,
    "keyword": "black principal"
  },
  {
    "text": "What are your thoughts on why there aren’t many African American teachers. Black teachers only make up 7 % of public school educators across the nation. Black males is even lower. Each year more and more black teachers are leaving the profession due to reasons ranging from feeling “pigeonholed” into only serving black students, being pressured into being the unofficial disciplinarian of students of color, to feeling ostracized by their administration and colleagues. These are ALL things I faced as an African American teacher my first couple years of teaching and had I remained at the school where I was, I would have most likely left the profession as well, but like most teachers, the students kept me motivated to keep going. My last year there our school had a “ Black History Month” Assembly which ONLY focused on the achievement African-Americans have made in sports and music. When I spoke to my principal about it she told me she didn’t feel offended and that neither should I. SHE as a white woman was not offended so ME as a black man shouldn’t. Now, at my current school things are much better as I feel valued and appreciated as a staff member and as an individual, but we ALL have a long way to go.",
    "title": "What are your thoughts on why there aren’t many African American teachers.",
    "subreddit": "Teachers",
    "timestamp": 1553136932,
    "score": 56,
    "keyword": "black principal"
  },
  {
    "text": "New Principal Worries and a Rant We have a new principal. This is a regular occurrence at our school. I have very little faith in principals in general - they often cause more problems for teachers than they solve in my experience. \n\nListening to new principal's first speech, three things were very strongly implied:\n\n1) New principal believes that teachers working extra long hours beyond contract time is just how it is because teaching is a calling (one that the principal was called to then moved on to admin, hmm...) \"no excuses\" \"just get it done\" \"teachers lose a lot of family time\"\n\n2) New principal is very religious and says god called them to our school (we are a public school) and they believe this means they will be the one to fix us \n\n3) New principal seems to believe that our issues will be solved with more accountability, \"proof\" \"evidence\" and \"data\" to show we are doing our jobs, and \"cultural awareness training\". \n\nNone of the above makes me more confident that this is going to be a good, or even better year than the last. I do not appreciate being told that teachers \"just know\" we don't get paid for all the hours we work, or that we had better be able to prove we are making the school a better place, or that my professional job is a semi-religious calling, or that we're probably being racist when we write referrals (implied, not explicitly said) because our data shows that in our 60/40 split white/minority school that white kids get less referrals (but still a large amount!). \n\nBe warned - the rest of this is a rant on the last point. \n\nOur school lines are drawn around an affluent neighborhood of mostly white kids, and a large swath of underprivileged neighborhoods of black and hispanic families. The poor white neighborhood in our district is on a line that is split with a neighboring school district, so our white student population is skewed to the well-off families, with two parent households, a stay-at-home parent, a lot of family support, and less behavior issues (I was honestly surprised, given this fact, that our white rate of referrals was as high as reported). I've also worked in a school district that was at least 90% white, mostly poor kids, and they had the same behavior issues, because most of it is a childhood trauma and poverty issue, NOT an issue of teachers wanting to write up the black and brown kids, or ignoring bad behavior of white kids. No teacher likes writing referrals, and everyone I know avoids it at all costs! But at a certain point, you have to remove the kid that is keeping everyone else from learning and causing a disruption, or cursing you out, or flat out refusing to follow a rule (for example, taking a video call in the middle of a class discussion and when told to put up the phone, talking louder, and telling the person on the other end how stupid the teacher is). \n\nIt is not our faculty's fault our school lines are drawn in a way that highlights the racial divides in our city, especially in the data related to behavior issues and grades. There are plenty of poor white kids who are friends with black and hispanic kids, but apparently they don't exist. Today I was told the white and black kids in my school don't associate with each other, despite seeing plenty of evidence with my own eyes to the contrary in my classes. The divide is mostly socioeconomic, and yes, many of the rich white kids aren't friends with the poor kids, many of whom are not white. However, plenty of them are friends with the middle class and wealthier minority students - I see them walking through the halls with linked arms every day! \n\nAll this to say, I don't trust the new principal, and I am concerned the district is going to actually make morale and the school culture worse by the way they are addressing racial issues in our school. It's one thing to remind teachers to be careful that they are not favoring or appearing to favor one racial group over another in discipline, in classroom cultural references, historical references, and to strive for equal representation, etc. It's another to ignore how racism over decades has shaped our community into socioeconomic and racial divides, and blame data that looks bad on teachers being racist.",
    "title": "New Principal Worries and a Rant",
    "subreddit": "Teachers",
    "timestamp": 1565655476,
    "score": 42,
    "keyword": "black principal"
  },
  {
    "text": "Have a meeting with the principal and a parent on Monday, how would you handle this? I got an email from my principal a couple of days ago saying a (grand)parent wants a meeting with myself and the principal over what's been going on in my class. They're concerned about how many worksheets I've been handing out and that I'm not actually teaching \n\nWhich, as a matter of fact, is true. I haven't been teaching because I haven't been able to. I work at one of the lowest/worst elementary schools in my state, chock full of every negative stereotype you can imagine: uninvolved parents? Check. Inept admin who don't reinforce consequences and just send kids back to class? Check. Lack of meaningful resources and support? You better believe it\n\nI actually did teach for most of the school year. My class was never \"good\", but by winter break they were definitely making progress in the right direction. Unfortunately, when we came back from break our admin decided I was doing a good job and transferred three behavior problems from other classes into my room. I still tried to teach, but it turned into a case of increasingly diminishing returns, and by March I found myself taking days off out of sheer anxiety for the first time in my career. Every day turned into the same thing: kids would focus or work for maybe five minutes, then arguments would start flaring up and all they would do is bicker and yell at each other. One of those transfers in particular seemed to find someone new to have a problem with every day, and it became clear pretty quickly that he was basically a black hole of negativity\n\nI've done everything I could. I've used incentives in my classroom. I've made phone calls home (over 200 this school year, more than all the other years I've taught combined). I've tried rearranging seats so certain kids were away from each other. I even reached out to my principal and one of our assistant principals and flat out told them that I'm struggling, it's taking a toll on my mental well-being, my class is unsustainable, and I'd appreciate any suggestions they could give me. Their response? Assistant principal: \"Well the whole school is struggling right now, so you just do whatever you need to do.\" Principal: \"I wish I could tell you.\" These were two separate meetings in two different weeks. My class only got worse after that, and then the same AP I met with had the gall to act like it was my fault, to the point where I went to the union and had them help me tell her to back off\n\nSo have I just been giving them endless worksheets over the past few weeks? Yes, I have. It keeps most of them busy, and those that aren't just decide to go to sleep, which doesn't bother me in the slightest. I'm exhausted and have absolutely no drive to teach anymore. I'm not going to wear myself out any more for a school (and district) that doesn't care for its teachers \n\nI'm not sure how to approach this meeting, to be honest. There are 16 days of the school year left. I've already got a job lined up for next year (in a different city as well). Our entire administrative team (principal and three assistant principals) is losing their jobs and being demoted at the end of this school year (did I mention they're incompetent?). Also worth mentioning is that all these copies were made using my own paper that I paid for (our school is constantly out of paper)\n\nI'd really love to come to this meeting and flat out tell them that this is what happens when you don't support your teachers and burn them out. Frankly, I'm not even sure what the point of this meeting is: we're at the end of the year, neither admin nor myself will be at the school next year, and this grandparent has been doing all of her student's homework anyways \n\nOf course, I could just also show up and invoke my right to remain silent lmao. I have no problem sitting there quiet and making it awkward for everyone else\n\nHow would you all approach this?\n\nEDIT: Forgot to mention, this same principal gave me an \"Excellent\" on my end of the year evaluation, for what that's worth",
    "title": "Have a meeting with the principal and a parent on Monday, how would you handle this?",
    "subreddit": "Teachers",
    "timestamp": 1556980280,
    "score": 26,
    "keyword": "black principal"
  },
  {
    "text": "This is why racial “jokes” are never okay \n\nLong post, bear with me.\n\nLast Thursday a 6th grader (white) went up to several classmates (black) and called them the n-word. Immediately of course, there was an uproar. The student claimed that in his Latin class they learned the names of the colors and that the word for the color black is “niger,” which is what he was referring to as a joke. Personally I don’t believe him, but regardless, the matter was dealt with and he was suspended for a day last Friday. His parents were very supportive and horrified that their son did this. The students he had said it to seemed alright after they talked it out with the principal. \n\nThe problem is that since then, we’ve had numerous race related issues pop up, which never seemed to be much of an issue before. Sure we have fist fights and arguments and such happen, but it always seemed to be normal teenage drama shit, not necessarily motivated specifically by race. \n\nExample 1: On Friday, a black male student in my homeroom (7th grade) shouted at a white girl and called her racist, and she screamed back at him that he was a jerk and was always running his mouth at her. In talking with them both, the boy claims that she was taunting him, claiming she was going to call him the n-word if he didn’t shut up. When I spoke with the girl, she claimed this was not true, and that he had referred to her as a “stupid white hoe.” \n\nExample 2: That same day, two black girls in my class were having a conversation in which I heard one of them say “I can’t believe that kid didn’t get expelled. This school hates black people.” (Many black students are outraged that the 6th grader who started this got “only” a suspension).\n\nExample 3: again on Friday, an 8th grader wore a shirt to school that said Black Lives Matter. The problem is this is a parochial school so we have a uniform. When he was told he had to change into his uniform, he said “so you think Black lives don’t matter?” And he repeated that all day.\n\nExample 4: in one of my 6th grade classes I’ve got two students who sit sort of near each other who tend to annoy one another. One is a black girl and the other is a white boy. Sometimes they bicker, just about stupid shit- like “stop tapping your foot, it’s *so annoying!!*” But the point is it’s always petty stuff that has nothing to do with race. It’s just kid stuff. And to be fair, the boy tends to annoy just about everyone no matter where he sits, and the girl argues with lots of other students too. Today they were arguing about the fact that the boy apparently found a pen on the ground earlier that day that the girl claimed was hers. One thing led to another and the girl shoved the boy, who shoved her back. It only happened once, I stepped in and shut it down, talked to each of them, and separated them. After that they were fine the rest of the class. At the end the girl even went up to him and apologized for starting it. I thought it was over, although I did plan to speak with both their parents just to alert them to what happened.\n\nAbout 5 minutes later as we’re switching classes, there’s a ton of kids in the hallway saying “did you hear? L & R got in a fist fight in class and are getting suspended!” I explained that was not what had happened at all, and that it had been already dealt with. But despite what I said, that version of events must have gotten around. Because after school my principal calls me in and asks what happened in class. I explained that it was a disagreement that led to shoving, but it was over with quickly and that I had dealt with it, and that the girl had apologized to her classmate. My principal sighs and shows me an email she had just received from a parent (not one of the students involved) who was berating her for allowing so much racially motivated violence and inappropriate language within the school. The parent also claimed that her daughter told her in my class two students got in a fist fight over race and punched each other in the face (not true), that I had done nothing to stop it (again not true), and that she wasn’t sure she felt comfortable sending her daughter somewhere where teachers hold no regard for black people. And she again references the situation last week and believes the student who said the n-word should have been expelled and not just suspended. \n\nAfter speaking with my principal, she said I handled it just fine and that she would deal with this mother.\n\nI’m just concerned that one incident (albeit a serious one) has opened up a whole can of worms. I feel that people are making everything out to be racially motivated when I don’t actually think that’s the case. Just because two students argue about something, it doesn’t mean one of them is racist. But because this happened, now all of a sudden everything is about race. It’s very frustrating and I worry that something larger is going to happen if this doesn’t get addressed.",
    "title": "This is why racial “jokes” are never okay",
    "subreddit": "Teachers",
    "timestamp": 1574135145,
    "score": 14,
    "keyword": "black principal"
  },
  {
    "text": "Student Loans: I'm over Sallie Mae, and this journey just started. Some financial advice This phone conversation I just had with Sallie Mae, put a whole battery in my back. My private loans automatically deduct from my account, and they came out yesterday. So, I got a check from my job to pay only to the principal of my student loan. So I call them this morning and was like, \"Hey just paid y'all yesterday evening but I need this second payment to only go towards my principle and my new bill statement just posted so I need to know that this payment went all towards my principle.\"  This woman never gives me a direct answer which got my anger boiling, and then double annoyed that they are asking me to pay this damn bill back to back just to avoid an interest payment. \n\n&#x200B;\n\nAnyways what I am really asking the financially savvy black ladies out there is about refinancing or consolidating private student loans. I'm barely keeping afloat with them at this point, and an absurb amount is going towards interest. I want to refinance them (even consolidate if possible, because 11% rates on 5 different loans is killer) but my debt to income ratio is too high. \n\nMy first question is can I consolidate my private student loans? \n\nHow do I check my debt to income ratio? Which is it go enough to refinance or consolidate a loan?\n\nDo you think refinancing a loan at 24 with no co-signer is possible? Cause I honestly don't have any co-signer as an option right now.\n\n&#x200B;\n\nside rant that is just me venting:\n\nI'm only two years into paying my private loans and they cost the payment of a home. Which annoys me to no end because I am living at home with my momma when I could afford a damn place with these loans. The first year, I was mad at myself for lacking the financial know how outside of my parents to keep myself out of this debt... but I'm past that now. I just don't know how to get myself ok outside of working 3 jobs and a side hustle.  I feel like every aspect of my day is consumed by money and it's got me depressed as hell.  Granted i'm only making 33k at this job and I just quit my part-time job. All my elders are like there 20s was the best time of there lives, but every time I try to enjoy myself I feel guilty that I am not trying to get out of this student loan debt, and this building credit card debt. \n\n&#x200B;\n\nHonestly, I just need a plan i'm sinking mentally and financially.",
    "title": "Student Loans: I'm over Sallie Mae, and this journey just started. Some financial advice",
    "subreddit": "blackladies",
    "timestamp": 1554471909,
    "score": 17,
    "keyword": "black principal"
  },
  {
    "text": "Being confused for other people of color? Hopefully this is an appropriate sub, and appropriate flair for this subject. I have a tendency to ramble, please forgive me\n\nI am biracial - half black and half white. I look black. Growing up I spent the majority of my time with white friends. White family members as well due to which parent I lived with. So I never really had anyone to bring up this subject to, but it's been heavy on my mind tonight and I would like to talk about it.\n\nAs a child in elementary and middle school I often experienced people who were white confusing me for other POC classmates even though the only things we had in common were similar skin tones and same hair color. It was never the normal mistake that sometimes happens like when you're meeting new people. It was people who had known me for a long time, like good friends, school principals, and classmates, and it was often a common occurrence, it never happened just once. As a child I never saw much of an issue but once I got older I began learning about how this seems to actually be a common issue between non-POC and POC, and that's when it all started to make sense.\n\nMy question for you guys is, have you ever dealt with things like this? How did you deal with it? How's it make you feel?\n\nIt makes me feel... embarrassed. Why? I don't know, I can't begin to explain why.. but it does.\n\nThank you, and apologies for the long post.",
    "title": "Being confused for other people of color?",
    "subreddit": "blackladies",
    "timestamp": 1569037822,
    "score": 12,
    "keyword": "black principal"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 508,
    "keyword": "black principal"
  },
  {
    "text": "Elite schools snub £1m gift for poor white boys https://www.thetimes.co.uk/edition/news/race-row-as-1m-gift-is-snubbed-by-elite-schools-winchester-dulwich-mhsr75d85\n\nTwo leading private schools have rejected scholarships of more than £1 million for poor white boys from a philanthropist for fear of breaching anti-discrimination laws.\n\nDulwich College and Winchester College turned down an offer from Professor Sir Bryan Thwaites, 96, to leave the funds in his will.\n\nSir Bryan, who attended both schools on scholarships, wanted white British boys from disadvantaged homes to benefit because they did worse at school than almost every other ethnic group. Studies have shown that they perform relatively poorly in exams and are less likely than their peers to attend university.\n\nStormzy, the rap star, established Cambridge University scholarships exclusively for black British students. The refusal of leading boys’ schools to allow financial help exclusively for white pupils has prompted a row about equality laws.\n\nSir Bryan said: “If Cambridge University can accept a much larger donation in support of black students, why cannot I do the same for underprivileged white British? Winchester said it would harm its reputation by accepting my bequest, but in my opinion it would gain enormously by being seen to address what is the severe national problem of the underperforming white cohort in schools.”\n\nTrevor Phillips, former chairman of the Equality and Human Rights Commission, said that well-known schools had turned down more than £1 million of financial help for white boys in recent months. He blamed a “lethal cocktail of inverted snobbery, racial victimhood and liberal guilt” for the reluctance to help white boys, whom he described as “today’s educational left-behinds”.\n\nHe said: “I doubt that I’ll ever work out why the British appear untroubled that so many of their children emerge from over a decade of expensive, compulsory education with scarcely more in the way of literacy and numeracy than the average Neanderthal.”\n\nWriting in the online magazine Standpoint, he continued: “On half a dozen occasions over the past five years I’ve been asked to advise on whether it is acceptable to offer bursaries or scholarships to one minority group or another. Invariably, I have said yes; but donors remain nervous, and beneficiary institutions are routinely discouraged by their lawyers.\n\n“I have no idea how many such generous offers have been turned down, but I do know that in recent months two well-known fee-paying schools have lost bequests totalling over £1 million that might have supported some of our most disadvantaged children for one reason: the donor, like Stormzy, wants his money to go to people of his own background — poor but talented white British boys.” Mr Phillips said that such a proposal was not racist and that the Equality Act of 2010 was not called the “Be Kind to Blacks Act”, adding: “In circumstances where the racial group that is disadvantaged is white, there should be no bar to doing for them exactly what we would do for so-called black and minority ethnic groups.”\n\nSir Bryan was principal of Westfield College, part of the University of London, for 17 years. He planned to bequeath £400,000 to Dulwich College in south London and £800,000 to Winchester College in Hampshire.\n\nHe attended Dulwich until the outbreak of the Second World War, when he was sent to Winchester. Scholarships paid for him to attend both institutions. He has long supported both schools and taught at Winchester, where he founded the School Mathematics Project that reached 80 per cent of schools by the early 1970s. Both schools are understood to have consulted widely with lawyers, trustees and charity experts before declining the bequest.\n\nUnder the Equality Act positive discrimination, where someone is given preferential treatment because they have a specific characteristic, is generally unlawful. However “positive action” is permitted for efforts aimed at encouraging someone to overcome a disadvantage attributed to their race or other protected characteristic.\n\nA spokesman for Winchester College said: “Acceptance of a bequest of this nature would neither be in the interests of the school as a charity nor the interests of those it aims to support through its work. Notwithstanding legal exceptions to the relevant legislation, the school does not see how discrimination on grounds of a boy’s colour could ever be compatible with its values.”\n\nA spokesman for Dulwich College said: “The community at Dulwich is proudly diverse, both socio-economically and ethnically, reflecting our location. Bursaries are an engine of social mobility and they should be available to all who pass our entrance examinations, irrespective of their background.”\n\nHow ‘positive action’ works The protected characteristics that enable “positive action” under the Equality Act 2010 are: age, disability, gender reassignment, pregnancy and maternity, race, religion or belief, sex and sexual orientation (Billy Kenber writes). A school or university offering a scholarship or bursary for a particular group of students must be able to demonstrate that the group being helped suffers a disadvantage because of their protected characteristic. These scholarships are lawful as long as they are also a proportionate means of overturning the disadvantage.\n\nhttps://i.imgur.com/oFI3I2V.png",
    "title": "Elite schools snub £1m gift for poor white boys",
    "subreddit": "MensRights",
    "timestamp": 1577705652,
    "score": 58,
    "keyword": "black principal"
  },
  {
    "text": "Feminists and Privilege of Exceptions  \n\nJuly 13 2019 (first posted on Wordpress in 2018, and on Tumblr this past June, flagged)\n\nI   came to the conclusion that women are currently negotiating   privileges  against fundamental rights (to the advantage of a minority  of   people)…and this is a disaster for anyone not falling in the  categories   of “Historically victimized people” as described by  ex-attorney general   Eric Holder. It concerns the modern feminist  culture of Empathy,   Emotionalism, Intelligence, Rights, Delusion…\n\n(Note:   I Originally wrote this article in late November 2017…I tried  to   publish it many times on my Wordpress account, it would not work. This   was on my original  blog dethinkxify.wordpress.com. I was finally able   to publish in March of 2018. But rapidly, hackers erased all the   Bibliography, which I had  to recreate. I hope this time around activist   hackers leave it alone.)\n\nThis is a comment I formulated after reading an article in  The Hill: “**Trump risks hypocrisy charges with Franken attack**” by  Jonathan Easley (November 18 2017):\n\nI   reprint here since my Wordpress accounts have never been indexed for   purely political reasons and my Tumblr it account is being continuously   flagged by feminists and is now restricted, which means blocked except   for being harrased by Tumblr feminist employees… [https://dethinkxify2.wordpress.com/2018/06/13/feminists-and-privilege-of-exceptions/ and ](https://t.umblr.com/redirect?z=https%3A%2F%2Fdethinkxify2.wordpress.com%2F2018%2F06%2F13%2Ffeminists-and-privilege-of-exceptions%2F&t=NjMyMmNhNjRiNDBmYzZkOTU4MzdjNzFmYzFkMDEzODRjZDA4YWNlZCxNNGh2MEFjeg%3D%3D&b=t%3A5u3nC0drLYPcMrUcuYL-eg&p=https%3A%2F%2Fdenyspicard.tumblr.com%2Fpost%2F185661395113%2Ffeminists-and-privilege-of-exceptions&m=0)[https://dethinkxify.wordpress.com/about/](https://t.umblr.com/redirect?z=https%3A%2F%2Fdethinkxify.wordpress.com%2Fabout%2F&t=OWIxZTk1ZWJjM2ZhODAxNDZmMzM0OTllYWY2ODhhYjcyYzQ4MjU3NyxNNGh2MEFjeg%3D%3D&b=t%3A5u3nC0drLYPcMrUcuYL-eg&p=https%3A%2F%2Fdenyspicard.tumblr.com%2Fpost%2F185661395113%2Ffeminists-and-privilege-of-exceptions&m=0)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**“…Trump…Called a Hypocrite…**”. **Who cares by now?**\n\nOur   whole leadership,  including the press, are a bunch of hypocrites by   refusing to include  regular folks in the reality of power discussions.   Power discussions  which concern future fundamental rights of men. But   around the table  sits Feminists, DC politicians, Main Stream Media,   some Power Elites…and  they prepare, again, to decide our diminishing   fates with one-sided  bias unconstitutional legislation. We are   witnessing a battle for fake  righteousness, with your regular insincere   feminists at the front line of this “mobbish” crowd. The first debate   we need to have is: When will  women and feminists stop using sexual   misconduct allegations as an  extortion/coercion tool? When?\n\nNot   yet, obviously…because the inherent conflict of interest here in    seeking the truth lies with an establishment of males (alpha males, bad    expression, but I will clarify) being rewarded for continuously ceding    status, rights, freedoms, liberties of regular males (beta males,  idem   as previously) of the middle and lower class…in exchange for  getting   bigger pay checks.\n\nIt is by  no chance  that for the past 30 years, the Establishment, and  women of  all income  groups, have seen persistent gains in their  incomes, while  middle class  and lower class men have seen an imploding  of their  purchasing power.\n\nThe  Main Stream  Media is so toxic…so hypocrite and so uneducated.  Their  only tool for  convincing the audience of their project for which  women  are already  sold, is the same old Emotional and Affective Empathy   Propaganda where  if you have “any sense of decency, you should be crying   and repenting  for all the horrible crimes men have committed against   women for  centuries..”. Yes, make me  laugh…\n\nThe   scientific truth is very different according to social science.  Women   are bullies too, they abuse their power, they are violent  being…and   when the task is too big, they delegate the dirty physical job  to their   close allied thugs.\n\nOffice work place   is a competitive landscape. Yet women want to  impose rules which will   have the effect of constraining men in not being  able to use   competitive tools and skill in which they outperform.\n\nPauhlus   and Williamson (2002) cornered a theory of  personalities  which   compose people of leadership, men and women alike. This theory is    called the Dark Triad of Personality Traits. These specific traits are    sub-clinical Narcissism, Psychopathy and Machiavelism. These were, and    still are, somewhat taboo traits, so much so that even the scientific    literature fails to often understand the basic premise of the theory.    The theory stands because of the interdependent nature of these 3    traits, while much of the literature feeding on this theory still    analyses circumstances using these traits independently.\n\nAs   independent traits, nothing  is novel in understanding that  someone   showing a high score in one of these trait may be disagreeable,  have   shortcomings, be manipulative, etc…The Novelity of Pauhlus and    Williamson was in describing these traits as interrelated.\n\nWith   this, the authors also demonstrated a surprising observation,  that   people with leadership features scored higher, on average, in all 3    traits simultaneously. Which means that on average each of these traits    where higher than the average observed in a control sample. This was    puzzling indeed, because these traits had mostly been put on the margin    by institutions of morality, such as monotheism; and  could hardly be    accepted as being the corner-stone of leadership. Yet, 15 years  later,   it appears that the theory stands solid, and dominant  characters (which   the alpha epithet only briefly captures) score  higher, on average, than   controls on the Traits of Narcissism,  Psychopathy and Machiavelism   simultaneouly.\n\nOrganizational   hierarchies have been analyzed, been tested, with this  filter, and it   was observed that, effectively, the further you climb up  the latter  of  authority, the higher you score on The Dark Triad Traits  on  average.\n\nSince  these trait are  associated with many negative behaviors, such  as  vanity,  self-promotion, callousness, cruelty, dishonesty,  manipulation,  etc…it  came as quite a shock.\n\nBut even  more  interesting, is the fact that people high on Dark Triad  traits  score  low on Emotional Empathy (Emotional or Affective Empathy  are the  same  thing). And further, Dark Triad Traits have no correlation  with   Intelligence as captured by Intellectual Quotient (IQ).\n\n**Which implies that dominant people need not have great IQs; and high IQs are not synonym of dominant personalities…**\n\nSurprisingly,   leadership requires credibility, since it is expressed  in a social   context; therefore, social performance is of importance.   Social   Performance may be measured by a combination of Cognitive  intellectual   skills, and Personality Traits. Personality traits are  observed  through  performance of Emotional and Social skills.\n\n(I   am abstaining, here, of using the expression Emotional  Intelligence,   because it is an inappropriate terminology. Emotional  performance is   part of the personality trait domain. The difficulty of,  and inadequate   terminology,  in cornering a theory of Emotional  Intelligence has had   for result of creating an overly diversified  incomplete curriculum on   the subject with excessive feminist traps  (matriarchal and   communautarist propositions) and shortcomings. One of  the principal   trap is that of putting Agreeableness as a corner-stone of  the theory.)\n\nNow,   for great leaders to persist and be appreciated, or feared, the  Dark   Triad must be tempered and modulated by other factors. True, yet    definitive consensus has not been reached in this dimension.\n\nNow,   within the inventory of survival tools of evolved mammals, there  is   such a thing as Empathy. Its been the subject of much scientific    research in the past 25 years, has been vulgarized, promoted but    nevertheless still largely badly understood.\n\n**Empathy must be understood as a genetically rooted endocrine reflex**. It has evolved over millions of years and is a very sophisticated mechanism.\n\nBut   first, lets distinguish between two distinct forms of Empathy:    Cognitive and Emotional (Affective) Empathy. While Emotional empathy has    been largely described scientifically, cognitive empathy appears to    suffer from a misunderstanding, and this may be due to the “empathy”    epithet attached to it. Let the scientist describe both phenomenon: ” **Purely cognitive empathy**,    also referred to as perspective taking, mentalizing, or Theory of   Mind,  concerns the capacity to comprehend the viewpoint and/or state of    knowledge of another individual, even if this differs from one’s own.  **Emotional empathy**    concerns the emotional reactions of one individual to the observed    experiences of another. Emotional empathy is a multifaceted and    multilayered phenomenon which ranges from relatively simple processes    such as emotional matching behaviour to more complex events which    involve interaction between emotional and cognitive perspective taking    systems.” (JL Edgar et al., 2012)\n\n“Over   millions of years of evolution, efficient and manifold   neurobiological  mechanisms have evolved for differentiating hostile  from  hospitable  stimuli and for organizing adaptive responses to these   stimuli (Decety,  2010). This integrated set of neural systems is   genetically hardwired  to enable animals to evaluate and readily respond   to threatening or  nurturing, unpleasant or pleasant, appetitive or   aversive stimuli using  specific response patterns that are most  adaptive  to the particular  species and environmental condition.”  Decety and Svetlova (2012):\n\nBoth   systems are believed to be widely presents in mammals and are  related   to the complexity of organization which a family structure  creates   within life organism. In this context, males usually outperform  females   in cognitive empathy and females outperform males in emotional    empathy. A parenthesis: – language is believed to be intimately tied to    emotional empathy. And “baby-talk” (motherese, scientific term) is a    universal language, it is present everywhere in the “human” kingdom. **Motherese    communicates in a manner where emotions are tuned with pitch, rhythm   and  tone instead of there usual evolved accent structure**. In    motherese, what is communicated is not the significance of the word    directly, but the effort to create a future association in the child’s    brain, and this using one of the best learning tools possible,    repetition. Children respond innately to pitch and tone. In the    primitive man, language was mostly thought by the female…this is one    skill where emotional performance was a competitive advantage. Further,    this “Motherese” interaction is also responsible for developing the    spectrum of emotion in the infant. **Emotions need learning and training**,    and biologically, the differentiation or specialization of sex    re-leagued this role to females. This is why the female brain is    preferentially wired, the connectome structure, for emotional empathy    (Ingalhalikar et al., 2014).\n\n**But   recent changes in family organization tends to delegate  emotional   training in children to the pharmaceutical industry, school  “law   enforcement” and the internet, including video games…**\n\nLiving creatures whom can express the hormones linked to the reflex of emotional empathy have higher tone.\n\n“Oscillations   of delta, theta, and alpha ranges could be found in  all vertebrates   but there is an important distinction between reptiles,  lower mammals   and humans in what frequency dominates in the scalp EEG. **Alpha is the dominant frequency in adult humans**,    while theta dominates in the EEG of lower mammals (Sainsbury, 1998)   and  delta in the reptilian EEG (Gaztelu et al., 1991; Gonzalez et al.,    1999).”\n\nAs  brain wave oscillations  of the Beta frequency are highly active in   mammals, they are very low  in reptilian. Langard et al. (2006)   explains, concerning an empathic  test on mice: ‘”our findings are   consistent with the perception-action  model of empathy proposed by   Preston and de Waal (1), both in the  automatic priming of somatic   responses in a state similar to that of  the attended object and in the   modulating effects of familiarity and  similarity of experience between   subject and object.” as observed  under the following conditions: “…Mice   tested in dyads and given an  identical noxious stimulus displayed   increased pain behaviors with  statistically greater co-occurrence,   effects dependent on visual  observation. When familiar mice were given   noxious stimuli of  different intensities, their pain behavior  was  influenced by their  neighbor’s status bidirectionally. Finally,   observation of a cage-mate  in pain altered pain sensitivity of an   entirely different modality,  suggesting that nociceptive mechanisms  in  general are sensitized.”\n\nThis  was a  step forward in debunking the pretentious belief that only   humans,  being God’s masterpiece according to Christians, had Empathy.   And  contrary to popular belief, Empathy is not a moral construct, but a    biological survival reflex. In the fight or flight behavioral choice,    cognitive empathy is the first mechanism to be neuro-alerted. It  quickly   determines if a new set of information possess a **threat or opportunity** (e.g. for food) or necessitates an action of **protection or collaboration**. It then either, respectively switches to either the cruel, sadistic, aggressive spectrum, or to the Emotional Empathy reflex.\n\n**A problem with the recent societal culture of feminism**,    the current “cultural revolution”, is the risky proposition of   offering  overly redundant experiences of Emotional Empathy to the   general  population through tools such as News Television media, where   the  audience is being continuously taxed along Emotional Reflexes, so   as to  effect Mass Emotional Empathy Training…it is destructive to the   balance  of the brain, it creates a state, which psychologists refer to   as “**heightened emotional instability**”.\n\nWe are switching from a Cognitive IQ based civilization to an Emotional driven civilization.\n\nYet,   abuse of the affective spectrum is very useful as a strategy of  mind   control. It is a preferred tool of female leadership, females whom    outperforms males in the Emotional and Narcissistic spectrum. In a    context of competition between women, a status challenge, women will    rarely confront. Competition potential outcomes are usually quickly    determined on site, and interaction avoided with females most often    surrendering to the dominant female. Then, consensus is created by a    repertoire of mimicry, which is related to emotionalism, mimicry,    emotional empathy.\n\nWomen’s “status seeking competitive strategies” are mainly, according to *Joyce F Benenson (2013)* : “*From    early childhood onward, girls compete using strategies that minimize    the risk of retaliation and reduce the strength of other girls. Girls’    competitive strategies include avoiding direct interference with  another   girl’s goals, disguising competition, competing overtly only  from a   position of high status in the community, enforcing equality  within the   female community and socially excluding other girls*.”\n\nFurther, *Tracy Vaillancourt (2013)*: “*Indirect   aggression includes  behaviours such as criticizing a competitor’s   appearance, spreading  rumours about a person’s sexual behaviour and   social exclusion. Human  females have a particular proclivity for using   indirect aggression,  which is typically directed at other females,   especially attractive and  sexually available females, in the context of   intrasexual competition  for mates. Indirect aggression is an  effective  intrasexual competition  strategy. It is associated with a  diminished  willingness to compete on  the part of victims and with  greater dating  and sexual behaviour among  those who perpetrate the  aggression*.”\n\nAs for the kind of aggression women of higher sub-clinical  psychopathic intensity such as females in positions of authority, *Ana  Seara-Cardoso, Helene Dolberg, Craig Neumann, Jonathan P. Roiser, Essi  Viding (2013)* propose: \"*Research   so far indicates that emotional and  personality correlates of   psychopathy such as glibness, grandiosity,  lack of empathic concern are   akin across genders, but similarities in  behavioral correlates, such   as criminal behavior and type of aggression,  seem to be less  consistent  (see Verona & Vitale, 2006, for a  review). It has been  suggested  that differences found across genders are  mainly  differential  expressions of the same underlying construct  (Nicholls  & Petrila,  2005), and that the same personality traits may  confer  risk for  different forms of behavior for women versus men  (Verona,  Sprague,  & Javdani, 2012)\"*.\n\nPsychology   has created two  main sub-groups of psychopaths, those which are   characterized as  operating Instrumental Violence (Group 1) and those   whom uses Reactive  Violence (Group 2). Instrumental violence is   manipulative and indirect,  while reactive violence is obviously direct   and confrontational.\n\n**Women score higher at instrumental violence than men.**\n\nAnd, need I remind, **people in positions of authority**, dominant characters, both females and males, **score higher than average on The Dark Triad traits of personality.**\n\nNeed   I recall the reader of the Center for Disease Control (CDC)  analysis,   whose own data, determined, against popular beliefs, that  women are   violent in partner relationships, and that they are more  often, than   men, the first instigators of physical aggravated assault  against their   partner. That female bisexual persons are more violent in  partner   relationships than either heterosexual, or exclusively  homosexual, men.\n\n**Against   the backdrop of the Main Stream Media and Washington DC  attempting to   portray females as inoffensive, peaceful, loving caring  beings   incapable of violence and never competitive but only  cooperative…It   should be difficult to ignore that the last few  paragraphs, based on   scientific literature, may bring down the  Leadership proposed   Em-pathetically forcefully induced naive conception  of women as   innocent beings in need of persistent protection…**\n\nfor   Feminists who pretend they want to destroy the condescending  values  of  Patriarchy, it appears a Paradox to call for laws of exception  for   their sex all the time.\n\nLastly, one   must make himself familiar, if at least it has not  already intuitively   been understood, that all status dominance challenge  carry sexual   connotations, or undertones, as indirect as they may be.  Dominance in   human relationships always has a sexual  dominance/submission   dimension…if this point is neglected in  decision-making and analysis of   the workplace environment, it is a great  mistake.\n\nAre   all women leaders monsters? No, of course not. But nor are all  men   leaders. But Feminist (as a socio-political proposition) leadership  is   Toxic. And what about regular male employees who score average on    psychological traits of the Dark Triad, males who don’t carry above    normal dominant features but can be very competent in their field, are    they also ALL monsters? So why address the problem of harassment,    aggression in the office/work place as a prevalent and “male only”    initiated model.\n\n**Surprisingly,   in reality, meaning out of the scope of the  fictional construct of   women on TV and other media, women are attracted  preferably to men who   are both more narcissistic and more dishonest than  average…this is  true  when they either seek a mate, or someone to  associate for other   endeavors, such as business associations. Narcissism  and dishonesty are   characteristics where leaders, men and women,  outperform the general   population.**\n\n**This   should assist in anticipating that the office will  continue to have   male leaders, or women leaders, who score high on the  Dark Triad   Traits. What are women teaching these latest generation of  men   leaders…how to better camouflage their personality traits. In the    highly competitive field of finance, both women and men with strong    dominant personality profiles excelled in deception during the 2000    decade of real estate and financial debacle.**\n\n**Therefore,   in the Emotional Empathy Training movements they  are two distinct yet   complementary routes: one has as its principal goal  to modify not the   essence of male competitiveness, with its core in  psychopathy, in  terms  of callousness, or glibness, etc…but to modify the  appearance of  this  trait by expressing it in a more feminine way,  meaning  indirectly. This  is easy, since people with higher  Emotional/social  skills are better  actors…that is they can more easily  fake emotions.  So, in fact, these  are just acting classes, which the new  generation  of male leaders are  happy to participate in. Secondly, for  non-leader  males, the somewhat  “beta” non-dominant profile males,  Emotional  Empathy Training is simply  classes in total submissiveness,  where  anything which could be  disagreeably perceived by any women, in or  out  of context, must be  censured so “beta” females can increase their   level of abusive  narcissistic delusional elation and over-confidence in   the work place.**\n\nBecause   feminists are not revolutionaries, as they often promote  themselves,   but encrusted in the leadership, and submit to authority  more easily   then men,…they are the best tool for the upper class,  establishment and   leadership to maintain and consolidate their position  of hegemony.\n\nBecause   I, for one, know very well that the current spectacle is of  the same   infected breed as that of “Hate laws”…where, in this case, the  target   of constraining behavioral laws that will be abusive will not  really  be  aimed at the high hierarchical individuals who could abuse  their   power, but the regular male employee who has never bothered  anyone, but   will now be obligated to demonstrate absolute submissiveness  to the   Office PC Police…that is the reality, this is what awaits us,  yet   again.\n\nParadoxically, women in the   hierarchy will often tolerate sexual  misconduct in the office from   dominant males in the organization as long  as it benefits them and the   organization…even if there is an innocent  victim (male or female),  call  it collateral damage, once in a while…that  is the “pragmatism” of   female leadership…as is Feminist Mob Justice.\n\nAnd, incredibly, in this whole discourse, not one bit of attention was given to **women aggressors**,    whether their victims were males or females…yes, incredible. But it’s    not the first time that the Main Stream Media and Washington DC  betrays   us males.\n\nAll of you should  read the  Canadian Judge’s ruling in a recent  Canadian case, COURT FILE  No.:  Toronto 4817 998 15-75006437 : Her  Majesty The Queen Vs Jian  Ghomeshi.  In front of the worst of  accusations, Ghomeshi was hanged in  public,  with women newscasters  vomiting righteousness over Canadian  Television  programming for hours on  end. Yet, the conclusion of the  Trial judge  was that, in the end, the  witnesses had no credibility.  Yet, feminists  went on saying it was again  an injustice and they stood  by for all the  “women victims of male  sexual violence…”. In the  debate of sexual  misconduct, feminists have  lost all credibility, and  no one in our  leadership is making any  intelligent contribution in  this exchange  either. Women have to start  understanding who they  really are, and how  they evolve in social  contexts; **male   leadership has to stop trying to please feminists  by surrendering   fundamental rights of men and spoiling women with  unjust legislation,   and financial bubbles, bias against men**.\n\nIn   Canada, the justice system was demonstrated, by a scientific   research,  to show a 98% positive bias towards women (a sample of   research had a  window of 65 to 98% bias towards women), yet, to   feminists, this is not  enough, they want more for women…What does this   tell you in terms of  genetically rooted delusional intensity, of   psychological balance, in  terms of judgement and fairness of women…\n\nIn   the current political “debate” over the allegations of sexual    “misconduct” of a Federal Senate seat, the most zealous critics have    expressed that “…the allegations alone are serious enough that the    Candidate should never be allowed to be a servant of the “People”…”…This    is the new Feminist Mob Justice at its best…is this where  President   Trump wants to lead us?…satisfy feminists so he can get all  the  goodies  he wants, like his irresponsible tax bill, passed?\n\nLaws   meant to castrate men who have done nothing wrong, and won’t, by    incompetent, unconstitutional laws that will regulate work place    dynamics with a 100% positive bias towards women, because, in some    cases, some men have acted irresponsibly, or sometimes  illegally,   abused their power. What about women? They never commit  aggression,   they never abuse their power, they never bully in a work  environment…? I   am sure of that, as they are no female pedophiles, I  guess, and no   maternal infanticides, and no Female pimps, rapists,  criminal   offenders…no women involved in child pornography rings…No, not  in our   world…Not in America, Not in the great insightful eyes of the  Main   Stream Media…women are all “Good, naive and innocent…and need Super    Males, Super Cops, to protect them…”.\n\n>*Once   in a while, one comes across a  small jewel in Academia, and if  Paulhus  and Williams work is Monumental,  Isabelle Engeler and Priya  Raghubir  piece in the Journal of Personality  and Social Psychology: Do  men  Overestimate or Women under-report Their  Sexual Intentions?  (2017) is a  must, and unavoidable if one has the  ambition to reform  the workplace.  It will help understand  miscommunications,  mis-signalling, miscues and  mis-interpretation  between the sexes in  the context of workplace  sexual misconduct and  sexual interpersonal  interactions. This text  unveils some core  mechanisms and informs  anyone with the goal to modify  the work  environment in a manner fair  to all.The text comes to the  conclusion,  amongst other observations,  that under their testing  conditions, that  both men and women  underreport their own sexual  intentions, that men  overestimate women’s  sexual intentions and women  underestimate men’s  sexual  intentions…this alone is enough to warrant  work place “reformers”   attention. Is this due to delusional mechanisms,  social desirability   bias, or brain structures misaligned communication  features…the door is   open. But, in this context, an intelligent  behaviour is not blaming  the  other party for misgivings and  shortcomings, finger pointing and  all;  but rather trying to understand  more deeply what could be at the  source  of frequent “misfiring” social  performance, since in ideal  world,  communication should have no  frictional bias.Let’s make a short  example, without  blaming one party  over the other, without pushing  responsibility on one  side more than on  the other.Two co-workers, one  man and one  woman, are sent on a project  abroad. They only know each  other  superficially, have not had the  opportunity to really work  together  except for short group meetings,  etc…they know each other  from a  distance, but have had an effect on  each other. He has found he   appealing, intelligent , witty, etc…she has  found he presents himself   well, looks serious, responsible, dedicated,  maybe ambitious, but in a   good way.Now, during their travel, one night   after work, to  celebrate their on-going business success, which got  them  to develop  quickly a good complicity, trusty relationship, they  are  efficient and  complementary. They decide to go to a nice restaurant  with  a very  relaxed atmosphere, a beautiful terrace with a beautiful  view,  they  drink a little bit, and she starts to confide on her  personal life.   She is more telling than inquisitive, already knows he  is single, while   she is married. She believe this guy is a great  candidate for a   business friendship. She starts to elaborate about her  own marriage   difficulties, though she doesn’t have children yet, the  discussion   starts with humour and slips in more confident terms…and  then “woops”,  out  of nowhere, in a moment of laughter, she confides she  has not had  sex  with her husband for two months… That something is not  going right  with  her husband. Her only intention is to have a good  hearing ear,  to relax  and this guy looks trustworthy, etc…But he may  well interpret  this  intimate comment as something else, especially  since he did find  her  attractive.And now, let’s imagine, that when   they leave the  restaurant, she helps him put his coat on, and as he   slips his arms  into the sleeves, she gives him a warm and affectionate   tap on the  arms while she is behind him. Nothing more…just a sign she   feels good,  relax…Yet, they have drank a bit , he feels good also, and   has liked  his evening, is being increasingly seduced by this women, who   has done  nothing else but treat him as a friend…They go to the hotel,   and  doing so, they go on talking, confiding…and she increasingly looks   at  him in the eyes, as to get affirmation of their new found complicity,    their new friendship, she feels she has established trust. Then, at  the   door of her room, they go on talking a bit…and as they get ready to   go  there on way, to say goodnight, he just gets closer and kiss her on   the  mouth. Then the nightmare begins, she freezes, is shocked,   surprised,  says nothing…gets into her room, closes the door and   suddenly feels  betrayed…READ THE ARTICLE.*\n\nThe   work place backlash, which also affects negatively a majority of  men,   and creates negative spillover’s over all of society is principally   due  to “Emotional Intelligence”, an inadequate scientific theory with    misleading terminology, has been increasingly and dominantly used as  the   main hiring candidate criteria for employment. While this may  create a   more “Agreeable” work environment for women, it is at the  source of   increasing fraudulent and toxic activity and behavior in the  workplace.\n\nHere, take the time to read : “**Will get fooled again: Emotionally intelligent people are easily duped by high-stakes deceivers**”; by Alysha Baker, Leanne ten Brinke and Stephen Porter (2012);Legal and Criminological Psychology.\n\nThe   most intriguing conclusion of this work, is that people with  Higher   Emotional/social skills as captured by an Social Ability  psychological   test have demonstrated a very poor capacity to detect  deceit, yet have  a  greater ability to deceive…Most feminists would  either refute this   scientific affirmation, and others may call it a  paradox; yet when one   knows women, this makes perfect sense, it is  self-evident. May I  remind  you, if you suffer from some kind of  personality trait naiveté,  that  women, on average, score higher than men  in Emotional  skill/ability.\n\nYou  want to really talk  about these matters, I am up to the  challenge. You  want to get  ready…go to social science class, but avoid  anything which  is written  by either a female or male feminist, because  it is not  science, nor is  the theory of Emotional intelligence. **Read    about status seeking, psychological personality traits (especially  the   work of L. Paulhus: The Dark Triad Traits, The Dark Tetrad Traits)**.    Debunk the Emotional Intelligence crap. Emotions are an endocrine    evolution system. They give tone to actions and metabolisms. They are    tied to personality traits. They do affect performance, and some people    do show greater skills at controlling, moderating, utilizing their own    emotions and those of others, but this is a skill, it is not    intelligence. Performance is the result of a set of Intellectual factors    captured by IQ and emotional and social skills captured by  personality   traits. Strong leaders are characterized by high  performance in taboo   personality traits such as sub-clinical  Narcissism, Psychopathy,   Machiavelism and even Sadism…leaders, male  and female alike, have a good   look at yourselves in the mirror before  climbing on the moral   bandwagon! Debunk this view that women are  always victims and men always   predators…it’s the biggest of lies…**stop being retarded**.\n\nAnd   don’t pass corrupted unjust new laws (to manage the work space) for a    subject your delusional reflexes prevents you from understanding at  all,  but  your political ambitions guides you to.\n\nBibliography :\n\n**The Dark Triad of personality: Narcissism, Machiavellianism, and  psychopathy**; Delroy L. Paulhus \\* and Kevin M. Williams – Journal of  Research in Personality (2002)\n\n**The Dark Triad of Personality: A 10  Year Review**;   Adrian Furnham1, Steven C. Richards, and Delroy L.  Paulhus; Social  and  Personality Psychology Compass 7/3 (2013): 199–216,   10.1111/spc3.12018\n\n**Hippocampal Theta: a Sensory-inhibition Theory  of Function**; Neuroscience & Biobehavioral Reviews, Vol: 22, Issue:  2, Page: 237-241; (1998) Robert S. Saisbury\n\n**Motivation, emotion,  and their inhibitory control mirrored in brain oscillations**; Gennady G.  Knyazev –  Neuroscience and Behavioral Reviews (2006)\n\n**EEG delta  oscillations as a correlate of basic homeostatic and motivational  processes**; Gennady G. Knyazev – Neuroscience and Behavioral Reviews,  (2011)\n\n**Social Desirability Bias: A Neglected Aspect of Validity  Testing**; Maryon F. King and Gordon C. Bruner; Psychology & Marketing  Vol. 17(2):79–103 (February 2000)\n\n**Staying alive: Evolution,  culture, and women’s intrasexual aggression**; Anne Campbell, BEHAVIORAL  AND BRAIN SCIENCES (1999) 22, 203–252\n\n**Status-Driven Risk Taking:  Another “Dark” Personality?**;   Beth A. Visser, Julie A. Pozzebon and  Andrea M. Reina-Tamayo;  Canadian  Journal of Behavioural Science / Revue  canadienne des  sciences du  comportement; (2014), Vol. 46, No. 4, 485–496\n\n**Minimization  of Male Suffering: Social Perception of Victims and Perpetrators of  Opposite-Sex Sexual Coercion**; Sexuality Research and Social Policy, Anna  Magda Studzinska1,2 & Denis Hilton (2016)\n\n**Emotional  intelligence, Machiavellianism and emotional manipulation: Does EI have a  dark side?**; Elizabeth J. Austin, Daniel Farrelly , Carolyn Black, Helen  Moore; Personal and Individual Differences (2007)\n\n**The Fight for  the Alpha Position: Channeling Status Competition in Organisation**s; by  C. H. LOCH, M. YAZIJI and C. LANGEN (2000), INSEAD R&D\n\n**The  affective and cognitive empathic nature of the dark triad of  personality**, Michael Wai & Niko Tiliopoulos; Personality and  Individual Differences (2012)\n\n**A meta-analytic review of the Dark  Triad–intelligence connection**; Ernest H. O’Boyle, Donelson Forsyth,  George C. Banks, Paul A. Story; Journal of Research in Personality  (2013)\n\n**The Dark Triad of personality and unethical behavior at  different times of day**;   Karolin Roeser, Victoria E. McGregor, Sophia  Stegmaier, Johanna   Mathew, Andrea Kübler & Adrian Meule; Personality  and Individual   Differences (2016)\n\n**Different routes to limited  empathy in the sexes: Examining the links between the Dark Triad and  empathy**; Peter K. Jonason, Minna Lyons, Emily J. Bethell & Rahael  Ross; Personality and Individual Differences (2013)\n\n**The Dark Triad  at work: How toxic employees get their way**; Peter K. Jonason, Sarah  Slomski & Jamie Partyka; Personality and Individual Differences  (2012)\n\n**Will get fooled again: Emotionally intelligent people are  easily duped by high-stakes deceivers**; by Alysha Baker, Leanne ten  Brinke and Stephen Porter; (2012) Legal and Criminological Psychology\n\n**Do  human females use aggression as an intrasexual competition strategy?** ;  Tracy Vaillancourt; Philosopic Transactions of the British Society B  (2013)\n\n**Empathy, morality and psychopathic traits in women**   ; Ana  Seara-Cardoso, Helene Dolberg, Craig Neumann, Jonathan P.   Roiser, Essi  Viding;  Personality and Individual Differences, 55 (3)   pp. 328-333  (2013)\n\n**Psychopathy in Women: Assessment, Manifestations, and Etiology**;   Verona,  E., & Vitale, J. ;  (2006) – In C. J. Patrick (Ed.),   Handbook of  psychopath (pp. 415-436). New York, NY, US: Guilford Press        Gender and psychopathy: an overview of important issues and   introduction  to the special issue ; Nicholls, T. L. and Petrila, J. ;   (2005),   Behavioral Science and the Law, 23: 729-741\n\n**Gender   and factor-level interactions in psychopathy:  Implications for   self-directed violence risk and borderline personality  disorder   symptoms** ;By Verona, Edelyn,Sprague, Jenessa,Javdani, Shabnam;    Personality Disorders: Theory, Research, and Treatment, Vol 3(3), Jul    (2012), 247-262\n\n**Putting together phylogenetic and ontogenetic perspectives on empathy**   ;  Jean Decetya & Margarita Svetlova; Developmental Cognitive    Neuroscience (2012)  The neuroevolution of empathy ; Jean Decety ; The   Annals of the New York  Academy of Sciences (2011)\n\n**Different routes to limited empathy in the sexes: Examining the links  between the Dark Triad and empathy** ; Peter K. Jonason, Minna Lyons ,  Emily J. Bethell & Rahael Ross;\n\n**Personal   and Individual Differences (2013)  Towards a neuroscience of empathy:   Ontogeny, phylogeny, brain  mechanisms, context and psychopathology** ; Cristina Gonzalez-Liencres, Simone G.  Shamay-Tsooryc, Martin Brünea; Neuroscience and Behavioral Science  (2013)\n\n**Two   systems for  empathy: a double dissociation between emotional and   cognitive empathy  in inferior frontal gyrus versus ventromedial   prefrontal lesions** ;  Simone G. Shamay-Tsoory, Judith Aharon-Peretz and Daniella Perry ; Brain  – A Journal of Neurology (2009)\n\n**No Evidence for Emotional Empathy  in Chickens Observing Familiar Adult Conspecifics**   ; Joanne L. Edgar,  Elizabeth S. Paul, Lauren Harris, Sarah Penturn   & Christine J. Nicol  ; PLoS ONE (2012) 7(2): e31542.   doi:10.1371/journal.pone.0031542\n\n**Sex differences in the structural connectome of the human brain**;   Madhura  Ingalhalikara, Alex Smitha, Drew Parkera, Theodore D.   Satterthwaiteb,  Mark A. Elliottc, Kosha Ruparelb, Hakon Hakonarsond,   Raquel E. Gurb,  Ruben C. Gurb, and Ragini Vermaa; PNAS (2014)",
    "title": "Feminists and Privilege of Exceptions",
    "subreddit": "MensRights",
    "timestamp": 1563011322,
    "score": 50,
    "keyword": "black principal"
  },
  {
    "text": "In regards to the boy committing suicide due to being bullied, and no one stopping him, it reminded me of something else. On Netflix there is a new show called Mr.Iglesias, Staring Gabriel “Fluffy” Iglesias, the show is a bout him being a teacher at a school in Southern California. Now while the show overall I’d say is pretty good in episode 5, one of the student characters, Lorenzo, is believed to be being bullied, Gabriel, and a few other teachers, go to try and intervene when they find out that the bully in question is a girl named Rita Perez. At first they are confused as to what to do in this situation, but they do the right thing and report her to the principal, Paula, both Paula and Lorenzo are black, this becomes important later. When they first say Lorenzo is being bullied Paula starts saying how “bows with too much testosterone are a pain” and asks who the bully is, when Paula finds out that the bully in question was a girl she opts into doing absolutely nothing, that is until Gabriel mentions Rita saying the word, negrito, which, according to the show, means little blacky, she then decided to suspend Rita but not be cause Lorenzo as a man was being bullied, but because she said a single word that ticked Paula off. Lather it turns out that Rita, and Lorenzo like each other, which somehow makes all of the bullying okay. Lorenzo explains everything before Rita gets suspended and they go about their lives. This episode ticked me off, however I didn’t really know how to put it into words why. Now, after seeing the story of the boy committing suicide, I understand this ticks me off because the show shares the message that bullying/abusing your male partner as a sign of affection is okay. Which I, and I can imagine a lot of you, strongly disagree to. I don’t blame fluffy he probably was just hired to do the show and was mostly Netflix doing this, but other than that the show was great, and is definitely worth a watch.",
    "title": "In regards to the boy committing suicide due to being bullied, and no one stopping him, it reminded me of something else.",
    "subreddit": "MensRights",
    "timestamp": 1563465782,
    "score": 13,
    "keyword": "black principal"
  }
]