[
  {
    "text": "Uh oh. Dream job turned toxic Hi all, \n\nI’ve been in my current role for about six months now (cardiac clinic manager, 60staff, 2 sites). I relocated for this awesome opportunity and had nothing but positive interactions during interview/recruiting process (and have a family friend that works for boss, lots of good info). \n\nI started off with a large number of improvement  projects (as planned during interview, one of main reasons I believed I was hired) - LEAN/PMI related work, implemented data/analytics tools that hadn’t existed previously.  Things were looking good!\n\nUnfortunately, there had been a number of prior HR cases (started before me) that were not necessarily handled well (poor/no documentation in a union environment) as well as a number of toxic staff issues. So far, we’ve had almost 8 staff depart in the short period of time I’ve been here, all seeming to relate to extensive culture issues..not just the recent surge  of staffing mobility due to covid. \n\nI am now starting to notice significant disconnects between my boss and i (she previously managed the group, moved to director). She doesn’t seem to want to let go of her old job, micromanages most of the work that I should be doing and is not willing to step back.. \n\nI already approached to and expressed my concern, trying to identify what improvements I can make to help (align my work style with her preference, communicate in to her preference etc). I felt I made a concerted effort to meet her requests and it seems she now focuses on anything possible that could be construed as negative/something lacking in my end. \n\nMaybe I am over analyzing the situation, but I feel like now I am the black sheep of the group and being “iced out”. She will be warm/bubbly with other leaders, but her responses to me are curt/all business. I have tried to relate on a personal level and make an attempt daily to update her, share what’s new/how her weekend was etc. \n\nNot sure if I should keep playing the game, or if I need to just cut my losses and begin looking elsewhere. \n\nTldr: scored dream job, turned toxic, six fig but at such a cost to sanity\n\nMy venting may just get lost in the threads, but hopefully someone has been in a similar circumstance and has some tips. I’ve reviewed so many blog posts, HBR articles..\n\nThanks",
    "title": "Uh oh. Dream job turned toxic",
    "subreddit": "jobs",
    "timestamp": 1616628264,
    "score": 42,
    "keyword": "black director"
  },
  {
    "text": "Hope for those who need it Hey guys, I’ve really enjoyed reading posts on this reddit for the last few months.  I can relate strongly to those of you who are struggling through the process of finding work, especially with the headwind on the pandemic and other struggles that various people are dealing with.  I would like to share a story about my experience.  Though most of it happened about 12 years ago now I feel like a lot of it is still relevant.\n\n\nI finished my degree in applied mathematics in the early 2000s and despite doing well in school I had developed a severe problem with drugs and alcohol.  I would consistently ingest enough substances that I would literally black out for long periods of time.  I was able to land jobs in IT in the early to mid-2000s, and though sometimes I did an okay job, most of the time it would end with me missing large amounts of work or screw things up by showing up to work under the influence.  Finally in the late 2000s I was in a horrible car accident where someone other than myself got really hurt.  I was charged with a felony and locked up until 2009.  When I was released I had no job, no place to live, and no friends or family to speak of.  When I was released in 2009 I was sent to a half way house where I was able to obtain a suit and start fresh looking for work.\n\n\nI want to quickly fast forward to today to tell you that I am extremely blessed.  I am the Director of IT for a small but very successful technology company.  Myself and another person, who is the Director of Project Management, run the business for two incredibly talented owners.  All together we employ around 50 people and I simply cannot say enough good things about the company I work for today.\n\n\nIn 2009 I was able to find work, but it was not at all easy.  Here’s what I did: Luckily I was living in a big city where there were plenty of work.  I searched online for the companies I wanted to work for and printed out a list of jobs that I was vaguely qualified for at these companies.  I mapped out a bus / walking route that hit as many of these companies as possible.  Every morning I got up, put that one suit on and I would travel this route to each of these companies.  I want to say that over the course of an 8 hour day I hit about 40 companies.\n\n\nAt each of these companies I would walk up to the front desk and say the same rehearsed set of lines.  I would say “Hello, my name is Xyz, and I am very interested in these 3 jobs that your company is looking to hire for.  I have a few questions and I was wondering if there was someone in HR who I could ask them to.”  The person at the front desk would always say no.  So then I would ask, “Okay, is there a phone number that I could call to reach someone in HR, I am really interested in these positions and would like to learn more.”  The person at the front desk would always say they didn’t know the number to a person in HR.  That was fine, I would come back the next day and ask the same set of questions.\n\n\nAt one particular company the person at the front desk worked in security and he happened to be there every single morning when I came in.  After a few days we began to know each other’s names, and when I was walking up he began to greet me by my name as I approached.  Finally one day he said, “Look Xyz, I do not know anyone in HR, in fact I do not even work for this company.  I work for another company who runs security for this one.  And I don’t know any number you can call.  Sorry Xyz, I would love to help you, but I can’t”.  I said thank you and left.  Later that day that security guard found out where HR was in that company and walked my resume to that department.  He found a hiring manager there and he said this: “This gentleman named Xyz comes in every day and drops off his resume for these jobs and I don’t know what to tell him.  I’m worried that he’s going to come back tomorrow.  Is there anyone here who can look at his resume and get back to him?”  The woman who he brought it to looked at my resume, thought I was a slight fit for one of the jobs, and gave me a call.\n\n\nThrough the interview process I did have to disclose to them that I had a felony record.  But I told them that if they took a chance on me they would never regret it.  That was the first job that I got out of jail, and I’ve had one job after the next ever since.\n\n\nSo why am I sharing this?  I suppose I just want to tell everyone that if you work hard enough to find a job and are dedicated enough that there is hope and you will find what you’re looking for.  Also I wanted to mention that I would have never been successful if I wasn’t able to overcome my issues with drugs and alcohol.  My number one priority every day is to not only keep away from mind altering substances, but to make sure that I am as mentally healthy as I can be to start each day.\n\n\nAnyway, if you got this far thank you for reading and good luck to you on your road ahead!!  I promise you there is an exciting future out there waiting for you, you just have to put on your clothes and lace up your shoes and go out there and find it.",
    "title": "Hope for those who need it",
    "subreddit": "jobs",
    "timestamp": 1617107510,
    "score": 3,
    "keyword": "black director"
  },
  {
    "text": "Waiting for decision for a job I really want (+2 days and counting) I was terminated last December from a hedge fund due to a very toxic fallout (the person doing the firing couldn't look me in the eyes). And I spent about a month and a half after that trying to heal from the situation. I was burnt out going into the job search, and only applied to 2 companies that I was sure would not be toxic (I am in tech so there are always jobs available and almost every well-known place there is reputation of a bro culture). One of them turned out to be a dream job. I never knew I would be excited to work again. Anyways, final round went smoothly, or so I thought, and the recruiter said they'd reach a decision sometime a week later. It's now been 8 days and a follow-up email later, and I still haven't heard back anything. I restarted the application process, now armed with the optimism that maybe I can find a job that I love in an environment that doesn't belittle or despise me. It was hard coming to terms with a job that felt so right was not meant to be yesterday, but I suppose that is a part of life.\n\nEdit (Context): I am an Asian female in STEM. As the only woman on all teams I've been in, it feels like I've been fighting to belong my whole life. Yesterday I watched a tiktok video of a black woman receiving feedback about being perceived as aggressive and threatening despite sitting at a meeting quietly and saying nothing while a white guy jumped up and down and cursed at the same meeting and received no feedback. My problems are probably not as egregious, but I am struggling with the same question: how do you act on feedback that is about what you are instead of what  you did? My mother tells me that it is okay and just do my best. But today when I talked to recruiters that don't see any limits for me and were talking about aiming for directors and principals, I just feel like crying ||\\_\\_\\_\\_||.",
    "title": "Waiting for decision for a job I really want (+2 days and counting)",
    "subreddit": "jobs",
    "timestamp": 1613688212,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "My rapist and his professional bluegrass musician girlfriend are using her social capital to silence me after I went to the police. I feel like I've failed SA victims. CW: Rape, physical assault, cyberbullying/letters/phonecalls, suicide attempt, false arrest, probably other triggers so please take care - \n\nI'm putting the TL;DR at the top because I basically wrote a novel.  If you read any of this, I'm really grateful.  I wanted to get this out in a safe environment, as I haven't been able to discuss it with many people. \n\nTL;DR - after I was raped by my 'friend' and former teacher,  I warned his new professional bluegrass musician girlfriend (a recent divorcee with three young children) about his treatment of women and his substance abuse. I suggested she encourage him to get therapy and substance abuse treatment. She said he was the most compassionate guy she'd ever met. \n\nWhen she later found out I was speaking to the police about her boyfriend raping me from a third party,  she created a couple of facebook posts that utilized her cachet as a public figure to doxx me, discredit my claims, have her fans harass my family and their business via every means possible, and have me removed and ostracized from the community.  After seven months of no contact, she baited me into talking about the rape by messaging me and appealing to common experience.  She then used that message along with fabricated and altered evidence to have me arrested on a charge of computer harassment.  \n\nOnce the case was dropped by the state,  I sent an email regarding what happened using pseudonyms for all involved to bluegrass community leadership in an attempt to convince them to hire a third party safe venue/ victim advocate who could establish standardized protocols to deal with harassment and sexual assault.  The girlfriend addressed her followers on facebook again,  this time directly stating I was lying about the rape and abuse, and that my actions diminished the efforts of 'real' victims.\n\nI feel like a worthless failure. I wasn't able to really help anyone.  I constantly wonder if she,  the rapist, and her fans are right and I should just finish it off and be silent forever.  It hurts every day that the rapist and his friends continue to run around, emboldened and vindicated in their behavior.  I worry for my niece,  my cousins,  and my friends' little ones.  I'm terrified about having a child and having to raise them in this area, as my rapist is still nearby.  I don't want to bring them into a world of rapists like 'Ted',  vindictive, faux feminist rape apologists like 'Rita', hypocritical BE KIND types,  and all the other malevolent beings like cops who kill Black folks over tail lights and the never ending stream of sex pests in positions of authority.\n\nDid I do everything I could? Did I help or hinder the progress of sexual assault advocacy? I'm afraid other victims will be scared to speak up seeing what happened when I did. I want so badly to help other victims, and to prevent this from happening to anyone else. \n\nI hate myself.  I'm worthless.  That's why I've been raped twice and thousands of people have said I deserve to be beaten and to disappear. I wish I had done more to mentally protect myself from a predator like Ted, and I blame myself for what happened.  \n\n\\------------------------------------------------------------------------------------------------\n\nAfter moving to a new area far from my hometown,  I started banjo lessons in July 2018 as an avenue to make friends.  I asked my teacher, Ted, to help me find jams and such to join,  which is typical in bluegrass/ old time music as they are based on community participation.  At this time, I also admitted I had issues making friends because I'm scared of men after being raped when I was 20. I brought this up because most jams are almost exclusively attended by men. As he was a teacher,  I figured he was trustworthy. He invited me and some other students out to events after that.\n\nI changed teachers after six months because Ted wasn't an engaged instructor. I stopped speaking with him at this point. About two months later, he messaged and asked if I wanted to be friends. He also offered to help me integrate into the community.  At the time,  my partner and I were separated,  so I was happy to accept any help. I did ask my parents what they thought about Ted's invitation.  My dad was emphatically against the idea,  stating he didn't think Ted was being honest about his intentions. I thought it would be okay,  since he was vetted to teach lessons to children at the community center and seemed well known by the local bluegrass group.\n\nIn our initial meeting as peers, Ted opened by saying 'I was born to be given away.' Even though I loathe him,  I won't elaborate on that point other than to say I think it forms the basis of his issues. He told me he didn't have a lot of friends who were women,  so he was happy to talk to one so he could 'explore his feminine side.' He also spent a lot of time talking about his wife, Loretta. He wanted advice regarding her 'nagging' when it came to his drug and alcohol use around her son,  his jealousy over her male friends, and her suspicions he cheated on her. He also thought she lied about being sexually assaulted and wanted to know why someone would do that. He talked about his time in New Orleans,  and how he discovered he had the ability to turn his emotions off at will. There was also a discussion where I talked about how I had difficulty fitting in with most groups.  He said that other folks are 'shadow people'. I replied that I personally consider it important to never elevate myself,  or to 'other' people,  because that's how violence, bigotry,  and fear are sown. He hastily agreed.\n\nWhen I messaged him later to give him the requested advice on how to improve the relationship with his wife,  he said i misunderstood him. He claimed they were divorced and he was never going back.\n\nThe next time I saw Ted,  he kissed me.  He immediately pulled back and stated he didn't want a relationship,  but that we could be friends and he could help me.  I didn't consider myself emotionally  available,  but I did want his assistance in the community. We discussed it a bit more. The terms included that he'd continue sleeping with other people,  but that he'd practice safe sex and be respectful of me. I also begged him to not mistreat me in light of my prior rape experience. We then had sex.\n\nThe next time we had sex,  he did something that frightened me.  While I was on top,  he grabbed me by the throat and propelled me into the air.  He's at least 6' and stocky. I'm a little over 5' and small.  I immediately asked him to stop,  and told him it reminded me of my rape.  He then covered my face with his large hand,  but I managed to move off of him.  Afterwards,  he asked me to tell him about the rape.  I did so,  while crying in his arms.  I particularly emphasized how the rapist held me down by the throat. He became aroused.  Then,  he left. \n\nWe continued a routine of going to shows or jams on the weekend,  then having sex. He wouldn't speak to me during the week.  He made a point of never saying goodnight when I said it as we'd leave. He discussed his desire to move within the next year to be around the young college musicians in Tennessee. He hated being in the area around the 'inferior' musicians,  although he felt some obligation towards his parents to stay close by. He lamented that the band he'd been in in high school almost 'made it' . He said he was glad I wasn't like his crazy ex partners.\n\nI responded that he could teach students and raise them to his level.  I noted the other local musicians were well loved,  because they're affable and relatable and art is more than technical proficiency.  Just ask Johnny Cash.  I pointed out young people tend to prefer playing with each other, but that I thought a move might benefit him.  I wish I'd said more about the 'crazy' partners.  It was an ill portent.\n\nA couple of weeks later,  he left for a few weeks to go on tour.  I messaged him, and asked if he'd let me know how it was going and try to respond on occasion.  He sent back a diatribe telling me it wasn't my place to ask anything of him since we weren't dating,  and threatened to cut off our arrangement if I didn't behave.\n\nWhen I saw him again,  he was different.  Although he'd never been a particularly well groomed or emotionally responsive person,  he had clearly atrophied more in this regard. He was almost an hour late to the venue.  He explained that he started drinking at work,  then picked up more beer at the 7-11, then continued to drink at home until he passed out.  He relayed this while sitting there with disheveled, unwashed hair. Alcohol,  body odor,  cigarette smoke, and weed dankness wafted off him in an almost tangible entity.\n\nHe told me about his trip.  He spent the entire time microdosing shrooms along with his usual drinking and heavy marijuana use. He spoke of using cocaine to stay awake while driving.  He talked about how amazing it was to be out there with a band with whom he had a compatible vibe.  He mentioned sleeping with other women,  patronizing sex workers at the clubs and why he enjoyed it,  and how he wanted to cast or carve a statue of his penis.  He loathed being back, and whined again about the area and having to play with local musicians again.\n\nLater,  while having sex,  Ted said some creepy things,  like that I looked like a teenager.  I asked him if that was supposed to be a positive,  given we are both in our 30s. He enthused that it certainly was. I mentioned how I do not feel like an attractive person.  He pointed out the guys who talked to me at the venue. I could tell he was upset about them. He talked about how he fantasized about me when I was his student. Then, during sex,  he did the choke propel move again.  I grabbed his hand and reminded him why I didn't like it. \n\nThe next day and morning, June 28/29th 2019, are the ones seared into my memory.  I arrived at the venue around 9 PM. He came to say hello a while later before wandering off to drink and talk.  After the show,  I mostly talked to his band leader, Mop. This was typical of our outings as I was trying to make friends and we were avoiding looking like a couple.  We left the venue after midnight and went to a parking lot for a trailhead.\n\n\\*\\*\\*DESCRIPTION OF THE RAPE AHEAD\\*\\*\\* \n\nThe liaison started normally.  We were in the front of the vehicle,  then we moved to the back.  As he lived with his parents and I was living with my former partner until I saved enough money,  we typically used my vehicle.  Usually we would put  the back bench to make room.  This time,  he seemed to be in a hurry. He didn't put the bench down. He didn't remove his filthy boots.  Instead,  he pulled his pants off over them. We were making out on the right side of the bench when he said 'I just want to be inside you.' I moved to sit on the left side of the bench while he positioned himself in front of me in the foot well. Suddenly,  he grabbed my throat again.  I said,  \"please, no,  stop!\" Then, as I tried to say more, I blacked out.\n\nWhen I rejoined the world,  he was removing himself from inside of me.  He was acting strangely,  so I asked,  \"are you okay?\" He moved to the other side of the bench.  My legs were painfully arranged.  One was propped up on the driver's seat in front of me. The other was twisted out to the side.  My left hip was ground into the door molding.  I had difficulty moving.  Everything hurt. \n\n\\*\\*\\*\\*\\*\\*\\*\n\nI knew something wasn't right. But I cuddled him,  and convinced myself it was all okay. I hate myself for that, but it was one of the few times he let me touch him.  He said he had to leave because he was taking band photos in a few hours.\n\nI was disoriented and attempted to find my clothes. After rearranging myself,  he offered to have me follow him back to town.\n\nHe'd never offered anything like that to me before.\n\nAfter we parted paths,  I pulled over and cried. \n\nWhen I got back to the house,  it was later than usual.  My former partner,  Arthur,  came out and asked if everything was okay since I was coming in so late.  Arthur knew that I had been attending events with Ted. He noticed I was crying and that my neck was red.  He asked if I was okay, and if I needed help, or to go to the hospital.\n\nI declined,  and ran to shower.\n\nThe next day,  I found bruises all over myself.  They were concentrated on my left hip and all over my thighs,  but especially up near my crotch.  I also found bruises all over my right arm.  Scratches had formed on my right thigh.  I remembered that I had asked Ted about his usually long nails that were only on his left hand,  the one he used to fret the fiddle.  For the non musicians,  nails inhibit playing string instruments,  especially violins and fiddles. I took pictures of every injury I could find.\n\nAfter that night,  Ted mostly stopped talking to me.  I sent a message asking for his phone number,  which he ignored.  I saw him at a couple of events. When I tried to talk to him about what happened,  he'd ignore me and say he was going through a difficult time after the trip.  Online,  I asked him what had happened that night.  I pointed out he was being even more angry than usual,  and drinking heavily.  I was trying to get answers for something my mind was keeping from me. I didn't want to believe that after the times I talked about the issues from the first rape; after I'd pleaded for him to treat me like person, and most of all,  given that I had told him NO three times when he grabbed my neck, that something atrocious had occurred.\n\nIn the middle of July,  he sent me a message saying a sea shanty night was happening nearby.  It was the first time since that night that he'd told me about any events. When I arrived,  he was there with other local musicians.  Some time later,  Rita appeared.  Rita is a professional banjoist.  I had followed her band page for some time.  She posted extensively about her life - she had shared custody of three kids,  she was recently divorced,  she loved to travel,  and she desperately wanted a boyfriend, judging by her mention of looking for a cute guy at every show and her time spent on okcupid in every single blog update.\n\nAs an aside,  I have no idea how Rita ended up there that night.  I suspect Ted invited her,  as it was a very small event with little advertising almost an hour from where Rita lives.\n\nI was excited to meet another woman banjoist.  Rita had been sitting in the corner alone,  so I went over and started talking to her. We discussed being woman banjoists.  I mentioned how I had been having a difficult time with sexism in the community.  She said there were creepy guys who messaged her,  but overall, she just rolled with it.  Ted started talking to her.  They discussed accounting, and which musicians they disliked.  One of the other musicians invited us back to his place.\n\nRita mostly stood around,  as did Ted.  I tried to keep conversation going.  At one point,  I did hear them talking about the banjo she loaned to Ted.  I was confused,  since they'd acted like they didn't know each other.  I sometimes wonder if they were secretly dating during the time that he allegedly raped me.  A girlfriend,  a friend with benefits,  women he slept with while out of town,  and a wife all at once.  At any rate,  the other guys started talking about no name girls - women that guys like Ted would chase out of the community after a few weeks, so it wasn't worth learning their name.  This caused me to launch into an invective about every woman being a person and how ridiculous it was to speak that way.  Rita and Ted said nothing.  I wasn't surprised about Ted,  but Rita often posted about being a feminist and an advocate for women in the bluegrass community. \n\nI gave Ted some herbs to help with his alcoholism when we were leaving.  I tried again to find out what happened.  He said he was tired and didn't want to talk about it.\n\nMy last attempt came a week later, on July 19, 2019.  After a show, I approached him in the parking lot while he was loading.  Everything I said,  he repeated back to me in a mocking tone.  I was speechless and crying. I asked, why? again and again.  A friend of ours, Benedict,  came up to say goodbye, then quickly left when he heard Ted's tone.  Then Ted said he had to go,  shoved me,  and hopped in his vehicle.\n\nI went home and messaged him again, asking what I had done to deserve his cruelty.  Then I blocked him.\n\nI unblocked him later and said that while I didn't understand his malevolence,  I was reliant on him and his help to make friends and move on with my life in the community.\n\nThat's when he told me he was dating Rita, and that he hoped he'd see me around on occasion.\n\nI may not have fully processed what he had done to me,  but I certainly wasn't going to let it happen to a vulnerable mother of three kids.  I know my life is worthless,  but I'll never stand by and let others be abused.\n\nI messaged Rita and told her what had happened - what I remembered.  I sent her screenshots of all the unpleasant,  abusive things he said. I pointed out disturbing things I'd noticed,  like how he enjoyed me looking like a teenager,  and his habit of offering 'lessons' to teenage girls,  but not teenage guys.  I told her about his substance abuse problems. I told her how he complained about his wife asking him to stop doing drugs and drinking around her child. Then I stated it clearly - before dating someone with small kids, he needed therapy for his issues with women and substance abuse.\n\nRita told me he was the kindest guy she'd ever met; a beacon in a sea of dickheads,  and that she'd never let him go.\n\nTed messaged me.  He finally answered my questions.  He said it was all consensual,  that nothing he did was premeditated, and that everything else was my fault.  He told me that everything I told Rita was untrue and disrespectful. He told me that I should expect sexual harassment because of the way I dress,  and the preponderance of men in bluegrass.  I told him I'd always prioritize women and children over men like him.  He told me I was awful and blocked me.\n\nRita messaged me with more questions.  I answered as best I could.\n\nTed unblocked me and told me if I didn't stop talking to Rita,  he would tell the entire community I was crazy and about everything I'd done.\n\nI emailed Rita and apologized for bothering her. I told her he was threatening me,  and that I didn't appreciate that.  I wished her luck.\n\nEarly in September,  I attempted to kill myself. I'd rather not elaborate on that.\n\nLater in September,  I went to a campaign event for one of the musicians that was running for the board of supervisors.  I had been volunteering for him since April.  The entire time,  I was terrified Ted would appear.  I started shaking and crying at one point.  Benedict was there and I told him some of what had transpired. I met him the next day to talk a bit more.  He revealed that Ted was still married,  but complained often about his wife's nagging.  Benedict also mentioned that a couple of months after Ted married,  he started cheating on her.  One affair started at the large annual festival that much of the community attended.  He estimated since then that 5 or 6 women had been around him,  then disappeared.  He tried to encourage me to continue participating in local bluegrass events. I told him I wasn't interested, as Ted scared me.\n\nI emailed Rita again, telling her everything I'd learned and emphasizing he needed help.  She wrote back and said he was 'safe'.\n\nThroughout the fall,  Arthur and I decided to try again.  We began going on dates.  He was there for me as I talked about what had happened,  and how I was feeling.  We agreed to go to couples' counseling.\n\nThe last time I contacted Rita and Ted was early in December 2019. I was doing poorly by this point.  I don't know what I expected.  I just wanted to be acknowledged as a human.\n\nIn January 2020, I was cleaning out my phone when I found the pictures I took after the assault.  That was when my brain unlocked and I remembered what happened.\n\nBy this point,  I hadn't slept well in months.  I was depressed and lethargic.  I realized I needed help,  but wasn't certain how to get it.  I also felt panicked that Ted was out there,  with no one warning the other women.\n\nI tried contacting some music organizations that I thought might be able to help with restorative or transformative justice,  but sexual assault was not their purview. \n\nI reached out to someone I thought might understand - his 'crazy' ex girlfriend, Patsy.  She told me what he had done to her,  which was chilling.  She mentioned he'd moved and was living by himself.  That information scared me because he'd talked about holding lessons at his place once he had one. She encouraged me to go to the police. \n\nI also messaged his wife, Loretta. She was upset because they were married when he was sleeping with me (and all the other women). I apologized,  because I really can't imagine how that felt.  I wish I had known he was married.  I hate that I hurt her.  She suggested going to the police and contacting the sexual assault center.\n\nI contacted them a few days before the one year anniversary of that night.\n\nEveryone should know about these sexual assault/ social justice centers.   RAINN keeps a searchable database of these centers. They offer free counseling to survivors of sexual abuse and it is \\*lifesaving\\*.\n\nAfter a couple of weeks of counseling with the director of sexual assault,   I decided it was time to speak to the Special Victims Unit.\n\nThe sergeant encouraged me to find corroborating witnesses. I emailed Patsy and asked if she'd be willing to speak to the police as well.\n\nShe said she would,  but that she'd like to speak to Ted first - she wanted to see how he'd react when 'confronted' with my allegation.  I asked her to be cautious, and to let the police handle it.  She said she'd already contacted a mutual friend - Finn, one of the other guys from their teenage band.\n\nThe next morning,  I found weird 'likes' on my public pictures.  I suspected something had been posted.  Sure enough, Rita had unblocked me and put up a Facebook post addressed to her friends and followers that doxxed me.  She named me,  gave all my online aliases and associated sites,  gave a physical description of me,  stated the general area where I live,  and mentioned I play banjo. In the comments, she also outed me as a queer woman. She added that I was a crazy stalker who was obsessed with her,  her children,  and her boyfriend Ted.  She asked everyone to watch out for me, and to ignore anything I said because I'm insane and dangerous.\n\nThe comments were filled with people offering to beat me,  drill holes in my head,  run me out of town physically and digitally,  and make me disappear.  She had about 6000 friends and followers.  In the regular world,  that isn't significant, but in an insular niche like bluegrass,  it's quite the reach.  Many people mentioned that they were looking for me and the places they'd seen me posting,  and asking questions about things on my profile.\n\nThe next morning,  Rita messaged me. She opened with, \" Hey OP, long time no talk!\" She said she vaguely knew what I had told Patsy and Loretta,  but that she needed to know about what he'd done for herself. She also said her 'good guy' radar was broken,  and she wondered when Ted would betray her. I told her I didn't feel comfortable speaking to her at that moment.  She said she got it,  then told me she'd had a rape experience of her own. She told me to get over it,  then blocked me.\n\nBenedict also texted me,  asking if I still lived in the area and whether or not I needed someone to talk to.  The last time I had spoken to him was November 2019. It was now the end of July 2020. I didn't answer his questions,  and talked blithely of banjo instead.\n\nIn August,  Rita released a song that I'll call 'Stray Cat.'. The lyrics described a cat who made women disappear and was overall an undesirable animal.  The singer fell in love with the cat anyway,  as it was meant to. My therapist said it was a new experience to hear about a love song about her patient's rapist on the radio.\n\nAfter recovering from the doxx post, I contacted the SVU detective and filed a report.  The detective looked over my photos and the messages and said,  'let's call this what it is - rape.' It was the first moment I truly internalized what had happened that night.  She said it was unlikely the DA would pursue my case without the rape kit and confession.  After Rita's post,  I knew it was pointless to attempt to try and get a confession. It was likely Ted had hired a lawyer,  and no one in the community would want to help - they wouldn't want to face the same ire. The detective said the file would be there if anything else happened,  and that there was no statute of limitations. She asked if I was living alone,  and made certain I had been speaking to the counselors at the rape crisis center.\n\nA couple of weeks later,  I started to feel guilty that I hadn't answered Rita. I decided to email her and let her know what had happened. My partner,  the director of sexual assault at the crisis center,   and my mom advised against this.  They said she was dangerous.  I felt like it was hypocritical to claim to be an advocate for the safety of women while denying an earnest request like Rita's, particularly with her mention of a rape experience.\n\nI told her what happened,  and what the police said.  I told her I wasn't a sage,  but that his past behavior indicated an undesirable outcome for anyone involved with him.  I said there wasn't anything else I could do,  and that I wanted to heal and move on.\n\nI also copied a bluegrass advocacy organization on the email, at the request of my partner. \n\nRita responded by saying 'YOU AGAIN!' I sent a screenshot of her message asking about the rape and replied something like, 'I'm not trying to incite distress. I just wanted to answer your question'. She then said,  'thanks,  this will be useful in the defamation suit (winking kiss emoji)'.\n\nTwenty minutes later,  she called my parents. She called again later that evening.  The next day, she called their house four times from 9 AM until 11 PM. She also called my dad's shop several times.  My brother answered once and told her to stop calling.\n\nThen came the Facebook posts.  She picked people who had liked a picture on my mom's profile. Anyone with a public post received a rambling comment. They were all different.  Some of them said I was an unhinged, obsessive stalker.  Some of them said I was mentally ill and needed help.  They all said she was trying to contact my parents. \n\nNext she tried my dad's business FB page.  This was the first time she brought up a bizarre story about kayaking near my house after the July Facebook post and how her tire was slashed. She posted a picture of her son changing a tire and added they were 'just normal folks. '\n\nShe then started emailing my dad.  She sent all the messages I'd sent her from Ted.  She sent the slashed tire photo (which my dad,  who is an auto mechanic,  said looked very suspicious given how clean it was). She went on and on about how I'd been harassing her for over a year and I needed to stop.\n\nMy dad didn't know about the rape.  My mom knew,  but we decided not to tell him because we knew he'd be upset.  After all,  he was the one who mentioned that Ted seemed untrustworthy.  He called me about all the messages and I told him what had happened.\n\nNot long after this,  Ted himself emailed my dad.  He claimed we'd been in a romantic relationship,  and that I was lying about being raped.  He sent a screenshot of a lawyer contract and the same messages I'd sent to Rita. He told my dad he wasn't a scammer, and that he could be trusted because his girlfriend is a prominent professional banjoist,   and that my dad should Google her.\n\nThe following day was the start of the letters.  Rita sent four letters, two to my parents and two to my partner.  They all had a different tone.  One that was sent to my mom ended with 'you need to stage an intervention.  Send your daughter to an asylum! She cray! (Hand drawn spinny eyes emoji).' My partner's letters all referred to how Ted and I were 'fuck buddies' and I was exacting revenge with a false rape allegation.  Two of the letters were printed packets of the messages I'd sent her.  They had annotations in her hand writing indicating how I couldn't have been raped. \n\nOn September 22, she put up a Facebook post that tagged my father's business.  It had links to his Facebook reviews and Google reviews.  The post detailed how I harassed her and Ted for a year,  and how terrified she was.  She said the police could see I was insane, but since I never threatened anyone physically,  they couldn't do anything.  She also noted that as poor musicians in a pandemic,  they couldn't hire a lawyer.  She said the police suggested reaching out to my family.  She asked her followers to address them at the business site.\n\nMy dad's pages started to receive negative reviews.  His inbox filled up with messages about his crazy,  pig fucking daughter.  I made certain to screenshot everything as usual,  and kept deleting and blocking as necessary.\n\nOn Rita's post,  the usual battery of threats were expressed.  Rita encouraged anyone who offered to leave a negative review or send a message.  Rita updated the post to add a Yelp link. By 5 pm or so,  the post disappeared.\n\nI thought someone must have talked some reason into her about harassing a random business 300 miles away.\n\nI was wrong.\n\nAt 10 PM, a pounding came at my door.  We were terrified,  as we thought it was Rita or one of her violent fans coming to take us out. Arthur looked out the window and said,  'it's the sheriff. '\n\nThey'd come to arrest me,  on a warrant for one count of computer harassment, sworn out from Rita's town.\n\nI've already mentioned being raped twice.  To lose control of your body like that is a shock from which you'll never truly recover.  We all walk around with this illusion of autonomy. That it can be violated so easily permanently alters your sense of self.\n\nBeing arrested is a similar feeling.  Two men,  each far larger than me (I'm a little over 5' and 115 lbs) removed me from my safe spot, handcuffed me,  bent me over a car, and slid their hands between my legs. \n\nThankfully,  the sexual assault therapist had given me some tools.  I cast my mind far away while those strange men touched me. \n\nI was released a few hours later as I have no record and behaved properly. \n\nThe next day,  I was served a Cease and Desist from Ted.  It said I had an unhealthy obsession with him after being turned down,  and was also taking my ire out on Rita.  It stated that my rape allegation was defamation per se, and that I needed to stop because Ted's wish had been to help me integrate into the community.\n\nTwo days later,  we met up with my lawyer,  Boone.  After seeing all my evidence,  he was baffled as to why I was arrested.  We went to get the statement from the courthouse.  Rita had written that I had been harassing her constantly from July 2019 to September 2020, even though the last time I had messaged her unprompted was December 2019. She claimed to have told me to stop contacting her three times. She mentioned the mysterious slashed tire. She said I had just come up with a false rape allegation against her boyfriend.  She wrote that I was a threat to her and her children.\n\nA couple of weeks later,  we received her deposition packet.  The messages I sent her in July 2019, the September 2019 email,  and the September 2020 email were there,  but the dates were not included.  An email that I had never seen,  supposedly from Ted to myself, was there.  It was dated December 2019, but had a caption that it was generated in July 2020. The email was a request for me to stop speaking to both of them.  There were no email addresses,  and several different fonts were used.  After an expert looked it over, it was decided that it was quite probably fraudulent.  There were screenshots from a conversation between Loretta and Ted,  where she talked about what I'd said.  She claimed she deleted the actual messages. Ted also wrote a letter to an unspecified person asking for a protective order against me due to my 'unhealthy obsession' with him.\n\nIt was my turn. I brought my lawyer a hard drive with over 500 files.  I included the full,  unexpurgated Facebook messenger logs with Ted and Rita. I made certain that dates and times were present.  I had screenshots of all her Facebook posts,  and every single threatening response in the comments.  I brought my own copies of the emails.  I had phone logs.  I included all the people I had told about Ted's violence,  starting in September 2019. I brought the letters and packets. Most importantly,  I connected everything to a timeline.\n\nBoone was confident my case would be dismissed.  In December 2020, he walked with me to the judge and said, 'no deal!' A trial was set for February 3, 2021.\n\nWe met with Boone the Monday before the trial.  The offer he had turned down - without even relaying it to me - was a $1000 fine and a mental health evaluation by the court.  We prepared the timeline and all the documents Rita didn't submit,  particularly the message where she asked for me to speak to her about Ted.\n\nThe next day,  the DA offered a new deal. If I pled guilty,  there'd be no trial.  I refused.  The third offer they sent said if I never spoke to,  or about,  Rita AND Ted ever again,  the case would be dismissed in a year.  I let my lawyer know I'd NEVER be silent about what Ted did. I was LIVID at the suggestion and cried with the frustration of rapists being protected. My lawyer called back and said the DA had finally agreed to drop the case via nolle prosequi. Boone emphasized that it was rare for the state to drop a case.\n\nAt court the next day,  the DA called me up and began speaking before I even made it to the podium.  He said 'nol prosse' then began to rant about how 'it was so close ' and that I needed to 'leave Ms. Rita alone'. The judge looked at the complaint and said,  \"there must be more to this case than what's on this paper,  Ms. OP. You're free to go.\"\n\nI knew that moment was the closest I'd get to pitting my word against theirs.  I am thankful I was acknowledged by both the SVU and the court. \n\nArthur and I wanted to do one last thing.  In therapy,  I discussed how much I wanted to change the culture of the bluegrass community,  and how I could help.  We decided to send an email to people in bluegrass leadership and advocacy positions to ask them to hire a victim and safety advocate for their professional branch,  the International Bluegrass Music Association (IBMA). I suggested that this person could come up with standardized protocols and safety training for events and venue sponsored by the IBMA. I included links to other genres' efforts.  I talked about what had happened to me,  and included screenshots of the threats and harassment I'd received from IBMA members at Rita's behest. I mentioned Daisy Coleman,  and how the kind of community bullying she and I were subjected to drives people to suicide and suicide attempts.  I made certain to use pseudonyms for Rita, Ted, and myself as I didn't want to doxx them or revert too much focus from my request.\n\nA week later,  my brother showed me a post that was tagged with the shop. It was Rita.  She wrote about how I lied about being raped by Ted; that he was kind and gentle with her and her children.  That she'd read the messages he sent me (the ones he said were deleted in her deposition) and they were also kind and gentle. She said I was spiteful and jealous,  and that my actions were mitigating the validity of other sexual assault victims. She then said they'd find the strength to forgive me somehow.  The post ended with a horrid song she'd written. My brother summarized her post as 'an asshole trying to gaslight you.' He also said, 'let's see her write songs saying 'get over it' when he comes home drunk and gives her a black eye or AIDS!'\n\nI talked to a lawyer at this point. I wasn't particularly interested in a lawsuit. I wanted legal conflict resolution.  He said he could take my case,  but that due to Rita's animus,  he doubted she'd want to negotiate civilly.  He said the rape would mean a jury would rule in my favor if it went that far,  but that she'd probably keep appealing.\n\nI didn't feel like spending the time, money,  or emotional energy on those two.\n\nAs a last recourse, Arthur sent Rita a message. He told her he believed me, and that he was proud of all I had done and how far I'd come. He said that 'consent given once is not constant consent. ' He let her know he had read all of the messages himself.  He mentioned seeing me that night,  and how he wanted to take me to the hospital after seeing my neck and how he regretted not forcing me into it.  In light of that,  he asked her to take the post down, and to never contact or harass us,  our families,  our friends,  or any associated businesses ever again. He also specified she should stop using her social capital to catalyze her fans' harassment of us.\n\nShe blocked him and kept the post up.  Ted took it down.\n\nSince that time,  which was the beginning of March,  I've continued to focus on recovery. I've been feeling better but...\n\nIt shatters my heart that my attempts to improve a culture that supports sexual violence have now been weaponized.  I'm afraid other survivors will see Rita's posts and be afraid to speak up.  Arthur thinks their intention was to harass and humiliate me until I killed myself. I think he's right.  Who would want to subject their family and themselves to all that?\n\nI'm such a failure.  I wish I had done more,  and sooner.\n\nI'm disillusioned by the fact that the person who tried to destroy me was another woman.  A woman I tried to help. It devastates me that a community based on love and peace; one that slaps BE KIND stickers everywhere and has social media profiles covered in image macros about empathy viciously attempted to destroy me,  my family, and their business.  All for an alcoholic,  wife abusing,  girlfriend stalking,  date rapist. I feel like I'm living in a black mirror episode,  where everyone calls victims 'psychotic monsters' and elevates violent perpetrators.\n\nI don't regret going to the police.  I just..I don't even know how to think or feel outside of that at the moment.  I'm simultaneously a cipher and overloaded with every emotion out there.\n\nI'm thankful for so much in my life. My partner is fantastic. I have had a lot of support during the healing process. I live in a beautiful, tranquil area. I'm trying to improve and get to the point where I can truly make a change and help others. I really want to start a therapy farm and a therapy music jam. \n\n Still, I struggle every day and I worry I can't escape.",
    "title": "My rapist and his professional bluegrass musician girlfriend are using her social capital to silence me after I went to the police. I feel like I've failed SA victims.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618696412,
    "score": 61,
    "keyword": "black director"
  },
  {
    "text": "Workplace harassment or microaggresion by public or clients at work. I was just reached out to today by a former co-worker regarding a conversation we had before I had left that organization. I work in events and public outreach as well as having studied Physics so I have quite a lot of stories when it comes to 'inappropriate' behavior. Prompted by International Women's Day and my general openness to discuss how people have acted towards me she told me about some of her experiences being a black woman and immigrant who has to make off-site visits to residential buildings. I was not surprised and had voiced frustration that unlike my previous job there was not a clear path we were to follow when people within our org were inappropriate let alone clients we interacted with. Her message today was asking for advice on how to move forward with pushing the upper management as she has now taken on a team lead position and has more say in at least the team function (I also suspect that the hiring of significantly more women of color since I left is a factor).\n\nThis org is relatively small (30-50 employees) and has no HR which has been a fairly contentious issue among staff as the median age of staff is likely around 30 while the directors are likely around 65.\n\nDoes anyone here work in a front facing capacity and have a good policy for what happens if a member of the public or a client is harassing an employee or a co-worker is experiencing microaggresions while working? Any ideas you have if your workplace is similarly vague on policies?",
    "title": "Workplace harassment or microaggresion by public or clients at work.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1634698924,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Why Are Parents Allowed to Contact Us Directly? Hear me out. \n\nTeachers have too many kids to just field emails and calls from parents all day. There should be an automated response system for them to filter their calls so we only have to deal with the ones that really matter. I spend too much time each week dealing with idiot parents. \n\nOptions could include things like: \n\nWelcome to Mr./Mrs.’s Voicemail! If we find that you have an actual problem, you will be given a one-time use code that will allow you to send an email. Please note that you may only use your email code during school hours. \n\nPress One if your child has an F from zeroes. They didn’t do their work. It’s not rocket science. Have them do their work and turn it in. Voila. No more zeroes. \n\nPress Two if you have an ignorant political complaint about the curriculum. Take that up with the school’s curriculum director. I just work here. I don’t pick the books. Why are you so scared about your kid learning black history, anyway? (This button connects them to educational resources.)\n\nPress Three if you have a question that could be answered if you took the time to read the syllabus, the school handbook, or one of my many weekly announcements. Then go read those things and answer your own questions. \n\nPress Four if your child’s behavior is unacceptable for any learning environment and you are mad at me for protecting the rights and health of the other children. (This one disconnects the call.) \n\nPress Five if you are wanting to ask me questions that have nothing to do with my job. (Prom schedules, lunch menus, club meetings for clubs that I don’t sponsor, etc.) \n\nPress Six if you have a technical issue that could be solved by refreshing your Internet browser. And then call the tech department. Not me.\n\nPress Seven if you are asking me about your kid’s grade when you literally have access to the online grade portal 24/7 and could 100% look that up yourself. Don’t be lazy. I have 180 kids in this course. You only have the one. \n\nPress Eight if you are just going to email an administrator anyway about something asinine, and then waste my next planning period with a stupid meeting. (This one also disconnects the call.)",
    "title": "Why Are Parents Allowed to Contact Us Directly?",
    "subreddit": "Teachers",
    "timestamp": 1634606899,
    "score": 341,
    "keyword": "black director"
  },
  {
    "text": "Afterschool care--Child feeling underrepresented? Hi all! I'm hoping to get some advice or directions to resources to help me talk to a specific student about race. For context, I am White and the student is Black/mixed, so I want to make sure I can answer her questions in a manner that is situational appropriate, knowledgeable, and sensitive, so that she feels supported.\n\nFor context, I am currently working at an elementary afterschool program in a \\*heavily\\* White state. We are one of the most diverse schools in the state, and there are many BIPOC children in the program, but in the Kindergarten group where I work, of the everyday students, only this one girl is mixed, and the rest are White. One of the directors of the program is Black; but other than that, all of our staff is White, and I believe most if not all of the regular school staff is as well.\n\nThe one girl I mentioned has started asking questions about \"Why aren't there any Black teachers?\" and the like, and I want to give her solid, age appropriate answers, but have been finding myself somewhat unsure of what to say. My instinctive internal answer is along the lines of \"there is still inequality and discrimination, and although this program tries to address this by incentivizing applicants of different identities and backgrounds, there just aren't many BIPOC people in the area\" but that seems a bit discouraging/like its never going to happen, and I feel like telling a 5 year old \"this is just how it is\" is a bad approach on several levels. Because of that, I've kept more to just validation, saying \"you're right, there aren't many Black teachers here and we should have more\" but she doesn't seem satisfied with that answer (considering she keeps asking) and I am not entirely sure what else to say. I've also tried to help her feel represented in other ways--the district \\*does\\* try with diversity, so we have plenty of books with Black characters and written by Black authors, coloring pages with popular characters from those books, etc, which I have been making an effort to request as afterschool materials we can use. \n\nHowever, I still feel like there must be ways to answer her questions at least a little more directly, instead of always deflecting. She's very smart and very self-aware, so my inclination is to try and give her a real answer, but she's also five, and one student among around 10 that I am responsible for, and we are only together for a few hours every week. I don't want to oversimplify a complex situation, but I don't know that I have the time or ability to really get into it. I have also passed all of this on to my director, who clearly sympathizes very closely and personally, but does not have the time to do much more than pick out some books for us to read together. \n\nSorry this post turned into something so long and rambly--TLDR; White afterschool staff, Black Kindergartener, how to talk to her about the lack of diversity she sees at school.",
    "title": "Afterschool care--Child feeling underrepresented?",
    "subreddit": "Teachers",
    "timestamp": 1621387740,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "How do you look for a new job? Need your wisdom TL;DR I feel like I'm trying to navigate in a pitch black.  Need inputs where or how to look for potential employers. \n\nI'm a paralegal that was hired pre-covid in a medium sized company to look after legal related paperwork (trade unions mostly). \n\nI have a fixed term contract about to expire and I was told by the HR Director that due to budget cuts me and a bunch of others will be laid off.\n\nWhat are some useful tips to find a new job in these tough times?\n\n\nLinkedIn never yielded anything but spam messages from people trying to get me into network marketing.\n\n\nMonster has hardly been useful. The jobs posted there either require 5+ years of expertise, or master's I don't have. \n\n\nGlassdoor keeps sending me emails regarding whether I had an answer from the moltitude of jobs I applied for (none of which received a yes or no). \n\nI have been sending unsolicited applications en masse to every company nearby, alas without much success. \n\nPlease share your tips!",
    "title": "How do you look for a new job? Need your wisdom",
    "subreddit": "careerguidance",
    "timestamp": 1617475533,
    "score": 5,
    "keyword": "black director"
  },
  {
    "text": "How to get on the fast track? I’m a bioengineer in big pharma and don’t have anyone to ask for help. I’ve been looked over several times for promotion and feel that part of the reason might have been discriminatory. I’ve applied numerous times and feel that I’m honestly just not getting anywhere. My metrics are all pristine, and I’ve even been heavily involved in employee resource groups at my job. \nOthers I’ve helped train in my role succeed and even get promoted over me and its very frustrating. I have the same degree’s and qualifications as others and since my company is growing at such a rapid pace I’ve seen this happen numerous times. \n\nPart of it seems like its routed in office politics, but its getting to the point where it feels blatantly insulting and noticed by other colleagues who aren’t involved. I’ve applied 4 times and not received this management position. Hiring Managers have given me feedback, and we’ve generated plans together with goals that i have since achieved. However despite accomplishing these goals I’ve still not been chosen for a promotion. \n\nWe have a black employee resource group at my job and it even feels weird to bring up there. I don’t want to branded as the employee that cried/ pouted when he didn’t get what he wanted. I’m currently studying for the GMAT and hope to find employment elsewhere or go back to school in the next year. I know getting a managerial role will only look better on applications so I feel that I cannot leave.  \n\nI’ve always heard my parents stories of how handicapping race can be in America, however this is genuinely the first time I’ve felt it to this scale. Not getting promoted in the last few years has dictated my purchasing of a house. What should I do?\n\nUPDATE: Just wanted to send out an update. I spoke with a director in our Black erg and she recommended that i speak with a couple of directors of color and meet with them monthly to plan out career goals and eventually meet our new cheif diversity & inclusion officer. I’m not entirely sure whats going on but honestly having people in the company to talk to this about who seem interested in progressing my career feels so much better. I’ll speak with them and let you guys know how it goes.",
    "title": "How to get on the fast track?",
    "subreddit": "careerguidance",
    "timestamp": 1617997833,
    "score": 3,
    "keyword": "black director"
  },
  {
    "text": "This was just sent to the entire US team at PwC.  \n\nDear friends and colleagues,\n\nUnfortunately, today is my last day at the firm. Many of you have reached out to me over the past few months, but I have not responded to your notes. This is not because I have fallen out of our friendship, but because I have lost faith in what our firm stands for. And here is why. Our firm discriminated against me by repeatedly denying me a promotion because I am a Black woman who was not born in the US. When I complained about this discrimination, the firm retaliated against me which culminated in my termination today. I have shared my story below and hope you will take the time to read it.   \n\nAbout 12 months ago, as our country and the world experienced a social movement and reckoning over racism, our leaders seized every opportunity to tell us that they were rallying behind the end of race discrimination, in particular in the workplace. At the same time, however, they were also denying me the promotion to Director for the third time because of my race, color, national origin, and sex.\n\nThe Partners and Directors team that helped me prepare my case worked with me to escalate this injustice at top levels of our firm. Every single leader - FS Diversity & Inclusion Leader, FS Leader, Strategy& Leader and a few more - chose to look the other way and protect the other few Partners who had been using untruthful facts to misrepresent my performance and relationships with clients during CRTs in May 2019, November 2019, and May 2020.\n\nBehind the façade of its outward messaging regarding diversity, inclusion, and antidiscrimination, PwC fosters a work culture that stifles the development of Black, female, and non-native born employees, preventing them from achieving promotions and advancing within the Firm. This comes as no surprise when we look at the composition of the PwC leadership team, which fosters a discriminatory culture.\n\n* The U.S. leadership team, comprised of 19 members, is staffed with only one Black woman and two Black men. \n* The U.S. Board of Partners, comprised of 22 members, has only one Black man among its members. \n* As for Strategy&, there is only one Black man and not a single woman amongst 23 global leaders. \n\nAren’t we religiously telling our clients that effective diversity and inclusion starts at the top? Aren’t we telling our executive clients that they have to walk the talk to lead real cultural change? So why is it that we keep talking the talk and placing our “efforts” in programs that do not drive any real change in the status of Black people at this firm?  As someone who specializes in culture and gives this very advice to our clients, I find myself unable to escape this dissonance between what I tell them to do and what I know PwC has failed to do internally.\n\nAs of the third discriminatory denial of my promotion, I was the only Black left within FS Strategy&’s non-leadership team. As one Partner put it at the time “you are the last one standing”. Why is it that being Black at this firm has to be a constant uphill battle to prove that you deserve your seat? Why is it that I have had to consistently wait 1-2 more years on average to get the acknowledgements and promotions that my peers have gotten, when I keep bringing stellar performance reviews into CRTs?\n\nThis is to say that discrimination has been a reality for me for a long time, and has simply reached the point where my constant optimism can no longer make sense out of it. It has been a toxic force that does everything it can to:\n\n* Take away your dignity\n* Make you feel weak\n* Portray you as a poor performer and third-class consultant\n* Prevent you from bringing your authentic self to work; it’s not enough to be a great team player and high performer, you have to put “who you are” to the side - remind me what D&I is again?!\n* Push you out of the firm, because not even our leaders would stand up to do the right thing\n\nDuring the May 2020 social movement, one Partner reached out to me, after being summoned to, saying “(Name removed), I read Maya Angelou’s Caged Bird”. What?! To every non-Black Partner and staff at this firm, we do not need you to tell us about the Black stories or authors that you’re reading or the Black friends that you have or the African countries you have visited. What we need is for you to demonstrate true empathy when you see unfairness being done to a Black employee. STAND up, SPEAK up, CALL out. Call out colleagues on the offenses they’re perpetrating. I would not be in this position, feeling I must speak up and call out PwC’s hypocrisy to all of you, if the Partners in the CRT room had spoken up and called out their peers when they saw them derail the process for my CRT reviews which led to a biased outcome.\n\nThat offenders rarely get held accountable goes beyond the fact that our Partners and leaders sadly do not speak up when they should. The Firm continuously protects those offenders, leaving more Black, female, and other minority employees at their mercy. How, you may wonder? Go take a look at the contract PwC made you sign.\n\nPwC forces employees to sign binding arbitration agreements that rob them of their ability to have their day in court and to publicly call out PwC’s discriminatory, retaliatory, and other unlawful conduct. As a result, it is no surprise that PwC makes little to no change to its policies, procedures, and practices despite the multiple cases that have been filed for discrimination and retaliation. \n\nI will leave you with this. Sexual harassment used to be hidden under such “keep it secret” arbitration agreements until the MeToo movement. Many leading companies, including Google and PwC, excluded it from the arbitration agreement as a result of social pressure. This being said, Google also excluded “Race Discrimination” from its arbitration agreements, recognizing how much hiding discrimination at work behind the veil of confidential arbitration hindered the career advancement of Black employees. Why is it that our firm, a leader in its own territory, claiming to be a leader for our cross-industry national and global clients, cannot take the same simple step when it comes to ending racism and discrimination in the workplace? How much longer would our leaders turn away from doing the right thing to protect themselves if they knew they could be held publicly accountable? When will they finally do something that actually moves the needle and makes this firm a place where Black and other minorities don’t have to do three times more to prove their worth?\n\nDear colleagues and friends, I have enjoyed working with many of you and wish you the best of luck. Hopefully we can stay in touch.  \n\nIn good hope,\n\n(Name removed)\n\n—————-\nUPDATE - Ethics & Compliance has responded:\n\nEvening all--\n\nI am writing about an email which you may have received today from a former PwC US employee regarding her time at the firm that was sent to an internal distribution list. We are aware of the former employee’s concerns and we are addressing them.  Please know we take all allegations of firm policy violations seriously. \n\nOut of respect for the privacy of all parties involved, we are unable to discuss specific details of this matter.  However, we continue to encourage our employees to raise any concerns that they may have by speaking with a member of our People team or by contacting our confidential Ethics HelpLine, anonymously if preferred. PwC strictly prohibits retaliation against anyone for raising concerns in good faith.\n\nIf you have any questions regarding this matter, please contact the Ethics HelpLine.  Thank you.",
    "title": "This was just sent to the entire US team at PwC.",
    "subreddit": "Accounting",
    "timestamp": 1627334457,
    "score": 1569,
    "keyword": "black director"
  },
  {
    "text": "First Week as Director of Finance in a small non-profit Good Evening everyone,\n\n&#x200B;\n\nFirst up I am going to cross post this to a couple reddits since it does not seem to have a specific place that is perfect for it, if you have a suggestion of another reddit to post it to that would be better please let me know!\n\n&#x200B;\n\nBit of background:\n\nI started a position as director of finance for a small (5 staff, 50 faculty) non-profit this week. There is no direct handover of duties from the previous director who left about a month before I started.  The CEO has enough experience with the systems to work through the payrolls in between and some bills were paid but not entered anywhere.  With the small staff I will be managing everything from basic bookkeeping to working with the finance committee of the board. \n\n&#x200B;\n\nMy Current plan\n\nI am going to focus on getting the items entered that were missed, learn how to do payroll and process that and then close the month of March since that has not happened yet.  After that I want to get through to the audit at fiscal year end in June.  Beyond that I would like to make some larger changes but that is for some other post in the future. \n\n&#x200B;\n\nMy Questions:\n\n1. Where would you start?  There is a ton of information to take in and a lot of work to be caught up on.  What would you start with?\n2. What would you plan to do in the first week? Month? Year?\n3. Does anyone have any experience with the BlackBaud program Financial Edge? 99% of my experience is with quick books and sage. Any tips or tricks for this program would be appreciated. It is an older version since they have not paid to keep up with it, 7.8 I believe. \n\n&#x200B;\n\nI would greatly appreciate any help and all thoughts and ideas are welcomed!",
    "title": "First Week as Director of Finance in a small non-profit",
    "subreddit": "Accounting",
    "timestamp": 1618277875,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "This was just sent to the entire US team at PWC Dear friends and colleagues,\n\nUnfortunately, today is my last day at the firm. Many of you have reached out to me over the past few months, but I have not responded to your notes. This is not because I have fallen out of our friendship, but because I have lost faith in what our firm stands for. And here is why. Our firm discriminated against me by repeatedly denying me a promotion because I am a Black woman who was not born in the US. When I complained about this discrimination, the firm retaliated against me which culminated in my termination today. I have shared my story below and hope you will take the time to read it.   \n\nAbout 12 months ago, as our country and the world experienced a social movement and reckoning over racism, our leaders seized every opportunity to tell us that they were rallying behind the end of race discrimination, in particular in the workplace. At the same time, however, they were also denying me the promotion to Director for the third time because of my race, color, national origin, and sex.\n\nThe Partners and Directors team that helped me prepare my case worked with me to escalate this injustice at top levels of our firm. Every single leader - FS Diversity & Inclusion Leader, FS Leader, Strategy& Leader and a few more - chose to look the other way and protect the other few Partners who had been using untruthful facts to misrepresent my performance and relationships with clients during CRTs in May 2019, November 2019, and May 2020.\n\nBehind the façade of its outward messaging regarding diversity, inclusion, and antidiscrimination, PwC fosters a work culture that stifles the development of Black, female, and non-native born employees, preventing them from achieving promotions and advancing within the Firm. This comes as no surprise when we look at the composition of the PwC leadership team, which fosters a discriminatory culture.\n\nThe U.S. leadership team, comprised of 19 members, is staffed with only one Black woman and two Black men. \n\nThe U.S. Board of Partners, comprised of 22 members, has only one Black man among its members. \n\nAs for Strategy&, there is only one Black man and not a single woman amongst 23 global leaders. \n\nAren’t we religiously telling our clients that effective diversity and inclusion starts at the top? Aren’t we telling our executive clients that they have to walk the talk to lead real cultural change? So why is it that we keep talking the talk and placing our “efforts” in programs that do not drive any real change in the status of Black people at this firm?  As someone who specializes in culture and gives this very advice to our clients, I find myself unable to escape this dissonance between what I tell them to do and what I know PwC has failed to do internally.\n\nAs of the third discriminatory denial of my promotion, I was the only Black left within FS Strategy&’s non-leadership team. As one Partner put it at the time “you are the last one standing”. Why is it that being Black at this firm has to be a constant uphill battle to prove that you deserve your seat? Why is it that I have had to consistently wait 1-2 more years on average to get the acknowledgements and promotions that my peers have gotten, when I keep bringing stellar performance reviews into CRTs?\n\nThis is to say that discrimination has been a reality for me for a long time, and has simply reached the point where my constant optimism can no longer make sense out of it. It has been a toxic force that does everything it can to:\n\nTake away your dignity\n\nMake you feel weak\n\nPortray you as a poor performer and third-class consultant\n\nPrevent you from bringing your authentic self to work; it’s not enough to be a great team player and high performer, you have to put “who you are” to the side - remind me what D&I is again?!\n\nPush you out of the firm, because not even our leaders would stand up to do the right thing\n\nDuring the May 2020 social movement, one Partner reached out to me, after being summoned to, saying “(Name removed), I read Maya Angelou’s Caged Bird”. What?! To every non-Black Partner and staff at this firm, we do not need you to tell us about the Black stories or authors that you’re reading or the Black friends that you have or the African countries you have visited. What we need is for you to demonstrate true empathy when you see unfairness being done to a Black employee. STAND up, SPEAK up, CALL out. Call out colleagues on the offenses they’re perpetrating. I would not be in this position, feeling I must speak up and call out PwC’s hypocrisy to all of you, if the Partners in the CRT room had spoken up and called out their peers when they saw them derail the process for my CRT reviews which led to a biased outcome.\n\nThat offenders rarely get held accountable goes beyond the fact that our Partners and leaders sadly do not speak up when they should. The Firm continuously protects those offenders, leaving more Black, female, and other minority employees at their mercy. How, you may wonder? Go take a look at the contract PwC made you sign.\n\nPwC forces employees to sign binding arbitration agreements that rob them of their ability to have their day in court and to publicly call out PwC’s discriminatory, retaliatory, and other unlawful conduct. As a result, it is no surprise that PwC makes little to no change to its policies, procedures, and practices despite the multiple cases that have been filed for discrimination and retaliation. \n\nI will leave you with this. Sexual harassment used to be hidden under such “keep it secret” arbitration agreements until the MeToo movement. Many leading companies, including Google and PwC, excluded it from the arbitration agreement as a result of social pressure. This being said, Google also excluded “Race Discrimination” from its arbitration agreements, recognizing how much hiding discrimination at work behind the veil of confidential arbitration hindered the career advancement of Black employees. Why is it that our firm, a leader in its own territory, claiming to be a leader for our cross-industry national and global clients, cannot take the same simple step when it comes to ending racism and discrimination in the workplace? How much longer would our leaders turn away from doing the right thing to protect themselves if they knew they could be held publicly accountable? When will they finally do something that actually moves the needle and makes this firm a place where Black and other minorities don’t have to do three times more to prove their worth?\n\nDear colleagues and friends, I have enjoyed working with many of you and wish you the best of luck. Hopefully we can stay in touch.  \n\nIn good hope,\n\n(Name removed)",
    "title": "This was just sent to the entire US team at PWC",
    "subreddit": "consulting",
    "timestamp": 1627343458,
    "score": 1239,
    "keyword": "black director"
  },
  {
    "text": "Director telling me to dye my hair back to black for a client meeting I'm still new to the firm and I’m gonna go to the first client meeting soon. And during a prep meeting, my director pointed out that my hair is too light-colored(which is light brown) and told me to dye it black since the client is “conservative”.\n\nNot sure how to take it. \n\nIs it rather a common thing since consulting is client-facing work?\n\nOr is it just a result of an outdated culture of certain offices?\n\nOr is it the manifestation of insecurity for the project?! (we don't have expertise so at least we need to look formal)\n\nAlso wanna know how to push back for those invasive comments :/",
    "title": "Director telling me to dye my hair back to black for a client meeting",
    "subreddit": "consulting",
    "timestamp": 1628527515,
    "score": 91,
    "keyword": "black director"
  },
  {
    "text": "The Colorism in Media Needs to Stop. *Rant* I just saw this post in Twitter and I feel like most shows and movies nowadays is only showing mixed women or lightskin black women. The BIGGEST offender is Netflix in which all of their new stuff is just that. Brown and dark skin women aren't even being represented anymore. How is it that the 90's had better representation?\n\nIt's even more fucked up that these casting directors will cast someone lighter when the original character is canonically darker (the hate u give, raising dion, etc). Or even worse in the film, The Harder They Fall. Taking a real dark skin, black, plus sized woman and making her a young, biracial , skinny girl?? This isn't okay especially when there's so many actresses that could have played the part and that looks like Mary Fields.\n\nWe also need to hold the actresses accountable too. Why are you auditioning for roles that was meant for darkskin women? Its already hard for darkskin women to get roles but now you want to take roles that's not even meant for you? It's also very irritating that these actresses always make these statements of 'I understand my privilege...I know Colorism exist'. If you get all that, stop being complicit in the problem. The only lightskin actress I know that is actually trying to not be involved with stealing roles is Zendaya. \n\nhttps://twitter.com/chaoticblkgirl/status/1458258476443054094?s=21",
    "title": "The Colorism in Media Needs to Stop. *Rant*",
    "subreddit": "blackladies",
    "timestamp": 1636721100,
    "score": 211,
    "keyword": "black director"
  },
  {
    "text": "Crystal Windham. Executive Director of Global Industrial Design at General Motors. First Black American female director at GM (2008), her awarded car interiors include the Chevrolet 'Malibu' (2016) and 'Impala' (2014). She became Cadillac's Interior Design Director in 2016.",
    "title": "Crystal Windham. Executive Director of Global Industrial Design at General Motors. First Black American female director at GM (2008), her awarded car interiors include the Chevrolet 'Malibu' (2016) and 'Impala' (2014). She became Cadillac's Interior Design Director in 2016.",
    "subreddit": "blackladies",
    "timestamp": 1634116640,
    "score": 130,
    "keyword": "black director"
  },
  {
    "text": "Warm cities to live in that are black-friendly? (US) Currently living in NYC and I’ve got about two winters left in me and then I can’t take it anymore. Any suggestions for another city in the US that has relatively warm weather year round, is black-friendly/diverse and has decent job opps? I’m an art director/graphic designer hoping to either keep my job & work remotely or find a new job in the new city.",
    "title": "Warm cities to live in that are black-friendly? (US)",
    "subreddit": "blackladies",
    "timestamp": 1628604352,
    "score": 90,
    "keyword": "black director"
  },
  {
    "text": "\"Them\" and Black Trauma's Commodification Honestly, I'm not gonna spoil the show for those who haven't seen it, but y'all... this series was physically painful for me to watch. And not in an \"I feel like I have to really introspect on this\" kind of way, but just in a \"This series was violence on black bodies from beginning to end\" kind of way.\n\nI just don't understand how an executive watched the entire series and gave it the green light. There isn't a single moment of brevity. I won't go into the details, but please, make sure you're in a good place mentally if you watched this series. There are multiple episodes that are almost entirely devoted to black pain, and that's not an exxageration. \n\nConsidering that there was only one black director (Check the IMDB), I can see why no one stopped production.\n\nI would love to hear from people who have any thoughts on the commodification of black trauma, or even people who liked the show. Any thoughts?",
    "title": "\"Them\" and Black Trauma's Commodification",
    "subreddit": "blackladies",
    "timestamp": 1618020070,
    "score": 31,
    "keyword": "black director"
  },
  {
    "text": "Greenpeace appoints Ebony Twilley Martin as its first Black co-executive director",
    "title": "Greenpeace appoints Ebony Twilley Martin as its first Black co-executive director",
    "subreddit": "blackladies",
    "timestamp": 1631145962,
    "score": 28,
    "keyword": "black director"
  },
  {
    "text": "Help dealing with a super toxic/ racist work environment For background im black 23 year old Muslim woman and work for a super large media company based in London.  Its my second corporate job after university.  My last role was for the same company but in a start up section (if that makes sense) and the vibe was super chill.  We could work from home, the director wore jeans and t shirts and everyone was super chill and pretty diverse.\n\nI have now moved to a different role in the company in the main area of business and it is super corporate.  It is mostly white and most of these people are straight out of Oxford and private schools.  I am the only black woman out of 90 people and 1 of 2 black people and I cannot help but feel like I stand out especially because in my old team I had a older black woman who acted as my big sister.  In my first week whilst on a call with the Italian and German markets they remarked they could not have a 'black man' in a TV ad as it doesn't work in their markets I had my camera off so they weren't aware a black person was  on the call ( my name is generically ethnic) however I was told this was going to be taken very seriously and had a meeting with my team director who remarked that he was indian and one of the people on the call had a black husband.  This made me feel super disheartened as they were once again resorting to the black friend trope but I tried my hardest to move on.\n\nThe next week I was sitting in a communal area when another director was speaking to two white colleagues, he remarked that he used to live in a area of North London ( which is very nice but has a significant black population) and joked that he called the area stab central before laughing.  This hit very close to home as I am from a neighbourhood where stabbings are unfortunately quite common, one of my friends was stabbed a couple of years ago and now is paraplegic and my younger sister witnessed a classmate being stabbed to death on the train and is still traumatised.  This white privileged man joking about London's stabbing epidemic made me so mad and disgusted and I spoke to a colleague who was active in the diversity network (east asian male) about how horrified I was.  He proceeded to say that this kind of language is normal and he has heard way worse, so much for POC solidarity.  I spoke to a colleague and she said it was horrible but I don't think anything is being done about this. \n\n I am 3 weeks into the job and honestly I feel like the environment is so toxic I don't think I can last much longer.  What should I do, its a very hierarchical organisation so people will be scared to talk against directors if I need witnesses and such but I really don't want this to be swept under the rug and I really want to make things better for the other young working class black girls coming up after me. Any advice is appreciated.  Thanks so much!!",
    "title": "Help dealing with a super toxic/ racist work environment",
    "subreddit": "blackladies",
    "timestamp": 1638981406,
    "score": 18,
    "keyword": "black director"
  },
  {
    "text": "Is this all we have to look forward to when we reach our golden years? My family knew Juanita Caballero, she was my parent's friend and neighbor. Everyone knew her as \"Jenni\". She was found dead in her apt. in my late father's building, strangled with the cord from her own telephone. \n\nI remember her warning my mother and I as we entered the lobby one day, on the way to visit my father. She said something bad was happening, a lady died and it didn't seem right. \n\nShe was one of three victims killed by a serial killer who should have easily been caught after the first victim, Myrtle McKinney was killed in 2016. She had a knife wound on the back of her head and broken ribs, yet officials still initially ruled her death a result of natural causes. \n\nMcKinney was stabbed. In the head. \n\nIf it weren't for the funeral director finding the wound and making a fuss, no one would have done anything. And that's pretty much what they did For 5 years. Absolutely nothing. Which allowed another victim Jacolia James to be murdered, followed by Caballero.\n\nThis building is SUPPOSEDLY supervised by a watchman who's only function is to sit and watch as the elderly and their visitors struggle to enter the building, as they are locked out because the security door is usually broken. \n\nThat's right. The sorry excuse for a guard they have posted there won't even put down his crossword puzzle to get up from his seat to open the door for known residents-- and the intercom system was almost always broken when I visited my father. \n\nThis building SUPPOSEDLY should have had cameras installed on every floor. Why weren't there any?\n\nThis building is SUPPOSED to be limited to housing for senior citizens only, so why was a middle aged murderer able to move into his decreased brother's apartment and stay there for so long?\n\nThe answer to those questions is the same reason why it took 3 murders and 5 years to catch a serial killer that lived right in the building: because they don't care. \n\n So many news articles are framing it to make it seem as though police were completely stumped even though they were working hard to crack the case, but the truth is they weren't doing a damned thing for 5 years.\n\n\n[Here's just one of many bullshit, cop pandering articles. ](https://abc7ny.com/carter-g-woodson-nycha-senior-housing-development-murders-elderly-brooklyn/9875042/)\n\nBlack life has such little value in this country.\n\nSince my father's unnecessary and avoidable death due to malpractice, government failure and just plain old not giving a fuck, I've felt more unprotected and quite franky country-less than ever. I am completely overcome with pessimism.\n\nIt finally sank in that those of us who avoid being murdered by cops, dying in jail, taken by rampant poverty-driven crime and mental illness, falling victim to racially driven violence or ignored by the Healthcare system until we succumb to prolonged illness have this kind of miserable neglect to look forward to.\n\nHow long are we supposed to clamor to hope? How many more riveting speeches and Kumbaya's are we supposed to sit through until an entire generation of my people can live their lives without the ever present fear of falling victim to circumstances we didn't cause have no control over? \n\nMay you be remembered and may your families find some sort of justice Jacolia James, Myrtle McKinney and Juanita \"Jenni\" Caballero because I am so sick of saying \"rest in peace\".",
    "title": "Is this all we have to look forward to when we reach our golden years?",
    "subreddit": "blackladies",
    "timestamp": 1611341935,
    "score": 12,
    "keyword": "black director"
  },
  {
    "text": "Rabbi Sandra Lawson, who is also Black and queer, will become Reconstructing Judaism’s inaugural director of racial diversity, equity and inclusion next month. (Reconstructing Judaism is the central organization of the Reconstructionist movement of Judaism.)",
    "title": "Rabbi Sandra Lawson, who is also Black and queer, will become Reconstructing Judaism’s inaugural director of racial diversity, equity and inclusion next month. (Reconstructing Judaism is the central organization of the Reconstructionist movement of Judaism.)",
    "subreddit": "blackladies",
    "timestamp": 1614224255,
    "score": 12,
    "keyword": "black director"
  },
  {
    "text": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community Related post: [Bao Tran: Hollywood Wanted Me to Make My Martial Arts Characters White, But My Ancestors Wouldn’t Have It](https://np.reddit.com/r/asianamerican/comments/n6vh71/bao_tran_hollywood_wanted_me_to_make_my_martial/)\n\nNotes from [Well Go USA's press kit](https://www.wellgousa.com/films/the-paper-tigers):\n\n**DIRECTOR’S STATEMENT**\n\nTell someone you’re making a Kung Fu movie and everybody has a clear idea of what they’re in for. For a  genre that has such vivid connotations also comes preconceived expectations and, dare I say,  stereotypes.\n\nA Kung Fu movie about out-of-shape fighters should have been easy for us to finance, but it took us 9  years of conversations like this:\n\n**Savvy White Financier**: “I love the Kung Fu movies. Love the wirework where they fly around, so  cool.”\n\n**Me**: “Great. Except we’re not doing wirework, our characters are schlubs past their prime. We want to  show them struggle with gravity, not defy it.”\n\n**SWF**: “But you gotta have the dubbing, that’s so hilarious.” \\*mimes dialogue while contorting their  mouths\\*\n\n**Me**: “Yeah no, our characters speak English in their own voices without any accents.”\n\n**SWF**: “They’re all American?”\n\n**Me**: “Ensemble piece with Asian and Black American lead characters. See, it’s a reflection of how I grew  up in Seattle…”\n\n**SWF**: “Can you change them to be white?”\n\n**Me**: “Hm. Okay. Well, this is about characters stuck between two cultures. The Kung Fu world is steeped  in Confucian, arcane, hierarchical values that is so at odds with modern American sensibilities.”\n\n**SWF**: “Bruce Willis!”\n\n**Me**: “Sorry?”\n\n**SWF**: “If you get Bruce Willis, we’ll fund your movie. Right now it’s too risky with no real names  attached. There’s no bankable Asian or Black stars that can sell your movie.”\n\nThen you have the militant fellow Asian American:\n\n**Militant Asian American:** “Why are you setting our people back? Hollywood has only portrayed us  Asian men as Kung Fu masters or Triad henchmen. We have to tell different stories.  #RepresentationMatters!”\n\n**Me:** “But I like Kung Fu. And Jackie Chan was really the one who inspired me to make movies.”\n\n**MAA:** “No, you need to do something like The Farewell or Saving Face. You know, real Asian American  experience stories.”\n\n**Me:** “Can’t we do it all and support each other in telling whatever stories we want to tell? This is not  Highlander, there can be more than one.”\n\n**MAA:** “You’re just perpetuating stereotypes. Bullies used to call me Bruce Lee and tease me because  they thought all Asians could do Kung Fu.”\n\nSo if your tribe doesn’t find you, you go out and build it. We eventually turned to Kickstarter and our local  community of private investors. The ones who “got it” recognized themselves in the story and/or Asian Americans in lead acting, producer, and director roles. But through it all, we always aimed for more,  hoping to expand the idea of what a Kung Fu movie or an Asian American film could be.\n\nI found this in my old director notes, written for various grant proposals or some investor documents  throughout the years: “We want that blue-haired grandma in Iowa, who has not a mean bone in her  body, to root for Danny by the end of the movie.”\n\nAt the end of the day, you can’t please everyone, but watch us try. Grannies of Iowa, be ready!\n\n\\--\n\nBao Tran",
    "title": "The Paper Tigers - Director Bao Tran's Press Notes - whitewashing from Hollywood and also getting backlash from Asian-American community",
    "subreddit": "asianamerican",
    "timestamp": 1622247264,
    "score": 9,
    "keyword": "black director"
  },
  {
    "text": "Human Rights Activists cries foul over U.N. election of Iran to Commission on Women’s Rights   \n\nUN Watch is calling on U.S. Ambassador Linda Thomas-Greenfield and EU states to condemn the UN’s election of Iran to a 4-year term on its Commission on the Status of Women, the “principal global intergovernmental body exclusively dedicated to the promotion of gender equality and the empowerment of women.”\n\nThe vote yesterday by the UN’s Economic and Social Council, reported first by UN Watch, sparked outrage among human rights activists. “Electing the Islamic Republic of Iran to protect women’s rights is like making an arsonist into the town fire chief,” said Hillel Neuer, executive director of UN Watch, the Geneva-based human rights group. “It’s absurd — and morally reprehensible. This is a black day for women’s rights, and for all human rights,” said Neuer.",
    "title": "Human Rights Activists cries foul over U.N. election of Iran to Commission on Women’s Rights",
    "subreddit": "Feminism",
    "timestamp": 1619091913,
    "score": 15,
    "keyword": "black director"
  }
]