[
  {
    "text": "What would you all think about a new podcast / videos/ blog where anonymous recruiters review resumes? - A kind of inside look at shortlisting Hi folks, \n\nI work in the education-to-careers space and as a side project am exploring different ways to capture authentic recruiter perspectives on candidate work experience / education / credentials etc - so people can better prioritise their time in preparing for certain jobs, and also they can better shape their resumes.\n\nOne of the projects I'm considering would be a kind of 'behind the scenes' look at recruiters reviewing resumes / applications.\n\nI'm considering either a podcast / youtube channel / or blog series where every session I have a couple verified but anonymous recruiters (and maybe hiring managers) talk about a handful of anonymised resumes for a different position.\n\nThe recruiter anonymity is important so they can speak authentically - but I would reveal high level distinguishing features like in-house vs. agency, sector, years of experience, high level company culture etc. There aren't a lot of scenarios where recruiters can be candid about resumes because they are company representatives and there is PR considerations. As a result - hiring is this 'black box'. I have a fair few recruiter friends that wish they could give more honest feedback to people - but can't.\n\nThe focus would be on early career roles where there is a fair bit of consistency across different organizations. And would primarily be in-house recruiters not agency.\n\nAm thinking that it would be 'stream of consciousness', or a couple recruiters talking to eachother - that is then transcribed, and the anonymous resumes being discussed available for people to look at for reference. Could also do video - highlighting the resume sections being talked about at the moment. Another format would be to record voice and screen as a recruiters go through a resume shortlisting process - so can see how they screen and whittle down etc. Possibly in a live Applicant Tracking System pre-populated with our dummy resumes.\n\nObviously this couldn't be a perfect representation. Anyone who's being observed is going to adjust their behaviour. There is no way around that. As well- most recruiters aren't verbalising their thoughts when initially shortlisting, so this is somewhat unnatural. And every recruiter is different so it would be important to include a variety of perspectives and highlight why those perspectives shape their thinking. But I am keen to do something to try and give candidates a kind of 'fly on the wall' insight to some of the things considered, and what signals recruiters actually look at for various skills and competencies.\n\nBeen kicking this idea around a while, thought I'd see what a wider audience thinks\n\n1. Is this something that sounds generally useful to you / job seekers / people preparing for career transitions?\n2. From what I've described or any other ideas - What format would be the most useful to distribute this in?\n3. I had planned to work from fabricated resumes - but I've had some suggestions that some people might be game to submit their actual (anonymised) resume in order to get the authentic feedback, even though it would be published. What are your thoughts on that?\n\nPerspectives from recruiters on this are very welcome too !\n\nThanks so much!",
    "title": "What would you all think about a new podcast / videos/ blog where anonymous recruiters review resumes? - A kind of inside look at shortlisting",
    "subreddit": "jobs",
    "timestamp": 1548286514,
    "score": 18,
    "keyword": "black manager"
  },
  {
    "text": "Job application tips from a seasoned securer of difficult roles. Hello guys, I hope you’re all well!\n\nI just wanted to weigh in with some tips and advice on how to really outshine other candidates in your field, and hopefully, help you land the job you want! I have a few secrets in here that I really don’t want to be sharing, but I will anyway because they are that good in interviews!\n\nNow I know that I’m some random nobody on the internet and you don’t know me, so before I begin, I’ll tell you a little about me and my path.\n\nI’m a systems designer and engineer in the TV/Film industry. I’ve travelled a lot of the world building these systems and as of next year, my salary will be nearly 4x what I started on. I’ve been graduated for four years and I started as a warehouse assistant on £13K. Of the 8 career-progressing jobs I’ve applied for, I’ve been interviewed by all, and received offers from 7/8. Pretty good success ratio!\n\nSome disclaimers. First, a lot of these tips are cross-applicable when it comes to field, but some won’t be. I’ll try to make it a one-size-fits-all, but do bear in mind that you may not be able to tick all the boxes. Second, I’ll assume you’re applying for a job you can actually do. So don’t get upset if you’re trying to be a rocket scientist with zero experience and you don’t get interviewed.\n\nSo, to begin...\n\n1) Understand that regardless of skills, attitude is what matters most.\n\nSkills can be taught; attitude can not. If you’re missing one or two skills from the job description, but show a willingness to learn and genuine passion for learning, it’ll stand you in great stead. Obviously if you’re trying to apply for a job where you need C# experience and you’ve never written a line of code in your life, don’t expect to get very far.\n\n2) Know that there is ALWAYS someone out there better suited to the role than you.\n\nAccept this, and it’ll take away some of the pressure of applying. See every job as a shot in the dark, but approach the application with the “what’s the worst that could happen” mentality. After all, the worst that could happen is you get told no. No biggie.\n\n3) Learn how to build a killer CV.\n\nThis goes for beginners and mid-level applicants. My CV when I was green was 1.5 pages long. Now, it’s 3 pages, because experience. The size of your CV will indicate how much experience you have, so if you’re applying for an entry-level role with a 3 page CV, you better have a damn good reason for having that third page.\n\nKnow when you’re waffling and know when it’s a boring read. Have a friend read it and critique it hard. Don’t use heavy-on-the-eyes fonts, but don’t be afraid to get creative. Use serif fonts for headers and sans serif fonts for content. If you want to underline words, considering using an almost-black colour. Makes it easier on the eyes. Keep colours greyscale. Varying shades of grey and black work really well together. For example, my header reads:\n\nJordan Toner, BSc. My name is in black, but the BSc is in a dark grey and italics. Really subtle, but just gives it that mirror shine. \n\nIf you can, learn to enjoy creating the CV. A good CV will look and read a bit like a menu. It’ll be nice to look at and won’t burn your head out with information overload.\n\n4) Cover letters should be bold and daring, but NOT cocky.\n\nThis is a tricky one. Your cover letter is not an extension of your CV. It’s your chance to tell your potential future employer what you can bring to the table, with examples. There’s a fine balance between arrogance and confidence, so find that middle ground as best as possible. Stick to facts, but don’t brag.\n\nFirst paragraph should introduce you, your background and your skill set. Then, second paragraph should be bullet points, like this:\n\n“If I may, I’d like to document what I could potentially bring to your team:\n\n* skill 1, example\n* skill 2, example\n* skill 3, example”\n\nParagraph 3 in your cover letter is your chance to show research you’ve done. This is arguably the most crucial part. Look up big clients the company landed, research their growth figures, linkedin their high-profile staff members and success stories. It looks really good if your name pops up on linkedin as having looked at the hiring managers profile. Show them you want to love the company as much as they do.\n\nThe closing paragraph should be something akin to:\n\n“I understand the need for hardworking and efficient staff and I would really appreciate the opportunity to demonstrate my capacity for this at interview. If you feel there may be mutual interest, please let me know at your earliest convenience blah blah blah”.\n\nIf you do all these right, you should be able to secure an interview. Congratulations! Believe it or not, the hard part is over. (Really!).\n\n&#x200B;\n\n&#x200B;\n\nNow, to landing the role. Here is easily my biggest asset, the best thing I can offer you, as I can guarantee that out of the 5-10 people interviewing, all of about 2 people will think to do this.\n\n5) The Application Pack: standing out from other applicants.\n\nPut together a document that details the company, the role, your profile, strengths and weaknesses. Make a cover for it using their logo.\n\nSo, page 1 should feature their logo in the middle, along with text below it reading:\n\nYour Name Company Name Interview, Date. Application Pack.\n\nThen, do a paragraph on the companies history. Then another on recent news of the company. Then, do a brief About You section. Then, an About The Role section. Then a strengths and weaknesses section. Then a closing statement on how well you could positively impact their business. Make this document about 3/4 pages long. Include images to break up the blocks of text.\n\nThis document is KILLER. Nobody ever thinks to do these and they are so good for helping you stand out. It shows the potential employer that this ain’t no half-assed thing for you. You’re invested, and you’ve not even got the job yet.\n\n7) The Interview!\n\nWhen the interview comes in, act the same way as you would visiting a friends grandparents for the first time. Polite, courteous, not scared to death, warm, charming. Another SOLID piece of advice here is to try and get at least one genuine laugh shared between you and the interviewer. Show them you’re a person, not an awkward sweaty mess. If you ARE a sweaty mess, address it! “God I’ve not sweated like this since *insert funny anecdote*”.\n\nSmile, be open, be cool. After all, you want this person to like you. He’s past looking at your skills now, the reason you’re in front of him is so he can check you’re a regular, easy-to-get-on-with person. People would rather hire a staff member with one or two skills missing that is easy to work with than a genius who has terrible people skills. TRUTH.\n\nIf there are competency-based questions, don’t lie if you don’t know. It makes it awkward for everyone. Tell them you don’t know, but be bashful. “God I don’t know! I probably should do too/Gosh I know this but it’s just left my head!” Try your best to take the seriousness out of it, but don’t make a mockery of it.\n\n8) Post-Interview.\n\nNow to really drive home your presence and impact, have a thank-you letter sitting in your outbox addressed to your interviewer.\n\n“Hi xxxx, I hope you’re well! i just wanted to thank you for taking the time out of your schedule today to see me. The opportunity to represent myself alone has been extremely exciting for me and I hope that I was able to make a lasting impression. (Now mention something that was mentioned in the interview, or ask if the interviewer would be okay with you sending in examples of previous work). Then, end with the killer line: I’d like to wish you every success with your recruitment process. Best Wishes, xxxx. “\n\nThe moment you leave the interview, hit send on that bad boy.\n\nIf you can tick a lot of these boxes, you’ll find offers in your inbox the next day. If you don’t succeed but nailed all these points, you can glean two facts from this. \n\nNumber 1: The person who bested you can only be the perfect candidate, and there is no shame to losing to the perfect candidate. To quote Captain Picard. It is possible to make no mistakes and still lose. \n\nNumber 2: No matter what, that interviewer will ALWAYS remember you.\n\nGo and be great, Kings and Queens! Good Luck in all that you do.\n\nJT x\n\n(If you want any help or advice with your CV/Cover letter/application pack, inbox me. I love this stuff.)",
    "title": "Job application tips from a seasoned securer of difficult roles.",
    "subreddit": "jobs",
    "timestamp": 1563453906,
    "score": 13,
    "keyword": "black manager"
  },
  {
    "text": "How do I get past online applications? I recently graduated with a Masters in mechanical engineering from a good school. I have a number of different directions I could go based on my internships and interests, and have found several entry level jobs that I believe I would do well in. But whenever I apply with the company's job portal, it seems like the application goes into a black hole. Sometimes I get an email confirming my application was received, but it hasn't generated anything more than that, and it's frustrating. \n\nWhat can I do to get noticed? I've usually gotten responses when I'm emailing my resume/cover letter directly to someone (though all of those have led to rejections). Would it be wrong to contact hiring managers on LinkedIn? Send cold emails? Try to call? I just need to get my foot in the door somehow.",
    "title": "How do I get past online applications?",
    "subreddit": "jobs",
    "timestamp": 1562940118,
    "score": 12,
    "keyword": "black manager"
  },
  {
    "text": "My 9 month job search is finally over! (Long post) TL;DR job search of 9 months as a recent college engineering grad is over, if you're having trouble try targeting smaller companies, if your search isn't going anywhere try changing something up in your approach. I wish you all the best of luck!\n\nAfter 9 long months of job searching, I finally received and accepted an offer. I'm so relieved I cant describe it. For those still on the search, especially those who have been at it longer than me: I wish you good luck. Dont give up!\n\nI began job searching in January of this year for a full time engineering job that I could start in May, when I would graduate with my degree. My last semester was keeping me pretty busy, but I spent as much time as I could applying for jobs and going to campus career fairs. Alas, no dice. No biggie, I told myself: not everybody has a job lined up by graduation day. \n\nSummer rolls around, I'm done with school now so I throw all my time at the job search. I have my resume reviewed, and must have submitted 100+ job applications into the black hole that is online ATS software. Spirits are still pretty high, rejection emails aren't getting me down. I have to slow down my job search a bit because I was getting married at the end of July and moving to a new city the week before (side note: 1000% DO NOT recommend moving and getting married in the same week!) I finally got my first interview in mid July from a friends dad who put in a good word for me. Interview went great, but they just started a merger. Told me it could be a month or more before they get back to me, gotta send out offers to the other companies staff, etc. Nothing came of that: 8 weeks later they get back to me saying they picked someone else. Friends dad said they liked me but picked another guy because he had a different engineering degree. Oh well, I'd almost forgotten about them at this point. \n\nWedding and honeymoon are over now, and I'm back on the job search full time. Spend about 3 weeks throwing another hundred applications in the online application abyss. The fall semester career fair at my alma mater is coming up, so I dry clean the suit, shave, get a haircut, and travel 2.5 hours each way from my current city to the college town two days in a row. Spend all day long talking to recruiters and handing out resumes. Got some decent reception from a few recruiters. Good feeling all around about making the effort to go the career fair. If nothing else, it felt good to be doing something other than countless online applications. \n\nOne particular company booth went really well. Good conversation. Said they're looking to hire 3-4 entry level people, that they dont post their jobs online, and that they come to the fair to collect resumes and will give interviews to some people who's resumes they got at the fair. Small company, small engineering team. \n\nA few days later, I get an email inviting me to an interview. Super stoked! Do lots of interview prep work. Interview with the same guy I talked at the career fair. Interview turns out to be nerve wracking and stressful, with a heavy technical portion. At the end though, interviewer tells me \"you know, I really like everything about you. Theres just one red flag\". I ask him about it. He says:\n\n\"Why havent you been hired by anyone else already? You seem like a high quality candidate. That's kind of a red flag for me. \"\n\nBig oof. That one hurt. (I understand now after talking to some people who have been hiring managers before as to why that could be a red flag, but in the moment I just couldn't believe that not having a job only four months after graduation would be a \"red flag\") I do my best to answer cool and collected, explaining that I've been searching for a while, and talking about the life events of the summer. Interview still ends on a decent note and we take a short tour of the office building. Told me I should hear back in a weeks time. \n\nStart driving back home, and I cant help but feel like I blew it. Just wish it could have gone better. The next day I try to get back on the job search grind but I just cant. I feel burnt out, depressed, disillusioned with the job search process. I spent three days doing pretty much nothing. On the fourth day, I decided to get back in the saddle with positivity, change up my approach, try something new, etc. I'm in the middle of reading through posts on r/jobs for inspiration when I get the email notification. It's an offer letter from that company. I couldn't believe it. \n\nSome things I learned along the way that I wanted to share with you guys:\n\nIf you feel like online applications are getting you nowhere: you are right. The job I just took wasnt posted online. Lots of jobs aren't. The robots will toss your application into the abyss after filtering you out for GPA, prior internships(of which I didnt have any), or whatever. \n\nIf you feel like your search isn't getting you anywhere, change something up! Take a different approach. Do something different. I didnt get this job until I made a change in my approach (going to the career fair to talk to people in person) just dont keep banging your head against the wall if it's not getting you anywhere. I did that for months and it sucks. \n\nTarget smaller companies within your industry. This company has a small engineering team and they do all their hiring by collecting resumes at career fairs. The big companies that went to the same fair would just tell people to apply online so that they could throw their resume into the black hole. The smaller companies dont have the luxury of getting thousands of applicants, so when they take your resume they're actually gonna read it. \n\nI wish all of those who are still searching to stay hopeful and positive, even though job searching is about the most hopeless and positivity sucking activity ever. I sincerely hope you get that job you're looking for!",
    "title": "My 9 month job search is finally over! (Long post)",
    "subreddit": "jobs",
    "timestamp": 1568813047,
    "score": 10,
    "keyword": "black manager"
  },
  {
    "text": "Being offered my old job back only a week after a rather bitter “firing” It’s been nine days actually since I was “fired”. I use quotations because I wasn’t fired, I walked out after losing my cool and telling my manager to “figure his shit out”. \n\nPreviously, I was with the company for 5.5 years. I started as most do, as a driver. Eventually, I moved up to an inventory position and was transferred to a warehouse style store to work with their inventory and supplying other stores with supplementary inventory that the main warehouse can’t fill at that time. \n\nThis lead to me quickly being inventory manager. I had one specialist underneath me that handled the main order, overseeing the stocking and any excess help I may need. I handled pretty much everything else that had to do with managing inventory. And this had been the case for about 3.5 to 4 of those 5.5 years.  Over that time, I had tried to talk my manager into cross training employees. He wanted none of it. His mind was set that X position has X responsibilities, nothing more. \n\nIn the four or so months leading up to my “firing”, things had gone downhill. For whatever reason, more and more people were doing less and less work. Drivers not wanting to put parts up, people walking around half the day on their phones, it even effected managers where they were either whining to the GM or just not enforcing things at all because they had given up trying. This put the most burden on my specialist and I because ultimately, our stores core function is inventory. Without inventory being managed and maintained, nobody else can do their jobs properly. \n\nOur storewide inventory came around, and we were about $20,000 over where we should’ve been. In the black is good right?  Not exactly. As I started looking into some of the variance, I realized that our inventory was completely botched. And the more I fixed it, the lower that number got. Eventually the DM gets involved and as I’m explaining, realizes that this happen not only to our store, but every one of his stores. He’s livid but thanks me for finding this.\n\nA few weeks goes by, and I’m dragged into the office by the GM, with the assistant manager. I assume I’m being fired. No, GM starts raining us about how we “care too much about having a correct inventory and not enough about a complete inventory”. He states that going forward, my PRIMARY function is to stock. Put product away. Nothing more. And if I am not follow that directive, both myself and the assistant manager will be written up. We all argued, he overruled, we went about our days. \n\nI did no returns. I did no cycle counts. I did no inventory control of any kind, unless specifically directed. Twice was I verbally chastised for adjusting inventory without consulting the GM. On the day that I walked out, it was because of something as simple as a broken product. Customer wanted 8, we had 6. Why?  Because two were broken and I was told to throw them away. GM would handle the adjustment. But he never did. And now he lost a sale. And it’s MY fault. So I lost my cool, told him how this decision to undermine me was the best thing he could’ve done because now he can finally see what I’m worth and maybe he would figure his shit out. And I left. \n\nI received a call today from said manager. Apologized for “firing me”. Offering me back my position. This also came with a promise of me no longer needing his oversight. And what would equate to about a 32% raise. He said the place has absolutely fallen apart, there are parts of my job that nobody in the building knows how to, there’s no way they can get people trained and get back on top of things the way they were. I told him I would think about it and give him an answer come Monday. \n\nI have nothing lined up as of yet and have been trying to find new employment for a while, even when I was still employed by them. As much as being out of there for the past week has been great, I do have bills to pay and hope that maybe things have changed?  Regardless, I would still be looking for employment elsewhere. Should I take the position back?",
    "title": "Being offered my old job back only a week after a rather bitter “firing”",
    "subreddit": "jobs",
    "timestamp": 1560476329,
    "score": 7,
    "keyword": "black manager"
  },
  {
    "text": "Guys laughed at me for overdressing in my office. I'm 31, female. I had just been promoted to the manager to another department this week. My company has a business casual dress code. But since yesterday was my first day, I decided to overdress as business formal. I wore a navy blue pants suit, a blue stripped shirt and a pair of black heels, standard business attire yesterday.\n\nI think it's pretty normal for a new manager to overdresse in his/her first day, right? But a few guys in the office just smirked at my outfit and talked about how this new female manager being serious and weird, \"dressing like a restaurant waitress\". Some of these guys even wear jeans and sports jackets, not following the dress code. Since it's my first day and I barely know them, all I can do is to take it and forget it. \n\nI don't think any restaurant waitress will dress like me. Maybe I'm a bit young for the new position, considering my age. But I think it's totally fine to overdress whenever I go, whatever I do and whoever I am.\n\nHave you ever overdressed in your workplace? Do you think it's okay to overdress in workplace?",
    "title": "Guys laughed at me for overdressing in my office.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1547991674,
    "score": 130,
    "keyword": "black manager"
  },
  {
    "text": "I got justice against the man who sexually/physically assaulted me and gave me PTSD I know we see a lot of accounts of women who couldn't report, or did but the perp still got away with it in the end. I'm hoping sharing my story will be a reminder that they don't all get away with it.\n\n&#x200B;\n\nI'm not going into many details about the actual assault, but it was in a place with CCTV. He would've been aware of this, so I believe his actions were completely impulsive and not thought out (though likely practiced). It was a man I was friends with, and who was a coworker. It was very jarring and confusing. He was speaking his native language the entire time, so I couldn't understand him. While he did sexually assault me (not rape, by most definitions, and it was more gross than traumatizing), it was one of the physical assaults that was the most traumatizing, because it put me in a completely powerless state. I managed to fight him off in the end and got away and got a ride home, and texted a few friends about it, freaking out. I woke up to freakout texts from him claiming he had blacked out and didn't know what he did, but \"felt bad things happened\". Yeah, real believable, I know. Sociopaths are pathological liars, after all. He also kept going on and on about how bad he felt because I wasn't responding. Playing the victim and showing zero empathy or remorse—typical. I didn't respond to him. Instead, I went to the police.\n\n&#x200B;\n\nI felt the police were really good and supportive. They ended up asking if I'd be comfortable calling him while they recorded it to get incriminating statements from him. Luckily I was still in enough of a state of shock to not be able to feel my sadness and anger, so I said I could do it. He ended up fully incriminating himself, despite previously claiming he \"didn't remember\" what he'd done. That call was really empowering, and also helped to give me closure regarding my relationship with him, since obviously this was the end (not that he knew that then, since he somehow thought he could get out of this). I ended up asking him what he had been thinking during the assault, which the cop didn't want me asking, but I wasn't briefed on that. But he replied honestly, saying, \"Well, I wasn't.\" So he doesn't even know why he did what he did. Further proof it was an impulse and not planned. Then I blocked him. The police also got a hold of the CCTV.\n\n&#x200B;\n\nI then reported the incident to my HR department. It was taken very seriously, and he was immediately placed on a paid leave and banned from the office while they investigated. After an excruciating period of basically reliving that trauma constantly every day, they terminated him. Luckily he didn't really have friends at work, since he was a pretty antisocial guy (yet another sociopath trait—he's pretty textbook).\n\n&#x200B;\n\nAs for the criminal case, after his arrest, he got served a temporary restraining order. Since this was criminal court, that went on his criminal record. All his charges were misdemeanors, which I guess made sense given the physical damage was minor, but the emotional damage was intense. I wish the law took that into account. Anyway, he ended up pleading guilty. The plea deal was very gentle, which bothered me and still bothers me. That was partly to keep it from going to trial, to protect me, which felt like exploiting my trauma to let him off easy—the trauma that he caused. He didn't get any jail time, just put in some program (as if therapy could help him), and got served a \"permanent\" restraining order (which was also not as long as I'd wanted). But, I'm very relieved it didn't go to trial, because that would be hell on my mental health—both of these investigations were brutal enough.\n\n&#x200B;\n\nNow, a final thing to mention regarding justice. He was on a work visa. I know, it's really smart to commit crimes while on a visa. When he was fired, he only had a couple months to get a new job before he'd have to leave. With his new criminal record, he wasn't able to get a new job, and then his visa expired. So he's gone.\n\n&#x200B;\n\nDo I feel this was sufficient justice? Not at all. And it's less to do with what he did to me, but the fact he'd obviously done it before, but they were treating it as a first offense because it was his first reported offense in this country. But I know he's a serial offender from inferencing based on things he said. He told me he had an ex in another country claim he assaulted her, saying, \"She wanted me to do this rough sex thing, and I did, and then she used it against me.\" Big red flag, I know. Even at the time, a voice in the back of my head was screaming at me to run. But we were coworkers, and that affected my judgment. He also said that she would show up to parties and events, and he couldn't be there, but didn't say why. I thought it was from awkwardness, and didn't want to ask. But no, she obviously got a restraining order too! I expect he left that country because he has a record there. He also said, \"Things with coworkers can lead to some fucked up situations. I don't even want to get into that\", in a tone of voice implying he was speaking from experience. So, he has clearly done this before multiple times, faced consequences—both criminal and career-wise—and \\*still\\* continues to reoffend! It's upsetting to know there will be more victims, because he can't help himself. But now this country is safe from him.",
    "title": "I got justice against the man who sexually/physically assaulted me and gave me PTSD",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1570938239,
    "score": 106,
    "keyword": "black manager"
  },
  {
    "text": "Coworker touched me without my consent as I was black out drunk coming back from xmas party One of the workers from the factory touched me inappropriately as we were on the bus coming back from our Christmas party. \n\nI was unaware this took place as I was black out drunk. I know, very classy. \n\nMy manager told me what happened the next morning that he kept putting his hand up my dress. Another factory worker told him to stop 3 times and he replied with \"she's not saying no\" so he called my manager over and told her that she needs to sit with me as he is touching me. \n\nShe also said that there'll be an investigation into this and witnesses will be asked to make statements as three people saw this take place. \n\nWhat do I do? This has never happened to me before and I don't know how to process it. It all seems like a sick joke where I'm still waiting for the punchline.\n\nEdit 1: My work took action and he was fired on Wednesday! I also made a statement at my local police station and the case may or may not go to court. I am 100% not going to let him get away with this.\nI also got a bit of a warning re drinking and that I need to tone it down. \nParties in Australia get a bit wild",
    "title": "Coworker touched me without my consent as I was black out drunk coming back from xmas party",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1575809045,
    "score": 67,
    "keyword": "black manager"
  },
  {
    "text": "Close friend got beaten up by the man she lived with. She ended up at the hospital. So did he. So, let me tell you what happened a couple of days ago. \n\nMy friend (26) has been living with this dude for a few months now. He was known to be a bit rough sometimes, especially when being drunk.\nShe knew that he could be triggered at anytime but still stayed with him, hoping that things could work out and by lack of any other places to go to.\n\nBut then came the party from a couple of nights ago. Organized in their apartment complex with some friends. Night went on, people got drunk, things got said, you know the drill. My friend getting tired and feeling things were heating up, left and went back to their apartment to take a shower. \nMeanwhile, her guy, obviously drunk af, was losing his shit for some reasons. His friends tried to contain him but this dude, completely out of his mind, decided instead that it was a good idea to jump from the **three stories balcony** he was on. He managed to -somehow- land on his feet, breaking both of them in the process.\n\nBut by whatever alcohol/drugs/rage driven factors, that didn't stop him from getting back to his apartment, found my friend in the shower and beat the shit out of her by taking her by surprise. She got the courage to fight back, took a bunch of clothes on her way out and thankfully escaped to go to a safe friend's place.\n\nWith her friend, they went to the hospital to get some help as she has a few broken ribs, contusions and bruises all over her body, especially on her face with a huge black eye, and several cuts. The other asshole also ended up at the hospital, with his two broken feet and several contusions as well from her fighting back.\n\nShe won't be able to work for a few more days (she is a waitress). A police report has been filled the next day against him. The emotional trauma and financial stress is taking a toll on her. With friends and family we have been trying to help her as much as we could by providing shelter, emotional support, financial aid and putting together a GoFundMe to help covering for the medical bills, the days not worked and to lawyer up against this asshole. Any other advice are obviously welcome.\n\nIn the end, if you are a woman in this kind of situation, please do not wait for things \"to work out\". Don't tell yourself you have nowhere else to go or nobody to talk to. You are an amazing and beautiful person and a lot of people are out there to listen to you and do something to help you change things around. Love <3",
    "title": "Close friend got beaten up by the man she lived with. She ended up at the hospital. So did he.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1559385609,
    "score": 51,
    "keyword": "black manager"
  },
  {
    "text": "Growing up the daughter of my single dad I'm not sure where exactly to post this. I've been having a surprisingly hard time finding an appropriate subreddit for this if you have any suggestions I am all ears.  But i figure this is at least appropriate here because it is about my experiences as the daughter of a single dad.\n\nI have like 5 or 6 posts devoted to my mother and one to my father and my dad has been a much bigger and better influence on my life then my mom. he deserves a shout out. I am gonna put this in the parenting thread cause maybe other dads of teenage girls will find this useful.\n\nMy dad took me in when I was 8. My mom is a toxic alcoholic narcissist mess I am not going to go into the whole backstory of that If you're interested  I have some posts made about my relationship with my mom and one about my current relationship with my dad you can find them in my post history but I understand that cross posting to threads is not encouraged so I wont link them here. This post is about my Dad and raising me.\n\n&#x200B;\n\nMy dad was always supportive of me. Always encouraged me to be whoever and whatever I wanted to be. He never reinforced any gender role with me. He encouraged my interests in comics and star wars and video games (yea yea he was into that too so thats probably why but still\\_ he never forced barbies on me or anything. He also never made me feel like I had to be the son he didn't have. He learned to do my hair, he painted my nails with me, he never balked when I showed interest in feminine things or girly clothes. He just let me be and like whatever I wanted. When it came time for prom and I just had to have this expensive prom dress or it would be the absolute end of the world and I would just die without it, he never made a big deal about it. He got it for me because it as important to me. Did he understand? That would be a big fat no. He didn't even go to his own prom, but he knew it was important to me.\n\n&#x200B;\n\nGrowing up as the daughter of a single dad can have its awkward moments, when it came time for my period Yes he did turn all kinds of shades of red. He went to the store came back with a box of tampons and pads handed me both and said I didn't know which you would prefer so you'll have to figure it out honey and he handed me a fresh pair of panties\" But he never made me feel weird or bad or gross about it. This is a little embarrassing but I remember I cried and asked him if I was still his little girl and he just hugged me and told me it was ok and that it was nothing to be embarrassed about. He had ice cream and pizza waiting for me when I came down. We ate pizza ice cream and watched movies that night and the next day he let me stay home from school because I had cramps. He did tell me that I would have to learn to manage it because I couldn't always miss school or work. He also took me to an obgyn to make sure there were no problems. He would ALWAYS get me pads when I needed them no questions asked. He would never complain or question why I wanted the more expensive ones, he always made sure I had my favorite chocolates. I learned to not be ashamed or embarrassed about it. I learned not to be embarrassed talking to him about it.\n\n&#x200B;\n\nAs I got older I started popping out of my training bras, in another bit of awkward dad moment he took me to pink in a mall because he didnt know where else to go to have me measured for a proper fit. He told the sales ladies I didnt have a mom to help with this stuff and there (at the time) wasnt another woman to help him with this so he handed me his credit card told me what my spending limit was told the girls to help me pick a few age appropriate bras and we would get the majority of what I was gonna need at like target or something once I had my size. Then he told me he was going over to best buy and to call him when I was done lol.\n\n&#x200B;\n\nMy dad always encouraged my body autonomy. He always taught me my body belonged to no one but me. No one had any rights to it. I didnt owe anyone hugs or kisses or sex. I didnt even owe him hugs or kisses (but I never hold a hug back from my dad) I was interested in martial arts which he encouraged he has two black belts and he passed that on to me. Its become something we share. I was in middle school when I was groped. I put the guy in an armlock for it and humiliated him in front of the class. The guy had been doing dumb stuff to bother me all year but this was the first time he groped me. We both got in trouble with the school. The school tried to suspend me for fighting but my Dad would not hear of it. He argued with them that I had a right to defend my boundaries and that he taught me to do just that. They didnt walk it back because it was against policy to fight and I should have gotten a teacher or so they said but the important thing here is my dad had my back. My dad came to my defense. He was proud of me for standing up for myself and enforcing my boundaries and he told me the school was stupid. In the real world you may not be able to rely on teachers adults or the police to save you and sometimes you just have to defend yourself. This story isn't about me being r/iamverybadass it's about my dad having my back.\n\n&#x200B;\n\nHe never got mad. He would tell me I disappointed him and that was enough to make me feel bad with out blowing up and yelling and stuff.\n\nMy dad was never super controlling or over protective. He had the rules, make sure my chores where done, maintain at least a b average, dont have the police calling him about me. As long as I did what i needed to and I wasnt getting ion trouble with the cops or the school  he gave me the freedom I wanted. If I screwed up he would tell me, tell me what I did wrong, usually ground me but he was never like crazy or controlling.\n\n&#x200B;\n\nHe was always really honest with me about his mistakes. He told me all the shit he pulled in hs all the drugs and trouble he got into and just told me not to repeat it. We had one of those agreements that if I was at a party and I felt unsafe or I was too drunk to drive or my ride was too drunk to drive to call him to come get me and there be no yelling or punishments. In the end he was more concerned with me being safe then him being right.\n\nWhen it came to dating and sex, They had me when they were 17 so when I hit that age Dad had a talk with me about sex, and got me on birth control so i wouldn't wind up pregnant in highschool like my mom did. He never tried to do the whole \"you cant have sex until I say so\" thing he knew he was doing it at 16 everyone they knew were and I was going to at some point, so  he just wanted to make sure I didn't repeat their mistakes. He taught me what to watch out for in predatory men, to see the signs of abusive or controlling men and to avoid it. He gave me the whole sex is special between people who love each other talk and reinforced body autonomy. He didn't exactly encourage me to bring boys or girls home but he we had a dont ask dont tell policy.\n\n&#x200B;\n\nWhen I came out as Bi to him it was a no brainer. I wasn't afraid at all because I had years of trust built up with him and I just knew he would be on my side. He told me something thats turned out to be more true then I could have imagined then. He said I was going to face discrimination from everyone. That I will find straight people who will tell me theres no such thing as BI and I am just straight and want attention, or to tease men or confused, he said I will find gay people that will tell me I am a lesbian and I am just confused and then, I will find the straight guys who will immediately ask for a threesome. He told me they are all wrong. Dont let other people define your identity, be true to yourself and dont let people treat you like a sexual fetish or toy. My dad was right. Over the years I have gotten all of those. Just the other day I got a pm from a straight male saying that being bi was a mental illness and I cant count the amount of times telling a guy I am bi is followed with the ZOMG THREESOME remark.\n\n&#x200B;\n\nNot too long ago I had a terrible date. This guy was being rude to the wait staff, drinking too much, he was loud obnoxious and very chauvinist. I was embarrassed to be out with him. When it came time for the check I paid my half so he had no illusions this was going to lead anywhere with me. He had picked me up but I told him he could just go. I called my dad to come get me. And my dad came. No questions asked.\n\n&#x200B;\n\nThe older I get the more I realize how special and amazing my dad is and Im so glad we have such a close and honest relationship. I can trust my dad with anything. I took him for granted growing up thinking all dads were as great as mine but no not every girl is as lucky as I was. My dad is my role model, mentor, coach and best friend I love him to death\n\nEdit: some stuff I forgot. My dad has made a lot of sacrifices for me, we share the same birthday!",
    "title": "Growing up the daughter of my single dad",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1559865419,
    "score": 37,
    "keyword": "black manager"
  },
  {
    "text": "My companies bullshit new way of doing sick days. We use a program called Kronos which keeps our timecards.   \n   \nPrior to this change, company policy said we were allowed 6 sick days in a rolling year. The manager kept track of this. The manager was also meant to keep track of late punches and address them as seen fit. Fast forward to now. \n   \nKronos has this built in feature where it can keep a points system. A late punch-in earns you 0.50 points. Forgetting a punch and filling out a manual form costs you 0.25 points. **calling out sick costs you 1.0 points**.   \n     \nWhen you reach 6.05 points or higher you have to be formally written up. There are implications to this. You cannot transfer for six months after being written up. You don’t get your annual raise if you’re written up.   \n\nShit happens. Sometimes you’re late by 1 minute because of traffic. Sometimes you forget to punch out or your badge doesn’t swipe when you thought it did. These little fucking points build up over time.  \n   \nIn a **perfect world** where you maintain NO OTHER POINTS we would be able to take our 6 sick days. Punch in 1 minute late once? Well now you can only take 5 sick days for the next rolling year. Late once and your badge doesn’t swipe on 2 occasions? Now you only get 4 sick days for the next 12 months. Unless you want to lose your raise and have a black mark on your record.   \n   \nHere’s the kicker-   \nIf you reach 7.0 points you get written up AGAIN. So if you’re written up once, you literally aren’t allowed to take another sick day. Imagine being that poor employee who’s accumulated 6.25 points, has been written up, and comes down with the flu. Imagine what that feels like to be faced with the choice between going to work sick or being written up a second time. \n   \n3 write ups and you’re terminated.   \n   \nIt’s fucking bullshit. Don’t get me wrong, people who call out excessively should be investigated. But for fucks sake combining sick days with other menial actions is retarded. Why should my allowable sick days be effected by me punching in late?      \n   \n\n   \nWhy even fucking bother to give us sick time?",
    "title": "My companies bullshit new way of doing sick days.",
    "subreddit": "nursing",
    "timestamp": 1577068427,
    "score": 84,
    "keyword": "black manager"
  },
  {
    "text": "Needing courage. What’s your healthcare whistleblower story? The last straw finally happened. For months,  periodically  I have  been called upon to participate in an illegal activity that directly affects patient care. I have pushed back and have been placated with “the doctor ordered it, so it’s  OK”. A meeting happened with management that acknowledged that the practice is illegal, and that yes, upper management knows but won’t put a stop to it. Vague terms like “competing priorities”  and “culture shift” came up, but no clear plan for changing the practice was outlined.\n\nMy position is a consulting one, but my participation is required, or people have to go up the chain of command to get approval to engage in the practice. I’ve decided to no longer be a part of something that is blatantly illegal and risks hospital accreditation.\n\nI have no union, no job protection and am employed in an “employment at will “ state.  I am thinking of whistleblowing, but am not sure if it would make a difference-other than get me fired and  black balled through word of mouth labeling as being “not a team player”-which I’ve seen happen before.\n\nAny suggestions, stories to share?? Thanks!\n\nEDIT: Thank you for all your stories and suggestions! Since my last post, my manager left on vacation with an email deputizing the equivalent of the Office’s Dwight Schrute (“assistant interim supervising cat wrangler”) to answer all questions. Well, the schedule for January is still not out. After 4 direct inquiries to said deputized cat wrangler, I got a response saying that today, Xmas Eve, the schedule would come out.  \n\nFunny thing is I got an email alert from a job board, with the exact job title on my badge from my place of employment being advertised. So it looks like it’s an Ebeneezer Scrooge situation that they neglected to tell me about.\n\nQuestion: Do I text the screenshot of the job listing and LOL about it asking what the deal is, or do I simply request a transition plan? I was planning to whistle blow then wait a few weeks and quit with ample notice. In knowing these things, any suggestions?\n\nHappy Holidays to all!",
    "title": "Needing courage. What’s your healthcare whistleblower story?",
    "subreddit": "nursing",
    "timestamp": 1576082738,
    "score": 32,
    "keyword": "black manager"
  },
  {
    "text": "Compliments and Codes When the ICU charge nurse whose been there as long as the hospital has been built makes it a point to compliment the unit not once, but THREE times on how they handled a code. And you know that nurse, the one that doesn’t get excited about much.\n\nThe charge nurse is known to be kinda crabby but ha a soft soft for me and another nurse because we have the lovely black cloud. It meant a lot to me that she complimented us and made it a point to stop by the desk on her way to leave to tell the assistant manager how well we did. \n\nPlus we did intervention before ICU got there which is big considering the most experienced nurse was me and I’ve only been one for 1.5 years.",
    "title": "Compliments and Codes",
    "subreddit": "nursing",
    "timestamp": 1575472358,
    "score": 22,
    "keyword": "black manager"
  },
  {
    "text": "Frustated with patient complaints. I need a place to vent. I have had a lot of patient complaints against me the past 3 years, some of course were valid, especially in year 1 when I was new IE too short time spent in, pants came down too low when I bent over, said something insensitive without realising it(to be fair, that pt confronted me directly, which was good of them). Some I feel are prejudiced.\n\nI am a visiting nurse(home care) in british columbia. I am also a morbidly obease man.\n\nSomeone complained today that I leave garbage everywhere, but this person has not had a wound in 3 months and the last time I saw them was 2 weeks ago, their care does not currently require anything that would make \"garbage\".  They also complained about a conversation we had:\n\nPt\" I love sci fi movies.\"\n\nMe\"They are not really my thing, I like wrestling\"\n\nThose were quoted to me by my manager, to be fair he said it was stupid complaint.\n\nThen they said that I sweat too much. The house was at 78 degrees in a heat wave. I used to wear a black headband in the summer, but people complained about that too so now I do not. I always take special care to not sweat on people or their stuff however.\n\nI have had people say they are afraid Ill break their furniture, but I ALWAYS ask to sit. I will not sit if the seat looks iffy or I know it won't hold like plastic garden chairs for instance.\n\nThis one today really stung though, I've been seeing this patient for a year, they never said a thing to me  including all last summer when I would sweat just as much. And this person was always very appreciative. I don't get it.\n\nBesides \"losing weight\" I don't know what else I could do at this point. On the other side of this coin, I have also had people name me in their loved ones obituaries.",
    "title": "Frustated with patient complaints.",
    "subreddit": "nursing",
    "timestamp": 1562801604,
    "score": 12,
    "keyword": "black manager"
  },
  {
    "text": "Sharing a tough time at the beginning of my career as a Psych nurse in the '90's; can anyone relate or have a similar experience? Hi Everyone,\n\nI decided to be brave and talk about a rough time I went through a long time ago when I was a new psych nurse.  Been having memories of it all, and thought maybe sharing it and seeing if anyone else has had similar experiences will help me get through these memories and see that I'm not alone.  \n\nA little background before the main part of the story.  I graduated as a Psych nurse in one province in Canada in 1990.  The forensic unit I did my last two month student preceptorship on was a great experience, and they ended up hiring me after I graduated, got my license and become 'official'.  They were welcoming and encouraging, and I worked with a great crew of men and woman, psych nurses and psych aides.  I gained more knowledge, confidence, experience, and became familiar with the 'real' world of psych nursing beyond being a student.  At the end of 1990/beginning of '91, word came down that there was going to be a downsizing of nursing jobs, including our facility.  I knew as one of the more recent hires, my hours would be declining, so started looking at different jobs.  Ended up getting a position at a hospital in another province, in forensics, which I loved.  Moved there in spring 1991, went through orientation, and at the end of that, found out I was rostered to the unit I really wanted.  It was a male patient, Maximum Security Remand/Assessment Unit.  And then it began...\n\nMy first day, a male staff Health Care Worker (HCW) stopped me in the hallway.  He was a big guy, probably at least 6'4\", husky, a little bit intimidating.  He told me he was going to what he could to get me off his set (the same 4 day on/2 day off rotation that we were both assigned to), his shift, and his ward.  I don't really recall what I said or did, but I was shocked.  I barely new him or anyone there, why all this hatred.  Well, I am a female.  Apparently females 'don't belong here', and sure don't belong in maximum security forensics. (there were a couple of other females, but they were the pretty, popular type, and I wasn't, so I didn't belong).  So it began.  The best I can label it in hindsight is bullying and harassment.  He would do anything to undermine me, ignore me (when I was the Nurse in Charge), and just make my life as miserable as possible.  If I had assigned certain tasks to him, he would wait for the very end of the shift before he did them, because he knew I would stress out about them not being done in time, because I would catch the flack for work undone . Of course he had friends there, who more than happy to help him out.  There were things we were to do in pairs, for safety reasons.  He would refuse to come with me, I had to try and find someone that would.  So many things that I just can't even cover them all in this post.  It was a very tough time.  I'm in a new province, a new workplace, zero friends, no support, isolated on my own.  Friends from my old town slowly drifted away, I really was alone.  I won't go into all the things he did, but needless to say other people became unhappy when they had to work with the two of us together.  Remember this is back in the early '90's.  There was no HR to go to to complain.  Supervisors would talk to us, and I would be told to 'try better to get along with him' and just ignore it all.  They didn't see what he was doing as 'bullying' (as we would call it today), we just 'didn't get along' in their eyes.  He would be the 'concern' on my evaluations, and I on his.  Every time.  There was just no where to turn for professional support.\n\nThen it got worse when we were assigned a new Unit Manager.  He was a known entity to some workers, doesn't like females, and didn't hide it.  Well no matter what I did (especially when I was Nurse In Charge), it was wrong.  Getting told \"I need to see you in my office\" became words I panicked hearing.  One time I apparently said 'Hello Everyone' when I came on shift, I didn't say \"hello 'name'\", and I was hauled into the office for a 10 minute lecture on my \"hostile attitude\" for not greeting him personally.  Even with a union rep (it got that bad I refused to see him alone and had a rep in with me), they would say there is nothing we can do.  If I did \"A\" on my shift, I should have done \"B\".  Next time I do \"B\", nope, I should have done \"C\", and on and on.  One time someone from a different discipline came in to chart in a patients chart, and used the wrong coloured pen (we all had different colours to use, nurses-black, doctors-red, etc).  Well apparently I didn't notice this and got in trouble.  Did the person who charted wrong get in trouble, nope, just me.  I 'should have been paying better attention' to someone else doing their patient notes, while I was busy with my own stuff and the rest of our crew.  Of course, they guy I didn't get along with was a total brown noser to the new unit manager.  Did everything he wanted right away and became his favourite. I  lasted a few more months, then transferred to a different unit in the hospital, the female Remand/treatment unit.  It was so much better.\n\nPersonally, I wasn't coping well with all of this outside of the job.  Began drinking a lot.  Never at work, but afterwards, to drown my sorrows, so to say.  Long story short, became an alcoholic, went to AA for a few years, but am now 27 years sober.  Also ended up with my own mental health issues.  Depression and anxiety.  Have had various amounts of time off of work because of my own illnesses.  Actually spent two weeks in a psych ward myself in 2000, but that's a whole other story.  Maybe I'll share it sometime, I don't know if anyone wants to hear about that, lol.\n\nAnyway, I may think of more things to add, but those were my first few years in psych nursing (well the first year at the first hospital was good).  Is there anyone else in the medical field, or other psych nurses that have had their own trials and tribulations in the workplace.  Would love to hear your stories, so that I don't feel so alone in all of this.  \n\nI've since become disabled, and have been out of the workplace for a few years now.  I guess coping with not being able to work anymore has popped some of these memories into my mind.  Thank you all for 'listening';  I really appreciate it.  Sorry it turned out so long!",
    "title": "Sharing a tough time at the beginning of my career as a Psych nurse in the '90's; can anyone relate or have a similar experience?",
    "subreddit": "nursing",
    "timestamp": 1574411416,
    "score": 8,
    "keyword": "black manager"
  },
  {
    "text": "Protest of Assignment question For NYS is there a main source that I can point to and say, “here’s the rules?” Because every time we try to fill out a protest of assignment form overnight, supervision comes down and says it’s not a valid protest of assignment. For example, we can’t protest that there are not enough nurses on the unit to handle all the patients on a whole, we are only allowed to protest the assignment of our own group. But then Day management comes in and says that’s not true but by then the shift is over and I’ve missed my chance to protest. Is there a written law or something that I can reference in the future? I want to be able to show it to them and say, “here it is in black and white.”",
    "title": "Protest of Assignment question",
    "subreddit": "nursing",
    "timestamp": 1558732188,
    "score": 8,
    "keyword": "black manager"
  },
  {
    "text": "any nurses with PTSD? Hey guys. So I’ve been nursing for 4 years, most of which in either float pool, medicine, ER or surgery. The hospital I worked at is a smaller one, terribly understaffed and my last manager was a nightmare. Last fall/winter the stress finally caught up and I began having panic attacks and severe anxiety to the point I couldn’t leave my house, with intrusive thoughts basically picturing myself in the place of previous codes I’d been to and subsequently living with a constant fear I was about to die. Long story short with meds and therapy I’ve improved, quit my surgical job and took a job in a long term care/geriatric rehab facility which is much less stressful and easier on my mental health. I’ve basically taken the attitude that I’m cutting back my hours and work load for as long as I need to allow myself to recover psychologically. \n\nClearly these occurrences led to a diagnosis of generalized anxiety disorder with “elements of Post Traumatic Stress Disorder”. I’m not sure why I found it so shocking to hear a doctor tell me it looks like I have a case of PTSD directly related to my line of work, and almost struggle to believe it since I’ve not experienced a traumatic event directly myself, only observed traumatic things happen to patients. I almost feel as though I am weak because so many nurses can deal with these experiences and not end up trapped inside an anxiety ridden brain. \n\nDoes anyone else have experience with PTSD? Any words of wisdom? This diagnosis has really made me feel like a black sheep among my own colleagues. 😞",
    "title": "any nurses with PTSD?",
    "subreddit": "nursing",
    "timestamp": 1554436852,
    "score": 7,
    "keyword": "black manager"
  },
  {
    "text": "Do not hire? Hi nurse friends! I'm looking to learn more about do not hire lists at hospitals\n\nAs a new grad, I worked at a large city hospital for 2 years. I left because night shift was killing my family life. I'd applied for 5 or 6 in house jobs before leaving, but didn't hear anything back from any of them.  I put in my 2 weeks notice and had a short discussion with my manager who said she'd wished I told her because she would have tried to help me get one of those in-house positions. \n\n2 years later, I've applied for a few per diems at that same hospital. One was on my old units sister floor. I emailed the manager who said she was eager to interview me, and within 2 days I got an automated email from HR that I was not chosen for the job. I applied for a few others. O ne I was an \"active candidate\" for for a month or 2. But no interview and then I got the same email saying I wasn't chosen.\n\nIt's not like I'm not qualified. I've been a nurse for 4 years. 3 of those I worked in cardiac (I'm applying to all cardiac jobs now). For the last year I've been working per diem in ICU because I'm working on my masters, but pulling part time hours.\n\nI feel like I'd be a great candidate to at least interview. So now I'm worried I'm on a no hire list. Anyone have experience with this?\n\nEdit: TLDR; am I not getting hired because I'm applying to a large hospital or because il black listed?",
    "title": "Do not hire?",
    "subreddit": "nursing",
    "timestamp": 1568739675,
    "score": 6,
    "keyword": "black manager"
  },
  {
    "text": "Issuing Colorized Drawings We have a specific project manager at a client site that has started to request colorized drawings to be issued along with stamped monochrome (black & white) drawings.  He says it is so He and the contractor can read the drawing and understand it better.  (these are mechanical, material handling, & structural drawings)  This engineer has an electrical engineering degree and is not licensed, he is also young (26 and likely has a limited experience with CAD programs).  I have told him that the colors that are used in CAD programs are meant to be viewed on a black background, not paper.  Therefore to satisfy his request we will have to limit the use of about half the standard colors.  I recommended to them and our designers that we limit colors to Red, Green, Magenta, and Black/White.  \n\nWe plan on issuing the stamped and scanned monochrome drawings and then put the following statements on the drawing, to comply with our state board rules.\n\n\"Final Drawing - For Review Purposes Only\"\n“Not a Certified Document – This document originally issued and sealed by (name of licensee), (license number), on (date of sealing). This document shall not be considered a certified document”\n\nHas anyone else come across a request like this?  If so how did you work thru it with your client.",
    "title": "Issuing Colorized Drawings",
    "subreddit": "engineering",
    "timestamp": 1555630998,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "Finished my first year teaching....and then got fired Spent my first year struggling through at a truly difficult school: title 1, sure, but the problem is really a truly toxic admin (think of over 60% teacher turn over in 2 years. Can only convince newbies to work there). I was teaching both SPED and Gen Ed because I'm dual certified.  Loved SpEd, but it was hard teaching both. Special Ed department lost several teachers and an administrator DURING the school year, adding to my case load and leading me to take over a class that hadn't had a teacher in 4 weeks. Still, I had perfect attendance, was an effective case-manager, and did the absolute best I could in the classroom. \n\n&#x200B;\n\nYet.... my observations both from my school and my alternative cert program didn't do great. I could have been more strategic, sure, and my practice was genuinely lacking in some ways. My final rating on the district system was 'developing', the category between ineffective and effective. My alternative certification program scored me, though, as \"not meeting expectations\" and decided to dismiss me. These were evaluations based only on classroom practice and now my provisional license is getting pulled.\n\n&#x200B;\n\nMy Principal could have EASILY brought me back on a different kind of temporary license. But she is not really the 'supports her teachers,' or the 'have your back' or the 'take a risk on someone' type.  Whole SpED department has my back and some wrote letters of appeal to my alternative cert-program but I am not optimistic. 4 special ed vacancies before this and the principal said she would be 'lucky' to fill two of those. I guess that shows where her priorities are: would rather not make waves with a program that gives her a pipeline of new teachers than have a functional special ed group.\n\n&#x200B;\n\nThe worst part about it is that I didn't get any of this confirmed until finals were winding down so I didn't really get to say goodbye to my students. They lose so many of their teachers and, even though the school is a total mess, I was excited to come back and to give them some consistency. To be honest I am not too worried about the future. I may be black-balled in the district I'm in now but surrounding districts will probably hire me for SOMETHING. The whole state has a shortage of special educators. Worst case is I stay in the district as a para while I find another way to finish my full certification. I am not posting for advice, just to vent. One of the few people in the world who wanted to work at the school I worked at and now I'm gone.I think I've heard enough about 'transformational change' from my certifying program....\n\n&#x200B;\n\nBut, it's summer!",
    "title": "Finished my first year teaching....and then got fired",
    "subreddit": "Teachers",
    "timestamp": 1561289430,
    "score": 276,
    "keyword": "black manager"
  },
  {
    "text": "Dealing with Title I Culture Shock after teaching Suburban Honors Kids So my Student Teaching placement I was teaching Honors Freshman Social Studies at a Suburban High School. I feel like I didn’t get to practice that much classroom management because the students were so focused and cared a ton about their grades. Besides maybe a few off topic conversations which I redirected and they immediately corrected behavior I didn’t have to deal with anything. My first year placement is teaching 6th Grade ELA in a Title I School. So in addition to teaching a subject I never have taught before the kids behavior is black and white. Not only are the kids really disrespectful and disruptive when I ask them to do something they flat out refuse. They also don’t take responsibility for their work and blame me or others for their lack of effort. The homework turn in rate for my Honors Class was about 90% on a bad day. With my current classes it was about 50% on a good day which led me to stop assigning it. I’ve been struggling a lot this year. Not with evaluations because they are effective, but with every day coming to school and teaching and not feeling like I wanna pull my hair out. I’m a first year teacher and was wondering if anyone experienced a similar culture shock.",
    "title": "Dealing with Title I Culture Shock after teaching Suburban Honors Kids",
    "subreddit": "Teachers",
    "timestamp": 1558701236,
    "score": 62,
    "keyword": "black manager"
  },
  {
    "text": "I hate being a teacher--what else can I do? This is my 4th year teaching. I have a Masters in History Education(Secondary), a BA in History. I am a veteran (3 years in the army with one tour in Iraq). Teaching is the most stressful thing in my life. I hate classroom management issues. Most people think that because I was in the army I would be good with handling kids--I am not. I cannot talk to students like I would soldiers (If I did I would make the coaches blush and then be fired). I love history and I love creating lessons but implementing them is awful.\n\n My first year in teaching was at a Title 1 \"urban\" school. I literally had to dodge bullets there from drive-by shootings. I did my time in the trenches. I was the only white person in the room for most of my classes. It was hell on earth. I would have rather been back in Iraq. Next school I was at was a low income Title 1 applicable school (68% black and on free and reduced lunch). Now I am teaching at a country school with very different demographics (mostly white, though lots of poverty still). I just cannot bring myself to enjoy what I do. I hate every minute of it. I do not think a change of school would change anything. \n\nI try my best but kids are little shits and I just have to find something else to do. What are my options? I don't want tips on classroom management--I will die of cirrhosis of the liver from drinking before I could get vested--nonetheless retire--at the rate these kids stress me out. I am a Google Level 1 certified Educator. I would love to get a job teaching teachers how to use technology but those jobs are so rare. I am pretty tech savvy and have worked in mostly 1:1 school environments (except where I am now). What can I do? I don't care if its education or what not just something that isn't dealing with school kids. What have others done? I live in Alabama near Auburn.  Please help!",
    "title": "I hate being a teacher--what else can I do?",
    "subreddit": "Teachers",
    "timestamp": 1570071778,
    "score": 15,
    "keyword": "black manager"
  },
  {
    "text": "Applying for Special Education positions I've posted before about looking for a new job for next year so you may have seen me talking about this before. I am a first year teacher who is teaching high school Special Education and also going to school for my Teacher of Students with Disabilities certificate. I'm not really happy with the school I am at this year and am planning on applying to jobs for next year. Although I technically could apply for general education English positions (I'm English certified), I have to get a SpEd position because the certificate program I'm in for my ToSD requires a placement for next Spring, which I can't accomplish if I don't land a SpEd position. Obviously, if I get renewed here and don't find a different job for next year, I'll stick it out for one more year (which would honestly be easier but I don't know if I could handle it mentally being here for another year).\n\nI'm currently working on fixing up my resume and my portfolio to start applying and interviewing. But there's a few things I'm a little iffy about and was hoping for some feedback on:\n\n\\-Is it okay for my resume to be 2 pages? I have student teaching, a maternity leave position, a TA position, and this full time position to include and I don't think I could fit it on one page, but I've always heard more than one page is bad.\n\n\\-Should I include pictures of my class working in my portfolio to showcase my classroom management and environment? I would obviously try to avoid getting students faces in it, but I wasn't sure if that was allowed or if it would be frowned upon. I plan on including pictures of the class set up (like desks set up in groups) and my bulletin boards and stuff as well.\n\n\\-To showcase my SpEd side of things, I was thinking of including some of my student data tracking sheets, like IEP snapshot and data collection. I would never include a student's name on the sheet (would black it out) but is it okay to include their data on the sheet in my portfolio, or should I just include a blank sheet so they can see the way I work?\n\n\\-Lastly, I am also currently studying to take the elementary education praxis and get my certificate to teach Elementary. I have scheduled one of the Praxis tests for this summer. I know that I won't have my certificate to apply for jobs for 2019-2020, but should I mention in interviews that I'm studying and taking the Praxis for it? I feel like this might give me an edge if I apply and interview for middle school positions but I'm not sure if it's worth mentioning if I haven't actually applied for the certificate yet.\n\nI know that I can apply for SpEd positions in NJ because I'm in the certificate program, but any other tips for interviewing for SpEd positions (such as talking about data, IEPs, anything) would be helpful!",
    "title": "Applying for Special Education positions",
    "subreddit": "Teachers",
    "timestamp": 1551797706,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "How can I become a \"people person\" to continue advancing in my career? I've been with this contact center company for almost 5 years. Started as an entry level colleague and advanced through the ranks to program supervisor.\n\nMy immediate superior (program manager) has informed me that while I'm fantastic with data, policies, and other things that are black and white, I really need to focus on my soft/people skills and things with large gray areas if I want to advance further to program manager or beyond. \n\nI'm an introvert, 100% logic minded, and have incredible difficulty with anything that requires a judgment call or a falls outside standard procedure.\n\nAt this point, I'm unsure if I've realistically hit the \"ceiling\" for what I can accomplish at this company, or if I have the mental and emotional fortitude to become a \"people person\". I want to continue with this company, it's a been a great career for me so far, but I know that I have to be realistic as well.\n\nAny advice, readings, videos, podcasts, etc. that might be useful would be incredibly appreciated.",
    "title": "How can I become a \"people person\" to continue advancing in my career?",
    "subreddit": "careerguidance",
    "timestamp": 1571860002,
    "score": 8,
    "keyword": "black manager"
  },
  {
    "text": "Career progression advice, Noise and Vibration engineer vs Continuous improvement management which is better ? Hi Fellow Redditers, \n\nI am currently a decently paid Lead NVH (noise and vibration) Engineer working for a big automotive company (technical role with small team management - 5 people), I have just been certified as a Six Sigma Black Belt and I am thinking of switching to Continuous improvement management role.  I am just 30 years old and would like to reach senior management one day. Which route would be better in your opinion?\n\nPlease let me know if there are any questions /  \nMany Thanks",
    "title": "Career progression advice, Noise and Vibration engineer vs Continuous improvement management which is better ?",
    "subreddit": "careerguidance",
    "timestamp": 1553772994,
    "score": 4,
    "keyword": "black manager"
  },
  {
    "text": "Are there any good job searching websites out there that actually help job seekers? What websites have you guys found to be the most helpful in providing you with tools and resources to help you get in front of hiring managers at the company you actually want to work for? \n\nI am currently employed, but only after a grueling 7 month search. I could not find anything remotely helpful. It was all a bunch of cliche \"Resume Tips and Tricks\" articles that people who were already working for those companies were writing. Not very genuine...\n\nReason I ask, is because through my job searching experiences, I became fed up with not being heard as a job seeker. I would go to bed at night feeling like a loser due to so many automated rejection emails and sending off resumes to the dreaded job search black hole and never hearing back. I was bombarded with commercials for job boards that were only interested in the corporate side of the equation, not me, the job seeker.\n\nI wanted to change the broken job searching process, by creating a website to provide fellow job seekers with the tools, training and advice needed to counteract the \"Easily Apply Now\" bs that online job boards offer. Earlier this year, I launched Couch To Career. It's pretty much a compilation of my journey through the job search process, starting from applying online on my living room couch to where I am now, at a company I actually want to work for. I'm hoping any job seeker at any stage of their search can benefit from the content I have been posting and I would appreciate any feedback and suggestions you might have. Best of luck to you in your job searching!",
    "title": "Are there any good job searching websites out there that actually help job seekers?",
    "subreddit": "careerguidance",
    "timestamp": 1547170751,
    "score": 3,
    "keyword": "black manager"
  },
  {
    "text": "Leaving a position that is structurally abusive? I transferred into my current position earlier this summer. It's a clerical position for a warehouse for a major retailer, which I thought would be more reasonable than it turned out to be. I only took the position because it provided much higher pay than my previous one, and though the work is not too technically difficult nor physically-demanding, it has turned out to be untenable due to several factors (but one in particular, which I'll detail first):\n\n\\>The hours are nigh-abusive. I work second shift, starting between 1-3PM, and am essentially guaranteed to be there until 9:30 at the absolute earliest. It's rare that I leave before 11, and the nights that stretch to 12, 1, and beyond are increasing as we move towards Black Friday. Management refuses to hire or staff more workers, and our schedules have officially begun to set us at 12-hour days for \"peak.\" Older workers joke bleakly about staying until 4, 5, or 6 in the morning fixing broken orders and checking in shipments. Because the warehouse is open Saturday, that means that we often only have one day off before having to return to these long shifts. I have insomnia and sleep apnea, and arriving home at 1-2AM every evening is making it harder and harder to get restful sleep. It also means that I often cannot make it to the grocery store, or that I must cut sleep short to make early morning appointments before work. For this, I'm not aware of anyone at my level making above $18 an hour, in an area where per-person housing costs are $800-$1000 per month, at least.\n\n\\>Because it's in a warehouse, it is very loud; adding to the industrial noises are speakers placed throughout that blare music at all times. I wear ear protection 90% of the time (I am the only one to do so; I suspect many of my coworkers have hearing damage), but it is still aggravating.\n\n\\>There is no meaningful opportunity for advancement. It is a typical retail model where managers are either brought in from outside or have worked with the company for years; they are paid relatively well to squeeze productivity out of underpaid labor. There seems to be some movement from entry-level positions to mid-level non-salary, but the number of positions is limited. I was turned down at my first attempt, it seems, less due to performance (which I've been told is solid if not stellar) than due to \"perception\" (a tardiness issue which I'd made verifiable progress on and which had not impacted my overall performance). I don't trust that anything I could do would allow me to advance in a timely manner. \n\nIn essence, I have little motivation to keep on in the role. When I say that the job is structurally abusive, I mean that no one person is harassing or abusing workers; rather, the fundamental nature of the work (late shifts that can stretch on well into the early morning hours, in a noisy warehouse, making barely enough to be broke, with no hope of an end, but the promise of hard times imminent) is abusive. The problems start higher up the chain than anyone I see on a day-to-day basis, but they end with me, and the situation is wearing on my body and mind. I just want out. I have another prospect, but like this one, it asks full time hours, and like my previous role, reintroduces retail instability and lower pay into my life; none are anything close to what I was hoping to do when I graduated college. That would require self-study that I could afford for 4-6 months, max. I probably need a year of it, full-time.\n\nI'm not sure what to do.",
    "title": "Leaving a position that is structurally abusive?",
    "subreddit": "careerguidance",
    "timestamp": 1574141629,
    "score": 3,
    "keyword": "black manager"
  },
  {
    "text": "Ask for job relocation with current employer before or after having new job offer? I am currently in a dead ass, dead end job and working a fair distance from home on a 9/80 schedule.  I'd love to work from the office that is 15 minutes from my house.  I have not asked for a relocation yet because the last person who managed to move had to go to the company owner and is now pretty much black listed from accessing the engineering network (he's an engineer, but went over the department head's .... head.... ).\n\n&#x200B;\n\nI know I don't want to stay at this job but the pay is good and the work is easy so if possible I'd like to continue working here until I really find a job I want.  I am willing to accept a new job that's closer to home in a different industry as long as the pay works and there's potential for growth.\n\n&#x200B;\n\nWould you suggest I ask for a relocation now before finding a new job offer, or have the job offer just in case I want to use it as leverage to move?  I know using it as leverage would put some strain on my position and I'd be putting a mark on my back, but that would be something I'd risk if I knew I had a shot at another job were this plan to backfire on me.",
    "title": "Ask for job relocation with current employer before or after having new job offer?",
    "subreddit": "careerguidance",
    "timestamp": 1562019781,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "How bad is it to wear flats in an interview?  \n\nUnfortunately, I may have to start interviewing again (sadly, in my field jobs tend to be project-based, so I change every 6-12 months. IT SUCKS). I'm a 40/F, project manager in tech. I don't live in a particularly conservative city, dress-wise. \n\nI don't wear heels. It's not out of disrespect for professional norms, and I realize I'm short. The issue is I have spinal damage from being hit by a truck. **Walking in flats is painful**, and when I've tried to push for physical therapy and/or a small procedure that would fix the damage done to my tailbone/pelvis, I get finger-wagged that I should be wearing sneakers at all times. I have a faint-to-pronounced limp depending on weather, previous day's activities, etc.\n\nIt's not just comfort and safety. While I know most of the questions come from a place of caring/concern, \"What happened, why are you limping?\" gets old quick. I'm tired of reliving the accident, even in one sentence, and I'm frankly tired of intrusive questions and judgments. If I wear flats, I may be able to pass as able-bodied, which is a plus in frankly not a very inclusive industry.\n\nLast year when I was looking for my current job, I met with an external recruiter about his client's opportunities. I came in a black skirt suit and black flats (so gender presentation is not an issue); his first question was, \"Can't you wear heels to meet with the client?\"\n\nMy question is, is my footwear really that bad? Is there a way to offset/apologize for it without outright lying to my interviewer?",
    "title": "How bad is it to wear flats in an interview?",
    "subreddit": "careerguidance",
    "timestamp": 1565603147,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "Can anyone advice about my two work place dilemma? My double job dilemma\n\nI am recently a student in college who manages to work two jobs.  While they are both hard restaurant jobs, I don’t mind the difficulties that come with it.  Recently I’ve been faced with many offensive micro aggressions that I brush off out of fear.  At one job one of the mic values my other coworkers even at some moment I may work harder than them.  I may cause a few minor errors, but when I do them he’s harsher on me.  When I go beyond expectations he says that he appreciates me, but it’s doesn’t sound as genuine as when he compliments my other coworkers.  As the only black male in this work place I don’t want to bring any negative attention to myself, but recently out of frustration I decided to write a letter to say I quit on napkin I put on my manager’s desk.  He didn’t take it saying that if I do this it will effect my chances of getting another job.  At my other workplace I face close to the same thing, but I brushed it off out of fear and busted my ass off.  But recently I was joking about anti-Semitic and sexist slander people on the internet say.  I even joked about something that was was posted during the #metoo moment era.  I quote, “White Caucasian makes are the most oppressed race in America.” I was being a little cocky, but soon after my break other coworkers in a different section were talking negatively about black peoples.  They even mentioned black face.  They soon mentioned my work situation of two jobs and walking back and forth to each.  I tried to keep chill, but it got worse at the end of the day.  They giving me a hard time and I even heard another coworkers talk offensively about black customers saying they smell.  I wanted to quit, but I decided to go public with an apology in I did.  But while I was doing it, I couldn’t control myself from crying in which my boss lead me outside.  Letting me off early I sort of don’t have a grudge, but I fear that returning after what happened will make my life worse.  I told my mom about this and she thinks that I should get an attorney to have them punished.  I don’t want to ruin anybody’s life, but I also don’t want to live like this anymore and quit working both jobs.  I also feel that my coworkers might deny the fact that they said such offensive things.  I want to hear some advice about this.",
    "title": "Can anyone advice about my two work place dilemma?",
    "subreddit": "careerguidance",
    "timestamp": 1575871798,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "Should I ask to be taken off a project when I have no idea how to do the given task? I'm an intern at a large company.\n\nThe project is a legacy project requiring Windows 2000 and the code is all in Visual Basic and Visual C++. The code is total spaghetti code containing 30k+ lines (at least it's spaghetti from what I’ve written/learned in school and read in open source repos). There will be 20+ header files included, and variables from these files will be assigned and updated all over the place in numerous amounts of .cpp files. There is absolutely no documentation nor version control other than the project being backed up on numerous hard drives. The platform is an interactive GUI. There are over 50 buttons for the GUI and in the code each button event is called, “Button1”, “Button2”, …, “Button50” with little to no comments explaining what each button does. There is duplicate code throughout the entire project that can very obviously be taken into a method with certain flags to save hundreds and hundreds of lines of repeated code. On average, function lengths are about 500 lines. The code is littered with commented out code with no message saying why it was commented out. There are empty if statements all over the code and most of the time the if statement structures don’t make sense, such as an if statement being empty followed by an else statement that has code within it. To add delays for message sending, there are multi-nested for loops scattered through the code to delay full seconds. This is what I’ve found over the past week or so.\n\nI explained the project situation so someone can inform me if this is normal or not, as I’m currently in my senior year of my CS degree and have only ever interned at this job doing other smaller programming tasks. For me personally, the state of the project has made it nearly impossible for me to accomplish what was asked as I have difficulties understanding the functionality of the software and how to replace what has been asked to be replaced.\n\nWhen asked if I would help with the project, I was only told about the languages used for the project and nothing else. Again, I’m an intern, so I’ve tried to be eager to work on whatever was asked of me hoping I would learn lots in the process. I’ve been informed by multiple people that the high up management really wants this project to be finished asap. Unfortunately, there is no expert understanding the system completely, so mentorship/guidance or asking someone for specific help isn’t really an option. In fact, as of right now, I’m probably the most well-versed person who understands the code structure (yikes). However, I am sure that there are tons of people who are much more experienced in dealing with these situations than I am and could have the project updated in no time, but I personally do not know of people like this.\n\nAt this point, I’m quite defeated and am tired of trying to unravel this black box. I’m not sure what to tell my manager as I really need this job and don’t want to be looking for a job when school starts up again. I’m also a decent candidate to be hired on once I graduate, but don’t want to be stuck working on these types of systems, unless I was trained extensively.\n\nI was thinking to email my manager, explaining the above situation to him and that I would like to be taken off the project asap. Would this be a good idea, or should I just keep trying to chug along? Is there a certain way I should explain everything to him? I wouldn’t mind these types of situations (bad code) if I was shadowing someone/closely mentored by someone who knew what they were doing and how to untangle these types of mess. This idea of shadowing a Computer Scientist sounds amazing to me, as I’ve received no technical training for the 2 years I’ve interned. Is mentoring/training not popular in SE types of positions?",
    "title": "Should I ask to be taken off a project when I have no idea how to do the given task?",
    "subreddit": "cscareerquestions",
    "timestamp": 1546993910,
    "score": 24,
    "keyword": "black manager"
  },
  {
    "text": "Support Eng to Software Eng I made a post on here sometime last fall. I was asking if it would be possible to move from a support engineer role at Amazon to an Software Engineer role. I had just been offered the support engineer role to start out of college, but I was worried it would hamper my opportunity to develop. \n\nWell I only got two answers from that post.\n1. It will be hard but possible.\n2. No it will be a black mark on your resume.\n\nTurns out it was pretty much the same as if I had not been at Amazon at all. I found a listing i was interested in, applied for it, and interviewed through a full loop just like anyone else. \n\nSo for anyone interested in making the same transition, it is possible to do, your current role will not haunt you, and my manager didn't care at all.",
    "title": "Support Eng to Software Eng",
    "subreddit": "cscareerquestions",
    "timestamp": 1558575058,
    "score": 10,
    "keyword": "black manager"
  },
  {
    "text": "Next steps for me? Hey everyone,\n\nWanted some recommendations from more experienced people if possible :) \n\nSo here's been my career path so far -- I've been with the same Accounting firm for the past 5 years (will be 6 in March)\n\n&#x200B;\n\nFor the first two years I was an Intern in IT -- pretty much a lot of Helpdesk and some projects.\n\nThe second two years they gave me a full-time position as a SysAdmin -- again, lots of Helpdesk but they included me in more projects with some security here and there (because they knew that was my interest)\n\n&#x200B;\n\nFinally, this year in March, I was re-positioned to Application Security Administrator. I've been extremely happy with the job as my role finally changed and I had finally moved away from Helpdesk. My daily days look like this: \n\n\\-Managing Carbon Black Protection (Application Control / Application Whitelisting)\n\n\\-Using our Endpoint Management to push out updates\n\n\\-Managing Microsoft Intune for MAM\n\n\\-Manage Mimecast Administration Console, create policies for spam filtering, etc\n\n\\-Working with our InfoSec Manager for new policies & procedures \n\n\\-Work with our external SOC team to respond to any alerts / suspicious activity\n\n\\-Also learning Carbon Black Defense (Next-Gen Anti-Virus) -- just a little unfamiliar with common TTPs.\n\nBasically lots of stuff I'm really interested in. \n\n&#x200B;\n\nDoes anyone have recommendations on next steps for me? I definitely want to stay in Security / Digital Forensics. I'm also currently going for my Master's in Forensic Computing. \n\nWhat should my career path look like and what certs does everyone recommend? I currently have Security+. \n\n&#x200B;\n\nThanks in advance! :)",
    "title": "Next steps for me?",
    "subreddit": "cscareerquestions",
    "timestamp": 1570800262,
    "score": 8,
    "keyword": "black manager"
  },
  {
    "text": "Need some opinions on micromanagement regarding hours worked Hey CS careers. I have a question for you guys about micromanagement.\n\nI first started as a contractor at my current company 4 months ago with the intention to convert to full time after 6 months as that's how long it would take for my company to be able to get me out from my vendor without having to pay them fees. However, I realized that being a contractor was much more profitable due to certain tax regulations and decided to stay on as a contractor long term which works out for everyone as the company doesn't need to pay benefits or vacation just salary while I get to pay less taxes. My vending company and my previous manager basically just said if you worked the day you bill 8 hours as a full day worked. Sometimes we'd do a bit more than 8 other times a bit less but we typically received glowing feedback and no one really penny pinched the hours. \n\nHowever, recently a new manager came in and it could be due to inexperience as this is his first time in an official management role but he said he's having talks with everyone about being more \"honest\" with hours billed. I can only infer this as he doesn't believe people are working a full 8 hours to the dot and wants to clamp down on what he perceives as dishonesty. I brought up my concerns to him about how in this industry isn't always so black and white with regards to man hours and results and it's often hard to quantify what's billable and what is not. I tried to explain that from my perspective it'd a lot easier for everyone that we just bill 8 work hours for a day under normal circumstances and there's no need to pay overtime for little things unless it's extreme circumstance like the day we spent 12 hours from 4pm to 4am on sunday to support a production launch.\n\nHis response was that if you're working at \"50%\" capacity then that time would count as billable and he wants everyone to keep track on a daily basis accurate to nearest half hour or something (didn't specify how accurate but wants more \"accuracy\"). He admits this straight micromanagement but it's something he wants to do. I asked him what about that one day where I spent 4 hours on call after work monitoring a release but only really spent 30min max on actual work while the rest of it was watching basketball or playing PC games which he said that would count even though it goes against what he just said.\n\nIn the end I asked him what exactly is so bad about what is being done currently which is to just treat everyone like a full time employee and pay 40 hours per week as the default pay. He sounded fairly upset when his response was: \"Well you're a contractor, you should be a salaried employee then if you want that\".\n\nAll in all I'm not happy about this at all. I never considered about hours worked and would happily assist off hours or respond to inquiries at night. Since he mentioned the 50% thing should I just type with 1 hand because that's 50%? Should I be calculating every minute I'm assisting with inquires to bill those hours? Where do I draw the proverbial line? Furthermore, what happens if I go to dentist or a doctor's appointment one day. Does he expect people to keep track of the exact time they left and when they come back? What motivation do I have to work on something faster if I can stretch out half a days work into a full days work? I also have a coworker who has a favourite coffee place about 20 min away and he often takes up to an hour to go there back. Wonder if that'll get clamped down too.\n\nAnyway, I just want to get some other people's opinion. Maybe I'm being unreasonable but I don't see how this can be a good thing for anyone and it just creates stress needlessly for all parties.",
    "title": "Need some opinions on micromanagement regarding hours worked",
    "subreddit": "cscareerquestions",
    "timestamp": 1550079208,
    "score": 7,
    "keyword": "black manager"
  },
  {
    "text": "Is it reasonable to graduate one year later in my situation? Hey,\n\nI was talking with my dad earlier today. He bring up this topic and told me that he supports me about it, so it's better ask you all.\n\n&#x200B;\n\nFirstly about me:\n\nI'm 23 years old computer engineering student in Turkey, currently at my final year. Next semester there is only one course that I cannot take due to it exceeds credit limit and I need to do a second internship (for 20 work days, this also count as course). If I go to summer school, I can graduate on time. Otherwise I'll be graduating in June 2021 since the course that I cannot take is in spring semester.\n\n&#x200B;\n\nMy issue is my school is really bad. A no name university, really political and many teachers are incompetent. I will write more details about courses in spoilers in case you want to read. Long story short, I need to work my ass of to learn every concept all by my own. It's really hard for us -students in engineering faculty- to have free time because lecturers gives so many off-topic assignments.\n\n&#x200B;\n\nIn order to find a job I need to be well equipped. I'm aware of that. I don't have any side-projects which I did from start to finish. There is only project I contributed which is my cousin's cross platform mobile app. This and one internship is all I have.\n\n&#x200B;\n\nSecond but slightly minor issue is that when I graduate there is a compulsory military service which I don't want to go. If I manage to find a job abroad I can bypass this service by paying few thousand euros (it's a legal option if you stay in a foreign country for work for at least 3 years).\n\n&#x200B;\n\nNow, my dad advice me to NOT to go to summer school. Since the only course I cannot take is in spring semester, I can go back home and build some side projects, strengthen my resume and even learn a new language (I want to work in EU) and come back to school only for exams in spring semester (this is also an option if there is only one course that you have). I may not find a job in this condition but may find a chance to land a job with 1 year preparation.\n\n&#x200B;\n\nIs this a good idea?\n\nWill \"finishing school in 5 years instead of 4\" be a problem when I am on job hunt?\n\nI'm already -just guessing here- in disadvantage for being a non-EU/EEA citizen and requiring visa sponsorship. I don't want to put myself in a worse situation. I would really appreciate your thoughts and suggestions.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nMy school's ridicules:\n\n>!Firstly, our curriculum is based on 20 years ago's Computer Science curriculum. !<\n\n>!\\-In Programming Languages I they only showed really really basic C for whole semester. Declaring variable and arrays, and functions only.!<\n\n>!\\-Intro to Computer Engineering was basically how to open and shut down computers, what is floppy disk, what are file extensions, MS Excel shortcuts...!<\n\n>!\\-Programming Languages II was kinda better but still most complex topic was declaring pointers nothing more. Rest of the semester they taught some string library functions!<\n\n>!\\-From here it's sophomore year. One of the most cringe course was Internet Based Programming. Lecturer is a professor in geomatic engineering (his B.Sc and M.Sc is also in geomatic engineering) and  Deputy Chair of Department. He showed us some HTML4 and CSS. I'm not kidding, he told in class that \"HTML is out for few years and CSS is a new technology. We'll build a website with HTML and CSS with some ASP.NET. We're not showing you JavaScript because most of browsers don't even support it.\" and he said this back in 2017.!<\n\n>!\\-Object-Oriented Programming. First week we coded our first class. Next week second class which is basically the same class with different name. This continued for 10 weeks. All classes are plain class, no inheritance or any object-oriented concept shown. Lecturer spend 2 hours just to teach \"this\" operator. In final exam he wanted us to write a class when you make an object constructor calls \" 'class name' makes 'varName' sound\". !<\n\n>!\\-Algorithms and Data Structures were surprisingly good. Lecturers knew what they're teaching. Algorithm course was more of mathematical based rather than coding. In data structures I had fun a lot. Red-black trees, Tries, AVL Trees... all were shown and lecturer (Assistant Professor) was super nice to me and two other friends for being active in class and helped us a lot, rest of the class just memorized codes in labs and many failed.!<\n\n>!\\-On third year we have more theoretical courses. Operating Systems, Computer Architecture, Automata Theory, Data Communication Systems... All can be passed if you memorize last year's final/midterm exam which is available lecturers web sites.!<\n\n>!\\-Last year I thought we finally have some interesting  courses like AI, Data Mining and Image Processing but lecturers just read the presentation, no assignments towards subjects, no coding... They also happens to be \"memorize and pass\" kind of courses!<",
    "title": "Is it reasonable to graduate one year later in my situation?",
    "subreddit": "cscareerquestions",
    "timestamp": 1577660736,
    "score": 5,
    "keyword": "black manager"
  },
  {
    "text": "I’m planning to quit tomorrow 5 YOE, Past 2+ at big N, TC ~180k\n\nBack in March things were swell. Well liked by team and manager. Manager said I’d get promoted end of Q3 (Oct 1st) though I fought for Q2. But I didn’t get promoted in Q2, so I started working on a big project. It seemed technically interesting and my manager said it’d be a great addition to my promo doc.\n\nThe project did not go well. There was set back after set back. Completely unexpected complexity, and it continues to drag on to this day (~4 months total). My manager put me through weeks and months of blame games with other teams, all to cover his own ass at my expense. I’m still shocked how quickly he moved to push me under the bus. \n\nThe tech lead on the team stepped in at one point to help and explained how the project was fundamentally flawed (read impractical to implement at scale) and should be abandoned in favor of other more effective projects, but he was ignored by leadership and the project continued. He’s since (understandably) distanced himself from the dumpster fire. \n\nSince then I’ve become a total black sheep and just haven’t recovered from it. I’ve been completely shutdown for the past month and can barely eek out a line of code. I tried taking some time off but that just made coming back to work even more miserable. Team moral is also suffering — I’m still well liked by my peers (for now) who have graciously stepped up to cover for me at times, but the fallout is spreading. \n\nMy manager hates my guts now. I hear that he bad mouths me behind my back to my other teammates. Which doesn’t surprise me, all managers are scummy back stabbers in my experience.  \n\nMy skip level chewed me out the other day over the project being a failure, trying to squeeze me to wrap it up. Though strangely he ended the discussion by saying he doesn’t think this is an engineering failure but a management one — the team lost a lot of engineers recently and I don’t think they want to lose more. On the other hand I know he also plays mind games so I think he’s trying to look like the good guy and pit us against each other. \n\nLong story short, my manager told me today that I won’t be getting promoted in Q3 as I’ve “missed the window”. \n\nSo I’ve decided to give up. I’m tired of the carrot and stick game. Tomorrow, they win and I lose.\n\nI don’t have another job lined up, but honestly I don’t want to work at all right now. \n\n\nQuestions:\nAm I just a bad engineer?\nAm I making a bad decision?\nIs there a better way to recover from this burnout other than quitting?\nIs it worth trying to recover my current job with all the bad blood? \n\nMy personal inbox gets pounded by recruiters everyday, but I’m worried there might be a day when the “well dries up” and won’t be there when I’m ready to come back.",
    "title": "I’m planning to quit tomorrow",
    "subreddit": "cscareerquestions",
    "timestamp": 1565060148,
    "score": 6,
    "keyword": "black manager"
  },
  {
    "text": "What do you do about inappropriate managers? In my case, my manager is pretty nice and he’s teaching me a lot of important things about being a good software developer, but ... he’s a bit of an asshole. Like he’s morally bankrupt. He has no problem doing shady black hat things, like tracking IP’s or stealing confidential information, and just revealing all the shady things he does in his own personal life. All that being said, he’s an incredible developer and he lets everyone know it too, he also seems to have a fondness for me in particular idk why. Clearly he won’t ever get fired, but I feel super uncomfortable around this sociopath , so should I just leave ? Or stick it out for a while and just learn what I can before I leave the company. Thanks in advance",
    "title": "What do you do about inappropriate managers?",
    "subreddit": "cscareerquestions",
    "timestamp": 1567524049,
    "score": 7,
    "keyword": "black manager"
  },
  {
    "text": "Took a new job, great comp but really hating it thus far, but not sure if I can leave 3 years of experience, so I’m still relatively new. \n\nAbout 6 months ago, I was looking to switch jobs. Got a handful of offers, one of which was at a financial company. That offer beat all my other offers by like $100k, and it was all cash (no shares/vesting etc.). The total comp number was more than I thought I would/could ever make, so I basically accepted the offer based on comp alone. \n\nWe operate in a purely deadline based manner. Basically the goal is to get it functional and ship it as fast as possible. Cutting basically every corner we can cut. IMO all the projects we ship are garbage. I would be embarrassed to tell anyone I worked on them. And the other part is that I am basically a bug cruncher here. I do no architecting, green lighting, research, exploration, etc. \n\nAnother issue is that none of the senior talent appears to have done anything significant in their careers. At past jobs, the lead engineers always had impressive things they had done like helped build some well known product, or maintain a popular open source tool, or run some cool side projects outside of work. Here the lead engineers are just people that have been at the company for like 10 years. \n\nThe third and most important issue: I’m not learning anything. I learned so much from this past jobs, but not here. It’s just churching out simple fixes and tweaks. I don’t get to explore anything new because it would impact deadlines. \n\nSo the dilemma is that, I wan’t to leave but:\n\n- I’ve only been here 6 months, so I think such a short tenure would appear as a black mark on my resume.\n\n- I’m not sure how to talk about this current situation in interviews. Normally I have work projects I am proud of an happy to talk about. But for this place, there isn’t really anything I can talk about. How would recruiters perceive this?\n\n- Not sure if I could get a reference because they would likely be pissed i’m Leaving\n\n- Not sure if I could find another company willing to pay me this much, which means leaving would likely be a big pay cut\n\nHas anyone been in a situation like this? Should I just leave? Should I ride it out for 1/1.5/2 years and then leave? Or should I be happy with my comp and just suck it up. \n\nRegardless what I do, I think my first step is to have a conversation with my manager about this. I am just not sure how to phrase it.",
    "title": "Took a new job, great comp but really hating it thus far, but not sure if I can leave",
    "subreddit": "cscareerquestions",
    "timestamp": 1552063092,
    "score": 4,
    "keyword": "black manager"
  },
  {
    "text": "Potential job offer I'm not enthused about; how to proceed? I'm a fairly new dev, only doing it about a year and a half. I have been interviewing aggressively and tbh, for all my practice and preparation, not doing a great job. I freeze up terribly during technicals no matter what I do. But, I managed to get a job offer, for WAY more than I was expecting TBH, but for a very corporate, rigid company where I can tell I'm going to be unhappy. \n\n&#x200B;\n\nPros: \n\n\\- Longevity: all the hiring managers I met had gone from dept to dept and had been with the company >5 years, most from 5 - 10\n\n\\- Pay: Far higher than I expected, plus bonuses. I could use the money tbh. \n\n\\- Perks & Benis: Really decent health insurance, complicated but fair PTO system, pantry, exercise and health center with practitioners, apparently (although I'm not sure about using the office shrink, kwim)\n\n\\- Mentorship opportunities: MOST IMPORTANT to me; I feel that I need a senior to turn to to help sort me out. I was going through a weird time and I never my senior as a resource while I was there; I regret that because I feel like I barely grew over that year. \n\n\\- Tech events and the like: They sponsor conferences, have \"take a few days off to study something new\" days, host tech events, etc, so networking is a +\n\n&#x200B;\n\nCons:\n\n\\- Huge monolithic corporateness: This is not a tech company; it's a private company, established, publicly-traded, HUGE with large tech division. Even the onboarding has been a complete hassle of bureaucracy and red tape and I haven't even technically signed on yet. Luckily it appears tech can dress casually, but still. \n\n\\- People: Maybe it was just the people I interviewed with, but I had to WORK to have a conversation with those people. If I didn't keep trying to engage them, they would have left me twiddling my thumbs for like 10 minutes during the interview while they typed away and waited for my next round. I feel like I'm going to end up feeling alone or exhausted just from trying to be a nice coworker and have some manner of social interaction with my damn peers\n\n\\- Complicated workplace policies: In fairness, I forgot to ask about remote work, but it was never mentioned, at least, and I don't have anyone to ask. The PTO and sick time policies seem really complex and it's going to take a lot of explaining for me to figure out how it's being accrued. They don't exactly seem like the picture of flexibility. \n\n\\- General worry: I asked about what my start would be once I get on board, and they said within the third day I'll be coding on small bugs, not urgent; and then I spoke to someone who was the Senior Architecture Lead (something like that) and he said that all the seniors handle architecture, but design is up to us; and I was really hoping to at least be a fly on the wall for architecture meetings. I don't want to go from building full features to just baby bug fixes for years, know what I mean? \n\n&#x200B;\n\nSo, that's how I feel about this offer. Moneywise and PoorInterviewSkills-wise, I don't feel like I can let this one go; I have been getting callbacks left and right for positions, but none of them go past the interview stage because they all tend to be startups that \"don't have the resources to provide me with guidance.\" This is a big company with nothing but resources. But something about it makes me feel like there's a chance I'll stagnate and be kind of alone and a bit miserable.\n\n&#x200B;\n\nSo I guess my question is, how do I navigate this? Should I finally sign the offer (they do an INCREDIBLY THOROUGH background check, where any inconsistency can break you, and a drug test, because of course they do, so tbh I still feel like I don't have it until I sign the papers) how do I keep myself constantly growing and improving within the confines of a large corporate environment? What do I look for as growth opportunities within the company? How do I keep myself from stagnating? And, on the incredibly offhand chance that I get something else with a company I mesh better with, how much of a black mark on my record is it if I move within a few months of getting the position?",
    "title": "Potential job offer I'm not enthused about; how to proceed?",
    "subreddit": "cscareerquestions",
    "timestamp": 1562246354,
    "score": 4,
    "keyword": "black manager"
  },
  {
    "text": "Worried I will be replaced now that project is wrapping up. I have been on a very long and difficult project for almost 2 years and it is the only thing I have done at my company. Frankly it was a massive project for just one person and while I had some help on peripheral aspects here and there I have been the sole owner and developer on it, and I am the only one who really understands it.\n\nNeedless to say, I got really burned out, frustrated, and stressed from this project. Its complexity was extremely high and I suffered from severe cognitive overload and had many days that I felt like I was having a panic attack but I am not sure what qualifies as one so who knows.\n\nMy boss made arbitrary and super unrealistic deadlines based on whims and I took them seriously because I couldn't read his fucking mind so that only added to the stress.\n\nI should also mentioned that I think I kicked ass on this project, despite blowing passed deadlines left and right. I built a very sophisticated system and over the last several months of testing there have been almost no bugs and most problems it has had has been due to the systems it interacts with not working properly.\n\nAlong the way, I warned them of the bus factor with me being alone on the project and practically begged them for help and they did nothing.\n\nSo, a couple months ago, I got frustrated enough to mention to the project manager that I might leave if thing were not run better in the future (I know, maybe a mistake in hindsight) and tben my boss pulls me in to talk about my future. He asked me where I want to be in the future as far as pay and he thought my expectations were reasonable, then he told me I was the highest paid dev besides team leaders (expectation management?) and asked me how I feel about the future with the company. Well, I said it depends on how things go and didn't reassure him much.\n\nAfter that, they reasign a dev to work with me to learn everything I know to eliminate the bus factor.\n\nSo basically, I finally got help as the project is wrapping up, which has been great but a little late to make a huge impact, to be honest. Also, I am worried that they might think I am too expensive once this other guy can do everything necessary, which won't be a lot since my system should stay pretty static once it is in production and could just be a black box in a lot of ways.\n\nI like working for this company when I am not buried by impossible deadlines that apparently are just my boss's wildest dreams and not actual expectations.\n\nAlso, is that a dick move to tell me I am the highest paid dev? I feel like it is, especially because I don't make more than the average for my experience. All devs are underpaid here, but I am in an area where there isn't a lot of opportunity so to get a betrer paying job requires a 45 minute drive.\n\nI should mention that I did almost leave for another job in the middle of the project and was able to negotiate a big raise, but that only put me at about average. \n\nAnyway, I want to reassure my boss that I am not a flight risk and guage whether he is going to let me go after the project, but I am reluctant to kiss ass and make commitments. Looking for ideas I guess and general perspective on my situation or  advice.",
    "title": "Worried I will be replaced now that project is wrapping up.",
    "subreddit": "cscareerquestions",
    "timestamp": 1548982921,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "Have hope So, here’s my story ......\n\nI started out in college 20+ years ago as pre-med.  WTF fuck is pre-med? I think at the time they called it Microbiology at my university.  What the hell did I know?\n\nAnyway, got through Organic Chemistry, did OK, but not great.  My dad is calling me telling me to Major in Business because we owned a car dealership.  Ended up capitulating.   Life is life.  We live by our choices.  No going back.\n\nTwenty-Five years after graduation, through good times and bad, we sell the dealership.  I’m now 47 years old, have been basically in sales and management my whole career.  The dealership that bought us is generous, gives me a sweet , high paying employment contract (was part of the buyout), but I’m scared to death.  I tell my wife “it’s all good for a few years, but that will come fast....what about after that?  What about the kids college?  What about retirement?  I can’t be in frontline sales (I’m finance manager—-the guy who pushes the extended warranties), all my life.\n\nSo about six months ago I start researching becoming a CPA.  I completely understand that it will mean an initial pay cut if I need to work for an accounting firm, but on the same token, I can’t see being in the retail car business when I’m late 50’s, early 60’s.  I can do accounting until I’m 80 if I still have my capacities.  \n\nI go through all the motions.  Call my state board.  I’m eligible.  Got my 150 hours (I goofed off a little in school, took a few too many music and art classes).  I call a few successful friends, they sign off on my forms that say I’m not a dreg to society.\n\nNow here’s the part that gets tricky.  While I’ve read financial statements and made business decisions my whole career, I haven’t actually stayed in touch with hardcore FAR or REG type stuff.  That was left to our CPA firm and comptroller.  Once a year, for taxes, we would meet with our CPA , but it was financial statements 101.  I’d get the occasional compliment for a few questions (“ that accounting degree shows”) but pretty much it was the only accounting reinforcement I got for 20+ years.\n\nSo, when I decide I might want to pursue the CPA exam, I had not encountered “real” textbook/college/advanced accounting in over 20 years.  How do I relearn (and learn for the first time stuff like IFRS) that stuff?  I researched CPA courses.  Limited them to Becker and Roger CPA.  I get bored easily, so I chose Roger because I needed some entertainment and needed to be taught from scratch.  Roger seems to teach so I latched on.\n\nI must have put in 200 hours for FAR.  People told me I was over studying, I was crazy, why would I leave my six figure income......yada yada yada.  Anyway, in dragged myself forward.\n\nDay before my FAR EXAM, I locked myself in a hotel room near the testing center.  Continued to cram and consume caffeine.  I made an agreement with myself to go to bed at 10 pm.\n\nWhen I took FAR my world ended.  I couldn’t remember anything.  All I can say is it’s a Black hole in my memory., the main thing I remember is not knowing anything for most multiple choice questions (I was trending near 90% on my prep course), and not knowing anything on TBS.   the one thing I hated when studying at home was “research questions”.   I had given up on that while studying.  For the exam....I found the answer instantly.  So weird how that works.  \n\nI called my wife upset after the test , told her I failed.  Drank a bottle of wine to kill the pain, and tried to forget about it.   I started studying for BEC, but was feeling myself waiver off into “quitter” land .\n\n\nMay 7.....the day of score releases.  I read online that they will be released on the 6.  I attempt to log in to see just how bad I did.  Can’t remember my friggin password or my security questions .....but eventually....\n\nA salesman walks in my office with a car deal....I look up stunned ......he asks if I’m ok because my eyes are watering ......\n\nMy only response is “I passed , I don’t have a clue how, but I passed”\n\n\n\nDon’t give up my friends......I’m off to study BEC.  It is doable.",
    "title": "Have hope",
    "subreddit": "Accounting",
    "timestamp": 1557199390,
    "score": 86,
    "keyword": "black manager"
  },
  {
    "text": "Why you shouldn't work for EY in Audit (personal experience rant) Hi all,\n\n&#x200B;\n\nUsing my throwaway for this and this is also a bit of Offmychest material.\n\n&#x200B;\n\nEven after leaving the company for quite some time, I always seem to reflect upon my poor experience at EY every now and again. I wondered why it went so wrong, and where if it was my fault and if I could have approached things differently. I am at a different company now and the attitudes and experience I received are so different, I think I may have figured it out. I am not trying to trash EY, because I have heard that other people did have positive experiences, but this experience is my own and so I am writing this so noone would ever walk the same path I did.\n\n&#x200B;\n\nThere are basically two main reasons why you shouldn't work in Audit in EY, in particular the London office in UK:\n\n&#x200B;\n\n1) It is a complete lottery of who you work for in terms of whether they will care about your learning. I am guessing your chances of getting any kind of positive experience **is less** than 30% with EY\n\n&#x200B;\n\nWhen you are starting out, you are allocated to several audit teams to start your audit journey. Usually a senior or assistant manager will be the one guiding you on how to do your work at each client.\n\nI find that most of the people I worked with are frankly just terrible at their jobs, and so they are unable to sufficiently teach you how to do your job when you are starting out. You have the online manual (I think called GAM or something) so you end up heavily relying on that, but unfortunately as each company is different, it just doesn't work half the time. The manual is also ineffective at showing you how to do the work.\n\nJust a few things in the field in just your FIRST year which happened to me which is just bullshit below (assume each senior is different):\n\n* First client job and the senior recommends to \"Look at the last year's papers and just copy it across\" or \"use last year's papers and change to the correct figures\". No tangible explanation why. He was not new to the engagement as he was on it for a year.\n* Senior fails to explain properly how to do walkthroughs and test of controls, and eventually leaves it entirely up to you. For my first walkthrough, I initially did it with my senior because I told him it was my first time but it was very clear that even the senior didn't know what he was doing and just talked with the client about the process and then tells you to write it up (he didn't write any notes himself if I recall whereas I did. He did not ask about the controls of the client). He then later asks you about the controls (which were never explained at the time) and expected you to know from the walkthrough. He then tells you to go back to client to just look for any control (as I realise later this reduces substantive testing in year end). The senior then tells you to do all the other walkthroughs and test of controls alone and he reviews it from the comfort of his seat.\n* Senior decides to purposely use multiple circular references to complete audit substantive testing and not actually do the work. I had comfronted the senior on this because I need the right explanation for my work, and he says he will change it (he didn't). The audit passed if I recall. In the next year when I became senior and I was on the engagement again, I recall I fixed his fuckup by redoing the work entirely as if was new.\n* Senior, who leaves you alone most of the time, decides to show \"care and teach\" you only when the current manager happens to walk past and stay for the morning, but after decides to leave you alone and not offer much help anymore i.e. played the company politics for the checklist to be promoted. This person, if I recall, eventually became Manager in EY.\n\n&#x200B;\n\nAnd this is before I talk about the 2nd or 3rd year and beyond. The poor work life balance is actually very trivial in comparison. You would actually WISH you can work 9am-1am everyday, in return for a good decent team.\n\n&#x200B;\n\nThis is only one half of the story, the other half of people you work for is the client. It is also a lottery of whether you get to work on a GOOD client who knows what they are doing and are able to teach you their jobs and how things work, versus a BAD client, who only considers you as a cost and just pisses you off at every chance they get i.e. give you simple 1 phrase answers that you can't work with. Again, to keep things short, here are three things I recall which is just bullshit:\n\n* Task was to find out why there was a 10m cash difference between the bank and the cashbook. Cash person sends me to the Operations team, who sends me back. After a few cycles, I escalate to their managers and I explain the situation, who send me back down to the finance cash person and the same operations person. Eventually escalates to CFO, who again, pushes back down to that same finance cash person who can't figure out why there is a 10m black hole in the cash balance. I explained to our own Senior Manager, who points me back to the same finance person. This audit got passed.\n* Get shouted by someone because you ask them about the process. He calmed down eventually, but he never apologised.\n* Get poor responses or attitudes by the client for asking them for the usual items i.e. asked for the backup for one of the lines, but they sulking give you it or unable to give you it in the reasonable timeframe. Basically in my example, the finance team regularly talks shit about the audit team to the whole floor, from compliance to the admins and sales, which made everyone give this poor attitude to us, who, lets be honest, are basically recent graduates from university. Neither their senior management nor our own management intervened. The resultant audit work was poor but the audit got passed anyway, and no management points were ever made to correct this.\n\n&#x200B;\n\n2) For a people focused firm, most people in EY doesn't seem to have any values\n\nI mean just basic stuff, like ensuring work is done on time, wanting to complete to the decent quality of work or being thoughtful for other members of the team. You are usually allocated a \"councillor\" incase you have any problems, and I tried to use it to push myself to better engagements but due to reason 1), your councillor can be pretty ineffective because either they are leaving, don't care about you by not responding to you, or say they will fix it, but nothing happens. For some engagements the work I see being done well by this firm are through office politics whereby they talk nicely to clients or senior management claiming everything is fine, when it is not.\n\n&#x200B;\n\nI get the feeling that more than half the people I worked with, really didn't want to be there and would rather be lazy and accept a paycheck.\n\n&#x200B;\n\nIn fact, I would go as far to say that EY has taught me POOR values and bad work ethics. When I bought this up to one of my councillors whereby I mentioned that I am not learning the ropes because x, y, z, I was told it was my fault that I didn't learn and I should read the online manual more. I fucking hated EY with a passion from that point. My councilors kept leaving for other jobs so I actually get different councillors every year but when I bring it up again, they all say very passive sounding things, rather than actually doing something about it and give me a better engagement (note, they say that they will only allow me to change engagements once I have a few more years under my belt).\n\n&#x200B;\n\n**Why are these two reasons particuarly stick out?**\n\nThinking back, was all this pain worth the accounting qualification? I actually planned to stay at EY and either make it to Manager or move to a different department, but because of the lack of learning, I wasn't able to improve myself enough to be at the current standard. Again, this is apparently my fault.\n\nI left the company because I refused to accept it. What I am trying to say is, because of those two reasons, EY basically fucked with my career and essentially wasted precious years of my life. I walked out of the company feeling more stupid and a poorer motivated employee than when I left university.\n\n&#x200B;\n\nMy life was somewhat changed at my new company. Everyone is nice here, and things are explained very clearly to me and my work has gained several praise from my team, such that even the top people at the board were impressed. I am getting better at my current job, but at the end of the day, this was my plan C route.\n\n&#x200B;\n\nSorry for the rantish text. I want to emphasize once more that this might be an outlier experience for me, but please for all those out there lucky enough to have multiple choice offers for an audit role, don't bother going to EY, go to PwC or KPMG or Deloitte. I genuinely believe you are risking your career if you pick EY.",
    "title": "Why you shouldn't work for EY in Audit (personal experience rant)",
    "subreddit": "Accounting",
    "timestamp": 1560729214,
    "score": 70,
    "keyword": "black manager"
  },
  {
    "text": "Really want to report the guys on my team to HR but don't want to be \"that guy\". I started at a midsize firm 2 weeks ago. This week is the first week I'm out on a client with my team. Everything was going great...until Monday when my team decided to stay a few hours after the client left and they started...talking. Like talking about what they really wanted to talk about.\n\nThey basically went through every new hire and gave their impressions of them. That in itself was awkward but I just sat quietly and ignored it all.\n\nThen what REALLY bothered me is when they brought up the one black new hire. He sat next to me and quickly became my favorite of the bunch. Super friendly, smart, funny. But apparently my team isn't fond of him. My current senior did one of our first week audit trainings and said he hated how \"the black one\" kept answering questions. My senior said he thought maybe he was answering so much to \"make up for being black\". That's literally how he said it. Funnily enough, he told me later on he kept answering questions to move the training along (he would just sit there waiting for us to answer; guy took one for the team) and to keep himself from falling asleep because it was so boring.\n\nAnother staff joked that when he first met him he almost said \"What's good \\[n-word\\]\" but \"thought better of it\". And they said that he probably feels lonely being the \"only one\" of the new hires that is black. Which BTW isn't true because the one time he wasn't with us, a few of the new hires even said they were so glad he started at the same time as them. And every time I see him he's talking with another staff or manager. AND he's not the only black person at the firm, like not even close, and especially not the only minority. So IDK what gives them the impression that he's some lone wolf misfit...\n\n&#x200B;\n\nI wanted to punch them. I feel so bad because I really really like this guy. I hung out with him after work just yesterday and really wanted to tell him what they all said. I feel like I'm betraying my new friend and enabling racist assholes. But I'm hesitant to say anything because 1) even if I do it anonymously, they'll KNOW it was me, 2) they haven't really done anything to affect him directly, and 3) I don't want to become someone that no one wants to talk to. I feel like it's so early for me to already be getting in a shitshow like this but if this is what this team is going to be like, I don't think I can sit through this for the 6 weeks I'm assigned to this client...Will I earn some type of reputation in a firm for reporting others to HR, especially about stuff that doesn't directly affect me? Should I even report this or just let it go? What do you think\n\n&#x200B;\n\nEdit: And I should mention that they are of course fully aware that I am literally a new hire myself and know them all. And when they asked what I thought of him, I told them I really like him and have been getting to know him personally. This was all said BEFORE they started talking shit about him.",
    "title": "Really want to report the guys on my team to HR but don't want to be \"that guy\".",
    "subreddit": "Accounting",
    "timestamp": 1568806341,
    "score": 32,
    "keyword": "black manager"
  },
  {
    "text": "Free talk Friday! Trying to keep this alive!\n\nIts everyone's favorite day of the week. Time to bitch about how bad it was, talk about how good it was, or say what you're looking forward to this weekend.\n\nI'm *still* waiting on my company to give me the fulltime offer letter we talked about a couple weeks ago. My manager followed up with me to let me know things get slow and please dont leave. I'm getting anxious though, I really need some time off and I cant afford to do that until I'm salary and get some of that sweet, sweet, PTO.\n\n\nAlso, the new season of Black Mirror was dope. It's a shame it was only 3 episodes.\n\nWhat y'all got going on??",
    "title": "Free talk Friday!",
    "subreddit": "Accounting",
    "timestamp": 1559917626,
    "score": 9,
    "keyword": "black manager"
  },
  {
    "text": "What does a non-traditional path look like? A lot of times, I get the sense that there's a  dominant narrative for non-tax, non-government people on this sub. \n\nIt's the \"Leave school, go into audit, get hooked on black tar heroin, leave audit, go into a corporate senior/manager role (or FP&A if you're very good and so inclined), work up to controller at that company or a different one. Then, if good/lucky/inclined, CFO.\" path. Which, it's practically a fairy tale. I'm excited just writing it.\n\nBut what if you don't go into audit? What if you get a job as a staff at a big company, or at a small, growing software company. What do those paths look like? So many job postings for higher roles seem to want a public background, but is that firm? Are you left scrounging for whatever roles the people with three years in public don't want, even if those three years were a half decade ago? I'm curious.",
    "title": "What does a non-traditional path look like?",
    "subreddit": "Accounting",
    "timestamp": 1561572558,
    "score": 4,
    "keyword": "black manager"
  },
  {
    "text": "From CIB to Big 4 Hi all, \n\nI just wanted to collect some opinions on my current situation, in case anyone has already gone trough something similar.\n\nA few months ago, I joined a Big 4 in a non-client facing position. My primary background is in corporate & investment banking where I was client facing. The reason that pushed me to leave my former job were more practical (low salary, limited progression, questionable environment, high turnover). Yet, during my time in banking, I kept reaching one high after another leading to constant positive feedback from clients, senior management, country heads etc, awards etc..My local management (middle-management) seemed however underwhelmed and didn't have the same level of enthusiasm for some reason.\n\nI thus decided to leave my former banking position to move into this Big 4 one ... I deem it to be the worst mistake I could have ever done career-wise. I'm almost 6 months in and although I understand there is a reasonable adaptation time, it seems I'm not adapting. I went from being a high-achiever in a client-facing role, to an incompetent individual in an internal role. \n\nThere are no procedures and processes in place. One day it's black, the next it's white. You get ratty responses from contractors offshore, local managers and other stakeholders. Limited training. When you ask a question, it's either \"I don't have time\" or \"I don't know\". No one cares how you're doing or progressing as a new comer. You're being given a project with incorrect information which you have to feed to other stakeholders and thus end up losing credibility. \n\nIt's a headache. I've dealt with demanding CFOs/directors/MDs in banking and no one ever said they didn't have the time or sent me a ratty response. I managed to build relationships with higher management very quickly in banking, which does not seem to be happening here. The job in itself is not hard and certainly does not even compare to the amount of pressure I had in banking. This is nothing. However, the hostile atmosphere is hard to dealt with. The job is extremely boring as well. I'm depressed and certainly don't recognize myself. I lost all of my confidence, I'm not the bubbly/shiny person I once was in banking. I cry every day at work, which is not normal as I probably cried 3 times during my 4 years prior to this.\n\nHas anyone ever moved from industry to Big 4 to realize they made a mistake? Was it easy to move back into industry?\n\nThanks.",
    "title": "From CIB to Big 4",
    "subreddit": "Accounting",
    "timestamp": 1566237585,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "[Update] Redditor who went on a racist rant about black customers has been fired. A couple days ago, someone posted a link to a thread in which a Redditor [described her hatred for black customers at her fast food establishment](https://removeddit.com/r/confessions/comments/bo0v40/working_in_fast_food_customer_service_has_made_me/). Not only was the post itself vile, but it created a place for thousands of bandwagoning racists to comment about their hate for black people. However, like most racists, this one wasn't very smart. She had left comments in her previous posts that contained identifiable information, and some of our more sleuthy users were able to identify the individual. \n\nThe manager of her work got several emails and phone calls about her post. According to one of our Reddiors I spoke to, the manager said she'd never heard of Reddit, but was very disturbed by the employee's comments posted there. The managers also informed them that their restaurant doesn’t tolerate that type of behaviour or attitude towards their customers and, as of today, that employee was no longer with the restaurant.\n\nThe truth of the matter is, in our current era, racist are more bold than ever. They need to be taught their racism will _not_ be tolerated. Their hatred might be acceptable on the internet, but in the real world there are consequences. I know many of you were hurt and upset reading the comments in that post, but at least a little justice has been served. \n\nP.S. If you know of this user's personal identifiable information, do not not post it in this thread. Doxxing is against the rules. Thanks!",
    "title": "[Update] Redditor who went on a racist rant about black customers has been fired.",
    "subreddit": "blackladies",
    "timestamp": 1557945737,
    "score": 263,
    "keyword": "black manager"
  },
  {
    "text": "'I don't want those people in our store': Subway manager fired after denying black teen a job | FOX 29 News Philadelphia (WTXF)- Subway is trash anyway",
    "title": "'I don't want those people in our store': Subway manager fired after denying black teen a job | FOX 29 News Philadelphia (WTXF)- Subway is trash anyway",
    "subreddit": "blackladies",
    "timestamp": 1559664782,
    "score": 123,
    "keyword": "black manager"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 509,
    "keyword": "black manager"
  },
  {
    "text": "People constantly overstate the extent to which women were \"oppressed\" in the past. People constantly quote that \"women didn't have the right to own property\", \"women were chattel\", \"women were allowed to be abused, beaten and raped by men\", \"women didn't have the right to vote\", \"women were kept out of male-dominated industries\", \"women were oppressed by men\", etc.\n\nAll this is bullshit.\n\nUnder coverture, single women otherwise known as \"femme sole\" did have the right to own property, had the right to enter into contracts, and overall had the same rights as single men. It was only when they married that they sacrificed some of their rights to own property and enter into contracts on their own.\n\nWhen a woman got married she was considered a \"femme covert\" and her existence was consolidated into that of the man's. People constantly take this to mean that she was chattel, owned by men but this was not the case. Once they were married, women were entitled to be supported and to have the portion that she brought into the marriage managed by their husbands, to the best of their ability. Women had the right to buy necessaries on their husband's credit as their husband's agent. Women could not be prosecuted for most crimes and their husbands would be prosecuted in their stead. Women were immune from liability for debt. They were not in any way chattel, they definitely had less agency, but at the same time they were entitled to protections and privileges and it was considered the man's duty to provide said protections and privileges for them. Women have very frequently sought redress in common law and equity courts when husbands failed in their duties.\n\nMarried women were also not allowed to be abused unlike what people think. The laws allowed for mild correction such as spanking the way you would a child at the time but husbands were not allowed to beat their wives black and blue. A woman could obtain a surety of the peace bond to ensure her safety from a violent husband.\n\n[https://lonang.com/library/reference/blackstone-commentaries-law-england/bla-115/](https://lonang.com/library/reference/blackstone-commentaries-law-england/bla-115/)\n\n[https://www.legalgenealogist.com/2019/02/12/the-defense-of-coverture/](https://www.legalgenealogist.com/2019/02/12/the-defense-of-coverture/)\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nYes, women didn't have the right to vote for most of history, but neither did men. Property owners had the vote, the vast majority of men did not. Male suffrage was something that was fought for, and when men did end up getting the vote before women it wasn't necessarily because of discrimination against women. It was because the vote at the time was seen as a direct extension of men's obligation to be conscripted and fight in war, something which women were not obligated to do.\n\nSomething that makes this even more muddy than it already is is that: the reason why votes for women took so long to be implemented was that the majority of women did not want the vote. There were many anti-suffragette societies, and a fair amount of them were led by women.\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\n[https://www.npr.org/sections/npr-history-dept/2015/10/22/450221328/american-women-who-were-anti-suffragettes](https://www.npr.org/sections/npr-history-dept/2015/10/22/450221328/american-women-who-were-anti-suffragettes)\n\n[http://nationalhumanitiescenter.org/pds/gilded/power/text12/antisuffrageassoc.pdf](http://nationalhumanitiescenter.org/pds/gilded/power/text12/antisuffrageassoc.pdf)\n\nWomen were allowed to work in a lot of male-dominated industries. Guild-type work was always open to single women and windows. In fact there is a lack of evidence of anything preventing women from working. An article (which I've linked below) says:\n\n\"For most girls, becoming a blacksmith was probably not a dream. Husband, family, home: those were the pursuits of a young woman of the eighteenth century. Finding a woman or women working at all outside the home, much less in a male-dominated trade, most likely meant the dream wasn't shaping up the way they'd hoped. Some women worked because they had no choice.\"\n\n\"Though there was no system of standards governing the trades in the colonies, the method of learning a trade generally followed the apprenticeship guidelines established by the guilds in medieval England and Europe. Women were not excluded from membership in any of the earlier guilds. The Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\"\n\nThe paragraph below is a quote from a redditor \"w1g2\" who made a really good point regarding work, and women's involvement in it.\n\nWas it a social norm that most women did not seek out careers as they do now? Sure, I don't doubt it. But women did not have access to reliable birth control (because it hadn't been invented) so unless they wanted to spend the entirety of their life chaste, would have to plan for many of their years being filled with pregnancy, childbirth, breastfeeding, etc. Not to mention, quite a lot of the jobs available weren't in nice air- conditioned offices but involved hard labor or danger like becoming a doctor (working with the near dead, sometimes even people with a plague) or a lawyer (working with criminals, especially when prisons did not have as nice standards for living). Maybe it's the case that in different environments, people, including women, will have to react accordingly to different things and maybe it's understandable that in an environment that used to have far more risk and danger and death and with little knowledge or control over fertility, women wanted different things than they do now.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nSo. Women were not nearly as \"oppressed\" as people seem to think they were. There was never a patriarchy holding women down. Were there burdens, obligations and disadvantages? At times, yes. But these usually did not run one way - men too had their own set of burdens. And whenever I mention this to people it's met with handwaving or sometimes outright denial of the evidence.\n\nIt seems to be very hard for a lot of people I've seen to believe that women had a lot more privilege and social power than previously believed, and that men had obligations imposed on them.",
    "title": "People constantly overstate the extent to which women were \"oppressed\" in the past.",
    "subreddit": "MensRights",
    "timestamp": 1553409291,
    "score": 406,
    "keyword": "black manager"
  },
  {
    "text": "A compilation of evidence debunking feminist historical revisionism. I have made a post somewhat similar to this before but I've since collected a lot more information about these topics and so I believe warrants yet another post.\n\n*Myth #1: Women weren't allowed to work.*\n\nMost documentation from the past heavily implies that people attempted to avoid working as much as possible. Even so, many women did work (mostly because they had no choice but to) and there has never been a law restricting women from working.\n\n\"Though creative research has produced evidence of women working at male-dominated occupations in the eighteenth century and before, there is undoubtedly more documentation out there, in newspapers, diaries, legal proceedings, and prints. What is more compelling is the lack of documentation that women were not allowed to work. Although religious practices and social norms might have restricted certain activities in some parts of the world, there were no laws prohibiting women from working a trade.\"\n\nAt the time, only members of a trade guild (associations of producers that trained craft people, maintained control over production, regulated competition and prices) were allowed to sell their goods or practice their skill within the city. Non-guild members were prohibited from selling competitive products. An aspiring master would have to pass through the career chain from apprentice to journeyman before they could be elected to become a master tradesman. They would then have to produce a sum of money and a masterpiece before they could actually join the guild. If the masterpiece was not accepted by the masters, they were not allowed to join the guild, possibly remaining a journeyman for the rest of their life.\n\nWomen were not barred from any of the trade guilds in Britain at least as far back as the 1400s. Apprentice forms for guildwork had spaces left blank to insert 'he' or 'she', though girls who chose this traditional route to mastery of a trade (which was extremely long and arduous) were usually orphaned and had low prospects for marriage, thus they were going to need to work.\n\nMarried women, though, had the privilege of circumventing the long, onerous, arduous process of trade certification as they could receive the master tradesman status from their husbands and thereby continue his work, even take on apprentices to train (which suggests that the social assumption was that wives would learn enough about their husband's business and trade to be able to at least continue to oversee it after he died). Lots of widows continued to run their husbands' businesses long after their death.\n\nThe Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\n\nA 1770 publication called *The Tradesman's True Guide or a Universal Directory for the Towns of Birmingham, Wolverhampton, Walsal, Dudley and the manufacturing village in the neighborhood of Birmingham* carried exhaustive lists of tradesmen and tradeswomen alphabetically by name and by trade, and there are women listed in every trade from butcher to wire drawer.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nReally, very little I've seen shows that women were maliciously \"kept out\" from trades or professions that they wanted to enter into. It may have been a social norm that most women did not seek out careers as they do now, but looking at the histories of the first women to enter into medicine, law, etc, show that they hardly faced any resistance in doing so.\n\nIn 1847, Elizabeth Blackwell became the first woman to attend medical school in the US and was the first woman on the Medical Register of the General Medical Council. She sent applications for admission to twelve of the most promising institutions in the northern states, and her application was accepted by the medical department of Geneva University. Feminist revisionist history \"explains\" that she was only admitted to the college by the evil men as a joke, but as will be amply demonstrated this is the opposite of what actually happened.\n\nIn fact, the student body sent her a letter to welcome her:\n\n>At a meeting of the entire medical class of Geneva Medical College, held this day, October 20, 1847, the following resolutions were unanimously adopted:–  \n>  \n>Resolved – That one of the radical principles of a Republican Government is the universal education of both sexes; that to every branch of scientific education the door should be open equally to all; that the application of Elizabeth Blackwell to become a member of our class meets our entire approbation; and in extending our unanimous invitation we pledge ourselves that no conduct of ours shall cause her to regret her attendance at this institution.  \n>  \n>2. Resolved – That a copy of these proceedings be signed by the chairman and transmitted to Elizabeth Blackwell.\n\nShe describes this letter as one of her most valued possessions, and in her autobiography she states that the men of the college supported her 100% and beyond.\n\n\"The behaviour of the medical class during the two years that I was with them was admirable. It was that of true Christian gentlemen. I learned later that some of them had been inclined to think my application for admission a hoax, perpetrated at their expense by a rival college. But when the *bona-fide* student actually appeared they gave her a manly welcome, and fulfilled to the letter the promise contained in their invitation.\"\n\nShe also notes that the general public also had a favourable view of a woman entering into medicine.\n\n\"The admission of a woman for the first time to a complete medical education and full equality in the privileges and the responsibilities of the profession produced a widespread effect in America. The public press very generally recorded the event, and expressed a favourable opinion of it. Even in Europe some notice of it was taken, and 'Punch' showed his cordial appreciation by his amusing but friendly verses.\"\n\n[http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III](http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III)\n\nThere are also other examples of women entering into \"male\" fields and encountering little resistance. There's the example of Arabella Mansfield, the first female lawyer in the United States. Although by Iowa law the bar exam was restricted to \"males over 21,\" Arabella Mansfield took the exam in 1869, passing it with high scores. Mansfield challenged the state law excluding her, and the Court ruled that women may not be denied the right to practice law in Iowa, admitting Mansfield to the bar.\n\nOr Ada Lovelace, who was encouraged in her mathematical ability from a young age by her parents and received the best of tutors to increase her ability. She worked with Charles Babbage on his Analytical Machine, though they both \"fell into historical obscurity, and the Analytical Engine was unknown to builders of electro-mechanical and electronic computing machines in the 1930s and 1940s when they began their work, resulting in the need to re-invent many of the architectural innovations Babbage had proposed.\"\n\nOr Amelia Earhart, who was flown \"like a sack of potatoes\" by pilot Wilmer Stultz across the Atlantic in her 1928 transatlantic flight, and immediately became a celebrity, wrote a book about the experience, was used to endorse products, and dubbed 'Lady Lindy'. There is a plaque that marks where the plane landed in Wales. All the fervour over it was solely because she was a woman who crossed the Atlantic regardless of the fact that she didn't do any flying at all in her 1928 flight (She did, however, go on to complete a transatlantic solo flight later on in 1932).\n\n[https://en.m.wikipedia.org/wiki/Amelia\\_Earhart](https://en.m.wikipedia.org/wiki/Amelia_Earhart)\n\nOr, for a very long-ago example of this, Murasaki Shikibu from Japan around the year 1000, who listened at the door while her brother received lessons in Chinese writing and through that learned it herself. She was far from reviled for being a woman who knew Chinese and was commissioned by the Empress to write the Tale of Genji, a classic work of Japanese literature often called the world's first novel.\n\nOh, the o p p r e s s i o n .\n\n*Myth #2: Marriage was an institution created by men to oppress women. Men were disproportionately given privilege and power and women were treated like his property in marriage.*\n\nAgain this is a bastardisation of the past. Feminism has to stop treating men as the enemy and as the source of all women's (and also men's) problems. They need to realise that things weren't always as they are now, and realise that it was not Patriarchy or men that restricted the choices of both genders and forced them into strictly defined roles, but that these roles came about because it was the best way of arranging societies in the past - a past that was much harsher and more unforgiving than it is now. A past in which there was more work to do than there were hours in a day. A past where men spent most of their short lives working like mules to support themselves and their families and women spent most of their short lives incapacitated by childbirth and child-rearing. A past in which we sent children into coal mines that ruined their lungs and into factories which lost them limbs. Things sucked, and the reason it was bearable at all back then was *because* of the gender roles.\n\nMen were not the ones who relegated women to the domestic sphere or kept them dependent on men. Biology did. A woman at that time could not simply strike out on her own and do whatever she wanted. For most of history we had no reliable birth control, no safe abortion, no maternity leave, or social security, and most public sphere work back then involved hard labour. And if you were a woman back then who wanted to be able to have sex, then you would have had to plan your life around the idea that you would be getting pregnant, giving birth, and breastfeeding for most of your adult life - and that would have meant you could not be a reliable enough worker to support even yourself, let alone a child, and it would inherently have made you dependent on other people to help you. Until the last 100 years or so, most women could not have lived a life of children and public sphere work, independent of a man (and not all can today, realistically).\n\nEven with support, most women in poor and middle class families had to work because that was the only way to make enough money to live.\n\nSo in a time when single motherhood was a one-way trip to the gutter, marriage was a practical arrangement. The function of marriage was not to oppress women, but to positively assign paternity inasmuch as possible, and then obligate the men so assigned to their children and the mothers of their children. For life.\n\nThe taboo on sex outside of marriage (which was applied to men no less than women) made it difficult for an unscrupulous man to cheat the system. These rules surrounding marriage also mitigated the problem of paternity uncertainty, which maximised men's willingness to invest in their kids. \"I know these are my kids, so I will work hard to feed and shelter them.\" And the reason why we kept lifelong monogamous marriage for so long is because it increased the resources which would have been available to offspring, providing a healthier environment for children to grow up in.\n\nSo when a man married a woman, he was legally obligated to feed, clothe and shelter her and any children produced in the marriage to the best of his ability. Unlike what feminists seem to think, he could not sell her. He could not return her for his money back. He could not drop her at the local midden heap. He could not destroy her the way he could his actual chattels. He could not trade her for a better one. He could not legally neglect her.\n\nJust to make things crystal clear, here is a summary list of entitlements that women enjoyed in marriage (and after marriage) during the old \"patriarchal\" system of the past.\n\n1. When a woman married, she had to hand over her property to her husband's care (again, NOT because she herself was property, but because he was administrator of the family), but he OWED her not just a living, but the best living he was financially capable of providing for her. A wife was entitled to be maintained by her husband.\n2. Though women did not have the right to enter into contracts in their own name in marriage, women had the privilege of the Law of Agency, giving them the legal right to purchase goods on their husbands' credit as their agent. If the wife racked up debts that the husband couldn't pay, she was immune from liability for the debts she racked up - that liability fell to the husband instead.\n3. Women had the entitlement of being protected from prosecution for any number of crimes if they could prove their husbands were aware of said crimes. In which case, he would be prosecuted in her stead--not just held AS responsible as she was, but held solely responsible for her actions. This allowed married women to displace accountability for a large number of offences onto their husbands. \"She's out of control and does what she wants, regardless of my wishes,\" was not a valid legal defence for those men.\n4. Women were exempt from paying taxes, and there was an entire female underground economy of barter and trade that was not subject to taxation or government interference. Even when married women gained the right to hold property within marriage, it was their husbands who were responsible for the taxes owing on it, and it was their husbands who were held 100% financially liable for providing all necessaries to the family, including the wife, even if she made more money than he did.\n5. After divorce, men were held fully financially responsible under the law for the ex-wife and kids. Divorced women were entitled to be supported by their ex-husbands to a level commensurate with the husband's for potentially the rest of their lives unless she remarried.\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nThat doesn't sound at all like women were treated like property to me.\n\nI'm sorry, but if I have property, I have no legal duty of care toward the actual property I own, nor any obligation to commit to own it until death. I can smash my property on the ground and treat it however I want and it would be my right to do so. Men could not do any of that to the women they were married to. They had obligations towards them to provide for them - even after divorce, and to protect them - even from the consequences of their own actions. Wives had no such obligation towards their husbands - they were entitled to be the ones who were supported. Because the purpose of marriage in the past was not to oppress women and make them the property of men, but to ensure that women and their children could be provided for and protected, and to place the responsibility for that provision and protection on the man even at cost to his own wellbeing, health, and even life. This has been the case since time immemorial.\n\n\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"\n\nEphesians 5.\n\n[https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV](https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV)\n\nIn fact, many of the supposed \"privileges\" men had in marriage in the past were to help them carry out their obligations and to prevent them from becoming wholly onerous.\n\nIf a man had an obligation to be accountable for provision for his wife and children and to maintain family finances, it stood to reason that he also should have the entitlement of having control over any assets of his marriage, including those his wife brought into the marriage, because he was the one who had a responsibility to keep the entire family afloat and to increase their holdings.\n\nIf a man was responsible for the protection of his wife and children to the point where he could be legally required to stand between his wife and the law within numerous contexts, and be punished in her stead (whether she contracted debts he couldn't pay or committed a crime he would have to answer for), it makes sense why he would be considered head of household and why his family would need to obey him as well as abide by the restrictions he placed on them.\n\nIf, upon divorce, a man would be held solely responsible for the maintenance of his wife and child, it makes sense why he would get custody of the child that he was supporting, as well as ownership of assets so he could satisfy that obligation.\n\nWe gave men these rights and privileges because they were the tools that he needed to satisfy his responsibilities. And in that way there was a balance. \"Women \"got less\" because their obligations and accountability were less, their responsibility was less. Men \"got more\" because the buck stopped with them, whether that buck consisted of a sack of coins or his blood.\"\n\n*Myth #3: Men were allowed to beat their wives with impunity.*\n\nIn the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\n*Myth #4: Husbands were owed sex with their wives. Marital rape was not illegal, and marriage as an institution was based around rape of women.*\n\nThe idea at the time was that there could not be such a thing as marital rape because as a married person you are owed sex from your spouse, i.e. conjugal rights. This applied to both men and women. People who believe that conjugal rights \"allowed husbands to rape wives\" and not the other way around haven't actually done any research.\n\nIt was based on the idea that **both parties** had a right to sex in the relationship, and this was exercisable in law by each partner in a marriage.\n\nThe Bible said:\n\n\"*It is* good for a man not to touch a woman. **2** Nevertheless, because of sexual immorality, let each man have his own wife, and let each woman have her own husband. **3** Let the husband render to his wife the affection due her, and likewise also the wife to her husband. **4** The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.* **5** Do not deprive one another except with consent for a time, that you may give yourselves to fasting and prayer; and come together again so that Satan does not tempt you because of your lack of self-control.\"\n\n[https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV](https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV)\n\nDo note the specific passage where it says \"The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.\"*\n\nAnd here's a quote from an article detailing the history of sex and marriage.\n\n\"A hundred years ago or so, if you took the statute books literally, the only people entitled to have sex with each other were people who were legally married. All other sex was against the law. Fornication (sex with unmarried people) was illegal; so was adultery (sex with a married person—but not the person you yourself were married to). Cohabitation—living with someone in a sexual relationship—was against the law, except for people who were legally married. Enforcement was, shall we say, something less than perfect. At times, it was almost nonexistent. And the rules were riddled with exceptions. Sodomy, on the other hand, was quite a serious crime; and the full weight of the law sometimes came down heavily on people who had gay or lesbian sex.\"\n\n\"Married people were not only *entitled* to have sex; they were, in a way, *required* to have sex. Of course, nobody checked on whether John and Mary were having sex every night, or once a week, or once a month, or never. But if either John or Mary did not perform at all, for whatever reason, the frustrated partner had grounds for divorce; or even perhaps an annulment.\n\n[https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking](https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking)\n\nHusbands faced divorce if they were impotent and unable to consummate the marriage, though charges were usually made years after the wedding day. There was a similar charge of frigidity for wives, but it seems that wives charging their husbands for impotency was far more common. Husbands had to show an erection to a court audience and sometimes attempt to perform sex with their wives as well.\n\n[Source 1](http://www.bu.edu/law/journals-archive/bulr/volume89n5/documents/HOFFMAN.pdf) [Source 2](https://www.theparisreview.org/blog/2016/05/18/the-hard-on-on-trial/)\n\nBeing incapable of performing sex for your wife could merit corporal punishment. One medieval husband wrote about his unhappy marriage and his impotence in a book called The Lamentations of Little Matheus.\n\n\"My wife wants it, but I can’t. She petitions for her right. I say no. I just can’t pay.\"\n\n\"Even given his sexual incapacity, Matheolus was subject to corporal punishment:\n\n\"Acting as her own advocate, Petra {Matheolus’s wife} puts forward the law that if a shriveled purse {scrotum} can’t pay because it’s empty, under statute recompense for that injury is corporal punishment.\"\n\n[https://www.purplemotes.net/2015/05/03/matheolus-church-wife/](https://www.purplemotes.net/2015/05/03/matheolus-church-wife/)\n\nSo what does this show? It shows that both parties had an obligation to provide the other partner with sex during the marriage, and could not deprive their spouse of it. If it was an issue, it was not an issue that solely affected women.\n\n*Myth #5: \"Men had the vote and women did not. Women's suffrage was a matter of women as a united group fighting for their rights against the evil men that kept it from them. Suffragettes were champions of equality who got women the vote. Etc, etc.\"*\n\nReally, I'm very tired of hearing this one.\n\nIn Britain, the right to vote was not only restricted by gender, but also by class. Property owners had the vote, the vast majority of men did not. In 1830, just 3% of the population had the right to vote.\n\nDuring this time, there were a few groups who were fighting for the vote to be extended to them, and one of these groups were the Chartists, who were active from 1830 to 1868. They were fighting for broad electoral reforms including:\n\n* a vote for all men (over 21)\n* the secret ballot\n* no property qualification to become an MP\n* payment for MPs\n* electoral districts of equal size\n* annual elections for Parliament.\n\nThey presented three huge demonstrations to Parliament, and their requests were denied every time. The restrictions were relaxed but not abolished. Benjamin Disraeli said when introducing the Second Reform Act of 1867: \"We do not live – and I trust it will never be the fate of this country to live – under a democracy. The propositions which I am going to make tonight certainly have no tendency in that direction.\"\n\nThere were also the suffragists and the suffragettes, who were fighting for the vote to be extended to women. Suffragists emerged in the mid-19th century and believed in peaceful, constitutional campaign methods. In the early 20th century, after the suffragists failed to make significant progress, a new generation of activists emerged. These women became known as the suffragettes, and they were willing to take direct, militant action for the cause.\n\nHowever, a huge amount of women disagreed with women's suffrage. So many women objected to the franchise being imposed on them that in the mere 18 months leading up to a 1910 parliamentary debate on women's suffrage, anti-suffragettes had managed to collect 300,000 signatures from women who objected to the franchise being imposed on them. Meanwhile, in the 16 years leading up to that debate, suffragettes only managed to collect 193,000 signatures of women who wanted the vote.\n\nA segment from the transcript of the debate:\n\n\"Still, for what it is worth, one finds that from 1890–1906 only 193,000 women signed Petitions to this House in favour of female suffrage, and that during the last eighteen months, a period in which a strong anti-suffrage association has been in existence, 300,000 women, some of them eminent women, have signed petitions against it, and to the effect that these proposals shall not be forced upon them.\"\n\nAnd...\n\n\"A rather interesting illustration was furnished by an inquiry which was instituted by \"The Sheffield Independent,\" a newspaper which I think itself is sympathetic with these proposals. This inquiry was addressed to the women householders of Sheffield. Twenty-three thousand papers were sent out, and of the replies 9,000 were in favour of woman suffrage and 14,000 were against it. The representatives of this paper reported that in many cases their emissaries were chased with violence from the houses by the female inhabitants under the impression that they were collecting statistical matter as the emissaries of the suffragist party.\"\n\nIt may be difficult to understand why so many women would reject the vote so vehemently, but this was an era where full citizenship rights like the right to vote were granted only to those with citizenship responsibilities like conscription (and sometimes not even then). In that historical context, the vote was actually viewed not just as a right, but also an obligation. So it was never really about men in power shutting women out of the franchise. It was about government having to decide whether to impose a responsibility on women that women as a whole *clearly did not want.*\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\nRegardless of the lack of support for women's suffrage among women, suffragettes became extremely militant in their activism. In 1903 Emmeline Pankhurst founded the Women's Social and Political Union (WSPU) with her daughters Christabel and Sylvia, and the WSPU carried out a nationwide bombing and arson campaign. Between 1912 and 1915, hundreds of bombs were left on trains, in theatres, post offices, churches, even outside the Bank of England; while arson attacks on timber yards, railway stations and private houses inflicted an untold amount of damage.\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nInstead of being beneficial in supporting the vote for women, it was disastrous. Lloyd George said: \"The action of the militants is ruinous. The feeling amongst the sympathisers of the cause in the House is one of panic. I am frankly not very hopeful of success if these tactics are persisted in.\"\n\nTerrorism aside, Emmeline Pankhurst was also resistant to acquiring the vote for working class men, realising that this would be much tougher than winning the vote for \"respectable\" AKA upper-class women, and underlying the resistance appears to have been her contempt for working-class men. According to Sean Lang in his book on Parliamentary reform: \"The Pankhursts became stridently anti-male, ruthlessly dropping even the most loyal of their male supporters from the WSPU, and claiming, as Christabel did in her 1913 book *The Great Scourge*, that men were “little more than carriers of venereal disease”.\"\n\n[https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/](https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/)\n\nWhen WW1 came around in 1914, suffragettes also threw their support behind the White Feather campaign with the aim of shaming men into enlisting. Those young women went in for the kill, striking men at the very heart of their masculine identities, the bestowing of a feather telling them, \"If you don't go off to be maimed or die, you are no longer a man in the eyes of some brassy chit you've never even met before and will probably never see again.\" And many men went, because a woman's censure - ANY woman's censure - had the power to drive them straight into the teeth of death.\n\nBy mid 1915, it was clear that not enough men were signing up to replace the fatalities on the front line, and the Military Service Act was introduced in January 1916. By March 1916 compulsory conscription for all single men aged 18-41 was in place. In May 1916, the Act was extended to include conscription for married men.\n\n[http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html](http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html)\n\nIt was only at that point that the British government considered extending the vote to all men, as most of the propertyless, working class men that were conscripted into war during WW1 did not have the right to vote, and this was finally starting to be seen as the injustice that it was. In the trenches class divisions were eroded to the extent that class no longer had any real meaning and every man was the equal of each other in terms of sacrifice and service to one's country.\n\nMen got universal suffrage in 1918 with the Representation of the People Act, which enfranchised more than five million men over the age of 21 without regard to property or class. Women of all classes were piggybacked onto the Act, with an age restriction temporarily in place to prevent women from becoming a supermajority voting bloc, given that about 1 million British men had died in the war. Regardless, this brought more than eight million women over 30 into the electorate. And just ten years later, the 1928 Act (the act which gave women electoral equality) gave the vote to women at age 21, which added another five million women to the electorate.\n\n[https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/](https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/)\n\nIntroducing the 1918 Bill, the Home Secretary George Cave said: \"War by all classes of our countrymen has brought us nearer together, has opened men's eyes, and removed misunderstandings on all sides. It has made it, I think, impossible that ever again, at all events in the lifetime of the present generation, there should be a revival of the old class feeling which was responsible for so much, and, among other things, for the exclusion for a period, of so many of our population from the class of electors. I think I need say no more to justify this extension of the franchise.\"\n\nThe Act was achieved not by the suffragettes’ terrorist tactics, but by fighting of men in WW1, when thousands of men from their many different backgrounds came together to fight the common enemy. This finally achieved what the Chartists, the Levellers and the peasants before them had struggled for in terms of eroding barriers of class. Without the sacrifice of men who endured the horror of trench warfare in WW1, class barriers would have persisted and at most the vote would have been extended only to elite, wealthy, propertied women.\n\nIn a later study of attitudes to conscription in 1939, one woman responded: \"In the last war \\[(WW1)\\] I never told one man that he ought to go. I tried to put myself in their place. If I’d been them I wouldn’t have gone. When I saw them going through the streets – all the young men – I used to think that they were being driven like cattle to the slaughter house. And they were, weren’t they? Fodder for the guns.\"\n\nThe common idea that all men had the vote, and that women did not, and that women's suffrage was a fight of women who were united against men working as an oppressive force to keep them down is an affront to these men who died in a literal war that secured universal suffrage for everyone (many of which, in fact, did not have the vote). It also ignores and erases the will and sentiment of many, many, *many* anti-suffragette women who actively rejected the vote and protested vehemently against it being imposed on them.\n\nFurthermore, the view that suffragettes were a valiant, fair-minded, equality-oriented group who got women the vote and whose activism merely amounted to firecrackers in barrels is an affront to any right-thinking person. The real violence and extremism of the suffragettes is barely, if at all, recognised by the general public, and this is partly due to attempts by suffragettes to sanitise their history.\n\n\"Laura E. Nym Mayhall, in her work on the militant suffrage movement, identified the importance of \"a small group of former suffragettes\" in the 1920s and 1930s, who created a highly stylised story of the WSPU and the history of suffrage in England, which emphasised \"women’s martyrdom and passivity\". The group set about compiling the documents, memoirs and memorabilia that now form the basis of the Suffragette Fellowship Collection held by the Museum of London.\"\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nAnd here we are now, in crazy world. According to the dominant narrative, all men always had the vote since the dawn of recorded human history, and they refused to give it to women because penis. The demonstrations of the Chartists, and the dead bodies of these men that were sacrificed to the unpopular idea of male suffrage (and who got votes for women in the process), have gone down the memory hole. The terroristic actions of the suffragettes, engaged in for the benefit of wealthy and privileged women only and for which they were barely punished, are the noblest of acts for the noblest of causes. And of course, the only reason anyone could EVER have opposed them was because of misogyny.\n\nedit: wording\n\nedit 2: Added some extracts from [w1g2's comment](https://www.reddit.com/r/MensRights/comments/edyrf5/a_compilation_of_evidence_debunking_feminist/fbtays6?utm_source=share&utm_medium=web2x).",
    "title": "A compilation of evidence debunking feminist historical revisionism.",
    "subreddit": "MensRights",
    "timestamp": 1576979536,
    "score": 341,
    "keyword": "black manager"
  },
  {
    "text": "Looking for work as a middle aged, straight, white male... It sucks. I have a professional career, make good money, and for the most part enjoy what I do. However, I haven't enjoyed doing it for the organization I am currently employed with. I've turned in just over 50 applications and resumes, only to be denied each and every time. What makes this harder for me to believe, is I am considered a preferential hire as a disabled veteran. \n\nI did an interview about 3 weeks ago at a place for the same position I currently am in. I was well qualified for the position, and did the best interview of my life. The manager of the department I was applying in even said I gave, word for word, the exact same answers as her on several of the interview questions only to be denied the job with a boiler plate email.\n\nAnyways, I go look at their website because the staff is listed. Sure enough, they hired a black female who had zero experience. I know, because the blurb under her picture says it is a new position for her and she is looking forward to learning about the job because she is coming out of Walmart. Wtf?\n\nNot only that, but the manager I hired with kept making remarks like, I see you parked in the employee spots and not guest parking, just getting your new spot warmed up? Even showed me my desk. \n\nThis individual, with zero college, military, no experience in the position, got the job over me, with college, military, and a lot of experience, got the job over me.\n\nJust wanted to vent. I live in probably the most progressive state in the US. Everyone is incredibly concerned with the appearance of being a diverse business here. As a white guy I am really feeling the sting of not being able to find a new job in the same field even after turning in over 50 applications. The diversity hiring and affirmative action here is being pushed so hard, that someone with no experience, in a professional career field, is being hired simply because of the color of their skin, and what is between their legs. The fucked up thing is, this is a very hard job with a lot of turnover. I guarantee that within 3 months that position comes back open because they won't last. Which, isn't going to help that individual who got the job either because their work history will be fucked up, making it harder to get the next one. I'm at the point of giving up. It feels hopeless. That was the absolute best interview I have ever had, only to get brushed off for a person out of fucking Walmart. About to just start lying and say I'm native American or Mexican because my skin is a bit darker. Bet I get any job I want then!",
    "title": "Looking for work as a middle aged, straight, white male... It sucks.",
    "subreddit": "MensRights",
    "timestamp": 1566408350,
    "score": 184,
    "keyword": "black manager"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 125,
    "keyword": "black manager"
  },
  {
    "text": "I was sexually harassed and then laughed at by coworkers. So a few notes for context. I'm white,  gay and overweight.\n\nI just started working for a gas station overnight. Last night I was working the cash register when this heavy black lady came up (race plays a small role so that's for description) and I rang her up. Supposedly before I started another guy used to work and she used to flirt with him. My manager was there and explained he got fired for something. The customer then said, \"oh that's too bad. Well at least I have a new fat white boy to mess with\". \n\nMore context, I'm not very comfortable with being called fat. And it's not for the obvious reason. It's because the last time someone called me fat he pulled a gun on me in a robbery attempt.  \n\nSo my face was supposedly frozen. My manager laughed to try to defuse the situation but the customer then said, \"oh, I mean nice plump boy\" then fucking reached over the register and grabbed my chest (I'm big mind you so I do have man boobs) and started squeezing them. \n\nI was very uncomfortable and upset. My manager just laughed at the whole situation as did some of the other customers.  I can't lose this job but I do feel kinda upset to be honest. And there's nothing I can do because I'm a guy. \n\nI hope this fits here. I don't really know where else to talk about it and I feel like it's pretty relevant because if I was a woman then the customer would of most likely gotten into deep shit.",
    "title": "I was sexually harassed and then laughed at by coworkers.",
    "subreddit": "MensRights",
    "timestamp": 1570317108,
    "score": 79,
    "keyword": "black manager"
  },
  {
    "text": "Feminists and Privilege of Exceptions  \n\nJuly 13 2019 (first posted on Wordpress in 2018, and on Tumblr this past June, flagged)\n\nI   came to the conclusion that women are currently negotiating   privileges  against fundamental rights (to the advantage of a minority  of   people)…and this is a disaster for anyone not falling in the  categories   of “Historically victimized people” as described by  ex-attorney general   Eric Holder. It concerns the modern feminist  culture of Empathy,   Emotionalism, Intelligence, Rights, Delusion…\n\n(Note:   I Originally wrote this article in late November 2017…I tried  to   publish it many times on my Wordpress account, it would not work. This   was on my original  blog dethinkxify.wordpress.com. I was finally able   to publish in March of 2018. But rapidly, hackers erased all the   Bibliography, which I had  to recreate. I hope this time around activist   hackers leave it alone.)\n\nThis is a comment I formulated after reading an article in  The Hill: “**Trump risks hypocrisy charges with Franken attack**” by  Jonathan Easley (November 18 2017):\n\nI   reprint here since my Wordpress accounts have never been indexed for   purely political reasons and my Tumblr it account is being continuously   flagged by feminists and is now restricted, which means blocked except   for being harrased by Tumblr feminist employees… [https://dethinkxify2.wordpress.com/2018/06/13/feminists-and-privilege-of-exceptions/ and ](https://t.umblr.com/redirect?z=https%3A%2F%2Fdethinkxify2.wordpress.com%2F2018%2F06%2F13%2Ffeminists-and-privilege-of-exceptions%2F&t=NjMyMmNhNjRiNDBmYzZkOTU4MzdjNzFmYzFkMDEzODRjZDA4YWNlZCxNNGh2MEFjeg%3D%3D&b=t%3A5u3nC0drLYPcMrUcuYL-eg&p=https%3A%2F%2Fdenyspicard.tumblr.com%2Fpost%2F185661395113%2Ffeminists-and-privilege-of-exceptions&m=0)[https://dethinkxify.wordpress.com/about/](https://t.umblr.com/redirect?z=https%3A%2F%2Fdethinkxify.wordpress.com%2Fabout%2F&t=OWIxZTk1ZWJjM2ZhODAxNDZmMzM0OTllYWY2ODhhYjcyYzQ4MjU3NyxNNGh2MEFjeg%3D%3D&b=t%3A5u3nC0drLYPcMrUcuYL-eg&p=https%3A%2F%2Fdenyspicard.tumblr.com%2Fpost%2F185661395113%2Ffeminists-and-privilege-of-exceptions&m=0)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**“…Trump…Called a Hypocrite…**”. **Who cares by now?**\n\nOur   whole leadership,  including the press, are a bunch of hypocrites by   refusing to include  regular folks in the reality of power discussions.   Power discussions  which concern future fundamental rights of men. But   around the table  sits Feminists, DC politicians, Main Stream Media,   some Power Elites…and  they prepare, again, to decide our diminishing   fates with one-sided  bias unconstitutional legislation. We are   witnessing a battle for fake  righteousness, with your regular insincere   feminists at the front line of this “mobbish” crowd. The first debate   we need to have is: When will  women and feminists stop using sexual   misconduct allegations as an  extortion/coercion tool? When?\n\nNot   yet, obviously…because the inherent conflict of interest here in    seeking the truth lies with an establishment of males (alpha males, bad    expression, but I will clarify) being rewarded for continuously ceding    status, rights, freedoms, liberties of regular males (beta males,  idem   as previously) of the middle and lower class…in exchange for  getting   bigger pay checks.\n\nIt is by  no chance  that for the past 30 years, the Establishment, and  women of  all income  groups, have seen persistent gains in their  incomes, while  middle class  and lower class men have seen an imploding  of their  purchasing power.\n\nThe  Main Stream  Media is so toxic…so hypocrite and so uneducated.  Their  only tool for  convincing the audience of their project for which  women  are already  sold, is the same old Emotional and Affective Empathy   Propaganda where  if you have “any sense of decency, you should be crying   and repenting  for all the horrible crimes men have committed against   women for  centuries..”. Yes, make me  laugh…\n\nThe   scientific truth is very different according to social science.  Women   are bullies too, they abuse their power, they are violent  being…and   when the task is too big, they delegate the dirty physical job  to their   close allied thugs.\n\nOffice work place   is a competitive landscape. Yet women want to  impose rules which will   have the effect of constraining men in not being  able to use   competitive tools and skill in which they outperform.\n\nPauhlus   and Williamson (2002) cornered a theory of  personalities  which   compose people of leadership, men and women alike. This theory is    called the Dark Triad of Personality Traits. These specific traits are    sub-clinical Narcissism, Psychopathy and Machiavelism. These were, and    still are, somewhat taboo traits, so much so that even the scientific    literature fails to often understand the basic premise of the theory.    The theory stands because of the interdependent nature of these 3    traits, while much of the literature feeding on this theory still    analyses circumstances using these traits independently.\n\nAs   independent traits, nothing  is novel in understanding that  someone   showing a high score in one of these trait may be disagreeable,  have   shortcomings, be manipulative, etc…The Novelity of Pauhlus and    Williamson was in describing these traits as interrelated.\n\nWith   this, the authors also demonstrated a surprising observation,  that   people with leadership features scored higher, on average, in all 3    traits simultaneously. Which means that on average each of these traits    where higher than the average observed in a control sample. This was    puzzling indeed, because these traits had mostly been put on the margin    by institutions of morality, such as monotheism; and  could hardly be    accepted as being the corner-stone of leadership. Yet, 15 years  later,   it appears that the theory stands solid, and dominant  characters (which   the alpha epithet only briefly captures) score  higher, on average, than   controls on the Traits of Narcissism,  Psychopathy and Machiavelism   simultaneouly.\n\nOrganizational   hierarchies have been analyzed, been tested, with this  filter, and it   was observed that, effectively, the further you climb up  the latter  of  authority, the higher you score on The Dark Triad Traits  on  average.\n\nSince  these trait are  associated with many negative behaviors, such  as  vanity,  self-promotion, callousness, cruelty, dishonesty,  manipulation,  etc…it  came as quite a shock.\n\nBut even  more  interesting, is the fact that people high on Dark Triad  traits  score  low on Emotional Empathy (Emotional or Affective Empathy  are the  same  thing). And further, Dark Triad Traits have no correlation  with   Intelligence as captured by Intellectual Quotient (IQ).\n\n**Which implies that dominant people need not have great IQs; and high IQs are not synonym of dominant personalities…**\n\nSurprisingly,   leadership requires credibility, since it is expressed  in a social   context; therefore, social performance is of importance.   Social   Performance may be measured by a combination of Cognitive  intellectual   skills, and Personality Traits. Personality traits are  observed  through  performance of Emotional and Social skills.\n\n(I   am abstaining, here, of using the expression Emotional  Intelligence,   because it is an inappropriate terminology. Emotional  performance is   part of the personality trait domain. The difficulty of,  and inadequate   terminology,  in cornering a theory of Emotional  Intelligence has had   for result of creating an overly diversified  incomplete curriculum on   the subject with excessive feminist traps  (matriarchal and   communautarist propositions) and shortcomings. One of  the principal   trap is that of putting Agreeableness as a corner-stone of  the theory.)\n\nNow,   for great leaders to persist and be appreciated, or feared, the  Dark   Triad must be tempered and modulated by other factors. True, yet    definitive consensus has not been reached in this dimension.\n\nNow,   within the inventory of survival tools of evolved mammals, there  is   such a thing as Empathy. Its been the subject of much scientific    research in the past 25 years, has been vulgarized, promoted but    nevertheless still largely badly understood.\n\n**Empathy must be understood as a genetically rooted endocrine reflex**. It has evolved over millions of years and is a very sophisticated mechanism.\n\nBut   first, lets distinguish between two distinct forms of Empathy:    Cognitive and Emotional (Affective) Empathy. While Emotional empathy has    been largely described scientifically, cognitive empathy appears to    suffer from a misunderstanding, and this may be due to the “empathy”    epithet attached to it. Let the scientist describe both phenomenon: ” **Purely cognitive empathy**,    also referred to as perspective taking, mentalizing, or Theory of   Mind,  concerns the capacity to comprehend the viewpoint and/or state of    knowledge of another individual, even if this differs from one’s own.  **Emotional empathy**    concerns the emotional reactions of one individual to the observed    experiences of another. Emotional empathy is a multifaceted and    multilayered phenomenon which ranges from relatively simple processes    such as emotional matching behaviour to more complex events which    involve interaction between emotional and cognitive perspective taking    systems.” (JL Edgar et al., 2012)\n\n“Over   millions of years of evolution, efficient and manifold   neurobiological  mechanisms have evolved for differentiating hostile  from  hospitable  stimuli and for organizing adaptive responses to these   stimuli (Decety,  2010). This integrated set of neural systems is   genetically hardwired  to enable animals to evaluate and readily respond   to threatening or  nurturing, unpleasant or pleasant, appetitive or   aversive stimuli using  specific response patterns that are most  adaptive  to the particular  species and environmental condition.”  Decety and Svetlova (2012):\n\nBoth   systems are believed to be widely presents in mammals and are  related   to the complexity of organization which a family structure  creates   within life organism. In this context, males usually outperform  females   in cognitive empathy and females outperform males in emotional    empathy. A parenthesis: – language is believed to be intimately tied to    emotional empathy. And “baby-talk” (motherese, scientific term) is a    universal language, it is present everywhere in the “human” kingdom. **Motherese    communicates in a manner where emotions are tuned with pitch, rhythm   and  tone instead of there usual evolved accent structure**. In    motherese, what is communicated is not the significance of the word    directly, but the effort to create a future association in the child’s    brain, and this using one of the best learning tools possible,    repetition. Children respond innately to pitch and tone. In the    primitive man, language was mostly thought by the female…this is one    skill where emotional performance was a competitive advantage. Further,    this “Motherese” interaction is also responsible for developing the    spectrum of emotion in the infant. **Emotions need learning and training**,    and biologically, the differentiation or specialization of sex    re-leagued this role to females. This is why the female brain is    preferentially wired, the connectome structure, for emotional empathy    (Ingalhalikar et al., 2014).\n\n**But   recent changes in family organization tends to delegate  emotional   training in children to the pharmaceutical industry, school  “law   enforcement” and the internet, including video games…**\n\nLiving creatures whom can express the hormones linked to the reflex of emotional empathy have higher tone.\n\n“Oscillations   of delta, theta, and alpha ranges could be found in  all vertebrates   but there is an important distinction between reptiles,  lower mammals   and humans in what frequency dominates in the scalp EEG. **Alpha is the dominant frequency in adult humans**,    while theta dominates in the EEG of lower mammals (Sainsbury, 1998)   and  delta in the reptilian EEG (Gaztelu et al., 1991; Gonzalez et al.,    1999).”\n\nAs  brain wave oscillations  of the Beta frequency are highly active in   mammals, they are very low  in reptilian. Langard et al. (2006)   explains, concerning an empathic  test on mice: ‘”our findings are   consistent with the perception-action  model of empathy proposed by   Preston and de Waal (1), both in the  automatic priming of somatic   responses in a state similar to that of  the attended object and in the   modulating effects of familiarity and  similarity of experience between   subject and object.” as observed  under the following conditions: “…Mice   tested in dyads and given an  identical noxious stimulus displayed   increased pain behaviors with  statistically greater co-occurrence,   effects dependent on visual  observation. When familiar mice were given   noxious stimuli of  different intensities, their pain behavior  was  influenced by their  neighbor’s status bidirectionally. Finally,   observation of a cage-mate  in pain altered pain sensitivity of an   entirely different modality,  suggesting that nociceptive mechanisms  in  general are sensitized.”\n\nThis  was a  step forward in debunking the pretentious belief that only   humans,  being God’s masterpiece according to Christians, had Empathy.   And  contrary to popular belief, Empathy is not a moral construct, but a    biological survival reflex. In the fight or flight behavioral choice,    cognitive empathy is the first mechanism to be neuro-alerted. It  quickly   determines if a new set of information possess a **threat or opportunity** (e.g. for food) or necessitates an action of **protection or collaboration**. It then either, respectively switches to either the cruel, sadistic, aggressive spectrum, or to the Emotional Empathy reflex.\n\n**A problem with the recent societal culture of feminism**,    the current “cultural revolution”, is the risky proposition of   offering  overly redundant experiences of Emotional Empathy to the   general  population through tools such as News Television media, where   the  audience is being continuously taxed along Emotional Reflexes, so   as to  effect Mass Emotional Empathy Training…it is destructive to the   balance  of the brain, it creates a state, which psychologists refer to   as “**heightened emotional instability**”.\n\nWe are switching from a Cognitive IQ based civilization to an Emotional driven civilization.\n\nYet,   abuse of the affective spectrum is very useful as a strategy of  mind   control. It is a preferred tool of female leadership, females whom    outperforms males in the Emotional and Narcissistic spectrum. In a    context of competition between women, a status challenge, women will    rarely confront. Competition potential outcomes are usually quickly    determined on site, and interaction avoided with females most often    surrendering to the dominant female. Then, consensus is created by a    repertoire of mimicry, which is related to emotionalism, mimicry,    emotional empathy.\n\nWomen’s “status seeking competitive strategies” are mainly, according to *Joyce F Benenson (2013)* : “*From    early childhood onward, girls compete using strategies that minimize    the risk of retaliation and reduce the strength of other girls. Girls’    competitive strategies include avoiding direct interference with  another   girl’s goals, disguising competition, competing overtly only  from a   position of high status in the community, enforcing equality  within the   female community and socially excluding other girls*.”\n\nFurther, *Tracy Vaillancourt (2013)*: “*Indirect   aggression includes  behaviours such as criticizing a competitor’s   appearance, spreading  rumours about a person’s sexual behaviour and   social exclusion. Human  females have a particular proclivity for using   indirect aggression,  which is typically directed at other females,   especially attractive and  sexually available females, in the context of   intrasexual competition  for mates. Indirect aggression is an  effective  intrasexual competition  strategy. It is associated with a  diminished  willingness to compete on  the part of victims and with  greater dating  and sexual behaviour among  those who perpetrate the  aggression*.”\n\nAs for the kind of aggression women of higher sub-clinical  psychopathic intensity such as females in positions of authority, *Ana  Seara-Cardoso, Helene Dolberg, Craig Neumann, Jonathan P. Roiser, Essi  Viding (2013)* propose: \"*Research   so far indicates that emotional and  personality correlates of   psychopathy such as glibness, grandiosity,  lack of empathic concern are   akin across genders, but similarities in  behavioral correlates, such   as criminal behavior and type of aggression,  seem to be less  consistent  (see Verona & Vitale, 2006, for a  review). It has been  suggested  that differences found across genders are  mainly  differential  expressions of the same underlying construct  (Nicholls  & Petrila,  2005), and that the same personality traits may  confer  risk for  different forms of behavior for women versus men  (Verona,  Sprague,  & Javdani, 2012)\"*.\n\nPsychology   has created two  main sub-groups of psychopaths, those which are   characterized as  operating Instrumental Violence (Group 1) and those   whom uses Reactive  Violence (Group 2). Instrumental violence is   manipulative and indirect,  while reactive violence is obviously direct   and confrontational.\n\n**Women score higher at instrumental violence than men.**\n\nAnd, need I remind, **people in positions of authority**, dominant characters, both females and males, **score higher than average on The Dark Triad traits of personality.**\n\nNeed   I recall the reader of the Center for Disease Control (CDC)  analysis,   whose own data, determined, against popular beliefs, that  women are   violent in partner relationships, and that they are more  often, than   men, the first instigators of physical aggravated assault  against their   partner. That female bisexual persons are more violent in  partner   relationships than either heterosexual, or exclusively  homosexual, men.\n\n**Against   the backdrop of the Main Stream Media and Washington DC  attempting to   portray females as inoffensive, peaceful, loving caring  beings   incapable of violence and never competitive but only  cooperative…It   should be difficult to ignore that the last few  paragraphs, based on   scientific literature, may bring down the  Leadership proposed   Em-pathetically forcefully induced naive conception  of women as   innocent beings in need of persistent protection…**\n\nfor   Feminists who pretend they want to destroy the condescending  values  of  Patriarchy, it appears a Paradox to call for laws of exception  for   their sex all the time.\n\nLastly, one   must make himself familiar, if at least it has not  already intuitively   been understood, that all status dominance challenge  carry sexual   connotations, or undertones, as indirect as they may be.  Dominance in   human relationships always has a sexual  dominance/submission   dimension…if this point is neglected in  decision-making and analysis of   the workplace environment, it is a great  mistake.\n\nAre   all women leaders monsters? No, of course not. But nor are all  men   leaders. But Feminist (as a socio-political proposition) leadership  is   Toxic. And what about regular male employees who score average on    psychological traits of the Dark Triad, males who don’t carry above    normal dominant features but can be very competent in their field, are    they also ALL monsters? So why address the problem of harassment,    aggression in the office/work place as a prevalent and “male only”    initiated model.\n\n**Surprisingly,   in reality, meaning out of the scope of the  fictional construct of   women on TV and other media, women are attracted  preferably to men who   are both more narcissistic and more dishonest than  average…this is  true  when they either seek a mate, or someone to  associate for other   endeavors, such as business associations. Narcissism  and dishonesty are   characteristics where leaders, men and women,  outperform the general   population.**\n\n**This   should assist in anticipating that the office will  continue to have   male leaders, or women leaders, who score high on the  Dark Triad   Traits. What are women teaching these latest generation of  men   leaders…how to better camouflage their personality traits. In the    highly competitive field of finance, both women and men with strong    dominant personality profiles excelled in deception during the 2000    decade of real estate and financial debacle.**\n\n**Therefore,   in the Emotional Empathy Training movements they  are two distinct yet   complementary routes: one has as its principal goal  to modify not the   essence of male competitiveness, with its core in  psychopathy, in  terms  of callousness, or glibness, etc…but to modify the  appearance of  this  trait by expressing it in a more feminine way,  meaning  indirectly. This  is easy, since people with higher  Emotional/social  skills are better  actors…that is they can more easily  fake emotions.  So, in fact, these  are just acting classes, which the new  generation  of male leaders are  happy to participate in. Secondly, for  non-leader  males, the somewhat  “beta” non-dominant profile males,  Emotional  Empathy Training is simply  classes in total submissiveness,  where  anything which could be  disagreeably perceived by any women, in or  out  of context, must be  censured so “beta” females can increase their   level of abusive  narcissistic delusional elation and over-confidence in   the work place.**\n\nBecause   feminists are not revolutionaries, as they often promote  themselves,   but encrusted in the leadership, and submit to authority  more easily   then men,…they are the best tool for the upper class,  establishment and   leadership to maintain and consolidate their position  of hegemony.\n\nBecause   I, for one, know very well that the current spectacle is of  the same   infected breed as that of “Hate laws”…where, in this case, the  target   of constraining behavioral laws that will be abusive will not  really  be  aimed at the high hierarchical individuals who could abuse  their   power, but the regular male employee who has never bothered  anyone, but   will now be obligated to demonstrate absolute submissiveness  to the   Office PC Police…that is the reality, this is what awaits us,  yet   again.\n\nParadoxically, women in the   hierarchy will often tolerate sexual  misconduct in the office from   dominant males in the organization as long  as it benefits them and the   organization…even if there is an innocent  victim (male or female),  call  it collateral damage, once in a while…that  is the “pragmatism” of   female leadership…as is Feminist Mob Justice.\n\nAnd, incredibly, in this whole discourse, not one bit of attention was given to **women aggressors**,    whether their victims were males or females…yes, incredible. But it’s    not the first time that the Main Stream Media and Washington DC  betrays   us males.\n\nAll of you should  read the  Canadian Judge’s ruling in a recent  Canadian case, COURT FILE  No.:  Toronto 4817 998 15-75006437 : Her  Majesty The Queen Vs Jian  Ghomeshi.  In front of the worst of  accusations, Ghomeshi was hanged in  public,  with women newscasters  vomiting righteousness over Canadian  Television  programming for hours on  end. Yet, the conclusion of the  Trial judge  was that, in the end, the  witnesses had no credibility.  Yet, feminists  went on saying it was again  an injustice and they stood  by for all the  “women victims of male  sexual violence…”. In the  debate of sexual  misconduct, feminists have  lost all credibility, and  no one in our  leadership is making any  intelligent contribution in  this exchange  either. Women have to start  understanding who they  really are, and how  they evolve in social  contexts; **male   leadership has to stop trying to please feminists  by surrendering   fundamental rights of men and spoiling women with  unjust legislation,   and financial bubbles, bias against men**.\n\nIn   Canada, the justice system was demonstrated, by a scientific   research,  to show a 98% positive bias towards women (a sample of   research had a  window of 65 to 98% bias towards women), yet, to   feminists, this is not  enough, they want more for women…What does this   tell you in terms of  genetically rooted delusional intensity, of   psychological balance, in  terms of judgement and fairness of women…\n\nIn   the current political “debate” over the allegations of sexual    “misconduct” of a Federal Senate seat, the most zealous critics have    expressed that “…the allegations alone are serious enough that the    Candidate should never be allowed to be a servant of the “People”…”…This    is the new Feminist Mob Justice at its best…is this where  President   Trump wants to lead us?…satisfy feminists so he can get all  the  goodies  he wants, like his irresponsible tax bill, passed?\n\nLaws   meant to castrate men who have done nothing wrong, and won’t, by    incompetent, unconstitutional laws that will regulate work place    dynamics with a 100% positive bias towards women, because, in some    cases, some men have acted irresponsibly, or sometimes  illegally,   abused their power. What about women? They never commit  aggression,   they never abuse their power, they never bully in a work  environment…? I   am sure of that, as they are no female pedophiles, I  guess, and no   maternal infanticides, and no Female pimps, rapists,  criminal   offenders…no women involved in child pornography rings…No, not  in our   world…Not in America, Not in the great insightful eyes of the  Main   Stream Media…women are all “Good, naive and innocent…and need Super    Males, Super Cops, to protect them…”.\n\n>*Once   in a while, one comes across a  small jewel in Academia, and if  Paulhus  and Williams work is Monumental,  Isabelle Engeler and Priya  Raghubir  piece in the Journal of Personality  and Social Psychology: Do  men  Overestimate or Women under-report Their  Sexual Intentions?  (2017) is a  must, and unavoidable if one has the  ambition to reform  the workplace.  It will help understand  miscommunications,  mis-signalling, miscues and  mis-interpretation  between the sexes in  the context of workplace  sexual misconduct and  sexual interpersonal  interactions. This text  unveils some core  mechanisms and informs  anyone with the goal to modify  the work  environment in a manner fair  to all.The text comes to the  conclusion,  amongst other observations,  that under their testing  conditions, that  both men and women  underreport their own sexual  intentions, that men  overestimate women’s  sexual intentions and women  underestimate men’s  sexual  intentions…this alone is enough to warrant  work place “reformers”   attention. Is this due to delusional mechanisms,  social desirability   bias, or brain structures misaligned communication  features…the door is   open. But, in this context, an intelligent  behaviour is not blaming  the  other party for misgivings and  shortcomings, finger pointing and  all;  but rather trying to understand  more deeply what could be at the  source  of frequent “misfiring” social  performance, since in ideal  world,  communication should have no  frictional bias.Let’s make a short  example, without  blaming one party  over the other, without pushing  responsibility on one  side more than on  the other.Two co-workers, one  man and one  woman, are sent on a project  abroad. They only know each  other  superficially, have not had the  opportunity to really work  together  except for short group meetings,  etc…they know each other  from a  distance, but have had an effect on  each other. He has found he   appealing, intelligent , witty, etc…she has  found he presents himself   well, looks serious, responsible, dedicated,  maybe ambitious, but in a   good way.Now, during their travel, one night   after work, to  celebrate their on-going business success, which got  them  to develop  quickly a good complicity, trusty relationship, they  are  efficient and  complementary. They decide to go to a nice restaurant  with  a very  relaxed atmosphere, a beautiful terrace with a beautiful  view,  they  drink a little bit, and she starts to confide on her  personal life.   She is more telling than inquisitive, already knows he  is single, while   she is married. She believe this guy is a great  candidate for a   business friendship. She starts to elaborate about her  own marriage   difficulties, though she doesn’t have children yet, the  discussion   starts with humour and slips in more confident terms…and  then “woops”,  out  of nowhere, in a moment of laughter, she confides she  has not had  sex  with her husband for two months… That something is not  going right  with  her husband. Her only intention is to have a good  hearing ear,  to relax  and this guy looks trustworthy, etc…But he may  well interpret  this  intimate comment as something else, especially  since he did find  her  attractive.And now, let’s imagine, that when   they leave the  restaurant, she helps him put his coat on, and as he   slips his arms  into the sleeves, she gives him a warm and affectionate   tap on the  arms while she is behind him. Nothing more…just a sign she   feels good,  relax…Yet, they have drank a bit , he feels good also, and   has liked  his evening, is being increasingly seduced by this women, who   has done  nothing else but treat him as a friend…They go to the hotel,   and  doing so, they go on talking, confiding…and she increasingly looks   at  him in the eyes, as to get affirmation of their new found complicity,    their new friendship, she feels she has established trust. Then, at  the   door of her room, they go on talking a bit…and as they get ready to   go  there on way, to say goodnight, he just gets closer and kiss her on   the  mouth. Then the nightmare begins, she freezes, is shocked,   surprised,  says nothing…gets into her room, closes the door and   suddenly feels  betrayed…READ THE ARTICLE.*\n\nThe   work place backlash, which also affects negatively a majority of  men,   and creates negative spillover’s over all of society is principally   due  to “Emotional Intelligence”, an inadequate scientific theory with    misleading terminology, has been increasingly and dominantly used as  the   main hiring candidate criteria for employment. While this may  create a   more “Agreeable” work environment for women, it is at the  source of   increasing fraudulent and toxic activity and behavior in the  workplace.\n\nHere, take the time to read : “**Will get fooled again: Emotionally intelligent people are easily duped by high-stakes deceivers**”; by Alysha Baker, Leanne ten Brinke and Stephen Porter (2012);Legal and Criminological Psychology.\n\nThe   most intriguing conclusion of this work, is that people with  Higher   Emotional/social skills as captured by an Social Ability  psychological   test have demonstrated a very poor capacity to detect  deceit, yet have  a  greater ability to deceive…Most feminists would  either refute this   scientific affirmation, and others may call it a  paradox; yet when one   knows women, this makes perfect sense, it is  self-evident. May I  remind  you, if you suffer from some kind of  personality trait naiveté,  that  women, on average, score higher than men  in Emotional  skill/ability.\n\nYou  want to really talk  about these matters, I am up to the  challenge. You  want to get  ready…go to social science class, but avoid  anything which  is written  by either a female or male feminist, because  it is not  science, nor is  the theory of Emotional intelligence. **Read    about status seeking, psychological personality traits (especially  the   work of L. Paulhus: The Dark Triad Traits, The Dark Tetrad Traits)**.    Debunk the Emotional Intelligence crap. Emotions are an endocrine    evolution system. They give tone to actions and metabolisms. They are    tied to personality traits. They do affect performance, and some people    do show greater skills at controlling, moderating, utilizing their own    emotions and those of others, but this is a skill, it is not    intelligence. Performance is the result of a set of Intellectual factors    captured by IQ and emotional and social skills captured by  personality   traits. Strong leaders are characterized by high  performance in taboo   personality traits such as sub-clinical  Narcissism, Psychopathy,   Machiavelism and even Sadism…leaders, male  and female alike, have a good   look at yourselves in the mirror before  climbing on the moral   bandwagon! Debunk this view that women are  always victims and men always   predators…it’s the biggest of lies…**stop being retarded**.\n\nAnd   don’t pass corrupted unjust new laws (to manage the work space) for a    subject your delusional reflexes prevents you from understanding at  all,  but  your political ambitions guides you to.\n\nBibliography :\n\n**The Dark Triad of personality: Narcissism, Machiavellianism, and  psychopathy**; Delroy L. Paulhus \\* and Kevin M. Williams – Journal of  Research in Personality (2002)\n\n**The Dark Triad of Personality: A 10  Year Review**;   Adrian Furnham1, Steven C. Richards, and Delroy L.  Paulhus; Social  and  Personality Psychology Compass 7/3 (2013): 199–216,   10.1111/spc3.12018\n\n**Hippocampal Theta: a Sensory-inhibition Theory  of Function**; Neuroscience & Biobehavioral Reviews, Vol: 22, Issue:  2, Page: 237-241; (1998) Robert S. Saisbury\n\n**Motivation, emotion,  and their inhibitory control mirrored in brain oscillations**; Gennady G.  Knyazev –  Neuroscience and Behavioral Reviews (2006)\n\n**EEG delta  oscillations as a correlate of basic homeostatic and motivational  processes**; Gennady G. Knyazev – Neuroscience and Behavioral Reviews,  (2011)\n\n**Social Desirability Bias: A Neglected Aspect of Validity  Testing**; Maryon F. King and Gordon C. Bruner; Psychology & Marketing  Vol. 17(2):79–103 (February 2000)\n\n**Staying alive: Evolution,  culture, and women’s intrasexual aggression**; Anne Campbell, BEHAVIORAL  AND BRAIN SCIENCES (1999) 22, 203–252\n\n**Status-Driven Risk Taking:  Another “Dark” Personality?**;   Beth A. Visser, Julie A. Pozzebon and  Andrea M. Reina-Tamayo;  Canadian  Journal of Behavioural Science / Revue  canadienne des  sciences du  comportement; (2014), Vol. 46, No. 4, 485–496\n\n**Minimization  of Male Suffering: Social Perception of Victims and Perpetrators of  Opposite-Sex Sexual Coercion**; Sexuality Research and Social Policy, Anna  Magda Studzinska1,2 & Denis Hilton (2016)\n\n**Emotional  intelligence, Machiavellianism and emotional manipulation: Does EI have a  dark side?**; Elizabeth J. Austin, Daniel Farrelly , Carolyn Black, Helen  Moore; Personal and Individual Differences (2007)\n\n**The Fight for  the Alpha Position: Channeling Status Competition in Organisation**s; by  C. H. LOCH, M. YAZIJI and C. LANGEN (2000), INSEAD R&D\n\n**The  affective and cognitive empathic nature of the dark triad of  personality**, Michael Wai & Niko Tiliopoulos; Personality and  Individual Differences (2012)\n\n**A meta-analytic review of the Dark  Triad–intelligence connection**; Ernest H. O’Boyle, Donelson Forsyth,  George C. Banks, Paul A. Story; Journal of Research in Personality  (2013)\n\n**The Dark Triad of personality and unethical behavior at  different times of day**;   Karolin Roeser, Victoria E. McGregor, Sophia  Stegmaier, Johanna   Mathew, Andrea Kübler & Adrian Meule; Personality  and Individual   Differences (2016)\n\n**Different routes to limited  empathy in the sexes: Examining the links between the Dark Triad and  empathy**; Peter K. Jonason, Minna Lyons, Emily J. Bethell & Rahael  Ross; Personality and Individual Differences (2013)\n\n**The Dark Triad  at work: How toxic employees get their way**; Peter K. Jonason, Sarah  Slomski & Jamie Partyka; Personality and Individual Differences  (2012)\n\n**Will get fooled again: Emotionally intelligent people are  easily duped by high-stakes deceivers**; by Alysha Baker, Leanne ten  Brinke and Stephen Porter; (2012) Legal and Criminological Psychology\n\n**Do  human females use aggression as an intrasexual competition strategy?** ;  Tracy Vaillancourt; Philosopic Transactions of the British Society B  (2013)\n\n**Empathy, morality and psychopathic traits in women**   ; Ana  Seara-Cardoso, Helene Dolberg, Craig Neumann, Jonathan P.   Roiser, Essi  Viding;  Personality and Individual Differences, 55 (3)   pp. 328-333  (2013)\n\n**Psychopathy in Women: Assessment, Manifestations, and Etiology**;   Verona,  E., & Vitale, J. ;  (2006) – In C. J. Patrick (Ed.),   Handbook of  psychopath (pp. 415-436). New York, NY, US: Guilford Press        Gender and psychopathy: an overview of important issues and   introduction  to the special issue ; Nicholls, T. L. and Petrila, J. ;   (2005),   Behavioral Science and the Law, 23: 729-741\n\n**Gender   and factor-level interactions in psychopathy:  Implications for   self-directed violence risk and borderline personality  disorder   symptoms** ;By Verona, Edelyn,Sprague, Jenessa,Javdani, Shabnam;    Personality Disorders: Theory, Research, and Treatment, Vol 3(3), Jul    (2012), 247-262\n\n**Putting together phylogenetic and ontogenetic perspectives on empathy**   ;  Jean Decetya & Margarita Svetlova; Developmental Cognitive    Neuroscience (2012)  The neuroevolution of empathy ; Jean Decety ; The   Annals of the New York  Academy of Sciences (2011)\n\n**Different routes to limited empathy in the sexes: Examining the links  between the Dark Triad and empathy** ; Peter K. Jonason, Minna Lyons ,  Emily J. Bethell & Rahael Ross;\n\n**Personal   and Individual Differences (2013)  Towards a neuroscience of empathy:   Ontogeny, phylogeny, brain  mechanisms, context and psychopathology** ; Cristina Gonzalez-Liencres, Simone G.  Shamay-Tsooryc, Martin Brünea; Neuroscience and Behavioral Science  (2013)\n\n**Two   systems for  empathy: a double dissociation between emotional and   cognitive empathy  in inferior frontal gyrus versus ventromedial   prefrontal lesions** ;  Simone G. Shamay-Tsoory, Judith Aharon-Peretz and Daniella Perry ; Brain  – A Journal of Neurology (2009)\n\n**No Evidence for Emotional Empathy  in Chickens Observing Familiar Adult Conspecifics**   ; Joanne L. Edgar,  Elizabeth S. Paul, Lauren Harris, Sarah Penturn   & Christine J. Nicol  ; PLoS ONE (2012) 7(2): e31542.   doi:10.1371/journal.pone.0031542\n\n**Sex differences in the structural connectome of the human brain**;   Madhura  Ingalhalikara, Alex Smitha, Drew Parkera, Theodore D.   Satterthwaiteb,  Mark A. Elliottc, Kosha Ruparelb, Hakon Hakonarsond,   Raquel E. Gurb,  Ruben C. Gurb, and Ragini Vermaa; PNAS (2014)",
    "title": "Feminists and Privilege of Exceptions",
    "subreddit": "MensRights",
    "timestamp": 1563011322,
    "score": 56,
    "keyword": "black manager"
  },
  {
    "text": "MRAs most potent issues: The Lack of Fathers & Male Suicide Something I’ve been thinking about is how feminism became really potent because they focused on specific issues that uniquely affected women and are easy to support. They chose a movement for equality and a movement against tragedy: Economic Inequality (“Wage gap”) & Sexual Assault (MeToo)\n\nMRA could benefit from focusing on a couple issues like this that can get support from everyone rather than a whole bunch of loosely connected things to rebuff hypocritical feminism & highlight male victims\nfrom many of the same problems women face. \n\n——————————\n\nI believe our two most potent issues are Lack of Fathers & Male Suicide. These are easy to get general support for because the benefits of tackling them are enormous.\n\nOur equality movement is with the Lack of Fathers. Like the Equal Pay Act, we need an Equal Parent Act, which gives fathers the same rights over their children as mothers. There are great statistics that show fatherlessness linked with all sorts of problems. Like encouraging women to be managers, we need to encourage fathers to be more present and make women be more accommodating for this. This can be linked across all ethnicities, and is a really big problem for our black community.\n\nOur tragedy movement is with the historic high rates and record rates of male suicide. We need focus on helping make male mental health important & toning down hateful feminist rhetoric against men. This focus on preventing male suicide — actually preventing death — is the biggest preventable tragedy that everyone can get behind and many people know someone who has. This will help spur a lot more research into male mental health and figure out underlying problems and gives credibility to male voices rather than just these conversations about “toxic masculinity”, which are a female perspective on male issues. \n\n————————\n\nWith focus on the Lack of Fathers & Male Suicide we can gather proper general support that can lead to a Department of Men Affairs, can lead to toning down misandry for mental health reasons, protect fathers from having their children taken away from them, equalize divorce & child-support issues, reduce violence because fathers can keep unruly adolescent men on better paths, and be strong advocates for helping their boys who are struggling in school. This focus will trickle down on so many of our issues, getting the messaging simple and focused on the male experience will be of great benefit. We have strong statistics on both of these topics as well.\n\nThe most important thing, is that these are serious problems that disproportionately affect men and require uniquely male perspectives to be accomplished. \n\nWhat do you think? Maybe there are other issues that are more potent?",
    "title": "MRAs most potent issues: The Lack of Fathers & Male Suicide",
    "subreddit": "MensRights",
    "timestamp": 1552381746,
    "score": 35,
    "keyword": "black manager"
  },
  {
    "text": "Masculinity under siege in schools, politics, online | Article in The Australian newspaper outlines the feminist war on men &#x200B;\n\n# Masculinity under siege in schools, politics, online📷[KEVIN DONNELLY](https://www.theaustralian.com.au/author/Kevin+Donnelly)\n\n* 12:00AM JUNE 28, 2019\n* [206 *COMMENTS*](https://www.theaustralian.com.au/commentary/masculinity-under-siege-in-schools-politics-online/news-story/7d0c3c50317c07b2198136f95c593bd7)\n\nIs there a crisis in masculinity? Based on an article by the American Jordan Black, “Masculinity in Menopause: The Emasculating Effects of Fatherlessness and Feminism”, the answer is yes.\n\nBlack highlights how, across the Western world, falling levels of testosterone and low sperm counts are contributing to significant changes in how masculinity is defined. Add the impact of so many boys raised without fathers and the global #MeToo movement that gives the impression that all men are inherently violent and misogynist, and it should not surprise that Black concludes: “We are not making men like we used to; in fact, we are not making them at all.”\n\nThe same is happening here, where similar forces are at work undermining masculinity and radically redefining what constitutes manhood. As Bettina Arndt says in her book *#MenToo*, men are unfairly demonised and attacked by radical feminists more intent on winning gender wars than peacefully coexisting.\n\nEven to suggest men’s rights are being undermined is to incur the wrath of the sisterhood. Victorian Women’s Trust executive director Mary Crooks wrote this week in Nine’s *The Age* and *The Sydney Morning Herald* newspapers: “Men’s ‘rights’ are about treating women as inferior; objectifying them by denying them any personhood. Men’s ‘rights’ are about being able to stalk, harass or abuse women online, on the streets, in the home or at work.”\n\nAnother example of this fatwa against men is how every time a woman is attacked or murdered the response is to blame all men and to suggest that violence occurs only because society is patriarchal and misogynist.\n\nAfter last month’s horrendous murder of Courtney Herron in a Melbourne park late at night, Victorian Premier Daniel Andrews said women travelling alone should be safe regardless of where they were or what the hour, and that crimes such as this were “most likely about the behaviour of men”.\n\nVictoria Police Assistant Commissioner Luke Cornelius mirrored the Premier’s views. He said: “This is about men’s behaviour. It’s not about women’s behaviour” — implying that, instead of the act being perpetrated by one demented evil soul, all men were implicated.\n\nWhen detailing the death of masculinity, Black also says the US education system is guilty of “encouraging feminine behaviour for both genders”.\n\nFeminist Camille Paglia makes the same point when she bemoans “the plight of physically active boys in a public school system dominated by female teachers”.\n\nThe Australian school system also disadvantages boys as a result of the feminisation of the curriculum. Research suggests boys, compared with girls, need greater structure and discipline to learn, especially in relation to learning to read, where the absence of a phonics and phonemic awareness approach puts them at risk.\n\nToday’s approach to education is more about “care, share and grow”, where teachers facilitate and students self-direct, manage their own learning and where competition is shunned. It’s an approach that favours girls.\n\nNot surprisingly, girls out­perform boys in reading as measured by the National Assessment Program — Literacy and Numeracy, and achieve stronger Year 12 results as measured by the Australian Tertiary Admission Rank. It’s also true that material such as the gender-fluidity Safe Schools program and the Respectful Relationships program being implemented in Australia disadvantage boys, as both present a negative and biased view of masculinity and manhood.\n\nThe view of boys and men presented is one that implies masculinity is inherently violent against women and that Western societies such as ours are patriarchal ones in which women are ­oppressed and treated as second-class citizens.\n\nVictoria’s Royal Commission into Family Violence reported that 25 per cent of family violence victims were men but the Respectful Relationships program implies it is only women who are at risk.\n\nStudents also are never told that such is the way the law now operates that men often are assumed to be the guilty party.\n\nAnother example of how the curriculum has been feminised is the way school programs present traditional male characteristics such as fortitude, courage, physical strength and mateship as negatives instead of being worthwhile.\n\nEven worse, many schools ban physically active and risky playground activities and behaviour, and it’s not unusual for primary schools to ban boys wearing ­superhero costumes on the basis that play-acting reinforces ­negative and potentially violent behaviour.\n\nMore radical feminists go as far as saying traditional male qualities lead to what *The Age* journalist Anna Prytz describes as a “man box”, a situation where men are constrained because they mistakenly believe they should be “unemotional, hyper-sexual, physically tough, stoic and in ­control”.\n\nInstead of accepting the feminist argument that the characteristics that typically define men are toxic, Black argues in favour of what he describes as “virtuous masculinity”. Paglia makes a similar point, arguing that feminists guilty of misandry should learn to respect and admire positive masculine qualities.\n\n*Kevin Donnelly is a senior research fellow at the Australian Catholic University.*",
    "title": "Masculinity under siege in schools, politics, online | Article in The Australian newspaper outlines the feminist war on men",
    "subreddit": "MensRights",
    "timestamp": 1561738940,
    "score": 25,
    "keyword": "black manager"
  }
]