[
  {
    "text": "Any interview tips for tomorrow? I have interview tomorrow for an HR Coordinator position. My phone interview went really well and I am excited about this position. I was thinking of wearing a white shirt with black blazer and pale green pants. It is also apparently a two hour interview with a panel and then two individual interviews with the director and the VP of HR. Any tips with how to go about an interview that’s this long?",
    "title": "Any interview tips for tomorrow?",
    "subreddit": "jobs",
    "timestamp": 1570754310,
    "score": 2,
    "keyword": "black director"
  },
  {
    "text": "Look for a new job even though I'm moving to a new city in 6 months? This post is not my situation, but my boyfriends.\n\nSo, my bf graduated in 2018 and since then he has been working at a community center for kids. He has gotten a couple raises, from $16/hr to $18hr, and most recently, salaried at $41k. We live in Boston, so honestly, this isn’t a lot. He went from starting as a group leader in the classroom (low stress according to him), to doing more HR-related stuff, grant writing, classroom management, curriculum development, and also maintenance/IT. It has been high stress for 6ish months or so now, and  the reason he is responsible for all these things is because the director of the center cannot find reliable, qualified people to apply for open positions (it’s a community center in an underserved black community). The hours were 7:30-4, but now it is 8:30-6 (and often 7:30-6). His boss has told him how vital he is to the team, but it is puzzling to me then how he only makes $41k as opposed to an insubordinate teacher she consistently complains about who makes $55k. Not the point, but anyways.\n\nI have actively encouraged him to look for work elsewhere since June. This is because 1) he is consistently complaining about how stressful it is and how much responsibility falls on him, and 2) he is not making much money at all. He has always said that he doesn’t want to quit because he wants to help the center and the children. To me, this is foolish and you should only prioritize yourself career-wise, but I’ve always just let it go because I don’t want to force him into anything.\n\nWell, yesterday he comes home nearly in tears because of his stressful day. He wasn’t able to get his work done because of a flood in one of the bathrooms and spent two hours of his afternoon cleaning up when he had a grant proposal to work on. (My question is why on Earth doesn’t this place have a janitor? Why is an admin person cleaning up this mess?). Now, he is thinking about a new job. The only issue is we are moving to New York in June.\n\nSo here’s our question. Should he look for a new job now, if he’s going to be leaving in June anyways? He could get a much better salary with the skills he’s gained in this job (esp grant writing which is what he wants to do) and he’s been there 18 months. But is having a short stint on the resume going to hurt him when he looks for work in NY? He has said that he would stay where he is if given more money. The thing is I don’t know if this rinky-dink center even HAS the money to give him. So should he get a new job and leave? Get a job offer and tell the center to match? Is a contract job feasible? Give me all the advice!!!\n\n📷**ReplyForward**",
    "title": "Look for a new job even though I'm moving to a new city in 6 months?",
    "subreddit": "jobs",
    "timestamp": 1573910793,
    "score": 0,
    "keyword": "black director"
  },
  {
    "text": "Nagging memory of a friend's dad getting angry at me because he thought he could see down my shirt during a play On mobile, and this is really long. Tl;dr at bottom\n\nWhen I had just turned 17, I played the role of Lady Macbeth in a community theater production of Shakespeare's Macbeth. It was my first lead role in a play, and I was immensely proud of myself.\n\nThere was some difficulty with my costumes. As a young girl, I had what you might call a noticeable figure, and the costume director put a lot of effort into making my costume period appropriate, thematic, and modest because I was underage.\n\nFor most of the play, I appeared in an ankle-length black skirt and black camisole under a long-sleeve black mesh top with an enormous lace collar ruffle puffed up so high that it touched my chin in the front and the back of my head. Also, kabuki make-up. Because of...art...\n\nAnyway, at the climax of the play, Lady Macbeth has a mental breakdown and delivers the famous \"out damn spot!\" monologue. My costume for this was a change to an all-white ensemble: a long white skirt and tank top with a white cardigan. Since the blocking of the scene involved me grovelling on the floor, the director, the costume designer, and I were all mindful of the neckline of this costume, so as part of my costume change, I wrapped an Ace bandage around the top of my chest from my collar-bone to my rib cage to cover my body with the flesh-colored wrap. In case a member of the audience were to get an eyeful during the scene, they would be seeing flesh tone fabric, not my body.\n\nY'all, I crushed that scene. Bits of the soliloquy linger in my memory today. I remember so clearly the black-box theater, the lights, and the low stage. My eyes filled with real tears as I played the part of the murderous queen with the guilt-ridden and broken mind.\n\nAfter the play, flushed with my triumph, I met with some school friends who had come to see the play with their families. Unprompted, one friend's dad's feedback was that he wished I had been dressed more appropriately. He said that during the last scene, he could see down my shirt all the way to clearly see my bare stomach. I tried to argue that it wasn't possible, but I was shut down with a stern, \"Young lady, I saw what I saw.\"\n\nBut, I know it wasn't possible. Not only did I have the Ace bandage in place, but I was also wearing a corset under my costume. It was literally not possible to see my bare stomach because my stomach wasn't bare.\n\nI have often reflected on the disturbing implications of this man's comment. What was he doing staring down my shirt when I was reciting Shakespeare? Why was he staring so hard he convinced himself he could see down my shirt and between my breasts to my stomach? Why was he so mad at me, a teenage girl, even if what he thought he saw was true? Why wouldn't he let me assert my modesty, my intention and efforts to remain covered? He seemed so sure I had intentionally put my bare torso on display, and he was furious over it.\n\nTbh, I can't count the number of times as a teenager I experienced grown men reacting in anger to my developing physique, blaming me for their own aroused reaction to a child.\n\nHonestly, what was I supposed to do? Would it have been most modest not to appear on stage at all? I still find it baffling 15 years later.\n\n\nTldr A friend's dad thought he got an eyeful while I appeared in a play. He didn't. He reacted in anger. Thinking about it, that reaction was a common one for me throughout my teenage years.",
    "title": "Nagging memory of a friend's dad getting angry at me because he thought he could see down my shirt during a play",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1550330790,
    "score": 64,
    "keyword": "black director"
  },
  {
    "text": "Is it ever beneficial to quit a seasonal job? I work for a well known company in the winter sports industry. We own a decent number of resorts (10+). I recently left a position as a sous chef in one of our resorts for a promotion to chef at another, recently acquired, resort across the country.\nThis place is a shit show. I have multiple health and safety concerns about my building. When I ask, I am told that, \"it's been that way for years.\"\nOur maintenance crew is great, but they have the impossible task of fixing 30+ years of problems that have been patched a number of times and never fixed.\nI was able to achieve excellent ratings on my health inspections, but I personally know of several demerit-worthy offenses with the equipment and infrastructure.\nThe leadership at this particular resort is inexperienced, and stretched thin. Most of the upper management got their jobs by being the last one standing or being the only one applying, rather than based on merit from a large pool of applicants.\nI feel like I am learning nothing but what not to do by being here. There is no guidance. There is no organization. The entire department flows at the whims of one director, who has himself admitted to being under qualified.\nIs it ever beneficial to leave a temporary position because you don't want to be associated with the place professionally?\nI feel like leaving a 6 month gig after 3 is going to look bad regardless, and if I were to try to explain the situation to a perspective employer, it would look like I'm badmouthing my previous employer.\nAny advice? Any thoughts? The company as a whole has treated me very well, and as a whole has their shit together, but this location is another story.\nI don't want to put a black mark on my resume or affect my career trajectory, but this place literally has me worried about basic health and safety issues and my only potential leaders don't seem to care. I want to leave, but I also want the badge of a full season in this position, for this company.\nAny advice?",
    "title": "Is it ever beneficial to quit a seasonal job?",
    "subreddit": "careerguidance",
    "timestamp": 1547259105,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Blackrock software engineer compensation progression Hi guys. Joining BlackRock as an analyst. Wanted to know how total compensation increases each year and from analyst to associate to vp to director for people in tech. Thanks!",
    "title": "Blackrock software engineer compensation progression",
    "subreddit": "cscareerquestions",
    "timestamp": 1561502605,
    "score": 3,
    "keyword": "black director"
  },
  {
    "text": "From CIB to Big 4 Hi all, \n\nI just wanted to collect some opinions on my current situation, in case anyone has already gone trough something similar.\n\nA few months ago, I joined a Big 4 in a non-client facing position. My primary background is in corporate & investment banking where I was client facing. The reason that pushed me to leave my former job were more practical (low salary, limited progression, questionable environment, high turnover). Yet, during my time in banking, I kept reaching one high after another leading to constant positive feedback from clients, senior management, country heads etc, awards etc..My local management (middle-management) seemed however underwhelmed and didn't have the same level of enthusiasm for some reason.\n\nI thus decided to leave my former banking position to move into this Big 4 one ... I deem it to be the worst mistake I could have ever done career-wise. I'm almost 6 months in and although I understand there is a reasonable adaptation time, it seems I'm not adapting. I went from being a high-achiever in a client-facing role, to an incompetent individual in an internal role. \n\nThere are no procedures and processes in place. One day it's black, the next it's white. You get ratty responses from contractors offshore, local managers and other stakeholders. Limited training. When you ask a question, it's either \"I don't have time\" or \"I don't know\". No one cares how you're doing or progressing as a new comer. You're being given a project with incorrect information which you have to feed to other stakeholders and thus end up losing credibility. \n\nIt's a headache. I've dealt with demanding CFOs/directors/MDs in banking and no one ever said they didn't have the time or sent me a ratty response. I managed to build relationships with higher management very quickly in banking, which does not seem to be happening here. The job in itself is not hard and certainly does not even compare to the amount of pressure I had in banking. This is nothing. However, the hostile atmosphere is hard to dealt with. The job is extremely boring as well. I'm depressed and certainly don't recognize myself. I lost all of my confidence, I'm not the bubbly/shiny person I once was in banking. I cry every day at work, which is not normal as I probably cried 3 times during my 4 years prior to this.\n\nHas anyone ever moved from industry to Big 4 to realize they made a mistake? Was it easy to move back into industry?\n\nThanks.",
    "title": "From CIB to Big 4",
    "subreddit": "Accounting",
    "timestamp": 1566237585,
    "score": 2,
    "keyword": "black director"
  },
  {
    "text": "Racism and sexualization I experienced at Child Care Job Racism and sexualization I experienced at Child Care Job\n\nI’m a mixed black woman living in a very white Midwestern state. Recently, I was a child care worker at a super white and Trump supporting day care (didn’t know it when first applying for job) and I have never experienced such blatant racism! A lot of the white People were shocked to see I was working there and they reacted by ignoring me, giving me a dirty look to my face, talking about me in front of my face, and watching my every move to make sure I didn’t steal, lie or abuse the kids. They acted like I was the first black person they ever interacted with. They were envious I was in graduate school and ate healthy  also. Everytime a kid would cry, a worker would rush to my room and ask the kid what was happening. I felt like I had to always smile and not show any negative emotion like anger in order to make them comfortable and not fearful. I swear that job added to my ptsd.  One mother of a child saw me, ignored me, then asked another worker who was going to be looking after her baby (definitely implying she didn’t want me to). Also the child care workers told me to make sure I wore conservative clothes and to not flirt. While some of the other workers came in yoga pants and flirty and the managers didn’t say anything. They assumed I would be hypersexual and try to steal husbands or something! Then the child care director tried to figure out my insecurities and make me feel inferior/insecure by bragging about blonde women with blue eyes then watching me to see my reaction. It’s like she didn’t like seeing how I was happy, successful and black at the same time.\n\nThen after working for some time, a lot of the white fathers of the children started sexualizing and had crushes on me which made the white women more mad. What made me quit, though, was when a couple assumed I had abused their kid because she all of the sudden started having accidents (peeing). When his daughter was probably having accidents because of their marital concerns—- the husband cheated on his wife with the other day care workers and was trying his hardest to get with me. The father was also a police officer. And then the white co-workers became envious the police officer liked me because they all wanted him so they got even meaner and tried to sabotage me. I am betting they were telling the police officer lies about me being dangerous or crazy or something which is another reason the girl’s parents assumed the worst—that I was abusing her. \n\nWhat confused me was he was obviously racist (he didn’t acknowledge the other black woman worker) but acted like he was in love with me. but I think he was only nice to me because he thought I was attractive. Or then i wondered if it was a colorism thing but I doubt it because I was like the same skin color as her in the summer. I wonder if they were stereotyping me based on jezebel stereotype or sexualized mullato (although I doubt they knew I was mixed)?\n\nI also had no one to turn because the day care director was the most racist of all and would direct her workers to watch me. She would let her white workers come in late but was hard on me if I did. \n\nI feel hurt and angry Thinking about my experience at this job especially so because it confirmed that white people reject me, see me as other, and as a threat no matter what I do and who I am.\n\nWorst job. Should have made a complaint  for discrimination and reported them. Anyone relate or have similar experiences while working at child care?\n\nEdit: As for the parents assuming I abused their kid.. there was definitely racism and stereotypes going on there. But I also have to say, during that time, I was very emotionally unstable. I had just moved out of my abusive parents’ Home out on my own, financially independent for the first time. I was victim blamed from my family for my dad’s sexual abuse so I didn’t have any support system. Also, I already had trauma reactions from past racial discrimination. So being around all these white People made my ptsd alive and I was super hypervigilant, had major mood swings, was dissociating, and would sometimes be standoffish and other times friendly. It’s important I mention this because this played a factor in my treatment. But I still wouldn’t have been this mistreated if I was white. And I know this because there was a white girl that started right after me who was often angry, yelled at the kids, and was emotional.. but they didn’t care. And they weren’t watching her constantly or checking her kids in the room frequently.\nAlso, I forgot to mention, when I first applied the director almost was warning me about the location. Because she said, “this location is very Lilly white. Maybe you would prefer our other more diverse location since you are going to graduate school for social work.” Basically this woman segregated her child care centers. One was all white and the other was diverse. I was the first black woman to work at her “white” center.",
    "title": "Racism and sexualization I experienced at Child Care Job",
    "subreddit": "blackladies",
    "timestamp": 1548154953,
    "score": 59,
    "keyword": "black director"
  },
  {
    "text": "A Guide to Essential, Underrated, and Flat-Out Extraordinary Films by Black Women Directors",
    "title": "A Guide to Essential, Underrated, and Flat-Out Extraordinary Films by Black Women Directors",
    "subreddit": "blackladies",
    "timestamp": 1555436982,
    "score": 47,
    "keyword": "black director"
  },
  {
    "text": "I want to move to NY/LA and make films about woc, but no one believes in me Like the title says, it’s been my dream since forever to move to NY or LA and work my way up to directing films about black girls who aren’t sexualized, fetishized, ‘sassy’, etc. That are just normal girls who fall in love and have adventures and aren’t defined by trauma. \n\nEverytime someone asks what I’m studying I say film and there’s always the ‘Oh so you wanna be a director?’ But I can tell it’s judgmental or they don’t believe me. \n\nMultiple people in my own family have told me to make this a plan B and go to grad school now for something else like business, pretty much implying this should be a side hobby because it won’t work out, but I don’t want to make my passion plan B unless I completely fail at it. \n\nIt just sucks that my entire family is STEM, engineering, etc. so they don’t understand the entertainment industry or why I want to be in it so badly. I’m willing to be broke and suffer if it means I get to do what I love but they don’t get that.",
    "title": "I want to move to NY/LA and make films about woc, but no one believes in me",
    "subreddit": "blackladies",
    "timestamp": 1566567306,
    "score": 37,
    "keyword": "black director"
  },
  {
    "text": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S. Hey all! I’m a producer for Empowered Health, a new podcast that is aiming to demystify women’s health.\n\nWe just put out the first episode of our two-part series on the maternal mortality crisis. Episode one explores how race plays a role in this crisis– it becomes clear our culture isn't doing enough to protect black mothers. Black women are three to four times more likely than non-Hispanic white women to die during childbirth. That’s even after adjusting for socioeconomic factors, like education and income.\n\nAs more than one researcher said to us, the birthing crisis is the canary in the coal mine of women's health. It is a problem of women not being listened to, not being respected and being disempowered during a time in life when they should feel entitled to good care and a personal feeling of empowerment, feeling full of feminine power and purpose.\n\nDr. Neel Shah, the director of the Delivery Decisions Initiative at Ariadne Labs, breaks down how medical students are trained to be biased and how that contributes to this problem. Fatima Dainkeh of YWCABoston helps us understand actually talking to black mothers is a good place to start and that a day-long workshop on bias isn't going to cut it. Midwife Ebony Marcelle shares how she's shaped her care model to better serve African American mothers. And, Dr. Mary-Ann Etiebet, the executive director of Merck for Mothers, looks at the global initiative she heads working to integrating the voices of black women into maternal mortality and morbidity.  \nFigured this group might be interested in this episode, here's the link:  \n\n[https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392](https://podcasts.apple.com/us/podcast/empowered-health/id1452440833?i=1000436048392)\n\n(links to other streaming platforms on our website www.empoweredhealthshow.com)",
    "title": "Black mothers are dying in childbirth 3-4x more than white mothers in the U.S.",
    "subreddit": "blackladies",
    "timestamp": 1555987676,
    "score": 32,
    "keyword": "black director"
  },
  {
    "text": "How to feel confident enough to negotiate salary as a young black professional Hey y’all. Our performance review is coming up at work and I want to negotiate a promotion, and because I know they’re going to try to lowball me, salary as well. \n\nI am the only black woman in my department since my former boss left (she was amazing). Now I’m reporting to the director of the department and since my boss has left I’ve been given more responsibility and have been working my ass off. I know I’m being paid much less that my counterparts and the director has mentioned she wants to promote me, but I feel like they will try to lowball me. \n\nI’m only 25 and still feel like the smallest person in the room sometimes, and because such I work twice as hard as some of my coworkers to “prove” myself. \n\nAny tips on how to negotiate salary if they try to lowball, and just negotiating tips in general? Thanks!",
    "title": "How to feel confident enough to negotiate salary as a young black professional",
    "subreddit": "blackladies",
    "timestamp": 1553388241,
    "score": 17,
    "keyword": "black director"
  },
  {
    "text": "'Last Black Man In San Francisco' Reveals A Longing For Home In A Changing City As introduced and [reviewed](https://www.npr.org/2019/06/13/732331125/last-black-man-in-san-francisco-reveals-a-longing-for-home-in-a-changing-city) by *The Los Angeles Times* film critic [Justin Chang](https://www.latimes.com/la-bio-justin-chang-staff.html).\n\nI have so much to say! Personally speaking, this is one of the most emotionally, and visually moving art films for me in a long time. The themes, character dynamics on screen, art direction resonate so much with me—and I've only visited SF. This subreddit has helped me familiarize the city at a deeper perspective, too.\n\nThe movie takes the last sixty years, or more, of the city's cultural history into account—which drives the story and the characters. \"The movie emerged from a close friendship and collaboration between the director, Joe Talbot, and his star, Jimmie Fails, both lifelong San Franciscans.\" ([Source](https://www.npr.org/2019/06/13/732331125/last-black-man-in-san-francisco-reveals-a-longing-for-home-in-a-changing-city)).\n\nBeg your pardon for leaving this rather vague—I don't want to overhype. I have FEELINGS. Please let me know what you think if you've seen it.",
    "title": "'Last Black Man In San Francisco' Reveals A Longing For Home In A Changing City",
    "subreddit": "asianamerican",
    "timestamp": 1566152898,
    "score": 4,
    "keyword": "black director"
  },
  {
    "text": "At the workplace, are Asians only comfortable around other Asians? Just curious. Reason why I ask was because I recently started a new job at a marketing firm and there were several other new employees who started on the same day. One of them happened to be a young Asian female who looked around my age (mid 20's) and pretty much all of the employees in our office are white with a small mix of blacks. On my first and second day, I made the efforts of trying to introduce myself to those who sat around me (although my director already introduced me to some of them) excluding the entire section of people sat 2-3 rows ahead of where I sit.\n\nThe Asian sat at the 3rd row ahead and on Friday, she came all the way to my desk and asked if I was Chinese (I'm Korean btw), saying that 'I am new here too', 'did you grow up here?' blah blah and saying how she was happy to see another 'Asian' in the office (I felt that was weird) can you imagine another race, like a black employee for example, going up to another new face employee who is also black and saying, \"it's good to see another black brother/sister here in the office?\" it's just weird and not right.\n\nI got an automatic assumption that this Asian female employee only feels comfortable around other Asians, she hardly interacts with the employees who sit around here since I can tell from a distance and was quite surprised how she came up all the way up to me out of nowhere and started to introduce herself with a bunch of questions like that. I don't know, is it just an 'Asian' thing? Am I overreacting to this situation or what?",
    "title": "At the workplace, are Asians only comfortable around other Asians?",
    "subreddit": "asianamerican",
    "timestamp": 1556504996,
    "score": 0,
    "keyword": "black director"
  },
  {
    "text": "Woman rapes & nearly kills 5 year old - 1 year prison sentence An Australian 'woman of color' (Indigenous, just thought I'd get extra points for virtue signalling - oh oops, she did something bad, so I'd better say 'human adult' and accuse you of racism if you ask me her ethnic background) received a minimum 1 year prison sentence for raping and beating a 5 year old to the point that medical staff early in the child's admission to hospital thought that she may die.\n\nI'm prepared to believe this woman came from the wrong side of the tracks and had plenty of bad luck in her life - however, she's lucky as hell she has a vagina, as if she were a man committing the same offence she'd be doing 15 to life.\n\nIt also kind of helped her that she had super rich members of the prominent Myer family funding her - their do-goody works with Indigenous women seems to include taking the child raping and beating ones under their wings, paying for multiple Queens Counsel defence barristers for them, and providing them with character references. Gotta love philanthropy and helping 'people of color'.\n\nNow given the horrific nature of this particular crime to a very young girl, feminists will be outraged and pushing for strong deterrence by the courts to protect young girls, right? Of course, of course I am joking, you know that's not how they roll. The usual modus operandi of the feminist hatemongers in this situation is to blame a man. 'You killed your husband - oh, you're a battered woman, the man made you do it, you hero, you can walk free!' Unfortunately for them, and typical in dysfunctional families with kids, there was no man on the scene to blame. Just this evil black child raping  bitch who, it seems, had been given custody of this poor little child. That competent male relatives - eg. like, guess what, crazy idea here, THE FATHER - have little chance of custody of kids in these difficult families is another matter - after all, better a bad woman than a good man.\n\nThe poor father didn't even get quoted in the article. The child's grandmother, a woman and therefore worthy of being given platform, expressed her anger at the leniency of the sentence.\n\nMysteriously the article has disappeared from online, this used to be its link but it is broken:  [https://www.theage.com.au/national/victoria/stepmother-may-serve-just-one-year-in-jail-for-horrific-sexual-assault-20191125-p53dyt.html](https://www.theage.com.au/national/victoria/stepmother-may-serve-just-one-year-in-jail-for-horrific-sexual-assault-20191125-p53dyt.html)\n\nIt was in The Age newspaper in Melbourne in print on the 27th or 28th of November 2019. It's possible there are interested parties trying to bury the news. One thought that occurred to me is that the Myer family members, whose support for the child rapist was certainly not glossed over by the reporter of the story, had the story killed. They could do this by threatening defamation - although given the article said they'd funded the rapist woman's defence, and provided character references to the child rapist woman, which to my knowledge is true, I can't imagine what the libel is - or they could have used their connections to people in power to kill the story. Or maybe there's a completely innocent explanation, the story hasn't been killed, and the fact that suddenly the whole world cannot find out what has gone on in this case is due to a coincidental technical or other reason. The article mentioned the Director of Public Prosecutions may appeal the sentence, but given the matter would then go to an appellate judge not jury I can't see why there would be a reporting suppression order in light of this - possible I guess.\n\nMen and women, just imagine a man had nearly beaten to death then raped a 5 year old, and was given a 1 year non parole period. There would be absolute pandemonium and outrage, the streets would be full of angry people. But this black child rapist bitch does it, and where are the feminists protecting this little girl? No where. And I believe I know why. They are not humanists, and they're not really about helping people. They might claim helping women is their goal, but when I look at it, with a skeptical eye, it's apparent to me that harming and demonising men is actually the real raison-de-etre of feminism, and constructive goals like helping women and girls will always give way to the primary destructive goal of harming men in any and all ways possible. If a woman goes essentially unpunished for raping a tiny child in pursuit of this 'higher good', then that is water off a duck's back. THEY DON'T CARE.\n\nFeminists are even quite explicit about this. They say any woman in prison is 1 too many, regardless of the crime. They are cool with a woman serving LESS PRISON TIME THAN A MAN FOR THE SAME CRIME.  So the bitch in this article [https://www.sbs.com.au/news/the-feed/opinion-8-of-prisoners-are-women-that-s-about-8-too-many](https://www.sbs.com.au/news/the-feed/opinion-8-of-prisoners-are-women-that-s-about-8-too-many) says she doesn't support \"equal\" sentencing, ie. same time for same crime, but \"equitable\" sentencing, whatever that's supposed to mean. Well, to be fair she says what it means, it means not putting women in prison when you would a man as they're custodial parents of kids (huh, wasn't it feminism that set them up as custodial parents and men as non custodial parents in the first place), and because they've had a tough life. She drones on about women in prison having had a history of abuse themselves. Excuse me while I get my vomit bag. I mean, as if male prisoners have had carefree lives full of kindness, PC pals asking them for confident and unequivocal yesses, and ne'er a harsh word spoken to them.\n\nSo I ask feminists - like that red-haired nutcase Hawathy or whatever her stupid name is - I was going to write the angry one, but that hardly helps defining the individual from the pack - the one who wants, at least in fantasy, to 'cull men' - when will women - when, feminism, will women stop beating unconscious and raping little tiny children? (I won't repeat her 'culling' comment with proper reversal of genders, unlike her, as a woman, as a man I'd probably be arrested for it).",
    "title": "Woman rapes & nearly kills 5 year old - 1 year prison sentence",
    "subreddit": "MensRights",
    "timestamp": 1575096811,
    "score": 454,
    "keyword": "black director"
  },
  {
    "text": "History of feminism the way they don't want us to know! This is the speech the Cambridge feminists did not want anyone to hear. Its Elizabeth Hobson's speech from the Justice 4 Men & Boys event yesterday. Published with her permission.\n\nHello and welcome to The History of Feminism, I want to make two disclosures before I begin: firstly, that this lecture will concentrate on the Western world – particularly the Anglosphere. I am not suggesting that, that’s where feminism’s boundaries reside or denying its existence elsewhere but it does start here and here is where my real expertise lie. And secondly: this may come as a surprise to you but I am not a feminist. I am an ex-feminist but after studying the movement, I struggle to see how any reasonable person could know what I now know and be anything other than opposed to it. I’d like to thank the powers that be at Cambridge University for refusing to bow to pressure from the mob and allowing these talks to go ahead and I’d like to condemn the emotional reasoning of those who would have stopped them. The purpose of further education is not to make people feel comfortable, it’s to challenge preconceived ideas and to build the capacity to meet challenging concepts head on and to grow from those experiences. Universities should be arenas wherein students build resilience, tolerance and dignity but increasingly activists are subverting these spaces to feed anxiety, black and white thinking and hysteria within their communities which is harmful to the search for truth that they should be engaged in – and harmful to the individuals that they claim to want to protect (including themselves). So, finally, thank you to everyone sitting here now: to those who’ve come in support of our work, those here out of curiosity, and especially to anyone who’s expecting to be offended, yet intending to engage because that shows some strength of character!   \n\nBefore I get stuck into the recorded history of feminism, I need to take a moment to illuminate the biological roots of the movement. Human beings are a gynocentric species – this means that we prioritize the needs and well-being of women over men. This is an evolved instinct that came about as a result of women being the limiting factor in reproduction – ie. women have a much lower ceiling on how many offspring they can physically produce – and in small communities that are subsisting this makes them highly important because they potentially hold the key to whether or not the collective will survive at all. This is why we traditionally send only men to war, this is why we have the “women and children first” Birkenhead Drill, this is why people are more likely to put themselves at risk to save a woman in danger than a man – and it’s why we have feminism. Feminism has taken our gynocentrism and weaponized it. \n\nMen’s role in this evolutionary sense is to act as a genetic filter – both to mitigate gene replication errors (ie. Preventing less successful combinations multiplying by barring many men from reproducing) and to produce and retain genetic recombinations that enhance the fitness of offspring. To these ends, male fitness is constantly policed to ensure that women’s standards are met before they gain sexual access – which is why far fewer men than women reproduce.  Because the pay-off of carrying particularly successful genes is so much greater for men (women will likely have the opportunity to reproduce if their fitness is moderate, men may well not), evolution gambles with male genes. This results in very different bell curves for men and women in terms of IQ and physical and psychological health, with men being over-represented at either end of the distribution (particularly intelligent/healthy or unintelligent/unhealthy) and women clustering around the middle. Feminists focus on the apex of male achievement to prove that men enjoy greater success than women (whilst ignoring the biological reasons that catapult a minority of men to the stratosphere) and on the acts of the most malevolent minority of men to generalize their patterns of behavior as emblematic of masculinity (whilst ignoring the fact that the very demographics that preoccupy them show that what is emblematic of masculinity is actually variability).  \n\nSo, human beings have always valued women more than men and been more critical of men than women. These were necessary instincts in tribal communities but they have been manipulated to privilege women to the point of dysfunction – and this began with the development of proto-feminism, which arose in the late Middle Ages. Queen consort of France and England, Eleanor of Acquitaine spearheaded a movement within her court to subvert the chivalric code (which had traditionally governed relations between knights and lords and the general public) to regulate the behavior of men towards women. These women initiated a system of romantic feudalism wherein noble men were under irresistible pressure to identify a lady as midons (my lord) and to submit to her will and delicately accept any scorn that his midons saw fit to extend to him. Eleanor established Courts of Love in which she and her noble women would administer “justice” in romantic disputes. Not only may many men in particular recognize this state of gender relations – but the modus operandi that Eleanor and co used to achieve their supremacy is entirely familiar: they generalised about all men based on the poor behaviour of a minority, asserting that women needed protection from men’s violations, and they pushed forward a narrative of women’s moral superiority, justifying female dictatorship. Within 200 years, Eleanors’ ideas had spread and saturated throughout Europe and throughout the class system. \n\nLa féminisme proper was born in the revolutionary France of the late eighteenth century – the political force first, the term around half a century later. In 1791, Olympe de Gouges published The Declaration of the Rights of Woman and the Female Citizen in response to the Declaration of the Rights of Man and of the Citizen. By publishing this document, de Gouges hoped to expose the limitations of the French Revolution in the recognition of women’s rights and to initiate changes in the Declaration of the Rights of Man to include sex equality. De Gouges opened her Declaration with the quote, \"Man, are you capable of being fair? A woman is asking: at least you will allow her that right. Tell me? What gave you the sovereign right to oppress my sex?\" [close quote]. In the preamble, de Gouges mirrors The Declaration of the Rights of Man, explaining that women, just as men, are guaranteed natural, inalienable, sacred rights - and that political institutions are instituted with the purpose of protecting these natural rights. She closes the preamble by declaring that \"the sex that is superior in beauty as it is in courage during the pains of childbirth recognizes and declares, in the presence and under the auspices of the Supreme Being, the following Rights of Woman and the Female Citizen.\" [close quote]. She was one of a small number of women beheaded for treason during the revolution. \n\nCharles Fourier is credited with having originated the word \"féminisme\" in 1837. A founder of utopian socialism and a slightly later supporter of women's rights, he believed that all jobs should be open on the basis of skill and aptitude rather than sex segregated and that traditional marriage could potentially hurt woman's rights as human beings, he himself never married. Fourier is believed to have influenced Karl Marx who argued as early as 1844, in his Economic and Philosophical Manuscripts, that women’s position in society could be used as a measure of the development of society as a whole. In The Communist Manifesto, Marx and Friedrich Engels celebrated the dissolution of the bourgeois family, with an erosion of the status of the father already taking effect as women entered the workforce. This, they believed, would lead to “a higher form of the family” in which women would be the true equals of men. Several years ago, at a FiLiA debate I heard Sheila Rowbotham explain that nobody could understand feminism without reading this book. International Women’s Day itself, has Bolshevik roots. Clara ‘The Grandmother of German Communism’ Zetkin and Rosa Luxemburg, at the Socialist Internationale in 1910, advocated for a Women’s Day but the date was not set in stone till 1921 when the USSR officially adopted March 8th which was selected to commemorate a specific date that led to the Russian Revolution. Specifically, a 1917 workers strike at a weapons factory in Petrograd. The women workers strike that modern feminists claim was the inspiration for International Women’s Day did not start until March 9th. \n\nMoving to the United States, in the pioneering Declaration of Sentiments from Seneca Falls in 1848 (generally taken as the seminal text of the first wave of feminism - though I would argue that it’s actually the second after de Gouges declaration) the claim was made that “The history of mankind is a history of repeated injuries and usurpations on the part of man toward woman, having in direct object the establishment of an absolute tyranny over her.” This is not justified by the history – of men risking their lives both in work and war to provide for and protect women, their families and their homes. Granted, the text highlights a series of injustices that women were subject to, however such a claim remains myopic and misleading. Under coverture legislation for example, while husbands did become the legal owner of all family assets, in reality, this came with responsibilities, and wives were not left entirely devoid of rights – their rights were simply different. Husbands could be criminalised for failure to keep their families as well as he could reasonably be expected, wives’ permission was required to sell any houses owned by the family – and actually if a member of a man’s household ran up debts, he was legally responsible for their repayment. Yes, women deserved to be granted various rights – but so did men, who did not deserve the derision they received from first wave feminists (including Christabel Pankhurst who notably explained in her 1913 book The Great Scourge, that men were “little more than carriers of venereal disease”). Furthermore, in his 1913 volume ‘The Fraud of Feminism’, Ernest Belfort Bax identified “two distinct sides” to feminism: an “articulate political and economic side embracing demands for so-called rights”, legitimately – and “a sentimental side which insists on an accentuation of privileges and immunities”. There is no mention in The Declaration of Sentiments (or any first wave texts) of the privileges and immunities enjoyed by women, nor any injustices faced by men.  \nThe women’s suffrage movement in the U.S. was tainted by racism. Although an African-American abolitionist, Frederick Douglas, did take to the stage at Seneca Falls – no African-American women are believed to have been present. Furthermore, feminist heroines like Elizabeth Cady Staton who organized the meeting at Seneca Falls and was a co-author of the declaration embraced her racism explicitly, characterising black men as inherently inclined towards rape, throughout her career. She also argued vehemently against the 15thAmendment (that would extend the vote to African-American men), claiming that it would degrade women to follow black men into the franchise.\n\nThe Women’s Social and Political Union – or Suffragettes – in the U.K. were not afflicted by racism. They actually took pride in the strength of support for women’s suffrage throughout the British Empire. The night before the coronation of George V in 1917, a demonstration was held to demand the right for women to vote, which featured an “Empire Pageant” featuring representatives from India, Australia, New Zealand, South Africa and the West Indies – and Indian Princess, Sophia Duleep Singh, was a major donor. They were not, however, devoid of bigotry – and I don’t just mean towards men – British Suffragettes held a special contempt for the working classes. Not only did they fail to rally behind the truly progressive call for universal suffrage, preferring to campaign for women to be able to vote “on the same terms as men” (ie. with property qualifications) but they embarked on a campaign of terrorism that may have hurt some middle and upper-class opponents (or insufficiently active supporters) financially but would put working class lives in both direct and indirect danger. They smashed shop windows and burned or bombed 17 industrial premises, including a lino factory, a laundry, woodyards and freight yards. They also targeted the café at Kew Gardens with an arson attack – destroying a business that was owned and staffed by women and destroying their livelihoods in a pre-Welfare State society. When the proprietor went to the WSPU to complain, she was told that she was taking ‘too personal a view of the matter’ and that the staff would no doubt be glad that they had lent support to the women’s cause.  96 homes were targeted. One was that of the Chancellor of the Exchequer, Lloyd George, which was empty under renovation. The bomb exploded just before his builders were due to start work so narrowly avoided injuring them, it did however destroy tools which were provided by the men themselves – who may well have ended up on the streets or in the workhouse as a result of their loss. Other houses – though the Suffragettes insisted that they only targeted them when empty – actually contained staff who were put at risk. Sulphuric acid and phosphorus in letter bombs caused a number of postmen to suffer severe lung damage and/or burns. A bomb planted outside the Bank of England would, if it had not been defused by a policeman, have gone off in a busy commercial area mid-afternoon. A bomb at Lime Street station, Liverpool, was packed with nuts and bolts to maximise harm. A bomb containing 24 cartridges of gunpowder was placed in the toilets of a theatre to go off during a matinee performance. The congregation at St John’s, Smith Square, had to put out a bomb containing 5½lb of gunpowder. Another bomb was chucked into a full Territorial Army barracks. The jockey whose horse ran over Emily Davison at Epsom in 1913 (Herbert Jones) suffered flashbacks to the event throughout his life until he committed suicide in 1951. The idea of these women as noble heroines is an outrage to any right-thinking person – and the idea that their terrorism led to the extension of the vote is implausible. They dropped their suffrage campaign entirely with the onset of WW1 (and a £20,000 grant from the government) and embarked upon their white feather campaign, for which they have further blood on their hands. Universal suffrage was won by quietly committed lobbying from the suffragist movement – and the sacrifice of so many working-class men in the war.\n\nTo understand the evolution of feminism from first to second wave, we need to look at the birth of critical theory. Critical theory emerged from the intellectual collective known as The Frankfurt School. They began their mission in 1923 with the establishment of the Institute for Social Research at the University of Frankfurt. Initially, founder Felix Weil and director Carl Grunberg, along with fellow orthodox Marxists, tasked themselves with making Marxism a viable alternative economic system to rival capitalism but from 1930 under, new director, Max Horkheimer the focus shifted to an examination of the culture out of which Capitalism flourishes, in order to subvert it to accommodate Marxism. Thus critical theory was established. The group moved its activities to the U.S. in 1933, in response to the rise of Hitler, to become associated with the University of Columbia in New York. Here, Erich Fromm pioneered the marriage of Marxist theory with Freudian theory and characterised the family (which they rightly identified as the building blocks of Capitalism) as repressive and pathological. Herbert Marcuse’s Eros and Civilization was published in 1955 in which a society based on free love and no work that liberated the human natures (that he felt were being repressed by Capitalist society) was proposed. This book was a major channel through which neo-Marxist ideas fed into various liberation movements in the 1960s, including of course feminism. Of feminism, Marcuse claimed that “the Women’s Liberation Movement is perhaps the most important and potentially the most radical political movement that we have.” Marcuse’s sentiments were echoed by Shulamith Firestone, founder of the Redstockings collective, who published The Dialectic of Sex in 1970, another utopian (or dystopian, depending on your perspective) radical classic that argued that the domination of men as a ‘sex-class’ over women as a ‘sex class’ (or “underclass”) was based in biology which needed to be overcome through advances in medical science that would liberate women from the “barbaric” practise of childbirth. She held the nuclear family, which she labelled a tyranny, in contempt and advocated for rationally constructed non-permanent bonding relationships between people who voluntarily undertook their upbringing in which “the dependence of the child on the mother (and vice versa) would give way to a greatly shortened dependence on a small group of others in general”. Kate Millet’s sister recollected a consciousness raising group that she attended with Kate in the New York of 1969 that opened with a back-and-forth recitation:\n\n“Why are we here today?”\n\n“To make revolution”\n\n“What kind of revolution?”\n\n“The Cultural revolution\" \n\n“And how do we make Cultural Revolution?”\n\n“By destroying the American family”\n\n“How do we destroy the family?”\n\n“By destroying the American Patriarch\"\n\n… it goes on, but you get the gist! Feminism became the leading vanguard in the subversion and desecration of a comparatively decent, prosperous civilisation. Their battle in this culture war was the decimation of the family and they would achieve victory in that battle by destroying men – a process they would enact by attrition of the esteem in which men were held, their identities and eventually their rights. \nA host of extreme misandrists poured forth bile during this period, thinkers like:  \n\n• Andrea Dworkin (“Under patriarchy, every woman’s son is her potential betrayer and also the inevitable rapist or exploiter of another woman.”),\n\n• Catherine Mackinnon (“Male sexuality is apparently activated by violence against women and expresses itself in violence against women to a significant extent.”),\n\n• Valerie Solanas (“to call a man an animal is to flatter him”),\n\n• Robin Morgan (“I feel that 'man-hating' is an honourable and viable political act”)\n\n•  Germaine Greer (“Men are the enemy”),\n\n• Shulamith Firestone (“all men are selfish, brutal and inconsiderate”) \n\nMarilyn French (“All men are rapists and that’s all they are”).\nHowever, I think it’s well worth looking at the more apparently benign representatives of the movement and unpicking what they had to say. In 1970, Irina Dunn coined the phrase “A woman needs a man like a fish needs a bicycle”, which was popularised later by Gloria Steinem. Referring to whom, I ask? To the countless generations of men who had endured the dirtiest, most dangerous and thankless labour to support their families? To their relatively recent male ancestors who fought for women’s suffrage (such as Jeremy Bentham and Henry Fawcett) and the elected representatives who would ensure such legislation passed (such as John Stuart Mill, whose male constituents elected him on a platform including female suffrage)? To their fathers who may well have participated in World War Two to protect their societies and families? To their brothers? Friends? Lovers? I believe Gloria Steinem had many of those – and was supported morally and financially by a number of them too. It may sound cute and catchy but it’s both contemptibly narcissistic nonsense and reprehensibly offensive.\n\nSecond wave feminism saw campaigns for equal pay which was realised in 1963 with The Equal Pay Act in the U.S. and in 1970 in the U.K. with our Equal Pay Act. It is, of course, entirely fair to legislate against malicious sex discrimination but, as we can see from the landmark case that led to Barbara Castle implementing the U.K.’s Equal Pay Act, the nature of the acts is far more expansive, responding not to simply the same jobs but to “work of an equal value”. The Ford Dagenham machinists strike in 1968 followed a re-grading exercise by Ford who classified sewing seat covers for cars (predominantly performed by women) as less skilled than jobs on the production line (largely done by men), resulting in a fifteen per cent pay disparity – and the court to which the case was referred found in Ford’s favour. There was no sex discrimination in this famous case, simply fair pay for different roles, but feminist activism continues to force the hands of employers not to make rational economic gradings but to ensure that men and women go home with increasingly similar pay packets regardless of relevant factors, and hey it has almost certainly led to less pay for Patriarchs, weakening their ability to provide for their families and putting stress on their relationships so it’s a win-win for feminism.\n\nSecond wave feminists also fought for access to contraceptive pills and abortions. The pill entered the U.S. market in 1960 but it wasn’t until 1972 there that it was made available to single women and, previously being at the discretion of individual medical practitioners in the U.K., it was incorporated into the National Health Service by Barbara Castle in 1974. This has led to far greater choice for women in terms of life paths, more sexual freedom and better physical health outcomes – and yet some have experienced a historically new pressure to be sexually active and a corresponding ennui in response to their sex lives, whether they believe they’re lacking or they fail to find meaning in casual sex. Abortion was legalized in 1967 in Scotland, England and Wales and found to be a constitutional right in 1973 in the U.S. There has always been a proportion of women who have killed their babies, bodies of new-borns believed to have been suffocated at birth have often been found behind Roman villas and prior to the act women turned to untrained practitioners who would administer folk-medicines or insert knitting needles into the womb through the cervix and obviously medicalised abortion up to a certain point is more humane for both the unborn child and the mother – and far safer for the latter. However, the callousness with which feminist activists typically have and still do approach the subject shows no concern for the sanctity of human life and precious little for the psychological well-being of the women who are told that expelling a “clump of cells” is a liberating act that will have no deleterious impact on her whatsoever (yet alone any sympathy for the men involved).\nA concerted struggle, on the part of radical feminists, began against pornography during the second wave. Feminist campaigners like Andrea Dworkin and Catherine Mackinnon joined forces with the religious right to raise concerns about trafficking and coercion in the industry and claimed that men’s consumption of porn led to increased risk of sexual assault and rape for women in free societies, as well as diminishing their capacity to be viewed as full human beings. In the U.S., several states enacted local ordinances that intended to treat porn as a violation of women’s civil rights and to allow women who believe they have been harmed by porn to seek damages in civil courts. The Dworkin-Mackinnon Ordinances were opposed as a threat to women’s freedoms by sex-positive feminists such as Camille Paglia and Wendy McElroy and were eventually shot down as violations of the First Amendment.\n\n The third wave of feminism emerged in the 1990s. It is characterised by intersectionality. Rebecca Walker, one of the founders, explained that “Feminism, in order to stay relevant, had to become about more than gender equality.” In an effort to be more inclusive, third wavers have embraced the grievances of – well, anyone who will identify straight white men as the problem. With literally no “rights” to be won, feminism became increasingly navel gazing – or more specifically a little lower – and obsessed over the minutiae of female existence in the modern Western world, finding oppression and abuse everywhere – from the make-up aisle to the bedroom. On university campuses posters were going up with the Ms. magazine study statistic that one in four college women was the victim of rape or attempted rape. This feminist lie was concocted by Dr Mary Koss who broadened the definition beyond any reasonable limit and in defiance of the 73% of her apparent “victims” who did not classify their experiences as rape. Take Back the Night Marches were growing, with participants chanting “2, 4, 6, 8, No More Date Rape” and giving emotional monologues about mistreatment at the hands of men. A moral panic was underway that still resonates darkly today. If Paglia, McElroy and their sex positive cohort thought that they had won the war for the hearts and minds of liberated young women in the 1980s, they were to be dramatically disproven just a decade later by an anxious and vulnerable generation of feminists. \nIn 1993, the Duluth Model was created in Duluth, Minnesota, founded by Ellen Pence (not, I believe related to Mike but certainly a good reason for his rule…). Used in all U.S. states (although recently seriously weakened by Donald Trump) as well as 17 other countries (including the U.K.), The Duluth Model is a gendered theory based on feminist beliefs. It contends that men’s violence towards women is based on a sense of entitlement arising from being part of the privileged ‘sex-class’ in a Patriarchy. Moreover, it expands the definition of domestic violence to include all manner of behaviours – from threatening to leave her or commit suicide to displaying weapons to making her feel guilty to making big decisions to giving her an allowance… It’s a mix of both clearly abusive behaviours and behaviours that exist in a very grey area that could conceivably be part of fairly healthy relationships. There is very little room left in Duluth Model theory or indeed the agencies that employ it for male victims of domestic violence, especially where it’s perpetrated by women, and it is a recognised phenomenon to see male victims end up in Duluth-inspired abuser intervention programmes that teach them that their masculinity is problematic. Erin Pizzey (founder of the first U.K. women’s shelter) describes the lead up to such instances using the acronym: DARVO. It stands for ‘Deny, Attack, and Reverse Victim and Offender’, she says that “A particular trait of women abusers when confronted with their behaviour, for example by the police, is to turn the tables on their victim by claiming to be the victim themselves.”… A police force informed by Duluth, of course, is inclined to believe her.\n\nAnd now a new wave of feminism appears to be quickening, with a schism between older third wavers and a new generation. Rene Denfield writes that current feminists “promote a new status for women: that of the victim” while Naomi Wolf laments that a substantial segment of modern feminism is devoted to victimhood. \n\nIn recent decades feminists have successfully promoted the idea of 'Believing the victim,' in cases of alleged violence, harassment or sexual misconduct against women - regardless of available evidence. In the words of Lena Dunham: “Things women don’t lie about: rape.” This subjective reasoning has led to campus rape trials in kangaroo courts across the U.S., Australia and Canada (they’ve been advocated for here in the U.K., but remain to be implemented, although the Varsity student newspaper informs me that they’re under serious consideration here at Cambridge now). They are governed by amateurs with inadequate legal training, who are given licence to assess innocence or guilt with a balance of probabilities standard of adjudication. With this trend we are witnessing a move away from the longstanding legal principle of ‘innocent till proven guilty’ and toward the dangerous principle of ‘guilty till proven innocent’ – paving the way for the systematic ruination of innocent lives. And the current state of affairs is not enough for some feminists who want to see men, not guilty till proven innocent but guilty upon accusation. Julie Lalonde, an “expert” brought into Ottawa University during the hysteria around a rape allegation (that proved false) to tackle the institutions “rape culture” believes that \"Every time we see a high-profile sexual assault trial result in an acquittal, it sends women back 50 years\" [end quote] and Emily Lindin tweeted that “I'm actually not at all concerned about innocent men losing their jobs over false sexual assault/harassment allegations.” \n\nUnder feminist Director of Public Prosecutions, Alison Saunders the U.K.’s Criminal Prosecution Service became embroiled in a scandal wherein targets set for rape and sexual assault prosecutions encouraged police forces to withhold exonerating evidence from courts. Innocent men were incarcerated, that’s a fact – and as a rule, their victimisers have retained anonymity and avoided their own well-deserved sentences for perjury.\n\nThe #MeToo movement has proven itself to be a malevolent witch-hunt, with a body count. A prime example of feminist aggression into the lives of non-feminist men and women who do not need feminism to dictate acceptable behaviour, at best it can only serve to diminish the romance, comedy and beauty (as well as some discomfort and tragedy) – in other words the colour – from our lives. As Camille Paglia pointed out, “Leaving sex to the feminists is like letting your dog vacation at the taxidermist.” At worst it serves to destroy men (professionally, personally, legally, or even totally). In August 2018, Brendan O’Neil counted four suicides as a result of #MeToo allegations – Benny Frederickson, head of a Stockholm arts centre, Carl Sargeant and an unnamed Labour party activist and Jill Messick, a movie producer, who killed herself as a result of harassment she received for defending Harvey Weinstein. Since then I have counted another four: Swaroop Raj, a Noida technician from India, American skating champion John Coughlin, Arghya Basu, filmmaker, and Armando Vega Gil, Mexican rockstar, who committed suicide after an anonymous woman claimed that he told her he would like to teach her to kiss when she was 13 and he was 50. I have no doubt that there are many that we have missed.   \nAnd the climate of everyday misandry pouring forth from feminists is relentless, Suzanna Danuta Walters asked “Why Can’t We Hate Men?... We have every right to hate you.”, a segment on ABC’S ‘Tonightly with Tom Ballard’ programme featured women sarcastically “thanking” men – in general – for drugging and raping women, Laurie Penny announced (in response to the Capital Gazette massacre) that “We must not allow our society to be held hostage to white male fragility any longer” and Barack Obama complained that “Men have been getting on my nerves lately... I just think brothers, what’s wrong with you guys? What’s wrong with us? I mean we’re violent, we’re bullying...”. Chidera Eggerue aka The Slumflower tweeted that “If men are committing suicide because they can’t cry, how’s it my concern?” Most fourth wave feminists though like to cover their misandry with platitudes about wanting to liberate men from the toxic expectations society places on them. They live in this alternate reality wherein uninhibited male aggression and violence are pardoned by the mantra “boys will be boys” and wherein “violence as a means of defending [pride] is glamorized.” Fourth wave feminists are unconcerned with truth however, their goal is power. The power to penalise the most successful men in order to privilege women (quotas and other forms of discrimination) and the power to demonise men collectively in order to defend and extend the ability of women to destroy men in general – along with the power to silence any men or women that dare to oppose their baseless narratives.\n\nRegardless of whether a behaviour is innocuous or women engage in equivalent behaviour, if a man does anything, feminists oppose it. In the last few years, snappy feminist portmanteaus such as manspreading, mansplaining and manteruppting have proliferated and become ubiquitous in their use. The aim is to shame, silence and bludgeon men into compliance. \n\nMasculinity as a whole is utterly vilified and demonized in our societies. The endeavour can begin at school, intensifies in university – and in the workplace increasingly, and reaches a tragic crescendo in family courts where men are denied access to their children who would bring such critically important meaning to their lives and be the ultimate expression of their masculinity. There is a gender justice gap for those convicted of crimes. Sex discrimination in the U.K. criminal justice system has a long history: e.g. flogging as a punishment for female criminals was banned in 1820 but continued for men until 1967 – that’s 147 years! Presently, men account for around 95% of the total prison population despite only committing 3.4 times more crimes than women. Factors that explain this disparity include: a greater percentage of convicted men being sentenced to prison, men being given longer sentences on average than women, women being paroled earlier than men (despite being more likely to be disciplined for bad behaviour whilst incarcerated) and women being more likely to have mitigating factors (such as age, dependents, lack of previous relevant convictions and the appearance of genuine remorse) applied to their sentences. And yet, feminist activists (such as Women in Prisons, Baroness Corston and Julie Bindel) have committed themselves to widening the gender justice gap – enabled by sentimental authorities. Our Tory government has committed itself to taking a rehabilitative approach when dealing with women offenders, which I think is great, but the voices of our male offenders (as well as the experts on effective justice) are utterly ignored when they raise the question: “What about the men?” \n\nThe cultural obsession with the gender pay gap is being driven by disingenuous authoritarian feminists with no regard for personal choice, meritocracy or human well-being. The focus is exclusively on the mythical glass-ceiling with no interest paid to the fate of those men employed in the glass-cellar dangerous and dirty jobs that women don’t want, who are increasingly at risk of unemployment due to automation, and/or the ever-present risks of workplace injury and death. Quotas are being used by many organisations which discriminate against men, sometimes caucasian men specifically. This is not only immoral in that it unfairly disadvantages individuals but also frankly stupid with the potential to impair the functioning of sectors rejecting meritocracy and therefore the economy and society in general. Moreover, the clunky way in which the government has demanded that businesses publish their “gender pay gap statistics” may ultimately lead to men being chosen over women for the kind of minimum wage jobs that very few do out of choice. “Equal pay” is being acquired for women performing even dissimilar roles to male counterparts, regardless of relevant facts such as: whether they work fewer hours. For example, the BBC’s former China editor Carrie Gracie was awarded £280,000 in back pay to bring her earnings in line with Jon Sopel, the North America editor, despite the fact that his job was more intensive and he was on air significantly more than her. She has donated her pay-out to The Fawcett Society. There are also several battles raging to secure equal pay for (mainly female) supermarket store workers as (mainly male) warehouse workers. An Asda spokesman clarified (in response to coverage consistently suggesting otherwise) that ““At Asda, hourly paid colleagues doing the same job in the same location are paid the same. Men and women doing the same job in our retail stores are paid the same. Men and women doing the same job in our distribution centres are paid the same. Pay rates in stores differ from pay rates in distribution centres for legitimate reasons” [end quote]. Differences in comfort, exertion and safety in the roles have been labelled entirely illegitimate reasons to offer different levels of pay to workers in the coverage of the stories, and the Court of Appeal agreed earlier this year and ruled against Asda.\n\nNow, the U.K. is facing the extension of hate crime legislation to include the charge of misogyny. In line with current hate crime legislation, the charge will require no evidence of hateful motivations but rather be governed by the perception of the victim or any witnesses involved. This shameful waste of police time will offer another avenue for malicious women to use the law to harm innocent men; as well as diverting precious resources from the fight against actual crime. And do not think that these “crimes” will not be acted upon by sensible officers, a perception of indifference from the police in such instances will be treated (as it is with current hate crimes) as “secondary victimisation”, with Greater Manchester Police clarifying that action will be taken against police accused of indifference towards “victims” and “whether or not it is reasonable for them to perceive it that way is immaterial” [end quote]. \n\nIn the interests of nuance, I accept that there have been and are individuals who identify as feminist who don’t fit into the negative description of the movement that I’ve just given. There are feminists who want equal rights for men and women, equal treatment, choices, opportunities. Feminists who have compassion for men and value them. But what impact have they really had on the trajectory and achievements of the movement? They’ve been marginalised heretics pleading intelligently and rationally but essentially ineffectually with their hysterical peers. While their hysterical peers have been lobbying our institutions irresponsibly and illogically but consistently successfully for policies and procedures that are damaging our societies.  \n\nFeminism, though once it was at least partially in practice, is now “progressive” in name only. Feminists don’t look around at our wonderful civilisation with gratitude and awe and want only to extend and protect the liberal values that have brought us here. Feminists look at our civilisation with anger and malice and want to burn it to the ground, rending our liberal values assunder, and to remake it in their own image. And feminists understand that “Power is in tearing human minds to pieces and putting them together again in shapes of your own choosing”, as Orwell explained through O’Brien in 1984, that’s why the epicentre of feminist indoctrination is in the education system where young and malleable minds proliferate to be manipulated by feminist historiography. Thankfully, we non-feminist women and men are studying and expressing our findings and more and more individuals are learning to see through the feminist narrative. I look forward to a post-feminist future.",
    "title": "History of feminism the way they don't want us to know!",
    "subreddit": "MensRights",
    "timestamp": 1558867022,
    "score": 387,
    "keyword": "black director"
  },
  {
    "text": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired. Please note, i tried to post this in unpopular opinions and it got flagged as a political post.  Meaning I could only post it in the weekly political thread.  I wanted it to be seen, so I decided to post it here as well.\n\nNetflix and LinkedIn have recently hired Inclusion and Diversity Directors.  To me this shows that from now on these companies will try their best to elevate Women, POC and Minorities just because society classifies them as the oppressed classes. I see little evidence against this in terms of the popular beliefs of our society.\n\nIt can be easily shown that Netflix and LinkedIn are Liberal companies and Liberal companies tend to over extend when it comes to helping Women, POC and Minorities.  Now don't get me wrong, those previously mention groups have all had a hell of a hard time in western society and anyone who starts on a lower starting level deserves help.  But hiring Inclusion and Diversity Directors to help these \"oppressed\" groups is an extremely biased way of allowing those who do not need help an extra advantage they may have not deserved/required.  Every group of people has there privileges and hardships.  One of the biggest differences is the socialeconomic status of individuals.  The socialeconomic status is the single greatest privilege anyone can have in society.  Every group of people has poor individuals and those people need help.  But all Women, POC and Minorities do not need help before Caucasians, Men or Caucasian Men.  We are a mix of people and we all need help, some of us more then others, but being born as the historically oppressed class does not guarantee you need help.  Being born in the lowest social economic bracket nearly guarantees you will need help to reach you max potential.\n\nLiberal companies and governments have shown that they believe Women, POC and Minorities need extra help to decrease the divide in representation.  Yes diversity is great, but diversity comes in much more then the cover on each of our individual books (Race, Gender, Religious Beliefs, Sexual Orientation, etc.) .  As an example when 80% of people applying to a job are of the majority already employed.  Statistically 80% of those hired in those positions should fall into the majority.  Just look at Waste Disposal Jobs, Construction Jobs, Nursing, Teaching, Engineering or Human Resources.  Each of these careers have a wide divide in the groups who are work in the fields but still see the same divide in those hires.  Meaning pushing for Inclusion and Diversity shouldn't guarantee these divides shrink (maybe not noticeably).  But yet serve to drive Caucasian Men or any mix of, out of the careers they are the majority and increase the divide in the careers Women, POC minorities already dominate against Caucasian Men or any mix of.\n\nI am 100% for equality, but I believe the current path we are on is not the way of getting there.  I definitely believe hiring a Inclusion and Diversity Director can only mean bias towards Caucasians, Men or Caucasian Men.  Diversity means many things,  you cannot judge a book by its cover and say that is diversity.  Every individual is different and diverse.  We need to balance out society to an extent, but a free equal society is one where people can choose the life and careers they want the most.  With this means areas of our society will have careers that have minimal visual diversity. Humans have stereotypes, these stereotypes don't define what groups we need to fall into but statistically define where we are most likely to lie.\n\nNote: As a shallower example, both Inclusion and Diversity Directors are Black Females.  This is a very small sample size and can't show bias but it doesn't help to disprove me point.",
    "title": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired.",
    "subreddit": "MensRights",
    "timestamp": 1556675287,
    "score": 43,
    "keyword": "black director"
  },
  {
    "text": "Masculinity under siege in schools, politics, online | Article in The Australian newspaper outlines the feminist war on men &#x200B;\n\n# Masculinity under siege in schools, politics, online📷[KEVIN DONNELLY](https://www.theaustralian.com.au/author/Kevin+Donnelly)\n\n* 12:00AM JUNE 28, 2019\n* [206 *COMMENTS*](https://www.theaustralian.com.au/commentary/masculinity-under-siege-in-schools-politics-online/news-story/7d0c3c50317c07b2198136f95c593bd7)\n\nIs there a crisis in masculinity? Based on an article by the American Jordan Black, “Masculinity in Menopause: The Emasculating Effects of Fatherlessness and Feminism”, the answer is yes.\n\nBlack highlights how, across the Western world, falling levels of testosterone and low sperm counts are contributing to significant changes in how masculinity is defined. Add the impact of so many boys raised without fathers and the global #MeToo movement that gives the impression that all men are inherently violent and misogynist, and it should not surprise that Black concludes: “We are not making men like we used to; in fact, we are not making them at all.”\n\nThe same is happening here, where similar forces are at work undermining masculinity and radically redefining what constitutes manhood. As Bettina Arndt says in her book *#MenToo*, men are unfairly demonised and attacked by radical feminists more intent on winning gender wars than peacefully coexisting.\n\nEven to suggest men’s rights are being undermined is to incur the wrath of the sisterhood. Victorian Women’s Trust executive director Mary Crooks wrote this week in Nine’s *The Age* and *The Sydney Morning Herald* newspapers: “Men’s ‘rights’ are about treating women as inferior; objectifying them by denying them any personhood. Men’s ‘rights’ are about being able to stalk, harass or abuse women online, on the streets, in the home or at work.”\n\nAnother example of this fatwa against men is how every time a woman is attacked or murdered the response is to blame all men and to suggest that violence occurs only because society is patriarchal and misogynist.\n\nAfter last month’s horrendous murder of Courtney Herron in a Melbourne park late at night, Victorian Premier Daniel Andrews said women travelling alone should be safe regardless of where they were or what the hour, and that crimes such as this were “most likely about the behaviour of men”.\n\nVictoria Police Assistant Commissioner Luke Cornelius mirrored the Premier’s views. He said: “This is about men’s behaviour. It’s not about women’s behaviour” — implying that, instead of the act being perpetrated by one demented evil soul, all men were implicated.\n\nWhen detailing the death of masculinity, Black also says the US education system is guilty of “encouraging feminine behaviour for both genders”.\n\nFeminist Camille Paglia makes the same point when she bemoans “the plight of physically active boys in a public school system dominated by female teachers”.\n\nThe Australian school system also disadvantages boys as a result of the feminisation of the curriculum. Research suggests boys, compared with girls, need greater structure and discipline to learn, especially in relation to learning to read, where the absence of a phonics and phonemic awareness approach puts them at risk.\n\nToday’s approach to education is more about “care, share and grow”, where teachers facilitate and students self-direct, manage their own learning and where competition is shunned. It’s an approach that favours girls.\n\nNot surprisingly, girls out­perform boys in reading as measured by the National Assessment Program — Literacy and Numeracy, and achieve stronger Year 12 results as measured by the Australian Tertiary Admission Rank. It’s also true that material such as the gender-fluidity Safe Schools program and the Respectful Relationships program being implemented in Australia disadvantage boys, as both present a negative and biased view of masculinity and manhood.\n\nThe view of boys and men presented is one that implies masculinity is inherently violent against women and that Western societies such as ours are patriarchal ones in which women are ­oppressed and treated as second-class citizens.\n\nVictoria’s Royal Commission into Family Violence reported that 25 per cent of family violence victims were men but the Respectful Relationships program implies it is only women who are at risk.\n\nStudents also are never told that such is the way the law now operates that men often are assumed to be the guilty party.\n\nAnother example of how the curriculum has been feminised is the way school programs present traditional male characteristics such as fortitude, courage, physical strength and mateship as negatives instead of being worthwhile.\n\nEven worse, many schools ban physically active and risky playground activities and behaviour, and it’s not unusual for primary schools to ban boys wearing ­superhero costumes on the basis that play-acting reinforces ­negative and potentially violent behaviour.\n\nMore radical feminists go as far as saying traditional male qualities lead to what *The Age* journalist Anna Prytz describes as a “man box”, a situation where men are constrained because they mistakenly believe they should be “unemotional, hyper-sexual, physically tough, stoic and in ­control”.\n\nInstead of accepting the feminist argument that the characteristics that typically define men are toxic, Black argues in favour of what he describes as “virtuous masculinity”. Paglia makes a similar point, arguing that feminists guilty of misandry should learn to respect and admire positive masculine qualities.\n\n*Kevin Donnelly is a senior research fellow at the Australian Catholic University.*",
    "title": "Masculinity under siege in schools, politics, online | Article in The Australian newspaper outlines the feminist war on men",
    "subreddit": "MensRights",
    "timestamp": 1561738940,
    "score": 28,
    "keyword": "black director"
  },
  {
    "text": "At DECA today Deca is a High School business case competition. I was a judge today.\n\nDECA requires business attire, and has a specified dress code. For men, it is dress shirts and dress pants. Ties and blazers are optional, but the later is strongly recommended.\n\nFor women, it is a dress shirt / sweater / blouse / + dress pant / skirt or a business dress. Tops cannot be sleeveless, backless, show cleavage or midriff. Skirts / dresses cannot be shorter than one inch above knees. Blazers are optional but strictly recommended.\n\nSome observations\n\n1. Most Men are in full suits\n\n2. Most women are also in full suits. Teenage women are easily able to abide by dress codes, it is working women who somehow cannot and make stupid excuses on why they should be able to dress how they like, even if men wear suits.\n\n3. The DECA dress code is an excellent office dress code\n\n4. Most women in my previous years judging tended to wear shorter skirts. I deducted points, and some series directors did, but usually they get away with it. One of the other judges was criticizing the skirt length rule, saying how \"women get a bad rep\" and that it is just legs, a girl can show them if they have them. I replied that men don't wear shorts, and she said that \"it is not the same thing, this is a power suit\"\n\n5. This time many women seemed to think that black denim pants qualify as dress pants.\n\n6. Women still dress up generally in DECA; so offices can easily bring in equitable dress codes",
    "title": "At DECA today",
    "subreddit": "MensRights",
    "timestamp": 1572746451,
    "score": 18,
    "keyword": "black director"
  },
  {
    "text": "Discrimination against men at a British University Dear student,\n \nWe are contacting you about an exciting opportunity to become a mentee on the Beyond Barriers Student Mentoring scheme. This will give you the chance to receive 6 months of 1-1 mentoring from an experienced business professional to help you to develop skills, increase your confidence and maximise your potential. Further details are in the attached flyer. Please apply by Sunday 20th October to register and guarantee your place. \n \nTo apply please visit the following link to fill in the online application form:\nhttps://mentoring.kingston.ac.uk/student-scheme/\n \nPlease note: You must fit at least one of the criteria listed below in order to apply*:\n \nBlack and ethnic minority students\nCommuter students\nFemale science, engineering, technology, maths and built environment students\nKU Cares students\nLGBT+ students\nMature students\nStudent parents\nStudents with a disability or learning difference\nStudents who are the first in their family to attend higher education\n \n(* The scheme is open to 2nd Year, 3rd Year and Postgraduate students. There is no charge for participation)\n \nPlease also read and make sure you are happy with the mentoring expectations (Step 1 of the application form) before you apply.\n \nNote: If you have already submitted your application please kindly disregard this email.\n \nIf you have any questions, please do not hesitate to contact us.\n \nBest wishes\nThe Beyond Barriers Team\n \n \nBeyond Barriers Mentoring\nAccess, Participation & Inclusion – Directorate for Student Achievement\nT + 44 (0)20 8417 4038\nE beyondbarriers@kingston.ac.uk\nwww.kingston.ac.uk\nKingston University I Penrhyn Road I  Kingston upon Thames  I Surrey I KT1 2EE",
    "title": "Discrimination against men at a British University",
    "subreddit": "MensRights",
    "timestamp": 1569512316,
    "score": 17,
    "keyword": "black director"
  },
  {
    "text": "Red Pill Nation Hangout #79  \n\nRed Pill Nation Hangout #79\n\nTonights Topics\n\n1. Megan Rapinoe’s sanctimonious acting after USA World Cup win\n2. Activist attempts to storm ICE compound\n3. Jeffrey Epstein arrested\n4. Social Media conference in Washington DC\n5. 007 will now be a Black Woman\n6. Terminator Director insults the fans\n7. Belle Delphine Predatory Capitalism\n\n[https://www.youtube.com/watch?v=cUmUkdD\\_kTU](https://www.youtube.com/watch?v=cUmUkdD_kTU)",
    "title": "Red Pill Nation Hangout #79",
    "subreddit": "MensRights",
    "timestamp": 1563691209,
    "score": 6,
    "keyword": "black director"
  }
]