[
  {
    "text": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2] Hey r/jobs, it's me again, coming at you with all of the resume advice you could ever need, and more! I posted all of my resume tips and tricks a couple of months back, which led me to receiving an amazingly overwhelming amount of comments (THANK YOU!) and I wanted to clear up some things, and include some things I missed in my last post. I've put all of this advice in order so it's easy to find the info you need when you need it.\n\nTo introduce myself, my name is Holly, and I am an experienced resume writer and editor located in North America. Essentially, I love helping people make their resume the best it can be, and I often help out in the r/jobs discord, and a tech workers slack channel, giving free advice as often as I am able to.\n\nResume writing and editing has been a part time hobby/job for me since 2017. I work full time as a senior account manager in tech, plus I have a bunch of hobbies outside of work, so I give my time where I can, which is unfortunately not as much as it used to be. I guess that's why I've written these posts, because I can no longer help as many people as I used to, and hopefully this way it can assist hundreds or even thousands of people!\n\n***DISCLAIMER: Many of these tips are North America specific,*** ***and some/many don't apply to creative fields like designers/marketing resumes.*** *Also some of these are for people working in the corporate world and don't apply to food service or retail jobs.* ***Of course, some of these won't apply to you specifically, so use your common sense to take what is useful to you.***\n\n~\n\n# CONTACT INFORMATION AND TOP OF PAGE\n\n* **Contact details** \\- at the top when of your resume under or next to your name, you need to include the following things: your location (if you're willing to relocate to the area the job is in, put the jobs city in and not your current location) email address, and your LinkedIn profile. Phone number isn't essential, so include it or don't, it's fine. Other optional things to include - if you have a portfolio or GitHub, definitely include them. Don't paste them as a messy link, instead write \"GitHub\" and turn it into a hyperlink.\n* **Location:** Are you located in San Francisco, California, applying to jobs in your city, and/or remote? Write \"San Francisco, CA\".\n* **Location:** Are you in San Fran, but open to relocation, AT THEIR EXPENSE? Write \"San Francisco, CA (open to relocation)\".\n* **Location:** Are you in San Francisco currently, but you're willing to move **before** starting a new job to New York AT YOUR OWN EXPENSE, where your dream job is located? Or you've already planned to move to New York and you're only applying to roles there? Put your location as \"New York, NY\". Why? Because you're moving there on your own cost prior to starting work, at your own expense.  If it comes up in the interview, tell them the truth. \"This is my dream job and I'm planning to move prior to starting if I'm successful\", or \"I'm moving to New York on X-date - which is prior to the start date of this job - and everything is already organized, which is why I have my location listed as New York rather than San Francisco.\"\n   * If you want them to pay for your relocation fees, then use the (open to relocation) that I wrote above.\n* **DO NOT INCLUDE YOUR FULL ADDRESS IF YOU'RE IN NORTH AMERICA** \\- only include your City and State/Province, and use one of the above depending on your circumstances.\n* **Contact details (what not to include)** \\- don't include the word PHONE before your phone number, or EMAIL before your email address. They are not necessary. People know what a phone and email look like. You're just taking up space for no reason. Also don't include your social media accounts except for LinkedIn (unless they are professional accounts for marketing/design/media positions of course, etc.).\n* **LinkedIn link and info:** Make sure your LinkedIn profile link is customized. You can get a custom LinkedIn link from your LinkedIn profile on the right hand side at the top right, click on \"Edit public profile and URL\". Make sure your custom LI link includes your name and not just a bunch of random numbers. Be creative. Are you a John Smith and you're located in Texas? Maybe your custom link could be smith.john.tx or johnsmith.tx, or include your middle initial. Play around with it until you get the perfect LI custom link. When including your LinkedIn link on your profile, instead of including the whole URL, only include the last bit (for example, **in/johnsmith**) - and lastly, make sure you include the hyperlink on your resume so that people can click it while viewing your resume.\n* Do the same as above with GitHub or any other professional links you're including on your resume. Make it a hyperlink so you're not including some messy link that's killing the \"feng shui\" of your resume.\n* **DO NOT INCLUDE A PHOTO OF YOURSELF IF YOU'RE APPLYING TO JOBS IN NORTH AMERICA.** Companies have to prove that their hiring processes isn't based on race, gender, age, appearance, etc. Including a picture in NA can actually get your resume thrown out entirely. I know LinkedIn profiles include your profile picture, which is weird that we're just okay with this, but not with pictures on resumes, but here we are. Hey, I don't make up the rules, I merely abide by them and am here to ensure your resume is, *\\*chefs kiss\\**, perfectly formatted.\n* **Summary/Objective - to add or not to add?** I only recommend adding one if you're making a career move/change, and applying for jobs that aren't in your career ladder. The other alternative is if you've been out of your industry for a while, either studying or working in a completely different field, or if you took a break and need to explain the gap in work. I believe a summary should be no longer than 5 lines of the page maximum, which is typically around 3-4 sentences. You don't need a summary if you're looking for jobs on your current career ladder and don't have any gaps on your resume.\n\n# HOW TO ORGANIZE YOUR RESUME (IN ORDER)\n\n* If you HAVE had relevant experience since your education, then put your professional experience first. DO NOT INCLUDE YOUR HIGH SCHOOL EDUCATION (unless you're still in high school, or are looking for your first or second job out of highschool, or if you don't have university to add to it and you have less than 2 years of work experience). So it would go like:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it) 3. Experience 4. Education & Certifications 5. Projects (if you have any you want to add, and the space to add them, or simply link to your GitHub or LinkedIn and list them there) 6. Skills 7. Volunteering - if it's going to assist with your current career, or if you have the space for it 8. Languages spoken (only add this if you speak more than one language fluently) 9. Interests (if you have the space and want to add them)\n* If you HAVEN'T had relevant experience and your education was in the past 1-3 years and it's relevant to your job, then:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it - I do recommend it here to explain the direction you're heading) 3. Education & Certifications 4. Projects (if you have any) 5. Skills 6. Volunteering (if you have any) 7. Languages spoken (only add this if you speak more than one language fluently) 8. Interests\n* Basically, just put the best most recent and relevant info at the top that relates to the jobs you're applying to, and mark it in order from there.\n\n# ONE PAGE OR TWO?\n\nAh I love this question, people get so heated about it haha! There's a lot of variables and a lot of opinions on this, so let's get into it...\n\n* FIRST THINGS FIRST - If you're going to go to 2 pages, for the love of the flying spaghetti monster, DO NOT, I REPEAT DO NOT have it as less than 1.5 pages. If you're commiting to 2 pages, USE THE SECOND PAGE. Beef up some bullet points, make some of the text or the lines larger, whatever you need to do if you're absolutely convinced it will not fit on one page. Otherwise, REDUCE that bad boy to 1 page. Nothing quite grinds my gears as much as seeing an 8th of the second page being used. IT LOOKS AWFUL, REALLY REALLY AWFUL. Thanks for letting me get that off my chest.\n* Unless you're in senior management, your resume (for North American applicants anyway) should be one page ideally, two pages max if you have over 10 years of RELEVANT experience, but in saying that...\n* Do you have LESS than 10 years of university and work experience combined, and you're NOT in a high up VP/Director position? You are likely best to go with one page.\n* No education after highschool, but you've got 10 years or less of really amazing experience, but not in a higher up position? You are likely best to go with one page.\n* Do you have LESS than 10 years of university and work experience combined but you also have a few AMAZING projects you worked on separately, and you've done relevant volunteer work, and your resume is actually kind of incredible? Then hell yeah, go for 2 pages! Brag all you want and show them why they need to hire you!\n* I could go on. Just one page or two, either way, ensure you use the full page if you've got it, I hate seeing only 1.5 pages or less. Either bring it closer to 2, or bring it down to 1.\n* **\"What about 3 pages, or 4, or 5? I have so many jobs and I'm awesome and want to show them!\" In North America, NO, GET OUT OF HERE, ABSOLUTELY NOT!** They won't see it as \"Wow this person is amazing\", they will see it as \"Oh wow this person doesn't know how to write a resume, and this is way too long for me to bother to read\" and they'll delete it. In other parts of the world? Sure. I know some countries like the UK for instance that want a full CV (they are different from resumes, as they list every single job, achievement, certification, volunteer experience, and more) that are often 3+ pages long. Well, my advice isn't for UK resumes, because that's not my specialty. I'm just saying that 2 is the max for North America.\n* Need to find extra space on your resume to reduce it down to 1 or 2 pages? **Use narrow margins.**\n* **SO ONE PAGE OR TWO?** Honestly, either is fine if you're using the space efficiently, and aren't writing giant bullet points and paragraphs. ***If you're unsure, go for one page.***\n\n# GENERAL FORMATTING\n\n* **Make sure EVERYTHING is uniform**. If most of your dates are 3 letters only, like Jun 2016 - Oct 2020, then they ALL need to be the same. Yes, even the months of June and July with just one more letter. It looks much neater. Ensure you double check the spacing is correct too, for example, the most common error I see on resumes is some dates having a space and then a hyphen, and then no space before the next date (example Jan 2019 -Jun 2020 and then Jul 2020-Feb 2022, then Apr 2022 - Present) - this is a very small issue, but it shows you do not have attention to detail. Whichever format you choose for one, ensure they ALL follow the same format.\n* Double check if something is bolded, or underlined (like a title or date or company name), ensure that all the others are in the same format.\n* Is the font the same for each section? It's fine if you're using different fonts on your resume, but ensure that each section is the same. For example, if one job with all the bullet points are Times New Roman, then all jobs needs to be in Times New Roman. If one section header is Garamond, and the next section header is Times New Roman, it shows you don't have the attention to detail.\n* **Remember, your resume needs to be PERFECT. You seriously need to go through each line by line with a fine tooth comb.** Imagine not securing an interview with your dream job because of a few silly spelling mistakes or poor formatting. \"Well I didn't want that job anyway\"... yeah you did. It can be a hard pill to swallow and it's easy to make light of it, but you never know who is the one deciding on the yes or no pile and where yours will land.\n* **Ensure all line breaks are the same size**. If one blank line in between 2 paragraphs is size 7, and then the next blank line between paragraphs is size 11, it's a very noticeable detail to those looking at your resume.\n* **For your paragraphs and bullet points, use the \"justify\" align**. It removes a bit of the white space and brings your text fully to the right of the page. It's much neater and removes the jagged look of left align. The exception to this (as there usually are) is if none of your bullet points are longer than one line. I like justify align on a summary/objective if you're adding one, and on bullet points or any paragraphs that are 2 lines or longer. Play around with it and see what works best for your resume.\n* **DON'T WASTE AN ENTIRE LINE ON A HANDFUL OF WORDS!** I often see people when writing their bullet points taking up less than half a line, or only a couple of words on the 2nd or 3rd line. Not only does this create a lot of white space, but it's also selling yourself short. You have one, maybe two pages to sell the sh!t out of yourself. Make every single line of your page count. Make sure every single line of your bullet points is at least halfway across the page or more. Either beef up that bullet point, or condense it.\n* **5 bullet points max per job** (of course there are exceptions, but this is as a general rule). The older the job, the less bullet points. A job from 10 years ago will only require 1-3 bullet points (and only if it's relevant to your current career. Really think hard about whether to include it on your resume or not. Remember, all your jobs are on LinkedIn, not everything needs to go on your resume... again, North American advice).\n* **Use a different verb at the start of each bullet point.** I roll my eyes when I see the same word repeated multiple times as the first word in bullet points. Instead of just using the word managed, use words like Coordinated / Directed / Orchestrated / Oversaw / Spearheaded. There's a great article written by the Muse, you can find it here: [https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome](https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome). If you work in a field with specific wording, like Nursing for example, then google \"Nursing resume verbs\" or something like that. Put the work in to your research for your resume wording and you'll reap the rewards.\n* **DO NOT USE COLUMNS** (unless you're in a creative field like a designer, or your resume is being handed to someone in person) - Columns do not play nicely with ATS (AI resume reading software) and as the majority of companies now rely on ATS to quickly read resumes, you're shooting yourself in the foot by using columns or any other weird formatting.\n* Each bullet point should not be paragraphs long. Each bullet point should be 1-2 lines long only on the page, 3 maximum.\n* Each job should take up no more than 1/4 of the page, unless you've only had one or two jobs, or are more senior. Or in another unit of measurement, no more than 11 or 12 lines of the page. The more recent the role, and the more impressive the tasks, the more bullet points there should be, but don't just include the job description which leads me onto my next point...\n* Reiterating that each job should only include the achievements from that job, and only the most impressive things you achieved should be listed. Include KPIs, processes you implemented, articles you wrote, dollar amounts of your biggest sales or averages, include numbers of accounts you managed, or how many calls you took each day, if you went over your OTE what was the percentage, etc. It shouldn't read as a job description, you need to sell yourself and show them what you're capable of! (disclaimer - unless your jobs are more entry level or food service etc, then job descriptions are likely the norm).\n* Don't include irrelevant jobs/projects. If you worked at Starbucks for 6 months 5 years back, and you've had relevant experience in your field after that, then remove the Starbucks (or whatever other unrelated jobs you have) from your resume. Your resume should be tailored to the jobs you're applying for! To give you some more reference, I have been working since 2003, and my resume only has jobs from 2014 onwards.\n* **Try to have your dates on the right hand side of the page, and your position and company on the left (list the position first, then the company next to it or below it).** It's the standard, and makes the person reading your resume find the info much more quickly. Trying to make your resume too unique (again, unless you have a creative job then ignore this) will only hurt your chances of it being taken seriously. Of course you want to make it look nice, but try to follow the standard format where possible so it's easy to read.\n\n# SKILLS & INTERESTS\n\n* **Put your technical/software/program skills in one line**, separated by commas or | lines | like | these. Putting a single skill on each line is a waste of space, and will create too much white space. Your resume should be concise, to the point and get everything across in as little space as possible.\n* **Don't use the \"slider\" scales for your proficiency in various skills.** Why? Well, firstly, if the hiring manager wants to know your level in each, they will ask. And secondly, the dots or slider scales aren't measurable and take up extra wasted space that again is not going work well with ATS. Instead, as I mentioned above, list your skills and programs/software etc. in a line separated by commas | or | these | lines. Don't include software that you used 10 years ago and never progressed past a beginner level, but list pretty much everything else within reason. Most things you'll pick back up quickly even if it was 5 years ago, provided you were semi-decent with your knowledge of it.\n* What about interpersonal skills? Should you add them? I highly recommend adding them into your bullet points, rather than listing them separately. In saying that, though, there's going to be some industries, or some skills, that require them listed separately. If you're listing them separately, first ensure that you actually need them on the resume, and which ones are necessary and which ones can be removed if any. If you're still adament you want to list them separately, then put them in the same format as your technical/software skills as I listed above, either separating each with the | lines | like | these, or with commas, one on line. And that line needs to go below the hard/tech/software skills, not before, and ideally not together.\n* **Languages:** In North America, only list a languages section if you speak more than one language. Always list English first as this is a job requirement every time, and then other languages after that. If you're fluent in English, a native in Spanish, fluent in French, and have intermediate German, I would list it as such:\n   * \"Languages: Fluent in English, Spanish and French, intermediate in German.\"\n* **Interests - should you add them or not?** It's a highly debated topic and everyone will have a different view on this. I personally believe that you should include them. For example, I ride motorcycles and love stand up comedy shows, am coffee obsessed and love my local lacrosse team. Almost every single interview I land, my interests are brought up, with the interviewer connecting with one or more of my interests, or asking me more about them. It's a great conversation starter, and it makes you more than just an applicant, they will remember you as the person who they discussed their favourite sports team with, or the person who recommended them an amazing cafe that they've now added to their list. INTERESTS WILL MAKE YOU STAND OUT, I guarantee it. **Obviously, it can be negative depending on what you write, so be REALLY selective of what you include in your interests** (for example, don't include things like Anime or Manga, or the shooting range, or reading Holocaust novels, or your weapons collection, or anything political or religious, or anything you don't want to discuss during an interview - KEEP IT LIGHTHEARTED). I would make your interests 1 or 2 lines maximum on your resume, and don't go into detail (just list them out - for example, my interests on my resume are listed as \"Interests: Motorcycles, Warriors lacrosse, console and PC games, comedy shows, arcades, & searching for the perfect espresso.\") So basically, include them if you want, but if you do include them, make sure they aren't negative or controversial topics if it's brought up in an interview.\n\n# AVOID COMMON MISTAKES\n\n* \"References available upon request\" or adding references to your resume, is a BIG no no for North American resumes. Why? Because 1. it's assumed that you have references available on request, so including that is unnecessary, and 2. You don't want the company contacting your references if you've listed them, PRIOR to letting your bosses know, which is usually after you've received an offer, and 3. You don't want your references, whom have so kindly agreed to be one for you, getting inundated with calls or emails from the companies you're applying to, prior to the offer stage. Imagine applying to 50 companies, and all 50 call your references. Ouch. They won't be your reference for much longer.\n* Is your job across two pages? Nope, that's not going to work! I hate when I see a jobs bullet points going onto the next page. In my opinion, it's messy and just says \"poor formatting\".\n* **DO NOT MAKE YOUR RESUME TOO FLASHY! STOP WITH THE COLOURED TEXT!!** (this applies to non-design resumes only) Black text ONLY, with the exception of your name, contact information and section headers. You can put those in a colour other than black for a tiny bit of a \"pop\", but nothing overly in your face like red or bright pink. I personally use a dark blue, or dark green, or dark purple for the contact info and headers - DO NOT USE LIGHT COLOURS if you're going to use any at all. But objective/experience/skills/education etc, all the actual sections (not section headers) must be black text ONLY.\n* You absolutely should not have any images, and there should NOT be any background colour or background images whatsoever.\n* Do not use tables on your resume. That won't pass ATS and it looks pretty bad honestly.\n* Don't include a paragraph at the end along the lines of \"thanks for your time, please call me on 555-123-4567 if you have any questions or would like to set up an interview\". This isn't a cover letter. And even if it was, don't include your phone numebr or email in the cover letter body, that should be included with your contact details at the top of your cover letter, which should match the same format of your resume.\n* If you're going onto a second page, include the exact same name and contact information format as you have on your first (and other pages if outside of the US where more than 2 pages is common).\n\n# FINAL STEPS - SENDING YOUR RESUME\n\n* **NAMING YOUR RESUME:** And I'm not talking about naming him Resume McResumeface. Your resume name should be \"Firstname Lastname Resume\". Don't include the job title on there, or any periods, underscores, or any other information. \"J\\_Smith Customer Support Rep. Resume V2 Final\" is everything wrong with a resume title. I hear you asking, \"But holly948, how do I have multiple resumes then for the different jobs I'm applying to?\".\n* **ALWAYS SEND YOUR RESUME AS A PDF DOCUMENT!!** If you send it through as a Word document, their computer could mess with the formatting and it could ruin the perfect look of your resume. PDF will ensure they view it exactly how you have designed it to look. Sending through as a Word doc could ruin all of the hard work you put into the formatting. Devastating!\n\n# COVER LETTERS\n\nI'm sorry that's not my area, and I loath cover letters with a passion. Write them or don't, whatever. I personally never write cover letters as I find they are a waste of my time.\n\n# AKSHUALLY...\n\nLastly, I hear many of you about to furiously get into the comments with \"but my experience was...\" and \"in my opinion, you should...\", and \"actually, I think...\" and I get it! There is no \"one perfect way\" and everyone has different opinions. **This entire write up is in MY opinion and MY experience.** I'm not saying don't comment, just, please take this post as my opinion rather than \"it must be done exactly how I say or else you're never getting a job and your resume sucks\". Do whatever you want, man. Different things work for different companies and industries. This is my own general advice, and I know with resumes there is no \"one size fits all\". No two resumes I do are the same, because it comes down to the individuals experience, education, interests, what they're applying to and so many other factors. I'm just giving free advice from my own experience, in my own opinion, to serve the majority of people updating their resumes (primarily in North America).\n\n\\~\n\n**TL;DR** \\- **if you want to improve your resume, then I've given you everything you need minus the template.** **However, I'm doing up a template at the moment, and will share with you all, hopefully this weekend.** I want to give you all of the tools you need to succeed.\n\n*Enjoyed my advice from this post and/or the last? You can buy me a coffee!* [*https://www.buymeacoffee.com/holly948*](https://www.buymeacoffee.com/holly948)\n\nI sincerely hope this has helped, and I wish you all the best of luck in your job searches!",
    "title": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2]",
    "subreddit": "jobs",
    "timestamp": 1676641102,
    "score": 21,
    "keyword": "black director"
  },
  {
    "text": "Accepting an offer but continuing to job search? I have a question, I’ve been applying for new jobs and I have a couple of interviews coming up in the next few weeks. I’ve also just applied to a state position that I’m very interested in. Of course because it’s a state job, they won’t even start considering applicants until the first week of January at least, when the application closes. And then of course they have to do a certain number of interviews before they pick a candidate, so I’m looking at at least February before I hear whether I have the position or not (if I even make it to the interview stage).\n\nSo my question is, would it be horrible for me to accept a new position at one of the companies I’m interviewing with and then move on after a month or two if I do get the state job I’m interested in? I feel like it would be silly for me to turn down an offer just in case I get the job I want, but also I don’t want to black list myself from one of these other companies if I do get the job and end up leaving….\n\nfor context: I’ve actually interviewed for this state position once before and was conditionally offered the position but turned it down for another offer, and then hated the position I ended up taking so I’m once again job searching and the position just so happened to open back up at the same time. I also know the director who is hiring for the position, I worked under her for years in a different program she is over and she actually recommended the role I’m applying for both times.",
    "title": "Accepting an offer but continuing to job search?",
    "subreddit": "jobs",
    "timestamp": 1702851609,
    "score": 7,
    "keyword": "black director"
  },
  {
    "text": "Owner of my company is racist I recently got a job at a small private company. They pay me very well and are flexible so I can spend a lot of time with my family. \n\nMost of their work is done many states away, but the admin side of things (which is my dept.) is done close to my home. \n\nThe owner spends all of his time in the field and never, and I mean NEVER, comes into the office. Someone told me last year they hired a director level employee and a month later he was fired. This person said the reason was “because the owner saw him”\n\nThe man they hired is black, and he was fired for being black.\n\nI am an adoptive father of two black boys. \n\nHow in the hell do I keep working for a guy that would do this to my kids?  I’ve never met him and I never have to deal with him, so do I just go with “out of sight, out of mind?”",
    "title": "Owner of my company is racist",
    "subreddit": "jobs",
    "timestamp": 1683662168,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "My boss won't let me post anything for black history month I'm a social media director for a well known tech company. I basically call the shots for what goes on our social media pages and make sure out content is engaging and eye catchy for the millions of people that will be seeing them. For the month of February I wanted to have a campaign around black history month and had the contents and planning ready since the middle of January. \n\nEverything was going smoothly until my boss asked me what my plans for this months social media campaign was. I told him my plans and he flat out told me that I cannot post anything about black history month. I thought I misheard him at first. I asked him if he could repeat himself and to my surprise he said it again. I was in disbelief. This comes as a bigger shock to me since he's never flat out denied something from me before and was always happy about what I had in the plans for the month. \n\nI went back to him on Friday about this before the weekend and had a lengthy conversation regarding the topic (how I had this planned for several weeks, how it's immoral to not let me talk about a crucial month for black people). He kept telling me no and his reasons had to do about not wanting to be political and none sense like that. Mind you he is a rich middle aged white man so he probably doesn't understand the importance of this month and I did try explaining this to him, but it wasn't getting to him. \n\nWhat should I do in this situation? I had this planned for weeks now and it's going to be very difficult to play catch up to plan out the campaign for February with the month already here. I'm just lost and hurt.",
    "title": "My boss won't let me post anything for black history month",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1675625391,
    "score": 57,
    "keyword": "black director"
  },
  {
    "text": "Patient care is as bad as I’ve ever seen it. ***Update: my neighbor passed early this morning, comfortable, clean, warm, and with loving staff at inpatient hospice. No more blood draws, no more pills or tests. They cleaned him up, trimmed his hair and beard, cleaned his nails, lotioned him all up.me of the last things he said is, this place is so clean and quiet. Thank you for all your love and support. The ME is going to give him an autopsy to see if the fall at the facility hastened his death, but then I have a friend who is a funeral director who will pick him up and provide a dignified end to his ordeal. Thank you, folks. stay strong 💗 ***\n\n\nY’all, my elderly hoarding neighbor asked us to call 911 for him. It’s been a 3 week ordeal of what NOT to do in nursing care. Highlights include:\n\n* FD bucket carry over mounds of trash and garbage to rescue patient, but no follow-up or alert to hospital, DCF, social worker. \n\n* ED to Multisystem Oncology PCU. Port never accessed despite Md order. Veg diet never entered. My name never added to chart, despite patient request. \n\n* To the Rehab center with no bed rails, so patient, side propped on pillows, rolls out of bed (surprise!). Breaks hip, concusses head, tears shoulder skin. No call given to me, medical proxy. Arrive in am to an empty bed and no idea where he is. Dead? \n\n* To inpatient PCU acute care, patient with broken hip. From 0930 to 1130, Pt writhing with discomfort;  Me, CCRN who is friend, NOT WORKING, assumes he is progressing in his EOL discomfort. Finally ask for assistance to turn, reposition. He has been sitting on a bed pan. Little butt cheeks all black and red within the horseshoe. LEFT ON BEDPAN FOR OVER 2 HOURS. \n\n* pt lifelong vegetarian has been served bacon, chicken, and at least 8 boca burgers on a bun with no condiments. I thought fruit and veg extended the healing ministry of Christ?\n\nIt’s been such a shit snow, such a disgrace. And I have been there for 30 min to hour everyday. No one cares. No thread has been woven through his stays or situations. It is completely transactional and impersonal. I can’t stop crying.\n\nTonight, he may or may not be transferred to IPU hospice. I work nights, so I have to sleep at some point and can’t be there any more than I am. \n\nVenting, yes. But, just so heartsick at how bad things have gotten. What on earth can we do to ensure that not only our loved ones that we monitor get decent care, but all those without an advocate? I can’t imagine the suffering that is occurring. Sigh 😔",
    "title": "Patient care is as bad as I’ve ever seen it.",
    "subreddit": "nursing",
    "timestamp": 1702691712,
    "score": 434,
    "keyword": "black director"
  },
  {
    "text": "Student keeps calling me a dirty black N word with the hard er For context I work at behavioral school for students with autism, emotional disabilities, and other disabilities.\n\n\nI am a black male and only to the black staff does this particular student call us out of our names to the point where it feels like it stems from a place of hatred.\n\nYesterday I asked my other black colleagues about it and they feel uncomfortable about the way she refers to us as well but they said when they’ve brought it up to our director previously we get told all the students are here for a reason and if it bothers us so much or we can’t handle it the door is there. \n\nSo when I can’t speak to my director and when the student won’t be reasonably disciplined by administration what are my next steps?\n\n\nI currently have staff job hunting and willing to take pay cuts because they don’t want to continue dealing with that student with no consequences\n\n\nUpdate: I’m in a private school program.\n\nFor those who say I’m making it up for attention I just wouldn’t do that what can I possibly gain for exposing information about myself and potentially have it traced back to me and lose my job for online thumbs ups? Please grow up.\n\nYes I shouldn’t take it seriously it’s coming from a kid with issues but as someone with a troubled background myself this is just degrading there’s times at work where I don’t even feel like a person thank you to all those who responded kindly and with apologies even when they had no reason to",
    "title": "Student keeps calling me a dirty black N word with the hard er",
    "subreddit": "Teachers",
    "timestamp": 1702468178,
    "score": 438,
    "keyword": "black director"
  },
  {
    "text": "Why the Department of Defense’s schools are outperforming the competition [https://thehill.com/opinion/education/3719861-why-the-department-of-defenses-schools-are-outperforming-the-competition/](https://thehill.com/opinion/education/3719861-why-the-department-of-defenses-schools-are-outperforming-the-competition/) \n\nIn the first major national assessment of K-12 students since the height of the pandemic, schools dedicated to educating U.S. military-connected children have outperformed most school systems across the nation, despite the impact of the pandemic.  \nJust-released results from the 2022 National Assessment of Educational Progress tests show that fourth- and eighth-grade students attending Department of Defense Education Activity (DoDEA) schools led the nation in scoring on reading and mathematics assessments.  \n“DoDEA students’ average scale scores ranged from 15 to 23 points higher than all corresponding national average scores and held steady or increased while all national average scores decreased,” the Department of Defense said in a statement.  \nDoDEA was the only U.S. state or jurisdiction taking the tests to see a score increase for any grade or subject on the first NAEP test administered since the beginning of the COVID-19 pandemic.  \nThe scores also show progress for Black and Hispanic students in the DoDEA system. DoDEA’s “emphasis on equity in education is reflected in higher scores across their diverse population and achievement gaps that are significantly smaller than the rest of the nation,” said Gilbert Cisneros, undersecretary of defense for personnel and readiness. “I am particularly pleased to see those efforts reflected in Black and Hispanic student groups that are outperforming the nation overall,” he added.  \nThe Department of Defense Education Activity is a federally operated school system that provides pre-kindergarten through grade 12 education for the children of military service members and Department of Defense civilian employees. In 2021, DoDEA operated 160 schools in three regions — U.S. installations in the Americas, Europe and the Pacific.  \nThe success of DoDEA schools is an amazing feat, especially given that military-connected children lead highly disrupted lives. They change schools every two to three years with a parent on active duty. And with a parent (or parents) sometimes deployed doing dangerous work, the children face stressors others do not as they manage schoolwork, home responsibilities and regular transitions in and out of communities.\n\nI wrote earlier this year about the success of DoDEA schools in mitigating the pandemic. The recent NAEP scores underscore that their approach to managing students with highly disrupted K-12 careers can provide insights for weathering something as damaging to student learning as a pandemic.  \nDoDEA Director Thomas Brady told me that a turning point for the school system came in 2016 when they began implementing college- and career-ready standards starting with mathematics. Also, it made a big investment in teacher and leader development that has continued over the last nine years.  \n“Our commitment to student achievement and to teacher training and development all combined for positive development in the classroom,” he said.  \nJeffrey Noel, DoDEA’s chief of educational research, told me that some of the success can be attributed to an overriding philosophy that guides the use of resources. DoDEA schools focus on limiting excessive bureaucracy — a big problem for many school districts — and instead prioritize efforts that can have the most impact on students.  \nOne was a push for in-person instruction. DoDEA schools shifted to remote learning during early 2020 like most other public school districts. But only months later, by the beginning of the school year in September 2020, DoDEA focused on in-person learning with mitigation measures as many school districts were unable to reopen. By March 2021, 99 percent of DoDEA schools were operating in person and 100 percent by this past fall.  \nMilitary-connected kids who attend DoDEA schools are not the typical public school cohort. They have parents with jobs, health care, food and housing; their schools are well-funded and don’t have the same federally imposed requirements. They also operate in a unique system of a shared culture and familiarity between students, parents, teachers, school faculty and base leaders. But they don’t have it easy.   \nDoDEA schools are succeeding — and that merits a closer look for lessons that can help school systems struggling to gain back learning losses.\n\n&#x200B;",
    "title": "Why the Department of Defense’s schools are outperforming the competition",
    "subreddit": "Teachers",
    "timestamp": 1695738253,
    "score": 4,
    "keyword": "black director"
  },
  {
    "text": "Got \"told on\" by vice Principal to new AD and feel blacklisted (sorry it's long and it's ok if you don't read this) I'll start by saying I'm in the athletic department for tennis. I do the spring season only due to previous fall obligations and that it's easier to hire students for a camp I run in the community.\n\nI've worked at this high school for around 4 years and the old AD and I got alone great. She even played the same sport I coach. She retired last year and we got a new AD. I wasn't concerned. I treat everyone right and have never gotten a parent compliant ever (beyond grateful).\n\nI'll try to not make the situation too detailed, but basically the vice principal's daughter got put in a situation for a weekend tournament that was out of my control and was accident by the other school. Basically other schools take some players from other schools if they had extra. This daughter had missed the team matches due to prior obligations so she didn't have anything set in stone with the team.\n\nAnyway I tell the coach of the other school to put her in the middle of their roster and she puts them at the highest spot. They get blown out and apologize to her and the father on what happened. It was 100% out of my control and they \"acted\" like they understood.\n\nNext day the athletic director calls me to talk about something. I thought he just wanted to meet some of the other coaches since he's new to the school.\n\nNOPE. He's there to treat me like I'm a 13 year old who doesn't understand how to treat students and fairly and put one of the students in a poor situation. This is where I learn that her mother was the vice principal and not just a teacher (I'm somewhat unattached to the full school system). The conversation went like this (I blanked out somewhat five minutes in)\n\nHim: Our students are the main interest of the school and want to keep them both engaged with their studies and athletics. Certain situations that make that difficult for students is something we want to avoid.\n\nMe: You're talking about (students name), correct? I talked with the father and describe the situation on how the other school put them in a higher spot that she was suppose to be. The situation was out of my hands by that point.\n\n(him staring at me)\n\nHim: Our students are the main interest of the school and want to keep them both engaged with their studies and athletics. Certain situations that make that difficult for students is something we want to avoid.\n\nwe did this about x5 (talks like if you typed prompts in chat gpt on how to be a athletic director) in a row before he let me go to the practice. Wasn't listening to a word I said. Told the other coach about this because was worried and she (other coach) was super pissed at the school for that.\n\nA few weeks later both myself and the other coach run into the vice principal while the team was waiting on the bus and passively confront her about this. With a happy tone she goes:\n\n\"oh, I just wanted to know the rules on how things happen is all haha.\"\n\nNo apology and 100% a lie. It made absolutely not sense on her reasoning. Her daughter has been on the team before and knows exactly what this situation is PLUS telling her daughter PLUS telling her father before all of this. We try to make a rule for the team that if there's any issue of any kind of come to us first.\n\nNow the fall position was open and talked to him about it later and goes \"well I look forward to your resume and see where it goes from there,\" when I originally got the position.\n\nI know the system from other schools that sometimes literally \"just put your resume in and we'll call you in just as formality.\" The way he worded it was as if I have never worked at the school and really got me upset. Someone else got the job, even though the original coach is staying for free as an \"assistant\" (a whole other issue I don't want to be part of haha)\n\nHe now, I feel, is the vice principal's b-tch (sorry, can't think of another way to word it) and I'm black listed from any potential new positions in the future because of something that was out of my control. I'm not treating her younger daughter any different than all of the other players, even it will give me \"good boy points\" for the future.\n\nTIL: Kiss ass or get blacklisted",
    "title": "Got \"told on\" by vice Principal to new AD and feel blacklisted (sorry it's long and it's ok if you don't read this)",
    "subreddit": "Teachers",
    "timestamp": 1691938291,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "In need of a pick me up Never thought I would work for a school but here I am. \n\nI work at a school(first year) where I am an expeditions director and we focus on experiential learning. I take kids on trips to go hiking, camping, canoe, backpacking, etc. Its a beautiful job where I can show these black and brown the healing and awesome power of these green spaces. \n\n Coming from outdoor rec programming for a state/fed agency I’m used to people want to be there. The kids however who i work with take these moments for granted and  I feel like I am dragging or having to convince them the entire time. When we finally get to the trip I’m annoyed and lose my enthusiasm for our trips. I think it’s the lack of appreciation for me. \n\nI know that these experiences are some where they may not  appreciate it now but will in the future, buts it hot trash now for the person running it. ME. Is this normal to expect? \n\nWhat advice or skills would you implement?",
    "title": "In need of a pick me up",
    "subreddit": "Teachers",
    "timestamp": 1683464551,
    "score": 0,
    "keyword": "black director"
  },
  {
    "text": "The Fairmont's Jasper Park Lodge Corporate Manslaughter This is a true story that exposes a skeleton in the closet of an extremely wealthy business. And how I caused the vice president of the Fairmont’s Jasper Park Lodge to resign. \n\n(Please watch the Video for picture evidence)\n\nSo I took a job to work for a mega wealthy multi billion dollar company that literally caters to royalty and A list celebrities. I initially thought this was going to be an amazing opportunity to start my life over fresh. I was going to make some new friends, learn some new skills, and finish the practical half of my power engineer course. At first glance, the face of this company looked absolutely beautiful. But it wasn’t until I got there that I learned the ugly truth about how they operate and managed to accumulate this massive wealth. \n\nOn my first day working at this place I was put through orientation. During this time the presenter boasted about how they just received a “10 million dollar luxury budget” to be spent on their most expensive cabins. I thought to myself wow this place really will spare no expense when it comes to upgrading their facilities. After the orientation was finished I went to check into my room in the employee living area as this business operates in a national park which is somewhat remote. \n\nAs I approached my designated cabin I immediately noticed what poor condition it was in. The first thing I noticed was the stairs that led up to the cabin were completely rotted and there was a step missing from the set of stairs. I avoided the hazard the best I could and made it to my assigned room. When I entered my domicile my jaw hit the floor. The room was covered in black mold as if the room had not been cleaned in several years. I had actually gotten strep throat from sleeping in a room that had a patch of black mold and this place was 10 times worse. \n\nObviously annoyed, I went to call a friend I had made early in the day to see how I should handle this. But my phone was dead so I pulled my charger from the bag and went to plug it in the wall. As soon as I inserted the charger and released my hand the charging block fell to the floor immediately.  The electrical contacts in the wall outlet were so loose I couldn’t even charge my phone. (For those who don’t know that is a serious fire hazard as the gap between electrical contacts can ark out and start a fire from inside the wall). There were only a couple outlets in the room and neither were functional. \n\nEven more annoyed, I walked over to my new buddy’s room to use his wall outlet and tell him about the conditions of the room I was put in. This was the start of the rabbit hole I fell head first into. After ranting for a couple minutes to my buddy about the room, he informed me that the company hasn’t put a penny into maintaining their employee housing area in years since they previously hired foreign workers and they would never complain about their living conditions for obvious reasons. \n\nI was shocked hearing this, given the stark contrast of the customer facing side of the business and what they offer their employees. But… it gets worse. He goes on to tell me that an employee actually died falling down stairs that didn’t have handrails and weren’t maintained 4 years ago. I asked him to show me where it happened and he took me outside and pointed to a building called “le pub”.\n\nI walk over to le pub and a few moments later my mood changed from annoyed to fking pissed! Standing on the stairs leading to le pub I could tell that they were pretty much in the same condition as the cabin they moved me into. I thought to myself “how can these stairs owned by a multi billion dollar company be in such a horrible condition after they were directly related to a death of a colleague?” \n\nNow, a little background about myself. Before my switch to power engineering I was a journeyman welder/fitter, so I understand building codes, as I have built more than a few set of stairs over my career. There have been multiple studies showing that if stairs are off by more than 1/8th, it drastically increases the chances of someone tripping and fall. With that in mind, can you guess how poor of condition these steps were in? \n\n1 and 1/4 inch. Yeah – that’s 10 times more that is permitted in building codes.\n\nAfter coming to the realization that I had just taken residency is a literal death trap, I expanded my gaze and went for a stroll around the property. And oh boy what I found should make any reasonable person disgusted. For contrast, here is an example of a hazard on the customer facing side of the business that proves they are fully aware of how to control and mitigate a hazard that could potentially cause harm. \n\nNow here is a barrage of uncontrolled hazards in the back end of their billion dollar business.  \n\nNow armed with extensive documentation of blatant gross negligence on be half of the company, I was now ready to speak with the people charged with managing this train wreck. \n\nThe four main managers I dealt with are Ken  (President of JPL), Eric (VP of JPL), Wayne  (Engineering Director at JPL), and Heather (CEO of Accor Hotels). Wayne has an interesting background as he worked his way up from being a dishwasher to being the director of engineering without any formal education to my knowledge. I had multiple conversations with these managers and I started recording them when I started catching them in lies. When I called these men out, they seemed somewhat reasonable at first, saying that everything would be taken care of. I ask them when they planned on getting the work done and they told me that it will be a project for next year. \n\nI told them that’s unacceptable and they need to start on the repairs yesterday. They said things don’t happen that quickly and things like this take time. I told them they’ve had over 4 years to fix the steps that took their employees life. Don’t you think that’s more than enough time to fix a serious hazard? And what would happen if someone else got hurt in the time that they’re putting off these repairs?\n\nEric gave me an answer that left me completely flabbergasted. He said and I quote “if someone gets hurt then that’s just something that happens.” I was honestly shook when I heard those words slip from his mouth. He then told me that trades people don’t work in winter. Mind you this conversation occurred in October. I told him that’s not true and if they can’t find anyone to do the work that I would be willing to do it. He refused my offer and said my priority is to make sure the customers are satisfied.  \n\nWayne told me that “if I wasn’t happy with the situation I should quit.” So, I came to the conclusion that these managers did not care about the welfare of their employees. It turned out they wanted to delay these urgent repairs so that they could slip decades worth of neglect into their current budget, so that they wouldn’t have to ask their higher ups for additional funding. This in my opinion was a whole new level of gross negligence. The only option was to go over their heads. I came to the realization that I couldn’t work under these callous managers and I took Wayne’s advice and quit. \n\nAfter their higher ups were informed of the state of the property and how Eric handled the situation, he knew his career with the company was over and resigned a few months later. After I quit my job, I contacted the Fairmont’s parent company and spoke with one of their executives. She appeared sympathetic and assured me that these issues would be taken care of and I would receive updates on their progress. My confrontation occurred 6 years ago and I haven’t received any updates as of this post. \n\nSoon after I quit, I was contacted by Ken Hall, the president of the Fairmont’s jasper park lodge, pleading with me to lie to Employment insurance about why I was forced to quit this job. He asked if I could tell them that I was moving to assist with a family emergency, since I would have to report my findings to occupational health and safety. I ignored this request to lie and reported the truth. They were given multiple violation notices (and my application for EI was granted).\n\nI left out quite a few details for the sake of time. if this story gains any traction I will post updates including my conversation with the police that results in one officer admitting to neglect of duty in the case. I’m also in contact with the family of the victim and can fill you all in from their perspective. \n\nIn your opinion, does it sound like the administration of Fairmont’s jasper park lodge got away with corporate manslaughter? Or is the preventable death of an employee just something that happens?",
    "title": "The Fairmont's Jasper Park Lodge Corporate Manslaughter",
    "subreddit": "WorkReform",
    "timestamp": 1694057489,
    "score": 57,
    "keyword": "black director"
  },
  {
    "text": "Reservations about new position at my work, should I stay, or make a change? I'm in my late 30's, have an associate's degree, and work at a community college in the Midwest.\n\nI started working at a community college in 2020, as an administrative assistant for their nursing department. I loved the people in the department, loved my boss (dean), and did a great job. However, I was really overworked (we had a lot of programs, my boss even said I needed my own assistant), and I was making $12.50/hr.\n\nI desperately needed more money, so I moved to a position as assistant director at their basketball facility. Pay was a bit better ($17.15/hr), but it turned out that 50% of the job is managing the concession stand, hours are all over the place based on events, and the summer months are dead slow. I think my boss wanted me to replace him when he retired. I made it clear late last year that I did not want his position, primarily because of the crazy hours (I have a family).\n\nMy boss is retiring in a week now, and I could see that things were going to go to hell in my department, so I applied for a computer tech job with the college, and they accepted me. Cool. But, they said things like \"this would be a lateral move\", but then offered me about $16.75/hr. I still accepted it because I really want to get out of the department I'm in, and want more regular hours.\n\nHowever, I'm getting some serious reservations about this college:\n\n&#x200B;\n\n* The dean I used to work for called me up, and wanted me as her director. I was overjoyed, she was a great boss, and I loved that department. The vice president said we could probably make it work, but then the president said no because I don't have a 4-year degree.\n   * Other non-teaching directors have historically had no 4-year degree, but now apparently that's a problem.\n* Nepotism \"isn't allowed\". My boss once tried to get his daughter a position at the college, but she couldn't because he worked there. However, one of the deans has two daughters working at the college, one in her own department.\n* My current department (the gym) is in an upheaval with my boss retiring\n   * Very few people have applied to his position.\n      * One didn't sign on because of the low pay\n      * One was told no because he didn't have a 4-year degree, despite having directed a similar facility elsewhere\n      * The job posting was not up on the website for \\~3 weeks, because HR forgot to renew it\n   * My boss has had 0 input regarding hiring his replacement. He knows nothing about the college's plans.\n   * We suspect that the facilities director is going to swoop in and take over\n      * He is a narcissist and everybody dislikes him.\n      * Almost everyone else in the department is looking to work elsewhere because of it.\n   * Absolutely no communication has happened with my department about what is going to happen next, even though they've known about my boss's retirement for a long time.\n* There are some really toxic folks whose behavior is not addressed at the college\n   * A coworker was having what appeared to be a mental health episode, and was loudly denigrating everyone working on a project. I said something along the lines of \"we're all doing the best we can, and this isn't helping us\". He got up in my face screaming about taking me outside (to fight). Nothing happened to him. It was brushed under the rug. I highly suspect it is because he is one of maybe 2 or 3 black employees, and multiple folks have said the college is terrified of losing any black employees because their number is so low. I get it... but that doesn't excuse dangerous or violent behavior. Since then, I've gotten along with this guy just fine. But it did really affect me for a while. I've never been threatened at work before.\n   * The head coach is a loose cannon and highly unprofessional\n      * He has verbally berated players (students) where others can hear, including calling them \"stupid\" and screaming. This was *not* on the court.\n      * He has been straight-up mean to folks in my department just trying to do their jobs\n      * He threw a cup of coffee in anger on some blinds. Then didn't tell anyone about it, so they got permanently stained. We tried to clean it up, but had to replace them for about $400.\n      * He hosted a basketball camp for kids. He didn't place limits on attendance, so WAY too many kids (grades 2-11) were there. When it was lunch time, the kids came upstairs to eat. My department was expected to monitor them upstairs, with no notice. When the kids went back to the gym, the coach and his staff were nowhere to be found (they had left the premises for an hour). These kids were then completely unsupervised, for about an hour. They left trash everywhere, which the coach did not make them pick up. My boss said he's really surprised no one got hurt. Other folks in the community were taken aback when they saw this.\n      * He is \"untouchable\" because he wins games.\n   * I have heard multiple employees say disparaging things about the homeless, black people, immigrants, and homosexuals.\n* I have no idea when my new position will start. The director for their technology department doesn't know.\n   * I suspect it's because my boss is imminently leaving, and they will have me perform his functions as an \"interim\" director, with no change in title or pay.\n* We have communicated with administration, the need for serious building repairs. These get ignored. However, they do have the budget for aesthetic renovations for other buildings.\n* I would talk to HR about some of these things, but the HR department is a mess.\n   * There are only two people there. The director and a subordinate.\n   * Literally every employee doesn't trust HR, because of the director's personality.\n   * A position has been open in HR for 2.5 years, which they cannot fill. Everyone who previously worked there lasted a couple of months.\n   * HR has messed up paychecks, resulting in late payments for staff.\n   * HR \"forgets\" to renew job postings.\n* The marketing director left in a hurry. They can't fill the position for some reason. I spoke to her as she was leaving, and she indicated it's because the college is a mess and totally mismanaged.\n* There is a culture of a complete lack of communication between departments, and with administration.\n\nI'm trying to decide what to do next. I'm imminently getting divorced, so I really don't want a gap in my employment considering we have a kid, etc. I live in a small town, and there aren't a lot of options here unless I commute a significant distance. I am pretty disappointed that my new position will be a bit of a pay cut, since staff is already underpaid here.\n\nSome of these issues feel like they should be addressed by someone, but I don't think they will be. I almost think a couple of them are news-worthy (the institutional bigotry and the coach being negligent with children). I'm not the type to rock the boat, though.\n\nAny advice on how to proceed? I guess having a stable job is more important to me than fixing things, but the longer I stay here, the worse my \"vibes\" get about this place.",
    "title": "Reservations about new position at my work, should I stay, or make a change?",
    "subreddit": "careerguidance",
    "timestamp": 1687713539,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Interviewing with CFO of a dream company of mine, any advice? Hey everyone,\n\nCurrently working at a Big 4 doing accounting and have been looking to leave for a little while now. As another fiscal year passed, I began job searching for other opportunities. Pretty quickly, I came across a listing that fit what I needed perfectly and for a company I've been hoping to work for.\n\nFortunately, I am pretty close with some executives/former executives from this company, so they put in a good word for me as I submitted my application. I am very grateful for this, however, I am still looking to leave the best impression possible myself.\n\nI feel I have a pretty solid resume (went through loads of resume workshops in college) and also feel that my soft skills and leadership skills are above average. I'm really the type of person to walk up to anyone and become friends. Funny story, I was out of state on field visits and made a new friend at a bar. Turned out he was the former CIO of BlackRock lol.\n\nBut anyways, my biggest concern is that I don't have much experience in the basic monthly close process (which will be a big component of my job). We obviously don't do much of that at Big 4, however, I was fairly transparent about that with the Director of Accounting and he sounded fairly okay with it. Sounded like he was more interested in soft skills.\n\nIn conclusion though, really any tips you guys have for me would be great.",
    "title": "Interviewing with CFO of a dream company of mine, any advice?",
    "subreddit": "careerguidance",
    "timestamp": 1699305197,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Micro aggression? How do you deal with this? Microaggressions, eh? How do you navigate that minefield? In my decades-long career, I've battled the corporate beasts: cringe-worthy bosses, colleagues who make cacti seem warm and fuzzy, folks who wouldn't know leadership if it smacked them with a motivational poster, and of course, the undeniable sting of outright racism. \n\nBut the subtle art of microaggressions? That's a new one on me. Maybe I just didn't realize I was in the ring.\n\nHere's the deal - I'm in the tech biz, sitting pretty in a senior director seat. Only catch is, I'm not a full-time employee. I'm the external consultant they brought in for a 19-month contract. In my role, I've got five counterparts, all either on the same rung of the ladder or one step below.\n\nI'm the only splash of color in this vanilla-flavored group. I'm a Black man. On the whole, the team's alright. Been in this role for over half a year, but there's this one guy... always stirring the pot.\n\nHe's got this annoying habit of running to my boss for things he should be bringing to me - notifications, escalations, inquiries, you name it. It's gotten so out of hand that even my boss has started wondering why he's not coming to me. Beats me. All I know is, it grinds my gears.\n\nWhen it comes to projects or goals in my territory, with all my peers in the mix, he'll send one of his underlings, maybe a manager or a senior analyst, to liaise with me. Sometimes he even has the audacity to patronize me, to the point where I've had to remind him we're playing in the same league. He just laughs it off, apologizes, and says he didn't mean anything by it.\n\nHe talks and behaves like he's got some kind of upper hand, dropping snide remarks about my department and hinting he'll have to chat with the bigwigs about decisions in my area. Newsflash, buddy, this is my turf! But he keeps on keeping on, and my peers, even my boss, have taken note. I'm just not sure how to handle it.\n\nI don't want to rock the boat, especially given my contract status, and part of me wonders if that's why he's acting this way. I'm just looking for a strategy to tackle this situation without putting my job in the crosshairs.\n\nThoughts?",
    "title": "Micro aggression? How do you deal with this?",
    "subreddit": "careerguidance",
    "timestamp": 1682635655,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Advice on asking for advice? Last year I was voluntarily terminated (amicably) from an organization undergoing a transformation at which I had worked for twelve years. I took that career break to care for my newborn twins and, as of June, have begun submitting my resume to find a new position (for 70 roles and counting). \n\nThis job search has been rough. I never expected to send so many submissions into the black hole of radio silence, and I’m doing my best to not feel defeated and frightened. I have not been able to help the sincere rattling of my confidence. \n\nTomorrow I have a call with my mentor and former executive director to catch up and say hello. My question for the room: Can you please help me think of ways to frame a request for help - without sounding terribly pathetic? I would be so grateful for his insight into how I can be creative with my search, or thoughts on avenues I haven’t pursued, or whether I have strengths I haven’t emphasized quite enough. I worry I’ll be shaky and my darling new lack of confidence will shine through, and I want to be prepared with some strong asks so I don’t ramble about frustration and fear and the fact that it’s very possible my resume is accidentally transmitting in invisible ink. \n\nThank you so much for your thoughts and your candor.",
    "title": "Advice on asking for advice?",
    "subreddit": "careerguidance",
    "timestamp": 1696807250,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "How do I compete with the Seniority Card? My Director pulls the seniority card when it comes to Time off/Holidays. \n\nI am an Assistant Director and am always given the “Low man on the totem pole” reasoning from my boss. We are the only two managers in the department. My director gives the option to almost all other associates when it comes to taking time off/holidays, but because he likes to have a manager in the office at all times, I am told that I must work because he wants to take the time-off and the reasoning I’m given is that he is higher in rank and has been with the company longer. It is though because of the several weeks of vacation he accrues and constantly takes time off throughout the year other than during any black out dates. \n\nI am the newest manager of a small team (6). How do I compete with that to get time off? Can I even compete with that?",
    "title": "How do I compete with the Seniority Card?",
    "subreddit": "careerguidance",
    "timestamp": 1698808596,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Are coverletters still a thing? I've been at my current job for 5 years and hate it.  I do very basic tech support for the software my company sells.  It's all via email and I work remote.  The company itself is very small and the product is very underwhelming.  Over the years working here business hasn't been great.  I spend most my day watching tv and playing video games. We do all our work via Zendesk and sometimes use SQL for pretty basic queries. \n\nSo far this year I've applied to 50+ tech support related roles and have gotten 0 interviews (no exageration).  I've had 2 callbacks but both flaked on me?  In college I was to complete an intership as apart of my CIS degree, I was unable to land one.  My mom spoke to the director of the program and he signed off on me taking an extra course since I was unable to find an internship.  I bring this up to highlight my luck when it comes to applying.\n\nOf the 50+ applications Ive submitted this year, only 3 included a coverletter. I am black and 30 years old.  Are cover letters the issue or is something else off?  Is there anywhere to get feedback on my resume?  I feel as though my current role is boring and isn't providing me with any skills for a better role.",
    "title": "Are coverletters still a thing?",
    "subreddit": "careerguidance",
    "timestamp": 1691959187,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "How do I be more confident in the work place? Hi there everyone. I'm 20F and I've always liked working but I'm awful at the social side of it. I don't really know how to navigate small talk let alone develop it in to conversations. I can make connections fine outside of the work place but at work my mind is blank and it's like I forget every social cue. I'm called mouse because I'm so quiet, it doesn't impact my work, just social interactions. And I have no idea how to build a network or how that even works. I don't understand at one point is someone a part of my network and I'm a part of theirs and what's the benefit of it. \n\nI work in accountancy and am currently studying while working full time and I'm just wondering if people have any tips or know if this will impact my career. I'm not planning to be the next financial director of something like Google, I just want a stable career and income to enjoy life. \n\nNo one in my family has pursued a career like this before and I'm abit of a black sheep, so hoping some kind strangers online will have a good tip or some advice. What stuff am I supposed to talk about, I'm a complete nerd and I don't know if that's appropriate to talk about in the work place.",
    "title": "How do I be more confident in the work place?",
    "subreddit": "careerguidance",
    "timestamp": 1682197843,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Career/Education Advice After Obtaining PMP®? As a quick outline, I’m looking to transition careers and/or continue obtaining certifications and am looking for advice to the best approach. Input as to where to focus next is highly valued and I want to thank you all in advance for your input on this inquiry.  \n\n\nObjective: \n\nTo transition from Real Estate Sales into Project Management. I have roughly five years’ of on paper PM experience (over the last ten years) in the small business environment.   \n\n\nRecent endeavors: \n\nI obtained PMP® and PMI-ACP® certifications in early March, and I have seen a slight increase in outreach already. I have reached out to multiple recruiting services over the last two weeks and have received basically no follow-ups. Additionally, I’ve applied for roughly 150 jobs over the last two months which I’ve had roughly five over the phone interviews.  \n\n\nFuture possible endeavors: \n\nNow the question is, do I start applying for positions only, focus on online networking, continue a balance approach of applying for jobs while also obtaining more certifications, or something else?  \n\n\nMy current path: \n\nGiven my situation I’ve narrowed it down to two primary paths which include moderate levels of both job applications and continuing certifications.  \n\n1. PM Path - This seems the simplest from here given that I have one of the highest and most accredited certifications (PMP) you can have in this domain. Continuing certifications, in order of operation, if I wanted to continue down a mastery path would be:\n\na. Certified Scrum Master (CSM)\n\nb. PMI-RMP® - PMI Risk Management Professional \n\nc. IASSC Certified Lean Six Sigma Black Belt™ (ICBB™)\n\nThe only drawback I see to this approach would be that I may be viewed as overly specific. \n\n2. Analytics/Software Path - I’ve had a few interviews for PM roles that I’ve been looked over because they want someone who understands specific systems, most commonly SAS, SAP, Salesforce, BlueYonder, MS Project, Xactimate, or insert one of a hundred other applications here. \n\nWhile worthwhile, I feel it would be difficult to obtain certifications for specific software packages until I acquire a job with an existing set of systems. Therefore, I thought a good offset for a lack of individual software experience would be to acquire Analytics and IT based certifications. Certifications, in order of operation, if I wanted to continue down this more general path would be:\n\na. ITIL 4 Foundation > ITIL 4 Managing Professional\n\nb. Google Data Analytics Certificate for introductory phase (not really a certification)\n\nc. Associate Big Data Analyst (ABDA™)  \n\n\nConclusion/Advice:\n\nDoes being more rounded with generally certifications seem to be a better use of time than mastering the PM approach? Do these seem like good potential certifications to take if the former? Are there certifications out there you would recommend instead? Should I focus on individual software systems instead? Should I focus more on blanketing my resume and work on acquiring a position now? \n\nFinally, it may also be worthwhile to potentially go back to a brick-and-mortar university for a B.S. Civil Engineering Degree, but I’ve been reluctant to do so given the cost and that I have a M.S. Business Management Degree. I feel I get overlooked a lot because my degrees, while from accredited universities, are not exactly household names. Thoughts on this?   \n\n\nEducation/Certifications/Licenses: \n\n• M.S. Business Management\n\n• B.S. Business Management\n\n• A.S.S. Construction Engineering\n\n• Technical Certificate of Computer Aided Drafting Technology\n\n• Project Management Institute - Project Management Professional (PMP)\n\n• Project Management Institute - PMI Agile Certified Practitioner (PMI-ACP)\n\n• Real Estate Affiliate Broker - Two States  \n\n\nRoles (by title): \n\n• Director of Operations – 1.7 Years\n\n• Project Manager – 2.3 Years \n\n• Real Estate Agent / Property Manager – 2.5 Years\n\n• Operations Manager – 5.1 Years\n\n• Lead – 4.5 Years",
    "title": "Career/Education Advice After Obtaining PMP®?",
    "subreddit": "careerguidance",
    "timestamp": 1678646536,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Have you ever had a stranger use you as a reference at your company? Posting this because this is the second time this has happened to me, all within 4 months. I understand that the applicants are trying to be clever and boost their application visibility. If you take the time to find the company I work for through LinkedIn, go to the company job listings, and fill out out an application, at least contact me about it.\n\nSome more context: the first time this happened I reported the person to the security officer at our office. The security officer thanked me and moved the issue up to the HR department director. The applicant was immediately disqualified and put on a black list lol. To make it worse the applicant reached out to me on LinkedIn after this happened and I told them that they should’ve reached out to me first.",
    "title": "Have you ever had a stranger use you as a reference at your company?",
    "subreddit": "cscareerquestions",
    "timestamp": 1694450682,
    "score": 5,
    "keyword": "black director"
  },
  {
    "text": "Should I Obtain PM or IT Certifications Given My Background? As a quick outline, I’m looking to transition careers and/or continue obtaining certifications and am looking for advice to the best approach. Input as to where to focus next is highly valued and I want to thank you all in advance for your input on this inquiry.  \n\n\nObjective: \n\nTo transition from Real Estate Sales into Project Management. I have roughly five years’ of on paper PM experience (over the last ten years) in the small business environment.   \n\n\nRecent endeavors: \n\nI obtained PMP® and PMI-ACP® certifications in early March, and I have seen a slight increase in outreach already. I have reached out to multiple recruiting services over the last two weeks and have received basically no follow-ups. Additionally, I’ve applied for roughly 150 jobs over the last two months which I’ve had roughly five over the phone interviews.  \n\n\nFuture possible endeavors: \n\nNow the question is, do I start applying for positions only, focus on online networking, continue a balance approach of applying for jobs while also obtaining more certifications, or something else?  \n\n\nMy current path: \n\nGiven my situation I’ve narrowed it down to two primary paths which include moderate levels of both job applications and continuing certifications. \n\n1. PM Path - This seems the simplest from here given that I have one of the highest and most accredited certifications (PMP) you can have in this domain. Continuing certifications, in order of operation, if I wanted to continue down a mastery path would be:\n\na. Certified Scrum Master (CSM)\n\nb. PMI-RMP® - PMI Risk Management Professional \n\nc. IASSC Certified Lean Six Sigma Black Belt™ (ICBB™)\n\nThe only drawback I see to this approach would be that I may be viewed as overly specific. \n\n2. Analytics/Software Path - I’ve had a few interviews for PM roles that I’ve been looked over because they want someone who understands specific systems, most commonly SAS, SAP, Salesforce, BlueYonder, MS Project, Xactimate, or insert one of a hundred other applications here. \n\nWhile worthwhile, I feel it would be difficult to obtain certifications for specific software packages until I acquire a job with an existing set of systems. Therefore, I thought a good offset for a lack of individual software experience would be to acquire Analytics and IT based certifications. Certifications, in order of operation, if I wanted to continue down this more general path would be:\n\na. ITIL 4 Foundation > ITIL 4 Managing Professional\n\nb. Google Data Analytics Certificate for introductory phase (not really a certification)\n\nc. Associate Big Data Analyst (ABDA™)  \n\n\nConclusion/Advice:\n\nDoes being more rounded with generally certifications seem to be a better use of time than mastering the PM approach? Do these seem like good potential certifications to take if the former? Are there certifications out there you would recommend instead? Should I focus on individual software systems instead? Should I focus more on blanketing my resume and work on acquiring a position now? \n\nFinally, it may also be worthwhile to potentially go back to a brick-and-mortar university for a B.S. Civil Engineering Degree, but I’ve been reluctant to do so given the cost and that I have a M.S. Business Management Degree. I feel I get overlooked a lot because my degrees, while from accredited universities, are not exactly household names. Thoughts on this?   \n\n\nEducation/Certifications/Licenses: \n\n• M.S. Business Management\n\n• B.S. Business Management\n\n• A.S.S. Construction Engineering\n\n• Technical Certificate of Computer Aided Drafting Technology\n\n• Project Management Institute - Project Management Professional (PMP)\n\n• Project Management Institute - PMI Agile Certified Practitioner (PMI-ACP)\n\n• Real Estate Affiliate Broker - Two States  \n\n\nRoles (by title): \n\n• Director of Operations – 1.7 Years\n\n• Project Manager – 2.3 Years \n\n• Real Estate Agent / Property Manager – 2.5 Years\n\n• Operations Manager – 5.1 Years\n\n• Lead – 4.5 Years",
    "title": "Should I Obtain PM or IT Certifications Given My Background?",
    "subreddit": "cscareerquestions",
    "timestamp": 1678646944,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "The Jaguars’ $22 million question: How did four years of theft go undetected? [https://theathletic.com/5129370/2023/12/12/jacksonville-jaguars-amit-patel-credit-card-fraud/](https://theathletic.com/5129370/2023/12/12/jacksonville-jaguars-amit-patel-credit-card-fraud/)\n\nHow could this happen?\n\nThat question swept through the offices of [NFL](https://theathletic.com/nfl/) teams last week after *The Athletic* broke [the news](https://theathletic.com/5118308/2023/12/06/jacksonville-jaguars-employee-theft-amit-patel/) that Amit Patel, 31, a former employee in the finance department of the [Jacksonville Jaguars](https://theathletic.com/nfl/team/jaguars/), allegedly stole more than $22 million from the team over a four-year period.\n\nPatel was a mid-level employee who worked for the Jaguars from 2018-23. He allegedly created fraudulent charges on the club’s virtual credit card and then covered his tracks by sending falsified files to the team’s accounting department. According to a charging document, he used that money to buy vehicles, a condominium and a designer watch worth over $95,000. He also purchased cryptocurrency, splurged on luxury travel for himself and others and used the funds to keep a criminal defense lawyer on retainer. Patel’s attorney said that the vast majority of the $22 million he stole were gambling losses; Patel allegedly [placed bets](https://theathletic.com/5121029/2023/12/07/jaguars-amit-patel-betting-fantasy-losses/) on football and daily fantasy sports with online gambling sites.\n\nPatel is expected to plead guilty to multiple charges — wire fraud and an illegal monetary transaction — in a court appearance Thursday, his attorney, Alex King, said.\n\nIn a statement, the Jaguars said that the franchise engaged “experienced law and accounting firms to conduct a comprehensive independent review, which concluded that no other team employees were involved in or aware of his criminal activity.” That fact makes the question people around the league were asking last week even more salient: How was Patel, working alone, able to steal more than twice the amount quarterback [Trevor Lawrence](https://theathletic.com/nfl/player/trevor-lawrence-0gjixjs0a34LXvKj/) counts against the Jaguars’ salary cap?\n\n*The Athletic* spoke to two people familiar with Patel’s work for the Jaguars as well as nine people who work or have worked in finance for NFL teams or other pro sports franchises. Patel was no mastermind, people who knew him said, but rather a guy in the right place at the right time. The Jaguars may be a franchise worth an estimated $4 billion (according to Forbes), but the team’s finance department was understaffed. And turnover in key positions and a switch to a new credit card system created an opening that Patel exploited. The people who knew him and others who work or have worked for NFL teams questioned why Jacksonville didn’t have better safeguards in place that would have made it more difficult for Patel to get away with what he did and for so long.\n\n“If you’re running a tight business, this would be impossible to pull off more than once,” said a former chief operating officer for an AFC team. “For (four) years, somebody was asleep at the switch.”\n\n“I know people won’t believe it. But he was super basic.”\n\nThat was how one person who knew Patel during his time working for the Jaguars described him. That person and others who spoke to *The Athletic* were granted anonymity to discuss his work, which remains under federal investigation. Patel didn’t wear fancy clothes or flash his new expensive watch or brag about trips he took on private jets with friends. “Aside from the fact that he drove a Tesla, if you were to see Amit, you wouldn’t assume like, Oh, here’s a dude that is siphoning millions of dollars from his job,” the source said.\n\nPatel was friendly and well-liked in the office. His job required him to interact with many department heads, and the source said he had “really great connections with everyone across the organization.” Patel oversaw the budget activity for each department, and he was responsible for helping department heads code individual expenses. If an expense came through on a corporate credit card, Patel was the person Jaguars employees would go to to ask: Hey, where does this need to go?\n\nThe staffing hierarchy for an NFL office is similar to any organization: coordinator, manager, director, vice president, senior vice president. Patel joined the Jaguars in 2018 as the coordinator of financial planning and analysis and was not promoted until three years later — to manager of financial planning and analysis. So the bulk of the alleged fraud occurred when he was a coordinator.\n\nCourt documents detail how Patel helped prepare the Jaguars’ monthly financial statements, oversaw department budgets and acted as the administrator of various programs, including the Jaguars virtual corporate card program. In October 2019, Patel’s direct supervisor, the director of financial planning and analysis, moved to a role in a different department and was not replaced. Two sources familiar with Patel’s work for the team said two other staffers also left the finance department, forcing others, including Patel, to pick up their work. It was not uncommon for staffers to arrive at work at 8 a.m. and not leave until 9 p.m.\n\n“There was some transition in the organization which I believe created an opportunity for this to flourish,” said one source.\n\nAdded King, Patel’s attorney: “They were short-staffed in those departments. Normally you’d have segregation of duties, those kinds of internal checks and balances and they had lost people through attrition. … You’re supposed to have Person A do this part and Person B do this part as a check and balance and segregation of duties and all of a sudden he was doing both roles.”\n\nThe Jaguars switched to a virtual credit card system after Patel had been with the team for about a year. VCCs are considered more secure than having employees carry around physical cards, and they keep the card information private when making online transactions. However, it takes time for employees to transition to the new system, and the person introducing the system is relied upon to answer questions. He or she becomes the go-to, the trusted expert.\n\nPatel was that trusted person in Jacksonville. When he first started managing the VCC program, there was an employee from accounting who checked Patel’s submitted sheets, but then that employee left, and that layer of security also went away.\n\n“The number one rule you learn in accounting is you need to have dual controls for a reason,” said one source.\n\nThe federal charging documents state that as the sole administrator of the VCC program, Patel had the power to create user accounts, approve new VCCs, request changes to the available credit for the VCCs, and classify all VCC transactions in the Jaguars’ general ledger. Each month, he created an “integration file” that listed each VCC transaction with cost coding information. But instead of accurately reporting the VCC transactions, Patel is alleged to have created fraudulent entries using a variety of methods to ensure that the total dollar amount of VCC expenses matched the balances paid by the Jaguars. Charging documents state that he “identified legitimate recurring VCC transactions, such as catering, airfare and hotel charges, and then duplicated those transactions; he inflated the amounts of recurring VCC transactions; he entered completely fictitious transactions that might sound plausible, but that never actually occurred; and he moved legitimate VCC charges from upcoming months into the month of the integration file that was immediately due to the accounting department.”\n\nPeople who might assume an NFL franchise would be a tightly monitored operation are not wrong. Still, in Jacksonville, that description only applied to the football side of the business, because the league office monitors each team for salary cap compliance.\n\n“We were so anal about everything,” said a former Jacksonville employee on the football side. “It went down to the penny. Constant communication with internal accounting, constant communication with the NFL management council, with player personnel (in) NFL headquarters, so by the time an official audit (from the NFL) came down, it was yesterday’s news.”\n\nAudits of the non-football side of the Jaguars did happen, according to a source, but they did not scrutinize every transaction. “The thing with any audit is everything is samples. So if they pull a sample and the support aligns and supports the transaction, then there are not that many questions.”\n\nIn 2019, the FBI [caught](https://www.justice.gov/usao-edca/pr/former-sacramento-kings-executive-sentenced-7-years-prison-multimillion-dollar-fraud) Sacramento Kings chief revenue officer Jeff David stealing $13.4 million from five companies by representing to them that payments they made were going to the Kings, when instead they were going to bank accounts that only he controlled. David was sentenced to seven years in prison but [was granted an early release](https://www.abc10.com/article/news/local/former-sacramento-kings-executive-released-from-prison-early/103-96ec0c10-7860-4611-a04c-b7266ef08ee0) in September 2023.\n\nAn [ESPN article ](https://www.google.com/search?q=How+NBA+executive+Jeff+David+stole+%2413+million+from+the+Sacramento+Kings&oq=How+NBA+executive+Jeff+David+stole+%2413+million+from+the+Sacramento+Kings&aqs=chrome..69i57.15538j1j4&sourceid=chrome&ie=UTF-8)chronicling the mess in Sacramento described how it became a “cautionary tale” within [NBA](https://theathletic.com/nba/) circles, with CFOs sharing different methods of internal stress tests at the league’s annual sales and marketing meeting. One NBA team president told ESPN the franchise “initiated a full audit of its operations” days after David’s fraud became public knowledge.\n\nDavid was a top executive stealing from other companies, not a lower-level employee allegedly defrauding his own organization. But the reaction from the NBA community mirrors what is now happening across the NFL.\n\n“We saw a mess out there with the Sacramento Kings, so it’s not the first time,” one current AFC team president said. “But you certainly step back and think, what do we have in place?”\n\nAccording to interviews with officials from other NFL teams as well as individuals working in finance at other professional sports franchises, the Jaguars may be an outlier in how little they were doing to monitor an employee with so much control over spending. Most of those interviewed were gobsmacked that one person would have unchecked oversight of the VCC setup.\n\n“Talk about having egg on your face. That’s a whole f—-ing omelet,” said a former finance specialist for an [NHL](https://theathletic.com/nhl/) team.\n\nA former finance employee for an NFC team said that their CFO ran the corporate card program, accounts payable received the statements for the cards, and then a manager approved each report. That finance employee reviewed the court filing that detailed Patel’s alleged crimes and said the sheer number of falsified transactions he created should have resulted in detection at an earlier point.\n\n“A lot of times a big number might not look like an outlier,” said a former chief administrative officer of an NFL team. “Usually, you have someone who charges a payment and then expenses it to someone else. Then the money comes back to the budget and you see the figure hitting your account as an outflow of cash. Someone would notice if they turned in a bill for $100,000 and it was paid out by someone else at $150,000.”\n\nBut if one person handles multiple layers of the process, it can go “upside-down” quickly. “It certainly was a flawed system they had in Jacksonville,” he said. “Somebody was given way too much leeway and way too much trust.”\n\nA former NFL COO said in a text message that he had “never heard of an employee having that kind of access without layered controls in place. … Usually everybody up to and including CEO level has another party who has to approve expenses. Sometimes it might be at a certain level (say above $10k) but their situation sounds highly unusual.”\n\nAnother former NFL COO said that Patel’s alleged fraud would likely have been detected at his organization because his fraudulent charges would have blown the annual budget. “Once a fiscal year was underway, each department head would receive a monthly update of expenses for the month versus the plan. Sometimes the actual spending might vary from the planned spending for simple timing reasons. Anything over a 5 percent variance would receive scrutiny from a number of sources including the finance department, the person that budget reported to and/or myself,” he said in a text message.\n\nThe spreadsheet integration file Patel allegedly falsified might not have even been reviewed by superiors, said the former finance employee for an NFC team, but rather something that accounting merely uploaded to a server. “It’s accounts payable, so that’s not like a fine tooth comb. When it gets back to accounts payable, you’re under the assumption that it’s all taken care of, and it’s ready to be paid,” the employee said.\n\nA third former COO explained that teams often undergo three different audits annually: a league audit focused on compliance with the salary cap, then two others, one done internally, then another initiated by a banking institution (if the team borrows money). The internal audit would have been the one most likely to detect Patel’s alleged fraud, the COO explained.\n\nThe finance people who spoke to *The Athletic* said they expected NFL teams to review their reporting structure and potentially beef up those internal audits in light of what happened in Jacksonville. The senior members of the Jaguars’ financial operations while Patel was there remain in their posts. According to the team’s website, the organization has increased the size of the finance department by six employees since Patel was fired in February. Two of those positions are new — a vice president of accounting, and a senior manager of accounting. The team added in a statement: “With the assistance of external experts, (the organization) has extensively reviewed its own policies and procedures, added staff to its finance department, and taken other measures to ensure the integrity of its financial controls.”\n\nAs for Patel, his attorney said Patel checked himself into an inpatient recovery center this past spring and has cooperated with the government and the Jaguars. King said his client is remorseful, takes “full responsibility for his actions” and has opened a gambling addiction recovery center, where he plans to be “active in the treatment community.”\n\nHe was also working for Uber, driving the black Tesla that is referenced in court documents as one of the spoils from his alleged crimes. (His attorney said Patel purchased the car with his own money.)\n\nA few days before his alleged fraud became a national headline, Patel picked up Chris Chaney, a product marketer from Cincinnati, and his wife from the Jacksonville airport and drove them 40 minutes to their Airbnb in Jacksonville Beach. They were in town to see the [Bengals](https://theathletic.com/nfl/team/bengals/) play the Jaguars.\n\nChaney said Patel made small talk as he drove, pointing out the country club where he is a member and telling the couple he’d been a Jaguars fan since he moved to Jacksonville as a kid. Patel told Chaney he’d worked in finance for the team but was recently laid off because of some restructuring.",
    "title": "The Jaguars’ $22 million question: How did four years of theft go undetected?",
    "subreddit": "Accounting",
    "timestamp": 1702395986,
    "score": 151,
    "keyword": "black director"
  },
  {
    "text": "Losing License Hi all. I have my CPA and I’m genuinely concerned about keeping my license. I work in government internal audit. Our director was tasked with building an IA function from the ground up, so they hired two staff auditors. Our charter requires us to follow GAGAS/Yellow Book. The director has put in no controls or effort in ensuring we comply and meet standards. I’ve brought up our requirements many times, although I’m new to government and learning this all for the first time. For example, the director states we are in the reporting phase of an audit but we never had any formal, written audit plan. I told them we need to have this and now they are creating a template and writing one. I informed them of this requirement at the start of the audit, as well. I’m trying my best but feel like I’m in a tough spot trying to get my director to comply so I don’t put my license at risk. I worry we will fail a peer review and that will be a black mark on my professional reputation and possibly get my license revoked. Anyone here with experience and knowledge of internal audit government and CPA requirements who can either talk me off a cliff or tell me to run? I’ve started applying for new roles but I am scared to be around when the director finally finishes the report.",
    "title": "Losing License",
    "subreddit": "Accounting",
    "timestamp": 1674315303,
    "score": 0,
    "keyword": "black director"
  },
  {
    "text": "Leaving 6 months into Consulting as a new grad As a bit of background I just recently finished my bachelors back in April 2022 and started working full time at one of the big 4 in their Management Consulting team in September 2022 (A HCOL City similar in size to Chicago, NY, LA). I’m halfway through my first client and I realized none of this work is interesting to me at all (ERP focus with minimal strategy work). The team is honestly great and the culture is fantastic but the work is just mind numbing to me. I recently got an offer in finance (non investment banking) which seems more modeling and valuation focused. The pay is higher and similar promotion cycles but the exit opportunities don’t seem as good. In University I always enjoyed finance but never wanted the stress of Investment Banking and didn’t want to risk losing exit opportunities by pigeon holing myself early into my career. I have seen many people from my exact team in this big 4 exit to a Director position in pretty chill F500 firms. My main concerns are whether I look like a black sheep exiting this early and whether I should even do it if it means losing out on many exit opportunities? \n\nTLDR - Is it inappropriate to leave in the first 6 months if you find the work boring with no other major problems? How important are exit opportunities?",
    "title": "Leaving 6 months into Consulting as a new grad",
    "subreddit": "consulting",
    "timestamp": 1673725916,
    "score": 48,
    "keyword": "black director"
  },
  {
    "text": "Why do teachers look at us so much? I am the only black girl in class, and have realized in the exams how most of my teachers are only looking at me. \n\nI had an exam yesterday in which there was another class who had exam too and their teacher was also the teacher that I have in one of my courses. I noticed how both of the teachers stood there talking and they stared at me the whole time and I was like wtf? \n\nThey did this too a lot in class but often looked away when I started to pay more attention to their stating but when they are multiple people, they just bluntly stare and don’t stop even when I get anxious.\n\nOh btw, one of my teachers (the degree director) knows that I have anxiety and still, last time he did the same thing the other two teachers did and stood there, stared right at me only and when another teacher came, he talked to him and made it seem like they were talking about me. Why do they do that? \n\nNow I feel like it was a a mistake telling him that I have anxiety. \n\nDid/do you have these experiences too?",
    "title": "Why do teachers look at us so much?",
    "subreddit": "blackladies",
    "timestamp": 1687440546,
    "score": 254,
    "keyword": "black director"
  },
  {
    "text": "When you finally realize that all \"skin folk ain't kinfolk\". I had a conversation with the director of our property department that's within a major nationally known organization. She's a black woman as well, and the organization comprises of about 20% black employees.\n\nAlthough our particular office (HQ) is evenly mixed, a lot of new black employees naturally gravitate towards me. Because of this, I always find myself in some awkward conversations that eventually gives me a feel of what they are like outside of the office. \n\nAnywho, this director didn't just work with me- but she was also a real estate broker. I mentioned to her that my mom was kind of in the market for a new home, and she gave me her information. The conversation changed when she found out where my mom lives. \n\nShe went on and on about how many properties she owned in that neighborhood because, \"#iggas gonna rent!\" She further stated that no matter how bad the area gets, \"we\" will always want to stay there because we don't know any better. \"You want to know why people can't get out the hood? Because they don't want to! No matter how many programs the government creates, there will always be a hood because that's what \"they\" like. \n\nShe states how she buys a property, barely fixes it up, and offers it for rent since the tenants never care. \n\nShe doesn't realize that she is also part of the problem. She discourages \"gentrification\" because she knows she would have to find another place to make a profit in. \n\nIt's sometimes your own people.",
    "title": "When you finally realize that all \"skin folk ain't kinfolk\".",
    "subreddit": "blackladies",
    "timestamp": 1687023696,
    "score": 231,
    "keyword": "black director"
  },
  {
    "text": "Tbh, we need more variety in \"Black media\" Don't get me wrong, I loved Insecure, Rap Sh!T has me in a chokehold and I'll be the one to admit that I've binged quite a bit of Sistas, Harlem, etc. but I feel like there is NO variety when it comes to shows harboring a majority Black cast. \n\nDo people, black folk included, feel like we don't want to consume anything but relationship drama and racial trauma? \n\nAs a cinephile and one who loves Horror, Sci-Fi, Cyberpunk, etc. we are not there. You'll find a Black guy or two in these movies, but BW are so scarce. If we are there, well... you all know. \n\nI was watching Rebel Moon earlier and while the movie in terms of writing is trash, the visuals were beautiful but I noticed that every race is represented except for monoracial BW. We are not even in the background. I won't lament about non-Black writers and directors putting us in their films, because let's be honest - they do not care, but I want Black writers and directors to branch out. \n\nNot every show needs to be about 20s/30s BP navigating more struggle relationships or a racist system. Where is our escape? Where is our Rebel Moon, Harry Potter, Star Wars, etc. \n\nThere are plenty of Black creatives on that \"nerd\" tip who deserve a chance to bring something to the screen and it's a shame that the Black people with money (TP, Oprah, etc.) aren't trying to diversify and support them.",
    "title": "Tbh, we need more variety in \"Black media\"",
    "subreddit": "blackladies",
    "timestamp": 1703300258,
    "score": 125,
    "keyword": "black director"
  },
  {
    "text": "Am I overreacting or is this targeted towards me Hi everyone!  I don’t make threads but I’m so upset with what happened today.  I called out of my part time evening job today.  The Director of nursing sends the Unit Coordinator team an email about calling out and other things.  I rarely call out and I feel this is a targeted attack.  I’ve been on this unit for five years now and one of a handful of black women.  It’s so disheartening to me these nurses are so vindictive.  They smile in your face and stab you in the back.  I’m just really upset over this and at this point I would rather go to another unit.  The extra money helps but today I was just exhausted and achy.",
    "title": "Am I overreacting or is this targeted towards me",
    "subreddit": "blackladies",
    "timestamp": 1702076244,
    "score": 74,
    "keyword": "black director"
  },
  {
    "text": "The struggle of being a black woman in the corporate world… Hey ladies !\n\nI have graduated from college in 2021 with a master degree. During my last year of college I was in a program that made us work for a company during 4 weeks which was followed by 2 weeks of courses at my uni. \n\nSo I have been working since 2020 in various roles such as product management and marketing in the banking industry. It was 3 fixed terms contrat amongst 3 different teams which allowed me to discover different products.\n\nMy previous job ended in August and I have been travelling since that point. A month ago a previous colleague told me that they are looking for someone to replace someone that left the team (I have worked for this team during my second contract). I thought why not and I decided to reach out to my ex manager. He was happy about it and said that he would talk to the director about it. \n\nI had left things well with her so I thought it would be okey. I have never had a bad review and the feedback was always positive.\n\nThis morning, my ex manager told that the director refuses to recruit me because of the senior manager of the team that I use to work with during my last position. \n\nI was highly surprised because I have never gotten any negative feedback from her. She is not well liked and has had cases built against her in the past. She tracks everything that everyone does on the team to the point of calling you if your teams status has been off for too long. \n\nShe said to the director that she could never reach me during my time there which is not true. The only instance was one morning when I was at a medical appointment and the doctor took me in late. This was a recurring appointment that I had and my manager was okey with it. This day he was off so when the appointment ended I ran home.\n\nWhen she called me I’ve picked up immediately , apologized and said that I was on my way home. I didn’t plan for the appointment to start late and I don’t have a professional phone so I couldn’t reach anyone on teams or anything. And honestly, I didn’t think that it would matter for 15 minutes. \n\nSo this is why my work is getting questioned and I am very disappointed because nothing has ever been said to me and I don’t want that « reputation » to follow me at the beginning of my career.\n\nI really don’t understand why a single mistake would make her say literally « no way » to my recruiting.\n\nI am so disappointed as I have given my whole on every task that was given to me. I feel like that as black woman, there is no space for mistake and you get written off so quick…\n\n(Oh and that senior manager has also made a racist joke in the past but I don’t want to jump to conclusions)",
    "title": "The struggle of being a black woman in the corporate world…",
    "subreddit": "blackladies",
    "timestamp": 1703086148,
    "score": 70,
    "keyword": "black director"
  },
  {
    "text": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies? Hi all, apologies for the long post below that is likely full of some grammatical errors! :)\n\nI have been with my partner for 5 years. He works for a very intense advertising company and is the only Black individual on his team. His managers are White/Asian and have started using terms such as, “disrespectful,” “angry”, “isolative.” I want to be clear, my partner is loved by his team/ “mini” managers (those who he supervises). He has received very good reviews and is extremely engaging/polite. He’s truly lovely. His colleague in the exact same position is vocal and will often raise his voice during calls, to which my partners bosses simply reply with, “that’s fine. We hear you.” \n\nToday, my partner worked from 7am-7pm and a 30 minute call was put on his calendar at 6pm. There has been some financial issues going on with their company, so everyone is feeling the pressure. My partner wrote in the teams chat, “I’m a bit blinded sided by this meeting. What is it in regards to?”  to which his manager said, “that is a disrespectful response. WE have been working harder than you the entire weekend.” My partner responded with: “Okay, let’s just do this then” to which they wrote “you’re so angry and disrespectful.”\n\nThis resulted in a very heated, 30 minute Teams call in which his superiors called him paranoid, disrespectful, and angry. He highlighted that his White colleague has said much worse and even hung up on calls, to which they responded, “we have no memory of this.” My partner refused to say that being labeled as such is damaging to but he did say he felt unsafe (they ignored it).\n\nI wanted to jump in this call SO fast but held my tongue. My partner was extremely defeated and I was livid the entire time. As Black women, how do you all navigate your partner experiencing bias, racism, labeling, etc? I am exhausted and this was just ONE 30 minute call.  He has been at this company for 4 months and wants to stay at LEAST 1-2 years to make Director. Part of me wants him to find a new job ASAP but I also know that isn’t feasible.\n\nI just feel defeated and watching him experience this hurts me deeply. Any tips?\n\n****EDIT:*** The only thing we can think of that has contributed to their perception of him changing is that he took a Monday off (approved leave) to move apartments. He didn’t log on at all to check accounts/budgeting and one of his Supervisee’s had made a mistake with an account. This was caught the next day but resulted in everyone having to work this error out. This was about two months ago.\n\nUpdate: Thanks so much everyone for your feedback! He has started documenting everything, as you all have noted. Not sure how this will turn out but it is definitely concerning. He’s also started updating his resume and making sure everything is followed up with an email documenting what was/has been talked about in meetings. He noted that he is fearful to use “the race card” because there is no coming back from that, which I understand but still I am still encouraging him to address how damaging language can be as the ONLY Black male on his team. It’s not the race card, it’s the reality and race is ALWAYS present (whether conscious or unconscious). \n\nFor right now, he is keeping his cool and maintaining professionalism.",
    "title": "My partner’s managers have labeled them as the “angry Black person.” How do y’all navigate this, ladies?",
    "subreddit": "blackladies",
    "timestamp": 1688601081,
    "score": 40,
    "keyword": "black director"
  },
  {
    "text": "Do older white men hit on you for no reason? Posting it here, because my post was refused by the black people facebook group.\n\nA question to all black women out there : Do older white men pursue you for no reason? I mean like as if they think that all black women like older white men and so they pursue you without even knowing exactly if they like you or not?\n\nLike I am in college rn and all my older male professors try to impress me or just stand there and observe me. I had an exam yesterday and there were three male professors (for 3 classes writing exam) and all three like stood there at the front and observed me while writing my exam. I felt sooo uncomfortable that I could not concentrate, they always like looked straight at me ( I am the only black girl in the study program, no other black people). I sat in the very last front (behind) and they were always coming near me, one (the study director who was one of the males) even came to behind me and stood there for like three to five minutes. I just feel very umcomfortable in class and constantly thinking why they cannot leave me alone. They do not pay as much attention to other students, not even the girl beside me, who was cheating by either looking at my paper (which I did not care) or the other girl on the side of her. Still, they were full concentrated on me. I also feel like maybe they mistrust me (because I am black) and think I will cheat because I did not study. Even then, why did they accept me then, if they think so negatively about me? Recently, I got a bad feeling about my study director, as if he could not like me and has prejudgments against me but still pretends. \n\nI hate this university, I hate these professors and I hate my student life. Most of my fellows are white and so superficial, so it is very difficult making friends, that is why I feel so lonely. Since I got there my mental health got worse and now I cannot even concentrating in studying for my next exam because I keep thinking about how horrible my life got and that I just want my peace (study stress included). \n\nP.S. I live in Europe and my university is predominantly white. I wish I could go to an HBCU, but the registration process is so complicated and I do not know if they would even take me or if I would have the time now to send my application til the deadline with all the stress I have rn ...\n\nIf I could turn back time and go to another university, I definetely would. This is hell. \n\nWhat do you think?",
    "title": "Do older white men hit on you for no reason?",
    "subreddit": "blackladies",
    "timestamp": 1674388883,
    "score": 29,
    "keyword": "black director"
  },
  {
    "text": "I don't trust my study director and I don't know why. So for context, I have been skipping most of my classes at university because I was having major anxiety when visiting the lectures (due to being stared at by lecturers and because of having no friends, feeling depressed). So I \"took a time off\" unofficially and was working on everything from home. \n\nMy lecturers noticed this and told our study director about this and he contacted me for a online conversation today morning. We then talked and he seemd rather annoyed and impatient with me than empathic. His tone was kinda judging me like first told me that he noticed I was skipping classes and then asked me what was going on. I told him I was not doing well because of my anxiety (I left out the part of the being stared at ... bc most of my lecturers are white and I didnt want to come off as complaining about race and yada yada). He then proposed for me to take a semester off but I told him that I already did a gap year before starting my degree and didnt want to lose any more time during my studies. He was like \"That's not an excuse for me for saying that.\" and for me it came off as very judgementful and my guards were up even stronger at that moment. \n\nHe then gave me contacts of psychologists on campus, bla bla bla, then told me that he wants to be my \"go-to\" person when I need something and to tell him how things turn out in the future but I dont trust him and I also don't want to tell him anything about me. I just don't know, I get a kind of dishonest, sneaky energy of him, especially what he did to me during the exams (like standing behind me most of the time and staring at me like he was controlling me). I have noticed in general, that he is more tensed up and serious with me than with my other white fellow students even though I am very quiet, don't act up, the only bad thing I did is having not so good grades but even then ... \n\nI really want to trust him but I just don't get that close \"teacher-student\" trust bond with him and mostly hold my distance. \n\nWhat do you think?\n\nP.S. I am the only black person in the whole study program, all others are white, including the lecturers and my study director.",
    "title": "I don't trust my study director and I don't know why.",
    "subreddit": "blackladies",
    "timestamp": 1683223183,
    "score": 17,
    "keyword": "black director"
  },
  {
    "text": "What are your \"vintage\" film faves that have a black/afrocentric focus? I just spent time watching A Warm December on TCM (Turner Classic Movies) this afternoon. \n\nThe film is from 1973, and has a lot of things that would be problematic by today's standards,  but it was still nice to watch a cozy romance on a Sunday afternoon. \n\n\n* problematic points include creating a fictional African country and populating it with a mish-mash of South African (music cameos),  east African (random Swahili sound bytes), and Francophone west African /Senegalese (clothing) cultural references. \n\nThe black cast is predominantly afro-Caribbean, so the accents don't quite hit either, and the lead actress is clearly wearing a foundation that darkens her natural skin tone to make her fit the role (think Zoe Saldana as Nina Simone).\n\nAll that aside, the love story is sweet, the wardrobe actually got me thinking of how I could incorporate more vintage looks in my style this summer, and it was interesting to see a black film from 50 years ago.  \n\nLead actress, Esther Andserson, won a NAACP Image Award for her performance (Best Actress category).  \n\nBonus points for a gratuitously topless scene featuring Sidney Poitier strolling through an English meadow. His companions are in long sleeve tops/turtlenecks, so it wasn't THAT warm,  but 🔥🔥🔥 Sidney could get it, and he was the director, so I'm not complaining.",
    "title": "What are your \"vintage\" film faves that have a black/afrocentric focus?",
    "subreddit": "blackladies",
    "timestamp": 1682271695,
    "score": 13,
    "keyword": "black director"
  },
  {
    "text": "Shoutout to The Whale for its Asian American portrayal Haven't seen The Whale mentioned so thought I'd bring it up. As I don't watch trailers, I didn't know there was gonna be a prominent Asian American character in it, just watched because I like the director Darren Aronofsky a lot. The Asian American character is just a regular Asian American living her regular life in the US like Asian Americans IRL, no \"hONoRR\", poor English, \"exoticness\", or other stereotypes often seen in American movies featuring Asian characters. As for the movie itself (no spoilers), it's the same director of Requiem for a Dream, Black Swan, The Wrestler so it falls under the same vibe of bleak yet amazing movie. The Whale has some really powerful delivery, even I teared up a bit during its climax and I'm pretty stoic (felt nothing watching Anohana lol). All the actors did an amazing job, the characters felt real, and it's beautiful how everything got tied together. Totally recommend",
    "title": "Shoutout to The Whale for its Asian American portrayal",
    "subreddit": "asianamerican",
    "timestamp": 1672692700,
    "score": 148,
    "keyword": "black director"
  },
  {
    "text": "APA: \"Boys are facing key challenges in school. Inside the effort to support their success\" [https://www.apa.org/monitor/2023/04/boys-school-challenges-recommendations](https://www.apa.org/monitor/2023/04/boys-school-challenges-recommendations)\n\n**Published in a lengthy article on 01-April-23**\n\nFirst section is just background and facts/stats\n\nSecond section below:\n\n>**Making the case for boys**  \n>  \n>The reasons for that are rooted in the way schools are set up and how boys are socialized. At the biological level, boys are at higher risk for inattention, hyperactivity, and externalizing behaviors (Tuvblad, C., et al., Journal of Abnormal Child Psychology, Vol. 37, 2009). Classrooms, meanwhile, typically require students to sit quietly and self-regulate—what some call the “sit and get” approach to education. When boys struggle with that, getting out of their seat or ignoring a teacher’s instructions, for example, they are often punished for it. **Boys, particularly boys of color, are disciplined at much higher rates than girls, starting at ages 4 and 5**  \n>  \n>***“The fact that children, primarily boys, are being suspended and expelled for these behaviors so early on is incredibly alarming and problematic,”*** Reigeluth said.  \n>  \n>Research shows that boys tend to receive more severe punishment than girls for the same behaviors, especially if they are Black or have a bigger body type, pointing to bias in the application of school policies, Those racial disparities in suspensions and expulsions predict higher rates of incarceration, lower college enrollment, and worse overall health.  \n>  \n>Compared with just 10% of female students, 18% of male students are diagnosed with learning disabilities and referred to special education services). Like boys who are suspended and expelled, these students often disengage from school and experience worse academic outcomes as a result.  \n>  \n>Perhaps the most pervasive—and most entrenched—challenge that plagues boys at school is their gender socialization. As boys grow up, adults and pop-culture messages often push them to project an image of dominance, indifference, and self-sufficiency while hiding vulnerability, curiosity, and the need for intimacy. They see male role models in the media succeeding in athletics, business, and entertainment, but few in academia. They learn that school isn’t “cool”; that it’s better to excel at sports.\n\n**This is interesting:**\n\n>Despite these troubling disparities, it can be tough for those studying and advocating on the issue to make the case that boys and men require more attention and resources.  \n>  \n>**“How do we acknowledge and address the fact that even though men hold more structural power in the U.S.—in Congress, as CEOs, and as billionaires—there are also men and boys who are struggling substantially?** How do we help the ones who are struggling, without further ‘padding the pockets’ of those who are doing well?” said Andrew Smiler, PhD, a clinical psychologist based in Winston-Salem, North Carolina, and cochair of the TFBS\n\n**Third Section:**\n\n>**Opportunities for engagement**  \n>  \n>This section talks about how to get boys to engage in school better an overcome stereotypes.  \n>  \n>“***When a boy is presenting in a way that seems to be resistant to learning, we should take time to understand what’s going on, rather than immediately disciplining him,”*** Reigeluth said. Rather than a behavioral problem, Smiler said, a boy who is acting out or not completing schoolwork could have a learning disability, attention-deficit/hyperactivity disorder, poor vision, a chaotic home life, or feel social pressure about not wanting to appear engaged in school.  \n>  \n>**Fourth Section:**  \n>  \n>**Interventions that work**  \n>  \n>Given the degree of disparity boys face, some advocates are proposing more sweeping changes. **“Redshirting”** boys, or starting them one year later in kindergarten (different from holding a child back for documented developmental reasons), has become popular in some high-income communities. But psychologists say the practice isn’t yet backed by research. In fact, for boys at highest risk, the opposite approach—giving all children access to affordable, high-quality preschool—could help more.  \n>  \n>Another intervention with growing support is single-sex education, particularly for boys of color. Research is still limited, but Nelson is involved with a national effort to evaluate the efficacy of such schools, which some community leaders believe are a possible solution to the bias and disparities boys of color face in U.S. public schools. So far, this research has found that single-sex schools excel in parent and community engagement, as well as racial and gender identity development.  \n>  \n>**“The school environment becomes a context where boys can explore and examine, where there’s a lot of possibility, rather than another context in their lives where stereotypes of Black men and boys are imposed,”** Nelson said.  \n>  \n>Many feel that offering interventions before and during the K–12 years is the best way to support healthy development and help boys thrive at school. But men in college can benefit from help, too, which is why some higher education institutions are creating “male success centers,” to provide a place of community and support for men on campus.\n\n**This is a bit suspect to me:** It looks like a male feminist training program of all men's problems are men's sexist, racist, male privilege attitudes.\n\n>At Northwestern University, Hill leads NU Men, a 6-week mentoring program where participants deconstruct masculinity as a means of violence prevention. For example: What does it mean to be masculine? What are men expected to do to obtain power (be the breadwinner, initiate sex)?  \n>  \n>Hill also oversees Northwestern’s Masculinity, Allyship, Reflection, Solidarity (MARS) peer education group, which examines policy related to gender and violence, combats rape culture, and promotes healthy masculinity on campus. In 2019, members of the group wrote to the Trump administration about proposed changes to Title IX regulations. For example, they argued that live hearings could put survivors of sexual violence at risk of further trauma by requiring them to confront their attackers. Hill also consults with other universities and organizations to help them hire and train their own masculine engagement directors.\n\n**Closing statement:**\n\n>Ultimately, to help boys at school, the task force’s plea is simple.  Review the evidence, see this gender gap for what it is—an equity  issue—and act.  \n>  \n>“This is an equity issue, full stop. It’s systemic, it’s  consequential, it’s impactful. It’s between groups that we can readily  identify, and it cuts across multiple contexts,” Boutakidis said. “If  there’s something we can do to address it, we absolutely need to.”",
    "title": "APA: \"Boys are facing key challenges in school. Inside the effort to support their success\"",
    "subreddit": "MensRights",
    "timestamp": 1682816809,
    "score": 81,
    "keyword": "black director"
  },
  {
    "text": "Teen girls ‘engulfed’ in violence and trauma, CDC finds There was/has been an increase in domestic violence in general during the COVID pandemic. That fact is somewhat widely known. According to this Washington Post article, there has also been an increase is rape against teen girls and increased depression among teen girls.\n\n\"... Almost  15 percent of teen girls said they were forced to have sex, an increase  of 27 percent over two years and the first increase since the CDC began  tracking it.\n\n'If  you think about every 10 teen girls that you know, at least one and  possibly more has been raped, and that is the highest level we’ve ever seen,' said Kathleen Ethier, director of the CDC’s Division of  Adolescent and School Health, who said the rise of sexual violence  almost certainly contributed to the glaring spike of depressive  symptoms...\n\n... Ethier said it’s important to determine who is perpetrating the  violence, which the survey did not address, and how it can be stopped.\n\n... Lesbian, gay, bisexual and questioning students were significantly more  likely to experience violence than their heterosexual peers. They were  also more likely to be electronically bullied and to report persistent  sadness or hopelessness. \n\n... Black and Hispanic students were more likely than White and Asian students to avoid school because of safety concerns...\"\n\n[https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl\\_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp\\_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87](https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87)",
    "title": "Teen girls ‘engulfed’ in violence and trauma, CDC finds",
    "subreddit": "Feminism",
    "timestamp": 1676335624,
    "score": 633,
    "keyword": "black director"
  }
]