[
  {
    "text": "Got a first write-up at my job. Happened once and I feel like they have started to micromanage. Hi,\n\nI work at this gas station for about 6 months. I have previous experience and everything is the same where I worked before so no challenges. They only give me 36 hours a week which they split the hours into 6 days and I have no real freedom. We do solo shifts which is easy though.\n\nIt all started with my manager's boss, he would edit my hours to save payroll. When I realized and brought it up, my manager's boss said he would fix it and never did and my manager who is always friendly told me I shouldn't bring it up to higher ups otherwise it could make me lose my job. Well her boss got fired and was replaced by someone who ain't better. \n\nHer new boss assumed that one of us is being stealing merchandise because the inventory numbers were wrong and I feel like they assumed it was me. Judging from the camera it was my coworker and they haven't fired him at all yet. I have been micromanaged like not allowed to wear any long sleeve shirt under my work skirt or about my shoes not being fully black but having a bit of white. All of this started with the new boss. Today I received a write up over the lunch penalty for covering a graveyard shift and taking my break later over being busy. It happened 2 weeks ago and only o once and I just got a write-up. \n\nWhen I  brought up being working so much and taking care of the store and covering, they did not care. Same with the time they did not pay me for, they say they have no responsibility over what the old supervisor was doing.\n\nShould I just get a new job immediately and not even give a 2 weeks notice?",
    "title": "Got a first write-up at my job. Happened once and I feel like they have started to micromanage.",
    "subreddit": "jobs",
    "timestamp": 1614476775,
    "score": 6,
    "keyword": "black judge"
  },
  {
    "text": "Black men of Reddit that went to a courtroom, how did the judge treat you?",
    "title": "Black men of Reddit that went to a courtroom, how did the judge treat you?",
    "subreddit": "AskReddit",
    "timestamp": 1622142271,
    "score": 2,
    "keyword": "black judge"
  },
  {
    "text": "How women and minorities are claiming their right to rage (Why do many think it acceptable for the white judge Brett Kavanaugh to lose his cool in public, but not the black tennis champion Serena Williams?)",
    "title": "How women and minorities are claiming their right to rage (Why do many think it acceptable for the white judge Brett Kavanaugh to lose his cool in public, but not the black tennis champion Serena Williams?)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1634049766,
    "score": 1029,
    "keyword": "black judge"
  },
  {
    "text": "I don't think people have a grasp on how bad it is to be a girl. I'm not saying being a girl is bad, but sometimes I'd rather not be. And I guess this post is to just to vent it out.\n\nI was walking the lady's kids to the bus stop when it hit me. Being a girl sucks. \n\nI've been alive for 18 years and I feel like quitting. So much is expected from us. So many things we're *supposed to do* as a girl.\n\nNot to mention how bad growing up as a girl is. My mother constantly reminded me that there are people who will *FUCKING RAPE YOU* if *YOU* aren't careful.  \"Boys get sexual assaulted too!\" Yes, yes I know. But not to the extent for females. 1 in every 3 or 1 in every 6 girls have been assaulted in some sexual way. As infants, as toddlers, and teens, as grown women.\n\nAnd you know what???\n\nI'm one of those 1 and every 3. I was 7, fucking 7. By who? My own family. \"Don't wear skimpy clothes\", \"stop giving signals\", \"stop acting like a slut\", excuses by men and traitorous women. Trying to *JUSTIFY* why it's mine, your, our fault we were hurt. Wtf is going on?!\n\nThis is the first time I came out about it in a public platform. Why did it take so long? I don't know. That is the problem, we're afraid. I was afraid. But I guess I don't care anymore. I won't stay stuck on it. Those two teens became men with families. They have daughters who they love and cherish. But they know what they did. And I hope they remember it each time they see my face. I hope they remember how disgusting they were. They might've even thought I forgot about it. But I didn't. \n\nI hate my past, but I hate my future even more. All this toxic \"if you're my girlfriend, I *own* you.\" These young teen boys who are feeding and being fed this fantasy that girls are to be kept, to be owned. No. I want to be with you, not *for you*. These poor Asian women who are labeled as submissive house wives and child like. Black women labeled as side girls and hoes. Hispanic women being labeled as aggressive and bitches. No, no, no, no. Wtf is happening?!\n\nDon't even get me started on the Pink Tax. I'm not going to pay $4 more for a pink razor! I don't want want to spend $100 a year for pads and tampons. I don't want your targeted ads. I DONT WANT YOU TO PROFIT OFF MY GENDER!!!\n\nI'm tired of girls judging others girls for not *fixing themselves up.* Some girls wear what they wear because of past experiences. Why don't wear makeup? Because I don't want attention. Throughout highschool, my fellow peers have looked at me like I'm meat on display. I've been catcalled. I've been ass tapped and was told by him \"sorry, I didn't mean to!\" MOTHERFUCKER you're a like a foot taller than me! And you tagged my ass? Do you know how far down you have to go to make that possible? The waist, fine. The shoulder, fine. But my ass?! No, you know what you did. I know what you did. And I wasn't the only one, the week after another boy did the same *accident*. I wish I had the strength and fire she had, she called him out. When the gym teacher asked if she could forgive him, \"fuck no!\" I wish I had that strength.\n\nShit like this is why I wear baggy clothes, so I don't get that attention. So no one will see *what my mama gave me*. Don't judge a girl for looking the way she does. Don't judge her for wearing makeup or lack of. I degrade myself so I won't be treated like meat. When I dress up, it's not for you. It's. For. Me.\n\nI'm going to stop before it gets too long.\n\nIf anyone reads this, thank you. Thank you so much. I can't vent an essay to my friends, but reddit is a little different.\n\nAnyways, sorry for bad formatting and grammar.\n\nThank you,\n\nSam ʕ·ᴥ·ʔ",
    "title": "I don't think people have a grasp on how bad it is to be a girl.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1620135204,
    "score": 854,
    "keyword": "black judge"
  },
  {
    "text": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us? It kinda hurts a bit. I'm already an awkward kinda person, and I do know stats say black women and Asian men are the least desirable in the dating world. But it's like, a punch in the face when there's black men out there who refuses to even consider someone looking like you, while in the same breath want to be treated fairly, not judged and have their skin color not be an issue to the world.\n\nAnd then there's the colorism in it. \"I only go for light skinned girls/mixed.\" Everyone has preferences, but this is on par with racists who particularly don't date a specific race because [bigoted racist reason] if not worse because like.... These dudes *know* the struggle of being discriminated on and are actively doing it.\n\nI guess it's something that's been bothering me and I dunno how much it gets discussed. It just makes me feel ugly because I haven't done anything yet, black men already cross me and many women off just based off stereotypes. So much shit gets thrown in about us just by appearance alone without even saying a hi.\n\nNot quite the same, but it made me think of when I was inpatient at a hospital. Young gay black man assumed all this stuff about me just due to my appearance (dunno how because we all look beat up coming into the hospital at all times in the day) and when he actually got to know me, whole new opinion. Thought I was loud, \"ghetto\" etc while uh, I wasn't? But I know he wouldn't like it if people assumed he was in a gang, drug dealer, and likes to watch grab dicks for fun. It's a real slap in the face. But, it's nothing new for me and many other black women out there.",
    "title": "Do other black women feel similar when you personally know black men who refuse to date someone who looks like us?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625608005,
    "score": 138,
    "keyword": "black judge"
  },
  {
    "text": "Texas Abortion Resource Megalist \n#Need help? Want to help?  \n\n#Abortion access resources below  \n\n\n\n🚑🚑🚑\n\n##Abortion and Travel Funding  \n\n\n**TEA Fund** 🇺🇸 (Texas)\n\nhttps://teafund.org/about/  \n\nTexas Equal Access Fund is a charity that provides funding for abortions to northern, eastern, and western Texans who can not otherwise afford it.  \n\nTo donate to TEA Fund, visit https://teafund.org/donation/\n\n\n**Lilith Fund** 🇺🇸(Texas)  \n\nhttps://www.lilithfund.org/  \n\nThe Lilith Fund is a charity that provides funding for abortion to central and southern Texans who can not otherwise afford it.  \n\nTo donate to Lilith Fund, visit https://www.lilithfund.org/donate\n\n**Frontera Fund** 🇺🇸(Texas)\n\nhttps://fronterafundrgv.org/\n\nFrontera Fund is a charity that provides funding for abortion to Texans in the Rio Grande Valley who can not otherwise afford it.  \n\nTo donate to Frontera Fund, visit https://secure.everyaction.com/OYACioIzMUaFmdTg_Wh2Kw2\n\n**Buckle Bunnies** 🇺🇸(Texas)\n\nhttps://www.bucklebunnies.org/\n\nBuckle Bunnies is a charity that provides funding for abortion to Texans who can not otherwise afford it.  \n\nTo donate to Buckle Bunnies, visit their shop at https://www.bucklebunnies.org/c/shop\n\n**WRRAP** 🇺🇸 \n\nhttps://wrrap.org/about-wrrap/  \n\nWomen’s Reproductive Rights Assistance Project provides funding for abortions to Americans who can not otherwise afford it.  \n\nTo donate to WRRAP, visit https://wrrap.org/donate-shop-volunteer/\n\n\n**NNAF** 🇺🇸  \n\nhttps://abortionfunds.org/  \n\nNational Network of Abortion Funds provides funding for abortions to Americans who can not otherwise afford it.  \n\nTo donate to NNAF, visit https://donate.abortionfunds.org/give/323375/#!/donation/checkout\n\n\n**The Brigid Alliance** 🇺🇸  \n\nhttps://brigidalliance.org/  \n\nThe Brigid Alliance provides travel funding to reach out-of-state clinics to Americans who can not otherwise afford it.  \n\nTo donate to The Brigid Alliance, visit https://brigidalliance.org/donation\n\n\n**Fund Texas Choice** 🇺🇸(Texas)  \n\nhttps://fundtexaschoice.org/  \n\nFund Texas Choice is a charity that provides Texans with travel and accommodation funding so that they may exit the state to access an abortion elsewhere. They have stated that they will continue to provide this service regardless of the new laws.  \n\nTo donate to Fund Texas Choice, visit https://fundtexaschoice.org/donate/\n\n\n**The Bridge Collective** 🇺🇸(Texas)  \n\nhttps://thebridgecollective.org/  \n\nThe Bridge Collective is a charity that provides transportation to abortion appointments within 100m of Austin, Texas. They also provide emergency contraception and pregnancy tests to patients in the area.  \n\nTo donate to The Bridge Collective, visit https://thebridgecollective.org/giveback\n\n\n**Yellowhammer Fund** 🇺🇸(Alabama)  \n \nhttps://www.yellowhammerfund.org/  \n\nThe Yellowhammer Fund services Alabama and the Deep South, and includes those travelling *to* Alabama for a procedure. They offer funding for abortion services, travel needs, food and lodging and other expenses that often hinder a person’s ability to easily access their right to an abortion.  \n\nTo donate to the Yellowhammer Fund, visit https://action.yellowhammerfund.org/onlineactions/VJwyf79UF0yW0qhFnyakGw2\n\n\n\n💊💊💊\n\n\n##Abortion Pills\n\n**Plan C** 🇺🇸  \n\nhttps://www.plancpills.org/  \n\nPlan C uses a variety of methods to provide access to abortion. In restricted states, they even offer a step by step guide on getting pills in the mail by a mail forwarding system that uses another state as a middleman, thereby hiding the purchase and receipt of abortion pills. They also offer degrees of clinical involvement, from nothing at all to full doctors visits, depending on the patient’s wishes  \n\nTo donate to Plan C, visit https://www.plancpills.org/donate\n\n\n**Aid Access** 🌎\n\nhttps://aidaccess.org/  \n\nAid Access is an online resource where a patient can email a team of certified doctors to receive a consultation, information on where to access abortion pills in your area, and information on how to use them. They include follow-ups to ensure the patient has had a successful abortion and is in good health.  \n\nTo donate to Aid Access, visit https://aidaccess.org/en/page/301373/support-aid-access\n\n\n**Women on Waves** 🌎 \n\nhttps://www.womenonwaves.org/  \n\nWomen on Waves and Women on Web offers information on sex education as well as abortion, and can provide patients with information on how to acquire and use abortion pills in their area. They list local organizations per country to assist women in accessing abortion.  \n\nTo donate to Women on Waves, visit https://www.womenonwaves.org/en/donate\n\n\n\n⚖️⚖️⚖️\n\n\n##Legal workarounds\n\n**Jane’s Due Process** 🇺🇸(Texas)  \n\nhttps://janesdueprocess.org/  \n\nJane’s Due Process is a resource for under 18s who require a **judicial bypass:** permission from a judge that allows a person under the age of 18 to consent to abortion care without parental involvement.  \n\n*”Jane’s Due Process helps young people in Texas navigate parental consent laws and confidentially access abortion and birth control. We provide free legal support, 1-on-1 case management, and stigma-free information on sexual and reproductive health.”*  \n\nTo donate to Jane’s Due Process, visit https://janesdueprocess.org/donate/\n\n\n**TST Reproductive Rights Campaign** 🇺🇸  \n\nhttps://announcement.thesatanictemple.com/rrr-campaign41280784  \n\nThe Satanic Temple supports bodily autonomy, and as it is recognized as a religion in the USA, this makes their “abortion ritual” protected by religious liberty laws. One’s devotion to the TST may be transient as it suits them.  \n\n*In accordance with the Religious Freedom Restoration Act (RFRA), first trimester abortions are now exempt from unnecessary regulations for all individuals practicing The Satanic Temple’s religious abortion ritual.*\n\n\n🤲🏼🤲🏾🤲🏿\n\n##Related Charities\n\n**Sister Reach** 🇺🇸  \n\nhttps://www.sisterreach.org/  \n\nSister Reach focuses of safe sex education and on pregnancy and STD prevention. They can supply safe sex kits by mail that include male and female condoms as well as emergency contraception.  \n\nTo donate to Sister Reach, visit their main page.\n\n\n**The Afiya Center** 🇺🇸(Texas)  \n\nhttps://www.theafiyacenter.org/  \n\nThe Afiya Center works to promote reproductive health and rights, including access to abortion, with a focus on the black Texan community.  \n\n*”The Afiya Center (TAC) was established in response to the increasing disparities between HIV incidences worldwide and the extraordinary prevalence of HIV among Black womxn and girls in Texas. TAC is unique in that it is the only Reproductive Justice (RJ) organization in North Texas founded and directed by Black womxn.”*  \n\nTo donate, visit https://www.theafiyacenter.org/donate\n\n\n**Avow Texas** 🇺🇸(Texas)  \n\nhttps://avowtexas.org/  \n\nAvow is an educational resource and a voice in defence of abortion rights.  \n\n*”Avow is a c4 non-profit that works to secure unrestricted abortion access for every Texan. Avow Foundation for Abortion Access is a c3 non-profit that works to educate Texans on the importance of abortion access. Avow PAC is a political action committee that works to elect champions for abortion access.”*  \n\nTo donate to Avow Texas, visit https://secure.actblue.com/donate/avow?refcode=we21\n\n❤️❤️❤️\n\n##Other important info:\n\nFor more support, or just someone to talk to, visit r/auntienetwork on Reddit.\n\n\n⚠️⚠️⚠️\n\n##Be on watch for Fake Abortion Clinics\n\nThere are a large number of fake abortion clinics, or Pregnancy Crisis Centres in the US. Their goal is to use any method they can to stop you, whether this is emotional blackmail, or simple delaying tactics to take you past the point an abortion is possible.\n\n[Clinics to avoid: Map 1](https://crisispregnancycentermap.com/)\n\n[Clinics to avoid: Map 2](https://www.exposefakeclinics.com/cpc)",
    "title": "Texas Abortion Resource Megalist",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630785477,
    "score": 64,
    "keyword": "black judge"
  },
  {
    "text": "I keep getting catcalled by men of a different race. I hate myself for it, but I'm getting weary around them. I am white and live in Western Europe. Today a black man followed me around a store, standing close behind me trying to get what I was getting whatever I reached for. It was quite empty in the store.\n\nThis wasn't an isolated incident. A large part of comments etc. I get come from black men, which just seems disproportionate.\n\nMy (black) ex said it might be coming from a lack of opportunities, and the image that is projected in the media.\n\nI notice myself growing weary around black men, and I hate it. I don't wanna be racist, I don't wanna judge people by the color of their skin.\n\nI don't know what to do.",
    "title": "I keep getting catcalled by men of a different race. I hate myself for it, but I'm getting weary around them.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1628363776,
    "score": 65,
    "keyword": "black judge"
  },
  {
    "text": "My rapist and his professional bluegrass musician girlfriend are using her social capital to silence me after I went to the police. I feel like I've failed SA victims. CW: Rape, physical assault, cyberbullying/letters/phonecalls, suicide attempt, false arrest, probably other triggers so please take care - \n\nI'm putting the TL;DR at the top because I basically wrote a novel.  If you read any of this, I'm really grateful.  I wanted to get this out in a safe environment, as I haven't been able to discuss it with many people. \n\nTL;DR - after I was raped by my 'friend' and former teacher,  I warned his new professional bluegrass musician girlfriend (a recent divorcee with three young children) about his treatment of women and his substance abuse. I suggested she encourage him to get therapy and substance abuse treatment. She said he was the most compassionate guy she'd ever met. \n\nWhen she later found out I was speaking to the police about her boyfriend raping me from a third party,  she created a couple of facebook posts that utilized her cachet as a public figure to doxx me, discredit my claims, have her fans harass my family and their business via every means possible, and have me removed and ostracized from the community.  After seven months of no contact, she baited me into talking about the rape by messaging me and appealing to common experience.  She then used that message along with fabricated and altered evidence to have me arrested on a charge of computer harassment.  \n\nOnce the case was dropped by the state,  I sent an email regarding what happened using pseudonyms for all involved to bluegrass community leadership in an attempt to convince them to hire a third party safe venue/ victim advocate who could establish standardized protocols to deal with harassment and sexual assault.  The girlfriend addressed her followers on facebook again,  this time directly stating I was lying about the rape and abuse, and that my actions diminished the efforts of 'real' victims.\n\nI feel like a worthless failure. I wasn't able to really help anyone.  I constantly wonder if she,  the rapist, and her fans are right and I should just finish it off and be silent forever.  It hurts every day that the rapist and his friends continue to run around, emboldened and vindicated in their behavior.  I worry for my niece,  my cousins,  and my friends' little ones.  I'm terrified about having a child and having to raise them in this area, as my rapist is still nearby.  I don't want to bring them into a world of rapists like 'Ted',  vindictive, faux feminist rape apologists like 'Rita', hypocritical BE KIND types,  and all the other malevolent beings like cops who kill Black folks over tail lights and the never ending stream of sex pests in positions of authority.\n\nDid I do everything I could? Did I help or hinder the progress of sexual assault advocacy? I'm afraid other victims will be scared to speak up seeing what happened when I did. I want so badly to help other victims, and to prevent this from happening to anyone else. \n\nI hate myself.  I'm worthless.  That's why I've been raped twice and thousands of people have said I deserve to be beaten and to disappear. I wish I had done more to mentally protect myself from a predator like Ted, and I blame myself for what happened.  \n\n\\------------------------------------------------------------------------------------------------\n\nAfter moving to a new area far from my hometown,  I started banjo lessons in July 2018 as an avenue to make friends.  I asked my teacher, Ted, to help me find jams and such to join,  which is typical in bluegrass/ old time music as they are based on community participation.  At this time, I also admitted I had issues making friends because I'm scared of men after being raped when I was 20. I brought this up because most jams are almost exclusively attended by men. As he was a teacher,  I figured he was trustworthy. He invited me and some other students out to events after that.\n\nI changed teachers after six months because Ted wasn't an engaged instructor. I stopped speaking with him at this point. About two months later, he messaged and asked if I wanted to be friends. He also offered to help me integrate into the community.  At the time,  my partner and I were separated,  so I was happy to accept any help. I did ask my parents what they thought about Ted's invitation.  My dad was emphatically against the idea,  stating he didn't think Ted was being honest about his intentions. I thought it would be okay,  since he was vetted to teach lessons to children at the community center and seemed well known by the local bluegrass group.\n\nIn our initial meeting as peers, Ted opened by saying 'I was born to be given away.' Even though I loathe him,  I won't elaborate on that point other than to say I think it forms the basis of his issues. He told me he didn't have a lot of friends who were women,  so he was happy to talk to one so he could 'explore his feminine side.' He also spent a lot of time talking about his wife, Loretta. He wanted advice regarding her 'nagging' when it came to his drug and alcohol use around her son,  his jealousy over her male friends, and her suspicions he cheated on her. He also thought she lied about being sexually assaulted and wanted to know why someone would do that. He talked about his time in New Orleans,  and how he discovered he had the ability to turn his emotions off at will. There was also a discussion where I talked about how I had difficulty fitting in with most groups.  He said that other folks are 'shadow people'. I replied that I personally consider it important to never elevate myself,  or to 'other' people,  because that's how violence, bigotry,  and fear are sown. He hastily agreed.\n\nWhen I messaged him later to give him the requested advice on how to improve the relationship with his wife,  he said i misunderstood him. He claimed they were divorced and he was never going back.\n\nThe next time I saw Ted,  he kissed me.  He immediately pulled back and stated he didn't want a relationship,  but that we could be friends and he could help me.  I didn't consider myself emotionally  available,  but I did want his assistance in the community. We discussed it a bit more. The terms included that he'd continue sleeping with other people,  but that he'd practice safe sex and be respectful of me. I also begged him to not mistreat me in light of my prior rape experience. We then had sex.\n\nThe next time we had sex,  he did something that frightened me.  While I was on top,  he grabbed me by the throat and propelled me into the air.  He's at least 6' and stocky. I'm a little over 5' and small.  I immediately asked him to stop,  and told him it reminded me of my rape.  He then covered my face with his large hand,  but I managed to move off of him.  Afterwards,  he asked me to tell him about the rape.  I did so,  while crying in his arms.  I particularly emphasized how the rapist held me down by the throat. He became aroused.  Then,  he left. \n\nWe continued a routine of going to shows or jams on the weekend,  then having sex. He wouldn't speak to me during the week.  He made a point of never saying goodnight when I said it as we'd leave. He discussed his desire to move within the next year to be around the young college musicians in Tennessee. He hated being in the area around the 'inferior' musicians,  although he felt some obligation towards his parents to stay close by. He lamented that the band he'd been in in high school almost 'made it' . He said he was glad I wasn't like his crazy ex partners.\n\nI responded that he could teach students and raise them to his level.  I noted the other local musicians were well loved,  because they're affable and relatable and art is more than technical proficiency.  Just ask Johnny Cash.  I pointed out young people tend to prefer playing with each other, but that I thought a move might benefit him.  I wish I'd said more about the 'crazy' partners.  It was an ill portent.\n\nA couple of weeks later,  he left for a few weeks to go on tour.  I messaged him, and asked if he'd let me know how it was going and try to respond on occasion.  He sent back a diatribe telling me it wasn't my place to ask anything of him since we weren't dating,  and threatened to cut off our arrangement if I didn't behave.\n\nWhen I saw him again,  he was different.  Although he'd never been a particularly well groomed or emotionally responsive person,  he had clearly atrophied more in this regard. He was almost an hour late to the venue.  He explained that he started drinking at work,  then picked up more beer at the 7-11, then continued to drink at home until he passed out.  He relayed this while sitting there with disheveled, unwashed hair. Alcohol,  body odor,  cigarette smoke, and weed dankness wafted off him in an almost tangible entity.\n\nHe told me about his trip.  He spent the entire time microdosing shrooms along with his usual drinking and heavy marijuana use. He spoke of using cocaine to stay awake while driving.  He talked about how amazing it was to be out there with a band with whom he had a compatible vibe.  He mentioned sleeping with other women,  patronizing sex workers at the clubs and why he enjoyed it,  and how he wanted to cast or carve a statue of his penis.  He loathed being back, and whined again about the area and having to play with local musicians again.\n\nLater,  while having sex,  Ted said some creepy things,  like that I looked like a teenager.  I asked him if that was supposed to be a positive,  given we are both in our 30s. He enthused that it certainly was. I mentioned how I do not feel like an attractive person.  He pointed out the guys who talked to me at the venue. I could tell he was upset about them. He talked about how he fantasized about me when I was his student. Then, during sex,  he did the choke propel move again.  I grabbed his hand and reminded him why I didn't like it. \n\nThe next day and morning, June 28/29th 2019, are the ones seared into my memory.  I arrived at the venue around 9 PM. He came to say hello a while later before wandering off to drink and talk.  After the show,  I mostly talked to his band leader, Mop. This was typical of our outings as I was trying to make friends and we were avoiding looking like a couple.  We left the venue after midnight and went to a parking lot for a trailhead.\n\n\\*\\*\\*DESCRIPTION OF THE RAPE AHEAD\\*\\*\\* \n\nThe liaison started normally.  We were in the front of the vehicle,  then we moved to the back.  As he lived with his parents and I was living with my former partner until I saved enough money,  we typically used my vehicle.  Usually we would put  the back bench to make room.  This time,  he seemed to be in a hurry. He didn't put the bench down. He didn't remove his filthy boots.  Instead,  he pulled his pants off over them. We were making out on the right side of the bench when he said 'I just want to be inside you.' I moved to sit on the left side of the bench while he positioned himself in front of me in the foot well. Suddenly,  he grabbed my throat again.  I said,  \"please, no,  stop!\" Then, as I tried to say more, I blacked out.\n\nWhen I rejoined the world,  he was removing himself from inside of me.  He was acting strangely,  so I asked,  \"are you okay?\" He moved to the other side of the bench.  My legs were painfully arranged.  One was propped up on the driver's seat in front of me. The other was twisted out to the side.  My left hip was ground into the door molding.  I had difficulty moving.  Everything hurt. \n\n\\*\\*\\*\\*\\*\\*\\*\n\nI knew something wasn't right. But I cuddled him,  and convinced myself it was all okay. I hate myself for that, but it was one of the few times he let me touch him.  He said he had to leave because he was taking band photos in a few hours.\n\nI was disoriented and attempted to find my clothes. After rearranging myself,  he offered to have me follow him back to town.\n\nHe'd never offered anything like that to me before.\n\nAfter we parted paths,  I pulled over and cried. \n\nWhen I got back to the house,  it was later than usual.  My former partner,  Arthur,  came out and asked if everything was okay since I was coming in so late.  Arthur knew that I had been attending events with Ted. He noticed I was crying and that my neck was red.  He asked if I was okay, and if I needed help, or to go to the hospital.\n\nI declined,  and ran to shower.\n\nThe next day,  I found bruises all over myself.  They were concentrated on my left hip and all over my thighs,  but especially up near my crotch.  I also found bruises all over my right arm.  Scratches had formed on my right thigh.  I remembered that I had asked Ted about his usually long nails that were only on his left hand,  the one he used to fret the fiddle.  For the non musicians,  nails inhibit playing string instruments,  especially violins and fiddles. I took pictures of every injury I could find.\n\nAfter that night,  Ted mostly stopped talking to me.  I sent a message asking for his phone number,  which he ignored.  I saw him at a couple of events. When I tried to talk to him about what happened,  he'd ignore me and say he was going through a difficult time after the trip.  Online,  I asked him what had happened that night.  I pointed out he was being even more angry than usual,  and drinking heavily.  I was trying to get answers for something my mind was keeping from me. I didn't want to believe that after the times I talked about the issues from the first rape; after I'd pleaded for him to treat me like person, and most of all,  given that I had told him NO three times when he grabbed my neck, that something atrocious had occurred.\n\nIn the middle of July,  he sent me a message saying a sea shanty night was happening nearby.  It was the first time since that night that he'd told me about any events. When I arrived,  he was there with other local musicians.  Some time later,  Rita appeared.  Rita is a professional banjoist.  I had followed her band page for some time.  She posted extensively about her life - she had shared custody of three kids,  she was recently divorced,  she loved to travel,  and she desperately wanted a boyfriend, judging by her mention of looking for a cute guy at every show and her time spent on okcupid in every single blog update.\n\nAs an aside,  I have no idea how Rita ended up there that night.  I suspect Ted invited her,  as it was a very small event with little advertising almost an hour from where Rita lives.\n\nI was excited to meet another woman banjoist.  Rita had been sitting in the corner alone,  so I went over and started talking to her. We discussed being woman banjoists.  I mentioned how I had been having a difficult time with sexism in the community.  She said there were creepy guys who messaged her,  but overall, she just rolled with it.  Ted started talking to her.  They discussed accounting, and which musicians they disliked.  One of the other musicians invited us back to his place.\n\nRita mostly stood around,  as did Ted.  I tried to keep conversation going.  At one point,  I did hear them talking about the banjo she loaned to Ted.  I was confused,  since they'd acted like they didn't know each other.  I sometimes wonder if they were secretly dating during the time that he allegedly raped me.  A girlfriend,  a friend with benefits,  women he slept with while out of town,  and a wife all at once.  At any rate,  the other guys started talking about no name girls - women that guys like Ted would chase out of the community after a few weeks, so it wasn't worth learning their name.  This caused me to launch into an invective about every woman being a person and how ridiculous it was to speak that way.  Rita and Ted said nothing.  I wasn't surprised about Ted,  but Rita often posted about being a feminist and an advocate for women in the bluegrass community. \n\nI gave Ted some herbs to help with his alcoholism when we were leaving.  I tried again to find out what happened.  He said he was tired and didn't want to talk about it.\n\nMy last attempt came a week later, on July 19, 2019.  After a show, I approached him in the parking lot while he was loading.  Everything I said,  he repeated back to me in a mocking tone.  I was speechless and crying. I asked, why? again and again.  A friend of ours, Benedict,  came up to say goodbye, then quickly left when he heard Ted's tone.  Then Ted said he had to go,  shoved me,  and hopped in his vehicle.\n\nI went home and messaged him again, asking what I had done to deserve his cruelty.  Then I blocked him.\n\nI unblocked him later and said that while I didn't understand his malevolence,  I was reliant on him and his help to make friends and move on with my life in the community.\n\nThat's when he told me he was dating Rita, and that he hoped he'd see me around on occasion.\n\nI may not have fully processed what he had done to me,  but I certainly wasn't going to let it happen to a vulnerable mother of three kids.  I know my life is worthless,  but I'll never stand by and let others be abused.\n\nI messaged Rita and told her what had happened - what I remembered.  I sent her screenshots of all the unpleasant,  abusive things he said. I pointed out disturbing things I'd noticed,  like how he enjoyed me looking like a teenager,  and his habit of offering 'lessons' to teenage girls,  but not teenage guys.  I told her about his substance abuse problems. I told her how he complained about his wife asking him to stop doing drugs and drinking around her child. Then I stated it clearly - before dating someone with small kids, he needed therapy for his issues with women and substance abuse.\n\nRita told me he was the kindest guy she'd ever met; a beacon in a sea of dickheads,  and that she'd never let him go.\n\nTed messaged me.  He finally answered my questions.  He said it was all consensual,  that nothing he did was premeditated, and that everything else was my fault.  He told me that everything I told Rita was untrue and disrespectful. He told me that I should expect sexual harassment because of the way I dress,  and the preponderance of men in bluegrass.  I told him I'd always prioritize women and children over men like him.  He told me I was awful and blocked me.\n\nRita messaged me with more questions.  I answered as best I could.\n\nTed unblocked me and told me if I didn't stop talking to Rita,  he would tell the entire community I was crazy and about everything I'd done.\n\nI emailed Rita and apologized for bothering her. I told her he was threatening me,  and that I didn't appreciate that.  I wished her luck.\n\nEarly in September,  I attempted to kill myself. I'd rather not elaborate on that.\n\nLater in September,  I went to a campaign event for one of the musicians that was running for the board of supervisors.  I had been volunteering for him since April.  The entire time,  I was terrified Ted would appear.  I started shaking and crying at one point.  Benedict was there and I told him some of what had transpired. I met him the next day to talk a bit more.  He revealed that Ted was still married,  but complained often about his wife's nagging.  Benedict also mentioned that a couple of months after Ted married,  he started cheating on her.  One affair started at the large annual festival that much of the community attended.  He estimated since then that 5 or 6 women had been around him,  then disappeared.  He tried to encourage me to continue participating in local bluegrass events. I told him I wasn't interested, as Ted scared me.\n\nI emailed Rita again, telling her everything I'd learned and emphasizing he needed help.  She wrote back and said he was 'safe'.\n\nThroughout the fall,  Arthur and I decided to try again.  We began going on dates.  He was there for me as I talked about what had happened,  and how I was feeling.  We agreed to go to couples' counseling.\n\nThe last time I contacted Rita and Ted was early in December 2019. I was doing poorly by this point.  I don't know what I expected.  I just wanted to be acknowledged as a human.\n\nIn January 2020, I was cleaning out my phone when I found the pictures I took after the assault.  That was when my brain unlocked and I remembered what happened.\n\nBy this point,  I hadn't slept well in months.  I was depressed and lethargic.  I realized I needed help,  but wasn't certain how to get it.  I also felt panicked that Ted was out there,  with no one warning the other women.\n\nI tried contacting some music organizations that I thought might be able to help with restorative or transformative justice,  but sexual assault was not their purview. \n\nI reached out to someone I thought might understand - his 'crazy' ex girlfriend, Patsy.  She told me what he had done to her,  which was chilling.  She mentioned he'd moved and was living by himself.  That information scared me because he'd talked about holding lessons at his place once he had one. She encouraged me to go to the police. \n\nI also messaged his wife, Loretta. She was upset because they were married when he was sleeping with me (and all the other women). I apologized,  because I really can't imagine how that felt.  I wish I had known he was married.  I hate that I hurt her.  She suggested going to the police and contacting the sexual assault center.\n\nI contacted them a few days before the one year anniversary of that night.\n\nEveryone should know about these sexual assault/ social justice centers.   RAINN keeps a searchable database of these centers. They offer free counseling to survivors of sexual abuse and it is \\*lifesaving\\*.\n\nAfter a couple of weeks of counseling with the director of sexual assault,   I decided it was time to speak to the Special Victims Unit.\n\nThe sergeant encouraged me to find corroborating witnesses. I emailed Patsy and asked if she'd be willing to speak to the police as well.\n\nShe said she would,  but that she'd like to speak to Ted first - she wanted to see how he'd react when 'confronted' with my allegation.  I asked her to be cautious, and to let the police handle it.  She said she'd already contacted a mutual friend - Finn, one of the other guys from their teenage band.\n\nThe next morning,  I found weird 'likes' on my public pictures.  I suspected something had been posted.  Sure enough, Rita had unblocked me and put up a Facebook post addressed to her friends and followers that doxxed me.  She named me,  gave all my online aliases and associated sites,  gave a physical description of me,  stated the general area where I live,  and mentioned I play banjo. In the comments, she also outed me as a queer woman. She added that I was a crazy stalker who was obsessed with her,  her children,  and her boyfriend Ted.  She asked everyone to watch out for me, and to ignore anything I said because I'm insane and dangerous.\n\nThe comments were filled with people offering to beat me,  drill holes in my head,  run me out of town physically and digitally,  and make me disappear.  She had about 6000 friends and followers.  In the regular world,  that isn't significant, but in an insular niche like bluegrass,  it's quite the reach.  Many people mentioned that they were looking for me and the places they'd seen me posting,  and asking questions about things on my profile.\n\nThe next morning,  Rita messaged me. She opened with, \" Hey OP, long time no talk!\" She said she vaguely knew what I had told Patsy and Loretta,  but that she needed to know about what he'd done for herself. She also said her 'good guy' radar was broken,  and she wondered when Ted would betray her. I told her I didn't feel comfortable speaking to her at that moment.  She said she got it,  then told me she'd had a rape experience of her own. She told me to get over it,  then blocked me.\n\nBenedict also texted me,  asking if I still lived in the area and whether or not I needed someone to talk to.  The last time I had spoken to him was November 2019. It was now the end of July 2020. I didn't answer his questions,  and talked blithely of banjo instead.\n\nIn August,  Rita released a song that I'll call 'Stray Cat.'. The lyrics described a cat who made women disappear and was overall an undesirable animal.  The singer fell in love with the cat anyway,  as it was meant to. My therapist said it was a new experience to hear about a love song about her patient's rapist on the radio.\n\nAfter recovering from the doxx post, I contacted the SVU detective and filed a report.  The detective looked over my photos and the messages and said,  'let's call this what it is - rape.' It was the first moment I truly internalized what had happened that night.  She said it was unlikely the DA would pursue my case without the rape kit and confession.  After Rita's post,  I knew it was pointless to attempt to try and get a confession. It was likely Ted had hired a lawyer,  and no one in the community would want to help - they wouldn't want to face the same ire. The detective said the file would be there if anything else happened,  and that there was no statute of limitations. She asked if I was living alone,  and made certain I had been speaking to the counselors at the rape crisis center.\n\nA couple of weeks later,  I started to feel guilty that I hadn't answered Rita. I decided to email her and let her know what had happened. My partner,  the director of sexual assault at the crisis center,   and my mom advised against this.  They said she was dangerous.  I felt like it was hypocritical to claim to be an advocate for the safety of women while denying an earnest request like Rita's, particularly with her mention of a rape experience.\n\nI told her what happened,  and what the police said.  I told her I wasn't a sage,  but that his past behavior indicated an undesirable outcome for anyone involved with him.  I said there wasn't anything else I could do,  and that I wanted to heal and move on.\n\nI also copied a bluegrass advocacy organization on the email, at the request of my partner. \n\nRita responded by saying 'YOU AGAIN!' I sent a screenshot of her message asking about the rape and replied something like, 'I'm not trying to incite distress. I just wanted to answer your question'. She then said,  'thanks,  this will be useful in the defamation suit (winking kiss emoji)'.\n\nTwenty minutes later,  she called my parents. She called again later that evening.  The next day, she called their house four times from 9 AM until 11 PM. She also called my dad's shop several times.  My brother answered once and told her to stop calling.\n\nThen came the Facebook posts.  She picked people who had liked a picture on my mom's profile. Anyone with a public post received a rambling comment. They were all different.  Some of them said I was an unhinged, obsessive stalker.  Some of them said I was mentally ill and needed help.  They all said she was trying to contact my parents. \n\nNext she tried my dad's business FB page.  This was the first time she brought up a bizarre story about kayaking near my house after the July Facebook post and how her tire was slashed. She posted a picture of her son changing a tire and added they were 'just normal folks. '\n\nShe then started emailing my dad.  She sent all the messages I'd sent her from Ted.  She sent the slashed tire photo (which my dad,  who is an auto mechanic,  said looked very suspicious given how clean it was). She went on and on about how I'd been harassing her for over a year and I needed to stop.\n\nMy dad didn't know about the rape.  My mom knew,  but we decided not to tell him because we knew he'd be upset.  After all,  he was the one who mentioned that Ted seemed untrustworthy.  He called me about all the messages and I told him what had happened.\n\nNot long after this,  Ted himself emailed my dad.  He claimed we'd been in a romantic relationship,  and that I was lying about being raped.  He sent a screenshot of a lawyer contract and the same messages I'd sent to Rita. He told my dad he wasn't a scammer, and that he could be trusted because his girlfriend is a prominent professional banjoist,   and that my dad should Google her.\n\nThe following day was the start of the letters.  Rita sent four letters, two to my parents and two to my partner.  They all had a different tone.  One that was sent to my mom ended with 'you need to stage an intervention.  Send your daughter to an asylum! She cray! (Hand drawn spinny eyes emoji).' My partner's letters all referred to how Ted and I were 'fuck buddies' and I was exacting revenge with a false rape allegation.  Two of the letters were printed packets of the messages I'd sent her.  They had annotations in her hand writing indicating how I couldn't have been raped. \n\nOn September 22, she put up a Facebook post that tagged my father's business.  It had links to his Facebook reviews and Google reviews.  The post detailed how I harassed her and Ted for a year,  and how terrified she was.  She said the police could see I was insane, but since I never threatened anyone physically,  they couldn't do anything.  She also noted that as poor musicians in a pandemic,  they couldn't hire a lawyer.  She said the police suggested reaching out to my family.  She asked her followers to address them at the business site.\n\nMy dad's pages started to receive negative reviews.  His inbox filled up with messages about his crazy,  pig fucking daughter.  I made certain to screenshot everything as usual,  and kept deleting and blocking as necessary.\n\nOn Rita's post,  the usual battery of threats were expressed.  Rita encouraged anyone who offered to leave a negative review or send a message.  Rita updated the post to add a Yelp link. By 5 pm or so,  the post disappeared.\n\nI thought someone must have talked some reason into her about harassing a random business 300 miles away.\n\nI was wrong.\n\nAt 10 PM, a pounding came at my door.  We were terrified,  as we thought it was Rita or one of her violent fans coming to take us out. Arthur looked out the window and said,  'it's the sheriff. '\n\nThey'd come to arrest me,  on a warrant for one count of computer harassment, sworn out from Rita's town.\n\nI've already mentioned being raped twice.  To lose control of your body like that is a shock from which you'll never truly recover.  We all walk around with this illusion of autonomy. That it can be violated so easily permanently alters your sense of self.\n\nBeing arrested is a similar feeling.  Two men,  each far larger than me (I'm a little over 5' and 115 lbs) removed me from my safe spot, handcuffed me,  bent me over a car, and slid their hands between my legs. \n\nThankfully,  the sexual assault therapist had given me some tools.  I cast my mind far away while those strange men touched me. \n\nI was released a few hours later as I have no record and behaved properly. \n\nThe next day,  I was served a Cease and Desist from Ted.  It said I had an unhealthy obsession with him after being turned down,  and was also taking my ire out on Rita.  It stated that my rape allegation was defamation per se, and that I needed to stop because Ted's wish had been to help me integrate into the community.\n\nTwo days later,  we met up with my lawyer,  Boone.  After seeing all my evidence,  he was baffled as to why I was arrested.  We went to get the statement from the courthouse.  Rita had written that I had been harassing her constantly from July 2019 to September 2020, even though the last time I had messaged her unprompted was December 2019. She claimed to have told me to stop contacting her three times. She mentioned the mysterious slashed tire. She said I had just come up with a false rape allegation against her boyfriend.  She wrote that I was a threat to her and her children.\n\nA couple of weeks later,  we received her deposition packet.  The messages I sent her in July 2019, the September 2019 email,  and the September 2020 email were there,  but the dates were not included.  An email that I had never seen,  supposedly from Ted to myself, was there.  It was dated December 2019, but had a caption that it was generated in July 2020. The email was a request for me to stop speaking to both of them.  There were no email addresses,  and several different fonts were used.  After an expert looked it over, it was decided that it was quite probably fraudulent.  There were screenshots from a conversation between Loretta and Ted,  where she talked about what I'd said.  She claimed she deleted the actual messages. Ted also wrote a letter to an unspecified person asking for a protective order against me due to my 'unhealthy obsession' with him.\n\nIt was my turn. I brought my lawyer a hard drive with over 500 files.  I included the full,  unexpurgated Facebook messenger logs with Ted and Rita. I made certain that dates and times were present.  I had screenshots of all her Facebook posts,  and every single threatening response in the comments.  I brought my own copies of the emails.  I had phone logs.  I included all the people I had told about Ted's violence,  starting in September 2019. I brought the letters and packets. Most importantly,  I connected everything to a timeline.\n\nBoone was confident my case would be dismissed.  In December 2020, he walked with me to the judge and said, 'no deal!' A trial was set for February 3, 2021.\n\nWe met with Boone the Monday before the trial.  The offer he had turned down - without even relaying it to me - was a $1000 fine and a mental health evaluation by the court.  We prepared the timeline and all the documents Rita didn't submit,  particularly the message where she asked for me to speak to her about Ted.\n\nThe next day,  the DA offered a new deal. If I pled guilty,  there'd be no trial.  I refused.  The third offer they sent said if I never spoke to,  or about,  Rita AND Ted ever again,  the case would be dismissed in a year.  I let my lawyer know I'd NEVER be silent about what Ted did. I was LIVID at the suggestion and cried with the frustration of rapists being protected. My lawyer called back and said the DA had finally agreed to drop the case via nolle prosequi. Boone emphasized that it was rare for the state to drop a case.\n\nAt court the next day,  the DA called me up and began speaking before I even made it to the podium.  He said 'nol prosse' then began to rant about how 'it was so close ' and that I needed to 'leave Ms. Rita alone'. The judge looked at the complaint and said,  \"there must be more to this case than what's on this paper,  Ms. OP. You're free to go.\"\n\nI knew that moment was the closest I'd get to pitting my word against theirs.  I am thankful I was acknowledged by both the SVU and the court. \n\nArthur and I wanted to do one last thing.  In therapy,  I discussed how much I wanted to change the culture of the bluegrass community,  and how I could help.  We decided to send an email to people in bluegrass leadership and advocacy positions to ask them to hire a victim and safety advocate for their professional branch,  the International Bluegrass Music Association (IBMA). I suggested that this person could come up with standardized protocols and safety training for events and venue sponsored by the IBMA. I included links to other genres' efforts.  I talked about what had happened to me,  and included screenshots of the threats and harassment I'd received from IBMA members at Rita's behest. I mentioned Daisy Coleman,  and how the kind of community bullying she and I were subjected to drives people to suicide and suicide attempts.  I made certain to use pseudonyms for Rita, Ted, and myself as I didn't want to doxx them or revert too much focus from my request.\n\nA week later,  my brother showed me a post that was tagged with the shop. It was Rita.  She wrote about how I lied about being raped by Ted; that he was kind and gentle with her and her children.  That she'd read the messages he sent me (the ones he said were deleted in her deposition) and they were also kind and gentle. She said I was spiteful and jealous,  and that my actions were mitigating the validity of other sexual assault victims. She then said they'd find the strength to forgive me somehow.  The post ended with a horrid song she'd written. My brother summarized her post as 'an asshole trying to gaslight you.' He also said, 'let's see her write songs saying 'get over it' when he comes home drunk and gives her a black eye or AIDS!'\n\nI talked to a lawyer at this point. I wasn't particularly interested in a lawsuit. I wanted legal conflict resolution.  He said he could take my case,  but that due to Rita's animus,  he doubted she'd want to negotiate civilly.  He said the rape would mean a jury would rule in my favor if it went that far,  but that she'd probably keep appealing.\n\nI didn't feel like spending the time, money,  or emotional energy on those two.\n\nAs a last recourse, Arthur sent Rita a message. He told her he believed me, and that he was proud of all I had done and how far I'd come. He said that 'consent given once is not constant consent. ' He let her know he had read all of the messages himself.  He mentioned seeing me that night,  and how he wanted to take me to the hospital after seeing my neck and how he regretted not forcing me into it.  In light of that,  he asked her to take the post down, and to never contact or harass us,  our families,  our friends,  or any associated businesses ever again. He also specified she should stop using her social capital to catalyze her fans' harassment of us.\n\nShe blocked him and kept the post up.  Ted took it down.\n\nSince that time,  which was the beginning of March,  I've continued to focus on recovery. I've been feeling better but...\n\nIt shatters my heart that my attempts to improve a culture that supports sexual violence have now been weaponized.  I'm afraid other survivors will see Rita's posts and be afraid to speak up.  Arthur thinks their intention was to harass and humiliate me until I killed myself. I think he's right.  Who would want to subject their family and themselves to all that?\n\nI'm such a failure.  I wish I had done more,  and sooner.\n\nI'm disillusioned by the fact that the person who tried to destroy me was another woman.  A woman I tried to help. It devastates me that a community based on love and peace; one that slaps BE KIND stickers everywhere and has social media profiles covered in image macros about empathy viciously attempted to destroy me,  my family, and their business.  All for an alcoholic,  wife abusing,  girlfriend stalking,  date rapist. I feel like I'm living in a black mirror episode,  where everyone calls victims 'psychotic monsters' and elevates violent perpetrators.\n\nI don't regret going to the police.  I just..I don't even know how to think or feel outside of that at the moment.  I'm simultaneously a cipher and overloaded with every emotion out there.\n\nI'm thankful for so much in my life. My partner is fantastic. I have had a lot of support during the healing process. I live in a beautiful, tranquil area. I'm trying to improve and get to the point where I can truly make a change and help others. I really want to start a therapy farm and a therapy music jam. \n\n Still, I struggle every day and I worry I can't escape.",
    "title": "My rapist and his professional bluegrass musician girlfriend are using her social capital to silence me after I went to the police. I feel like I've failed SA victims.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618696412,
    "score": 57,
    "keyword": "black judge"
  },
  {
    "text": "Dating an abusive narcissist and the aftermath For 2 and a half years I have felt a strong need to tell my story. The entire story. I'm hoping that this helps even one person going through what I did, hopefully more. It all started when I met a very charming man who seemed at the time to understand and sympathize with everything I was going through. My family dysfunction, mental health issues and most of all feeling lonely and misunderstood. I was extremely vulnerable, naive and had never had a boyfriend. We talked every day about our own personal struggles, his abuse at home and mine as well. I didn't see any red flags at this time. In my mind I had found \"the one.\" We became extremely codependent, very fast. He started to shower me with gifts, wanted me to meet his parents. Everything seemed ideal. I thought this love was real, I had zero idea I was actually being slowly groomed. Within two months he had relapsed and became an alcoholic. I was more concerned about helping him get clean, still not seeing the signs or red flags. You could say I was \"blinded by love.\" All consuming, passionate, toxic love. My parents begged me to stay home and not move in with him. I honestly thought my mother was being overprotective, wanting me to stay due to her own loneliness and separation anxiety. I'll never forget what she said to me before I left. \"Astria, I just have a bad feeling I'm going to get a call finding out my daughter was murdered.\" I wish I had listened. He promised we would be safe, and taken care of. It ended up being a complete lie. The \"apartment\" turned out to be an illegally rented office space the size of a large closet. There were bathrooms but they were locked at night. We were technically squatting and I had no idea. I tried to deal with the lack of showers, privacy, resources, food, and overall comfort. He had completely changed within a week of me moving in. Instead of his sweet, supportive and loving demeanor, he had turned into a different person all together. I started to regret every choice I had made. I had nothing but my personal belongings. Didn't know how to drive, had no income and felt completely and utterly trapped. I started going to dunkin donuts just to get out of the the little prison world that was my life. He didn't give me any money for food. People thought I was homeless, they would notice my behaviors and ask me if I needed help but my shame and embarrassment held me back from seeking help. That night my ex boyfriend confronted me with a coffee cup I forgot to throw away. He was enraged. Telling me I don't need coffee or food, I just needed to suck it up. I now realize his ego was screaming \"How dare you mortify me by making it seem like I starve you?\" He would always put alcohol first and try to make me think I was being selfish and didn't understand yet I had met him in a recovery facility. Of course I understood. I had 4 years clean from heroin by that point. I really thought I could change him, or love and support him enough for him to get better. Alas, you cannot help anyone that isn't ready or doesn't want to be helped. The next night was the first time I was attacked. I was becoming a shell of myself, secretly wanting to leave but still blinded by the \"love\" I felt for him. I had lost over 50 pounds in 2 months from extreme stress and lack of nutrition. My hair was falling out. I looked so sick my friends actually believed I had a severe illness or disease. While he was at work I packed everything I had on me, called my mother but she couldn't come get me due to her stomach disease. My ex came home early and quickly realized I was leaving. He grabbed me by my hair, dragged me onto the bed and attempted to strangle me. I was fighting back as much as I possibly could. I finally got out of his grasp on me but was still trapped in this tiny room with the person I loved looking at me with complete disdain and disgust. Black eyes, soulless gaze. I had no idea who this person was anymore. He broke a ton of my personal objects, kicked my luggage and called me every name in the book. Eventually from fear of getting arrested he called me an uber and I ran out of there so fast I couldn't breathe or walk. I was in disbelief, shock, completely traumatized and overall mortified that I even let this happen to myself. I blamed myself. Weeks went by, he would call me and beg, cry, plead, promise to get help. I will admit, I still feel stupid and ashamed that I took him back. 2 months go by and I started thinking maybe he really was just that sick with the disease of addiction and trauma due to child abuse. He went to detox and rehab and things seemed to be looking up, oh how wrong I was. He moved into my home, my mom and dad never knew about the strangling incident. I was ashamed and didn't want to face the truth. I started noticing strange behavior, I'd watch him and I found out he was hiding bottles of vodka around my house VERY strategically. He would always lie even though he knew I wouldn't judge him. He then started not to care at all about hiding it. He would lay in my bed drunk every day. My mother who is a nurse actually detoxed him fully. We didn't know he was just using us. He couldn't go back home and he would NOT leave every time we told him he had to. This is where the cops get involved and my secret hell was finally exposed to others. He blacked out and before I could even realize what was happening I was on the floor fighting for my life. He hit me with a closed fist and the light was completely extinguished from his once beautiful blue eyes. I was trapped yet again but in my own home. I remember seeing stars and crawling desperately to my door begging him to stop. My mom heard my screams and he then attempted to punch my 71 year old mother. The police show up, my ex had by then fled and was hiding under my porch. I was still so brainwashed I didn't tell them he had attacked me, I just wanted him gone. They saw the huge lump on my head and arrested on him on their own volition. Even though there was a restraining order he called me 40 times from jail. I don't understand how he was able but he kept saying I was his sister. He said he didn't remember, begged me to get him out. I was done. I had lost so many friends because of this. I had lost my self worth, dignity, pride and overall my self love. I felt completely insane. Eventually after months and months of stalking, he stopped. Most people would think \"now i will be okay, I can get on with my life.\" Abuse like this stays with you forever. The emotional scars are the deepest. The things he would say like \"If you ever got pregnant I'd throw you down the stairs.\" or \"You're never going to be loved.\" You are worthless, lazy, and you should just give up and kill yourself.\" This was my first boyfriend. Every fond moment is tainted with regret and sorrow. I never want anyone to go through what I did. I wouldn't wish it on my worst enemy. I wanted to share my story because even preventing or saving one life would mean something. Domestic abuse is so common. It's complex, painful and you feel like you cannot tell anyone what is going on. It's a silent killer. I hope that my story helps people realize it's NOT your fault, narcissists are like actors. They can win an Academy Award for their performance. The most important thing is to SEEK help and resources. Don't be afraid to SPEAK. Be cautious, aware and most of all please try to see the signs. Gaslighting, grooming and all of the desperate pleas for forgiveness. If anyone is struggling or resonates with anything I have detailed, call this number and remember there is hope. I am now in a healthy and loving relationship. I have more confidence than I ever imagined. I'm working on achieving my dreams and goals for life. You do not have to suffer in silence. Surround yourself with people who do NOT judge, they will be of no help. I personally believe that. My former friends made me feel pathetic. Choose people you trust, don't hold anything back. Be careful, my ex always looked through my phone. I wish this never happened to me but I don't have many regrets because I am now stronger and REFUSE to be a doormat. I have trust issues, nightmares, insecurities but this is all from the abuse. PTSD is my aftermath but I do not let it define me. I try to help anyone who is going through the same experiences. If you see your loved ones behaviors changing, talk to them. They might just be scared, ashamed and mortified like I was. The first step of recovery is accepting that none of this is your fault. Your life is your own, don't ever let anyone make you feel worthless. You are not alone. I wish all of you the best and hope anyone reading this gets anything valuable out of it. HELP and RECOVERY is within reach. You can do this. <3 \n\n National Domestic Violence Hotline\n\n1-800-799-7233\n\nhttps://preview.redd.it/ab090x8kcyi71.jpg?width=206&format=pjpg&auto=webp&s=e1f83e56f6518d5ab490d8ab529c6b2490030ef6",
    "title": "Dating an abusive narcissist and the aftermath",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1629656807,
    "score": 39,
    "keyword": "black judge"
  },
  {
    "text": "Intent is less important than outcome Posted here because r/unpopularopinion thinks it’s about ‘feminism’ and won’t post it. Yeah. \n\nI don’t actually care what you believe in your heart of hearts. I don’t care that you are a good person over all. I don’t care that you are just joking or are a troll saying something racist but don’t really hate black people. I don’t actually care about your intent.\n\nI care about what you do. The effect of your action on someone else. No one can know what another person thinks or feels we can only see what they say and do.\n\nSeems to me the internet has somehow made it so anything is justified by the supposed intent of the person doing it- so being sexist is fine if it’s ironic! Don’t feed the troll— he doesn’t actual believe what he’s saying - it’s just a larp - the people repeating death threats is just hyperbole- the people with guns in the capitol saying hang the Vice President aren’t really facists, they are economically anxious- the guy following you home is just socially anxious!\n\nLook. It sucks but what you say and do are actually a reflection of your character and have a real affect on the world and those around you. I don’t actually care what you believe about yourself- because i don’t have access to that information. If you say shitty things I am going to judge that you are a shitty person. If you do something that hurts someone then your intent doesn’t take away that hurt.\n\nTake responsibility for yourself. We all do shitty things, we are all wrong sometimes we all fuck up. What you do about that reflects on your character.\n\nI actually think Christianity made this worse- the whole thinking about a sin is a sin thing combined with the whole faith not works thing. As children a lot of us were told that what we believed was more important than what we did- you will go to heaven if you accept Jesus! Doesn’t matter if your a murderer you can be saved by what you think in your heart! Doesn’t matter if you are a wonderful person who devotes their life to others, if you don’t believe you will go to hell...\n\nGiving people excuses when they hurt someone is not empathy. I can empathise with someone’s anger or loneliness and still think that they should have consequences to what they say and do. I can want them to get help without wanting to be in an environment where violent, sexist, racist language is tolerated.\n\nCrying about free speech when there are consequences to saying whatever comes into your head is not free speech. You say or do something racist? Being told that is racist is not anti free speech. Having people decide they don’t want to hire you based on what you say is the very definition of judging you by the content of your character. What you say and do is literally your character. End of rant.",
    "title": "Intent is less important than outcome",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1610797113,
    "score": 19,
    "keyword": "black judge"
  },
  {
    "text": "Opinions On Ethnic Women Having Blonde Hair So, here's the situation. I recently dyed my hair blonde, and it took a lot for me to muster up the courage to not care about having blonde hair as an Asian-American. Of course, you see a bunch of Asian American women with a blonde balayage, and they look amazing with it. I have had light brown hair for over a year, and I just really felt inclined to switch it up late last year because I needed a fresh new start (things ended badly with the guy I was dating). I thought going blonde would help me feel more confident, but instead it makes me feel so weird about myself in public (especially when I am hanging out with my white friends). I have this perception that people think I am trying to be something I am not (\"act white\") and that as an Asian American, I should stick to the darker hair colors. I know that so many non-white women can rock the blonde hair (I was inspired by yanyanchan on IG) and that wanting to be blonde does not stem from a desire to look Caucasian. The blonde color is just pretty (especially when you wear so much black clothing) and can spice up your hair.\n\nI was just wondering what everyone's views are on this. Have any of you guys regretted going blonde or felt weird about being a blonde when you aren't white? I spent hundreds of dollars to go blonde, and now that I am, I feel like I should just go back to the salon and dye it brown/black again. I hate that I feel like this, but I've spent way too much time thinking about my hair. Even though my hair looks great and that I still think I look pretty, I just feel weirdly judged when I see people look at me in public.",
    "title": "Opinions On Ethnic Women Having Blonde Hair",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613283524,
    "score": 12,
    "keyword": "black judge"
  },
  {
    "text": "Let’s talk about Hillary Clinton… In the 60s she was one of the few women in her law class at Yale. They had women’s day at Yale where the professors ONLY called on women during class. They were so rare and so few and far between that they literally did this because it was like watching a dog walk on its hind legs.\n\nEven Bill Clinton’s mum was worried because she didn’t look like the beauty pageant queen who would typically date a young eligible bachelor like Bill in Arkansas.\n\nAnyway, she moved to Arkansas because she fell in love. She had a lot going for her in Washington, but she gave way and conceded for the man she loved.\n\nShe wanted to retain her agency professionally when she refused to give up her job as a lawyer when Bill eventually because governor of Arkansas. She wanted to retain agency of her image when she refused to change her last name to Clinton. She didn’t change her hair, the way she dressed or get rid of her glasses yet. At this time, she genuinely believed, perhaps even naively, that this wouldn’t matter. I mean you gotta understand, she was literally part of the feminist groups in Yale in the 60s and was a total picket raising activist.\n\nBut, when Bill lost as governor she internalised some of the reasons as to why he lost as hers.\n\nWhen he won again, that’s when she changed her name, her hair, her clothes and rid of her glasses. She did this to FIT into the expectations of a governor’s wife and she didn’t want to be any reason why he would lose. Again, she gave way and conceded.\n\nThis happened again during the Flowers and Lewinsky scandals in the 90s. In the Flowers scandal she was essentially FORCED to sit by her man in front of the national media and in front of a public reeling from Superbowl fever and offer her support for him on a golden platter. They were basically part of the entertainment.\n\nAll I know is that if I found out that my husband had cheated on me and it was laid out to millions of people gossip about, the last thing I’d want to do is to sit in front of a camera and tell everyone that I I’m all for him. I would be angry, like really fucking angry and I’d probably not want to talk to anyone for a while. But this lady did just that, she fucking gathered herself, put forth an image of composure and said to the camera what must have been said to save her husband. Once again, she gave way and conceded.\n\nFast forward to the 2015 emails scandal. People questioned her authenticity. My question is why? Because she deleted some emails and used a private server? Colin Powell did the exact same thing when he was secretary of state and nobody questioned this. She deleted those emails because they were private… i.e. they were probably about her latest gyno appointment, or getting her hair did next Thursday or could even be freaking emails to her doctor about concerns over menopause. Of course, she wouldn’t want anyone to read those! Look at what we did to her in the 90s! Would you want the public reading those types of emails that you send to your friends? Probably not.\n\nAs for being authentic on stage, this is one of the hardest things for women. You have to carefully curate your image; to strike the right balance between empathetic, yet commanding. Beautiful, but also not trying too hard. She tried to be candid once in the 90s during an interview and she got absolutely lambasted for “belittling” stay at home mothers. I would be guarded too if there is a 1 in 2 chance that anything I say could be skewed to make me a personal target for vitriolic criticism. I would be guarded too if I have spent the last 40 years of my life being judged by privileged men who have all the freedom in the world to fuck up and not be hanged and quartered and then put out to dry. What’s also really sad is that she felt that she had to apologise for the emails. For what? Seriously for what?? Because it wasn’t optically presentable enough? Michelle Obama also went through this shit. And you know what, I’m gonna say it, so did Melania Trump. Michelle for being black and outspoken. Melania for being too beautiful and seemingly vapid. We don’t know the deepest thoughts of these women, they deserve to be imperfect and they should be allowed to fuck up and not be burned at the stake. But yes, Clinton apologised, gave way and conceded.\n\nPeople LOVE a female hate figure. We love feeling justified in not liking someone and it makes it all the more easier, and more fun, especially when it is a woman.\n\nAnd then she loses the presidential campaign to someone who was a massive fuck you to everything she is and stands for. This woman has shown that she is great when given a job to do. She had a freakishly high approval rate when she was Secretary of State. But hey ho, as long as a woman is secretary and not at the top position, our world seems to think that that’s fine. If she goes beyond that, then we should be concerned. Anyway, still, she attends Trump’s  inauguration, and gives way and concedes. Because that’s how someone should handle loss; gracefully. All the more if you are a woman. Well fuck that! If the election was stolen from me, I wouldn’t be graceful about it. I would be MAD. SEETHING.\n\nAll her life, Hillary Clinton has dodged, has been hit or has caught the rocks that have been thrown at her. And all her life she has picked up these rocks and has put them all into one neat basket. She should be allowed to throw all those rocks out and at people that have hurt her, we owe her this much. She should be angry; she has every single fucking right to be.\n\nWhy are women expected to ALWAYS take the higher ground when it is so fucking embarrassingly clear that they are the ones who are being wronged? Why are women expected to put their head down and work harder when they are being bullied because “…oh you know… you don’t want to make it worse.”??\n\nA lot of people don’t like Hillary Clinton right now but mark my words in about three of four decades’ time we are going to look back at her treatment in the history books and feel embarrassed. I just hope that we wouldn’t have to wait that long.\n\nAnyway, Happy International Women’s Day.",
    "title": "Let’s talk about Hillary Clinton…",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615239758,
    "score": 9,
    "keyword": "black judge"
  },
  {
    "text": "Woke up bruised all over upperbody and thighs. I need help to process it... Hello!I didn't where else to go.It's a throwaway account, I guess I just need to tell my story to process it a bit more, if that makes sense. I would also like your thoughts and support, whoever will read this.\n\nI am a woman at the end of my 20's, really informed about consent, safe sex. I generally enjoy my sex life, that I (and my therapist) judge pretty healthy after years of abuse. I'm all fine now.\n\nLast Saturday, I met a guy at a party. We clicked, flirted, and, while everybody else was in the living room, we started making out pretty heavily; it quickly became a bit rough but it's a kink for some people, me included, so no harm done with playful roughness.But... at some point, I refused to go to his room and refused also to give him my number.I guess he got a bit frustrated.\n\nHe cornered me in the room we were, dragging me by the neck and then lifting me off the ground. Then he bites me hard in the neck and I got the teeth marks too... It hurts. I disassociated and couldn't say anything. There was some alcohol involved, it might have blurred my mind also. I didn't say anything. I know I felt scared. I'm living since 2 days with bruises and bite marks on my neck, shoulders, thighs. It's not a pleasant experience.\n\nSo, I know he couldn't read my mind. But I was wondering, where is the consent there ? I used to believe it was either white or black, consenting or not. It makes me wonder how I couldn't say anything? But at the same time, we jumped from playful roughness to... litteral violence I guess? lifting a woman off the ground by the neck when she says no to go to your room ?\n\nI would love your input cause I'm a bit at lost here.\n\nThank you!  \n\n\nEdit : I'm reading all your answers. Thank you very much. I talked to my therapist this morning, took pictures of the bruises.",
    "title": "Woke up bruised all over upperbody and thighs. I need help to process it...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1624272209,
    "score": 6,
    "keyword": "black judge"
  },
  {
    "text": "I’ve had years of self acceptance and confidence but I let 3 strangers at a party crush that with one nasty comment Why do we let other women get under our skin?\n\nI went to a small gathering last night (healthcare workers and everyone is vaccinated!) and I was so excited to let my hair down and have fun! I’m 14 weeks pregnant and after 2 months of being a puking, exhausted mess I finally felt like myself again. Problem is I’m at that awkward stage of pregnancy where my pants don’t fit but maternity clothes are too big. I settled on wearing a maternity dress I bought for work- black and knee length nothing special. Point being, I know it wasn’t the trendiest thing to wear to a party, but options were slim.\n\nFast forward to said party and I’m having the best time with coworkers that I haven’t physically seen in over a year, nothing can break my smile. Then I see 3 younger women pointing at me and looking me up and down, it was loud but I could hear one of them say “wow, that’s a lot of black” and laugh. The other 2 joined in laughing and staring. The way they judged me for absolutely no reason in that moment just got to me. Here I am 31 years old, with a husband that loves me and surrounded by friends, and this comment ruined my night. \n\nI was so disappointed in myself for immediately turning to self-consciousness instead of brushing it off. Why do women do this to each other? And better yet, why do we let it bother us?\n\nTL;DR: had to wear a maternity dress to a party and was made fun of by young girls in Mom jeans. Made me feel like shit.",
    "title": "I’ve had years of self acceptance and confidence but I let 3 strangers at a party crush that with one nasty comment",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615181797,
    "score": 5,
    "keyword": "black judge"
  },
  {
    "text": "Something about us (TW: Domestic Abuse) *It might not be the right time*\n\nI remember our first date, I snuck out of the house and it was pitch black. The crumple of the leaves, the way you showed up with no mask or cared to. How I was talking to you the entire time. How you turned the merry go round and wondered why I did not jump on while it was moving. How I said ‘Why do you keep taking me to dark places? Kill if you have to.’ \n\nHow I knew from then, that wasn’t going to be a joke someday.\n\n*I might not be the right one*\n\nLove at sight. I took so many polaroids. I wanted to remember you forever. How you taste and how you speak. I threw myself at you as you stated, but I think what we had was natural. We felt natural. \n\nA constructed reality as I see it.\n\n*But there's something about us I want to say*\n\nI’m hiding in the bathroom. I can hear you open it, I always know how you open it so I clip your nails. I hope you just continue to keep them short. How you always come when I’m using it and stare at me. How I constantly had to close the door and yell at you. I thought the playful peeks when I was showering was nice but when I feel so scared every time that door clicks.\n\n*'Cause there's something between us anyway*\n\nWhy was I hiding again? Oh yeah I got hit. I learned how to lock this apartment’s door better. You can’t learn the trick, please don’t use the trick I found out. I laughed when you hit me, you bent me over and slapped me, so hard I didn’t understand. I ran, and I kept running until I was in the bathroom. Where is my phone? Why does every time he do something I don’t have my phone.\n\n*I might not be the right one*\n\nYour parents made weird comments sometimes. My parents hated you. It’s only been 2 months, why don’t they accept us I wondered. I didn’t really accept them as well, maybe it was the racist comments I didn’t want to accept. Maybe it was how I wasn’t dieting or cooking very healthy. How I must’ve been 140lbs and I should have been thinner. How I wasn’t the perfect genetic match for your son. How I hated everything in this room I never seem to leave.\n\n*It might not be the right time*\n\nWhere are my friends? Why don’t I call my mom. Oh yeah I forgot, you don’t like them. You don’t like anyone. I begged you to tell me you loved me. We signed a car and leased an apartment together, why wouldn’t I be loved? We are testing the waters you say. \n\n*But there's something about us I've got to do*\n\nI’m having an anxiety attack at this point. Fully clothed in the shower and crying. Hysterical even. You took me off my medication and took me away from school. I have no one to talk to. I talk to some friends but what can I even tell them, how you aren’t perfect and yet again I am stuck. How I left one hell into another. How I made all these mistakes. I need to be medicated. I don’t know what this reality is but everything seemed brighter, you lit up all my imperfections. How I was never going to be good enough even with all improvements I’ve made.\n\n*Some kind of secret I will share with you*\n\nCrying at the police station. I fought a judge, I yelled at an officer. I was trying to explain this whole situation, but I just looked crazy. How women weren’t being protected and how survivors don’t always survive. How I hated this whole thing and how everyone is focusing on the wrong thing. What do I know that everyone is not seeing?! That he’s crazy and unstable. How he’s keeping me in his life while he has a girlfriend now. Set me free like I let you be free.\n\n*I need you more than anything in my life*\n\nSchitt’s Creek, Alexis and Ted. I chose to watch the show with you. The year was ending, it was the ball drop coming. We weren’t dating but we were together. You liked me a lot and I loved you. I knew it was wrong, I compromised my values. I wasn’t the same if my values had to be changed. How ethics kept me strong, how morality made me human. This episode helped me see that I needed to leave. So I tell you it’s over. That maybe you should be sad, that maybe this whole thing needs a redo. How you said you’d be single for a long time and I knew it, that I could trust him. I walk out that door and tell the Uber driver. How he told me, that I could do better and that men like that don’t change.\n\n*I want you more than anything in my life*\n\nWe co-signed this car, you are lying the entire time. You let no one explain anything to me. You kept me dumb. How all these solutions you are asking for, you know don’t exist. How you keep the car to keep me, how I had to come with the police to get my items. I found the painting. I was your sunshine, how I was the brightest person in your dark world. I cry a lot now, seems like it rains more often than it shines. How I accidentally told them the truth just by stating it was my car and I can’t take it yet.\n\n*I'll miss you more than anyone in my life*\n\nHow my lawyer said that if I stay with you I’ll be dead. Why do I laugh at weird comments and behaviors. What is so funny? That I somehow found the Joker of my world. How I now need to run as far away as possible. I left, I’m free. I don’t feel free. The hotline lady said I was delusional and that if I loved myself more I wouldn’t be getting into these situations. How I cursed her out and left. I was so mad, I’m always angry now. At myself and you. At my parents for making me homeless so I had to stay with you. How I never had enough money but you did so you always held it over me and kept track of my debts. You make over half a million a year. I make nothing. How you are a public figure and I can’t stand animations anymore. How I see anything that reminds me of you and I shake. How my friend can’t stand to see me like this and are upset always. How I changed my number and you know. How I hide in different places. I just heard some knocks at my door. I’m hiding again. I don’t have  enough evidence or I can’t prove this. The ghost you created to haunt me. I can’t escape.\n\n*I love you more than anyone in my life*\n\nI was really high when I said I love you. I don’t know why I said it. I felt like I knew you forever. Like you were my life and I lived yours. How the world put us together. The purest soul and true evil. You always threw it back in my face. ‘You told me you loved me after 3 days.’ I wasn’t in my right mind and maybe if I was, I would’ve left. Maybe if I actually knew everything and wasn’t running away from all my issues by having them be solved by love I’d be safe and happy now. How I don’t love you anymore. How I took my power back today and how I’m looking up. Sometimes I slip and fall but I have people who pick me up again. \n\nI’m not afraid of you anymore.\n\nAll that glitters is not gold. I now hate your name and I’ll never say it again.",
    "title": "Something about us (TW: Domestic Abuse)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613370734,
    "score": 3,
    "keyword": "black judge"
  },
  {
    "text": "Response to racist student On Friday a student was telling me (out of earshot of other students) that she wasn’t going to a classmate’s birthday party after school. The party was being held in a larger city at 4pm, and I said maybe Mom didn’t want to get stuck in traffic, etc. The student (age 9!!!) says to me ‘well, I don’t want to sound racist, because that’s kind of a bad word, but since ‘student’ is, ya know, black, I don’t think her family acts like mine does’. I was dumbfounded! My response was ‘or, maybe they act just the same!’ \n\nThinking back on the incident, I half wish I’d said something snarky like ‘that’s probably a good thing since your family is obviously racist…..’ \n\nIt felt good to talk about a novel we are reading on Monday and hammer in the lesson in the chapter being ‘don’t judge a book by its cover’. \n\nThese kids spent too much time learning crap lessons from home last year!",
    "title": "Response to racist student",
    "subreddit": "Teachers",
    "timestamp": 1634691317,
    "score": 7,
    "keyword": "black judge"
  },
  {
    "text": "What is your dress code like? I am just curious as to what everyone’s dress code is based on where they teach (school type and/or area). I teach in Ontario, and I’m often shocked to see some of the casual outfits that are warn by many (mostly Americans).\nNot here to judge, just genuinely curious to see what you are allowed to wear and/or what most teachers in your school wear!!\n\nWhere I teach (and I think generally a rule of thumb for most Ontario Schools) leggings or athletic-leisure wear is strictly not allowed as well as blue or black jeans. We do not “dress down” on Friday, but you might be able to get away with a Pinteresty type font on a t-shirt that says something about teaching or being kind lol.",
    "title": "What is your dress code like?",
    "subreddit": "Teachers",
    "timestamp": 1627341405,
    "score": 3,
    "keyword": "black judge"
  },
  {
    "text": "Out of all the cases you've read so far, which one(s) pissed you off the most, and why? &nbsp;Have y'all ever read a case that boils your blood and ruins your day even just thinking about it? We all have those specific decisions that make us feel some kind of way, and I'd love to know which ones have affected you the most. I can't tell you how many times so-called jurisprudence made my jaw drop by irrationally legitimizing some serious bullshit. This might sound silly, but sometimes I'll get seriously pissed off thinking about judges who've a mockery of the law by perverting the very institution protecting our rights into promulgating injustices. Here's my list of the some of the cases I consider to be among the most egregious examples of this. Let's get the most obvious one out of the way. You already know which one it is without me even having to say it:\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n***Dred Scott v. Sandford.*** Universally regarded as the worst Supreme Court decision of all time, and rightfully so. The ghost of Roger Taney can catch these fucking hands any day of the week. The institution of American chattel slavery was an abomination to both God and mankind, a crime so unbelievably heinous that even those who tacitly endorse it are profoundly evil. But a man who abuses his immense power attempting to perpetuate that horror forever, well, he's cast himself down to the very bottom of the lowest circle of hell and started digging. Not only did it deprive African Americans of the basic rights even the racist Founding Fathers allowed them, it became a catalyst for the bloodiest war in our country's history. This smug piece of shit, believing he'd settled the slavery question forever, wrote words that killed hundreds of thousands of people and dehumanized even more.\n\n\n\n&nbsp;\n\n\n\n Yet **even someone who'd actually agree with dooming an entire race to lacking any rights whatsoever** couldn't even justify effectuating it the way the Court did, because this unbelievable asshole not only wrote his opinion *after* dismissing Scott's claim on standing grounds, he also attached a completely unrelated coda invalidating the Missouri Compromise when he had absolutely no authority to do so. Anyone with even cursory knowledge of the law can see his violation of the separation of powers in effectively legislating from the bench. The Chief Justice is supposed to be the brightest legal mind we have, so that bastard knew exactly what he was doing. His disgusting attack on the Compromise was, in effect, an advisory opinion masquerading as \"jurisprudence\" comparable to a five-year-old's crayon drawing of a swastika. Even worse, six other Justices participated in this gang-rape of the very rights our country was founded on. It was not only substantively unjust but procedurally unjust as well. The only two men with any sort of backbone in this story are Dred Scott himself and Justice Robbins (the only Supreme Court justice to resign on principle.) The rest of them deserve to burn (and yes, that includes McLean too).  \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n***McClesky v. Kemp.*** What do you get when you combine racism, injustice, and denial of not only factual proof but basic mathematics itself? You get an extraordinarily tragic and infuriating example of how courts have continued to deprive African Americans of their voice in the judicial process even almost a century and a half after the Dred Scott decision. The abolition of the pre-Furman framework for capital punishment was in large part due to systematic racial disparities in the imposition of death sentences. Our current post-Gregg framework, in contrast, was partly born from Georgia's desire to absolutely kill the shit out of Troy Gregg, as one of five states providing a template for the reintroduction of capital punishment. To do so, they convoluted their process in a way that addressed every concern in *Furman* to comply with the Eighth Amendment, and quickly extinguished any other lingering constitutional issues (e.g. Coker v. Georgia). This case directly exposed the post-Gregg framework as the charade it always was; a continuation of the policy of certain death for black defendants alleged to have committed **any** sort of crime against a white victim. \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThe disparity was always odious and obvious; black men accused of raping white women were almost always executed, with very few exceptions, if they even had the chance to make it the gallows before they were lynched by a mob. In contrast, the execution of white defendants for rape was very rare, and almost all of these cases involved defendants convicted of raping a child. McClesky's thorough, comprehensive, scientific analysis of every single Georgia death sentence statistically proved that black defendants accused of killing white victims were **TWENTY-TWO TIMES MORE LIKELY TO RECEIVE A DEATH SENTENCE THAN BLACK DEFENDANTS ACCUSED OF KILLING BLACK VICTIMS**, and more than seven times more likely to be sentenced to death than white defendants convicted of killing a black victim. The denial of such empirical and objective data can't be adequately explained by anything other than the majority advocating, or at the very least actively condoning systematic racism. \n\n\n\n\n&nbsp;\n\n\n\n\n\nThis alone is already unconscionable from the highest court in the land, but the most egregious part of this case is Powell's inexplicable and unconstitutional assertion that **even if Georgia's sentencing policy being racist were taken as true** (remember, their pledged avoidance of this was the whole basis they were allowed to bring it back)  McClesky had no recourse because no racial bias could be proven **in his specific case.** I can't even explain how wrong that is, on so many different grounds. The granting of rights to everyone through the granting of rights to an individual plaintiff has long been one of the most basic cornerstones of judicial function, and denying that to McClesky was, in effect,  a denial of rights to all African Americans, and it killed him. Even Powell himself admitted years later that he wished he could go back and change his vote. Unfortunately, McClesky had already been executed by then.\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n***Ashcroft v. Iqbal.*** This is an example of a recent case that makes scholars throw up their hands and go, \"yeah, I get it, but... come on, seriously?\". It's the legal equivalent of what happens when an unstoppable force (Iqbal's claims) meets an immovable object (the US government's storied commitment to covering its own ass when committing human rights abuses.) The extraordinary lengths the government went to in order fuck over just one guy over were so extensive that they irreversibly changed the way the ENTIRE AMERICAN LEGAL SYSTEM WORKS, FOR EVERYONE, disadvantaging every single civil plaintiff in the the past thirteen years, just to deny this one guy his basic rights. The Court's complete disregard for the well-settled logic behind the doctrine of respondeat superior and vicarious liability is already bad enough, but its extraordinary far-reaching consequences for civil procedure have irreparably harmed the whole idea of what litigation actually exists for, and will most likely continue to do so for a very long time. \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThis completely unwarranted, arbitrary imposition of the plausibility standard infected a mostly-objective process with an extremely dangerous element of subjectiveness. Who's to say what's actually \"plausible\"? The previous framework was imperfect but far more just: claims were dismissed immediately if they were obviously factually impossible, vexatious, malicious, 12(b)(6)'d, or otherwise unacceptable for litigation. these standards are not only very clear, but necessarily mostly or completely dependent upon consideration of objective facts. Plausible? I'll tell you what's fucking plausible. It's plausible that the Supreme Court secretly conspired with the executive branch to change the way the whole game is played, just to excuse its abuse and arbitrary detention of Arab Muslims in the aftermath of 9/11. It's plausible that they were looking for the a perfect test case to come along and serve as the excuse to introduce this plausibility standard, and this one just happened to be the right fit. And it's *extremely* plausible that everyone responsible for this decision can suck my nuts, because the last thing on Earth I ever needed as a manic 1L was a few dozen more pages of Civil Procedure reading than I otherwise wouldn't have had. Thanks a lot!\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\n\n\n***Bank Markazi v. Peterson.*** Iran, Iran, Iran. How many times have we seen the incredible lengths our judiciary has gone to in order to break the fundamental rules of our own laws? They love to carve convenient exceptions out of the very concept of what laws and precedents mean, just to get back at them for the 1979 hostage crisis. That's the only explanation for all these similar rulings involving Iran -- far too many to list here -- that completely defy any logical justification and contradict everything the separation of powers stands for. The prohibition on legislative meddling in the specific outcomes of individual cases is, and always has been, one of the most important protections of the separation of powers, without which judicial power becomes completely meaningless, I mean like seriously  on some pre-Marbury shit, so it's one of the most important safeguards we have against violating that separation. Allowing the legislature to influence cases this way is downright incestuous, a distant and obviously legally different kissing cousin to the idea behind double jeopardy as well, if the legislature truly wants to play house like that and act as a quasi-judiciary (although not everyone would agree with this comparison, I know that's kind of a stretch.) \n\n\n\n\n\n&nbsp;\n\n\n\n\n\n\nThe judiciary means absolutely nothing without the absolute assurance of its finality. The judiciary interprets the legislature, and allowing the legislature to have any control at all over a pending judicial action would in effect allow the legislature to interpret itself. I don't have to expound on how dangerous that is. Justifying this decision on the argument that this law is acceptable because it applies only to a specific pending trial rather than its outcome, or other unrelated trials, and only eliminates all of one party's defenses rather than deciding their fate entirely, has the ultimate effect of arbitrarily giving Iran a snowball's chance in hell of exercising the same rights any other defendant would have. It's the legal equivalent of a boxing match where one of the fighters has both of his hands tied behind his back. Not only was this decision an egregious denial of due process to one defendant under a certain docket number, this was done with FIFTEEN OTHER DOCKET NUMBERS. I know they're still salty about the hostage crisis, but opening up a portal between two sources of power designed to be eternally immiscible creates the possibility of applying it to cases involving Americans as well, or really, anyone. The fact that Justice Ginsburg, of all people, wrote the majority opinion is shocking to say the least.\n\nAnyway, what cases have pissed you off the most, and why?",
    "title": "Out of all the cases you've read so far, which one(s) pissed you off the most, and why?",
    "subreddit": "LawSchool",
    "timestamp": 1618680250,
    "score": 36,
    "keyword": "black judge"
  },
  {
    "text": "Question about formal wear for judicial clerkship interviews Hey everyone,\n\nSo, I have absolutely no sense of what good vs. bad fashion is, especially when interviewing for older judges. For such clerkship interviews, would a navy blue suit, light colored tie, and brown shoes/belt be appropriate? Or should I stick to more traditional black shoes/belt? If anyone has an opinion, I'd love to hear it.",
    "title": "Question about formal wear for judicial clerkship interviews",
    "subreddit": "LawSchool",
    "timestamp": 1623675578,
    "score": 7,
    "keyword": "black judge"
  },
  {
    "text": "1L on leave of absence after experiencing 2 mental breakdowns. My parents are livid and I;m terrified. My story goes back, way back. I was diagnosed with depression when I was 14 and prescribed Prozac, but I stopped taking it within a year after my family urged me to stop and after a suicide attempt where I tried to overdose on my medicine. In spring 2019 of my 3rd year of university, I attended LSAT prep night classes while going to school during the day. I was trying to get a double major but dropped the second one by the end of the school year since the school barely had enough courses to complete it and I didn't want to continue on to a 5th year. During that time, I fainted from low blood pressure on a bus ride to school once and ended up losing around 20 pounds from stress. I took the first digital LSAT that summer and cancelled my score since it was a 149, way below my target score. During the fall semester of my final year of uni I focused on my courses so I could maintain a decent GPA while working part-time; my mom would always call me to ask if I was studying for the LSAT and I either evaded the question or lied and said I would once I finished my regular coursework for the night. I decided that once the spring semester started I would study for the LSAT since I only had two easy classes to take with few meeting times.\n\nAs everyone is aware, 2020 had a rough start. Looking back I probably had a relapse into my depression after receiving my LSAT score. I didn't study for the LSAT at all and just stayed in bed once I got back to my apartment. When my mom called to ask me how studying for the LSAT was going I would snap at her and even hang up my phone. Come March I wasn't ready for the April LSAT at all, so I was relieved when it got cancelled due to COVID. I told my mom that I would take the test later during the year and spend my time studying and working. She was not pleased to say the least. My parents would spend days screaming at me, calling me a deadbeat for working at the local Target instead of trying to get a job that was more prestigious and used my bachelor's degree (I majored in Human Geography) and my infrequent studying. I broke down and told them I didn't want to go to law school anymore, and stayed with grandma to study at her house. My aunt and grandma convinced me to go back home a few weeks later, but I started slacking on my studying until I just stopped once the holiday rush started at work.\n\n2021 and my mom is yelling at me and calling me a deadbeat who achieved nothing in 2020. So I buckled down and studied for real. I would study for a few hours before work and study some more once I came home from work and even during the weekends. I managed to get up to 160 on some practice tests and could answer three sections correct on logic games, which used to be my weakness. I felt ready for the April 2021 LSAT. Then, on the day of the test, I had a panic attack in the very first section, logic games to add insult to injury. I had heart palpitations so intense I was practically punching my chest to calm down. By the end of the section I just wanted to shut down my laptop and run away, but I powered through the test and finished. I was absolutely sure that I bombed it so I drank as much Vodka as I could and got black out drunk. I vaguely remember my younger sister and cousin picking me up off the kitchen floor and helping me walk upstairs to my bedroom. I haven't swallowed a single drop of alcohol since then.\n\nI got my LSAT score in late April. It was 151, I never even scored that low on my practice tests. I decided applying to schools would be pointless and I should retake the test, but my mom encouraged me to apply to some law schools. I got rejected from one school, which was also my top choice I was dreaming of attending, I got put on the waitlist at another, and I finally got accepted at one school. I won't say any names, but the school has a 55% bar passage rate and in 2020 the ABA warned them they could lose accreditation if they couldn't raise their bar rate. I was nervous about attending the school, even with the scholarship they gave me, but my mom said I could work hard in my first year and transfer out. I talked to my mentor and a friend who already works in the legal field and they said they knew people who went to lower ranked law schools and transferred to better schools after their 1L year. \n\nSchool started in August and I started out fine enough, my only concern was that I learned law school worked on a different grading curve. There were only a certain amount of As to be given so students who put in A-level effort weren't guaranteed to get an A. I told myself I would try my best to be one of the few who got an A. By the 3rd week of school I stopped reading and struggled to complete assignments, at times I just didn't turn in any assignments. I stopped eating and only ate once a day so I wouldn't get hunger pangs and headaches. Once classes ended I went straight to my apartment and climbed into bed; watching the sun go down outside my window until I could fall asleep. I called my mother after my first breakdown and she got me connected with a psychiatrist that prescribed Zoloft to me. I told the Dean of Student Affairs about my suicidal ideations, and he set up an appointment with a therapist program affiliated with the school. I ended up spending the night at the local hospital on suicide watch. \n\nI tried to get back into the groove of things, but I still struggled to read and do my assignments despite talking to a therapist and the Dean of Student Affairs once a week. I had my 2nd breakdown when 1Ls were notified to have a mandatory meeting with career services to discuss pro bono work and looking for summer internships and jobs. I wasted my first 2 months of law school depressed and ruining my grade; I was scared that I would flunk the semester and be stuck at a school on the verge of losing accreditation or that after graduating I would struggle to find work since employers would judge me for going to a low tier school. I told my mom I wanted to withdraw and seek more intensive out patient care and enter with the winter class, and she accused me of wanting to run away from law school by entering a facility. Choice words were said, including me saying my mom just wanted me to stay in a school so she could bragging about how her daughter was in law school, even if it's a bad law school.\n\nAfter talking to relatives, the Dean of Student Affairs, my professors, my mentor, and friends, I decided it was in my best interest to take a leave of absence and retake the LSAT to see if I could get into a better school while I still could; if that failed I would come back to my current school and try Plan B - getting top grades so I could transfer out. When I told my parents, as the title said, they were livid. They told me I was taking the easy way out and that since I knew nothing about struggle that I thought I could reset when life doesn't work that way. My father said he refuses to pay for my rent and my mom is flip flopping between saying she'll pay for my rent but once my lease ends I'm on my own or that I need to find a job to pay for my father's half of the rent. She also demands that I find a way to end my lease prematurely so I can come back home so they aren't wasting money on me since I'm not in law school anymore. I have some money saved from working since high school so I can pay for rent until March without working; I plan to take the January LSAT so if I manage to pull up my score I plan to work so I don't drain my savings.\n\nMy mom is a nurse practitioner and says that professionals don't care where I went to school, but my mentor, cousin, and friend that's been a lawyer for 5 years says that the legal field is still a bit elitist and I should follow my heart. My friend is fluent in Cantonese and Japanese and passed the New York bar exam. She had to move to Japan for family reasons and was applying to law firms there; a recruiter told her that because of her academic background they didn't think she was qualified to work there. She ended up getting an in-house job in Sega's legal department, but hearing that scared me since her school is leagues above my current school. That just cemented that the school I go to ***does*** matter, and I want to go ahead and try taking the LSAT before I end up ruining my future. Just like how retaking the LSAT doesn't guarantee I will be accepted to a new school, I'm not guaranteed an A in school and a transfer to a better school. After this long spiel, I just want some advice. How do I convince my parents that I'm not giving up on law school? That I can pull up my LSAT score and get into a better school?",
    "title": "1L on leave of absence after experiencing 2 mental breakdowns. My parents are livid and I;m terrified.",
    "subreddit": "LawSchool",
    "timestamp": 1634925659,
    "score": 6,
    "keyword": "black judge"
  },
  {
    "text": "What is the court case/footage where a woman judge screams and throws lawyer out of the court? I saw this court judge outrage moments compilation video recently but can't find it any more, in it there was this female judge vs a male attorney. Don't know how it got started but the attorney told the judge something along the lines of \"watch your mouth\", then the footage cut to judge screaming \"get the hell out of my court\", and then asked some black deputy officer to escort the attorney out and attorney said \"I will make you pay if he dare touches me\" to which judge replied  in a yell, \"I hope (the escort officer name) will beat you to a pulp\" and I think the court laughed.\n\nCan't find the video any more and wonder if anyone know the source.\n\nP.S., the footage as I remember looked kinda old, not sure if it was from an olden time or just bad quality.",
    "title": "What is the court case/footage where a woman judge screams and throws lawyer out of the court?",
    "subreddit": "LawSchool",
    "timestamp": 1636929577,
    "score": 0,
    "keyword": "black judge"
  },
  {
    "text": "We need to talk about divesting... ...and how its creating a pipeline for black women to regurgitate right-wing talking points. Why are we listening to these clearly homophobic, transphobic, and overall unknowledgeable people on social media about how black women should date and conduct their lives. Why do we need \"tactics\"? Why do we need \"feminine training\"? Why is it that these divest channels judge black women for changing for men, but then try to do the same thing? As a queer black woman, I am concerned about these influencers and the sway they have over black women and what ideologies they subscribe too",
    "title": "We need to talk about divesting...",
    "subreddit": "blackladies",
    "timestamp": 1625474883,
    "score": 169,
    "keyword": "black judge"
  },
  {
    "text": "Saw the one and only black female obgyn in the area - and it didn’t go well Little background bout me - I’m 22 years old, and pretty anti western medicine to begin with. I’m also pro-choice and needed someone to talk to about BC options for me. Had a bad experience with white male docs last summer and I wasn’t trying to subject myself to that again.\n\nI don’t want to get too deep into it, but basically I live in a very predominantly white + Asian area (bay area CA) and needed to see an obgyn. I searched all over the internet to find this woman, and I guessed judged a book by its cover.\n\nWent in last week and the first thing I saw in the office were mommy magazines and tiny figurines of what I assume was the birth of baby Jesus on the front desk. I should’ve known from that point that I didn’t need to be there. 😅 When she saw me it was like the nice act immediately dropped once it was clear I wasn’t looking to have a baby anytime soon. She was very cold and matter of fact with me, and wasn’t very welcoming or understanding. Didn’t show any compassion when I told her my story. I even tried to hint at how hard it is to find the right doctor as a black woman and she didn’t really pick up on that. She did my Pap smear (didn’t warn me about the discomfort either) and then had her nurse tell me days later I had BV and needed to pick up a prescription that has since been giving me terrible nausea. \n\nNow I know not all black women are the same, and that maybe I shouldn’t have expected a grandmotherly experience just because we share skin color. But I just feel like given the context of this past year alone, the statistics around black women and reproductive health, and the fact that she’s the only black female obgyn in the area.... like am I wrong to have wanted a little more warmth from her?? I’m very disappointed and honestly have had better experiences at my local underfunded planned parenthood 🥴",
    "title": "Saw the one and only black female obgyn in the area - and it didn’t go well",
    "subreddit": "blackladies",
    "timestamp": 1610492714,
    "score": 59,
    "keyword": "black judge"
  },
  {
    "text": "Dating black Hi beautiful queens!\n\nI’m a black women who has not done much dating in her life. I am 30 and probably started dating only a few years ago for so many reasons. I tend to use dating apps because I find it difficult to meet people in person these days (even pre Covid). I don’t navigating the dating world is so tricky as a black women in my experience. One, I’m often fetishized by non blacks, two, the black men I have dated have all been toxic. I’ve had better experiences dating non black POC, I feel less judged and more understood. I didn’t grow up around black people at all and I know they can tell, but In dating I was hoping to experience black love, although now I’m kind of deterred from it. \n\nAny ladies have any consistently bad experiences in dating black\nMen? How was it? How was it compared to dating non black men? Why are they such harsh critics? (One example was one of them making derogatory comments that I don’t have a fat ass/I’m naturally thin) or constantly calling me weird or odd after sharing my love of sci fi. Not having any mutual interests like hiking and backpacking. Or hyper sexualizing me. The list goes on.",
    "title": "Dating black",
    "subreddit": "blackladies",
    "timestamp": 1609615270,
    "score": 29,
    "keyword": "black judge"
  },
  {
    "text": "I wish there wasn’t always better a while ago I searched up “beautiful Africans Quora” and saw questions like “why are East Africans women so beautiful” and “why do East African women look so different?” I was confused bc I didn’t know this was a thing?? Like I knew of colorism and mixed black women (especially when ambiguous looking) commonly being seen as more attractive than darker black women, but East African preference was new to me as someone who has never really lived around East Africans. \n\nI searched up what East Africans looked like and yeah, it made sense. They have the smaller noses, smaller lips, soft wavy hair, etc, all the features not commonly associated with the rest of Africa / slave descendant black Americans (who are primarily from west Africa). \n\nI looked into it and found out that bc of the region’s isolationism throughout the centuries, there is a lot less physical diversity than in other regions of Africa. So that’s why it’s not rare to see a west African or black American w/ a small nose but it is rare to see an East African w/ a big nose. \n\nAnyways i know I shouldn’t have, but I kept  looking and y’all I was so exhausted. There are so many questions on Quora / Reddit about East Africans’ “exotic” look and beauty compared to “regular” black people, like I know I should’ve expected it cus ofc Eurocentric features on dark skin will always be seen as more attractive than Afro centric feature on dark skin, but still it just hurt bc it feels like there’s always another group that’s perceived as better. \n\nRappers like drake talk about East Africans a lot in their music too which is especially frustrating bc it’s like they try to pass it off as black girl appreciation, while only ever praising one specific subset of black people who’a features commonly fit into European beauty standards.\n\nDoes anyone else feel the same way? This isn’t hate towards any East Africans or an attempt to undermine their beauty, it’s obviously not their fault that society is like this, it’s more just a rant about how even within the black community, there’s still a hierarchy based on how Eurocentric ur features are. I just wish beauty wasn’t judged through a white lens \n\n\nEdit: my intent is definitely not to incite drama, it’s just something that’s been hurting me for a while but if it is breaking the rules, I’ll definitely take it down",
    "title": "I wish there wasn’t always better",
    "subreddit": "blackladies",
    "timestamp": 1619202959,
    "score": 26,
    "keyword": "black judge"
  },
  {
    "text": "My Vietnamese family has become extremely hostile towards me, and I'm not really sure what did it. Can you guys give me any input? I'd really really appreciate it. *wall of text warning* I'm not really sure where else to post this, so forgive me if this board isn't the correct one for it.  I'm just genuinely curious what happened and hoping that those with experience with asian cultures can give me input.  \n\nI was born and raised in Brooklyn, I grew up working class in a black neighborhood, my parents were Vietnamese.  My upbringing was rough, but believe it or not I'm adaptable and thrived, it was fine., I loved it.  I was actually very popular growing up, even amongst the hood goons (not bragging, part of the story)\n\nWe were close to my family growing up in Pennsylvania and would visit quite often and they were very caring and loving towards me growing up.  \n\nThen 2019/2020 came along, which were very hard years in my life.  \n\nMy mom had a stroke in mid 2019 and I had to have her placed into a good care facility in PA which costs a large chunk of my salary every month (also NYC facilities are trash unless you can afford 30k a month), but my siblings all chip in and she can stay there for as long as she needs.  My dad died in mid 2019, pre-covid, he had a bunch of health conditions that finally caught up to him.  So more or less, my parents are effectively gone in terms of being in the picture.  \n\nSo when my dad died, my family was still nice and supportive.  And when my mom was placed into the nice home, they would come and visit.  \n\nCue the Trump election / Covid mess.  My family went extreme right wing and became covid deniers.  \n\nI came to PA and stayed with an aunt to quarantine before seeing my mom.  She refused to wear masks, did not let me leave the house without touching me, and telling me I was a communist for listening to the racist left wing media.  I was able to avoid her for the 14 days of quarantine, and the day before I left to go see my mom they threw a party and everyone touches me and calls me a dumbass for believing in democrats, etc.  \n\nAfter that, I couldn't visit my mom (who they have quit talking to and quit visiting), and I went back to NYC to quarantine.  That was a year ago, they haven't spoken to me since.  \n\nMy cousins and other family that are still sane, told me that they've been complaining about me being cheap, abandoning family, hanging out with blacks and being brainwashed by BLM, and that I should not be welcome around a family that knows their place in society and works for money instead of taking handouts.  They repeat the phrase about me being cheap daily.  \n\nI don't know where this came from, and I'm wondering if anyone else had the same experience. \n\nI worked hard to get a decent career, that is pretty stressful and annoying.  I'm not rich, I still live in a hood area because I'm used to it.  And I don't know exactly what cheap means.  I have alot of black friends due to where I grew up, but I'm not brainwashed, I judge people based on their character.  I don't know how I abandoned my family, when they were the ones that told me more or less I wasn't welcome.  And I don't really take any handouts, considering I was lucky enough to work remotely during the pandemic.  \n\nI can't even visit my family anymore, the second I walk in the door its silent treatment or nagging about being abandoning family, but with no concrete evidence as to how I've done that when I ask.  \n\nWhy did this happen?  I'm not really sure what to blame it on.",
    "title": "My Vietnamese family has become extremely hostile towards me, and I'm not really sure what did it. Can you guys give me any input? I'd really really appreciate it. *wall of text warning*",
    "subreddit": "asianamerican",
    "timestamp": 1628958029,
    "score": 105,
    "keyword": "black judge"
  },
  {
    "text": "Judge: Black School Board Member Demoted for Anti-Asian Tweets Did Not Suffer First Amendment Violation; Claims Barred by Qualified Immunity",
    "title": "Judge: Black School Board Member Demoted for Anti-Asian Tweets Did Not Suffer First Amendment Violation; Claims Barred by Qualified Immunity",
    "subreddit": "asianamerican",
    "timestamp": 1629292845,
    "score": 70,
    "keyword": "black judge"
  },
  {
    "text": "Black men matter Now before you read the title and downvote, let me clarify something. Yes, I know that the male experience is not exclusive to black men. I’m a white guy myself. But the hardest hit group by the modern war on men is almost certainly black men. Think about most of the issues that negatively affect men more than women: disproportionate sentencing, capital punishment, police brutality, fatherless homes, false rape accusations, homelessness, homicide, suicide... the list goes on and on. These issues, be they societal or legal, are often exacerbated for black men. Take sentencing disparities for example. In the US, 1 in 111 white women are in prison. Meanwhile, 1 in 17 white men are in prison. Pretty bad disparity, right? Now get this: 1 in 3 black men are in prison.\n\nWhat are the reasons for this? Well above all else, I’d say it’s all about being perceived as a threat. Men are more likely to be seen as threats than women. I think the fine folks here understand that well. For black men, this issue is once again exacerbated. Nothing pleases a racist, misandrist judge more than seeing a young black man being “taken off the streets” because he’s seen as a threat. And this perception also frequently manifests itself in the form of police homicide. It’s how a police officer can walk into a random, law-abiding citizen’s own apartment and [shoot him to death](https://en.m.wikipedia.org/wiki/Murder_of_Botham_Jean) while he’s sitting on his couch because she thinks he’s an intruder. Btw, that police officer will be eligible for parole after just five years, and she’s currently appealing to have the murder charge dropped altogether. How’s that for “male privilege”?\n\nAnyway, the point of this post is not to create division. Once again, I think that white and black men both experience hardships due to our sex. And I’m not trying to imply that every woman is racist against black men, or misandrist as a whole. My point is just that we should be aware of the experiences of our black brothers, and stand with them as they battle racial inequality in addition to misandry.",
    "title": "Black men matter",
    "subreddit": "MensRights",
    "timestamp": 1611783366,
    "score": 130,
    "keyword": "black judge"
  },
  {
    "text": "Huge feminist protests erupt across Caribbean island Trinidad and Tobago in light of the recent rape and murder of a 23-year-old girl, Andrea Bharatt. [https://www.newsamericasnow.com/caribbean-news-andrea-bharatt-murder-trinidad-and-tobago/](https://www.newsamericasnow.com/caribbean-news-andrea-bharatt-murder-trinidad-and-tobago/)\n\nTens of thousands of men and women are protesting against the government of Trindad to do something to improve the safety of our women. Dozens have gone missing and have most likely been raped and murdered.\n\nAfter the recent (Jan kidnapping, murder and suspected rape of Andrea Bharatt, enough is enough!\n\n[https://newsday.co.tt/2021/01/30/arima-woman-kidnapped-ransom-demanded/](https://newsday.co.tt/2021/01/30/arima-woman-kidnapped-ransom-demanded/)\n\n**She was an innocent sweet, university educated, 23-year-old girl who worked as a clerk at a Magistrates court.** She was was abducted in a 'fake taxi' on January 29th. After several massive manhunts, her body was eventually found 7 days later. From all accounts, she had been killed the same day she was taken.\n\n**About Trinidad -** The southernmost Caribbean Island and 3rd richest country in the Western Hemisphere per capita, the oil-rich Trinidad who invented Steelpan music, Soca and Calypso and has the world's second-biggest carnival, is no stranger to violence and crime.\n\nWe are a uniquely cosmopolitan island (40% Indian, 40% Black, 20% mixed/white/Venezuelan/Syrian) country of 1.5M people that has surprisingly little racial tension but has been plagued over the last 2 decades with increasing gang violence.\n\nHowever, despite having near 500 murders annually for the last 20 years (10,000 people murdered) one recent murder shook the nation to its core (after years of several women going missing or murdered/raped).\n\n**Andrea Bharatt was possibly raped, murder and then dumped over a ledge along a mountainous road in Aripo.**\n\nPolice were able to hold two suspects, one was found with her bank card who later sold out his accomplice.\n\n**The main suspect was well known to the police.** In fact, he had 70 charges and numerous criminal cases against him, yet for some reason, **he was not in jail.** On 5 occasions shoddy (or bribed) police work resulted in cases being dropped. Other cases were still pending, but judges saw it fit for some reason to grant him bail.\n\n**The lack of urgency, complacency, incompetence, corruption and ownership of these issues by authorities has ANGERED an entire nation, a nation where women are feeling increasingly unsafe.**\n\nIt has been met with silence, and politicking by the government who refuses to take responsibility and attempt to pass the blame.\n\nProtestors and feminists are taking to the streets to bring attention to this issue, but we need this to go international to pressure our government to take responsibility and weed out corruption.\n\n&#x200B;\n\nThe two suspects later died in police custody with the police claiming one 'fell off his chair' and the other got injured in an escape attempt.\n\nNo doubt police who were complicit in these guys not being in jail and were trying to shut them up,\n\n&#x200B;\n\n**This is reminiscent of what happened in Delhi with the brutal bus gang rape in 2012.**\n\nHowever, we need your help. We have a condescending out of touch government that caters only to the needs of the richest in the island and not the average citizen.\n\n&#x200B;\n\nThe victim - [https://s1.stabroeknews.com/images/2021/02/andrea-b2.jpg](https://s1.stabroeknews.com/images/2021/02/andrea-b2.jpg)\n\nA video project by the victim - [https://youtu.be/lqaJDOxfeFg](https://youtu.be/lqaJDOxfeFg)\n\nThe headlines - [https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p180x540/148357699\\_10158003590655814\\_4702965862099867631\\_o.jpg?\\_nc\\_cat=108&ccb=2&\\_nc\\_sid=730e14&\\_nc\\_ohc=OOPzySAt6sgAX\\_zfXSE&\\_nc\\_ht=scontent.fpos1-1.fna&tp=6&oh=6f657382c1bda4f7523dc0c0e170a079&oe=60483DD0](https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p180x540/148357699_10158003590655814_4702965862099867631_o.jpg?_nc_cat=108&ccb=2&_nc_sid=730e14&_nc_ohc=OOPzySAt6sgAX_zfXSE&_nc_ht=scontent.fpos1-1.fna&tp=6&oh=6f657382c1bda4f7523dc0c0e170a079&oe=60483DD0)\n\nThe essence of the government's response - [https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p526x296/147852653\\_10159315695791119\\_866468936050134841\\_o.jpg?\\_nc\\_cat=103&ccb=2&\\_nc\\_sid=730e14&\\_nc\\_ohc=LBTXQi4pP3QAX8aOWi9&\\_nc\\_ht=scontent.fpos1-1.fna&tp=6&oh=b11bf5728cd0266c4a99a6b505897f16&oe=604959CF](https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p526x296/147852653_10159315695791119_866468936050134841_o.jpg?_nc_cat=103&ccb=2&_nc_sid=730e14&_nc_ohc=LBTXQi4pP3QAX8aOWi9&_nc_ht=scontent.fpos1-1.fna&tp=6&oh=b11bf5728cd0266c4a99a6b505897f16&oe=604959CF)\n\nVideo of our Government's nonchalance and condescending attitude here - [https://www.facebook.com/100001952421497/posts/5106469866094710/?sfnsn=wa](https://www.facebook.com/100001952421497/posts/5106469866094710/?sfnsn=wa)\n\nAll the women killed/missing over the last decade or so - [https://scontent.fpos1-2.fna.fbcdn.net/v/t1.0-9/144741275\\_747508228171\\_652795971916147088\\_o.jpg?\\_nc\\_cat=105&ccb=2&\\_nc\\_sid=8bfeb9&\\_nc\\_ohc=WuQiiDTRauoAX\\_WtmhP&\\_nc\\_ht=scontent.fpos1-2.fna&oh=5e3cba222c8379d1a2e61bcd1df47fce&oe=60466014](https://scontent.fpos1-2.fna.fbcdn.net/v/t1.0-9/144741275_747508228171_652795971916147088_o.jpg?_nc_cat=105&ccb=2&_nc_sid=8bfeb9&_nc_ohc=WuQiiDTRauoAX_WtmhP&_nc_ht=scontent.fpos1-2.fna&oh=5e3cba222c8379d1a2e61bcd1df47fce&oe=60466014)\n\nPetition (one of many) - [https://www.change.org/p/minister-of-national-security-protect-our-women-in-t-t?recruiter=false&utm\\_source=share\\_petition&utm\\_medium=facebook&utm\\_campaign=psf\\_combo\\_share\\_initial&utm\\_term=psf\\_combo\\_share\\_abi&recruited\\_by\\_id=150ab800-67ce-11eb-a39e-db9fdf139296&utm\\_content=fht-27200205-en-gb%3A0](https://www.change.org/p/minister-of-national-security-protect-our-women-in-t-t?recruiter=false&utm_source=share_petition&utm_medium=facebook&utm_campaign=psf_combo_share_initial&utm_term=psf_combo_share_abi&recruited_by_id=150ab800-67ce-11eb-a39e-db9fdf139296&utm_content=fht-27200205-en-gb%3A0)\n\n&#x200B;\n\nWe want this to go viral, this needs to reach CNN, MSNBC, BBC, even FOX or OAN (we really don't care at this point).",
    "title": "Huge feminist protests erupt across Caribbean island Trinidad and Tobago in light of the recent rape and murder of a 23-year-old girl, Andrea Bharatt.",
    "subreddit": "Feminism",
    "timestamp": 1612830730,
    "score": 69,
    "keyword": "black judge"
  },
  {
    "text": "The Elle Woods Complex: Blondes who wear pink/dress femme are severely judged in society. I did an experiment of going blonde/wearing pink to prove this So I'm a standup comedian. I'm deadpan and discuss very dark topics. I used to appeal to the \"doomer girl\" fantasy when I was dealing with insecurity issues/need for validation. I would wear black on stage and had dark hair, wore dark makeup.\n\nMy female comedian friend who is more stereotypically feminine used to hide under big jackets because men would never listen to her or shrug her off, I theorize because of her femininity. She comes from a wealthy background, is blonde, and a fitness guru, and was always judged for this. Men wouldn't even listen to her on stage or walk out. I thought it was fucked up that they made her feel this way so much so that she felt the need to hide her femininity. So I conducted an on-going experiment: I went blonde, and wear pink on stage.\n\nUnsurprisingly, I'm treated much differently than when I appealed to the anti-manic pixie dream girl fantasy. I relish the looks of surprise (in particular from men) when I go on stage in something \"feminine\" and pink and say something dark/intelligent. I frequently get called out by male comedians who assume that I'm an audience member. I got called a \"dumb blonde b1tch\" and got accused of being the type of person to say the f word, \"you've definitely said the (insert f word),\" \"you definitely drink\" etc.\n\nI realize that I put a target on my back for my own entertainment. A part of me regrets it. But I just think that it's interesting and I wated to share.",
    "title": "The Elle Woods Complex: Blondes who wear pink/dress femme are severely judged in society. I did an experiment of going blonde/wearing pink to prove this",
    "subreddit": "Feminism",
    "timestamp": 1626320424,
    "score": 17,
    "keyword": "black judge"
  },
  {
    "text": "An imaginary letter to Candace Owens and Shapiro \"we live in a society where femininity is looked down upon and masculinity is admired\" This is a mental letter i wrote to shapiro and candace owens after the harry styles wearing a dress episode. \n\n\nHi Ben and Candace, \n\n\nThis is a letter regarding your and candace owen's opinion on Harry Styles wearing a dress. I have, from watching your videos, come to the conclusion that you and candace are honest people who have well thought out opinions and actually care about society. Due to this, you donot hesitate to express opinions that earn you flak because you care about the truth. However, your opinion on this particular subject, is actually harmful to society, men and women in such a profound way, that I decided to write this email.\n\n\nToday we are living in a society of political equality, equality of oppurtunity, morality and availability of choices between men and women. But for centuries the world has not only enslaved and exploited women, but also this negative attitude towards women also extended to a negative attitude towards femininity and feminine traits. Slaves were often castrated before being owned, as once un-masculinized, a man becomes someone who doesn't deserve agency and can be owned.\n\n\nBut femininity is not weakness. If masculinity helps defend civilization against threats, femininity helps build up a society of harmony that is protected by masculinity. For healthy adulthood and functioning, both men and women must inculcate both masculine and feminine traits within themselves. So many feminine/female typical traits actually help build better leadership like conscientiousness, introspection, ability to process and work with limitations/ vulnerability and emotions, and empathy. Masculine traits like assertiveness, and ability to draw boundaries are also very valuable. \n\n\nBut men are shunned if feminine. For eg: Justin Bieber was harrassed online for several years for having a not yet masculine voice, singing about love and having a female fan base. It wasn't until he cheated on his girlfriend, had stupid anger bursts and behaved like a spoilt, bratty jerk (code words for hypersexuality and aggression) that he won male respect. 1Direction faced the exact same fate. The word gay was used against them as an insult. (Since gay means feminine and hence condemnable. I have never seen lesbian used as a insult in this sense)\n\n\nEven women are victims of this issue. If you read YA fiction, you will see it filled with aggressive, impulsive women who are not exactly strong, per my opinion. An example would be the characterization of bella from twilight, a hollywood movie, as a woman who punches werewolves when she is 'pissed' off at them and could not get along with other girls so now she is a 'strong' woman. (she was nothing like that in the books) And the \"cool girl\", \"not like other girls\" phenomena. Eg: Ginny weasley in Harry Potter novels. Which is why the movie legally blonde is the greatest feminist statement in recent times, because the movie does not merely show a strong woman, it shows a pink donning, blonde, fashionista in a strong, intelligent light. Which is simply revolutionary.\n\n\nFemininity is healthy. You may disagree, but femininity is not obedience or subservience. Women calculate for risk better and are less likely to fall for financial scams like Game stop. Women are better empathisers and communicators ( women are less likely to laugh at prank videos and more likely to feel bad for a hurt football team player in a football game while men respond with disappointment than sympathy) This makes women better leaders, negotiators, organizers, doctors, psychologists, etc.. There are also male typical/masculine traits that are admirable, like assertiveness, but masculine traits are already admired by society, but feminine traits are somehow looked down upon. To the point where girls are now hesitant to say they like pink. Yes, saying that you like pink is considered girly and shameful amongst women, girls prefer to say that they like black, as it is more cool.  Girls just hate being girly girls because it is considered to be weak and subservient. \n\n\nYou say asian societies donot feminize their men. Asian societies choose to build so called strong men but tell women to enslave themselves. Women are killed in female foeticide or people cry when they are born as they are considered 'weak liabilities.'\n\n\nThe sucide rate amongst men is 4 times higher than women. This is because to be in touch with your emotions or to seek help is 'feminine.' There was recently an incident in which a school boy was 'humped' by his classmates (it would have been rape had he been a woman). He held his phone trying to call his mother to cry for help, but did not know how.  Men are repeatedly raped and abused, but hesitate to even admit it to themselves. Horrible male on male bullying of gender atypical \"sissies\" is disturbingly common.\n\n\nWhen Harry Styles wore that dress, when men are allowed to cry/exhibit emotion by society, it is empowering. As for once, femininity is not weak. Femininity is not lack of leadership/achievement. Femininity is not lack of agency/stupidity/subservience.\n\n\n\nA strong man loves a strong woman and isn't threatened by her. A strong man isn't threatened by femininity, in clothing or jewellery. A man is not \"weakened\" by a dress. If you believe that when a man wears a dress, he loses agency, strength, and ability to defend the civilization, do you believe that women, since they wear dresses, lack agency and strength? To me, you saying feminizing men is a problem is saying that femininity is a problem...ie., it is bad/weak and not meant for 'strong, proper' men.\n\n\nBut you say, men and women are meant for different roles? How did these roles help the self esteem of women? Thanks to these roles, women could not pursue a career, make money, choose/judge their partners, or achieve things. It was the 'role' of men. If you feel it is perfectly fine for women to do the afore mentioned things, then that means women are strong and admirable, and men are not weakened by femininity. Please reconsider your ideas on femininity. \n\nRegards,\n\nA person who cannot afford a daily wire subscription to contact you directly.",
    "title": "An imaginary letter to Candace Owens and Shapiro \"we live in a society where femininity is looked down upon and masculinity is admired\"",
    "subreddit": "Feminism",
    "timestamp": 1616173144,
    "score": 7,
    "keyword": "black judge"
  }
]