[
  {
    "text": "Work environment as a major reason to join a company? After working a few jobs, I've come to realize that work environment is the most important factor to me in a job. What I mean mostly is having reasonable bosses that are positive, supportive, and respectful, and having a relatively relaxed environment. I work my best when I don't feel under pressure (like if I'm being graded or micromanaged) and feel like I can openly communicate with others and ask for help without being judged. For me, this is kind of a make-or-break deal, because I feel like if the environment is positive and relaxed, then other factors like pay and work hours are likely to be reasonable as well.\n\nI'm asking for advice because I'm looking into moving to Japan, which is not exactly known to have the kind of work environment that I'm looking for, although I think it's gotten better over the years. The term \"black corporation\" is commonly used to describe companies with tough working conditions like mandatory overtime with little to no pay. However, I recently discovered that \"white corporations\" is a term now, that describes companies that have good work environments. One such corporation (according to some websites) is Panasonic, which happens to be a vendor at a career fair that I'm planning to attend. My background is in computer science and I currently work in IT, so it's not a field that I would be not suited to work in, but honestly, the biggest draw for me is the (supposedly) ideal work environment. When they ask, \"why do you want to work here?\", would it be committing a faux pas to compliment them on their reputation as a company with a good work environment, and tell them that that's one thing that is very important to me? I would try to explain it as professionally as I can (it motivates me to work hard, etc.), but I don't want to come off as being someone who just wants the easy way out, because that's not true at all. I work with integrity and am very flexible in most other aspects, but I just don't believe in being overworked and not respected.",
    "title": "Work environment as a major reason to join a company?",
    "subreddit": "jobs",
    "timestamp": 1555963949,
    "score": 0,
    "keyword": "black judge"
  },
  {
    "text": "One Texas county just swore in 17 black female judges",
    "title": "One Texas county just swore in 17 black female judges",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1546433140,
    "score": 17412,
    "keyword": "black judge"
  },
  {
    "text": "Assault at Church **I’m writing this encounter nearly thirteen years after it happened. It’s sleepless nights like now when I’m compelled to reopen old memories. So, if you don’t mind reading about a naive preteen, asinine (and racist) adults and one sick pervert all mushed into one story, here goes:\n\n-\n\nIt all started in the summer of 2006 at a local teen bible study group (where really it was a place for teens to hang out and volunteer at). The location was held in an Asian Empowerment-Christian church so everyone was 99.9% Asian so my being not full Asian (I’m Japanese and Mexican), I nonetheless stood out like a sore thumb. And other church members often made jabs at my tan skin and high bridged nose, and adding things like “Sorry we don’t serve tacos! Just fried rice!” to even doubting my Japanese last name (“Did you take this name from an anime?”). I sound like I’m digressing but this information will be relevant in a bit. \n\nIn retrospect, I don’t know why I didn’t catch these red flags. I should’ve just left and enjoyed my summer at home. I sat alone most of the time anyway. No one noticed my discomfort save for one person. \n\nLogan.\n\nLogan was this tall Asian twenty-something year old man. He was related to one of the Bible study leaders but only showed up a few times a month. Logan was slim and tall, wore Hollister apparel and slick, black hair that parted at the middle. I remember his humor and laidback style made me feel comfortable around him. Logan even went as far as to ruffle my hair and sit next to me during bible study. He even went as far as commenting on my looks, saying he liked my eyes a lot. That I looked mature for a thirteen year old. Quite the charmer, I thought.\n\nOne day, we were supposed to meet up at a baseball game and Logan offered me and a few others a ride for carpool. As luck would have it, when I arrived at the church (our meet up location), he was the only car there. I asked him where the others were to which he replied that they they all left early since they didn’t want to wait up on us. I found it strange since it wasn’t even that late to begin with. Ignoring my gut, I silently went inside the car anyway.\n\n This is when it starts getting scary. \n\nAs I was opening the backdoor, he was motioning for me to sit in front. I usually didn’t feel comfortable sitting in front with non-family members at the time. I insisted that I was okay - I even joked that he was my chauffeur. But Logan’s face didn’t show that he took my awkward humor well. He turned around with a serious expression. Not saying a word. I stared back, wondering what was wrong. Before I was able to ask, Logan reached over for my hand and began smothering kisses on it. Stunned and confused, I immediately yanked my hand back. I was speechless, not even asking why he was doing what he was doing. His eyes were still glaring and his usual kind voice was now more hitched and deep. “It’s fine. You know me. You like me,” he whispered as he unclipped his seatbelt. He began lifting his body towards the backseat. In that split second, I knew I was in danger. I saw that the backdoor wasn’t locked and I opened the car to make a run for it. I don’t know what came over me that day but I remember losing control of my body at that moment. All senses were hazy. \n\nI later found myself in the pizza parlor that was down the street. I sat there in one of the booths. I just had to be around other people. Other strangers where I could feel immersed once again. Hidden away from Logan’s eyes. After what felt like an hour, I called my friend (who lived nearby) if she and her mom could pick me up. \n\nIt was the last time I ever stepped into those church grounds. I didn’t tell anyone immediately and I had planned it that way until I received a call from the church leader - Logan’s sister. She asked if I was alright and where I had been. It was then that I broke down and spilled the story about what happened to me. She didn’t say anything. Only silence hung around the atmosphere. I doubted at that moment if I made the right decision. \n\nLogan’s sister finally broke the silence and I wished she hadn’t.\n\n“You’re at that age when...we don’t know what we seek. We look for something to compensate what we’re missing...which is usually the case for Hispanic girls like you. It’s no wonder you guys get pregnant so early, you know? Break away from that, ok?”\n\nI didn’t even believe what I was hearing. She was insulting me in every way possible under the guise of a benevolent church leader. Someone who was meant to help - not judge you nor your race. I felt like throwing up. Is this really what my experience is worth to others?\n\nMy thirteen year old self didn’t say anything and just hung up. I hated myself for even trusting her - of all people. His sister. I had all these thoughts swirling over me. What did I do to deserve this unfair situation? I didn’t bother anyone. I was not trying to tempt anyone. Why did it matter whether I was Mexican too? Where is Logan now? Would he come back and show up to finish what he started?\n\nSuch thoughts accompanied me all throughout my teen years. I couldn’t help it. The damage was done. I was stupid and naive. \n\nFast forward to now, I am doing much better thankfully. I’m not fully absolved from my past unwanted memories but things have indeed improved. I have loving friends and a sweet significant other. My parents are still my greatest pride. \n\nI just hope that on nights like now that my idle mind doesn’t betray me anymore. I don’t ever want to meet or let alone think of Logan or his sister again.",
    "title": "Assault at Church",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554966681,
    "score": 18,
    "keyword": "black judge"
  },
  {
    "text": "I've always considered myself pro-life, but... ...I don't think I can call myself that anymore because I am completely appalled, horrified, enraged, and disgusted by the ridiculous and terrifying laws that have been enacted in several states in the U.S.\n\nI believe ALL life is sacred. I believe ALL life is worthy of protection, regardless of ethnicity, country of origin, gender, whatever. I'm pro-life because life is not just the unborn, and not just a political point. I don't understand how you can say \"I support this life\" at the expense and punishment of another.\n\nI want to find another way of describing myself and people like me, because I'm sure I can't be the only one who thinks like this. I hate that we have 2 black-and-white terms to describe beliefs on this issue, because the reality is there's a whole lotta grey.\n\nI created an account because I'm going crazy keeping all this inside. Almost everyone else I know (minus my husband) is of the rabid political pro-life mindset...yeah, grew up sheltered conservative. I just wanted to share in a place that hopefully I won't get judged for, because I know if I shared my actual views with certain family/friends, there's be a whole lot of judging.",
    "title": "I've always considered myself pro-life, but...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1558193486,
    "score": 14,
    "keyword": "black judge"
  },
  {
    "text": "He got me pregnant and left me for another woman. Now he's pushing abortion. I don't know what I want but I have a lot to get off my chest I was seeing someone for a short amount of time. I had fertility issues and was sure I was not able to get pregnant naturally. He talked about how he wanted kids with me and I said we could in the future (if we lived together and were committed, possibly getting ivf, etc). he was saying things like, how i could still get pregnant now, etc, and how he wanted me to get pregnant and wanted to finish in me, etc. I just rolled my eyes at this. Stupid, I know. But I had a different ex that I had unprotected sex with for YEARS, and nothing ever came of it. I genuinely though I was unable to get pregnant naturally and I was told that from my doctor more than 10 years prior. But he kept insisting that he wanted to have kids with me. that he wanted me to be a stay at home mom.\n\n&#x200B;\n\nSuddenly he was very distant to me, but kept insisting that he was committed to me, though he kept brushing off my concerns and acting like I was being ridiculous. Eventually I demanded an answer, wanted to know what was going on. At that point he dropped off the face of the planet. A week later he contacted me and said that I was right and told me that he had got back together with his exgirlfriend. This was a big slap in the face, because he always said he would never do that, didn't want her, etc. He said he lied about it because he didn't think she would ever come back.\n\n&#x200B;\n\nThat was hurtful enough, but now, I'm pregnant. it's his. I told him. He is pushing me to get an abortion. He also added that if it came to it, he would do everything he could to get sole custody of the child, even though he lives two states away. I'm worried that he might be able to do that. He makes significantly more money than I do and he works from home. He has this ex back that I'm sure he's probably already planning to marry. I work full time, am single, and I still can't afford my bills even without a kid. I'm worried that the judge will see those things, and give him the kid, and I will end up paying this guy child support that I won't be able to afford, so that he can take the kid away from me, the one he wants me to abort.\n\n&#x200B;\n\nI'm disgusted with myself for ever having been with him. he's sexist and racist. he has a very high income but he's the biggest loser i've ever met. he never had work hard for anything he has. he's obsessed with stupid waifu games in his mid 30s. he smokes pot everyday and goes days without showering. a lot of our relationship was based on bdsm but the truth is, he's not a dom, he's just a selfish asshole who wants to be called \"master\" and I was so stupid that I fell for it. I thought he loved me but I don't think he ever did. sometimes I wonder if he really feels anything for other people.\n\n&#x200B;\n\nI have so many thoughts going through my head. Sometimes I think, maybe a judge would give me physical custody and the kid could visit my ex too. that would be as much contact as i would want them to have. i wouldn't want my child to learn morality from this guy. some of the things he's told me truly make me sick. he looks down on people in poverty. the vile things he's said about women and especially black women. what if the baby is a girl? what if it's a boy? either way, i couldn't stomach having a child who turned out so hateful.\n\n&#x200B;\n\nbut at the end of the day, I can't even afford my rent, let alone a lawyer. and I know my ex is weird about always getting his way and not backing down (even when he's wrong). he demonstrated it when we were together. i thought about breaking up with him. i should have broken up with him. i'm such an idiot. if I have this baby, I will have to deal with this bigot for the rest of my life and he might completely raise my kid away from me, while I pay him money i don't have.\n\n&#x200B;\n\nPart of me really wants this baby. I've already grown attached to it. I've been thinking about names and moving in with relatives so I can have the baby. I've been cleaning the litterbox with gloves on. I've been thinking of when I should tell my family. But the other part of me wonders if it's fair to bring this baby into the world, when it will live in poverty with me or it will be raised by someone like its father. I'm also thinking about abortion. I'm scared to be tied to the baby's father for 18 years. I know he would make my life a living hell if I had this baby.",
    "title": "He got me pregnant and left me for another woman. Now he's pushing abortion. I don't know what I want but I have a lot to get off my chest",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554639920,
    "score": 15,
    "keyword": "black judge"
  },
  {
    "text": "I think I might have been drugged on Monday night and my purse was stolen... need advice. I'm 29 if that means anything. So Monday night I went out for a couple of drinks with a friend. Nothing wild. Didn't want to get sloshed as it's Monday and I don't want to spend my Tuesday hungover (I didn't have any commitments on Tuesday.) So my friend left and I began walking home and decided to have a quick drink on my own at another pub that I frequently visit on the weekends with my friends. Also, it was Mothers day and my mother has passed, so I like to make it a tradition when it's her birthday/death day/Christmas and Mothers day to go and treat myself to a couple of my favorite beers alone and just reflect. I've done this many times before and I really enjoyed it.\n\nSo I walk in, ordered a drink and sat by the window. The pub was pretty empty except for 2 bartenders, I guy who I think works there and a couple of their friends. I finish my drink, look at the time and it was only 1130 and I was enjoying myself so I decide to get one more. This is when they invite me to sit with them if I wanted so I do so. From there they were all doing shots and would buy me one too. So I did 2 shots until I said no more since I was still relatively sober - I was getting pretty tipsy but I wasn't drunk. I know myself well enough to know my different stages and I was still highly functional.\n\nI remember then getting one more beer. lol I know it seems like that's a lot of alcohol, but I take my alcohol well. A lot of people say that they can't ever tell if I'm wasted or not because I can still hold a conversation without slurring my words or not making sense when I confirm that yes I was wasted. So with that, I remember having my 3rd and last beer, talking to a new friend I made who gave me her number so we can chill one day and then just black. I don't remember a single thing leading up to the moment when I woke up at 4 am in the pouring rain, in the MUD (wearing a nice expensive coat too) with my purse gone. I hardly remember all that either, it just comes in snippets. but I guess I called my new friend several times and I guess she got me an uber to her place to pass out in.\n\nIt also looks like I made a 15-second video at like 230am...It's very embarrassing and kind of scary. The video looks like my phone is just in the grass and you hear me say something but you absolutely can't tell what the fuck I said because it sounds like my mouth and jaw just aren't working... like slurred SO badly, then I say something about how I'm in the dirt and it sounds like I am saying it in a British accent and then stops... this has never happened to me before. I've had blackout nights before but I ALWAYS make it home.\n\nSo, He took my purse which had my Kate Spade wallet my BFF gave me for my birthday, along with 70 dollars in my wallet (that one really hurts), he spent 100 off my debit card using tap, I had 3 of my favorite Anastasia Lipsticks in there (Never know when you might need one) so that'll cost me an arm and a leg to replace (that one also REALLY hurts), my new passport photos and an iPod that I've had for 5 years that I've spent all this time accumulating my favorite music into it.\n\nI am also pretty poor. I am unemployed at the moment however working with a job developer to help me get a job as a security guard. I just passed my test so now I am just waiting for my license to come in the mail so I can start applying. but for now, I have just been using my savings to pay rent and Monday night was one of my treat nights to myself and I remember taking 100 dollars out so I can pay my landlord my 50 dollars for my parking garage fee and the other 50 for groceries and a few beers. So that 70 dollars HURTS. I didn't even get to pay my landlord yet.\n\nHonestly FUCK that guy. I am honestly not even sure if I was actually drugged but I can't think of any other reason why I was like that. I don't at all remember leaving the bar but my new friend said how I said I was going to go home now, got up and said goodbye to everyone normally but I have absolutely no memory of that.\n\nAnyway, I just wanted to rant my story and see if anyone else wants to share their experience. I didn't go to the police station yesterday because I just spent the day sleeping, crying and going to retrieve items such as a new bank card, drivers license, etc. but I think I am going to go to the police station today. I know they won't be able to do anything about it but I should still go, right? I just don't want them to judge me or think I am just this wasted party girl (because I really really am not) or get mad I didn't come in sooner.",
    "title": "I think I might have been drugged on Monday night and my purse was stolen... need advice.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1557935739,
    "score": 6,
    "keyword": "black judge"
  },
  {
    "text": "It's been almost a decade since my life changed completely. So this is my fake account for obvious reasons.  I'll try to make this short but I really just need someone to talk to that would understand, I know there are others like me.\n\nI got married to my highschool sweetheart.  Things were great until we got about a year in and a child later.  He was kind at first, and really charming.  He always knew what to say so people would listen to him and believe him.  He was a master manipulator, he still is.  So naturally everyone believed him when things went bad.\n\nHe started drinking heavily, blacking out almost nightly.  He started using martial arts to force me into submission, think of pressure points and things police use to restrain people; he had similar training.  It was bad, real bad.  I broke, in situations like that you don't always think clearly when fear is the driving factor in every single thought process.  It changes you.  It takes everything you are and perverts it.  You find yourself justifying the abuse and why your the bad person.  I can't tell you how many times I found myself defending him for what he was doing to me.  Years went by of this.  The sexual assault got worse, from just being a little violent but me not saying no mostly from fear of backlash, to flat out rape; sometimes accepting it was better than trying to fight and say no.\n\nIt got so bad I stopped trying to be safe in my day to day life, walking into traffic without looking in the hopes of getting killed by a train kind of bad.  I stopped eating; during the times I can remember I would eat once or twice a week, I don't know how that alone didn't kill me.  There are times where I honestly can't remember anything that happened because of the intensity of everything, years of missing memory.\n\nWe had two children together.  The first was not planned but I was happy about it.  The odd thing was that he never ever did anything to the children and never in front of them either, the small mercies I guess.  The second was not planned or wanted.  It was a product of rape.  He only did things to me a few times a year in a sexual manner and by then none of it was consentual.  I had no choice but to keep the child.  Don't get me wrong, they are innocent and I care for them in a way that any normal person cares for another human.  I even have a love for them that is unique in the way that I want what is best for them as long as it doesn't involve me providing emotional support or even having to look at them.\n\nWhile this may sound fucked up, it's like trying to tell a woman she has to keep a pregnancy from rape and love the baby.  They look like him, exactly like him.  Every time I see them, hear them, think about them, see their names, meet people with their names...  It's torture, every single time I am forced to relive everything.  I relive the rape and the nights he held me captive.  The night he tried to kill me.  The times when I tried to escape and he incapacitated me, the times I almost got away to have him drag my by the neck back into the house.  Long story short the cops came eventually and I defended him because I was so afraid of what he would do to me if I said anything.  I know they didn't believe me but what can they do when the victim is telling them nothing is wrong and there was no violence even though the neighbors just reported it; this is in a location where women are only just able to work and have some basic rights but still are treated as lesser beings.\n\nUnderstandably so, i have really bad PTSD.  I can't be alone with men I don't know, it scares me to the point I shake and can't breathe.  I can't go into public without my service dog there, being around people is a struggle.  I'm good at pretending but I'm still having a hard time not shaking and running when people get too close.  I don't like physical contact from anyone if at all possible, even just a hand on my shoulder is painful in the most bizarre way, it's that sinking painful gut ripping tightness that happens right before something really bad is about to happen, you can see it and you know it's coming but there's no stopping it.  I've spent the last decade trying to get over it.  But there are some things that never ever go away no matter how hard you work.\n\nThings were good for a while.  I'm with someone now who has helped me with this a lot and is still trying their best.  There is only so much a person can do in this situation where they don't understand, how do you understand something you've never seen or lived through yourself.  How do you help someone when you don't know what's happening to them.\n\nSo recently I have received letters in the mail about child support.  Normally I'm ok with this and I didn't fight it after the divorce.  Let's talk about that for a second.  I finally got away, went into hiding.  I had no representation, my family told me that \"you must have done something to deserve what he did to you, maybe you shouldn't have made him mad\".  They went to the judge and said I was a liar, my own mother took his side in everything.  That was the straw that broke the camel's back.  I told the judge everything that happened to me, they didn't step in or get me help or provide an advocate.  I was ignorant to what should have happened in a situation like this.  I told him to just give me a retaining order and let me hide so he can't find me ever again.  I gave him full physical custody with visitations if they wanted as long as someone else was involved in handing off the kids.  I just wanted to end it and try to pick up the pieces as best I could.\n\nI send money via child support even though I shouldn't given the situation, I'm not sure if it's right but I'm trying to do the right thing whatever that is.  So this letter comes a week ago about child support, the normal thing you get for taxes.  And it's like those ten years of work mean nothing every time I get one of these letters.  Now mind you there has been no visitations but not because I didn't offer or try.  Near the end of my attempts I would end the phone calls early because I would have panic attacks and start crying.  That's not fair to the children.  It's not fair to them that I can't stand to look at them because it reminds me in very vivid detail what their father did to me and that there was no Justice for me.  It's not their fault that just the sound of their voices puts me at risk of having an episode where I don't see what is around me and I'm seeing a mental movie of my past and all I can do is sit there and cry, I can't hear or see what's around me when this happens so it's hard sometimes to come out of it on my own; hence the dog.\n\nI'm so tired.  I'm horridly tired.  I want to be happy and not suffer.  I don't want to have the constant reminders of what happened to me, what feels like is still happening to me sometimes when I have these episodes.  So I've decided to sign over my rights completely over the children.  I've not seen them in almost a decade, I've not talked to them in years.  And honestly I don't want to talk to them or see them, ever.  I love them enough and I'm smart enough to understand that having someone like me around as a mother is bad.  I'm broken and can't be around them without having my PTSD take over.  I'm afraid of their father enough that I will do everything to make sure he doesn't find me.  Even if that means that the children hate their mother for leaving.  Now don't get me wrong, they are very much safe.  I made sure if that.  They are happy and have anything they could ever want with their grandmother watching over them.  But I can't be a part of that without putting their mental health at risk.\n\nSo now I will have to talk to a judge again.  I have to tell them why I'm signing away my rights.  I'm also having to explain why I'm asking to not go to court and instead sign things without a hearing.  I'm hurting, horridly so.  But I'm hurting because I'm afraid they will deny my request. I'm afraid to tell anyone about anything again.  I don't talk about it anymore to anyone, when I do I get worse.  The nightmares start up and the anxiety and panic gets worse.  Like I said, things were ok when I didn't have to talk about it.  But now I have to and I'm so scared.  I can't sleep or eat, the nightmares are back.  My chest hurts and I can't breathe most of the day; not my heart but from panic attacks.  I can't drive anymore because I have to pull over and cry if I'm ever left alone and my dog is buckled in the back seat; he can't do his job if he can't reach me.\n\nAnd now I have to talk about it again, in person.  And honestly I don't think I have it in me.  The fear is debilitating.  I'll be going back to therapy again, probably every day until I can stop freaking out just by thinking about it.  I'm not strong at all and I am afraid that I won't be able to go through with this.  It's what I want and I know it's the right thing to do.  But if I have to see him again, just thinking of it now is fucking me up.  Even if it's in a court room, I can't do it with him there.  I won't.  So I truly hope that whoever I talk to will be able to make sure I don't have to be there.  I'm just so tired and I want this over with.  FYI, I'm not saying I want to die, just that I want to be able to move on and I've not been able to.\n\nNot sure where I was going with this, I just needed to talk to someone and not have it be in person, it's easy when there is anonymity.",
    "title": "It's been almost a decade since my life changed completely.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1572904052,
    "score": 5,
    "keyword": "black judge"
  },
  {
    "text": "My ex left me with a baby and debt. I'm so sorry. I don't know if this is the right place to ramble my thoughts but i need an outlet. \n\nI (25f) was with my now ex (25 m) for 5 years. At the beginning of the relationship everything was perfect. I had thoughts of marrying this happy, fun man. So after 6 months of dating he suggested we find a place together i jumped at the chance. He booked some viewings which i, unfortunately, could not attend due to work. He put a deposit down for a place and i was over the moon. Until i saw it, it was a 2 bedroom flat, the rent was sky high and it was filthy. It needed renovating and the landlord gave us permission to do it ourselves. However, we did not have the funds to renovate. My ex suggested we take out a loan. I, being stupid, young, and in love agreed. My ex had a bad credit score so i applied and it was agreed he would give me half of the monthly repayments. Anyways, the flat was done up to exactly how we wanted it and we made it a home. I was soo happy. Everything was going good when all of a sudden, his behaviour started to change. All of a sudden, he didn't like my friends, he hated it when i went out in case i met someone 'better' than him. I spent too much time with my family he said. So i stopped going out, my friends dwindled and i saw my family once a month. Then, he didn't like me wearing skirts, dresses, make up. I was accused 24/7 of trying to get other mens attention. So i stopped. I started walking with my head down. I would change my outfit 3 times a day until he was happy with it. One day, for work, we were told to look super smart as one of out celebrity ambassadors was coming to visit. I wore a skirt with black tights. I usually got home before my ex, so i could quickly get changed before he got in from work and he would never know. Well, i was wrong.\n\nHe was already home. As soon as he saw me, his face turned bright red. He followed me into the bedroom, and that was when i got my first punch for defying him. I stayed. I know, you're judging me. But, i had no one, he had isolated me, i thought i deserved every name call, every hit. Then, it happened, last year. I fell pregnant. Whilst i was pregnant he changed. Back to his old self. He massaged my feet, came to every appointment, cooked me dinner, helped with housework. But, when my son was 6 weeks old i was visiting my family. I received a text message that i, and my son, was not welcome back. \n\nI had to start over. I had 4 nappies, one change of baby clothes and the clothes i was in. He would not let me back for our stuff. I had to re-buy everything. I moved back in with my parents. He has stopped paying me half of the loan repayments. I struggle, every month financially. He pays no child support. I asked my ex for 30 pounds, he transferred it, then asked for it back. He has cut all contact. I have looked into applying for child support but i have to pay 20 pounds, and that is money i do not have. I rang the bank earlier today to ask for a reduction in loan payments, they will not lower the payments \"you can afford it as you get paid every month\" i didn't fight it. I just hung up and sobbed. Nobody knows my situation. My parents are not in a place where they could help, my dad is terminal with cancer. I have applied for evening part time work so i don't have to pay for childcare, fingers crossed something comes my way.\n\nIm so sorry. I needed to release this, having no one to talk to took its toll. God, i am so stupid you really dont need to tell me. I love my son so much it hurts, i will never let him see this struggle.",
    "title": "My ex left me with a baby and debt.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1573074279,
    "score": 3,
    "keyword": "black judge"
  },
  {
    "text": "Meet 'Black Girl Magic,' The 19 African-American Women Elected As Judges In Texas",
    "title": "Meet 'Black Girl Magic,' The 19 African-American Women Elected As Judges In Texas",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1556649117,
    "score": 2,
    "keyword": "black judge"
  },
  {
    "text": "Getting into top-tier tech company with multiple years of experience...? Hey guys,\n\nI live in AZ with two kids and my wife and have worked in the industry for about 5 years. I'm mostly self-taught (my degree was more focused on design and I worked as a designer for ~4 years prior), though I am starting a Master's degree in CS next year, as I enjoy learning CS topics and an official \"certification\" on my resume would be nice... Plus my employer will pay 100% of it, so why not? 🤣 Currently, I hold a position as a Senior Front End Developer and enjoy my job, however, I really want to move into a more \"skill agnostic\" position as a full stack engineer. I'm honestly tired of just being put into one bracket because most of my work experience is on the front end. I love FE work, don't get me wrong, but there's generally a stigma in the companies I've worked at where I'm not a \"real\" engineer. I want to be judged on my skill, problem solving  and ability to deliver results than on how well I know xyz framework and the only companies that seem to get this are \"FAANG\".\n\nI've always kind of felt like working at a larger tech company, like Google , Amazon, etc was above my skill and education level, but the more I work in tech, the more I feel like I have a really good chance to getting in, as I don't see things as black and white as so much of the industry in smaller companies seems to.\n\nI hear a lot of talk above recent grads getting into these companies, but what about those of us who have experience? I guess, mostly my hesitation at this point in my career is I have a family (plus, I'm almost 30) and I only ever hear about people working at these companies who just pour all their time into their work. I LOVE what I do, but I also love my family and wouldn't want to sacrifice them for better career prospects. I assume moving into an L5/E5 would be out of the question for me, since my senior experience probably doesn't equate to someone at a company like these, but that's ok.\n\nHas anyone made the move in a similar situation to me?? Would love to hear your thoughts!",
    "title": "Getting into top-tier tech company with multiple years of experience...?",
    "subreddit": "cscareerquestions",
    "timestamp": 1573951901,
    "score": 6,
    "keyword": "black judge"
  },
  {
    "text": "[Q] Career advice for a soon to be Bachelor in a developing country? Hi guys,\n\nI am an under graduate and in the following month i am going to get my Bachelor degree in CS studies, with thesis in Machine Learning. I have been working in the field of Machine Learning for 1 and a half years, but just with projects from my Faculty and along the way I took the Andrew NG course. Have tried to read Bishop's book for ML, but have trouble understanding the more complex concepts. I have knowledge of Calculus and Linear Algebra, i took the courses in my Faculty. Right now I am reading a practical book for Machine Learning, just playing with all the libraries in Python. My purpose is not to treat ML as a Black Box.\n\nJust a note here before i continue. I am living in a developing country in Europe, its a safe place to live in and there is a bright future, BUT if only the government stop stealing money from the people. There are a lot of IT companies, and Machine Learning and Data Science careers are just catching up, so getting a job in this field is not impossible just challenging due to the high demand.\n\nRecently I started an \"internship\" at a small Software Development company (max 6 workers), to do a Machine Learning feature for their software in development. The project is more of a research and i am using a public data set. I am my own mentor, and have just books and google to ask for help. The owner of the company gave me an offer to stay in the company and start an even bigger research project, on which first i said no, due to the fact i consider myself a beginner, but he put me on stand by. After a while he contacted a Data Scientist from another company  with \\~1 year work experience and a degree in Business Informatics, to do the job. Now he is suggesting me to join the \"experienced Data Scientist\" to conduct the research.\n\nMy dilemma is a bit complex. Should i have a good mentor in a company where i want to start working full time, a person to ask for guidance. To be fair i am living by the quote of Jack Ma: “Give yourself a promise: 'I will stay there **for three years**.'\". I want to invest my time in my first company to gain knowledge. I feel that under the mentor ship of this guy (haven't met him in person to judge his experience) i won't develop very well. I can either, stay in the company and start reading books about ML algorithms to understand them and work on the project. Or to apply companies where I THINK there are real data scientists with real degree related to the field of Machine Learning and Data Science?. OR MAYBE i am just blind by the fact that I really need a mentor in this path, maybe i should just depend on the books and google. Also my other concern is the company where i am right now. I don't see a constant stream of finances, the software is based on subscription model, but it's not launched yet and they still run on finances from investment funds.\n\nI know that KNOWLEDGE is not an overnight job, but don't want to mess up learning that knowledge in the first place.\n\nWhat is your take on this?",
    "title": "[Q] Career advice for a soon to be Bachelor in a developing country?",
    "subreddit": "cscareerquestions",
    "timestamp": 1567934285,
    "score": 0,
    "keyword": "black judge"
  },
  {
    "text": "Resources & Reflections for Radical Law Students (Updated) From the [smoke](https://www.reddit.com/r/LawSchool/comments/6sf56n/resources_for_radical_leftwing_law_students/?utm_source=share&utm_medium=ios_app) this post got two years ago, I have to assume the above moniker doesn’t describe most of you. To those it does apply to, though, I think it’s important to know that you are part of a proud tradition of fierce advocates who work within the essentially conservative field of law to make space for marginalized people and movements for justice. This post is for you.\n\n**Personal Reflections**\n\nI have practiced deportation defense for the last two years. Our legal community has created openings for fierce lawyering and creative litigation, even as the black-letter law has been manipulated to deny protection to those fleeing the imperialistic and environmentally ruinous policies of the Global North.\n\nIf I’ve learned anything, it’s that the courts and traditional lawyering alone won’t save us. Indeed, much of our success in the last two years, from fighting ICE raids to holding off the Muslim Ban for more than a year, was because lawyers and movements worked hand-in-hand to push the boundaries of the law, both in the courts and on the ground.\n\nThis kind of creative, base-building work is systematically devalued in even the most “liberal” legal education. Indeed, law schools seems to favor condescension and professional hazing over building strategies that win. I hope the following resources will help you survive law school so you can get back into the fight.\n\n**Resources & Readings**\n\n[10 Things You Can Do Right Now](https://docs.google.com/document/d/1KLWpt4rNiMvGlyldV-404dC41b7qMZ8x_FhUxojqCW0/edit?fbclid=IwAR3Nf5D-BmMA0QNMGZJ6retSwpVHbaaacAlsv40B2wM8rSXHgvfrJy3n3Pg)\n\nReflections by movement lawyer Purvi Shah from just after the 2016 election.\n>We are often taught law in a manner that is disconnected from history--especially the history of social movements. So our analysis of power, our understanding of strategy, and our approach to change is incomplete. Take it upon yourselves to learn from the past and to learn from an international lens. Learn about social movements in the past--and examine what lawyers did in the struggle for a free South Africa or read up about the National Union of People's Lawyers in the Philippines. Study the non-legal strategies used by social movements and figure out how lawyers can help create space for those strategies.\n\n[NLG Radical Law Student Project](https://www.nlg.org/radical-law-student-project/)\n\nThe National Lawyers Guild was the first racially integrated and gender-inclusive bar association in the United States. NLG also publishes a \"[disorientation](https://www.nlg.org/disorientation/)\" manual for progressives, radicals, and leftists entering law school.\n>It has become a truism that many are drawn to law school initially to further social justice, only to end up working in areas of the law that have little potential to serve these ideals.The most common reason cited for this is economic: the average law student emerges into practice with well over $100,000 in debt. However, this is not the only factor. In most universities, the culture and pedagogy of legal education tend to emphasize commercial law over public interest fields and the intellectual pressure of law school undermines student’s commitment to their ideals. ~Traci Yoder\n\n[A Handbook for Social Justice Advocates Thinking About Law School (pdf)](https://ccrjustice.org/sites/default/files/attach/2015/06/Handbook-for-Social-Justice-Activists_BJI.pdf)\n\nA wonderful resource compiled by students and recent law school grads practicing public interest and social justice law.\n>I couldn't comprehend how someone who wanted to practice social justice law could, three years later, feel obligated to resign to a different path—either because they had successfully been reprogrammed, or because they felt that their condition of indebtedness left them no other option but to “get a real job.” ~Nikki Demetria Thanos\n\n[For Those Considering Law School (pdf)](http://www.deanspade.net/wp-content/uploads/2010/10/For-Those-Considering-Law-School-Nov-2010.pdf)\n\nA good reality check for radicals and leftists thinking about law school. Authored by Dean Spade, founder of the Sylvia Rivera Law Project.\n>Law school is not like college. It isn’t about writing cool papers full of critical ideas. Many law schools, like academia in general, are perceived as “bastions of liberalism” in the context of our outrageously white supremacist, conservative country, but the intellectual and political environments are so mildly reformist (at best) that they will feel shockingly conservative to anyone who wants to see significant change [...] The traditional pedagogy of law school relies on humiliating students if they bring in other ways of thinking or knowing about the world, thereby whittling them down to a shadow of their former selves and reshaping them to make them think inside a very narrow box. ~Dean Spade\n\n[Letter to a Law Student Interested in Social Justice (pdf)](https://www.law.duke.edu/curriculum/pdf/interested_social_justice.pdf)\n\nA letter by Prof. William Quigley inspired by something one of his students told him: “The first thing I lost in law school was the reason that I came.”\n>There is a rich history of social justice advocacy by lawyers whose lives rise above the limited horizons of the culture of lawyers. We can take inspiration from social justice lawyers like Mohandas Gandhi, Nelson Mandela, Shirin Ebadi, Mary Robinson, Charles Hamilton Houston, Carol Weiss King, Constance Baker Motley, Thurgood Marshall, Arthur Kinoy and Clarence Darrow. ~William Quigley\n\n[“On Being a Happy, Healthy, and Ethical Member of an Unhappy, Unhealthy, and Unethical\nProfession”](https://lawyerist.com/weekend-reading-on-being-a-happy-healthy-and-ethical-member-of-an-unhappy-unhealthy-and-unethical-profession/)\n\nNot specifically radical or left-wing, but still a nice piece by U.S. District Judge Patrick Schlitz.\n>You cannot win the game. If you fall into the trap of measuring your worth by money, you will always feel inadequate.\n\n[Power With: Practice Models for Social Justice Lawyering](http://scholarship.law.upenn.edu/jlasc/vol15/iss1/3/)\n\nA constructive work by Michael Grinthal of South Brooklyn Legal Services.",
    "title": "Resources & Reflections for Radical Law Students (Updated)",
    "subreddit": "LawSchool",
    "timestamp": 1565883467,
    "score": 38,
    "keyword": "black judge"
  },
  {
    "text": "This is my mother Judge Yolanda Huff. One of the first 3 black judges ever elected in the city of San Antonio, TX.",
    "title": "This is my mother Judge Yolanda Huff. One of the first 3 black judges ever elected in the city of San Antonio, TX.",
    "subreddit": "blackladies",
    "timestamp": 1552506592,
    "score": 792,
    "keyword": "black judge"
  },
  {
    "text": "The Real MVP: Jada Pinkett Smith’s Handling Of The Jordyn Woods Interview Was Nothing Short Of Masterful **LINK:** [**Jada Pinkett and RTT is the Real MVP!**](https://www.bet.com/celebrities/news/2019/03/02/jada-pinkett-smith-red-table-talk-jordyn-woods.html)\n\nI swear Jada is the aunt/mom so many young women need. \n\n>\"The tone, comfortability and firm decision to hold their guest accountable for their actions is reminiscent of the style of daytime television veteran-turned-television mogul **Oprah Winfrey**. RTT’s ability to give Black women the opportunity to share their own stories and shape their own narratives is extremely important. In a society where Black women are often regarded as angry, Red Table Talk provides a comfortable environment for them to be vulnerable and honest about their plight, and not be judged for it, but be offered heartfelt advice instead.\"\n\nI loved this comparison of Red Table Talk being the new Oprah Show. Do you agree?",
    "title": "The Real MVP: Jada Pinkett Smith’s Handling Of The Jordyn Woods Interview Was Nothing Short Of Masterful",
    "subreddit": "blackladies",
    "timestamp": 1551713756,
    "score": 215,
    "keyword": "black judge"
  },
  {
    "text": "I'm enraged by the treatment given to Bothem Jeans' Murderer and so are MANY MANY of my FB friends who have made their opinions on the subject quite clear. \n\nWhere does my rage stem from?\n\nFrom the fact that a black man would never hug ME. That Black judge, my sister? would NEVER hug ME. MY tears would never be met with any sympathy at all, but rather written off as fake and insincere. Stroke my hair?! Offer me a tissue?! HA!!\n\nBecause of my race and gender COMBINED, the narrative for me would NEVER include leniency, empathy, or support. \n\nBecause I have to teach my daughter that the Black Woman is not allowed to make mistakes and certainly never allowed to be remorseful for them. There is no such thing as Black woman tears, or missing black woman syndrome. \n\nMy rage comes from unexpressed grief for what shouldn't be but is. \n\nWe can, and will, change our world for the better. But not without acknowledging where we are now.",
    "title": "I'm enraged by the treatment given to Bothem Jeans' Murderer",
    "subreddit": "blackladies",
    "timestamp": 1570129389,
    "score": 148,
    "keyword": "black judge"
  },
  {
    "text": "Can white people genuinely not tell wether we’re attractive or not? So today I was sitting with some (white, like really white) girls at school. For fun we were looking through tinder, as one does. And I noticed that when it came to the black guys they’d often say things like “he’s sooooo hot” at certain types of boys, even when they were legitimately ugly/unattractive. This type was usually the bleached tips/short dreads/wannabe SoundCloud rapper type. When it came to the more normal/grunge looking black guys they’d always just say things such as “basic” or “he’s okay”. It wasn’t like this at all with the white boys were they, regardless of style, just judged them off their faces and bodies. \n\nIs it a fetishization type thing? Or are white people just genuinely not able/care to tell when black people are good looking?",
    "title": "Can white people genuinely not tell wether we’re attractive or not?",
    "subreddit": "blackladies",
    "timestamp": 1556147836,
    "score": 52,
    "keyword": "black judge"
  },
  {
    "text": "What do you guys think about Judge Tammy Kemp? I'm not American , but I was horrified by Botham Jean's MURDER. The whole world is aware of the injustice and brutality of American police. We are aware that most often than not the police get off lightly. We know the historical terror America has inflicted on Black Americans. So when that homicidal lunatic was found guilty of MURDER , I was so relieved. However , the sentencing portion came up and I was flabbergasted. 10 years (probably eligible for parole in 5 years) is just not enough for blatant , non negotiable brazen murder of an innocent man eating ice cream in his house.\n\nNow I understand the power of forgiveness , and it's no ones place to judge the family forgiving that murderer. What I don't get is Judge Kemp's behaviour. Is that normal , for a judge to hug and give bibles out to the convicted? This woman has been found out as a racist, gun toting lunatic who was more concerned about losing her job than killing someone. Why on Earth did the judge do that , what message is she sending out to the world, racist would-be killers and most importantly to black people? Especially as a black woman judge, why did she feel it was her place to give mercy to this woman?!?\n\nEvery news outlet is framing this as a \"generous display of mercy' and the it's \"so beautiful'. Well, it's left a very bitter taste in my mouth and makes me feel there was no justice for Botham....",
    "title": "What do you guys think about Judge Tammy Kemp?",
    "subreddit": "blackladies",
    "timestamp": 1570101072,
    "score": 39,
    "keyword": "black judge"
  },
  {
    "text": "Growing up as a fatherless daughter and the trauma behind that. Hey guys, this is gonna be a long post of me venting about my dead-beat father. So if embrace yourselves! I am seeking for advice too and perhaps connect with other people who grew up fatherless. \n\n&#x200B;\n\nI am a love child. I am a product of man cheating on his main chick with a side chick (my mother) and nearly 23 years later, this ish is so messed up and there is still lot of drama and a lot of trauma to unpack. My dad already had two older children with the main chick (my older half sisters, they were kids and teens at the time when I was being born), so yeah y'all see where I am going through this. \n\n&#x200B;\n\nOn the night I was born, my father was nowhere to be found. He had never signed my birth certificate (til this day, my mom's name is the only person on that ish) and I guess he was too busy doing something else that night instead of making sure if his child had entered the world okay and if the mother of his child was straight and didn't have any birthing complications. I mean, my mom was in labor for like over 12 hours or some ish and they ended up having to C-section me out, all cuz I've refused to come out of the womb lol. But other than that I was a healthy 7lb (3.1kg) baby girl with no complications at all. Anyways, growing up, I didn't have a father except my maternal grandfather. That was the only man in my life who had took me in as his own 'daughter' and had raised me. I barely saw my dad around and I didn't even know I had a father until I've learned how conception worked (when I was 10 years old, kids aren't suppose to know that stuff lol). I mean, I would see my dad occasionally at the gas station when I was a little girl and he would give me $5 every time to buy me ice cream, but I did not know that man was my legit biological father. I always thought and assumed \"Oh, I just don't have a dad unlike the rest of my classmates in my 1st grade class\". Growing up and being in grades such as K-3rd grade, I just thought it was hella strange that I did not have a dad unlike the rest of my classmates and peers. All my classmates' fathers would pick them up from school, spend time with them, take them to their sport classes, and do whatever father/child bond shit that goes down. I didn't have that experience unlike everyone else and it would make me feel so sad and I've felt so neglected as a kid. \n\n&#x200B;\n\nAs the years gone by and I've gotten older, I got to meet some of my dad's family for the first time and I even met my older half sisters too (I was not aware of their existence until I was 11 years old) and as an only child, I always wanted siblings! Especially older sisters! But I've felt like they weren't too thrilled to meet me as much as I wanted to meet them. I understand our father fucked around y'all mama with mine, but it that's not my fault though. My dad was slowly trying to be in life by showing up to my high school graduation back in 2015, inviting me over to holidays gatherings at his house or coming over to my grandma's house to our gatherings and calling me more frequently (like 3-5 times a year) and even wishing me happy birthday.\n\n&#x200B;\n\nThat all changed when I've moved up to NYC in hopes to become a model. I was not ready to move up there all by myself with no money and I was depending on my dad A LOT financially. He helped me out with rent/bills sometimes and I had my oldest sister on my Facebook friendlist and she was witnessing all the drama and fuck shit that I was going through with people in NYC/the problack online community I was once apart of and my mental health going awry. She didn't want to be involved with me and told me she would have to think about having a relationship with me. Around early 2018, I've moved out to Arizona in hopes to change my life around and for the better. I was turned on by their huge job market and their affordable living cost, so I was super keen to make that move happen! Also around that same time my maternal grandfather had passed away and that put my family through so much grief, financial burdens, and hard times. Last year was really terrible for me, yo! It was a huge wake up call letting me know that nothing lasts forever. \n\n&#x200B;\n\nWhen I was facing homelessness last June while I was out in Arizona, I've called and asked my dad for some money to see if he could help me out so I could find another living arrangement. I understand him being mad n salty at me all cuz I did not called him for Father's Day, but I was really going through a lot at that time and I really needed his help! My mom and grandmother couldn't help me cuz they were still paying for my grandfather's death expenses (even though he died three months prior) and they were still trying to get by. My dad being a little privileged man he is and being a republican (yes he is blackity black, yall lmao), he could've at least helped his own kid out and shit! When I told him my mom and my grandmother couldn't help he said some shit like this \"THAT MAN IS LONG DEAD AND GONE! THAT SHOULDN'T BE NO EXCUSE ON WHY THEY CANNOT TAKE CARE OF YOU! THEY (my grandma and my mom)  NEED TO TAKE CARE OF THE LIVING!\". The moment he said that shit, I had to get off the phone with his ass and I started crying my eyes out in the streets of Scottsdale in like 1,000 degree weather (Y'ALL, ARIZONA GETS SUPER HOT IN THE SUMMER hahaha). I had to call my then boyfriend at the time to calm my ass down. Like my dad could've simply said \"Sorry, I cannot help out this time\" and I would've left it at that. I would've respected that more than him shitting on my late grandfather.  I COULDN'T BELIEVE HE HAD THE AUDACITY TO SAY SOME SHIT LIKE THAT TO ME!!!!!!!!! WTF MY GRANDDAD DID A FABULOUS JOB OF RAISING ME AND BEING A POSITIVE CIS DUDE ROLE MODEL IN MY FUCKING LIFE THAN MY FATHER COULD EVER BE! AND TO SPEAK ILL ON MY DECEASED GRANDFATHER WAS INDEED FUCKED UP!!!!!!! So my father and I haven't spoken to each other since. Throughout the remainder of 2018 and even earlier this year, whenever he would see my aunt, grandma, or mom at church he would asked them about me and my whereabouts and how I'm doing. I keep telling them not to tell this nigga what I am up to. I don't want him to know what I am doing nor how I am doing. He could find out by the randos from the town he lives in. He doesn't give a fuck. So why all y'all being so passive towards him?! If he seriously cared, he could've called me and find out his own damn self. He has my number and it hasn't changed nor has he been blocked. Fuck that bullshit! For real. There's no excuses.\n\n&#x200B;\n\nThis weekend my mom and I went down to my grandma's house. I forgot to mention my mom and I live 200 miles (320km) away from the town where my grandma and dad lives. Anyways, my dad saw my family at church yesterday and he was asking them about me and gassing them up by telling them he was gonna come see me before my mom and I head onto the road. Lmao, this nigga never came through and once my mom and I got on the road, he fucking called me first (but I've rejected his call) then he called my mama's phone. My mom picked up and they spoke and my dad wanted to talk to me. I seriously did not want to talk to him, yo. I am still angry and furious about the shit that he said about my grandpa being dead and everything. Idgaf if 11 months has passed since he said that, I am still angry! I kept signaling my mom \"NO\", but she insisted and she was driving. So I answered the phone all rudely and my dad kept asking me all these questions on like if I am working and what I was up to and all I said \"I am being a productive person, yes\". It isn't none of his business if I am working or not. Then I just brought up the shit that he said to me last year. My mom kept signaling me to not bring that up and to get over it, but I didn't care. I am hurting, I am in pain in what he said, and if he seriously wants a relationship with me then he needs to take accountability, apologize, and we can move on from there. DON'T TALK ABOUT MY GRANDDADDY LIKE THAT! This nigga wanted to act like he did not remember what he had said nor didn't have any idea on what I was talking about, then I said \"Excuse my french, but what you've said about my grandpa being dead and my mom & my grandma not being to able to help me was very fucked up\". My mom tried to tone police me right then and there by saying I should say he was being \"insensitive\", but I wasn't having it. He was silent for a second then said some things like \"THE MAN IS DEAD blah blah blah blah\" and I fucking hang up the phone on his ass right then and there and started crying. He did try to call back, but I didn't pick up. My mom was trying to tell me to get over and just let it go and be 'passive'. But honestly fuck all that! My dad and his family has caused a lot of trauma and pain among us and you trying to be in my life after these long damn near 23 years ain't gonna cut it!\n\n&#x200B;\n\nMy dad is involved in the agriculture farming scene and he only recognizes me as his daughter for clout. Seriously! On his bio for his agriculture club shit, it said he had three daughters. Lmao, he should've put two, my nigga. Cuz I feel like such a stranger to him and he does way more for my older sisters than he done for me. On top of that, his older sister scrutinized my mom for dropping out of her HBCU university back in late 80's and not going back to school to finish her degree. I mean shit happens and life gets in the way, why judge my mom for making a personal life decision that isn't your concern? Also, my dad's cousin scammed my mom out of $700 back in the 80's for an apartment or some shit and my mom still hates that man very much til this day lmao. Like fuck my dad's family, yo. They are a bunch of assholes and I feel for my mom so much, cuz she wanna front and act like she's over it. But yet she is still hurting and in pain on how these people treated her, neglected their own kin, and she got a kid by this man too! I feel like my mom will forever be in pain by these people and she gonna take this shit with her to the grave. Which is sad af. I wish we could all sit down and have like some type of 'Iyanla Vanzant' therapy session, but I do not think that will never happen (especially during this life time). We are so busy with our own little lives and I feel people don't wanna come forward and face the truth and facts.\n\n&#x200B;\n\nI feel like a lot of my BPD stuff, attachment issues, and picking wrong potential significant other partners and hanging around toxic evil people stems from the fact that my dad hasn't been around. Yes my mom, my grandparents, and my step dad all did a fantastic job on raising me, but my biological dad by simply not showing up and being there for me all cuz I've live too far away from him or he doesn't associate with my mom, is just all BS! If he serious gave a fuck about my existence, he could've at least made an effort to come by and be in my life. And I'm so conflited by his passive aggressive antics. I appreciate him trying, but if you are gonna shit on my actual family members who actually gave a fuck about me when they were alive, then why should I give a fuck about you and give you a chance? Y'all feel me?\n\n&#x200B;\n\nI have a lot of trauma that I need unpack from being sexually assaulted/violated a couples times to working in sex work, from dating shitty abusive partners/hanging around fake ass people, to even being a unambiguous black woman in this White Man's World. I am trying to better myself and get on my feet. New positive beginnings are on my way and at the end of the day, if my dad won't acknowledge his wrong doings, then so be it. I am not trying to force people in my life if they don't wanna be apart of it. \n\n&#x200B;\n\nParts of me wants to write a handwritten letter to him on how I feel about everything, but another part of me wants to just let it go and move on. What do y'all think?",
    "title": "Growing up as a fatherless daughter and the trauma behind that.",
    "subreddit": "blackladies",
    "timestamp": 1557169633,
    "score": 32,
    "keyword": "black judge"
  },
  {
    "text": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist This post was created as a response to this thread and [comment](https://www.reddit.com/r/asianamerican/comments/bvxtgs/snapshot_of_miss_india_finalists_renews_debate/epuj6hq?utm_source=share&utm_medium=web2x) discussing beauty ideals\n\nI started typing up a message then lost it. I was gonna forget about it, but it really bothered me, as I see this kind of responses ALL the time in discussions involving asian beauty ideals. and judging from the replies and votes, the thread was no exception. So im typing up this post.\n\nFor some reason, we Asians have a hard time admitting that our beauty ideals have been heavily influenced by colonialism and eurocentricism. I think it happens because we don’t like to admit how much western ideals have been ingrained into us. Even as I’m writing this, I can’t help finding larger eyes, slimmer faces, and long legs more attractive than their counterparts.\n\nOther cultures have to face the self hate stemming from Western ideals outright, because they don’t have our convenient excuse of \"pale skin was always considered beautiful in Asia!!1\" I know I've said that more than a few times before I was forced to look beauty ideals beyond skin tone.\n\nI'm going to compare a few major old vs. modern beauty ideals below. Since I’m Korean, I’ll be mentioning a lot of modern Korean ideals and referencing older Korean texts, especially from the Choson period since that was the last period before Korea was introduced to the West, but I believe they’re pretty applicable to the rest of East Asia as well.\n\n&#x200B;\n\n1. Eyes\n\nLarge, double lidded eyes is the ideal eye shape in East Asia currently. However, this was not always the case. Many people will argue that large eyes are youthful and all cultures prefer large eyes, but this is an unsubstantiated claim.\n\nThe argument becomes even more unconvincing when we look at older Asian texts. In Korea, during the Choson era (which is the latest era before Western influences entered Korea), beauty was judged according to nine factors, called \\[gu-saek (구색)\\]([https://m.blog.naver.com/PostView.nhn?blogId=noa\\_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F](https://m.blog.naver.com/PostView.nhn?blogId=noa_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F)).\n\nThe text never mentions eye size or even differentiates between double lids and monolids. The only requirement is that the \"eyes must be dark like midnight\" and that \"the eyes must be spaces appropriately.\" Other texts also mention that the contrast between the black and the white of the eyes are important, but again, never size or double-lid.\n\nSome texts even specify that (monolids with a slight slant upwards is preferred.)\\[[https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\\] This is in direct opposition to the large, double-lidded, almond eyes that are hailed as “beautiful” in Asia today.\n\n&#x200B;\n\n2. Face shape\n\nThere’s all kinds of plastic surgery in Asia focused on narrowing your face. Having a small face and head is an important part of “having good proportions.”\n\nHowever, an ideal face shape in the past was a round one, like a “full moon,” with a straight, broad forehead.\n\n&#x200B;\n\n3. Body shape\n\nCurrent beauty ideal is tall, leggy, with a short torso. People with longer torsos are considered to have worse “proportions” and there are calf reduction surgery being done to elongate our “stubby” Asian legs.\n\nHowever, in the choson period, long waists highlighting a woman’s curves was considered beautiful.\n\nFinally, we have older paintings and photos to draw upon. None of these women would be considered beautiful in Asia today. \n\n* [https://www.instiz.net/pt/4393935](https://www.instiz.net/pt/4393935)\n* [https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\n* [http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document\\_srl=13409659](http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document_srl=13409659)\n\nI'm sure there are a lot more we could discuss, but the examples above clearly show how radically East Asia has been influenced by Western ideals of beauty as much as any other cultures. It’s time for us to start confronting our self-hate of our natural, predominantly occurring asian features instead of trying to deny it.",
    "title": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist",
    "subreddit": "asianamerican",
    "timestamp": 1560845348,
    "score": 28,
    "keyword": "black judge"
  },
  {
    "text": "I call Bullshit on the False rape accusation sticky from Mens Lib sub. Actual lies are being told.  \n\n>Fact Checking False Rape Accusations and Why We Shouldn't Fear a False Rape Epidemic.  \n>  \n>📷  \n>  \n>One of the main resistance to changes in how police and society handle Rape, Sexual Assault and even Harassment is the counter argument that men then would be plagued by False Rape accusations. The fear is always that we crossed some line that no longer allows reasonable doubt and that one man life can be sent to jail by one accusation. We of course have seen stories of such things in the news and everytime we question wither these are isolated stories or a sign of a larger epidemic we don't get to see. When does the drive of combating rape go to far? Is it an issue to fear?  \n>  \n>So how common is this issue? Is it really a threat to men? How many false rape accusations are there?  \n>  \n>How Many False Rape Accusations are there?  \n>  \n>[Most experts agree that false rape accusations make the total of 2-10% of the total accusations of rape.](https://www.nsvrc.org/sites/default/files/Publications_NSVRC_Overview_False-Reporting.pdf) As quoted from the handbook  \n>  \n>A multi-site study of eight U.S. communities including 2,059 cases of sexual assault found a 7.1% of false reports (Lonsway, Archambault, & Lisak, 2009).  \n>  \n>Link to it here --> [http://www.scirp.org/(S(i43dyn45teexjx455qlt3d2q))/reference/ReferencesPapers.aspx?ReferenceID=1238871](http://www.scirp.org/(S(i43dyn45teexjx455qlt3d2q))/reference/ReferencesPapers.aspx?ReferenceID=1238871)  \n>  \n>[A study of 136 sexual assault cases in Boston from 1998-2007 found a 5.9% of false reports (Lisak et al., 2010).](https://www.ncbi.nlm.nih.gov/pubmed/21164210)  \n>  \n>[Using qualitative and quantitative analysis, researchers studied 812 reports of sexual assault from 2000-2003 and found a 2.1% of false reports (Heenan & Murray 2006).](https://www.ncjrs.gov/app/abstractdb/AbstractDBDetails.aspx?id=243182)  \n>  \n>And why not add some more papers to the mix.  \n>  \n>[2017 Study into the FBI Database found that between 2006 to 2010 the Average number of false rape accusations or baseless accusations was 5.55%, and robbery had a higher false and baseless accusation rate of 5.76%](https://www.researchgate.net/publication/315728247_The_Prevalence_of_False_Allegations_of_Rape_in_the_United_States_from_2006-2010)  \n>  \n>[Another metastudy by Claire E. Ferguson, and John M. Malouff published in December 17th, 2015 put the number of False Rape Accusations at 5%](https://link.springer.com/article/10.1007/s10508-015-0666-2)\n\n&#x200B;\n\nSo keep in mind that ALL of these numbers are minimums. These all represent the number of false rape accusations made to the police that provably false using rigorous standards. \n\n&#x200B;\n\n And while it may be small, the 2-10% is actually 2-11%. They round that 2.3% number down to 2% so it's only fair to round the 10.9% up to 11%. You can either say 2.3%-10.9% or you can say 2-11%. It's a small thing but it irks me. \n\n&#x200B;\n\nBut all of these numbers are minimums. Just like when 3-5% of cases end up with convictions. That means a minimum of 3-5% of rape cases taken to the police are true. A MINIMUM.  \n\nThis three minute youtube sums it up very well. \n\n[https://www.youtube.com/watch?v=I8zSDvaYrRw&list=LLIiza3uxnPBzZKoXthGOenQ&index=9&t=0s](https://www.youtube.com/watch?v=I8zSDvaYrRw&list=LLIiza3uxnPBzZKoXthGOenQ&index=9&t=0s) \n\n&#x200B;\n\n&#x200B;\n\n>Now I know that 2-10% is alot and enough to give anyone pause considering how epidemic sexual assault is. But consider a few things.  \n>  \n>[1 in 6 of women report they have been sexually assaulted.](https://www.rainn.org/statistics/victims-sexual-violence)\n\n&#x200B;\n\nIf you check the link it takes you to Rainn. The 1 in 6 women will be rape in their lifetime comes from where? I checked the footnote. Oh it's from...\n\n National Institute of Justice & Centers for Disease Control & Prevention, Prevalence, Incidence and Consequences of Violence Against Women Survey  \n\nThis is the precursor to the CDC NISVS survey. Guess what the CDC NISVS survey also found? It found that for years of 2010-2012 female-perpetrated \"made to penetrate\" sexual assault on men, (rape, for lack of a better word,) was at parity with male perpetrated rape for these years. Let that sink in for a minute.\n\nWhen you are done letting that sink in, ask yourself why a sub called r/menslib is not mentioning that in 2012 there were over 1.5 million instances of female-on-male rapes according to the CDC NISVS survey in 2012? (Although they don't call it that, but prefer the more awkward, \"made to penetrate\" sexual assault) '\n\nThis links to the CDC NISVS survey data so you can check for yourself. The lifetime stats are much lower than the year over year and despite my inquiries to the CDC I have not gotten an answer as for why that is. However, for each year of 2010, 2011, and 2012 we find parity between the sexes for sexual assault/rape perpetration. Look at the 12 month data.\n\n&#x200B;\n\nThis blog does a very good job of breaking this down:\n\n [https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) \n\n&#x200B;\n\n>Only a 1/3rd of sexual assaults are reported to police. So at its 2-10% of 33%  \n>  \n>This statistic covers if or not an accusation is false, wither or not a specific suspect is named which I will show below is a more interesting stat. The majority of false rape accusations are made against non existent strangers the victims claim they don't know.\n\n&#x200B;\n\nThis is a nice rabbit pulled out of the hat. Why are we assuming that all of the sexual assaults not reported to the police are true? I for one have been the collateral damage victim of a false/baseless rape accusation made on social media. Ostensibly, rape accusations that are not taken to the police and are merely posted on Twitter, Facebook, or added a circulating anonymous rapist list, or made at a bar, or something... are MORE likely to be false. Not less. Yet this author would have you believe that they are all 100% true. Magic! \n\nOf course there are many rapes that happen that are never taken to the police. For example, the 1,5 million incidents of female on male \"made to penetrate\" rape that I mentioned above. Almost none of these are reported. Less than 1 percent. These male victims of female perpetrators are hidden by systemic cultural bias.\n\n&#x200B;\n\n>Soo how many false rape allegations lead to false arrests and convictions then?  \n>  \n>How many people Falsely Accused of Rape actually go to Jail?  \n>  \n>Thankfully we found that the answer is very low.  \n>  \n>[National Registry of Exoneration who keeps track of how many innocent people have been... well... exonerated found that since 1989 in the US ~~52~~ people have been exonerated for sexual assault that they didn't do. People exonerated on false accusations of Murder was 790 people.](http://www.law.umich.edu/special/exoneration/Pages/browse.aspx)  \n>  \n>  \n>  \n>  \n>  \n>Note: Innocent Project has listed 276 exonerated with Sex Crimes, this is the highest number I can find. Thanks [/u/MealReadytoEat\\_](https://www.reddit.com/u/MealReadytoEat_/)  \n>  \n>[British Home Office did a detailed study and report on the issues of false rape accusations in 2005 and found that out of the 216 cases of rape that was false in the UK, 126 of them have a formal complain filed by the accuser, **39 of them had a named suspect** and only 6 of them were arrested. Out of the 6 arrested only 2 have charges and **0 of them had a conviction.**](http://webarchive.nationalarchives.gov.uk/20100408125722/http://www.homeoffice.gov.uk/rds/pdfs05/hors293.pdf)  \n>  \n>[Another Study by the University of Pittsburgh found that only 18% of False Rape Accusastions name a suspect](https://search.proquest.com/docview/1900298026?pq-origsite=gscholar)\n\n&#x200B;\n\nNevermind the fact in 1996 the FBI backtested over 25,000 rapekits and found that 1 in 4 excluded the primary suspect, in almost all cases, as fingered by the primary witness/alleged victim.\n\n  [https://www.ncjrs.gov/txtfiles/dnaevid.txt](https://www.ncjrs.gov/txtfiles/dnaevid.txt) \n\n*Conducted in June 1995, the nationwide telephone survey of 40 public and private laboratories that performed DNA tests sought answers to such questions as: From the time the laboratories began DNA testing, how many cases have they handled? Of that number, what percentage yielded results that excluded defendants as sources of the DNA evidence or were inconclusive?*\n\n  *The 40 surveyed laboratories yielded 19 whose available data were sufficient for the purposes of this study. The 19 included 13 at the State/local level, 4 in the private sector, an armed forces laboratory, and the FBI's laboratory.*  \n\n*Most of the laboratories had initiated DNA testing only within the previous few years. Twelve began testing between 1990 and 1992. Three of the four private laboratories began in 1986 or 1987, while the FBI started DNA testing in 1988.*  \n\n*Seven of the laboratories reported using RFLP testing; four, PCR testing; and eight, both types of tests.  The 19 laboratories reported that, since they began testing, they had received evidence in 21,621 cases for DNA analysis, with the FBI accounting for 10,060 cases. Three of the 4 private laboratories averaged 2,400 each; the State and local laboratories averaged 331 each.* \n\n ***In about 23 percent of the 21,621 cases, DNA test results excluded suspects, according to respondents****. An additional 16 percent of the cases, approximately, yielded inconclusive results, often because the test samples had deteriorated or were too small. Inconclusive results aside, test results in the balance of the cases did not exclude the suspect.*  \n\n***The FBI reported that, in the 10,060 cases it received, DNA testing results were about 20 percent inconclusive and 20 percent exclusion; the other 18 laboratories (11,561 cases) reported about 13 percent and 26 percent, respectively.\\**** \n\n *Unfortunately, the laboratories were unable to provide more details. They did not maintain data bases that would permit categorization of DNA test results by type of offense and other criteria. What happened to the suspects who were excluded through DNA testing also cannot be determined. Were they released, or were they charged on the basis of other evidence, for example?  Thus, only the most general information is known about the results of DNA testing by laboratories. To  obtain more detailed information would require a comprehensive research project.*   \n \n\nThat's hard forensic data that puts the ballpark figure of false rape accusation at about 1 in 4. Now to be fair, some of these may have been genuine mistaken identity. But if you are the man under arrest by the police accused of rape, you would call that a false rape accusation.\n\n&#x200B;\n\n&#x200B;\n\n>Fact is that the majority of false rape accusations don't even name a suspect. And throwing this into the picture of the total of the numbers of rape really proves how rare false rape **Convictions** are. Vast majority of false rape accusers always accuse a non existent stranger who raped them and usually not someone specifically. Which means that beyond wasting time and resources majority of false rape accusations are harmless to the general public because no one person is accused.  \n>  \n>When you take these studies and add them to what we already know about rape a more complete picture forms:  \n>  \n>1/6 women claim to have experience sexual assault, follow by a 1/3 reporting the assault to police, then **worst case scenario** 1/10 are false. Out of those false rape accusations 9/50 name a suspect, out of false rape accusations that accuse someone 15/100 get an arrest and, out of those who are arrested for a rape they didn't do only 1/3 have charges placed against them.\n\n&#x200B;\n\n**This is so wrong as to be a lie. Remember, according to Dr. Lisak's metastudy, a minimum of 2-11 percent of all rape accusations taken to the police are PROVEN to be false.** \n\n&#x200B;\n\n>So 1/6 x 1/3 x 1/10 x 9/50 x 15/100 x 1/3 = 0.00005  \n>  \n>Which mean out of all the women you meet you have a **0.005% chance of being falsely charged of Rape.**\n\n**A blood vessel in my frontal lobe just exploded. I can't even begin to understand what the heck he is doing with the numbers here. Can anyone help me out with this. Like I have a headache just from trying.** \n\n&#x200B;\n\n>Compare this to the fact that [6.4% of men openly admitted of committing the strictest possible definition of rape](https://davidlisak.com/wp-content/uploads/pdf/RepeatRapeinUndetectedRapists.pdf) and 23% of that 6.4% admitted of multiple rapes.\n\n&#x200B;\n\nThis link is dead. But let's look at a couple other studies that look at the number of people openly admitting to committing rape. \n\n Hogben, Byrne & Hamburger (1996) Lifetime prevalence of 24% for women having made a man engage in sexual activity against his will \n\n[https://www.tandfonline.com/doi/abs/10.1300/J056v08n01\\_05](https://www.tandfonline.com/doi/abs/10.1300/J056v08n01_05)\n\nSexually Aggressive Women  **Anderson, Struckman-Johnson 1999** – 43% of college women admitted to using verbal or physical pressure to obtain sex  (No ebook available. I've ordered a print copy in the mail but it won't arrive for another week.)\n\n [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6245084/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6245084/) \n\nI'm just saying, there is one half of the equation being left out here. It is likely the smaller half. But why are we still pretending in 2019 like it doesn't happen? It happens all the time. Go check out r/teacherswhorape for a daily update of female pedophiles.\n\n&#x200B;\n\n&#x200B;\n\n>Why False Rape Accusations happen?  \n>  \n>Many people who fear False Rape Accusations claim that women in the work force will make a False Accusation against a man in a higher position, or a student who is going to fail an exam will accuse a professor, or rape or that a vengeful ex, or a woman who regretted sex later.  \n>  \n>But the realities of this is very surprising.  \n>  \n>[According to a review done by the LAPD found the reasons for a False Rape accusations is unwanted pregnancies or more commonly \"Missed Curfews\" by young teenagers. It turns out that 55% of False Rape Accusations according to this review are for hope of getting medical care or psychiatric medication by the very poor and destitute](https://www.ncjrs.gov/pdffiles1/nij/grants/237582.pdf)  \n>  \n>[Also it is noted that half of the False Rape Accusations are made by Parents of children.](http://www.d.umn.edu/cla/faculty/jhamlin/3925/4925HomeComputer/Rape%20myths/Police.pdf) Either by pressuring the child to go to the police or accusing someone of rape without the child knowing. It is also important to note that the rare Serial False Rape Accusers tend to have a history of being a legitimate victim Sexual Abuse as a child.  \n>  \n>As this shows that the False Accuser the majority of the time aren't the serial accusers we hear on the media nor are in tech jobs, nor college students who regret sex. Instead it is usually either the very poor looking for free medication, teenagers trying to get out of trouble and parents of children who make the vast majority of False Rape Accusations.  \n>  \n>Also there are no corolations with the age of the accusation or the number of sexual partners of the accuser and wither their accusations are true or not. Add this to the fact that [most legitimate victims lie to themselves and others saying that they weren't sexually assaulted when they really were. This denial often is due to the fact that the majority of victims know their abusers personally before the assault and often change their stories or denied that they were as a way to cope the trauma.](http://journals.sagepub.com/doi/pdf/10.1177/0886260517726412?casa_token=TR0lDTFQ-9cAAAAA%3AXFQbcARRx9QC1UnefnGp3FIc0pMTR4K5X-49EvzFMnXxeQxUba98DKlj4DcWjJOvFeihHXQTGwd5Vw&) I can personally attest to that.  \n>  \n>Special thanks to [/u/ILikeNeurons](https://www.reddit.com/u/ILikeNeurons/)\n\n&#x200B;\n\nWhy does he leave out De Zutter(2017)? [https://www.researchgate.net/publication/313830325\\_Motives\\_for\\_Filing\\_a\\_False\\_Allegation\\_of\\_Rape](https://www.researchgate.net/publication/313830325_Motives_for_Filing_a_False_Allegation_of_Rape) \n\nReasons for a false rape accusation:\n\n* Material gain: to receive money, [professional promotion](https://en.wikipedia.org/wiki/Promotion_(rank)) or other material benefits.\n* Producing an [alibi](https://en.wikipedia.org/wiki/Alibi): a false allegation is used to cover up other behaviour, such as being late or absent to an appointment.\n* Revenge: to retaliate against a disliked person by damaging the reputation, freedom or finances.\n* Attention: an attempt to receive any kind of attention, positive or negative, by anyone.\n* Sympathy: a special kind of attention-seeking whereby the complainant tries to improve a personal relationship with a specific individual.\n* 'A disturbed mental state'; this may include false memories (\"sexual hallucinations\") or pathologic lying.\n* Relabeling: consensual sex is relabeled 'rape' to the police, because of its 'disappointing or shameful character'. De Zutter et al. argue that a distinction should be made between some acts during a consensual sexual encounter that a participant did not want or had no desire to engage in but nonetheless gave consent to (e.g. to please their partner) on the one hand, and rape (nonconsensual sex) on the other, but that many lay people and even some scholars do not make this distinction and confuse the two. It is often when accounts of such 'unwanted consensual sex' are told to friends and family that the latter interpret it as rape, and put the complainant under pressure to file an allegation.\n* Regret: after having had consensual sex, a complainant experiences negative feelings such as disgust, shame, and sorrow; when others notice this and ask about the source of these negative feelings, they are prone to view the encounter as rape and put the complainant under pressure to file an allegation.\n\n### 'Don't know'\n\nAccording to De Zutter et al. (2017), 20% of complainants said that they did not know why they had filed a false allegation.[\\[8\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-Zutter2017-8)\n\n&#x200B;\n\n While we are at it, wikipedia also lists false memories as a reason for a false rape accusation. \n\n### False memories[[edit](https://en.wikipedia.org/w/index.php?title=False_accusation_of_rape&action=edit&section=2)]\n\nThere are several ways in which an alleged victim can accidentally come to believe that they have been raped by the person(s) they accuse. These include, but are not limited to:[\\[7\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-French-7)\n\n* [Recovered memory therapy](https://en.wikipedia.org/wiki/Recovered_memory_therapy): memories of sexual abuse 'recovered' during therapy in the absence of any supporting evidence, based on the [Freudian](https://en.wikipedia.org/wiki/Sigmund_Freud) notion of \"[repression](https://en.wikipedia.org/wiki/Repression_(psychology))\"[\\[7\\]](https://en.wikipedia.org/wiki/False_accusation_of_rape#cite_note-French-7)\n* The victim's confusion of the memory of the real rapist with the memory of someone else\n* [Memory conformity](https://en.wikipedia.org/wiki/Memory_conformity): memory can become contaminated when co-witnesses discuss their recall of events\n\n&#x200B;\n\nLet's not forget that in the UK, \"alleged\" rape victims are paid in cash regardless of whether the accused is found guilty or not.  \n\nJemma Beale collected 11,000 pounds before being caught. That's a hell of a side gig.  falsely accused nine men of raping her on separate occasions, while a further six had supposedly sexually assaulted her.  \n\n[https://thewarrzone.blogspot.com/2019/03/the-hard-lessons-of-jemma-beale.html](https://thewarrzone.blogspot.com/2019/03/the-hard-lessons-of-jemma-beale.html) \n\nShe is unique in that she is one of the rare false rape accusers to be prosecuted. \n\n&#x200B;\n\n&#x200B;\n\n>Why didn't you include those other \"Studies\"?  \n>  \n>Since I am from the future I know this will be bring up sooo I will nip it in the butt before it shows up in the comments. And if they still show up without talking about this section of my effort post you have my permission to shame them.\n\nSmall thing, but the saying is \"nip in the bud.\" Like a plant. Shame is how feminism works, right? They shame people into submission. Like #metoo. If you stand up to a false rape accusation they shame you as a RAPE APOLOGIST. \n\n&#x200B;\n\n>People who fear the False Accusation \"Epidemic\" that is supposedly happening like to point to the \"other studies\" on these issues. What are these other \"studies\" and why don't I use them in my analysts? Well because they are bad. Flat out bad or rely on a misconception of the nature of sexual assault. And there are alot of them. Lets take sample out of the list Wikipedia provided.\n\n&#x200B;\n\n>[Also these studies expose a much larger issue when it comes to research into sexual assault.... What is Sexual Assault and what is False Sexual Assault. When you look at studies the older ones tend to have uhhhhhh questionable views of what is and isn't sexual assault.](https://www.cambridge.org/core/services/aop-cambridge-core/content/view/CA29549D811B7C639DFF2754197BBF9C/S0008197306007069a.pdf/false_allegations_of_rape.pdf)\n\nI would say the same argument could be flipped on the new definitions of rape coming our of Academic feminism. \n\n&#x200B;\n\n>Then if you look at other higher studies like Kanin and Jordan you figure out that they are working on the police definitions of False or Not. Unfortunately that means that they consider a story false if the victim:  \n>  \n>Failed a Polygraph [Click here if you wanna know why the Polygraph is \\^\\^\\^bullshit](https://www.vox.com/2015/10/18/9560391/polygraphs-wrong-police)  \n>  \n>If the victim delayed reporting their rape  \n>  \n>If the victim was [\"Intellectually Impaired\"](https://www.npr.org/2018/01/08/570224090/the-sexual-assault-epidemic-no-one-talks-about)  \n>  \n>If the victim has signs of mental illness  \n>  \n>If the victim was intoxicated  \n>  \n>If the victim withdraw the complaint  \n>  \n>And if the victim was determined by police to be a \"Slut\"\n\n&#x200B;\n\n&#x200B;\n\nThere are criticism to make of Kanin. Small sample size, sure. Undisclosed location, also iffy. But according to Kanin, the police only classified an accusation as false if the alleged victim confessed to it being false AND they were able to corroborate the new story with the defendant and other witnesses. It did involve a serious, but not mandatory, offer of a polygraph test. But the offer of the polygraph test was merely a catalyst. An accusation was on classified as false if the alleged victim herself recanted. In 41% of the cases, the alleged victim did so. \n\nThere are legitimate concerns about this study I listed above. But the author has told another lie. No accusation was regarded as false at any time because of a failed polygraph or for any of the above listed reasons. I'll have to read the Jordan study because the author definitely lied about Kanin so I can assume he probably lied about Jordan as well. In fact, I completely distrust this guy.\n\n [https://link.springer.com/article/10.1007/BF01541619](https://link.springer.com/article/10.1007/BF01541619) \n\n&#x200B;\n\n>While false complaints do occur, approximately **three-quarters of the incidents concluded by the police to be false appeared to have been judged to some extent at least on the basis of stereotypes regarding the complainant’s behavior, attitude, demeanor or possible motive.** Suspicious file comments were made by the detectives regarding a woman who laughed while being interviewed, others who were seen as ‘attention seeking,’ and some who were said to be ‘crying rape’ for revenge or guilt motives.\n\n**Attention seeking, Revenge, and guilt** are all common and legitimate motivation for a false rape accusation according to self confessed accounts accumulated by De Zutter 2017. See above. \n\n&#x200B;\n\n>That's right. 75% of False Rape Accusations labeled as such by police were not because they were proven false but on the gut feelings of the police. Which means we get plenty of **false false rape accusations**. This is probably a bigger issue then men being falsely accused of Rape. [There have been plenty of documented cases of police pressuring victims to sign false confessions claiming they made up their sexual assaults.](https://www.propublica.org/article/false-rape-accusations-an-unbelievable-story) Its why one of the major reasons why [out of 1000 rapes only 6 rapists will go to jail while for robberies 20 will go to jail and 33 of assault and battery](https://www.rainn.org/statistics/criminal-justice-system).  \n>  \n>Using Fear as a WeaponWhy do we talk about False Rape Allegations all the time, and how its used as a political weapon.\n\nThe police deal with the shittiest people of society all day every day. You are allowed to be skeptical of the police. You are not allowed to completely write them off. I call bullshit. It might not be as high as 75% but it's high. In the UK false rape accusations are so common that police now demand that \"alleged\" victims hand over their phones when making an accusation that can check to see if they texted the accused the following morning something like, \"Thank you for the great sex last night.\" \n\n&#x200B;\n\n>Though most rational people don't see this as such a major issues within far conservatism and the Manosphere you tend to see false accusations be pushed as the major issue against men. In fact I decided to do my own study where I went to [r/MenRights](https://www.reddit.com/r/MenRights/) typed it \"Rape\" and look at the 102 top posts by [r/menrights](https://www.reddit.com/r/menrights/) on the subject. I only accepted posts of two categories, male victims of sexual assault and stories on false rape accusations. As expected [r/MenRights](https://www.reddit.com/r/MenRights/) had more posts about false rape then male victims of rape.\n\nStop kidding yourself. False rape accusations are a HUGE concern for men. Innocence is no defense against a rape accusation. Your life, your reputation, your friends, you family, your career, your honor, your legacy are all permanently and irrevocably damaged by a false rape accusation. It's shameful. \n\n&#x200B;\n\n>As you can see despite the fact that men are [1 in 33 in odds of being raped, that 1 in 10 rape victims are male](https://www.rainn.org/statistics/victims-sexual-violence), and as stated before only 0.005% of rape accusations lead to a man being arrested as stated above. MRAs post more about and care more about false rape accusations then male victims of sexual assault. Why is that? Why do we even talk about false rape so much if its more rare than males being raped? I get a suspicion that plenty who champion this cause are arguing disingenuously.\n\nInteresting that he mentions a man being arrested but how come so few women are arrest for rape even though there are multiple studies going back to the 1980s indicating it's massively underreported. \n\n&#x200B;\n\nFalse Rape accusations are not RARE. They are AT LEAST 2-11 percent of all rape accusations taken to the police. I'd bet that number is much higher since the #metoo movement when every single sociopathic liar KNOWS that they will be #believed. Oftentimes in spite of evidence. \n\n&#x200B;\n\nFalse Accusations are rampant enough that only segregation can solve it\n\n>Yeaaaa... This covers harassment as well. Plenty of people have been using the fear of false rape accusations against men as proof that women should be \"isolated\". [They also openly brag to each other that they \"won't hire more qualified women because I am too scared of a lawsuit\"](https://youtu.be/dHiAls8loz4?t=87). As stated before the case of someone falsely accusing someone else in the workplace environment is ultra rare as most false rapes come from children or the homeless, and the vast majority don't name suspects. If anything men should be worried about sexual harassment from coworkers as it is way [more statistically likely that men will be a victim of sexual harassment](https://www.washingtonpost.com/local/social-issues/men-account-for-nearly-1-in-5-complaints-of-workplace-sexual-harassment-with-the-eeoc/2018/04/08/4f7a2572-3372-11e8-94fa-32d48460b955_story.html?noredirect=on&utm_term=.06fb338bce7a) then falsely accuse of harassment themselves.\n\nChoose one.\n\nAdopt a #Believewomen policy and eliminated due process for men in the workplace. \n\nOr demand that women be hired at equal rates as men. \n\n&#x200B;\n\n>False Rape Accusers should get same length sentence as Rapists  \n>  \n>This is a common cry for those within the MRA movement is that these false accusers are getting off to easy. That they ruin countless men lives and only get slap of the wrists. But that shows a great error in their thinking is the trust that the criminal justice system gives just punishments to rapists in the first place. If we are going to punish false accusers the same way that we do punish rapists then false accusers should get:  \n>  \n>[10 Years of probation](https://www.cbsnews.com/news/former-houston-doctor-convicted-of-sexually-assaulting-patient-gets-probation-2018-08-19/)  \n>  \n>[3 Months of Jail](https://en.wikipedia.org/wiki/People_v._Turner#Sentencing)  \n>  \n>[5 Years of probation](http://www.kdrv.com/content/news/Medford-Man-Sentenced-to-Probation-for-Rape-of-Middle-School-Girls-492038491.html)\n\n&#x200B;\n\nInstead of listing three anecdotes, how about some actual data?\n\n \"**Prison sentences** for **rape** are not uniform. A study made by the U.S. Department of Justice of **prison** releases in 1992, involving about 80 percent of the **prison** population, found that the **average sentence** for **convicted** rapists was 9.8 years, while the actual time served was 5.4 years. \"\n\nBut just for fun, let's look at three false rape accusations that resulted in jail time:\n\n Colo. man imprisoned for 28 years after woman dreamed he raped her expected to be freed after convicted rapist admits to crime, \n\n [https://www.nydailynews.com/news/crime/new-trial-man-jailed-28-years-dream-rape-claim-article-1.2469667](https://www.nydailynews.com/news/crime/new-trial-man-jailed-28-years-dream-rape-claim-article-1.2469667) \n\n Accused Of Florida Rape 70 Years Ago, 4 Black Men Get Posthumous Pardons\n\n [https://www.npr.org/2019/01/11/684540515/accused-of-florida-rape-70-years-ago-4-black-men-get-posthumous-pardons](https://www.npr.org/2019/01/11/684540515/accused-of-florida-rape-70-years-ago-4-black-men-get-posthumous-pardons) \n\nLest we forget Emmett Till\n\n [https://en.wikipedia.org/wiki/Emmett\\_Till](https://en.wikipedia.org/wiki/Emmett_Till) \n\n&#x200B;\n\n&#x200B;\n\n>That of course doesn't count the countless who have sexually assaulted and get away with it. If MRAs called for this guideline I can't help to feel they would be even more disappointed in the sentencing expecting 20 years but IRL only getting a few months. If we treated false rape accusers the same as rapists then we as a society wouldn't take them that seriously.\n\nFor both men and for women. Countless women who have sexually assaulted and gotten away with it. \n\n&#x200B;\n\n>Also I want to quickly address the other MRAs call for those who have been falsely accused to be placed on the Sex Offender Registry Lists. Uuuuuuuhhh What?!? This is improper use of such a list number 1, and 2 that publicly available list would then create a public list of people you can rape without repercussions. Think about it. If you publicly branded people as \"False Rape Accuser\" then which people would rapists target?\n\n&#x200B;\n\nI'm actually opposed to the Sex Offender Registry Lists as they currently stand in our country. Female Pedophiles are very often offered a plea deal to stay off the registry.\n\n&#x200B;\n\n&#x200B;\n\n>Putting extra laws and punishments on this mush smaller issue of False Rape Accusations put more pressure on legitimate victims of sexual assault. Under the existing law there are cases of legit victims being classified by police as false victims. If you add additional punishment then we will punish legitimate victims of rape 20 years in prison for just reporting their rape and police not believing in them. And that will have a chilling effect on the rest of victims of sexual assault out there. Its hard enough as is, but if you are unable to prove it and you \"act like a slut\" then you could face jail time\n\nThis is just as true for rape victims. The UK is seeing an influx of innocent men convicted of rape because of horrible #believewomen policies. It is an actual nightmare. \n\nI think false rape accusations need to be rigorously prosecuted when there is substantial evidence of malicious intent. Just because the defendant is not convicted doesn't mean it was a false rape accusation. But in many cases, there is evidence of clear malicious intent, yet the false accuser is not punished, \"lest we discourage others from coming forward.\" (Other false accusers?)\n\n [https://metro.co.uk/2017/09/27/man-cleared-of-rape-after-victim-said-ill-ring-police-tomorrow-its-going-to-be-fun-6958964/amp/?ito=article.amp.share.top.twitter&\\_\\_twitter\\_impression=true](https://metro.co.uk/2017/09/27/man-cleared-of-rape-after-victim-said-ill-ring-police-tomorrow-its-going-to-be-fun-6958964/amp/?ito=article.amp.share.top.twitter&__twitter_impression=true) \n\n&#x200B;\n\nAlso check out r/falserapeaccusations\n\n&#x200B;\n\n&#x200B;\n\n>Conclusion\n\n&#x200B;\n\n>That's why [r/MenRights](https://www.reddit.com/r/MenRights/) and Reddit as a whole under reports on male victims of rape. Because admitting that rape of men is a common thing only helps prove that rape in general is a very common affair and that the 1 in 6 statistic was right the whole time. That Rape is a real problem in western society and forces them to stop ignoring it.\n\n&#x200B;\n\nMultiple written lies have been told by the author of this post. When it was first posted, a great many redditors pointed out how poorly his math was put together. Instead of changing or editing his post, he merely deleted the comments. That is called suppression of the truth and it makes you a bad person.  \n\n&#x200B;\n\nNo one is denying that rape is a serious issue. The good news is that according to the BOJ, rape, along with other violent crimes has been dropping steadily since the 1960s. In 2012 the number pivoted because for the first time in USA history, the FBI legally acknowledged that men can be raped. Unfortunately it has been worded such that female on male \"made to penetrate\" sexual assault is still not rape. Women can only rape men if they anally penetrate them. We still have a long way to go for true gender equality. \n\n&#x200B;\n\nSo remember this TL;DR when you think about False Rape Accusations.\n\n>TL;DR  \n>  \n>For both genders you are way more likely to be raped then falsely accused of rape.\n\nNobody actually knows how likely you are to be falsely accused of rape. At a minimum, 2-11 percent of rape accusations made to the police are false. Probably the number is closer to 1 in 4 due to hard forensic evidence of backtested rapekits that excluded the primary suspect, (as fingered by the alleged victim,) 23% of the time. But we don't really know. It's probably safe to say that you are more at risk of being false accused of rape in 2019 than at any other time in human history because of the public demonstrations of #believewomen. Many still believe Ford's accusations against Kavanugh despite being thoroughly discredited by Leland Keyser. [https://www.washingtonexaminer.com/news/just-didnt-make-any-sense-leland-keyser-now-challenges-story-of-kavanaugh-accuser-christine-blasey-ford](https://www.washingtonexaminer.com/news/just-didnt-make-any-sense-leland-keyser-now-challenges-story-of-kavanaugh-accuser-christine-blasey-ford) \n\n\" **I don’t have any confidence in the story,” Keyser told** ***New York Times*** **reporters Robin Pogrebin and Kate Kelly**  \n\n **\"Those facts together I don't recollect, and it just didn't make any sense,\" Keyser told the authors.** \n\n **\"It would be impossible for me to be the only girl at a get-together with three guys, have her leave, and then not figure out how she's getting home,\" Keyser told Pogrebin and Kelly. \"I just really didn't have confidence in the story.\"** \n\n **A few days** [**before the hearing**](https://www.cnn.com/2018/09/22/politics/kavanaugh-ford-accuser-nomination/index.html)**, Keyser’s attorney said, “Simply put, Ms. Keyser does not know Mr. Kavanaugh and she has no recollection of ever being at a party or gathering where he was present, with, or without, Dr. Ford.”**\n\n**\"Keyser later said she felt pressure by both \\[Ford classmate Lucy\\] Gonella and Ford's friend Monica McLean to change her story,\" Pogrebin and Kelly wrote.**\n\n**\"I was told behind the scenes that certain things could spread about me if I didn't comply,\" Keyser told the authors.**\n\n&#x200B;\n\n\\#metoo has already been politically weaponized. This is ridiculous. WE are being gaslighted. This is bullshit.\n\n&#x200B;\n\n>The estimated number of false rape accusations are around 2-10% at the highest.\n\nThis is a lie on several levels. It's 2-11%. And that is a minimum. And that's if you only consider surveys conducted by feminists or women's advocates.\n\n&#x200B;\n\n>For 216 False Rape Accusations only 39 named suspects, and only 2 got charged. That means that only 18% of False Rape Accusations actually accuse someone and that only 0.9% of false rape accusations ended up on court.\n\nI'm pretty sure this stat is referring to how many false rape accusers got charged. So now you are just making up numbers. You are either lying or grossly mistaken. \n\n&#x200B;\n\n>Vast majority of false rape accusations are made by Teenagers, Parents of Children, and the Homeless.\n\nThere's no way to know this. And there is also no citation. \n\n&#x200B;\n\n>55% of False Rape Accusations are in hopes of getting free medical treatment. Next major category is from teenagers justifying their absences to parents.\n\nDid I miss the source for this. Why are you ignoring De Zutter (2017)?\n\n&#x200B;\n\ntl;dr #metoo is a puritanical, sexist witchhunt that strips men of due process while refusing to hold women to the same standards, as per Asia Argento, Katy Perry, and Amber Heard. It's is a moral panic. Much like McCarthyism we will look back on #metoo with a deep sense of shame for vigilante mob justice conducted in the name of false rape accsusations.",
    "title": "I call Bullshit on the False rape accusation sticky from Mens Lib sub. Actual lies are being told.",
    "subreddit": "MensRights",
    "timestamp": 1575621828,
    "score": 674,
    "keyword": "black judge"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 507,
    "keyword": "black judge"
  },
  {
    "text": "Woman rapes & nearly kills 5 year old - 1 year prison sentence An Australian 'woman of color' (Indigenous, just thought I'd get extra points for virtue signalling - oh oops, she did something bad, so I'd better say 'human adult' and accuse you of racism if you ask me her ethnic background) received a minimum 1 year prison sentence for raping and beating a 5 year old to the point that medical staff early in the child's admission to hospital thought that she may die.\n\nI'm prepared to believe this woman came from the wrong side of the tracks and had plenty of bad luck in her life - however, she's lucky as hell she has a vagina, as if she were a man committing the same offence she'd be doing 15 to life.\n\nIt also kind of helped her that she had super rich members of the prominent Myer family funding her - their do-goody works with Indigenous women seems to include taking the child raping and beating ones under their wings, paying for multiple Queens Counsel defence barristers for them, and providing them with character references. Gotta love philanthropy and helping 'people of color'.\n\nNow given the horrific nature of this particular crime to a very young girl, feminists will be outraged and pushing for strong deterrence by the courts to protect young girls, right? Of course, of course I am joking, you know that's not how they roll. The usual modus operandi of the feminist hatemongers in this situation is to blame a man. 'You killed your husband - oh, you're a battered woman, the man made you do it, you hero, you can walk free!' Unfortunately for them, and typical in dysfunctional families with kids, there was no man on the scene to blame. Just this evil black child raping  bitch who, it seems, had been given custody of this poor little child. That competent male relatives - eg. like, guess what, crazy idea here, THE FATHER - have little chance of custody of kids in these difficult families is another matter - after all, better a bad woman than a good man.\n\nThe poor father didn't even get quoted in the article. The child's grandmother, a woman and therefore worthy of being given platform, expressed her anger at the leniency of the sentence.\n\nMysteriously the article has disappeared from online, this used to be its link but it is broken:  [https://www.theage.com.au/national/victoria/stepmother-may-serve-just-one-year-in-jail-for-horrific-sexual-assault-20191125-p53dyt.html](https://www.theage.com.au/national/victoria/stepmother-may-serve-just-one-year-in-jail-for-horrific-sexual-assault-20191125-p53dyt.html)\n\nIt was in The Age newspaper in Melbourne in print on the 27th or 28th of November 2019. It's possible there are interested parties trying to bury the news. One thought that occurred to me is that the Myer family members, whose support for the child rapist was certainly not glossed over by the reporter of the story, had the story killed. They could do this by threatening defamation - although given the article said they'd funded the rapist woman's defence, and provided character references to the child rapist woman, which to my knowledge is true, I can't imagine what the libel is - or they could have used their connections to people in power to kill the story. Or maybe there's a completely innocent explanation, the story hasn't been killed, and the fact that suddenly the whole world cannot find out what has gone on in this case is due to a coincidental technical or other reason. The article mentioned the Director of Public Prosecutions may appeal the sentence, but given the matter would then go to an appellate judge not jury I can't see why there would be a reporting suppression order in light of this - possible I guess.\n\nMen and women, just imagine a man had nearly beaten to death then raped a 5 year old, and was given a 1 year non parole period. There would be absolute pandemonium and outrage, the streets would be full of angry people. But this black child rapist bitch does it, and where are the feminists protecting this little girl? No where. And I believe I know why. They are not humanists, and they're not really about helping people. They might claim helping women is their goal, but when I look at it, with a skeptical eye, it's apparent to me that harming and demonising men is actually the real raison-de-etre of feminism, and constructive goals like helping women and girls will always give way to the primary destructive goal of harming men in any and all ways possible. If a woman goes essentially unpunished for raping a tiny child in pursuit of this 'higher good', then that is water off a duck's back. THEY DON'T CARE.\n\nFeminists are even quite explicit about this. They say any woman in prison is 1 too many, regardless of the crime. They are cool with a woman serving LESS PRISON TIME THAN A MAN FOR THE SAME CRIME.  So the bitch in this article [https://www.sbs.com.au/news/the-feed/opinion-8-of-prisoners-are-women-that-s-about-8-too-many](https://www.sbs.com.au/news/the-feed/opinion-8-of-prisoners-are-women-that-s-about-8-too-many) says she doesn't support \"equal\" sentencing, ie. same time for same crime, but \"equitable\" sentencing, whatever that's supposed to mean. Well, to be fair she says what it means, it means not putting women in prison when you would a man as they're custodial parents of kids (huh, wasn't it feminism that set them up as custodial parents and men as non custodial parents in the first place), and because they've had a tough life. She drones on about women in prison having had a history of abuse themselves. Excuse me while I get my vomit bag. I mean, as if male prisoners have had carefree lives full of kindness, PC pals asking them for confident and unequivocal yesses, and ne'er a harsh word spoken to them.\n\nSo I ask feminists - like that red-haired nutcase Hawathy or whatever her stupid name is - I was going to write the angry one, but that hardly helps defining the individual from the pack - the one who wants, at least in fantasy, to 'cull men' - when will women - when, feminism, will women stop beating unconscious and raping little tiny children? (I won't repeat her 'culling' comment with proper reversal of genders, unlike her, as a woman, as a man I'd probably be arrested for it).",
    "title": "Woman rapes & nearly kills 5 year old - 1 year prison sentence",
    "subreddit": "MensRights",
    "timestamp": 1575096811,
    "score": 452,
    "keyword": "black judge"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 123,
    "keyword": "black judge"
  },
  {
    "text": "Musings: Why the Fall of Classical Chivalry Mirrors the Modern Feminist \"Toxic Masculinity\" Situation I'm going to start this off by saying that, as someone with a passion for history, I have a fondness for classical Chivalry. You might notice that, in that sentence and in the post's title, I say \"classical\" Chivalry and not simply \"Chivalry.\" There's a reason for that. Classical Chivalry, as the knights of Europe lived and died by, is in fact dead. The \"Chivalry\" and so called \"white knights\" we have today are, in fact, subversions and corruptions of the concepts and terms used by feminists in, what I feel, is an underhanded way to undermine all traditional concepts of masculinity. Since I've established that modern \"Chivalry,\" or \"defend women at all costs,\" is not the Chivalry knights upheld and modern \"white knights\" are an insult to the original white knights, I feel it'd be best to explain *what* classical Chivalry was and who the classic white knights were.\n\n&#x200B;\n\nClassical Chivalry, as I call it, was an informal code of conduct upheld by the various knights of Europe and the specific rules and expectations varied between realms. A number of common facets, however, were:\n\n1. Loyalty to one's liege lord. Knights were expected to remain dedicated to their lords. Not much else to say here.\n2. **Forebearance:** A knight **was expected to show restraint and self-control** when dealing with other warriors and at their lord's court. The knightly virtues of mercy and forbearance were well-established long before there *was* a code of Chivalry.\n3. Hardiness: beyond the obvious requirement for them in combat, it was believed that strength and endurance, along with confidence, were marks of a noble individual.\n4.  *Largesse* or Liberality: A knight was expect to not only be charitable and generous, but also incorruptible. A knight who made his disinterest in gifts and disgust for bribes clear would often be held in high regard.\n5.  **The Davidic ethic**: **a knight, particularly one who was to lead others, was expected to help protect the weak and helpless**, respect/provision widows and children, and to oppose the encroachment of corrupt or tyrannical individuals wielding power (be they black knights or robber-barons). In a practical sense, this meant that it was a **knight's duty to seek out threats to those who could not protect themselves and deliver justice fairly**. This is particularly the case of the Knights-Errant, knights who either put less emphasis on their feudal obligations or were currently lordless and would travel the land in an effort to prove their valor and capability in combat, win honor, possibly attract the favor of a woman, and (in the case of landless knights) potentially prove themselves worthy of patronage by a landed noble. The Knight-Errant was the original white knight as some would abandon all feudal and worldly attachment in order to find honor and glory while righting wrongs.\n6. **Honor:** **knights were expected to try to act with honor and prove themselves to be honorable at all times. Dishonorable acts on the battlefield were often the fastest way for a knight to lose all standing.**\n\n&#x200B;\n\nAs you can see, in many ways classical Chivalry was very much a collection of ideals with masculine values. Pay close attention to those six points. Women are only properly mentioned once, in the fifth facet, and even then it's talking about widows. While many knights tried to win the favor of a woman, usually a noblewoman, this wasn't a real part of their code, which obligated them to **defend** the weak. You might also have noticed a mention of \"black knights\" in the fifth point. What are black knights? **A black knight is a knight who, either lordless or hiding the heraldry of his lord, willingly commits misdeeds that would have them shunned as a knight.** Pay attention to everything in bold and compare it to modern \"white knights\" and modern \"chivalry.\"\n\nHere's modern \"chivalry\" just for comparison: \"defend women no matter what, even if they're the instigator, against anyone who they claim or appears to have wronged them, no matter how slight or if the person even did anything wrong.\" Modern white knights, if you look at classical Chivalry, would more than likely be considered thugs *at best* and black knights deserving of being hunted down by a Knight-Errant at worst.\n\nSo what happened? How did we get from classical Chivalry to this? Well, as time went on the code of Chivalry slowly changed and became a number of different tiers (warrior chivalry similar to the above, religious chivalry, and **courtly love chivalry**) before falling out of use around the time of the War of the Roses as the prominence of knights dwindled. The last Knight-Errant died in Brittany in 1488, marking the final end of the Age of Chivalry. During the Romanticism, Chivalry was partially revived with heavy emphasis on the \"courtly love\" part of the code, with many of the longstanding core facets fading from use. From the 18th century to today, this \"Romantic\" Chivalry has shifted and changed to become the modern \"Chivalry\" white knights and feminists harp on about being dead. It's important to remember one thing, though: if we look at Classical Chivalry, modern white knights are not chivalrous. Knights do not attack people who are not able to defend against them. They do not attack someone who is distracted by another battle. They also most certainly do not attack or murder someone who is defending themselves or on behalf of a woman who was not wronged by the \"knight's\" target.\n\nClassical chivalry does, however, exist in a fractured way still, although feminism has made an effort to attack it at every opportunity. Chivalry exists in everyone who tries to help the poor and homeless in spite of their gender and feminism's insistence that women need it more. Chivalry existed in the Good Samaritan, who was accused of sexual assault by the woman he spent an hour helping with her car despite the fact that he didn't have to. Chivalry exists in the few judges that believe the law should apply equally regardless of the gender of the victim and the perpetrator, in spite of feminists insisting women shouldn't be put in jail.\n\nWhen you stop to look at it, \"Toxic Masculinity\" is actually feminism's attempt to do to masculinity in general what the modern age did to classical Chivalry: declare it detrimental to society and reshape it into something more \"fitting\" to their world view.",
    "title": "Musings: Why the Fall of Classical Chivalry Mirrors the Modern Feminist \"Toxic Masculinity\" Situation",
    "subreddit": "MensRights",
    "timestamp": 1561639800,
    "score": 93,
    "keyword": "black judge"
  },
  {
    "text": "The Mis-Education of Boys and Men. I wrote this article last year in reaction to the fact that boys and men are falling further behind in our education system. The article is a bit long - 1600 words but I felt it was my duty to express my opinion on the difficulties and obstacles boys and men face trying to get an education. \n\nThe Mis-Education of Boys and Men\nBy Red Pillis\n\nQuestion. If you want to disempower and disenfranchise a whole class of people to reduce them to serf-like status, what would be a good way to do it? Answer. Don’t educate them.\n\nDeny them a good education. Educate them just enough so they can handle the basics of reading, writing and arithmetic. Don’t educate them any further. This way they will be able to work the jobs that don’t require a good education – the manual, dreary, dirty, dangerous and disgusting jobs needed to make profits or to keep our infrastructure and society running. \n\nTry to keep them from learning too much. Don’t let them acquire critical thinking skills, advanced knowledge, good grammar and spelling, and the ability to speak articulately and convincingly. Don’t give them the ability to think for themselves, form their own opinions, make independent decisions and be skeptical of the propaganda they see, hear and read. This way you can easily manipulate, control and contain them and have them do your bidding. Keep them as an underclass – useful beasts of burden.\n\nThis technique has been successfully used many times during our history. In ancient and not-so-ancient times only a small percentage of the people, the elite ruling class, were educated and had the ability to read and write. The lower classes were kept illiterate or near-illiterate. In modern times it was done to the blacks by the ruling whites in South Africa during Apartheid and to the blacks by the whites in the American South during slavery and the Jim Crow years.\n\nNow it is being done on a much wider scale. It’s being done to half the population – the male half. \n\nStudy after study is showing that boys and men are falling behind in education. From kindergarten to college, there is a strong anti-male bias that creates a hostile environment for them in school.\n\nBoys are constantly being told they are bad, their masculinity is toxic, they need to respect girls and never hit girls even in self-defense \n\nBoys learn better by actively engaging in a project or task than by just passively listening to the teacher. But in primary school, and even secondary school, they are forced to sit still in class, even though boys as a rule need to move around and expend energy more than girls do. \n\nRecess, which used to be part of the school day, has been eliminated at many schools, which means that kids, especially boys, have no way to burn off that youthful energy. So, with all that unspent energy, they may be somewhat high-spirited or rambunctious in the classroom, which these days will be diagnosed as ADD (Addition Deficit Disorder), and they will be given drugs such as Ritalin to ‘help them focus’, turning them into virtual zombies and setting them up for disorders later in life.\n\nIn a female-oriented, zero-tolerance classroom, the slightest infraction of the rules or a bit of horseplay or any display of impertinence on the boys’ part immediately results in disciplinary action such as detention, suspension, expulsion or even arrest by school police – the school to prison pipeline. Watch how fast the authorities converge on a boy if he draws something remotely resembling a weapon. \n\nAlmost all teachers in primary school, and increasingly in secondary schools, are women, and they do tend to favor girl students. When being graded, girls are constantly being given better grades than boys, even for the same quality of the completed assignment.\n\nBy the time they reach college, things get really bad for the boys who are now young men. They are told that a ‘rape culture’ exists on campus and that they are all potential rapists. They are told that they are part of the ‘patriarchy’ that oppresses and subjugates women. They are forced to take sexual harassment classes and sensitivity courses. The straight white males have it the worst. They are automatically labeled racist, homophobic and sexist and are blamed for every bad thing that has ever happened in human history. \n\nThere are also the rape tribunals on campus. They should be called what they really are – Kangaroo Courts. A male student accused of sexual assault or harassment is automatically presumed guilty. He has no legal rights, no access to due process that an ordinary criminal would receive. He is expelled from campus with a damaged reputation that can ruin his whole life.\n\nAll this is creating a hostile environment for boys and men, and as a result, they are dropping out of school and not attending college. On some campuses, female enrollment is nearly double that of male enrollment. And the situation is getting worse. Male enrollment is dropping even further as women surge ahead in Academia.\n\nThere have been so many articles, reports and studies about the plight of males in education, that one would think everyone is aware of it by now and that measures would be taken to correct the imbalance. \n\nBut nothing is happening. In fact, the opposite is happening. It seems Academia is doubling down on the exclusion of males from higher education.\n\nWhy?\n\nI may sound like a conspiracy nut, but this is my theory. I think it is deliberate.\n\nThere are plenty of well-paid jobs that don’t require a college degree. Our First-World society needs a vast amount of manual workers, technicians and skilled tradespeople to build and maintain our complex, sophisticated infrastructure. There is always a great need for electricians, plumbers, carpenters, welders, machinists, masons, bricklayers and so on – people who use their hands and brawn (mostly men) to build and fix things. Many of these jobs pay very well, and one can make a very good living from them.\n\nBut, these kinds of jobs do not give the worker any power or influence. The jobs that do convey power and influence are ones like politicians, legislators, professors, teachers, doctors,  judges, lawyers, writers, journalists, reporters, media pundits, to name a few. \n\nPeople in these professions can profoundly affect and control society. Legislators can set policies and pass laws, judges can pass sentences, politicians can shape public policy, teachers and professors can influence and shape students’ opinions and beliefs, and reporters, writers, TV pundits and journalists can influence public opinion. \n\nWhat all these jobs have in common is that you need a college degree, at least a Bachelor’s Degree, or better yet, a Master’s Degree. If you don’t have a degree, the chances are slim to none that you will be able to enter one of these professions. So it becomes important for groups with certain ideologies to prevent certain other groups from obtaining the requisite education and degrees to enter these professions.\n\nA skilled welding specialist can easily make a six-figure income, but he can’t pass laws. A good carpenter can make a lot of money building houses, but he can’t set policy. \n\nThe Leftist, Feminist, Marxist, Multi-culturist, Social Justice Academics know this. They are fully aware that males have to be kept out of education, especially higher education. But they can’t just suddenly stop males from going to school. There are too many laws and social precedents that would prevent this, and the public outcry would be deafening.\n\nSo it has to be done slowly and stealthily over the course of years or even decades. The Leftist Academics are ratcheting up the pressure on males a little bit at a time. They are turning schools and colleges from places of learning into indoctrination centers and gradually making males feel ever more unwelcome. Their goal is to create a permanent, uneducated, docile underclass – mostly male. The educated class, mostly female, will be the leaders and masters who will set policy, make the laws and control and dominate the underclass.\n\nIf you think I am a paranoid conspiracy nut, just pay attention to some of the Feminist slogans being uttered. ‘The Future Is Female’, ‘Girls Rule’, ‘The End Of Men’, ‘Women Are Better Than Men At – (Practically Everything)’. \n\nSo what is to be done? How do we reverse this? \n\nTake action. Fight back.\n\nThe first step is to get the word out. If you know individuals or families with young boys, let them know about the plight of boys in education. Do your research and gets the facts, then tell everyone. \n\nSecond, if you are a parent or guardian of a boy in school, monitor his progress closely. Take an interest in his education. Ask him to tell you what is going on in the classroom and how his teachers treat the boys. Document this. If you discover any bias or discrimination against boys by the teachers or the school itself, say or do something. Make sure your allegations are valid, and then talk to the teachers. If you get no results from teachers, take it to the next level and complain to the school authorities.\n\nForm associations and groups for the single purpose of helping the boys to do better in school and go to college. Go after colleges and universities that practice discrimination against males. Do this by use of lawsuits, demonstrations, boycotts and any other kind of legal non-violent means.\n\nWe need to help or boys and young men realize their potential and succeed in life. If we don’t, and we let our boys flounder and fall further behind, we will be doing them a terrible disservice. It will also be very bad for our society. This is not to take away any of the advancements and achievements by females. This is simply to level the playing and be fair to both sexes – to achieve true gender equality. If both sexes are equally well-educated and equipped to succeed in the workplace, both sexes and our society will benefit.",
    "title": "The Mis-Education of Boys and Men.",
    "subreddit": "MensRights",
    "timestamp": 1553368390,
    "score": 93,
    "keyword": "black judge"
  },
  {
    "text": "Feminists and Privilege of Exceptions  \n\nJuly 13 2019 (first posted on Wordpress in 2018, and on Tumblr this past June, flagged)\n\nI   came to the conclusion that women are currently negotiating   privileges  against fundamental rights (to the advantage of a minority  of   people)…and this is a disaster for anyone not falling in the  categories   of “Historically victimized people” as described by  ex-attorney general   Eric Holder. It concerns the modern feminist  culture of Empathy,   Emotionalism, Intelligence, Rights, Delusion…\n\n(Note:   I Originally wrote this article in late November 2017…I tried  to   publish it many times on my Wordpress account, it would not work. This   was on my original  blog dethinkxify.wordpress.com. I was finally able   to publish in March of 2018. But rapidly, hackers erased all the   Bibliography, which I had  to recreate. I hope this time around activist   hackers leave it alone.)\n\nThis is a comment I formulated after reading an article in  The Hill: “**Trump risks hypocrisy charges with Franken attack**” by  Jonathan Easley (November 18 2017):\n\nI   reprint here since my Wordpress accounts have never been indexed for   purely political reasons and my Tumblr it account is being continuously   flagged by feminists and is now restricted, which means blocked except   for being harrased by Tumblr feminist employees… [https://dethinkxify2.wordpress.com/2018/06/13/feminists-and-privilege-of-exceptions/ and ](https://t.umblr.com/redirect?z=https%3A%2F%2Fdethinkxify2.wordpress.com%2F2018%2F06%2F13%2Ffeminists-and-privilege-of-exceptions%2F&t=NjMyMmNhNjRiNDBmYzZkOTU4MzdjNzFmYzFkMDEzODRjZDA4YWNlZCxNNGh2MEFjeg%3D%3D&b=t%3A5u3nC0drLYPcMrUcuYL-eg&p=https%3A%2F%2Fdenyspicard.tumblr.com%2Fpost%2F185661395113%2Ffeminists-and-privilege-of-exceptions&m=0)[https://dethinkxify.wordpress.com/about/](https://t.umblr.com/redirect?z=https%3A%2F%2Fdethinkxify.wordpress.com%2Fabout%2F&t=OWIxZTk1ZWJjM2ZhODAxNDZmMzM0OTllYWY2ODhhYjcyYzQ4MjU3NyxNNGh2MEFjeg%3D%3D&b=t%3A5u3nC0drLYPcMrUcuYL-eg&p=https%3A%2F%2Fdenyspicard.tumblr.com%2Fpost%2F185661395113%2Ffeminists-and-privilege-of-exceptions&m=0)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n**“…Trump…Called a Hypocrite…**”. **Who cares by now?**\n\nOur   whole leadership,  including the press, are a bunch of hypocrites by   refusing to include  regular folks in the reality of power discussions.   Power discussions  which concern future fundamental rights of men. But   around the table  sits Feminists, DC politicians, Main Stream Media,   some Power Elites…and  they prepare, again, to decide our diminishing   fates with one-sided  bias unconstitutional legislation. We are   witnessing a battle for fake  righteousness, with your regular insincere   feminists at the front line of this “mobbish” crowd. The first debate   we need to have is: When will  women and feminists stop using sexual   misconduct allegations as an  extortion/coercion tool? When?\n\nNot   yet, obviously…because the inherent conflict of interest here in    seeking the truth lies with an establishment of males (alpha males, bad    expression, but I will clarify) being rewarded for continuously ceding    status, rights, freedoms, liberties of regular males (beta males,  idem   as previously) of the middle and lower class…in exchange for  getting   bigger pay checks.\n\nIt is by  no chance  that for the past 30 years, the Establishment, and  women of  all income  groups, have seen persistent gains in their  incomes, while  middle class  and lower class men have seen an imploding  of their  purchasing power.\n\nThe  Main Stream  Media is so toxic…so hypocrite and so uneducated.  Their  only tool for  convincing the audience of their project for which  women  are already  sold, is the same old Emotional and Affective Empathy   Propaganda where  if you have “any sense of decency, you should be crying   and repenting  for all the horrible crimes men have committed against   women for  centuries..”. Yes, make me  laugh…\n\nThe   scientific truth is very different according to social science.  Women   are bullies too, they abuse their power, they are violent  being…and   when the task is too big, they delegate the dirty physical job  to their   close allied thugs.\n\nOffice work place   is a competitive landscape. Yet women want to  impose rules which will   have the effect of constraining men in not being  able to use   competitive tools and skill in which they outperform.\n\nPauhlus   and Williamson (2002) cornered a theory of  personalities  which   compose people of leadership, men and women alike. This theory is    called the Dark Triad of Personality Traits. These specific traits are    sub-clinical Narcissism, Psychopathy and Machiavelism. These were, and    still are, somewhat taboo traits, so much so that even the scientific    literature fails to often understand the basic premise of the theory.    The theory stands because of the interdependent nature of these 3    traits, while much of the literature feeding on this theory still    analyses circumstances using these traits independently.\n\nAs   independent traits, nothing  is novel in understanding that  someone   showing a high score in one of these trait may be disagreeable,  have   shortcomings, be manipulative, etc…The Novelity of Pauhlus and    Williamson was in describing these traits as interrelated.\n\nWith   this, the authors also demonstrated a surprising observation,  that   people with leadership features scored higher, on average, in all 3    traits simultaneously. Which means that on average each of these traits    where higher than the average observed in a control sample. This was    puzzling indeed, because these traits had mostly been put on the margin    by institutions of morality, such as monotheism; and  could hardly be    accepted as being the corner-stone of leadership. Yet, 15 years  later,   it appears that the theory stands solid, and dominant  characters (which   the alpha epithet only briefly captures) score  higher, on average, than   controls on the Traits of Narcissism,  Psychopathy and Machiavelism   simultaneouly.\n\nOrganizational   hierarchies have been analyzed, been tested, with this  filter, and it   was observed that, effectively, the further you climb up  the latter  of  authority, the higher you score on The Dark Triad Traits  on  average.\n\nSince  these trait are  associated with many negative behaviors, such  as  vanity,  self-promotion, callousness, cruelty, dishonesty,  manipulation,  etc…it  came as quite a shock.\n\nBut even  more  interesting, is the fact that people high on Dark Triad  traits  score  low on Emotional Empathy (Emotional or Affective Empathy  are the  same  thing). And further, Dark Triad Traits have no correlation  with   Intelligence as captured by Intellectual Quotient (IQ).\n\n**Which implies that dominant people need not have great IQs; and high IQs are not synonym of dominant personalities…**\n\nSurprisingly,   leadership requires credibility, since it is expressed  in a social   context; therefore, social performance is of importance.   Social   Performance may be measured by a combination of Cognitive  intellectual   skills, and Personality Traits. Personality traits are  observed  through  performance of Emotional and Social skills.\n\n(I   am abstaining, here, of using the expression Emotional  Intelligence,   because it is an inappropriate terminology. Emotional  performance is   part of the personality trait domain. The difficulty of,  and inadequate   terminology,  in cornering a theory of Emotional  Intelligence has had   for result of creating an overly diversified  incomplete curriculum on   the subject with excessive feminist traps  (matriarchal and   communautarist propositions) and shortcomings. One of  the principal   trap is that of putting Agreeableness as a corner-stone of  the theory.)\n\nNow,   for great leaders to persist and be appreciated, or feared, the  Dark   Triad must be tempered and modulated by other factors. True, yet    definitive consensus has not been reached in this dimension.\n\nNow,   within the inventory of survival tools of evolved mammals, there  is   such a thing as Empathy. Its been the subject of much scientific    research in the past 25 years, has been vulgarized, promoted but    nevertheless still largely badly understood.\n\n**Empathy must be understood as a genetically rooted endocrine reflex**. It has evolved over millions of years and is a very sophisticated mechanism.\n\nBut   first, lets distinguish between two distinct forms of Empathy:    Cognitive and Emotional (Affective) Empathy. While Emotional empathy has    been largely described scientifically, cognitive empathy appears to    suffer from a misunderstanding, and this may be due to the “empathy”    epithet attached to it. Let the scientist describe both phenomenon: ” **Purely cognitive empathy**,    also referred to as perspective taking, mentalizing, or Theory of   Mind,  concerns the capacity to comprehend the viewpoint and/or state of    knowledge of another individual, even if this differs from one’s own.  **Emotional empathy**    concerns the emotional reactions of one individual to the observed    experiences of another. Emotional empathy is a multifaceted and    multilayered phenomenon which ranges from relatively simple processes    such as emotional matching behaviour to more complex events which    involve interaction between emotional and cognitive perspective taking    systems.” (JL Edgar et al., 2012)\n\n“Over   millions of years of evolution, efficient and manifold   neurobiological  mechanisms have evolved for differentiating hostile  from  hospitable  stimuli and for organizing adaptive responses to these   stimuli (Decety,  2010). This integrated set of neural systems is   genetically hardwired  to enable animals to evaluate and readily respond   to threatening or  nurturing, unpleasant or pleasant, appetitive or   aversive stimuli using  specific response patterns that are most  adaptive  to the particular  species and environmental condition.”  Decety and Svetlova (2012):\n\nBoth   systems are believed to be widely presents in mammals and are  related   to the complexity of organization which a family structure  creates   within life organism. In this context, males usually outperform  females   in cognitive empathy and females outperform males in emotional    empathy. A parenthesis: – language is believed to be intimately tied to    emotional empathy. And “baby-talk” (motherese, scientific term) is a    universal language, it is present everywhere in the “human” kingdom. **Motherese    communicates in a manner where emotions are tuned with pitch, rhythm   and  tone instead of there usual evolved accent structure**. In    motherese, what is communicated is not the significance of the word    directly, but the effort to create a future association in the child’s    brain, and this using one of the best learning tools possible,    repetition. Children respond innately to pitch and tone. In the    primitive man, language was mostly thought by the female…this is one    skill where emotional performance was a competitive advantage. Further,    this “Motherese” interaction is also responsible for developing the    spectrum of emotion in the infant. **Emotions need learning and training**,    and biologically, the differentiation or specialization of sex    re-leagued this role to females. This is why the female brain is    preferentially wired, the connectome structure, for emotional empathy    (Ingalhalikar et al., 2014).\n\n**But   recent changes in family organization tends to delegate  emotional   training in children to the pharmaceutical industry, school  “law   enforcement” and the internet, including video games…**\n\nLiving creatures whom can express the hormones linked to the reflex of emotional empathy have higher tone.\n\n“Oscillations   of delta, theta, and alpha ranges could be found in  all vertebrates   but there is an important distinction between reptiles,  lower mammals   and humans in what frequency dominates in the scalp EEG. **Alpha is the dominant frequency in adult humans**,    while theta dominates in the EEG of lower mammals (Sainsbury, 1998)   and  delta in the reptilian EEG (Gaztelu et al., 1991; Gonzalez et al.,    1999).”\n\nAs  brain wave oscillations  of the Beta frequency are highly active in   mammals, they are very low  in reptilian. Langard et al. (2006)   explains, concerning an empathic  test on mice: ‘”our findings are   consistent with the perception-action  model of empathy proposed by   Preston and de Waal (1), both in the  automatic priming of somatic   responses in a state similar to that of  the attended object and in the   modulating effects of familiarity and  similarity of experience between   subject and object.” as observed  under the following conditions: “…Mice   tested in dyads and given an  identical noxious stimulus displayed   increased pain behaviors with  statistically greater co-occurrence,   effects dependent on visual  observation. When familiar mice were given   noxious stimuli of  different intensities, their pain behavior  was  influenced by their  neighbor’s status bidirectionally. Finally,   observation of a cage-mate  in pain altered pain sensitivity of an   entirely different modality,  suggesting that nociceptive mechanisms  in  general are sensitized.”\n\nThis  was a  step forward in debunking the pretentious belief that only   humans,  being God’s masterpiece according to Christians, had Empathy.   And  contrary to popular belief, Empathy is not a moral construct, but a    biological survival reflex. In the fight or flight behavioral choice,    cognitive empathy is the first mechanism to be neuro-alerted. It  quickly   determines if a new set of information possess a **threat or opportunity** (e.g. for food) or necessitates an action of **protection or collaboration**. It then either, respectively switches to either the cruel, sadistic, aggressive spectrum, or to the Emotional Empathy reflex.\n\n**A problem with the recent societal culture of feminism**,    the current “cultural revolution”, is the risky proposition of   offering  overly redundant experiences of Emotional Empathy to the   general  population through tools such as News Television media, where   the  audience is being continuously taxed along Emotional Reflexes, so   as to  effect Mass Emotional Empathy Training…it is destructive to the   balance  of the brain, it creates a state, which psychologists refer to   as “**heightened emotional instability**”.\n\nWe are switching from a Cognitive IQ based civilization to an Emotional driven civilization.\n\nYet,   abuse of the affective spectrum is very useful as a strategy of  mind   control. It is a preferred tool of female leadership, females whom    outperforms males in the Emotional and Narcissistic spectrum. In a    context of competition between women, a status challenge, women will    rarely confront. Competition potential outcomes are usually quickly    determined on site, and interaction avoided with females most often    surrendering to the dominant female. Then, consensus is created by a    repertoire of mimicry, which is related to emotionalism, mimicry,    emotional empathy.\n\nWomen’s “status seeking competitive strategies” are mainly, according to *Joyce F Benenson (2013)* : “*From    early childhood onward, girls compete using strategies that minimize    the risk of retaliation and reduce the strength of other girls. Girls’    competitive strategies include avoiding direct interference with  another   girl’s goals, disguising competition, competing overtly only  from a   position of high status in the community, enforcing equality  within the   female community and socially excluding other girls*.”\n\nFurther, *Tracy Vaillancourt (2013)*: “*Indirect   aggression includes  behaviours such as criticizing a competitor’s   appearance, spreading  rumours about a person’s sexual behaviour and   social exclusion. Human  females have a particular proclivity for using   indirect aggression,  which is typically directed at other females,   especially attractive and  sexually available females, in the context of   intrasexual competition  for mates. Indirect aggression is an  effective  intrasexual competition  strategy. It is associated with a  diminished  willingness to compete on  the part of victims and with  greater dating  and sexual behaviour among  those who perpetrate the  aggression*.”\n\nAs for the kind of aggression women of higher sub-clinical  psychopathic intensity such as females in positions of authority, *Ana  Seara-Cardoso, Helene Dolberg, Craig Neumann, Jonathan P. Roiser, Essi  Viding (2013)* propose: \"*Research   so far indicates that emotional and  personality correlates of   psychopathy such as glibness, grandiosity,  lack of empathic concern are   akin across genders, but similarities in  behavioral correlates, such   as criminal behavior and type of aggression,  seem to be less  consistent  (see Verona & Vitale, 2006, for a  review). It has been  suggested  that differences found across genders are  mainly  differential  expressions of the same underlying construct  (Nicholls  & Petrila,  2005), and that the same personality traits may  confer  risk for  different forms of behavior for women versus men  (Verona,  Sprague,  & Javdani, 2012)\"*.\n\nPsychology   has created two  main sub-groups of psychopaths, those which are   characterized as  operating Instrumental Violence (Group 1) and those   whom uses Reactive  Violence (Group 2). Instrumental violence is   manipulative and indirect,  while reactive violence is obviously direct   and confrontational.\n\n**Women score higher at instrumental violence than men.**\n\nAnd, need I remind, **people in positions of authority**, dominant characters, both females and males, **score higher than average on The Dark Triad traits of personality.**\n\nNeed   I recall the reader of the Center for Disease Control (CDC)  analysis,   whose own data, determined, against popular beliefs, that  women are   violent in partner relationships, and that they are more  often, than   men, the first instigators of physical aggravated assault  against their   partner. That female bisexual persons are more violent in  partner   relationships than either heterosexual, or exclusively  homosexual, men.\n\n**Against   the backdrop of the Main Stream Media and Washington DC  attempting to   portray females as inoffensive, peaceful, loving caring  beings   incapable of violence and never competitive but only  cooperative…It   should be difficult to ignore that the last few  paragraphs, based on   scientific literature, may bring down the  Leadership proposed   Em-pathetically forcefully induced naive conception  of women as   innocent beings in need of persistent protection…**\n\nfor   Feminists who pretend they want to destroy the condescending  values  of  Patriarchy, it appears a Paradox to call for laws of exception  for   their sex all the time.\n\nLastly, one   must make himself familiar, if at least it has not  already intuitively   been understood, that all status dominance challenge  carry sexual   connotations, or undertones, as indirect as they may be.  Dominance in   human relationships always has a sexual  dominance/submission   dimension…if this point is neglected in  decision-making and analysis of   the workplace environment, it is a great  mistake.\n\nAre   all women leaders monsters? No, of course not. But nor are all  men   leaders. But Feminist (as a socio-political proposition) leadership  is   Toxic. And what about regular male employees who score average on    psychological traits of the Dark Triad, males who don’t carry above    normal dominant features but can be very competent in their field, are    they also ALL monsters? So why address the problem of harassment,    aggression in the office/work place as a prevalent and “male only”    initiated model.\n\n**Surprisingly,   in reality, meaning out of the scope of the  fictional construct of   women on TV and other media, women are attracted  preferably to men who   are both more narcissistic and more dishonest than  average…this is  true  when they either seek a mate, or someone to  associate for other   endeavors, such as business associations. Narcissism  and dishonesty are   characteristics where leaders, men and women,  outperform the general   population.**\n\n**This   should assist in anticipating that the office will  continue to have   male leaders, or women leaders, who score high on the  Dark Triad   Traits. What are women teaching these latest generation of  men   leaders…how to better camouflage their personality traits. In the    highly competitive field of finance, both women and men with strong    dominant personality profiles excelled in deception during the 2000    decade of real estate and financial debacle.**\n\n**Therefore,   in the Emotional Empathy Training movements they  are two distinct yet   complementary routes: one has as its principal goal  to modify not the   essence of male competitiveness, with its core in  psychopathy, in  terms  of callousness, or glibness, etc…but to modify the  appearance of  this  trait by expressing it in a more feminine way,  meaning  indirectly. This  is easy, since people with higher  Emotional/social  skills are better  actors…that is they can more easily  fake emotions.  So, in fact, these  are just acting classes, which the new  generation  of male leaders are  happy to participate in. Secondly, for  non-leader  males, the somewhat  “beta” non-dominant profile males,  Emotional  Empathy Training is simply  classes in total submissiveness,  where  anything which could be  disagreeably perceived by any women, in or  out  of context, must be  censured so “beta” females can increase their   level of abusive  narcissistic delusional elation and over-confidence in   the work place.**\n\nBecause   feminists are not revolutionaries, as they often promote  themselves,   but encrusted in the leadership, and submit to authority  more easily   then men,…they are the best tool for the upper class,  establishment and   leadership to maintain and consolidate their position  of hegemony.\n\nBecause   I, for one, know very well that the current spectacle is of  the same   infected breed as that of “Hate laws”…where, in this case, the  target   of constraining behavioral laws that will be abusive will not  really  be  aimed at the high hierarchical individuals who could abuse  their   power, but the regular male employee who has never bothered  anyone, but   will now be obligated to demonstrate absolute submissiveness  to the   Office PC Police…that is the reality, this is what awaits us,  yet   again.\n\nParadoxically, women in the   hierarchy will often tolerate sexual  misconduct in the office from   dominant males in the organization as long  as it benefits them and the   organization…even if there is an innocent  victim (male or female),  call  it collateral damage, once in a while…that  is the “pragmatism” of   female leadership…as is Feminist Mob Justice.\n\nAnd, incredibly, in this whole discourse, not one bit of attention was given to **women aggressors**,    whether their victims were males or females…yes, incredible. But it’s    not the first time that the Main Stream Media and Washington DC  betrays   us males.\n\nAll of you should  read the  Canadian Judge’s ruling in a recent  Canadian case, COURT FILE  No.:  Toronto 4817 998 15-75006437 : Her  Majesty The Queen Vs Jian  Ghomeshi.  In front of the worst of  accusations, Ghomeshi was hanged in  public,  with women newscasters  vomiting righteousness over Canadian  Television  programming for hours on  end. Yet, the conclusion of the  Trial judge  was that, in the end, the  witnesses had no credibility.  Yet, feminists  went on saying it was again  an injustice and they stood  by for all the  “women victims of male  sexual violence…”. In the  debate of sexual  misconduct, feminists have  lost all credibility, and  no one in our  leadership is making any  intelligent contribution in  this exchange  either. Women have to start  understanding who they  really are, and how  they evolve in social  contexts; **male   leadership has to stop trying to please feminists  by surrendering   fundamental rights of men and spoiling women with  unjust legislation,   and financial bubbles, bias against men**.\n\nIn   Canada, the justice system was demonstrated, by a scientific   research,  to show a 98% positive bias towards women (a sample of   research had a  window of 65 to 98% bias towards women), yet, to   feminists, this is not  enough, they want more for women…What does this   tell you in terms of  genetically rooted delusional intensity, of   psychological balance, in  terms of judgement and fairness of women…\n\nIn   the current political “debate” over the allegations of sexual    “misconduct” of a Federal Senate seat, the most zealous critics have    expressed that “…the allegations alone are serious enough that the    Candidate should never be allowed to be a servant of the “People”…”…This    is the new Feminist Mob Justice at its best…is this where  President   Trump wants to lead us?…satisfy feminists so he can get all  the  goodies  he wants, like his irresponsible tax bill, passed?\n\nLaws   meant to castrate men who have done nothing wrong, and won’t, by    incompetent, unconstitutional laws that will regulate work place    dynamics with a 100% positive bias towards women, because, in some    cases, some men have acted irresponsibly, or sometimes  illegally,   abused their power. What about women? They never commit  aggression,   they never abuse their power, they never bully in a work  environment…? I   am sure of that, as they are no female pedophiles, I  guess, and no   maternal infanticides, and no Female pimps, rapists,  criminal   offenders…no women involved in child pornography rings…No, not  in our   world…Not in America, Not in the great insightful eyes of the  Main   Stream Media…women are all “Good, naive and innocent…and need Super    Males, Super Cops, to protect them…”.\n\n>*Once   in a while, one comes across a  small jewel in Academia, and if  Paulhus  and Williams work is Monumental,  Isabelle Engeler and Priya  Raghubir  piece in the Journal of Personality  and Social Psychology: Do  men  Overestimate or Women under-report Their  Sexual Intentions?  (2017) is a  must, and unavoidable if one has the  ambition to reform  the workplace.  It will help understand  miscommunications,  mis-signalling, miscues and  mis-interpretation  between the sexes in  the context of workplace  sexual misconduct and  sexual interpersonal  interactions. This text  unveils some core  mechanisms and informs  anyone with the goal to modify  the work  environment in a manner fair  to all.The text comes to the  conclusion,  amongst other observations,  that under their testing  conditions, that  both men and women  underreport their own sexual  intentions, that men  overestimate women’s  sexual intentions and women  underestimate men’s  sexual  intentions…this alone is enough to warrant  work place “reformers”   attention. Is this due to delusional mechanisms,  social desirability   bias, or brain structures misaligned communication  features…the door is   open. But, in this context, an intelligent  behaviour is not blaming  the  other party for misgivings and  shortcomings, finger pointing and  all;  but rather trying to understand  more deeply what could be at the  source  of frequent “misfiring” social  performance, since in ideal  world,  communication should have no  frictional bias.Let’s make a short  example, without  blaming one party  over the other, without pushing  responsibility on one  side more than on  the other.Two co-workers, one  man and one  woman, are sent on a project  abroad. They only know each  other  superficially, have not had the  opportunity to really work  together  except for short group meetings,  etc…they know each other  from a  distance, but have had an effect on  each other. He has found he   appealing, intelligent , witty, etc…she has  found he presents himself   well, looks serious, responsible, dedicated,  maybe ambitious, but in a   good way.Now, during their travel, one night   after work, to  celebrate their on-going business success, which got  them  to develop  quickly a good complicity, trusty relationship, they  are  efficient and  complementary. They decide to go to a nice restaurant  with  a very  relaxed atmosphere, a beautiful terrace with a beautiful  view,  they  drink a little bit, and she starts to confide on her  personal life.   She is more telling than inquisitive, already knows he  is single, while   she is married. She believe this guy is a great  candidate for a   business friendship. She starts to elaborate about her  own marriage   difficulties, though she doesn’t have children yet, the  discussion   starts with humour and slips in more confident terms…and  then “woops”,  out  of nowhere, in a moment of laughter, she confides she  has not had  sex  with her husband for two months… That something is not  going right  with  her husband. Her only intention is to have a good  hearing ear,  to relax  and this guy looks trustworthy, etc…But he may  well interpret  this  intimate comment as something else, especially  since he did find  her  attractive.And now, let’s imagine, that when   they leave the  restaurant, she helps him put his coat on, and as he   slips his arms  into the sleeves, she gives him a warm and affectionate   tap on the  arms while she is behind him. Nothing more…just a sign she   feels good,  relax…Yet, they have drank a bit , he feels good also, and   has liked  his evening, is being increasingly seduced by this women, who   has done  nothing else but treat him as a friend…They go to the hotel,   and  doing so, they go on talking, confiding…and she increasingly looks   at  him in the eyes, as to get affirmation of their new found complicity,    their new friendship, she feels she has established trust. Then, at  the   door of her room, they go on talking a bit…and as they get ready to   go  there on way, to say goodnight, he just gets closer and kiss her on   the  mouth. Then the nightmare begins, she freezes, is shocked,   surprised,  says nothing…gets into her room, closes the door and   suddenly feels  betrayed…READ THE ARTICLE.*\n\nThe   work place backlash, which also affects negatively a majority of  men,   and creates negative spillover’s over all of society is principally   due  to “Emotional Intelligence”, an inadequate scientific theory with    misleading terminology, has been increasingly and dominantly used as  the   main hiring candidate criteria for employment. While this may  create a   more “Agreeable” work environment for women, it is at the  source of   increasing fraudulent and toxic activity and behavior in the  workplace.\n\nHere, take the time to read : “**Will get fooled again: Emotionally intelligent people are easily duped by high-stakes deceivers**”; by Alysha Baker, Leanne ten Brinke and Stephen Porter (2012);Legal and Criminological Psychology.\n\nThe   most intriguing conclusion of this work, is that people with  Higher   Emotional/social skills as captured by an Social Ability  psychological   test have demonstrated a very poor capacity to detect  deceit, yet have  a  greater ability to deceive…Most feminists would  either refute this   scientific affirmation, and others may call it a  paradox; yet when one   knows women, this makes perfect sense, it is  self-evident. May I  remind  you, if you suffer from some kind of  personality trait naiveté,  that  women, on average, score higher than men  in Emotional  skill/ability.\n\nYou  want to really talk  about these matters, I am up to the  challenge. You  want to get  ready…go to social science class, but avoid  anything which  is written  by either a female or male feminist, because  it is not  science, nor is  the theory of Emotional intelligence. **Read    about status seeking, psychological personality traits (especially  the   work of L. Paulhus: The Dark Triad Traits, The Dark Tetrad Traits)**.    Debunk the Emotional Intelligence crap. Emotions are an endocrine    evolution system. They give tone to actions and metabolisms. They are    tied to personality traits. They do affect performance, and some people    do show greater skills at controlling, moderating, utilizing their own    emotions and those of others, but this is a skill, it is not    intelligence. Performance is the result of a set of Intellectual factors    captured by IQ and emotional and social skills captured by  personality   traits. Strong leaders are characterized by high  performance in taboo   personality traits such as sub-clinical  Narcissism, Psychopathy,   Machiavelism and even Sadism…leaders, male  and female alike, have a good   look at yourselves in the mirror before  climbing on the moral   bandwagon! Debunk this view that women are  always victims and men always   predators…it’s the biggest of lies…**stop being retarded**.\n\nAnd   don’t pass corrupted unjust new laws (to manage the work space) for a    subject your delusional reflexes prevents you from understanding at  all,  but  your political ambitions guides you to.\n\nBibliography :\n\n**The Dark Triad of personality: Narcissism, Machiavellianism, and  psychopathy**; Delroy L. Paulhus \\* and Kevin M. Williams – Journal of  Research in Personality (2002)\n\n**The Dark Triad of Personality: A 10  Year Review**;   Adrian Furnham1, Steven C. Richards, and Delroy L.  Paulhus; Social  and  Personality Psychology Compass 7/3 (2013): 199–216,   10.1111/spc3.12018\n\n**Hippocampal Theta: a Sensory-inhibition Theory  of Function**; Neuroscience & Biobehavioral Reviews, Vol: 22, Issue:  2, Page: 237-241; (1998) Robert S. Saisbury\n\n**Motivation, emotion,  and their inhibitory control mirrored in brain oscillations**; Gennady G.  Knyazev –  Neuroscience and Behavioral Reviews (2006)\n\n**EEG delta  oscillations as a correlate of basic homeostatic and motivational  processes**; Gennady G. Knyazev – Neuroscience and Behavioral Reviews,  (2011)\n\n**Social Desirability Bias: A Neglected Aspect of Validity  Testing**; Maryon F. King and Gordon C. Bruner; Psychology & Marketing  Vol. 17(2):79–103 (February 2000)\n\n**Staying alive: Evolution,  culture, and women’s intrasexual aggression**; Anne Campbell, BEHAVIORAL  AND BRAIN SCIENCES (1999) 22, 203–252\n\n**Status-Driven Risk Taking:  Another “Dark” Personality?**;   Beth A. Visser, Julie A. Pozzebon and  Andrea M. Reina-Tamayo;  Canadian  Journal of Behavioural Science / Revue  canadienne des  sciences du  comportement; (2014), Vol. 46, No. 4, 485–496\n\n**Minimization  of Male Suffering: Social Perception of Victims and Perpetrators of  Opposite-Sex Sexual Coercion**; Sexuality Research and Social Policy, Anna  Magda Studzinska1,2 & Denis Hilton (2016)\n\n**Emotional  intelligence, Machiavellianism and emotional manipulation: Does EI have a  dark side?**; Elizabeth J. Austin, Daniel Farrelly , Carolyn Black, Helen  Moore; Personal and Individual Differences (2007)\n\n**The Fight for  the Alpha Position: Channeling Status Competition in Organisation**s; by  C. H. LOCH, M. YAZIJI and C. LANGEN (2000), INSEAD R&D\n\n**The  affective and cognitive empathic nature of the dark triad of  personality**, Michael Wai & Niko Tiliopoulos; Personality and  Individual Differences (2012)\n\n**A meta-analytic review of the Dark  Triad–intelligence connection**; Ernest H. O’Boyle, Donelson Forsyth,  George C. Banks, Paul A. Story; Journal of Research in Personality  (2013)\n\n**The Dark Triad of personality and unethical behavior at  different times of day**;   Karolin Roeser, Victoria E. McGregor, Sophia  Stegmaier, Johanna   Mathew, Andrea Kübler & Adrian Meule; Personality  and Individual   Differences (2016)\n\n**Different routes to limited  empathy in the sexes: Examining the links between the Dark Triad and  empathy**; Peter K. Jonason, Minna Lyons, Emily J. Bethell & Rahael  Ross; Personality and Individual Differences (2013)\n\n**The Dark Triad  at work: How toxic employees get their way**; Peter K. Jonason, Sarah  Slomski & Jamie Partyka; Personality and Individual Differences  (2012)\n\n**Will get fooled again: Emotionally intelligent people are  easily duped by high-stakes deceivers**; by Alysha Baker, Leanne ten  Brinke and Stephen Porter; (2012) Legal and Criminological Psychology\n\n**Do  human females use aggression as an intrasexual competition strategy?** ;  Tracy Vaillancourt; Philosopic Transactions of the British Society B  (2013)\n\n**Empathy, morality and psychopathic traits in women**   ; Ana  Seara-Cardoso, Helene Dolberg, Craig Neumann, Jonathan P.   Roiser, Essi  Viding;  Personality and Individual Differences, 55 (3)   pp. 328-333  (2013)\n\n**Psychopathy in Women: Assessment, Manifestations, and Etiology**;   Verona,  E., & Vitale, J. ;  (2006) – In C. J. Patrick (Ed.),   Handbook of  psychopath (pp. 415-436). New York, NY, US: Guilford Press        Gender and psychopathy: an overview of important issues and   introduction  to the special issue ; Nicholls, T. L. and Petrila, J. ;   (2005),   Behavioral Science and the Law, 23: 729-741\n\n**Gender   and factor-level interactions in psychopathy:  Implications for   self-directed violence risk and borderline personality  disorder   symptoms** ;By Verona, Edelyn,Sprague, Jenessa,Javdani, Shabnam;    Personality Disorders: Theory, Research, and Treatment, Vol 3(3), Jul    (2012), 247-262\n\n**Putting together phylogenetic and ontogenetic perspectives on empathy**   ;  Jean Decetya & Margarita Svetlova; Developmental Cognitive    Neuroscience (2012)  The neuroevolution of empathy ; Jean Decety ; The   Annals of the New York  Academy of Sciences (2011)\n\n**Different routes to limited empathy in the sexes: Examining the links  between the Dark Triad and empathy** ; Peter K. Jonason, Minna Lyons ,  Emily J. Bethell & Rahael Ross;\n\n**Personal   and Individual Differences (2013)  Towards a neuroscience of empathy:   Ontogeny, phylogeny, brain  mechanisms, context and psychopathology** ; Cristina Gonzalez-Liencres, Simone G.  Shamay-Tsooryc, Martin Brünea; Neuroscience and Behavioral Science  (2013)\n\n**Two   systems for  empathy: a double dissociation between emotional and   cognitive empathy  in inferior frontal gyrus versus ventromedial   prefrontal lesions** ;  Simone G. Shamay-Tsoory, Judith Aharon-Peretz and Daniella Perry ; Brain  – A Journal of Neurology (2009)\n\n**No Evidence for Emotional Empathy  in Chickens Observing Familiar Adult Conspecifics**   ; Joanne L. Edgar,  Elizabeth S. Paul, Lauren Harris, Sarah Penturn   & Christine J. Nicol  ; PLoS ONE (2012) 7(2): e31542.   doi:10.1371/journal.pone.0031542\n\n**Sex differences in the structural connectome of the human brain**;   Madhura  Ingalhalikara, Alex Smitha, Drew Parkera, Theodore D.   Satterthwaiteb,  Mark A. Elliottc, Kosha Ruparelb, Hakon Hakonarsond,   Raquel E. Gurb,  Ruben C. Gurb, and Ragini Vermaa; PNAS (2014)",
    "title": "Feminists and Privilege of Exceptions",
    "subreddit": "MensRights",
    "timestamp": 1563011322,
    "score": 53,
    "keyword": "black judge"
  },
  {
    "text": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired. Please note, i tried to post this in unpopular opinions and it got flagged as a political post.  Meaning I could only post it in the weekly political thread.  I wanted it to be seen, so I decided to post it here as well.\n\nNetflix and LinkedIn have recently hired Inclusion and Diversity Directors.  To me this shows that from now on these companies will try their best to elevate Women, POC and Minorities just because society classifies them as the oppressed classes. I see little evidence against this in terms of the popular beliefs of our society.\n\nIt can be easily shown that Netflix and LinkedIn are Liberal companies and Liberal companies tend to over extend when it comes to helping Women, POC and Minorities.  Now don't get me wrong, those previously mention groups have all had a hell of a hard time in western society and anyone who starts on a lower starting level deserves help.  But hiring Inclusion and Diversity Directors to help these \"oppressed\" groups is an extremely biased way of allowing those who do not need help an extra advantage they may have not deserved/required.  Every group of people has there privileges and hardships.  One of the biggest differences is the socialeconomic status of individuals.  The socialeconomic status is the single greatest privilege anyone can have in society.  Every group of people has poor individuals and those people need help.  But all Women, POC and Minorities do not need help before Caucasians, Men or Caucasian Men.  We are a mix of people and we all need help, some of us more then others, but being born as the historically oppressed class does not guarantee you need help.  Being born in the lowest social economic bracket nearly guarantees you will need help to reach you max potential.\n\nLiberal companies and governments have shown that they believe Women, POC and Minorities need extra help to decrease the divide in representation.  Yes diversity is great, but diversity comes in much more then the cover on each of our individual books (Race, Gender, Religious Beliefs, Sexual Orientation, etc.) .  As an example when 80% of people applying to a job are of the majority already employed.  Statistically 80% of those hired in those positions should fall into the majority.  Just look at Waste Disposal Jobs, Construction Jobs, Nursing, Teaching, Engineering or Human Resources.  Each of these careers have a wide divide in the groups who are work in the fields but still see the same divide in those hires.  Meaning pushing for Inclusion and Diversity shouldn't guarantee these divides shrink (maybe not noticeably).  But yet serve to drive Caucasian Men or any mix of, out of the careers they are the majority and increase the divide in the careers Women, POC minorities already dominate against Caucasian Men or any mix of.\n\nI am 100% for equality, but I believe the current path we are on is not the way of getting there.  I definitely believe hiring a Inclusion and Diversity Director can only mean bias towards Caucasians, Men or Caucasian Men.  Diversity means many things,  you cannot judge a book by its cover and say that is diversity.  Every individual is different and diverse.  We need to balance out society to an extent, but a free equal society is one where people can choose the life and careers they want the most.  With this means areas of our society will have careers that have minimal visual diversity. Humans have stereotypes, these stereotypes don't define what groups we need to fall into but statistically define where we are most likely to lie.\n\nNote: As a shallower example, both Inclusion and Diversity Directors are Black Females.  This is a very small sample size and can't show bias but it doesn't help to disprove me point.",
    "title": "Companies who hire Inclusion and Diversity Directories only show that Caucasian Men or just Men will have an unnecessarily hard time of getting hired.",
    "subreddit": "MensRights",
    "timestamp": 1556675287,
    "score": 43,
    "keyword": "black judge"
  },
  {
    "text": "The role of false accusations during the temperance movement and in the lynching of blacks in the Deep South False accusations get a lot of attention, but much less attention has been given to how false accusations have helped shape history.  For example, false accusations have often been used to push a false victimisation narrative.  And the interaction between false accusations and false victimization narratives can be found throughout history.\n\nThis kind of argument should create more sympathy for the problem given that most people (feminists and SJWs included) already accept the historical narrative around these topics.  In fact, SJWs often go to great lengths to discuss the prison disparity among black people in terms of wrongful convictions.  The fact that many of those convictions were because of false accusations (including false accusations of sexual assault) seems to go over their heads.\n\n###**Temperance (prohibition)**\n\nAround the turn of the 20th century, the issue of temperance was split by gender.  Women usually supported it, and men were against it.  As a result, the early women's movement got involved.  In fact, their later support for suffrage was largely the result of their belief that women would vote in favor of prohibition (and not, for example, [in a belief that women were being oppressed](https://www.reddit.com/r/MensRights/comments/dxtdqd/addressing_a_few_foundational_assumptions_of/)).  Evidence for this comes from the fact that [most women who supported suffrage were against giving blacks the right to vote, including other black women](https://www.npr.org/2011/03/25/134849480/the-root-how-racism-tainted-womens-suffrage).\n\nThe main argument for temperance was that men who drank too much neglected their responsibilities to women.  A husband who drank too much would loose his job, he would neglect his children, and he would beat his wife. The narrative of female victimization was so powerful that some women [took it upon themselves to go around the country and start fights in bars](https://dp.la/primary-source-sets/women-and-the-temperance-movement).  The harm that women faced at the hands of drunk men, both real and imagined, was used to push their political narrative.\n\nOf course women eventually got their way.  Prohibition was established in 1920 and lasted for 13 years (and only ended because [women eventually changed their minds](https://books.google.com/books?id=7mc8QsyUMjAC&printsec=frontcover#v=onepage&q=Women's%20organization%20for%20national%20prohibition&f=false)).\n\nAnd this wouldn't be the last time that women's safety in society was used to outlaw a substance, either.\n\n###**The lynching of blacks in the Deep South**\n\nIf you were a black man living in the South, the last thing you wanted to do was get involved with a white woman.  Simply looking at a white woman could get you hung by a violent mob.  And while the lynching of blacks is usually seen as something that white men did to black men, the role of white women is often overlooked.\n\nSeveral studies reveal that white women were not only complacent in the lynching of blacks, but that they often took an active role in it. They would accuse black men of looking at them, of stalking them, and even of raping them.  Simply pointing their finger at a black man was enough to get him hung.\n\nOne prominent black woman who was alive at the time noticed this and took it upon herself to document and analyze hundreds of cases of lynchings.  What she found was that many lynchings were enabled by white women who spoke \"falsehoods\" about black men, and that most of their claims were dubious at best.  Even the judges who presided over these trials (when there even were trials) were said to know that the claims were false.\n\nHer stories can be found in *[The Red Record](https://archive.org/stream/theredrecord14977gut/14977.txt)*.  Another source on this topic is *The Killing Fields of the Deep South: The Market for Cotton and the Lynching of Blacks, 1882-1930*.  The role of feminists and the early women's movement (who at the time had close ties to the KKK), in enabling this can be found [here](https://docs.lib.purdue.edu/dissertations/AAI1469917/) and [here](https://digitalcommons.iwu.edu/cgi/viewcontent.cgi?article=1014&context=constructing).\n\nIn terms of numbers, *The Red Record* found that 36% of lynchings were motivated by accusations of rape (or attempted rape).  Allegations of rape, and the safety of white women, [definitely dominated the social narrative of the time](https://www.jstor.org/stable/25119509).  And let's not forget that sexual assault is not the only crime where false accusations can be found.\n\nWhile the lynchings eventually stopped, black men are still put in jail because of racially motivated allegations.  Recently the case of the \"[central park 5](https://en.wikipedia.org/wiki/Central_Park_jogger_case)\" made headlines due to the wrongful imprisonment of five young minority boys who were forced to confess to the rape of a white woman.\n\n###**The war on drugs**\n\nIt has been stated that many of our drugs laws were drawn up based on race.  White people drank alcohol and used tobacco, so that's why those substances are legal.  Black people used cocaine, and Hispanics smoked marijuana, so that's why those substances were outlawed (see: *[The New Jim Crow: Mass Incarceration in the Age of Colorblindness](https://en.wikipedia.org/wiki/The_New_Jim_Crow)* by  Michelle Alexander).\n\nOne piece of propaganda that was particularly effective was the claim that [black people would use cocaine and then run around raping white women](http://lh.journals.yorku.ca/index.php/lh/article/download/5410/4605).\n\n###**Most of the social narrative surrounding gender to this day is shaped by a victimization narrative**\n\nEverywhere you look people are trying to manufacture a victimization narrative.  And while some issues may be more legitimate than others, many are simply made up out of convenience.  It could be stated that feminism itself relies on a false victimization narrative.  The idea that women are oppressed through a patriarchal conspiracy follows a well established pattern that doesn't seem all that out of place given the historical context (and the parallels to the neo-Nazi rhetoric of a Jewocracy oppressing white people [hasn't exactly gone unnoticed](https://www.newstatesman.com/politics/feminism/2018/10/dog-rape-and-mein-kampf-feminist-text-why-we-hoaxed-journals-terrible) -- see also: https://www.reddit.com/r/Menkampf).\n\nPeople aren't shy to make false accusations when it benefits them.  While the rate of false accusations of rape is debatable, there are very clear statistics that indicate the extent of this happening in [divorce and child custody cases](https://quillette.com/2019/04/16/divorce-and-the-silver-bullet/).\n\n[False accusations of child abuse](http://ohiofamilyrights.com/Reports/Special-Reports-Page-3/Sexual-Abuse-Allegations-in-Divorce-and-Custody-Disputes.pdf) occur in about 6% of child custody cases, with 33% being provably false, and another 17% being baseless. [Allegations of domestic abuse](http://www.saveservices.org/downloads/False-DV-Allegations-Cost-20-Billion) occur in 25% of cases, with 70% being false. And it's estimated that [85% to 90% of restraining orders are completely without merit](https://www.huffpost.com/entry/order-of-protection-and-j_b_974970).\n\n[Most perpetrators of false accusations are women, and most victims are men](https://leb.fbi.gov/articles/featured-articles/false-allegations-of-adult-crimes) (about 80% of cases), and this contrasts strikingly against the fact that [women are just as abusive against men as the reverse](https://domesticviolenceresearch.org/domestic-violence-facts-and-statistics-at-a-glance/), [women rape men at a similar rate as the reverse](http://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf), and [women abuse children at greater rates than men](https://www.ncbi.nlm.nih.gov/pubmed/16165212).\n\n###Why is the victimization narrative so successful?\n\nHumans have a biological imperative to listen to, and help women.  [Study](http://www.ncbi.nlm.nih.gov/pubmed/15491274) after [study](https://journals.sagepub.com/doi/pdf/10.1177/1948550616647448) after [study](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5112287/) demonstrates how strong of a bias this is.  When a woman needs something, it is almost always the case that a man will get it for her.\n\nA man can claim a victimization status all he wants, but he will never get the same amount of attention that a woman would.  That's why you don't find as many men making false accusations as you do women.\n\nIn a lot of ways, the use of a victimization narrative to grant privileges to women is just a reflection of society acting this way in aggregate. And again, there are [studies](https://www.sciencedirect.com/science/article/pii/S0022103118304633) and [more studies](https://ideas.repec.org/p/hhs/nhheco/2019_006.html) indicating that this is likely the case.\n\nMany issues that men face in society are caused by this phenomenon. Men receive far less empathy than women do. And men are pushed aside, and are often harmed, to advance the privileges of women.\n\nAs such, the phenomenon of false allegations should be viewed through the wider lense of \"manufactured victimization\".  Its relationship to the empathy gap is also obvious, and that makes it a major force behind the wider persecution of men in society.",
    "title": "The role of false accusations during the temperance movement and in the lynching of blacks in the Deep South",
    "subreddit": "MensRights",
    "timestamp": 1575386071,
    "score": 35,
    "keyword": "black judge"
  },
  {
    "text": "At DECA today Deca is a High School business case competition. I was a judge today.\n\nDECA requires business attire, and has a specified dress code. For men, it is dress shirts and dress pants. Ties and blazers are optional, but the later is strongly recommended.\n\nFor women, it is a dress shirt / sweater / blouse / + dress pant / skirt or a business dress. Tops cannot be sleeveless, backless, show cleavage or midriff. Skirts / dresses cannot be shorter than one inch above knees. Blazers are optional but strictly recommended.\n\nSome observations\n\n1. Most Men are in full suits\n\n2. Most women are also in full suits. Teenage women are easily able to abide by dress codes, it is working women who somehow cannot and make stupid excuses on why they should be able to dress how they like, even if men wear suits.\n\n3. The DECA dress code is an excellent office dress code\n\n4. Most women in my previous years judging tended to wear shorter skirts. I deducted points, and some series directors did, but usually they get away with it. One of the other judges was criticizing the skirt length rule, saying how \"women get a bad rep\" and that it is just legs, a girl can show them if they have them. I replied that men don't wear shorts, and she said that \"it is not the same thing, this is a power suit\"\n\n5. This time many women seemed to think that black denim pants qualify as dress pants.\n\n6. Women still dress up generally in DECA; so offices can easily bring in equitable dress codes",
    "title": "At DECA today",
    "subreddit": "MensRights",
    "timestamp": 1572746451,
    "score": 20,
    "keyword": "black judge"
  },
  {
    "text": "Tinder & Life Biases Favoring Women in Light of \"Gender Equality\" In light of Tinder's supposed \"joke\" about height verification, which didn't seem like a joke considering their tweets still hinted at \"not lying about who you are\" or \"staying true to yourself\" on your profile, if men on Tinder are, even as a joke, forced to prove their height, why is there no requirement for women to prove that their breasts are not fake? I don’t want to date any women who is faking her inferior flat chested genes. How come women get to cheat their genetics with fake breasts and men can’t? What about how women get to fraud their bad skin genetics by covering their acne and bad skin with makeup but men can’t because it would not be masculine? How is this fair and equal? Or what about women getting to wear heels just because it makes them feel \"feminine\" even though it makes it so it is even harder for a shorter man who stands next to a woman with high heels, the same man who is not allowed to wear boots or any type of shoes that give him height because this is a \"woman only\" thing.\n\nAnd before I get an influx of people saying oh you’re just a salty \"Manlet\" who can't take a joke, I’m 6’3. I’m just having a hard time understanding how women want equality but they won’t work constructions jobs, they won't do any of the actual physically demanding jobs, but want equal pay, even though statistics show the pay rate is literally the same for every job for men and women with only a few outliers. And let's not forget today's standards or expectations and criteria that a man has to fit in today's feminist dominated culture, which requires that a man: must always have a job, have friends and be sociable, be really good at something, be at least somewhat muscular, constantly have to approach women, don't be shy, don't have any noticeable disabilities, have sexual experience, have relationship experience, have a low body fat percentage, have the intelligence to succeed in life but don't actually be a nerd, don't have bad skin (because you can't cover it up with makeup, that's for women only), be able to provide for kids, regardless if she says she wants any, have your own home or apartment, have a car and drive it, have more income potential than her, have a good social standing, be older than her, be taller than her, have better forward facial growth and better facial aesthetics than her, have more education experience than her, be willing to give up time and energy to \"chase\" her even if she decides to reject you. What are a woman's expectations on the other hand? Don't be a fat landwhale and maybe wear makeup. Let's not forget the virtue signaling women who say \"I don't care about looks,\" but then turn around and select their partner who just happens to be 6'5 and has a model tier face with wealthy parents as well as the blue pilled people who always chime in with their \"personality\" rhetoric though, because that is what really matters. The Red Pill is not even objective anymore, and as nihilistic or morbid as it sounds, the black pilled theory of only looks mattering at all in the world, seems to be the only theory that makes even remote sense in today's society that is seeing more of a rise in virgin men who have never had a relationship due to women's ever-increasing expectations.\n\nAnd EVERYTIME these expectations from women are mentioned you always have people go on the thread going, oh well I know this and that person who don’t fit those expectations, and they have a girlfriend, THESE ARE OUTLIERS, just because you know 1 out of 100 people who are ugly or short or not wealthy or have status that have a girlfriend, it means nothing because these are outliers, which are irrelevant and not what the actual norm is with how women actually choose their partner. It seems more like women want “equality” when it only gives them an advantage over men, who are already held at such high standards, that nowadays, if you’re not at least 6’2, have a 6-inch schlong, earn 6 figures and have a chiseled jawline, good luck finding a woman.\n\nOn top of this women will always scale UP and look for a partner that looks better than them in terms of their face and physique because they are the choosers and they can. Meanwhile, the poor schmuck who falls for the average women like this, will get forced to marry the women, give her kids and then get divorce raped once she decides to monkey branch onto a different man, take half of the man’s earnings in divorce court because the courts always favor the women AND continue to receive child support/alimony for at least 18 years AND get new money from a new idiot who falls for the same scam. And not to mention the less obvious things, like women preying on a man who is going places in life or is becoming successful who falls for the women who then almost always decides to either move on from him, cheat on him or divorce him after he becomes attached and ruin the man’s future or life as well as today’s feminist empowered society that encourages women to ruin a man’s life by lying about them being raped because the judge will, again, always take the women’s side even if she is lying as well as giving a man no say whatsoever when it comes to keeping a child that a woman becomes pregnant with. The saddest part about all of this is not only what I just wrote, but also the fact that the feminist agenda warriors will make sure that it doesn’t see the light of day on any subreddit and claim that it breaks some rules even if I am invoking my freedom of speech by giving an objective view of the actual reality of gender equality. Nah, we feminist proponents can’t handle you telling the truth to others, welcome to gender equality people.",
    "title": "Tinder & Life Biases Favoring Women in Light of \"Gender Equality\"",
    "subreddit": "MensRights",
    "timestamp": 1567088138,
    "score": 13,
    "keyword": "black judge"
  },
  {
    "text": "Guyger #HugGate case: Our feminized society saw the white privilege, but barely the Female privilege (Progress: Mainstream news says \"DISPOSABLE\" to describe SOME men. See this Powerful video, from an average Joe Youtuber in his bedroom.\n\nAnd within this video, are clips of the TYT Youtube news channel where Cenk used the word \"disposable\" to say how black men are treated in society. That's close to what the Mens-Rights groups say:  All average men are disposable.\n\n[Female Privilege:  Amber Guyger sentenced to Hugs from Judge, victims brother AND Bailiff](https://youtu.be/6YLUbBoo0Xg)",
    "title": "Guyger #HugGate case: Our feminized society saw the white privilege, but barely the Female privilege (Progress: Mainstream news says \"DISPOSABLE\" to describe SOME men.",
    "subreddit": "MensRights",
    "timestamp": 1570812043,
    "score": 10,
    "keyword": "black judge"
  },
  {
    "text": "White accuser, black accused: Judge approves Title IX lawsuit by misidentified sexual assault suspect - The College Fix",
    "title": "White accuser, black accused: Judge approves Title IX lawsuit by misidentified sexual assault suspect - The College Fix",
    "subreddit": "MensRights",
    "timestamp": 1551545359,
    "score": 7,
    "keyword": "black judge"
  },
  {
    "text": "California Family Courts Run by Black Robed Tyrants In 1994 my wife applied for welfare and we were on it until 2004, in 2007 she filed for divorce and a child support order filed, as a restraininga order a TRO was ordered based on outrageous, and unsubstantiated allegations, hearsays and mistruths. Family Courts who are always willing to oblige any-woman's stories without facts to support their assertions. Unbeknownst to me, the party with the restraining order holds the power.\n\nA restraining order that my former wife would use as a weapon as she tried to get me arrested in Superior Court Clerks Office I had been standing in line at. She poped in stood at the back of the line then began shouting \" your a poor excuse for a man and a father, how could you do this to your kids\" I ignored her and got a file I was reaserching. She left the clerks office and came back with Deputies alleging I had made obscien gestures shouting obscenities at her. I was shocked and said this insane woman is going to get me arrested. Fortunately for me, the Court Clerks Office had security cameras which the deputies went back searched the video it was determined my wife made up the whole story. I was given a reciept of the incident report and went back to family court and informed the Court what she had tried to do, and requested that I be given a restraining order to keep her away from. The court determined that niether of us would be granted an RO.\n\nMy former wife was not so much as even given a stern shame on you miss for violating the TRO, I was then hit with a $750.00 child support order for six months after which my youngest son reached adulthood and $350.00 child support arrears for the ten years my wife collected welfare during which I was living with her and working. She did not report me on the application. This is fraud as I was not aware she had not included me on the government aid. That is now $130,000 and with no ending in sight. The only times I saw my former wife was during the proceeding every so often and I 2010 I was having dinner with my mother and she showed up crying telling me she was diagnosed with stage four breast cancer and did not want to die alone I told her I was sorry to hear that, and that she should go cry on her boyfriends shoulder.\n\nShe then began coming to my work, my appartment and did not stop until I caved into her request to return home. I supported her throughout the chemotherapy, radiation, loosing all her hair, hand and toe nails, taking her to her therapy, oncology appointments, getting her meds and giving her moral support. Luckely for her the cancer went into remission and it was not long before she was back to her good old August 21, 2018 she informed me that she was having an affair for me to go find my soul mate. I left the home the next day she then dragged me back to family court on October 29, 2018 moving the court to grant her divorce. I informed the Court that Civil Code of Procedures Section 583.310 states that an action must be brought to trial within five years from when it was first commenced.\n\nThe judge dismissed the dissolution of marriage informed my wife that she must refile for divorce. my wife was outraged, as she is like every other woman who knows that family court judges always find an exception to the rules. I moved out of the County I resided in my entire life, to make sure that this woman would not make false reports of me. Unbeknownst to me my wife moved the court for a stipulation extension of time, she followed up with a case conference, then filed for default of judgement for dissolution of marriage during which I was never served summons for any of her actions with the court. To add insult to injury I was served with a restraing order and request for DVRO that I was served proper for. She alleged that I had text her threatening messages against her and her boyfriend it was nightmare. On May 29, 2019 I went to the DVRO hearing, and responded to the request for DVRO with copies of her confessions under oath admitting she purposely made false reports against me for DV to have me arrested, copies of her perjury conviction, and the fact that she had not properly serviced me summons for any of the actions she took with the court, and that the proceedings are invalid as court had dismissed my wifes divorce hearing in October, 2018 properly as this case was 11 years old.\n\nMy wife then pointed her hand in the air as if she had a gun in her and with her finger gestured as if she pulling a trigger on a gun and told the court that I had went her house and unloaded a whole clip shooting up in the air, that the neighbors all had seen me do it. The judge got excited angrly stating \" he shot a gun that is a violation of the TRO\". I shouted \"Bullshit\" Judge said \"Pardon me\" and I shouted again \"Bullshit\":  The judge got upset and orders to move to the back of the court to pass the matter for everyone to cool off. When the judge recalled the matter I appologized to the court and then informed the Judge what set me off was his disposition had changed and was about to start typing computer he made me feel like he was going to take adverse action against me. I told the judge that my wife cannot come into a court and make serious allegations like me shooting a gun in public without any facts police reports witnesses sworn affidavits anything. The Judge then told my wife if she had a police report and witnesses my wife told the judge she has and she would get the police report. The judge granted me a six week continuation, and I reminded the court to remind my wife that she needs to bring a police report supporting her allegations. I am retrurning to court this month.\n\n&#x200B;\n\nEven with documented facts to support everything and fact that she cannot produce a police report on me for something I didnt do, and I no longer reside in the same county since January 2018. Even knowing I have the facts I know that these family courts with their black robed tyrants who change the rules as they go, violate rules of court and Civil Procedures by allowing my wife to get stipulation order extension of time on a matter that was dismissed I am digusted with corrupt judges who extort money from the fathers, these family courts destroy lives, and the judges that run them are nothing more than black robed tryants. My wife is guilty of fraud, and she came in with a stack of text messages from phone numbers that did not even belong to me and like all text messages there are cell phone applications that a person can uses to send themselves IM's or text messages to be sent from any cell number that they choose. Furthermore any and all orders that were granted by the family court are invalid as the case was dismissed. Change can only happen when the men in this country stand up and regain their rightful position in this country again, with all due respect to woman, shame on you for using this corrupt family court system to destroy fathers, then when your children are grown  up running a muck on the  streets remember its your faults for removing the father from the picture.\n\nAnd yes, screwing fathers out what little cash they have left, unable to provide for themselves is depressing and self defeating.",
    "title": "California Family Courts Run by Black Robed Tyrants",
    "subreddit": "MensRights",
    "timestamp": 1562440932,
    "score": 8,
    "keyword": "black judge"
  }
]