[
  {
    "text": "Job Hunting Tips/Considerations from a Recent Grad I am a recent grad who spent over half a year to find my first full-time job (Tech Consulting) and wanted to share some of my thoughts regarding recruiting for a new job in my context. I am a young professional and would like to see comments about how I can improve the following notes.\n\nApplications: 400+\nInterviews: 20+\n\n--\n\n**Job Hunting Tips**\n\n1.\t**Align your interests** – Explore and identify various careers and industries that interest you. This requires experience, research, or networking with other professionals. Additionally, bringing awareness to what you are NOT interested in is as important as knowing what truly excites you.\n\n2.\t**Recognize your value proposition** - View yourself as a brand and highlight the skills which you can sell to an organization to benefit their business operations (soft/technical skills). Distinguish yourself as the best fit candidate for a role by elaborating on your unique knowledge or experience.\n\n3.\t**Create a company database** - Develop a list of companies which peak your interest by researching their mission, values, business model, etc (LinkedIn.com, Glassdoor.com, Indeed.com). Then, organize the list appropriately to efficiently filter them during your application process.\n\n4.\t**Strategize your search** - Using job search engines such as Indeed.com and LinkedIn.com are great; however, these platforms often fail to retrieve numerous job postings! Therefore, by applying for job applications directly through company websites, you will have full coverage of the public job postings. As a result, you may have a higher probability to interview for positions which receive lower levels of public exposure.  Lastly, familiarize yourself with specific search terms relative to your interests such as the following: Associate, Entry-level, and Junior.\n\n5.\t**Take advantage of your network** - Once you familiarize yourself with a company and its respective job postings, distinguish whether you have connections to the organization through LinkedIn. Expressing your interests to a network of professionals already associated with the company and sharing job requisitions may enable you to directly reach out to hiring managers. However, acknowledge that a professional will only assist you given that he or she believes you are fit for the role, since your profile directly affects his or her reputation for future referrals!\n\n--\n\n**Important Considerations**\n\n1.\t**Don't close the door** - Apply for positions and companies above and below your ideal standard. It is possible that you may be interviewed for positions which you may feel are beyond your qualifications, but let the recruiters be the judge. Occasionally, recruiters forward resumes to other recruiters in the event that there is a job posting more suitable for your candidacy. Additionally, by participating numerous interviews, you will practice your interviewing skills and be more comfortable with the various processes.  \n\n2.\t**Preparation for perfection** - It is important that you practice your interview skills and be familiar with specific information regarding the company and the respective role. When interviewing, demonstrating your knowledge of the industry or company’s business operations will highlight your proactiveness as a candidate. \n \n3.\t**Reality vs Expectations** - It is important to be realistic with your expectations and capabilities when applying for a new job. Having high standards is important; however, be aware of the opportunity costs of chasing the ideal job. Thus, developing a timeline with milestones is a great way of keeping yourself accountable throughout the recruitment process.\n\n4.\t**A competitive pool** - You must acknowledge that each job posting potentially receives tens or hundreds of applications. Similar applicants may be applying for positions left and right each day; therefore, reflect upon your recruiting practices relative to the competitive pool.\n\n5.\t**Be persistent, not annoying** - When reaching out to a professional or recruiter, be certain that your tone expresses curiosity and excitement. Sometimes getting your foot in the door requires persistence and careful communication; however, be conscious of how you may be perceived on the other end.\n\n6.\t**Keep your calm** - After you have completed a step of the recruitment process and  are waiting for further instructions or information, try to focus your attention on other job opportunities. This is the time to be patient and allow the company to deliberate for further feedback. Remember, there is no harm to taking a break from applying to jobs and participating in various hobbies to momentarily clear your mind.\n\n7.\t**No written offer, no stopping** - Do NOT stop applying or participating in any recruitment process until you have received a documented offer. It is possible for an organization which has extended you a verbal offer to suddenly decide to rescind their invitation.\n\n8.\t**\"Resume Black Hole\"** - Applying for jobs may feel like countless hours of throwing your well written resume into a Black Hole. People often refer to recruiting as a “numbers game.” Although this may be a valid argument, it is probably still within your best interest to act strategically when on the job hunt. Lastly, searching for the next chapter of your career may be incredibly discouraging and upsetting; nevertheless, you must remain determined and gritty to succeed!",
    "title": "Job Hunting Tips/Considerations from a Recent Grad",
    "subreddit": "jobs",
    "timestamp": 1512450206,
    "score": 10,
    "keyword": "black judge"
  },
  {
    "text": "Trying to understand why I agreed to date my psychotic ex...... and really wishing that I hadn't Really need to get this off of my chest.............. The red flags were OBVIOUS, why did I waste my time?\n\nWe met last fall, in music fundamentals class at the local community college. Professor asked the class \"does everyone have their text book?\" \n\"No.... where's the book store?\" I announced to the professor and the whole class without much thought beyond transparency. There was a pause, professor blinked at least once and took a long few seconds to recover from his slight mental derailing. He answered with a helpful smile \"it's across the quad from the cafeteria.\" \n\nDuring first day introductions I noticed one person staring at me.... staring pretty hard.... plus staring is pretty hard to hide. So staring boy with the owl eyes approached my desk after class. He's wearing all black and has the longest black hair I've ever seen, so long it goes behind his knee caps. He says with a slight lisp \"I heard you don't know where the book store is, I could walk you there if you're not busy.\"\n\"Sure! That would be awesome! How nice of you to offer, thank you.\"\n\nBeau (pronounced Bo), my ex, was.. to be perfectly honest..... strange. very different from everyone else, but friendly with a heart of gold. He had a soft gentleness about him, made silly jokes, was always relaxed, listened intently and asked lots of questions. Not the type of person to judge anyone, more so the kind who gets judged by everyone as a \"freak\". His hair and finger nails were unusually long, he had a lisp, lacked confidence, carried a cloud of melancholy, was home schooled and wore finger less gloves. He was always true to himself, never caring if anyone else understood.\n\n\"Why judge this person? He's so kind. I'm open to making friends with anyone and everyone.\" That was the mentality that kept me walking with him after class, day after day, and saying yes when he asked for my phone number. \n\nOne day, we were sitting on a stone bench in between classes. I complimented his shoes, they were high top Vans with Disney's Alice in Wonderland characters floating on a black background. \"Thanks...\" he said \"... there's something I want to tell you.\" I stopped eating my banana in preparation for the news. He unrolled his tale: \"I contracted Limes Disease when I was 4 years old. It was left un-diagnosed until I was 15. When the disease effects someone that long, it begins altering their mind. I now have clinical depression and mild bi polar disorder and schizophrenia, as well as arthritis (the fingerless gloves have copper woven into them and actually help with stiff joints). All these things are side effects of the disease. I also had 20 surgeries in 19 years at UCLA to correct my clef lip and pallet. That's why I was home schooled.\"\n\nDamn. Can you really blame the guy? That's a rough childhood, medically. Seems like he'd really been through a lot and it deeply effected him, both mentally and physically. \n\nMaybe I felt bad for him, maybe I empathized with him. After all, he's not a monster. No one with a mental disorder is a monster just because they have a mental disorder. His news didn't change the fact that I enjoyed walking and talking with him after class. \n\nUnstable mental conditions happen to all of us at times in varying degrees, it's okay, it's natural. Brains and emotions are awesome and complex. That being said, I have an issue when someone begins making unstable decisions.\n\nWhat later ensued were, looking back upon it and reflecting, three MAJOR RED FLAGS that happened in a row. I should have listened to my gut and not continue to see this person. Instead I would urge myself to be less judgmental. But sometimes, we make instinctual ideas about someone for a reason. Maybe it's self preservation.\n\nLater that week he texts me, asking the address of where I work and what time. It seemed like harmless chit chat in the moment. ProTip: THIS IS TOO SPECIFIC OF A QUESTION TO BE CHIT CHAT, BE CAREFUL WHO YOU GIVE THIS INFORMATION TO! Beau shows up at my work at 5am....... first walking around the building, circling it a few times then after he realized we were closed he waited 1 + 1/2 hours until we opened. His behavior creeped out the regular early morning patrons of the cafe, my coworker and myself!!! He ordered food, ate it, then sat and watched me work.... I can't even describe how creepy his fixed look felt.... like something unclean was on my skin and I couldn't get away from it. I was so flustered and distracted that I asked to leave work. I asked Beau to follow my car back to my house, so I could properly explain how creepy his actions were, how uncomfortable he made me feel, and why I didn't think I wanted to continue our friendship. \n\nSo we get to my house. Protip: DON'T INVITE SOMEONE WITH STALKER BEHAVIOR BACK TO YOUR HOUSE, JUST SAYING, THEY'VE ALREADY DONE IT ONCE THE TRUST IS WEARING THIN. Hindsight is always 20/20. We start to chat and he explains that he has insomnia and because he was homeschooled and bed ridden most of his life, he's hardly made any friends. and he genuinely didn't realize how creepy his behavior was. Okay..... that reason was understandable, I suppose. But still, come on dude. I decide to not hold his actions against him and since I got the day off, we spend it listening to music and talking. Not sure what it was exactly, but something about Beau's personality charmed me that day. Did I mention what a fat crush this kid had on me? I thought to myself \"why not give this kid a chance? He's veeerrrrryyyyyy naive but has a good heart.\" \n\nWe decided to drive in his car to get sandwiches. Mostly, he wanted to show off his car since he built a lot of it himself and holds pride in maintaining it. We get less then one block from my house and Beau is shifting gears like a maniac. Suddenly we see a truck not quite making a U turn in front of us and flipping on his reverse lights to back up a little so he can complete his turn without hitting the curb. Yes, reversing was a dumb thing for this truck to be doing on a busy street. But Beau sees the reverse lights and instead of breaking he turns left- fucking left! into opposing traffic! Luckily, well not so lucky really but in comparison to how bad things could have been; lucky. Beau hits the middle divider and rips off his bumper while scrapping and flattening his tire. It was unreal. Looking back I should have recognized Beau's poor decision making, but I chalked the whole thing up to an accident and didn't hold the incident against him.\n\nAll these things happened in the same day... I shouldn't have deepened our friendship. this was an obvious indicator of what it's like to be around Beau. Why did I do it?\n\nWe continued hanging out as more then friends for another month. In that time I got an up-close look at his depression and other mental instabilities. He would talk in his sleep like no one I've ever known. Everything he said was loud, clear unsettling inner turmoil chatter. It was like hearing all of his deepest, darkest and most frightening thoughts..... I couldn't sleep next to him. I was freaked out at what I was hearing. Plus he would violently shake and spasm while he slept too. When we would be hanging out he'd randomly start crying, and not know why. he would text me or call me when he felt suicidal... at least once a day. he carried so many heavy feelings, it was weighing me down too. I began to feel trapped.... what if he killed himself because I broke up with him? He was that unstable...... \n\nBut enough was enough. I gave him so many life coaching tips about focusing on what he enjoys and all of the good things that were happening to him. he couldn't do it. Or maybe, he couldn't figure out how. I told him that the relationship wasn't enjoyable for me, and that he needed to work on himself. He asked me if I would stay with him if he saw a psychiatrist. I said yes...... but after another week I was still miserable, his presence was toxic. He had so much self-work that he needed to do on his own.\n\nThe break up was difficult.. he stalked me at work, school, cried on the phone for multiple days in a row. He sent relentless texts, voicemail and facebook messages asking for me back while simultaneously threatening suicide. It was so hard...... The only thing I could do was send him positivity that therapy and alone time will only strengthen him as an individual, and help him enjoy his life and eventually become stable enough to have a long lasting relationship with the right person. But that person was not me. He couldn't stop contacting me... I was his only friend. But he was exhausting, I couldn't be around him at all and had already given him too many chances... I blocked his phone number and all online social media. \n\nThen, he ran away from home. walking 26 miles with bare feet to come to my work and try to talk to me. Ironically for him, it was my day off... He told a coworker that he was homeless, he had no shoes and has been walking for 10 hours. I knew something was amiss, his parents coddled him and would never kick him out. I called them, and sure enough he had vanished after getting in a fight with his parents. They were worried sick and driving around all night. His dad told me \"We know that you don't want Beau contacting you anymore... We're sorry he keeps showing up at your work and in your life. we'll talk to him. and if he bothers you again; call the police.\" That was the last I heard from him..... that relationship was unsettling, toxic, heavy, unenjoyable.\n\nI ask myself; why did I do it? Why was I such a fool by ignoring the red flags?\n\nOut of curiosity and concern, I went to his twitter page today. He wrote a couple of days ago \"I doubt I'll ever get over you.\" Beau, I really wish you would. Moreover, I really, really wish I never dated you at all. If I could go back in time, I would have walked myself to the bookstore. Please heal, and be healthy Beau.",
    "title": "Trying to understand why I agreed to date my psychotic ex...... and really wishing that I hadn't",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1501835790,
    "score": 13,
    "keyword": "black judge"
  },
  {
    "text": "[Support] Haunted by childhood incidents, feelings of filth+sex, but no abuse. Looking for help **Edit for details and now it might need a [Trigger Warning]**\n\n\n\n   **what happened;** in case anyone is reading this:\n   I have this really deep-seated belief that I'm filthy,that it's inherent and present regardless of what I do, and that I'll make anyone who gets near me filthy, too. \n\n\n\n   I wish I could talk about it with certainty, instead of feeling like I'm shrugging my shoulders and pointing to what's most likely. \n\n\n\n   My parents had a really volatile relationship. There would be bouts of fighting, with screaming matches and nasty accusations (from what I remember when I was a teen), interspersed with splits or times when they were trying to get along. \n\n\n\n   My dad cheated in ways that linked him to words like \"non-consensual\", \"underage\", \"illegal.\" All that happened mostly outside of my awareness when I was growing up, but my mom had a temper and a tendency to fling accusations when she was angry. \n\n\n\n   When I was in second grade, I remember doing things involving sex and stripping with friends, which seems weird, and I know we didn't want to get caught.\n\n\n\n   When I was in fourth grade, I think, I had a there was a month, at least, where I felt like someone was listening inside my head. I think I sort of made up a friend to talk to inside my head, but I'd talk to them, all *nudge, nudge* ~I know you're listening. \nI don't know why that happened or when exactly it stopped.\n\n\n\n   There wasn't a lot of content control in what I watched/read etc growing up, and I ended up reading a lot of books with rape in them at a young age.\n\n\n\n   When I was in fourth or fifth grade, I made a friend who I ended up always being vehemently furious with, though she never did anything wrong. I kept the anger bottled up, but it was always there when we were together. Her dad made my skin crawl; he made me feel absolutely disgusting, but he never did a thing to me.\n\n\n\n   I started truly, deeply believing I was too old and it was too late for things to be okay when I was 9.\n\n\n\n   In sixth grade, I started having intense depression feelings and suicidal thoughts and began publicly hurting myself in school in hopes of getting some help. I had one or two black outs during minor, non-stressful situations that I can remember then. I stopped sleeping in my bed.\n\n\n\n   I snapped in seventh grade. I was hurting myself more intensely then, could barely let anyone touch me. I liked a boy, and I think I slept with his shirt in my bed because it made me feel safer. I don't even know about any of this mess.\n\n\n\n   The night he asked me out is when I snapped inside. The short version is I'd always sort of thought I had to be able/ willing to sell myself, meaning give guys what they want, meaning be brave enough to kiss guys, meaning I don't know what- because I was 12 and had intense anxiety issues- since I was 9-ish. So, cute boy asked me out, which I was okay with and wanted, because we were friends. He was nice, and he, himself, never scared me or made me feel dirty. He's the one that made me feel safer when I hugged him. Before he asked me out, a lot of it was nerves, because he had already had sex etc with his last girlfriend, and I was very, very shy. But, the problem wasn't in what he did.\n\n\n\n   He asked me out; I said yes; he gave me a peck on the lips, and I felt nothing but this frozen, numbing terror and sickness inside me. And, there was the snapping, I guess. I thought the fact that I didn't feel anything meant I could only feel things when something bad was happening. I thought it made me disgusting like \"them,\" but I don't know what \"them\" I was thinking of. I was a monster. I was convinced, there was a twisted, sickness deep inside of me, and I couldn't let anyone know. It covered my skin, and I was sure anyone who looked at me would be able to see it. I broke up with the boy a few hours later, and I shut down.\n\n\n\n   I stopped talking to my friends, mostly, I was so ashamed in school, that everyone would see what a monster I was. I had panic attacks in school. I had mornings where I'd find myself in a lump on the floor, aching in the worst way, so afraid the sickness would break out or something. I spent some weeks obsessed with the concept of starving myself into a skeleton or eating until I was ballooned, because either way no one would ever touch me, and I couldn't let anyone ever touch me.\n\n\n\n   That same boy told me later in the year about times I'd come up to him in school to talk to him, where I'd talk about hurting myself (I was still self harming) but I had absolutely no memories of these moments, even when he would tell me te day they happened. He asked me out in the winter, and I remember a day in the spring, in the afternoon at school, where I was walking through the halls, and I just sort of didn't know where exactly the time had gone, in a strange way. I don't know.\n\n\n\n   By the next year, I couldn't look anyone in the eye. I couldn't make words come out of my mouth, even when I desperately wanted someone to ask me how I was so I could ask for help. I had panic attacks multiple times a day in school. I barely left the house. \n\n\n\n   My mom asked if I had PTSD, but I only associated that with 9/11 and war, and I didn't understand, so I said no. \n\n\n\n   I could never be honest with the one therapist she tried to get me to see when I was in ninth grade. It kind of felt like he was making fun of me, but that might have been teen angst. I do remember one therapy session where I sort of came to awareness hunched over with my hands over my ears and my eyes closed tight. He and my mom were both there and were trying to talk to me. I'm pretty sure some of the session must have been about my poor performance in school. I don't know why I sort of blacked out, or whatever.\n\nWhen I was 19, some of my friends, who I thought were sensible, told me they thought rape was the victims fault. They said it, just so matter of fact, and I couldn't stop crying for two days. Not always sobbing, but these streaming tears I just couldn't stop because it *hurt.*\n\n   I guess that's all I can remember right now. Like I said, nothing ever happened to me. I probably just read the wrong book at a bad age and heard my parents say weird shit. I don't know. But it's still like that same filthy sickness is inside me and covering me skin, and I guess I just don't know how to get rid of it, because nothing ever happened to me.\n\n\n\n   I'm very confused, and I'd love any help.\n\n\n\n   Please forgive typos and terrible grammar/punctuation and my complete inability to format this nicely, because I am trying, but it isn't sticking.\n___________________________________________\n\n\n   I'm not sure how to start this or what to say. \n\n\n   I want to see a therapist or call a crisis hotline for sexual assault or abuse, but I don't think what I'm dealing with counts as anything like that. It's from when I was a kid, but I never remembered any one touching me. I don't remember specific abuse, assault, violence.\n\n\n   I just had strange things happen, and some were shameful and some never seemed strange at all, until years after. I had a moment when I was 13 where I sort of snapped, and I kind of broke inside my head, and my word crumbled, and I've never recovered from that. I've never told anyone about it. Not in specifics, not all of it, but, again, none of it counts.\n\n\n   I used to tell myself, all the time, from a few months after the snap happened up til now, that if I just write it all down, all of it, get it out on paper, I could make it make sense, and it will stop infecting me and haunting me. I've never, ever been able to do it.\n\n\n   I tried to tell a friend once, about 5 years after the snap happened, and, without meaning to, lies just flowed right out of my mouth, because the situation is and was so embarrassing and pathetic.\n\n\n   Right here, what I'm writing, I'm still not talking in specifics, because how can you talk in specifics about something that made you filthy, when it came from inside, when you did it to yourself? But I still don't understand what happened.\n\n\n   I was only able to start thinking of talking about it  about three years ago, 8 years after the snap, when I was about 21. I don't have anyone I can trust not to tell other people or to judge me. I don't know where to go, what to do. It's eating me alive, and I don't know what to do. I'm not able to access any therapy right now, which is why I'm here.\n\n\n   I have memories of my third birthday, of being five and six and onward, so I don't think I have missing chunks of memories. I had blackouts starting a year before the snap. I don't remember anyone ever hurting me. It doesn't count as any kind of sexual abuse. \n\n\n   Is there anywhere I can go to talk? It feels like a sexual assault hotline would be the place, but what happened to me doesn't count. \n\n\n   I'm too scared to even write it here, because I know it wasn't real. It was me being weak and things I don't understand.  I'm afraid some one might recognize it, too, however rare the possibility may be. But I really need somewhere to let this out, because I've been trying to work on a Cognitive Processing Therapy workbook about it by myself, and I am not okay. I need help. Where do you go when you need help, but you're the monster?\n\n   Please help. \n\n\n   I don't know if I'm asking for somebody to tell me it's okay to write about things I felt and did and had happen that revolved around filth+sex here for some kind of guidance, or if I'm looking to be pointed towards a hotline or a forum. I know that most of the text of this post is just confusing, but I feel so stupid typing out what actually happened, because it wasn't anything. So, I don't know what to do.",
    "title": "[Support] Haunted by childhood incidents, feelings of filth+sex, but no abuse. Looking for help",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1490386389,
    "score": 8,
    "keyword": "black judge"
  },
  {
    "text": "I've lived in Iran and in the U.S. Anti-feminists on both sides mirror (and feed off of) each other. Warning: Long post.\n\nI grew up in Iran but moved to the U.S. about a decade ago. You can say I've seen \"both sides of the coin\" as far as societal attitudes towards feminism is concerned. Here are some of my observations:\n\n* Here in the U.S. you often see people admonishing feminists for focusing on \"first-world problems,\" while women in developing countries are grappling with much more serious issues. \n\n\n    You might be surprised to know that a very similar argument is used against women's rights activists in Iran, not necessarily by the state, but by conservatives at large. Iranian feminists are told that their focus on the mandatory dress-code (including hijab), on [the right to ride bicycles in public](http://www.bbc.com/news/world-middle-east-37430493), or on [the right to enter sports stadiums](https://www.hrw.org/news/2016/06/30/banned-stadiums-being-woman-iran) is frivolous. \"What's the big deal about wearing a scarf on your head?\" \"Are you so defined by your attire that a piece of cloth is going to oppress you?\" \"You are diverting attention from real issues by focusing on getting women to stadiums.\" \"Not everyone can afford a bicycle. This is merely a middle-class issue.\"\n\n\n    Iranian women are also told they should be thankful to live in a state that keeps them safe from ISIS, because things could be a lot worse. Sound familiar?  \n\n* Statistics around issues like the wage gap, rape, and male-on-female violence have been contested over and over again in the U.S. They are called bogus, misrepresentative, and at best inconclusive. Meanwhile, statistics on mortality, longevity and well-being are used to show that American women have it better than men. \n\n\n    You'd think anti-feminists couldn't use the same argument in Iran, but they do. Longevity is similarly female-skewed in Iran ([and in most countries of the world](https://en.wikipedia.org/wiki/List_of_countries_by_life_expectancy#List_by_the_OECD_.282013.29)). So we're often asked: \"how come you live longer if you're so oppressed?\" These anti-feminists point out that [Iranian women have a higher penetration in STEM fields than American women](https://www.forbes.com/sites/amyguttman/2015/12/09/set-to-take-over-tech-70-of-irans-science-and-engineering-students-are-women/#7b9d107e44de). That Iranian women are not subject to compulsory national service, as opposed to some developed countries such as Norway. That Iranian women are [less likely to have body-image issues](http://www.npr.org/sections/goatsandsoda/2014/09/15/347083281/covering-up-with-the-hijab-may-aid-womens-body-image). In a way, we're told that we have it better than some Western women in some aspects, so we should stop being greedy about pursuing other aspects. Sound familiar? \n \n* Iran's theocratic regime has often argued that women have a natural tendency to nurture, and therefore need to stay home and take care of their children. Recently, they've discovered the fields of evolutionary/developmental psychology/biology and try to argue this point from a \"scientific\" perspective ([non-English link 1](http://webcache.googleusercontent.com/search?q=cache:iILWu2n5hOEJ:www.tebyan-zn.ir/News-Article/zanan/2010/10/10/5607.html+&cd=12&hl=en&ct=clnk&gl=us), [non-English link 2](https://www.youtube.com/watch?v=Mi0JZm_2vbc)). [Sound familiar](https://twitter.com/charlesmurray/status/837287933312909313)?\n\n* In the U.S., some people argue that family courts unfairly favor women, especially in issues related to custody and child support. You might be surprised to hear that there are similar arguments in Iran, not around custody (which almost always favors the father), but around [Mahr](https://en.wikipedia.org/wiki/Mahr). Anti-feminists have vehemently opposed and dismissed the mandatory Mahr payout as a law that disadvantages men, conveniently forgetting that the scale is tipped the other way in almost any other legal issue. \n \n* The red-piller ideology has also found its following in Iran (and other countries I imagine). I've seen an increasing number of my old college mates and friends turn to red-pill/mgtow-type communities, especially on reddit. They even have a prophet (Roosh-V, who was born to Iranian parents). You might wonder, what makes them think they're disadvantaged and oppressed by feminists, despite living in country where a woman is literally worth half a men ([+](http://iranhrdc.org/english/publications/legal-commentary/1000000261-gender-inequality-and-discrimination-the-case-of-iranian-women.html#3), [+](http://iranhrdc.org/english/publications/legal-commentary/1000000261-gender-inequality-and-discrimination-the-case-of-iranian-women.html#22))? Is the illusion of victimhood so pervasive that it can elude some of the most gender-privileged people on the planet?  \n\n* The Islamic Republic has repeatedly accused women's rights activists of being Western stooges, for defending Iranian women's right to dress as they choose. Feminists in the West are repeatedly called terrorist sympathizers for defending Muslim women's right to dress as they choose. Both arguments twist the reality and turn a very simple issue (the right to choose your attire) into a tool for geo-political conflict. \n\nI expect some of you to say: but anti-feminists in the U.S. *do* have more convincing points, seeing that their country doesn't deprive women of their most basic rights. The ridiculous rhetoric of anti-feminists in Iran doesn't undermine the fair points raised by anti-feminists in the U.S.\n\nWell I do agree that objectively and definitively, Iranian law is far\nmore backwards in terms of gender equality. But there are three points to keep in mind:\n\n1. U.S. law didn't use to be very progressive either. Progressive ideas had to be argued into the law, by people who fought for them. The law often doesn't change as long as public opinion around it doesn't start to change. In that sense, anti-feminist rhetoric in the U.S. is not as innocuous as it's made out to be. I'm sure 100 years ago when women did not have the right to vote, most people were able to rationalize it as a necessary disadvantage for women, similar to how denying women a decent maternity leave is rationalized now. \n\n2. It's always easier to judge a nation from the outside. But when you live inside a country, you are exposed to the nuances and complexities of social issues, and might lose sight of the big picture. For instance, a Swedish citizen might view the U.S. as remarkably backwards in terms of gender equality, when it comes to access to abortion and affordable healthcare, violence against women, representation in politics, etc. But to some people living in the U.S. the issue is not \"so black and white\" (to use a phrase so cherished by anti-feminists). Iranian anti-feminists use the same argument (\"it's not as black and white as the West would like to portray\") to justify their incredibly backwards ideas. Sometimes it's good to take a step back to look at the big picture. \n\n3. The Iranian regime has learned to play the Westerners' rhetorical game really well. For instance: studies [have shown](https://www.theguardian.com/education/2009/mar/18/secondary-schools-girls-gcse-results) that girls perform better if they study in gender-segregated schools. The Iranian regime has flaunted these statistics in defending its segregation policies, *as if they segregated schools to help girls succeed.* This type of hypocrisy can be illuminating when inequality (in any context) is discussed: **It's not enough when things work out. Things have to work out** ***for the right reasons.***\n\nIn conclusion, I think it's important to look at the global context when issues of women's rights are concerned, and it's also important to see beyond the rhetoric.",
    "title": "I've lived in Iran and in the U.S. Anti-feminists on both sides mirror (and feed off of) each other.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488838700,
    "score": 8,
    "keyword": "black judge"
  },
  {
    "text": "Anxious over college (f26) after being bullied. English is not my first language.\n\nI'm 26 and I'm back to college because I felt like i need a new start and focus on my career (dont want to be a cashier all my life). I dropped high school when I was 16 due bullying and depression. I have always been bullied. I'm not overweight and even though beauty is in the eye of the beholder i'm what is considered attractive by society standards.  However, I have always been this socially awkward kid who liked indie music and wore black... and this gave me trouble. I got bullied in high school for being very quiet and also I got bullied in some after school classes my mom got me because my bad grades even though I went with different people and all. No need to say I didnt had any friends.  But I'm not this quiet goth girl anymore! I have been working in the past years in my confidence, I'm learning to love myself (this is hard), know what i worth, work hard for my future and education. I've got my savings, I take my responsabilities. \n\nBefore getting in college this year I tried a few years ago to take a course. I went with such a positive mind, I was always smiling, trying to be friendly and nice... I started conversations, asked questions and I presented myself as friendly as possible yet I felt like people only talked to me because I talked to them first. I got interested in the people I talked to, asking them questions and remembered facts about them they told me before yet nobody got interested in me. However,  the group of people i tried to blend with in class decided to isolate me at some point, exclude me from everything... this hurt me so bad. Like, even with my best smile and a positive mind people reject me. Sometimes I wonder why, if I'm  maybe boring or annoying or weird. *Like whats wrong with me that I repulse people?*\n\nSo, I just started college and I'm one of oldest people in class and yesterday a teacher pointed  my age in front of everyone and asked me \"*what i just did with my life*?\" and if \"*i have any work experience*\" like, suggesting I'm a lazy fuck or something? \n\nI'm **VERY** anxious every day I go to class. Like every day i think i could make a small mistake and be bullied again. My heart beats very fast every time a teacher ask me to present myself. I feel terryfied by my classmates. I just have no idea what to do? Should I talk to them? Should I mind my own business? Seriously, I do like talking to people and I enjoy company but I just dont want to be rejected anymore. I feel like all my classmates are judging me and laughing at me. I feel so much pressure and stress and this is exhausting. \nI'm a person who have been hurt very bad. I've got so much rage inside of me (I try to work on this these days) and this situation is just emotionally exhausting.",
    "title": "Anxious over college (f26) after being bullied.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1506451944,
    "score": 4,
    "keyword": "black judge"
  },
  {
    "text": "Kinda dumb question about exhibit and deposition citations Doing the summer thing right now.  One person at my firm has a peculiar way of citing to deposition transcripts and exhibits, and I was hoping to confirm which of us is crazy.\n\nSay you have a deposition by John Black.  Their rule is that you cite like this:\n\n*See* Black Deposition Transcript at 55:16-18, attached hereto as **Exhibit A.**\n\nIf that same transcript comes up again, they insist that I cite it as:\n\n*See* Black Dep., **Ex. A**, at 16:24-36.\n\nSo they require that everything is cited as the person's name, deposition, exhibit letter, and pin-cite, every time.  They also insist that \"*Ex. X*\" be bolded every time.\n\nThis lawyer says that it's to help the judge/clerk find things--rather than having to memorize a list of 32 exhibits or 32 deposed names, he says that this method lets a judge jump straight to the relevant area.  It seems strange, but when I went looking for other examples, I see a broad range of citation techniques to exhibits/depositions/deposition exhibits.\n\nFor what it's worth, this firm mostly does state-level trial stuff, but across 5 various states.",
    "title": "Kinda dumb question about exhibit and deposition citations",
    "subreddit": "LawSchool",
    "timestamp": 1498576637,
    "score": 1,
    "keyword": "black judge"
  },
  {
    "text": "Federal Judge Breaking Law in Her Clerkship Comment? Hey all,\n\nI am currently applying to clerkships, and I just came across this gem from Federal Judge Victoria Roberts: \"My preference is to hire clerks with ties to Detroit, to BALSA and to Just The Beginning.\" She posted this on Oscar.\n\nBALSA= Black American Law Students Association. So, she is actually saying: \"I prefer to hire black clerks.\" How is this legal? I understand how race can be looked up as a \"plus\" factor as a key to diversity, etc. But it seems highly unconstitutional/illegal for a person working in the federal government to flat out say: \"I prefer to hire black people\" for this government job. Thoughts?",
    "title": "Federal Judge Breaking Law in Her Clerkship Comment?",
    "subreddit": "LawSchool",
    "timestamp": 1500086159,
    "score": 0,
    "keyword": "black judge"
  },
  {
    "text": "A Black Woman, Judge Deborah Robinson, Will Hear the Manafort Case; Watch the BS Begin",
    "title": "A Black Woman, Judge Deborah Robinson, Will Hear the Manafort Case; Watch the BS Begin",
    "subreddit": "blackladies",
    "timestamp": 1509476258,
    "score": 74,
    "keyword": "black judge"
  },
  {
    "text": "Why the Election of 9 Black Female Judges in Alabama Matters",
    "title": "Why the Election of 9 Black Female Judges in Alabama Matters",
    "subreddit": "blackladies",
    "timestamp": 1485964709,
    "score": 36,
    "keyword": "black judge"
  },
  {
    "text": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts https://sanfrancisco.cbslocal.com/2017/11/30/judge-suspensions-ok-albany-high-students-racist-posts/\n\nSAN FRANCISCO (AP) — An East Bay school district acted properly when it suspended five students who “liked” or commented on racist images on another student’s Instagram account that included nooses drawn around the necks of a black student and coach and comparisons of African-American women and students to gorillas, a judge has ruled.\n\nThe case raised thorny questions about how strictly schools can regulate student speech and whether “likes” on social media should be treated similarly to the original posts.\n\nU.S. District Judge James Donato said in his decision late Wednesday the five students contributed to disruption at Albany High School in the San Francisco Bay Area.\n\nThe judge rejected arguments that the Albany Unified School District violated the students’ free speech rights because the offensive posts were on a private account and made off campus.\n\nDonato said the accounts’ followers were mainly Albany High School students. The posts pictured students and school employees and created a risk of substantial disruption at the school, the judge said.\n\n“These cases establish that students have the right to be free of online posts that denigrate their race, ethnicity or physical appearance, or threaten violence,” he said. “They have an equivalent right to enjoy an education in a civil, secure, and safe school environment.”\n\nAn attorney for three of the students had no immediate comment. An attorney for the other two, Darryl Yorkey, said “liking” images does not necessarily express approval.\n\n“I think the judge took an opinion that many of us do in the older generations in assuming that a ‘like’ on its face is just that, ‘I like it, I approve of it,'” he said.\n\nHe said many of the students who were suspended over the images were Asian and were just trying to shock each other.\n\n“Taken out of that context, it definitely looks really bad,” he said. He did not immediately know whether his clients would appeal Donato’s ruling.\n\nA phone message left with the school district seeking comment on the ruling was not immediately returned.\n\nA male student identified in court documents only as “C.E.” created the account in November 2016 and posted on it over the next several months.\n\nOne post showed a screenshot of a female African American student that she had captioned, “I wanna go back to the old way.”\n\nC.E. juxtaposed an image on the student’s post of a white man beating a black slave hung by his hands, according to Donato’s ruling.\n\nSchool officials learned about the account in March. They called in mental health counselors to help calm students and contacted police over concerns references to lynching, nooses and the Ku Klux Klan in the posts could constitute threats of violence, Donato said.\n\nC.E. was suspended and later expelled. Donato upheld his discipline as well on Wednesday.\n\nBut the judge said the district went too far when it disciplined two other students. One followed the account but appeared to have done nothing else and the other commented that the account was “racism solely directed at black people” with an emoji of a laughing face, the judge said.\n\nThe judge overturned their suspensions.",
    "title": "Judge: Suspensions OK For Albany High Students Who ‘Liked’ Racist Posts",
    "subreddit": "blackladies",
    "timestamp": 1512146276,
    "score": 27,
    "keyword": "black judge"
  },
  {
    "text": "Judge Robart's Misandrist Insanity James Robart is the Seattle District Judge who, in an act of pure insanity, barred a male plaintiff from access to his female accuser's text messages because that \"would impose emotional and psychological trauma\" on the female.   \n\nhttp://reason.com/blog/2017/01/31/amherst-student-expelled-for-sexual-misc\n\nThis is apparently the same judge who cites Black Lives Matter and the same judge who, without offering legal justification, applied a restraining order nationally to the Presidential Executive Order temporarily suspending immigration from seven countries.   \n\nThe judge is a disgrace to the bench. However, I do not understand why the college student's issue with Amherst is being heard in Seattle. Can anyone explain?",
    "title": "Judge Robart's Misandrist Insanity",
    "subreddit": "MensRights",
    "timestamp": 1486288914,
    "score": 14,
    "keyword": "black judge"
  },
  {
    "text": "Men's right of cross-examination being removed under conservative manifesto when accused with a sexual crime aka crimes against women. And some other lowlights... >*Conservative Manifesto*  \n• \"We will ensure that child victims and ***victims of sexual violence are able to be cross-examined before their trial without*** the distress of ***having to appear in court.\"***  \n• \"...A government unafraid to confront the burning injustices of the gender pay gap\"  \n• \" If you are black, you are treated more harshly by the criminal justice system than if you are white\" < No mention of men being treated more harshly than women which is a greater disparity.    \n• \" If you are a woman, you will earn less than a man\" < outright lies  \n• \"We will continue to lead a global campaign for the education of women and girls, which is the key to progress in so many countries.\" < but not men and boys apparently  \n• \"We shall continue to work for parity in the number of public appointments going to women, and we shall push for an increase in the number of women sitting on boards of companies\"\n  \nUnfortunately the other parties have about the same or worse pledges that increase the inequality of treatment of the sexes and increase in female privilege.  \nEdit: I mistakenly forgot to add 'live' cross-examination. Cross-examination will happen but it won't happen in court in front of the judge or jury but on a pre-recorded setting",
    "title": "Men's right of cross-examination being removed under conservative manifesto when accused with a sexual crime aka crimes against women. And some other lowlights...",
    "subreddit": "MensRights",
    "timestamp": 1495208667,
    "score": 15,
    "keyword": "black judge"
  },
  {
    "text": "Police brutality Hello Reddit and thank you for your posts and support in my post about what has happened with my family. Sadly a month ago something else happened to me which has really screwed my life up. \n\nThe first week of June I was trying to help my friend get his driving license and he had to go to court to pay off a ticket from 2007. We got sent around to various court building until we got to the one which had the information on file. We were harassed by capital police from the start as my friend is a smoker and was told to smoke before he went in he would have to go out into the middle of the street to smoke. Fair enough we follow their rules and he put his cigarette out. We then proceeded to go inside of the courthouse. It's important to note that my friend has PTSD because the guard touched him a number of times and he asked that he not be touched because of his condition. Instead of the guard ignored this request. At this point guard from the other courthouse which was on the other side of the building came over and began to give my friend a hard time because he was asking questions about being touched and what gave the guard the right to touch him despite his PTSD. I was in searched and brought into the courthouse and I was likewise touched except aggressively because I was with my friend.\n\nIt's important to note that I am crippled and walk with a cane because I have fibromyalgia and I also have an anxiety disorder where any situation of extreme stress I can have what is known as a pseudoseizure. Once I was inside the court room I witness my friend still continuing to ask questions of the guard in a calm and civil manner until a minute or so later when the guard sick of being questioned instructed us that we had to leave. My friend was escorted out of the building and I having no business there and being the driver followed only to find the way outside to be blocked by the guards requiring me and him to go through them to get to our car. By this point multiple state troopers had joined in and I could tell that something was very wrong. I said to the officers \"thank you very much for your service, you are an asset to the community we have to go\" and I proceeded to walk to my vehicle which was 5 yards away in the handicapped parking spot in front of the building. I heard the officer from the other court who had been harassing my friend shout \"do you think you are going to get away with that\". I did not reply, I did not turn back, I did not even acknowledge it was said to me and proceeded to my vehicle. I placed my cane under my arm as I usually do so I can unlock the car and work the handle at the same time balancing on my good leg.however before I could put the key in the door the harassing officer grab my keys in my hand. My natural response was to turn to the officer and question what he was doing and why. From the other side my keys were grabbed by another officer and I turned to face him in my confusion and unbeknownst to me I had been surrounded by six officers. They had already stopped refrain from following me or crying out to me at the courthouse door. I was grabbed from behind and brutally assaulted. It was only after I had been slammed against my car and beat him to the ground that I was told that I was under arrest. I was also beaten while I was on the ground and had my head slammed into the pavement so hard that it cracked my safety glasses which are used for cutting grass and such. My friend was told that he was to sit on the curb and if he got up from the curb he would be tazed or shot. While they were attempting to retain me they threaten to tase or shoot me which I responded by saying that because I had a history of seizures and some strokes that either one would kill me. To inflict extra pain they cross my arms behind my back and cussed me that way so I could not untie my arms. \n\nHere is where my memory is foggy in the blanks filled in by my friend who witnessed this. My memory is foggy because I had a seizure as well as the concussion and was taken to the hospital but because they thought that I was faking they were beating on my chest so hard that it bruised my sternum. They were rolling my unconscious body around on the ground and my friend said that my hands were blue from lack of circulation. \n\nI regain consciousness in the hospital and I was in an extreme amount of pain. Testing was done on my head but no other testing or treatment was given to me despite having blood soaked clothes that were stuck to me by my own blood. I was given a strong sedative for the pain and secured sectional hospital with an officer monitoring me the entire time. I was then taking to lock up in my mother's car because I simply could not walk and she had a large enough SUV to transport me without an ambulance.\n\nWhen people arrived at this facility they were asked which can they use to write with and everyone except for me have the opposite handcuffed. I had my dominant writing hand handcuffed and I had all the paperwork brought in one page at a time and had my wrist crushed in the restraint which tied me to the bench sitting up every time. If not for my extremely poor health the judge wanted to have me sent to prison with a $100,000 cash bail. I have been charged with a number of things including 2 counts second-degree assault of a police officer. 2nd° assault of an officer basically means that while an answer was detaining you they suffered some kind of injury which in this case amounted to minor scrapes if anything. They also claimed that the inciting incident was a racial one and insisted that I had called the black officer a \"nigger\". \n\nThis is wrong on so many different levels that I cannot begin to describe it. I did nothing wrong I said nothing racial and yet I was legally viciously assaulted. Since then I have been bound to my wheelchair most of the time. I can't really walk very well anymore. This is wrong and needs to stop.",
    "title": "Police brutality",
    "subreddit": "MensRights",
    "timestamp": 1500415401,
    "score": 12,
    "keyword": "black judge"
  },
  {
    "text": "The disposability of men: \"Long Black Veil\", the ultimate White Knight anthem **\"She stood in the crowd and shed not a tear\"**\n\nI'm a working musician and the band leader is going to do Long Black Veil so I need to learn it. It's covered by every male roots artist at some point in their career. [Johnny Cash](https://www.youtube.com/watch?v=5pYA46dyKh4), [Mick Jagger](https://www.youtube.com/watch?v=4F-4rY4g4Do), [The Black Crowes](https://www.youtube.com/watch?v=IvwlMoeqURk) ... you get the idea.\n\nIt's an homage to male disposability. The core idea: a woman's honor is worth dying for. Literally, a man's life is equal in value to a woman's reputation.\n\n**Lyrics**\n\n    Ten years ago, on a cold dark night\n    Someone was killed, 'neath the town hall light\n    There were few at the scene, but they all agreed\n    That the man who ran, looked a lot like me\n    \n    The judge said son, what is your alibi\n    If you were somewhere else, then you won't have to die\n    I spoke not a word, thou it meant my life\n    For I'd been in the arms of my best friend's wife\n    \n    She walks these hills in a long black veil\n    She visits my grave when the night winds wail\n    Nobody knows, nobody sees\n    Nobody knows but me\n    \n    Oh, the scaffold is high and eternity's near\n    She stood in the crowd and shed not a tear\n    But late at night, when the north wind blows\n    In a long black veil, she cries ov're my bones\n\n    She walks these hills in a long black veil\n    She visits my grave when the night winds wail\n    Nobody knows, nobody sees\n    Nobody knows but me\n\nhttps://en.wikipedia.org/wiki/Long_Black_Veil",
    "title": "The disposability of men: \"Long Black Veil\", the ultimate White Knight anthem",
    "subreddit": "MensRights",
    "timestamp": 1498856967,
    "score": 6,
    "keyword": "black judge"
  },
  {
    "text": "Oooh boy, need a hand in an argument Feminist argument, to my response that the movement is giving them a bad rep and she retorts the extremists don't represent feminism. I was woefully exhausted after preparing/being super social for an Easter Dinner today (plus meetings and other bs) so I probably came across as pretty dumb/incoherent but here's the conversation as promised nonetheless:\n\n\nMe: Man, glad someone else decent lives in town\n\nHer: Losing hope were you? I sure was.\n\nMe: I was getting there, lots of pride and feminist crazed people downtown that Iv'e run into, never mind alcoholics and druggies.\n\nHer: Ah. We've hit an impasse. I'm an alcoholic and a druggie\nKidding obviously\nBut I'm proudly feminist. And if tehre is a problem with that then I have a big problem with you.\n\nMe: Well, there are benign feminists who believe in equality I suppose. The movement at large sure gives them a bad rep though.\n\nHer: Haha\n\nMe: ?\n\nHer: I'll ttyl\n\nMe: Did I drive you off? I don't hate feminists, I've just run into quite a few who really go over the top. Calling for male genocide and other ridiculous stuff.\n\nher: Your complete misunderstanding of the \"movement\" and willingness to totally throw my ideologies to the wind drove me off ,yes. Funny how you complain about people in the city being awful and here you are as small minded and bigoted as the rest of them! Ha! For your information the belief in equality isn't \"benign\". It IS the movement. Those \"Crazed\" and extreme morons who refuse to shave their legs and call for male genocide are extremists and stupid. They do NOT represent feminism.\n\nMe: Throw your  ideology to the wind? The public faces of feminism have been misrepresenting stats and pushing an agenda. I don't expect all feminists to be the same but it's sad to see a great movement be dragged through the mud by people who command media attention\n\nHer: Do you believe that all muslims are evil because some extremists terrorize the world?\n\nMe: Well, we agree that they're extremists at least, and that feminists believe in equality. (not typed here, but I was thinking belief and action were *very* separate) I don't believe all Muslims are extremists but I do think passing a law banning islamophobia is absurd and ill defined. (I live in Canada)\n\nHer: \"public faces of feminism\" Because the only information you have on feminism is what you see in the public media. Because you've never taken the time to understand the basic and raw notions of what feminism actually is. No, you don't believe that feminists believe in equality. You believe that those of us who believe in equality are \"benign\". What a joke!\n\nMe: The public faces are the same ones responsible for writing laws, so naturally I should try to pay attention to them :/\n\nHer: Name One CREDIBLE public face of feminism who has written or passed some absured law that takes credibility from feminism?\n\nMe: Well, Australia's Cabinet for one (I couldn't remember her name, but she thoroughly embarrassed herself recently.)\n\nHer: Australia is the first country in the world to give women both the right to vote and hold national office. I can't imagine what else you're against.\n\nMe: They aren't the first..\n\nher: Yes. They are.\n\nMe: US and Canada have had female minsters and nearly a female president more recently.\n\nHer: Lmao. Not once did I say that Australia was the first country to have a female  leader.\n\nMe: Nothing is barring a woman from holding office in NA at least.\n\nHer: The USA has never had a female leader. \"nearly\" doesn't count. And I NEVER said they couldn't.\n\nMe: Minister, not Prime Minister. My point is, women do have the right.\n\nHer: Do you know when women earned the right to vote and hold FEDERAL office in Canada? Because it was 1902 in Australia.\n\nMe: Probably in the 70s for NA then, suffragettes took off in the 60s (not typed, but was just a big iirc moment)\n\nHer: I can't even continue this conversation right now. You're honestly wose than most of the people in this city. Telling me that you \"guess\" believing in equality makes me a \"benign\" feminist. And it's not about our fucking right to do anything, it's about equality. SEVENTY YEARS LATER.\n\nMe: Also, what does that have to do with present day?\n\nHer: And the right to vote was before the right to hold office. So the past is moot?\n\nMe: It's long before either of our life times. Fighting world war 2 long after it's over would seem a poor place to put your efforts.\n\nHer: So because civil rights happened in the 60s we should forget about it? Because residential schooling ended 30+ years ago we should forget that happened too? Or the holocaust... Completely ignore it ever happened because it was before our time?\n\nMe: Not forget about it completely your taking what I'm saying and blowing it up. There is no wage gap, glass cieling, or oppression. At least no in first world countries.\n\nHer: No. I'm not. Your discrediting a movement for EQUALITY because you've had bad experiences. That isn't because feminism exists. It's because you put yourself in the company of idiots. Feminism isn't completely about women's rights either. It's EQUALITY FOR ALL. Another think you'd know if you had half the brain to take your own understanding to it. Are. You. Fucking. Kidding. Me. No oppression? I'm sorry, what laws exist around your reproductive rights?\n\nMe: I don't have reproductive rights lol. It's literally woman's choice in just about anything sex or children related. My choice is whether or not to abstain or get cut, that's about it.\n\nHer: What rock are you hiding under? There are laws legislation what women can and can't do with their bodies. Abortion, Birth Control, etc.. Your choice. Exactly. You fucking have a choice. There are places where women have no choice.\n\nMe: Abortion is legal in Canad at least, birth control is medication.\n\nHer: It's not legal everywhere, Feminism is bigger than Canada.\n\nMe: Also you have the exact same choices and more, regarding abstaining or being tied. Bonus, getting tied is reversible.\n\nHer: And birth control is not covered in the same way other medication is. Do you know you're more likely to be covered for Viagra tn an Birth Control? (note: I think she meant than she/women are to be covered for B.C.)\n\nMe: Find that hard to believe, women take birth control for everything from mood swings to \"general health\"\n\nHer: Omg. you're fucking impossible. What the fuck do you consider \"general health\"? Birth control regulates hormones that can cause various cancers if left unchecked, it can prevent uterine and cervical cancer, and regulate blood pressure. Mood swings can be a side effect of abnormal hormonal activity which can be a side effect of deadly health conditions.\n\nMe: Where are you going with this, exactly? (at this point I had felt like the goal posts were moving often and I had no \"finish line\" plus I was tired af and this conversation was getting nowhere.)\n\nHer: And guess what? I'm only covered for $100/yr for my birth control and it costs $90/yr because insurance companies view it as a pregnancy preventative. Correcting your fucking statement that it's for mood swings and \"general health\"\n\nMe: Okay?\n\nHer: Sorry, $90/3 mo. Don't tell me that women everywhere have the same rights when it comes to reproductive health\n\nMe: It's shitty on both sides, this whole me vs you makes no sense. You think I like being treated like a walking rapist/criminal waiting to happen any more than you like buying tampons and getting stared at? Men are being demonized and made the laughing stock of society.\n\nHer: Then stop making it me vs you. I'm trying to explain that feminism is about EQUALITY. YOU are the one attacking the female gender claiming all who associate as feminists are crazy and it's all about male vs female and we all hate men. There you go again pinning the genders against each other!!!!! When did I ever say men were all rapists criminals? Chances are you know one too many extreme morons who call themselves feminists but you buy into that without doing any of your own research into it. Buying tampons means fuck all to me.\n\nMe: You give me one day I'll debunk at least 3 (almost typed 5, originally) accepted feminist views. Especially the wage gap that's been debunked a thousand times.\n\nHer: And if you want to argue that you're demonized and made into a laughing stock then may I remind you that women are slut shamed and a judge recently asked a girl who claimed she was raped why she couldn't just keep her legs shut? Don't play the who gets hurt more game with me. I Don't make this about pinning gender against each other. Can you for one second not fucking focus on wage gap!!!! Is that your only argument? Fuck sakes in what world did I even mention that? I'm trying to make my point and here you go focusing on one topic. And wage gap doesn't even pertain to white females. It primarily native Americans and black women. And that can't be debunked.\n\nMe: It's not just wage gap, it's suicide and rape culture/hysteria, it's this belief woman are oppressed by  the patriarchy and at the hands of men.\n\nHer: And no. I don't want to hear you \"debunk \" anything because I don't have any faith or respect for any of your sources. You're clearly not well versed on this topic. And why would you want to debunk equality?\n\nMe: I agree with you, on your point about believing in equality. (Tired of this  conversation at this point)\n\nHer: No. You don't. You called it a benign belief and not feminism. Which is wrong.\n\nMe: But I don't think it's so uneven, unless you go to third world countries.\n\nHer: I, never once, said women were oppressed by the patriarchy. You are focusing on this  popular media theories. You are the one misinformed. It is uneven. Don't tell me it's not. But I believe Canada and the USA are making fantastic strides! Because the right people are making changes. Change doesn't happen overnight.\n\nMe: What 's a right men have, that women don't? A legal, codified right we have that you don't? Legally, we're both boned about the same. We both have a load of shit to deal with.\n\nHer: WHEN THE FUCK DID I MENTION THAT I WAS ARGUING MEN AGAINST WOMEN. PLEASE FUCKING TELL ME\n\nMe: You're saying it's uneven.\n\nHer: You're the most aggravating person I've ever talked to on here. YOU are making this about genders I'M SAYING THERE IS NOT FULL EQUALITY BETWEEN GENDERS AND RACE AND CULTURE. I'm not pinning this exclusively on man vs woman. Stop making this about that. Stop trying to force me into baiting you with some bullshit you're going to turn around with your small minded views that you get right from the media.\n\nMe: We're literally talking in circles. You made your point that feminism is a bout equality, and that  women are missing rights. As for race and culture, yes there are many problems.\n\nHer: Women are missing rights. In some organization women HAVE to wear skirts to work. Why can't we choose to wear pants? Why can't men choose to wear skirts? It's not ridiculous for a man to wear a skirt. Once it was ridiculous for omen to wear pants and yet nowadays it's part of our regular attire.\n\nMe: But feminism, at least as it's defined, is about equality for women :/ Dress code for women is stupid, agreed. Especially heels.\n\nHer: No. That's how it's defined once again in popular culture. That's what you and your crazy psychotic extremists refer to it as. Feminism is about EQUALITY. Maybe you can't get past the fact that feminism has the word \"fem\" in it.. But that's just a damn title.\n\nMe: So you agree that popular culture had dragged feminism through the mud?\n\nHer: Yea. Female tennis players? Skirts are mandatory. Some country clubs in the USA are exclusive to men. Women are not allowed to be members. If you want gender examples, I have them. But don't make this about gender. No. I will not agree. Because That. Isn't. Feminism. That's what YOU call feminism because that's all you understand it to be.\n\nMe: Well whatever you're calling it, is taking a shit on your flag.\n\nHer: Because people, once again, like you and these idiots you're referring to, have it all wrong and refuse to stand corrected.\n\nMe: So if you believe in equality, for everyone, why not say humanist or equalist? Because these extremists have hijacked your title in the mainstream media.\n\nHer: Because humanism is a philosophical ideology and has a different system or beliefs and ideas.\n\nMe: Alright, equalist is yet to be defined rigidly and separates you from the crazy.\n\nHer: I'm not changing the title of a movement or belief I hate to satiate you. The fact that you have a problem with it is on you and makes you read poorly.\n\nMe: Fair enough, so why keep feminism if more and more people are turning it into something it isn't? You drive to say you're different, that they are the minority and not representative.\n\nHer: It is not my problem. The fact that you misunderstand it and you have a negative feeling towards is on you as well. It's disgusting and disappointing but still on you. More and more people like you? Because your arguments tonight are what is \"dragging it through the mud\". They're only representative to you because they're what you chose to believe. They're ideologies are what YOU chose to accept as feminism. If it were the 1960s and the civil rights movement was in motion would you be arguing with me that all black people are insane for wanting to use the same bathrooms as white people?\n\nMe: It's not just me.. Feminists have rioted at universities, and casually now (typo, meant joked) about  genocide and castration on national tv. I'm hardly the minority with this thought process.\n\nHer: THEY'RE NOT FEMINISTS. THEY'RE WHAT YOU ACCEPT AND UNDERSTAND AS FEMINISTS.\n\nMe: If you don't define yourself as anything else, and they continue using that title, my point is, eventually how are people to tell the difference?\n\nHer: Again, we go back to ISIS and Muslims. ISIS is what you see on social media and in popular culture. Would you like to argue with me that all Muslims are evil and every one of them are going to bomb the city? I am not going to change my beliefs to satiate the idiots who chose to believe false \"idols\" are the representatives of feminism.\n\nMe: ISIS is a terrorist group. Islam as a religion is hateful, even if not all of it's adherents subscribe to extreme action. It's why even now apostates fear for their life, why Muslims shun westernized society.\n\nHer: Says you. Someone who doesn't understand it and has no respect for their culture and beliefs. The Muslim religion isn't hateful. The extremists take it too far. They also do NOT shun westernized society. Have you ever spent time in the middle east?\n\nMe: You assume I have no respect for them, but I have a lot of respect for them. Especially the ones who denounce stoning and other medieval practices taking place.\n\nHer:I'm done conversing with you. Your small mindedness gets clearer and clearer with every misstep you take with me. Your beliefs are yours. I disagree entirely and whole I have 0 respect for anything you're saying but I, unlike you, respect your right to uphold your own values.\n\nMe: If  t here is a place that really needs feminism, it's the middle ease.\n\nHer: But yet you still assume they're all part of this hateful religion? Forget it, I'm done. I'm really done.\n\nMe: if they follow Islam out of fear of death or worse, are they really followers?\n\nHer: Goodnight.\n\nMe: Good night.\n\nHer: You're saying they ALL follow it out of fear? Bullshit.\n\nMe: Obviously not all.\n\nHer: That's what you're saying.\n\nMe: You're ignoring context of the discussion now, It's whatever.\n\nHer: No, I'm not. You're flipping your views and how you're saying shit each time you repeat yourself.\n\nMe: I thought you were pretty amazing, and I'm pretty shit at arguing, but it's pretty clear we'd have a hard time reconciling our beliefs. I do believe you believe in equality. But I think you're the minority among women who identify as feminist.\n\nHer: Jesus Christ, man. I'm not the minority. I'm just not what YOU consider feminism. When will you get that through your head? You're views aren't the is all end all of the world. YOU don't dictate what is and what isn't! And that's what you're trying to do. It's a damn shame that you have such an eroded and distorted view of society. Maybe you wouldn't have been so disappointing if this conversation was had in person. Too bad you misspoke before that happened.\n\nMe: I do think this conversation would've gone better in person. Anyway, at least in the US according to a few polls, only 20% of women  identify as feminist.\n\nHer: This has absolutely nothing to do with anything we discussed. It doesn't matter if 20% or 100% identify as feminism. You don't know what feminism  really is so it doesn't matter. It's too bad then.\n\nMe: You define it as equality, and try to separate yourself from the radicals. At least from what I've read. I wish I could start over in the morning, but I get the feeling you're too angry to even consider that. Rabbit hole of fuck ups, lol.\n\nHer: I DO SEPARATE MYSELF FROM THE RADICALS. Did you seriously not learn that at all???? I shave my fucking legs. That alone says it all.\n\nMe: Okay bad choice of words, clearly that's the theme of tonight.\n\nHer: Ha.\n\nMan that took a fuckload of time to type up. Anyway, I know I could've done that a lot better than I did :/  \nI'm pretty introverted, so when something like this comes up it feels like this huge test on what I've learned faking the whole extrovert thing and I'm somehow being graded. Any suggestions are welcome.",
    "title": "Oooh boy, need a hand in an argument",
    "subreddit": "MensRights",
    "timestamp": 1492134490,
    "score": 3,
    "keyword": "black judge"
  },
  {
    "text": "Hooked on bell hooks, part 4: \"Sisterhood is still powerful\" (from \"Feminism is for everybody\", 2000) Enjoy this bite-sized excerpt from bell hooks' book \"Feminism is for Everybody\"\n\n[Author page](https://en.wikipedia.org/wiki/Bell_hooks)\n\n[Amazon - book reviews](https://www.amazon.com/Feminism-Everybody-bell-hooks/dp/0745317332#customerReviews)\n\nPlease post below your thoughts and comments on this text!\n\n***\n\n**\"Sisterhood is still powerful\"**\n\nWhen the slogan “Sisterhood is powerful” was first used, it was awesome. I began my full-fledged participation in feminist movement my sophomore year in college. Attending an all women’s college for a year before I transferred to Stanford University, I knew from firsthand experience the difference in female self-esteem and self-assertion in same-sex classrooms versus those where males were present. At Stanford males ruled the day in every classroom. Females spoke less, took less initiative, and often when they spoke you could hardly hear what they were saying. Their voices lacked strength and confidence. And to make matters worse we were told time and time again by male professors that we were not as intelligent as the males, that we could not be “great” thinkers, writers, and so on. These attitudes shocked me since I had come from an all-female environment where our intellectual worth and value was constantly affirmed by the standard of academic excellence our mostly female professors set for us and themselves.\n\n\n\nIndeed, I was indebted to my favorite white female English professor who thought I was not getting the academic guidance I needed at our women’s college because they did not have an intensified writing program. She encouraged me to attend Stanford. She believed that I would someday be an important thinker and writer.\n\n\n\nAt Stanford my ability was constantly questioned. I began to doubt myself. Then feminist movement rocked the campus. Female students and professors demanded an end to discrimination based on gender inside and outside the classroom. Wow, it was an intense and awesome time. There I took my first women’s studies class with the writer Tillie Olsen, who compelled her students to think first and foremost about the fate of women from working-class backgrounds. There the scholar and one-day biographer of Anne Sexton, Diane Middlebrook, passed out one of my poems in our class on contemporary poetry with no name on it and asked us to identify whether the writer was male or female, an experiment that made us think critically about judging the value of writing on the basis of gender biases. There I began to write my first book at the age of 19, Ain’t I a Woman: Black Women and Feminism. None of these incredible transformations would have happened without feminist movement creating a foundation for solidarity between women.\n\n\n\nThat foundation rested on our critique of what we then called “the enemy within,” referring to our internalized sexism. We all knew firsthand that we had been socialized as females by patriarchal thinking to see ourselves as inferior to men, to see ourselves as always and only in competition with one another for patriarchal approval, to look upon each other with jealousy, fear, and hatred. Sexist thinking made us judge each other without compassion and punish one another harshly. Feminist thinking helped us unlearn female self-hatred. It enabled us to break free of the hold patriarchal thinking had on our consciousness.\n\n\n\nMale bonding was an accepted and affirmed aspect of patriarchal culture. It was simply assumed that men in groups would stick together, support one another, be team players, place the good of the group over individual gain and recognition. Female bonding was not possible within patriarchy; it was an act of treason. Feminist movement created the context for female bonding. We did not bond against men, we bonded to protect our interests as women. When we challenged professors who taught no books by women, it was not because we did not like those professors (we often did); rightly, we wanted an end to gender biases in the classroom and in the curriculum.\n\n\n\nThe feminist transformations that were taking place in our coed college in the early ‘70s were taking place as well in the world of home and work. First and foremost feminist movement urged females to no longer see ourselves and our bodies as the property of men. To demand control of our sexuality, effective birth control and reproductive rights, an end to rape and sexual harassment, we needed to stand in solidarity. In order for women to change job discrimination we needed to lobby as a group to change public policy. Challenging and changing female sexist thinking was the first step towards creating the powerful sisterhood that would ultimately rock our nation.\n\n\n\nFollowing in the wake of civil rights revolution feminist movement in the ‘70s and ‘80s changed the face of our nation. The feminist activists who made these changes possible cared for the well-being of all females. We understood that political solidarity between females expressed in sisterhood goes beyond positive recognition of the experiences of women and even shared sympathy for common suffering. Feminist sisterhood is rooted in shared commitment to struggle against patriarchal injustice, no matter the form that injustice takes. Political solidarity between women always undermines sexism and sets the stage for the overthrow of patriarchy. Significantly, sisterhood could never have been possible across the boundaries of race and class if individual women had not been willing to divest of their power to dominate and exploit subordinated groups of women. As long as women are using class or race power to dominate other women, feminist sisterhood cannot be fully realized.\n\n\n\nAs more women begin to opportunistically lay claim to feminism in the ‘80s without undergoing the feminist consciousness-raising that would have enabled them to divest of their sexism, the patriarchal assumption that the powerful should rule over the weak informed their relations to other women. As women, particularly previously disenfranchised privileged white women, began to acquire class power without divesting of their internalized sexism, divisions between women intensified. When women of color critiqued the racism within the society as a whole and called attention to the ways that racism had shaped and informed feminist theory and practice, many white women simply turned their backs on the vision of sisterhood, closing their minds and their hearts. And that was equally true when it came to the issue of classism among women.I remember when feminist women, mostly white women with class privilege, debated the issue of whether or not to hire domestic help, trying to come up with a way to not participate in the subordination and dehumanization of less-privileged women. Some of those women successfully created positive bonding between themselves and the women they hired so that there could be mutual advancement in a larger context of inequality. Rather than abandoning the vision of sisterhood, because they could not attain some utopian state, they created a real sisterhood, one that took into account the needs of everyone involved. This was the hard work of feminist solidarity between women. Sadly, as opportunism within feminism intensified, as feminist gains became commonplace and were therefore taken for granted, many women did not want to work hard to create and sustain solidarity.\n\n\n\nA large body of women simply abandoned the notion of sisterhood. Individual women who had once critiqued and challenged patriarchy re-aligned themselves with sexist men. Radical women who felt betrayed by the fierce negative competition between women often simply retreated. And at this point feminist movement, which was aimed at positively transforming the lives of all females, became more stratified. The vision of sisterhood that had been the rallying cry of the movement seemed to many women to no longer matter. Political solidarity between women which had been the force putting in place positive change has been and is now consistently undermined and threatened. As a consequence we are as in need of a renewed commitment to political solidarity between women as we were when contemporary feminist movement first began.\n\n\n\nWhen contemporary feminist movement first began we had a vision of sisterhood with no concrete understanding of the actual work we would need to do to make political solidarity a reality. Through experience and hard work, and, yes, by learning from our failures and mistakes, we now have in place a body of theory and shared practice that can teach new converts to feminist politics what must be done to create, sustain, and protect our solidarity. Since masses of young females know little about feminism and many falsely assume that sexism is no longer the problem, feminist education for critical consciousness must be continuous. Older feminist thinkers cannot assume that young females will just acquire knowledge of feminism along the way to adulthood. They require guidance. Overall women in our society are forgetting the value and power of sisterhood. Renewed feminist movement must once again raise the banner high to proclaim anew “Sisterhood is powerful.”\n\n\n\nRadical groups of women continue our commitment to building sisterhood, to making feminist political solidarity between women an ongoing reality. We continue the work of bonding across race and class. We continue to put in place the anti-sexist thinking and practice which affirms the reality that females can achieve self-actualization and success without dominating one another. And we have the good fortune to know everyday of our lives that sisterhood is concretely possible, that sisterhood is still powerful.",
    "title": "Hooked on bell hooks, part 4: \"Sisterhood is still powerful\" (from \"Feminism is for everybody\", 2000)",
    "subreddit": "Feminism",
    "timestamp": 1510565465,
    "score": 20,
    "keyword": "black judge"
  },
  {
    "text": "The real reason women are not represented in tech First, I want to clarify I do not agree with the basis that women are not biologically suitable for roles in tech. I am much more inclined to believe it has to do with culture, and a good hard example against women being biologically inferior would be the country of Iran, where women make up the majority of engineers. Now granted, Iran has segregated schools between men and women, and they are under a theocracy, but if your basis was of biological merit, then this would be a good hard example to prove otherwise.\n\nNow, I will say that culture, primarily American culture, plays a huge role. \n\nLet's think back to middle school tech-ed courses, and think of the demographic in play. White/Asian nerdy boys primarily, a few hispanic and black nerds, and once in a while a nerdy girl. \n\nThis demographic holds true throughout high school. I would know, I was a guy who took tech ed courses in middle school/high school between two secondary schools, and this demographic holds true in hackathons, coding conventions, tech conventions, and..... tech jobs!\n\nBut why? Why do women, aside from a minority number, shy away from tech? Because of nerd culture. Yep, I'm just keeping it 100% honest here. Nobody likes nerds, besides other nerds. As someone who graduated from high school in 2015, the same stereotypes from 2-3 decades ago still hold true.\n\nNerds don't have friends to sit with at lunch, they are too autistic to make friends, and ESPECIALLY girlfriends, they are easy to pick on, and on the social hierarchy in high school they are at the very bottom.\n\nSo they fall back on tech, video games, and porn. And now you know why 90% of league players are males, just as the majority of competitive PC gamers are males. Men have a culture to fall back on, women do not. If women try to join this culture, lets say they play league, they will get hit on constantly for being a women. It's not fun, unless your aim is to make money from it by being a titty streamer of course.\n\nCompare this to a country like Iran, where western high school culture is non-existent, girls and boys are separate until 18, and girls are brought into tech collectively, where they can enjoy the subject without being hit on constantly, and without being judged.\n\nThis is not to say we need a theocracy. Hell, I'm agnostic myself. But I am saying that different cultures breed different peoples, and that our current nerd-normal people-jock culture cannot produce an equal outcome for both genders.\n\nUnless of course we mandate the subject, which could change things drastically. \n\nLooking forward to hearing your thoughts.",
    "title": "The real reason women are not represented in tech",
    "subreddit": "Feminism",
    "timestamp": 1502563805,
    "score": 10,
    "keyword": "black judge"
  },
  {
    "text": "Questions about alcohol and consent. Before writing this I hope I don't come off as misogynistic, these are honest questions that would like answers too.\n\nFirst off, how drunk is too drunk when it comes to sex and consent? Obviously if someone is blacked out or can't communicate then they can't consent, but surely being slightly tipsy isn't going to keep someone from being able make a decision about their own body, right? Between those two extremes every person handles alcohol differently, so how do you decipher that moral grey area? Beyond that, what if both parties are intoxicated beyond the realm of reasonable consent? Are they both rape victims? Are they both rapists? Is it purely case by case? If so what kind of thing do you think a judge should look at beyond just how drunk each party was?\n\nThanks for taking my questions seriously, I know I probably sound just awful, but it's from ignorance not malice.",
    "title": "Questions about alcohol and consent.",
    "subreddit": "Feminism",
    "timestamp": 1510970039,
    "score": 5,
    "keyword": "black judge"
  }
]