[
  {
    "text": "I need some advanced level networking advice finding job leads, cause I'm feeling tapped out Apologies for the wall of text but past posts on this have taught me that giving proper context better informs the advice. If you don't want to read all that, at least read the four questions at the bottom and give an answer for those. \n\n**About Me**\n\nI run an in-school program that provides academic support, HS athletics outreach & support, and post-secondary/college support. I want to focus more on academic support or post-secondary planning, but I'm interested in any education or youth development social justice work for now. \n\n**What I've done so far in my job search**\n\nI got some great advice on my resume between here at r/jobs and r/resumes, because my request to be interviewed went from 0-4 in my original resume 3-0 (Not counting two I reapplied to with the new resume). I have a whole system for crafting specific cover letters (e.g. I drop job postings in word clouds for words that occur most often). I could probably ramble less in interviews but even by my third interview I've already gotten better, so I feel pretty solid there. I hope this doesn't sound arrogant, I just want to be specific on where I would like some help on. \n\nI very quickly ran into issues of simply *finding* job openings. I routinely check the following job boards\n\n * Idealist\n * Indeed\n * LinkedIn\n * ZipRecruiter\n * LA2050\n * Jobscooper (though in fairness this is a recent addition)\n * Edjoin\n * Philanthropy News Digest's Job board\n * National Council of Nonprofits' Job Board\n * Nonprofit Career Match\n * Commongood Careers \n * Southern California Grantmakers\n\nI also checked out these, but they seem to be for executive level job seekers.\n\n * Bridgespan (Seems to be for executive level only)\n * Philanthropy Journal's Job Board\n\nI took that a step further and looked up directories about specific fields, and developed a Job Search Tracker with the company names hyperlinked to their career page sites so I could quickly go through their home sites in the hopes that they would post to their own site because they didn't want to spend the money or time dealing with job boards. I found places like \n\n * SoCal CAN (Southern California College Access Network)\n * Do Good LA\n\nI went through it and found 17 jobs posted out of 61 companies I had looked at them individually on their company webpages' job postings through this job search tracker. I also individually looked up all of these companies on LinkedIn for 1st and 2nd degree connections. There are a handful, and I'm considering reaching out to them soon. \n\n * Four were openings I had already applied to\n * Two were with charter schools which I would really like to avoid (I have nothing against charter schools, but that would greatly limit my career options: it's seen as a black mark to be previously from a charter school in much of the education community. It's far wiser to appear neutral on this issue unless/until one decides what specific area of education they want a career in.)\n * Two were national and not hiring in California, let alone LA. Another was in Sacramento and friends from Cali suggested I would hate it there based on what I want in my personal life. \n * I am clearly under-qualified for two openings.\n * Three were out of my function: One in development, communications/research, and organizing protests. \n * One was only part-time, and another was seasonal; I want only full-time work. * I found one that I was qualified and for full-time, but the company had *horrendous* glassdoor reviews. These are overblown in my experience, but the language used was akin to a previous employer I had a negative experience with, so I'm ruling them out. \n\nThe problem with this method though is there are around ~30,000 nonprofits in LA county. I can't reasonably find good companies efficiently by looking through directories. So I can't reasonably scale up this route and I would be likely missing out on great opportunities. \n\nSince I started looking in Late April, I've found only 9 jobs that meet my salary requirements (Idealist lists min/max salaries occasionally, I've ruled out a few based on this), in LA county, that I'm qualified for. Almost all of them I found on Idealist. That's about a job opening applied to a week. After I fixed up my resume, about five applications in, I got three interviews out of the next four applications. \n\n**Where I feel stuck**\n\nWhat's frustrating is I am sure the jobs are there: For every job opening I find, there appears to be 10 Manager, Director or Executive job openings posted. I have a daily job email alert for the entirety of LA county and often as few as two postings are new each day. I suspect many would prefer to have people come in as interns, AmeriCorps fellows, or volunteers. There are a lot of credentialed/teaching jobs, too, but they require Masters or credentials that I don't have and most don't substitute experience. \n\n**Personal reasons why I want to leave my job at the end of the school year**\n\nNow, I know what some of you are thinking: \"Well why don't you get certified or go back to grad school?\" \n\nI'm planning on it. I've already taken the GRE, scoring in the 75th percentile in the verbal and 54th in the quant, and apparently that's good enough to get into most education/policy related programs. I also got three recommendation letters ready. It's really just a matter of waiting until the portals open in the fall to start applying. It means I need to work for another year. \n\nBut I want to leave my job *now*. I essentially I took over a site at a school at the beginning of the year going through a major period of transition, and both my organization and my school completely didn't consider how this transition would affect the programming that had served both the school and my organization so well. It was supposed to be a reward from my supervisor who wanted me to have a good experience following a negative experience with my school in the first year (They had a new administration my first year that had zero interest in our mission goals). Essentially the school thought they could have their cake and eat it too, and they were not shy about expressing their confusion as to why we couldn't just \"adjust\" the programming. Some teachers actively undermined the SAT class I ran by pulling my students for extending time on their own projects. I got a lot of pushback for merely suggesting people should stop doing this. My classroom got turned into a dumping ground for students with empty blocks in their schedules during the day. This sucked because just as I developed a relationship that allowed for mentoring and holding the student accountable, they pulled them and put them in another class. It got to a point where I just gave up on my organizational goals to more actively pursue what the school wanted, with my supervisor's blessing, in order to repair the relationship, but the communication was so shitty most of the time I could only describe it as the left hand not knowing what the right hand was doing, and there I am with my own hand extended, sweating nervously with a smile on my face to hide the frustration of it all. \n\nI knew I had to leave after Teacher Appreciation week: Every single teacher, support staff and even other partners like myself that don't work directly for the school were recognized on the wall with student appreciation profiles. All of them, except myself. Friends have told me that I was mostly likely not on someone's list for that. I would say there are only a couple of teachers that actively dislike me for \"office politics\" reasons, so they are probably right. Still stings though. As pissed as I am I'm still treating the job professionally. Honest. Recently built a google sheet that calculates a students GPA by simply copying and pasting a students transcript into a cell on one sheet, and on another, that student's transcript is translated into GPA, highlighting weakest subjects, and giving the teacher's name. The coach who asked for help on this loved it. Now they can actually hound their players about their grades when there's a difference to be made as opposed to reacting to it when there's nothing to be done. \n\nThis all sucks because I'm pretty good with kids, and as pissed as I am at the school, they are not bad people. They just stopped caring about our goals. I just want a new experience and something exciting. I've always wanted to move to the West coast. \n\nI know I am already testing the patience of the reader with the personal anecdotes, but I assure you this is relevant. I was diagnosed with GAD and depression two years ago, and I was informed that I was likely experiencing symptoms since my teens. Loneliness and social opportunities are extremely important to me, as simply being around friends, particularly friends that know my situation has really made the difference in my mental health. LA is the only city where I have any personal network outside of my current city. Moreover, all of them are fully aware of my mental health.\n\n**The Questions**\n\nSo apart from general advice, I'd really appreciate some answers to the following questions. \n\n * What are some of the more exciting non-profits in LA that relate to social justice, particularly in education or college access? Even if they are not hiring, I'd like to get started writing more letters of interest. That's obviously much easier to do with companies the substance of which I'm interested in. \n\n * Based on my resume and situation, what other job functions or fields would you recommend I look into? I'm willing to broaden, but I feel pretty lost on rebranding myself in a way that would appeal to outside my job function and field. \n\n * Is there a LA specific version of [The top 50 best nonprofits to work at](http://thenonprofittimes.com/rd/4-1-17_BestNonprofits_LR.pdf)? It lists the companies based on quality-of-life metrics as well as impact metrics.\n\n * Is there any way I can find or develop a IF This Then That or Google Alert that I can set up for job openings to specific company websites, or job openings with certain key words? \n\n\nAny specific advice is greatly appreciated. \n\nThanks,\n\nu/weaksidewing",
    "title": "I need some advanced level networking advice finding job leads, cause I'm feeling tapped out",
    "subreddit": "jobs",
    "timestamp": 1497742694,
    "score": 3,
    "keyword": "black director"
  },
  {
    "text": "I'm worried I may be terminated for the first time I've been doing a part-time retail job for the past two weeks. I've had a fever since last night. I tossed and turned and realised working today was not going to happen. I texted the shop director, then managed to get to sleep. I just woke up a few minutes after my shift started. There was a text from the director saying he's not in today, so I need to call the shop an hour before the shift starts.\n\nI did call, and she sounded terse, but nobody came right out and said 'you're done.' But I'm worried that may be coming.\n\nI wasn't planning on staying with this job for much longer. I'm doing it to bring in extra income while I look for a seasonal job in a national park or something like that. But if I get terminated, that would be a black mark on my record.",
    "title": "I'm worried I may be terminated for the first time",
    "subreddit": "jobs",
    "timestamp": 1495997204,
    "score": 2,
    "keyword": "black director"
  },
  {
    "text": "Finished grad school, got hired by a very prestigious organization in a position that I am frankly unqualified for and don't want to make a career out of. What do I do!? (X-post from r/career guidance in order to case a wider net) Buenos Nachos, good people of r/jobs.\n\nSo, last March I finished grad school. I fairly randomly applied to a data-science position with a world-renowned nonprofit which is a BIG name in my field. I never really expected to even interview for the position, let alone be offered the position. As I said, it's a data-science type position, which involves a fair amount of computer programming and statistics. Frankly, I'm utterly unqualified. I spent about 6 weeks learning enough about programming in a particular language to be able to sound like I knew what I was talking about during the interview, but outside of that, I had no CS experience. I also only took one math class ever in both my undergraduate and graduate programs.\n\nI honestly have no idea how I landed a job offer, but given that this organization is so well known and well respected and in my field, I of course said yes. I've been working in the position for the past six months, and I've been doing everything I can to try and learn what I need to know to fulfill the responsibilities of this position.\nI've spent the last 6 months learning what I can about computer programming and statistics, and doing my best to complete any projects and assignments I've been given. I've spent hundreds of dollars on CS and stats textbooks to try and learn what I don't know, to try and be able to do this job, but I don't think it's working. The CEO and my Department's director have both expressed that they are impressed with my work, thought to be honest, I suspect that they simply don't know enough about it to spot that I have no idea what I'm doing. I often, as in on a near daily basis, feel like someone is going to realize that I really have no clue what I'm doing, which is incredibly uncomfortable.\n\nThe most important aspect of all this, I feel, is that the longer I'm in this position the more I realize that despite the potentially highly lucrative career opportunities, should I be able to make a career out of this type of work, it's not work I want to do for the next 30 years.\n\nSo, I guess that brings me to my question. Given that this data-science field isn't a field I'm comfortable in, and a field that I don't want to be in forever, and I really only accepted the position because having work for this organization on my resume will open doors in my field, what do I do? On the one hand, the longer I work for this organization, the better it looks, and I certainly don't want to leave after only being here for six months. On the other hand, when it eventually comes to light that I really have no clue what I'm doing (which I suspect will happen as soon as we try to publish a scientific paper I was requested to write, because people that actually know what they're doing will look at my work and instantly recognize that I'm clueless), I'm afraid that it will leave an indelible black spot on my career.\n\nSo how do I resolve that conflict between knowing that this isn't the type of position I want to make a career out of, knowing that I truly have no idea what I'm doing, wanting to have a position with this organization long enough that it will open doors for me, but having that feeling of dread and ticking time bomb-ness that eventually someone is going to realize that I am utterly unqualified for my position? Do I cut bait and start applying for positions that I'm actually qualified for/want to make a career out of immediately? Do I sit in my corner cubicle with my head down, wait for the other shoe to drop, and deal with that fallout when it happens? Do I wait around for another 6 months or a year and try to get out before anyone realizes that I have no business being employed in this position?\n\nI'm familiar with \"impostor syndrome\", and freely acknowledge that feeds in to some degree to my feeling of being a fraud, which is exacerbated by the fact that I often find myself going days at a time without really any \"work\" to do. However, I also freely acknowledge that, objectively, I do not have the technical skills or education to perform this position exceptionally and it is only the fact that no one in the building is a computer scientist or statistician that has prevented that revelation among my superiors.\n\ntl;dr - I bullshitted my way into a highly technical position with a leading organization in my field, I don't want want to make that position into a career (and I'm not sure I'm capable of doing so if I did), and I'm not sure how, or how quickly, to extricate myself before someone with the ability to fire me realizes I'm horribly out of my depth. What do I do?\n\nThanks for the advice, and I apologize for the ridiculously long post.",
    "title": "Finished grad school, got hired by a very prestigious organization in a position that I am frankly unqualified for and don't want to make a career out of. What do I do!? (X-post from r/career guidance in order to case a wider net)",
    "subreddit": "jobs",
    "timestamp": 1488823935,
    "score": 2,
    "keyword": "black director"
  },
  {
    "text": "Looking for advice on what to wear to an interview at a private liberal arts college I'm interviewing at a very exclusive private liberal art college in the midwest next week. The position is Assistant Director of Development and Alumni Relations Communications. I'd be writing content (among other duties) for the development and alumni relations office.\nI'm looking for advice on what to wear. \nAt the moment I've got nice suit gray pants, black flats, and a navy blue shell blouse. \nDo I need to buy a gray suit jacket? or will a black or white cardigan sweater work?\nI'm getting my nails polished--which color should I pick?\nAny other tips?\n\nEDIT: Thank you so much everyone for your help. I sincerely appreciate it.",
    "title": "Looking for advice on what to wear to an interview at a private liberal arts college",
    "subreddit": "jobs",
    "timestamp": 1499122060,
    "score": 1,
    "keyword": "black director"
  },
  {
    "text": "Life with Fibroids, a gross story *again story not for those who get faint at the sight of blood.*\n\n\n\n\nI know I have an important meeting today with one of my new directors so I go to the Bathroom. Everything checks out  par was changed at lunch and relatively clean, the mooncup could be drained... But I really don't want to go through that hassle... I'll do it after the meeting when there aren't other girls in the bathroom. I decided to roll up a bunch of toilet paper as backup and went on my merry way to my meeting. \nNearing the end of the meeting I started cramping. I decided I would go to the bathroom again as soon as the meeting was out. I need to talk less, I went over on my meeting and the next meeting a training presentation. It was about that time I really started gushing... I needed to go now... But I could not move. I was doing everything I could to try and hold in the feeling so I could stand up. I finally was able to excuse myself and I went to get a new overnight maxi. I started walking to the bathroom calmly at first. Then my hand brushed my butt, wetness, I started walking faster. Through the mantrap, across a hall in a sea of cubicles, in front of the break room finally to the bathroom. I was confident that my strategicly chosen black pants were shielding me. \n\nAgain warning it's gross.\n\nWhen I went to change I found soaked panties almost no dry cloth left, silent tears started falling. I need to get that damn surgery, no I needed to change my pad, see if my massive leak is visible, get my stuff and run like the wind home to change. I stopped crying and started cleaning. I was still excited that I was wearing black pants. When I left the stall  I walked past coworkers and tried to hurry and wash my face. I was fortunate no one talked to me. I turned around to see a redish brown, it was pretty much glowing... :'( I couldn't hold back the tears anymore. I just didn't know what to do at this point. I was fucked, there was no way I could leave this room. There was nothing I could do and it wasn't stopping. I called my coworker to bring my stuff to the bathroom. Luckily she brought another one of my friends to help. I just sobbed, I let them know what happened. It was then I realized I probably soiled the chair and that we needed to get it before someone sat in it. Then I realized that the presentation I left suddenly was being recorded... That is right... Fucking recorded. I put on my backpack lowered it to cover my butt walk with my coworker who followed behind me. I am grateful for having her to talk to and she walked me all the way to my car. I gave her a hug and thanked her for helping me. It was time for my work day to end.",
    "title": "Life with Fibroids, a gross story",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1510236263,
    "score": 14,
    "keyword": "black director"
  },
  {
    "text": "Fuck those Stranger Things directors (about Beyond: minor spoiler alert) Rape culture among Stranger Things makers: on episode ?3 of the making-of series, one of the directors tells the red headed girl that as soon as he knew she was resistant to a possible kiss scene, he knew that HAD to film one.  Men being stupid, men allowing themselves abusivenesss and thinking it’s fun. That show needs grown up women running things, too. That clip should never have been released and a that asshat of a director (who probably thinks of himself as a feminist for fetishizing geeky girls) needs some girlwokeness ASAP. The fact that the kisser is the black kid makes the whole thing even more reprehensible.",
    "title": "Fuck those Stranger Things directors (about Beyond: minor spoiler alert)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1509807344,
    "score": 0,
    "keyword": "black director"
  },
  {
    "text": "Manager called me unprofessional Hey everyone, i'm curious to see what everyone's response will be.\n\nI recently got a coveted position at a great hospital in my region. When I was informed they wanted to hire me they gave me a start date 2.5 weeks away. As soon as I received my offer letter I put in my two weeks via email as I am a night shifter and planned on talking to my manager about it when I saw her. Before I could get a chance to talk to her, she left me a nasty voicemail calling me unprofessional for not resigning in person and told me she would 'hold' my resignation till I called her. Yeah. I didn't call her back right away because I honestly didn't know what I would say and was kind of flabbergasted by the voicemail. I work the weekend shift and she comes in that next Monday morning and corners me right before shift change in front of my peers in the middle of the pod and berates me for not calling her back, calls me unprofessional to my face and then makes mention of a comment a friend of mine made on my facebook about the unit. This lady does not have me on facebook. The place I am working at has been driven into the ground by this manager, 70% of people aren't making it through orientation because they quit and since I started almost two years ago 70% of the original staff has quit.\n\nI kind of want to contact HR and her director and let them know what went down. I'm pretty sure there is already an HR investigation against her because they are trying to figure out why people are quitting. What would you all do? I'm worried she might try to black list me somehow. \n\nEdit; My friend who commented on my status was a former coworker who congratulated me on getting out of the 'crap shoot.'",
    "title": "Manager called me unprofessional",
    "subreddit": "nursing",
    "timestamp": 1505868888,
    "score": 18,
    "keyword": "black director"
  },
  {
    "text": "ED Tales from the Trenches So in the midst of a hospital restructure, my director (who oversaw 24 observation and ED) turned the keys of the castle over of Obs to new management, but shifted me into the ER.  I've floated there often and now I'm full time and getting put through an impromptu orientation whilst flying solo. Am excited to be working with a group of nurses and docs where my personality, sense of humor, and work ethic all mesh well.  \n\nThat being said, didn't take long for the stories to be told, and of course, for my own to occur.  Last night, running an NG tube into a Pt with significant abdominal distinction, the tip of the tube hit that sweet spot in the back of her throat and liquid black death spewed forth.  Needless to say, we were all covered, X-ray confirmed placement, and suction alleviated a lot of discomfort. When all said and done, the patient looked at me with a tear in her eye and smiled and said, well I didn't see that coming....  we all got a laugh, cleaned up, and she was slated for surgery the following AM\n\nJust the start of my time in ER and yeah, one of those tales from the trenches...",
    "title": "ED Tales from the Trenches",
    "subreddit": "nursing",
    "timestamp": 1493092494,
    "score": 11,
    "keyword": "black director"
  },
  {
    "text": "[PA] [11/12] - Having a terrible student teaching experience. Advice please **TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**\n\nI am at a AA-sized school in western PA outside of the city. When I was first assigned to this school I was excited as the mentor teacher had received some awards and plaudits both statewide and even a national one. I thought \"what better person to learn from that this person\".\n\nWhen we first started it was going great. She was excellent at teaching me the ins and outs of contracts, etc (which I realize now was totally off-topic and shouldn't have even come up), the mechanics of school politics (again, some bells going off) and so forth.\n\nDuring the first week, I could see how she was a really good teacher. The kids respect her and she has great classroom management. On Tuesday of the first week, she said she would want me to start teaching the following week. So she would take the first Econ class of the day and I would teach the two in the afternoon. She wanted me to start drafting lesson plans for these days and then we'd go over them on Friday.\n\nThe first week of doing Econ in the afternoon went well, so she had me take over that class full time in Week 3, while I took over the second of her two Psych/Soc classes in the same format. In Week 4, it was all me for everything.\n\nWhile I was excited to jump into teaching full time, I should have had a few alarm bells going off:\n\n* why wasn't she modeling her preferred style of lesson planning to me?\n* why was she moving faster than my university's suggested timetable for giving me more responsibility?\n* how was I going to be expected to extrapolate from her incredibly abridged lesson plans?\n\nI took comfort in the fact that, at the beginning, she would sit down with me and go over what she would expect to me to cover the next week and so forth M-F. And it became our ritual, in a sense, for us to sort of broadly go over the next week on Friday and then for me to turn in an overview of the week by Sunday, which she would comment on if there were any concerns.\n\nFast forward to last weekend. She is busy on Friday with students asking about extracurricular stuff and my attempts to connect on the following week's material are rebuffed. So I do my best on Friday evening and Saturday to map out the week, extrapolating from a very thinly detailed syllabus to try to use as a pacing guide. I text her on Saturday evening asking if we could go over the plans for the week, and she responds \"I'm busy right now, I'll call you tomorrow at 5\". (bear in mind, she told me from day one that if I EVER need help to call and she'll \"talk me down from the ledge\" and work with me\".\n\nThe next day, I reach out by email ahead of time, sort of detailing all of my concerns about the upcoming week, my confusion over the pacing and wording in the syllabus and uncertainty as to her suggestions from the past. \n\nThen 5 comes and I get no response, then 7, then 9 - and by this point I'm freaking-the-fuck out. So I send another follow up text stating that I had sent an email with some questions and I was hoping to discuss the following day, at least, as well as the week moving forward.\n\nI get a text at 11:30 pm asking \"have you figured it out yet\". To which I of course responded no and that I thought i at least had a plan for the next day but that I really needed some clarification on the rest of the week. She responded \"**i can keep holding your hand forever, but you'll never learn anything that way. I need those lesson plans before 7 tomorrow. See you then**\n\nSo when she came in the door in the morning, I was hastily wrapping up the weekly overview lesson plan to be turned into the office - basically just going off of whatever she did last year.\n\nThen all week long, there was this tension in the classroom. I could feel it growing. I was frustrated with her for essentially abandoning me with little preparation (a strategy which many of my teacher friends derided as unprofessional and extremely unhelpful). She seemed annoyed with me for seemingly needing any help at this point.\n\nOn Wednesday, I get an email from the director of field placements at my university wanting to have a phone meeting the next day. On that phone meeting is literally everyone in the chain from the top of the school of education down to me. \n\nMy site director first allows me space to give my side, and then proceeds to list a rapsheet of complaints and errors on my part that have been privately communicated to her over the past week or two about my untimeliness in turning stuff in and unpreparedness for the day each day and needing to have my hand held for every little thing...yadda yadda.\n\nI was so taken aback and felt so cornered, but i swallowed my tears and the lump in my throat and did my best to give a fair account of everything from my end, to include - which I've yet to mention - that the previous week she broke her tooth in half and had 2 miss days of school in pain after getting it pulled and i was left with subs, etc. Then the following days she was in pain because she couldn't take her percocet before coming to school and so was always in a foul mood, but I did my best to steer clear, etc.\n\nThe school seemed understanding of my side, and said they aimed to support me in whatever way possible to help get me across the finish line.\n\nThen yesterday was teacher in-service. Teachers are supposed to be given an itinerary at least a week ahead of time. Our teachers were given them on Wednesday. My MT forwarded the email to me, but i notified her that as it was a Google doc, and she was not the creator, it wasn't able to be opened unless shared by the creator. She said she'd follow up, but never did.\n\nSo I arrive at 8 the on Friday morning, and go to meet her in the classroom, which is where we met previously. She's not there; door locked. I go to the auditorium, which is where in-service began last time, and no one is there. Finally I hear an announcement and see teachers walking toward the collaboration center, so I join them and we all walk in the door at 8. I get a text from her at 8:02 saying \"in-service started 2 minutes ago and you aren't here\". So i responded \"im here, in the back of the room\". She turns around and makes eye contact.\n\nLater in the day I get a call from my site director asking how the day is going, if I'm feeling any better after the ambush on the phone the day before, etc. Then she asks, what time did the in-service start this morning? I said, \"8\". \"And when did you arrive?\" \"just before 8\". \"Well, your mentor teacher sent me an email notifying me that you didn't arrive until 9\".\n\nI was PISSED. I forwarder her the texts proving that I was there at 8 and that I had notified my mentor teacher of my presence in the back of the room.\n\nI got ANOTHER call from the university and after some back and forth, they sort of seemed to agree with my suggestion that I felt that I was being sabotaged at this point for whatever reason. They said to not go into school on Monday, don't contact my mentor teacher, don't contact the school - they'll take care of it. What they want is to have a meeting where all the expectations of all parties are laid out in black and white, on paper, so there's no confusion, and then we'll figure out a path forward from there.\n\nI'm so frustrated and confused and exhausted and exasperated over the whole thing. I don't even know what to do going forward. I was told to not make any more lesson plans at this point and to just take the weekend to spend time with my kids and wife and think about some solutions to help get me across the finish line on December 8.\n\nI'm so furious I don't even know what to do. I'm also worried that my MT, if I remain in her classroom, is going to sabotage me by switching subjects this week to throw off any lesson planning I've already done (both classes are combined Psych/Soc and Gov/Econ) and we go back and forth. Everything I've planned for the rest of my time there is in Sociology and Gov, so I half expect to walk in the door tuesday and she'll have been teaching Psych and Econ and tell me to hurry up and make some lesson plans for the rest of the week.\n\nAnyway. Suggestions?\n\n**TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**",
    "title": "[PA] [11/12] - Having a terrible student teaching experience. Advice please",
    "subreddit": "Teachers",
    "timestamp": 1507998970,
    "score": 39,
    "keyword": "black director"
  },
  {
    "text": "2 years in dead-end solo graduate role, has this damaged my work prospects? Hi, \n\nI've worked as a solo developer in a planning, environment and cultural sector startup for 2 years. I took the job originally since it promised a lot of freedom (too much) with the expectation that we would be expanding my side of things bringing in some peers to work alongside me. I believe now that this will never happen or at least, not in a reasonable period of time in the near future so I am looking for new work.\n\n&nbsp;\n\nAs far as my role goes, it has never been well defined; from day 1 I was dropped in, wound up and set to go choosing whatever toolsets, frameworks, programming languages etc that I felt were appropriate for what my boss (our director) wanted. While this was enjoyable at first, becoming aware that there is no clear future direction coupled with frequent of switching of projects that are never seen to completion , it has worn thin on me. The original allusion to personal autonomy was really code for being completely unmanaged which has been an unfortunate theme in the business at large. While I am an independent person and appreciate the virtues of such a liberty, it has become more and more apparent to me that a position like this isn't best suited to a fresh graduate with no industry experience to draw from and I would thrive much better in a more traditional environment.\n\n&nbsp;\n\nMy background is in straight Computer Science where I graduated in 2014 with a strong 2:1 from a top university. However, the focus of my studies was more on the architectural and theoretical side of things rather than explicit software development although I was trained in OOP in Java and used C a fair amount during my algorithmic studies.\n\n&nbsp;\n\nOn the job I have taught myself web development in Ruby + RoR along with a basic competency in common web technologies (HTML5, CSS, JS/JQuery). I chose to learn these technologies since they were good for rapid development and I enjoy jumping into new areas. However I must say that I don't feel confident in these capacities.\n\n&nbsp;\n\nThe job has left me amotivated (in this company) and with a degree of anxiety over my abilities. Having spent 2 years switching between projects coding in a bubble, I feel deprived from sharing intellectual space with other developers whom I can work with and learn from in addition to functioning more as a hacker rather than a developer in a well defined software development process; a true industrial context. \n\n&nbsp;\n\nIn short I fear that having this experience under my belt has done me more harm than good as far as career hunting goes although I have learned a lot on a personal level. I'm not sure how to market myself with what I feel is a black spot on my CV so I'm hoping someone can give me some perspective here. What I truly want is a fresh chance in a company with a good culture where I can be a learning sponge in so I can grow myself as serious developer from the ground up but I am worried that these opportunities are reserved for the fresh graduates. I am not averse to learning any new languages or technologies although I do have a preference against .Net tech since from the beginning of my studies through to today I have always operated in a UNIX environment which I'm competent in using effectively.\n\n&nbsp;\n\nI tried to keep that as brief as possible as I could go into much more detail. To that effect I'll expand on anything if anyone has any questions. \n\n&nbsp;\n\nThanks for you time",
    "title": "2 years in dead-end solo graduate role, has this damaged my work prospects?",
    "subreddit": "cscareerquestions",
    "timestamp": 1486914865,
    "score": 11,
    "keyword": "black director"
  },
  {
    "text": "Shout out to Spider-Man Homecoming for diversity? I know a lot of ladies feel like diversity in Hollywood shouldn't be celebrating like it's a victory but should be expecting at this point. I get that I'm still happy as fuck that the new Spider-Man movie has so much melanin. The movie actually looks like the town I grew up in!😄 Thanks casting/director for not pretending Queens is still white as hell. \n\nIt's also refreshing to see that Laura Harrier's character (Liz Allen) had a mixed race family. I love our light skinned, mixed race sisters but it's so annoying (and offensive) that they are often given dark skinned parents. It reeks of colorism and it doesn't represent black families or mixed families at all! Unrealistic casting only appeals to white minds who are only comfortable with a light face.\n\nNow… if only we could get a Miles Morales movie... In the meantime, I'm looking forward to Black Panther!",
    "title": "Shout out to Spider-Man Homecoming for diversity?",
    "subreddit": "blackladies",
    "timestamp": 1499802006,
    "score": 30,
    "keyword": "black director"
  },
  {
    "text": "Black Film Club: Medicine for Melancholy Two young black folks awkwardly navigate the day as intimate strangers, beginning the morning after one night stand. \n\n[Trailer](https://www.youtube.com/watch?v=bMb8xziXXqg)\n\nDirector: [Barry Jenkins](http://www.imdb.com/name/nm1503575/?ref_=tt_ov_dr)\n\nWriters: [Barry Jenkins](http://www.imdb.com/name/nm1503575/?ref_=tt_ov_dr)\n\nProduction Company: IFC Films\n\nBudget: $15,000\n\n\n*Last week's discussion:* [Devil In A  Blue Dress](https://www.reddit.com/r/Blackfellas/comments/7ivtd3/black_film_club_devil_in_a_blue_dress/)",
    "title": "Black Film Club: Medicine for Melancholy",
    "subreddit": "blackladies",
    "timestamp": 1513506769,
    "score": 22,
    "keyword": "black director"
  },
  {
    "text": "Kino Lorber’s “Pioneers of African-American Cinema” box set is now available to stream on Netflix: 20 films made by groundbreaking African American directors for black audiences from 1915 to 1946",
    "title": "Kino Lorber’s “Pioneers of African-American Cinema” box set is now available to stream on Netflix: 20 films made by groundbreaking African American directors for black audiences from 1915 to 1946",
    "subreddit": "blackladies",
    "timestamp": 1486486770,
    "score": 21,
    "keyword": "black director"
  },
  {
    "text": "Congresswoman asked the FBI Director to retract his department's report on the FICTIONAL designation of Black Identity Extremism.",
    "title": "Congresswoman asked the FBI Director to retract his department's report on the FICTIONAL designation of Black Identity Extremism.",
    "subreddit": "blackladies",
    "timestamp": 1513152003,
    "score": 19,
    "keyword": "black director"
  },
  {
    "text": "people's outrage over get out being placed in the best comedy/musical category for the golden globes is so dumb. the movie was billed as a horror-comedy when it first came out, jordan peele (the director) said it was a satire, the studio and jordan are the ones who submitted in the category for best comedy/musical but people are trying to act fake woke over it and claim it isn't a comedy and that this is just hollywood perpetuating racism. \n\nthis isn't an insane situation like the martian being placed in this category last year (just for an easy win, really), but an apt category for the movie since it is a horror-comedy movie. and people are claiming that it's not comedy because they didn't laugh out loud or anything, which is why get out is a satire comedy not just a regular old gut busting comedy. \n\nidk normally i'm with black twitter on things but the outrage and claiming that this was done because \"laughing at us not with us\" is stupid, because that's not even how it works for the golden globes.\n\nedit: jordan's last name was spelled wrong",
    "title": "people's outrage over get out being placed in the best comedy/musical category for the golden globes is so dumb.",
    "subreddit": "blackladies",
    "timestamp": 1510778659,
    "score": 13,
    "keyword": "black director"
  },
  {
    "text": "We're Justin Chon and David So. Ask us anything! **Justin**:  Hey im Justin Chon. I was he asian kid in twilight, jeff chang in 21 and over, and sonny from revenge of the green dragons among other films. Im going to be on an abc show called DECEPTION.\n\nIm a graduate of USC business school but somehow ended becoming an actor/writer/director.\n\nMy new film GOOK is set during the 1st day of the 1992 LA RIOTS and is about the friendship between a 10 year old black girl and 2 korean american brothers.\n\nYou may also recognize my co star David So. He is a youtuber but now i consider him an actor.\n\nOur movie, GOOK, opens in most major cities at REGAL CINEMAS. AUGUST 25TH!!!!!\nASK US ANYTHINGGGGG!!!!\n\n**Proof**: https://twitter.com/justinchon/status/884487502299398144\n\nhttps://twitter.com/davidsocomedy/status/884488440997335040\n\nhttp://i.imgur.com/OwHeuIT.jpg\n\n~~**UPDATE**: Thanks everyone! We're going to take a break, but we should be back on around 8 pm (pacific time) or so. Feel free to keep asking us questions!~~\n\n**UPDATE #2** Hey im terribly sorry. I got caught up with some family stuff that needed attention so wasnt able to hop back on. I'll try continuing answering questions tomorrow. If not, ill probably do another one of these in August, closer to the release date  -JC",
    "title": "We're Justin Chon and David So. Ask us anything!",
    "subreddit": "asianamerican",
    "timestamp": 1499711831,
    "score": 220,
    "keyword": "black director"
  },
  {
    "text": "Telling our own stories, and our short film 'Ella\" Hi there,\n\nMy name is Dan Chen, and I'm a director and cinematographer. You may have seen a post about our film \"Ella\" a few weeks ago, when we had just launched our Kickstarter. I'm happy to announce that we've reached our funding goal, and we're going full steam ahead!\n\nIn recent years, I recall a conversation I had with several other friends who work in film. We came to the conclusion that any American movie with an Asian protagonist would most likely be categorized as an \"Asian\" movie, or a special interest film.\n\n\"What if I wanted to make something like Dazed and Confused, but the main characters just so happen to be Asian American?\"\n\n\"It's still going to be an Asian movie.\"\n\nThe question stayed with me. Maybe I hadn't fully embraced my own race and identity yet. But I didn't want to make a special interest movie. I just wanted to make a movie.\n\nIt took a lot of inspiration to get to making \"Ella.\" Part of it was seeing artistic, successful minority representation in media, with projects like Master of None and Moonlight paving the way. Another factor was my friend Doug Kim, a producer on our short, writing and starring in a pilot we worked on together, which dealt with his real struggles as an Asian American actor in a courageous and comedic way. Finally, I realized that any character driven story needs to take race into consideration, just as it should explore sex, class, age, and other very real factors that affect who we are and who we become.\n\nIn my view, we can't wait for Hollywood to cast Asian Americans in an interesting, complex way, although putting pressure on them can certainly make them reconsider their actions. We need more Asian creators, just as we need more black creators, more Hispanic creators, and most obviously, more women of all kinds in Hollywood. Because these creators will understand the importance and significance of representation.\n\nPlus they'd have experiences and perspectives that we haven't seen yet. That's not just good social justice... that's good entertainment.\n\nSo this short film is my humble contribution (and if all goes well, the first of many contributions). I'd love support, critique, or sharing if you dig the project. We're currently going for our first stretch goal which would afford us the opportunity to hire a great casting director to help us find our second lead, who'd play a fourteen year old Chinese boy who's seeking acceptance in his small Midwestern town.\n\n[Ella, a new coming of age story in the Midwest](https://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid)\n\nI'm glad to be a subscriber to the community, and look forward to sharing more dialogues and upvotes with ya'll.\n\ncheers,\nDan",
    "title": "Telling our own stories, and our short film 'Ella\"",
    "subreddit": "asianamerican",
    "timestamp": 1490220529,
    "score": 22,
    "keyword": "black director"
  },
  {
    "text": "Enrollments, budgets fall short at universities known for ‘social justice warfare’  more people are getting the message. not attending these indoctrination centres is more effective. less students less revenue.\n............................................\n\nhttp://www.washingtontimes.com/news/2017/sep/14/enrollment-drops-at-schools-known-for-social-justi/\n\nUniversities known for being hotbeds of campus protest and liberal activism are struggling with declining enrollments and budget shortfalls, and higher education analysts say that’s no coincidence.\nTake Oberlin College. According to a document leaked to The Oberlin Review, the school’s student newspaper, the small liberal arts college famous for social justice hoaxes has had trouble attracting and retaining students, missing this year’s enrollment mark by 80 and racking up a $5 million budget deficit in the process.\nWilliam A. Jacobson, a professor at Cornell Law School who runs the Legal Insurrection blog, said the “most obvious culprit” in Oberlin’s dwindling admissions is “relentless social justice warfare.”\n\n“Social justice warfare at Oberlin has been more intense and sustained over a longer period of time than at most schools, and has come to define Oberlin in the media,” Mr. Jacobson said. “The resulting mockery and derision, even in liberal publications, has damaged the Oberlin brand.”\nSurveys support the notion that, in the era of Trump, conservatives have become more skeptical about the value of a college degree.\nThe polarizing presidential election was felt in the dip in applicants at some top-tier colleges such as Ohio’s Kenyon College.\n\n“This is a year in which you were vulnerable if you were a small liberal arts college in a rural red state and you attract a significant portion of your student body from the East Coast or West Coast, which would certainly be the case with Kenyon,” Diane Anci, Kenyon’s vice president of enrollment and dean of admissions and financial aid, told the Ohio school’s Kenyon Collegian newspaper.\nA study published by the Washington-based Pew Research Center in July found that just 36 percent of Republicans believe colleges and universities have a positive effect on the country, down from 54 percent two years ago.\nGallup released a poll in August that found just 33 percent of Republican and Republican-leaning respondents had a “great deal or quite a lot of confidence in higher education.” Sixty-seven percent said they have “some or very little” confidence in academia.\nHigh school counselors report that, in the past few years, parents have been more likely to express concern about sending their children to schools with progressive reputations.\n“Many won’t consider Oberlin or Wesleyan, and Brown is completely off the table,” one counselor told Inside Higher Education in June.\n\nThe problem may be especially pronounced among the nation’s heartland. Inside Higher Education reports that several prestigious, small liberal arts colleges in the Midwest have missed their enrollment marks this year.\nSome college administrators have taken notice. According to Inside Higher Education’s annual survey, 52 percent of admissions directors from public colleges and 28 percent from private ones said they were stepping up their recruitment of students from rural areas in the wake of the presidential race.\nDeclining enrollments have previously been observed at colleges and universities that became notorious for chaotic campus activism, including the University of Missouri and Evergreen State College.\nBy some estimates, enrollment at the former is down 35 percent since fall 2015, when student protests helped launch the Black Lives Matter movement.\nMeanwhile, Evergreen faces a $2.1 million budget shortfall this year since students took over the campus last spring, barricading themselves in the library, berating administrators on a regular basis and forcing one dissenting professor to teach off campus out of fear for his safety.\nA spokesperson for Oberlin College did not respond to a request for comment from The Washington Times.\nThe school’s problems cannot be traced to a single incident but to several.\nIn February 2013, mass hysteria ensued after racist and anti-Semitic flyers and graffiti began to appear all over campus. Classes were canceled, meetings were held and students began to see racism around every corner, including when someone reported seeing a member of the Ku Klux Klan on campus. It turned out to be a woman walking around wrapped in a blanket to keep warm.\nNot only that, the perpetrators behind the racist paraphernalia turned out to be two progressive students, one of whom was confirmed to be an Obama supporter, trying to get a reaction out of their classmates and the administration.\nRather than admit the whole thing was a hoax and move on, the Oberlin administration doubled down on a social justice agenda, including the implementation of a privilege and oppression “reorientation” for first-year students.\nIn the ensuing years, Oberlin students would go on to make frequent demands of the university, ranging from the end of culturally appropriated meals at the dining hall, such as General Tso’s chicken and sushi, to the elimination of grades below a C.\nIn 2015, after the University of Missouri protests, the Oberlin Black Student Union issued a 14-page letter making 50 demands of the administration. They included exclusive “safe spaces” for black students and the elimination of graduation requirements for classes in Western civilization.\nLast November, Oberlin students targeted Gibson’s Bakery, a beloved store in Oberlin, Ohio, after an employee called police when he saw someone attempting to shoplift by concealing two bottles of wine under his jacket. The accused shoplifter turned out to be a black Oberlin student.\nThe Black Student Union, Oberlin Student Senate and College Democrats spearheaded a boycott of the bakery and organized protests outside of the store. Even the Oberlin administration, responding to calls from Black Lives Matter supporters on campus, stopped purchasing goods from the bakery.\nThree students involved in the incident ended up pleading guilty to attempted theft and aggravated trespassing. As part of a plea deal, the students acknowledged that the bakery’s actions were “not racially motivated” and that the store was “merely trying to prevent an underage sale.”\nMost of the enrollment deficit at Oberlin came from a smaller-than-expected freshman class, which totaled 742 instead of a projected 805.\nPeter Wood, president of the National Association of Scholars, said that drop-off is more serious than it may appear.\n“That doesn’t sound like an astonishing number of people not coming, but weighed on a percentage basis, that’s a huge drop in just one year,” Mr. Wood said. “And Oberlin has for some time been struggling to make its classes. This wasn’t just some negligence: ‘Oh, we didn’t realize that we had to try harder to get students.’ They’ve been trying really hard to get students, and students just aren’t coming.”\nHe said Oberlin can easily recoup the $5 million deficit by cutting the “apparatus of political correctness” that has swelled in the past several years. When that happens, he said, it will be a sign that the school is serious about reform.\n“The signal that I would look for is when they begin to divest from the large number of personnel who are employed wholly because of their political orientations,” he said. “When that happens, I think we will have seen a college that has decided to reposition itself in the market. Until then, it’s all just show.”",
    "title": "Enrollments, budgets fall short at universities known for ‘social justice warfare’",
    "subreddit": "MensRights",
    "timestamp": 1505503566,
    "score": 85,
    "keyword": "black director"
  },
  {
    "text": "Protestors failed –> CAFE will represent men's issues in the RUN4HOPE Marathon May 7th. *A statement from Phil Johnston, CAFE Vancouver Branch Director:*\n\nSince 2014 I've been proudly volunteering for CAFE Vancouver as it's Branch Director to give voice to men's issues in hopes that the message \"equality includes everyone\" is heard and understood. That's why I knew participating in the RUN4HOPE was a perfect fit. Though, [some people](http://www.cbc.ca/news/canada/british-columbia/cafe-bmo-marathon-men-s-charity-sexual-violence-assault-1.4057052) wouldn't agree with me.\n\nThis Sunday, May 7th at 7am, Jeridan Kowal [(my running bro, pictured left)](http://i.imgur.com/0210Y0f.jpg) and myself will be running a half-marathon on behalf of CAFE and proudly flying it's colours to raise awareness of men's issues, and particularly men's mental health (more on that in a moment). I have a favour to ask, but first a couple points:\n\nFirstly I want to thank Jeridan for supporting me and dedicating himself to our running program that has resulted in me shedding over 25+ pounds! Having him in my corner made all the difference when rain, taut muscles, or just a plain bad mood tempted me to cancel a training session.\n\nSecondly I want to dedicate my run to my brother Russell, who was diagnosed with severe depression in his early teens. He was not alone in our family in being kept company by this \"black dog\" (my sister, mother, and myself also have wrestled with it) but, by far, he was the most impacted. Russell is intelligent and kind, but has chosen to withdraw from the world for over 20 years as a means of coping. I run in hopes that he, and others like him, will find his voice and re-emerge into the world on his terms, with no apologies.\n\nI believe better resources are needed to address men's mental health issues - and that's why all donations to our RUN4HOPE fundraiser will go directly to funding a Vancouver Centre For Men & Families to be opened in 2018.\n\nPlease support team CAFE in the RUN4HOPE marathon and let's make a difference together.\n\n[Donation link](https://www.crowdrise.com/canadian-association-for-equality/fundraiser/philipjohnston3)",
    "title": "Protestors failed –> CAFE will represent men's issues in the RUN4HOPE Marathon May 7th.",
    "subreddit": "MensRights",
    "timestamp": 1494010203,
    "score": 66,
    "keyword": "black director"
  },
  {
    "text": "From The Archives (2003) - \"The Greater Outrage for Female Victims of Governments' Brutality Perpetuates Risk to Both Sexes\" **The Greater Outrage for Female Victims of Governments' Brutality Perpetuates Risk to Both Sexes**\n\n©2003 Jerry A. Boggs\n\nNothing, it seems, provokes the international community’s outrage more than the atrocities and lesser abuses that governments direct at women and girls.\n\nAmnesty International sounds [this alarm](https://web.archive.org/web/20061112150604/http://web.amnesty.org/library/Index/ENGACT770021996?open&of=ENG-373): “...[G]overnments have continued to inflict sexual, physical, and other psychological violence against women with impunity ... In recent years, the horrific stories of rape in Bosnia-Herzegovina and the mass rape by the military and the militia in Rwanda have shown how particularly vulnerable women are in conflicts – how they are often singled out for human rights violations which are not inflicted on men and how assault on a woman’s body is used as a weapon of war.”\n\nIn a speech to the First Ladies' Conference on Domestic Violence in San Salvador in 1998, feminist politician [Hillary Clinton said](https://web.archive.org/web/20061028234519/http://clinton3.nara.gov:80/WH/EOP/First_Lady/html/generalspeeches/1998/19981117.html), “Women have always been the primary victims of war. Women lose their husbands, their fathers, their sons in combat. Women often have to flee from the only homes they have ever known. Women are often the refugees from conflict and sometimes, more frequently in today's warfare, victims. Women are often left with the responsibility, alone, of raising the children.”\n\nUnited Nations Secretary-General Kofi Annan, at the March 1999 Inter-Agency Videoconference for a World Free of Violence against Women, [lamented](https://web.archive.org/web/20080325035702/http://www.scienceblog.com:80/community/older/archives/L/1999/A/un990269.html), “Violence against women is perhaps the most shameful human rights violation. And, it is perhaps the most pervasive.\"\n\nAnd so it goes, up and down the international community, from human rights groups and heads of state, to organized feminists and the mainstream media – all regularly and rightly deploring governments’ savaging of females.\n\nYet when it comes to the inhumane treatment of noncombatant men and boys, nearly everyone seems to have incurred a severe case of laryngitis. By expressing little or no outrage for male victims of government barbarity — or altogether denying there are male victims, as Amnesty often seems to do — the international community does worse than merely expose an antimale bias that gainsays its own long-running plea for equal treatment of the sexes. It also helps perpetuate state-directed brutality against both men and women.\n\nPerhaps before one can even be willing to hear how a greater outrage over anti-female violence could possibly perpetuate this violence, one must be disaffected of the feminist-and-media-driven notion that females are overwhelmingly the marks for governments’ enormities. One must be convinced that men, including non-combatant men, are marked at least as much and that an equal outrage for male victims is therefore justified.\n\nEnter Adam Jones. He is executive director of the Canadian-based human rights group, [Gendercide Watch](http://www.gendercide.org/), and professor of international studies at the Center for Research and Training in Economics in Mexico City. Defining “gendercide” as gender-selective mass killings, Jones has amassed considerable documentation and published scholarly works showing that non-combatant males are subjected to atrocities and mistreatments comparable to, and in many cases worse than, those dealt females.\n\nNon-combatant men, says Jones, “have been and continue to be the most frequent targets of mass killing and genocidal slaughter, as well as a host of lesser atrocities and abuses. The mass killing of males, particularly of ‘battle-age’ men, has roots deep in the history of conflict between human communities. Despite this prevalence of gendercide against males...the subject has received almost no attention across a wide range of policy areas, humanitarian initiatives, and academic disciplines. We at Gendercide Watch feel it is one of the great taboos of the contemporary age, and must be ignored no longer.”\n\n(Jones puts “battle-age” in quotation marks “to problematize a term that rolls off the tongue too easily. The ‘battle-age’ construction implicitly assumes that if a male is of an age that renders him liable to military conscription and combat, his entire identity should be so defined. This renders the analyst complicit with those who would subordinate the destiny of ‘battle age’ males to this outside demand – akin to defining women by their capacity to be raped, and suggesting as well that ‘battle-age’ men are ‘asking for it.’ With this equation of males and combatants completed, the analyst or policymaker can move to the final stage of effacing all non-combatant males from the policy and analytical equation, a phenomenon that is also commonplace.”)\n\nJones’ Gendercide.org is rich in examples of widely ignored gendercides against males. Some from the 20th century are:\n\n* Kosovo, 1999: “Although the Milosevic regime's genocidal assault on Kosovar society swept up all other sectors of the population, killing many and expelling hundreds of thousands, the most systematic and severe atrocities were inflicted disproportionately upon non-combatant men.”\n\n* Srebrenica (Bosnia), 1995: “The long-term success of ethnic cleansing depended on killing off the Muslim men, without whom the population's women and children would have no means of returning.”\n\n* Rwanda, 1994: “[After the massacre] Rwanda became a country of women. It is currently estimated that 70 per cent of the population is female and that 50 per cent of all households are headed by women.” \n\n* Iraq, 1988, 1990-91: During the 1990-91 Gulf War, though officials and the media decried Iraqi troops’ abuse of Kuwaiti and foreign women, little was said of the broader Iraqi system of detention, torture, and execution of tens of thousands of Kuwaitis who were nearly all male. The Iraqi regime’s postwar attack on the Shia “marsh Arabs” in southern Iraq appears to have been highly gender-specific. A Middle East Watch researcher explained, “The troops are arresting all males over 15 and taking them to Radwaniyeh [prison camp]. They’re never seen again.” Thousands are estimated to have died, often after horrific torture. In 1988, during the suppression of rebellious Iraqi Kurds, Middle East Watch reported instances in which men and boys among the captured villagers were executed on the spot. Many tens of thousands of Kurdish males disappeared. The organization suspects that most of them, if not all, were murdered by Iraqi security forces.\n\n* Delhi, 1984: In “Delhi: Gangster Rule,” Madhu Kishwar reports on the 1984 anti-Sikh rioting in New Delhi following the assassination of Indira Gandhi: “The nature of the attacks confirm [sic] that there was a deliberate plan to kill as many Sikh men as possible, hence nothing was left to chance. That also explains why in almost all cases, after hitting or stabbing, the victims were doused with kerosene or petrol and burnt, so as to leave no possibility of their surviving. Between October 31 and November 4, more than 2,500 men were murdered in different parts of Delhi, according to several careful unofficial estimates. There have been very few cases of women being killed except when they got trapped in houses which were set on fire. Almost all the women interviewed described how men and young boys were special targets. When women tried to protect the men of their families, they were given a few blows and were forcibly separated from the men. Even when they clung to the men, trying to save them, they were hardly ever attacked the way men were. I have not yet heard of a case of a woman being assaulted and then burnt to death by the mob.”\n\n* Bangladesh, 1971 (then East Pakistan): In February of that year, the generals of West Pakistan decided to crush the Awami League, which had demanded regional autonomy for East Pakistan and an end to military rule. “Kill three million of them,” said President Yahya Khan at the February conference, “and the rest will eat out of our hands.” At the end of this brutal campaign, 80 percent of the estimated 3 million lives taken in the systematic mass killings were males, many of them adolescent boys.\n\n* World War II, 1941-42: During Operation Barbarossa in just eight months of 1941-42. Invading German armies killed approximately 2.8 million Soviet PoWs through starvation, exposure, and summary execution. “This little-known gendercide,” says Adam Jones, “vies with the genocide in Rwanda as the most concentrated mass killing in human history.” Adam Jones classifies this as a gendercide because “PoW did not just mean men who had seen military service. Nazi policy was explicitly that all men between 15 and 65 were to be taken to PoW camps.”\n\n* Armenia, 1915: According to Jones as interviewed in March 2000 by the Ottawa Citizen’s Christina Spencer, “The first step of that brutal terror was the disarming of conscript Armenian soldiers in the Turkish army. They were turned into pack animals, ‘driven by the whips and bayonets of the Turks into the mountains.’ The weak were left to die or were shot. Next, civilian males were taken from their towns and slaughtered. At this point, the rest of the population -- women, children, the elderly -- were deported.”\n\n\n||\n|:------:|\n|Forty million Soviet men were killed between 1914 and 1945. Some families lost every man in the family: dad, son, brother, uncle. Yet a headline in Parade, the largest-selling weekly magazine in the world, reads “Short End of the Stick” with the article explaining Soviet women are getting the short end of the stick because they are stuck with factory and street-cleaner positions. In Bosnia, the civil war has wiped out men so disproportionately that only 30% of the Bosnian population are men. Do headlines tell us, “War leaves Bosnia with 30% Men”? No. Parade’s headline reads, “Women Look to Gain Power in Bosnia.” The focus on the sacrifice made by men as a gender was not only ignored, but Bosnia has specifically been used as an example of the type of war in which both sexes are killed equally. When there’s a story about a man being killed, the focus is not on the sacrifice of men, but of their role. We discover the sacrifice of men as a gender only when it is needed to help us understand the new burdens on women. — ***The Myth of Male Power***, by [Warren Farrell](https://web.archive.org/web/20071107132658/http://mensnewsdaily.com:80/archive/f/farrell/farrell_5.htm)|\n\n**Adam Jones** also tackles military conscription as a gender-selective abuse. Though sexual slavery of females is easily seen as such an abuse, conscription is not. But Jones says it is “a variant, perhaps the most destructive one, of forced labour, an institution that has led to millions of overwhelmingly male deaths throughout history.” More than 36 million military men died in the last century’s top 20 wars alone. Even today the Russian Army, according to Gendercide Watch, “remains a death-trap for conscripted men – though not at the hands of a foreign invader. As many as 10,000 soldiers die each year from hazing, assaults, murder, and suicide.” In Afghanistan in 2001, because the media blitzed us with reports – justifiably so – on how the Taliban oppressed Afghan women, hardly anyone learned how life was for Afghan soldiers. In pre-Taliban times, when Afghan women enjoyed many rights, war still took a heavy toll on the men. Of Afghanistan’s conflict with the Soviets that began in 1979, Tamim Ansary, a writer in San Francisco, said in a Salon article: “The refugees in Pakistan, those millions who lived in the squalid camps that spawned the Taliban, were mostly the women and children of the men who stayed in the country to fight the Soviets and die like ants.” Ansary omitted the fact that the vast majority of these males, many in their teens, fought because they were forced to do so, and that the requirement to risk dying “like ants” was not thrust upon females. The later advent of the Taliban and its oppression of Afghan women did not mean that males no longer had to worry about war, about being killed or horribly maimed in battle. For some Afghan men, their fate came earlier than expected from their own government, as when Taliban forces, preparing for their war with America, began conducting house-to-house searches for recruits. “Some recruits who refused to join up,” said the Washington Post citing a defector, “were shot....”\n\n||\n|:------:|\n|\"...[I]f they [warring tribes] couldn't recruit able-bodied young boys, they simply kidnapped them. Most of the recruits were 12, 13, 14 years old, but some were young as 6.\" —*Wray Herbert, U.S. News & World Report, December 29, 2004*|\n\nTo better appreciate the gender dimension in military conscription, consider that some countries engaging in guerrilla warfare conscript boys young as six! In Sierra Leone in 1999, says Carol Bellamy, executive director of the UN Children’s Fund, seven-year-olds were among the 2,000 child soldiers who were under arms. Boys are often abducted from their homes, beaten, and told, “You either fight or we will kill you.” The humanitarian group Save The Children estimates that more than 1.5 million child soldiers – virtually all boys, by my estimate – have been killed in conflicts from Bosnia-Herzegovina to Kashmir from 1985 to 1995. Consider next that although often desperate for soldiers, the countries that recruit young boys rarely recruit, say, 15-to-17-year-old girls, who are much bigger and stronger than 7-year-old boys, emotionally as well as physically, and hence more combat-capable and militarily useful. ([The Coalition to Stop the Use of Child Soldiers](https://web.archive.org/web/20061103001657/http://www.child-soldiers.org:80/) says, “In many countries, girls too are used as soldiers, though generally in much smaller numbers than boys.”) The reasons for the conscription of boys undoubtedly include chivalry and the convenience of same-sex armies. But perhaps above all, the nations using boy soldiers may suspect that if in the name of gender equality they equally conscripted girls, the number of people around the world decrying the use of child soldiers — and the efforts to rescue the children — would surge a hundred fold and possibly deprive them of a valuable resource.\n\nStill another broadly ignored government brutality that targets males, as Jones indicates, is the forced labor of civilians. “Throughout history and continuing in modern times,” he wrote in an April 2001 letter to the International Labour Organization (ILO), “the practice of forced labour has overwhelmingly targeted adult able-bodied men, leading to millions if not tens of millions of deaths. Despite this grim record, the ILO’s Forced Labour Convention designates one group and one group only as legitimate targets for forced labour [stress added]: these same adult able-bodied men. Article 11 of the Convention states that ‘Only adult able-bodied males who are of an apparent age of not less than 18 and not more than 45 years may be called upon for forced or compulsory labour,’ so long as ‘ they are physically fit for the work required and the conditions under which it is to be carried out’ and ‘the number of adult able-bodied men indispensable for family and social life’ is allowed to remain in communities targeted for forced labour. In addition, the ILO states that both the forced labour involved in military conscription and the use of prison labour are acceptable under the terms of the Convention. Both of these institutions, of course, target males close to 100 percent of the time.” As just one example of forced male labor, the International Committee of the Red Cross charged that during the Bosnian war, hundreds of people in Serb-held areas were “being forced into what amounts to slave labor in dozens of towns and villages....” The forced laborers were, “for the most part, Croatian and Muslim civilian men.”\n\n||\n|:------:|\n|Imagine the international community’s outrage if the ILO Forced Labour Convention designated only able-bodied females as legitimate targets for forced labor.|\n\nOn rare occasion forced laborers are women. Even then they are luckier than the men. Addressing the enslaving of black Christians in Sudan by Arab militias, newspaper columnist Walter Williams wrote, “They shoot the men and enslave the women and children.” His topic, like that of many who opine on Sudan’s troubles, was slavery. It was not the greater atrocity of men being killed. This atrocity he brought up only once, in passing. He then quickly returned our attention to the women and children. It isn’t difficult to guess what would have been his topic — or how much more vociferous would be the media and feminists — were the Arab militias enslaving the men and children and shooting the women.\n\nAn anti-female atrocity, one that is widely deplored by the media and thus made well known to the world, is “honor” killings or disfigurings of women who disgrace their families. This violence, while not state-directed, is still ignored by police often enough to be deemed virtually government-sanctioned. Covering the topic for ABC television’s “20/20” in January 1999, correspondent Diane Sawyer intoned somberly, “In Jordan alone, a quarter of all the homicides are honor killings, an average of 25 women at least every year.”\n\nThe male counterpart to honor killings is the “blood feud.” It is rarely mentioned in the media and is therefore almost unheard of. It is even more ignored by governments than honor killings of women.\n\nThe institution of the blood feud, dating to the 15th century and extant in the Balkans, Sicily, and Corsica, was established for the purpose of “cleansing honor.” Offenses to honor include calling a man a liar and insulting a man’s wife. Offenses are paid for, and honor cleansed, says Noel Malcolm, author of Kosovo: A Short History, “by killing any male member of the family of the original offender, and the spilt blood of that victim then cries out to its own family for purification.”\n\nThe blood feud has always exempted females, since killing a woman is considered an extreme violation of a man's personal honor. “The strongest taboo of all concerned the murder of women,” says Malcolm, “and any woman could walk through raging gunfire in the knowledge that she would never be shot at.” Conceivably, assuming Malcolm’s definitions of the blood feud and the “strongest taboo” are correct, a woman could kill a man in another family, then, to avenge his death, that family would kill not her but a male in her family! How quickly would the international community stop ignoring blood feuds if they permitted a man to kill a woman in another family, then, to avenge her death, permitted that family to kill not him but a woman in his family?\n\nSince the collapse of the Soviet Empire, blood feuds have returned full-throttle in Albania, where reconciliation attempts have seen limited success. “Every year,” says Adam Jones, “at least a thousand men and boys die in blood-feud killings in Albania alone; the lives of tens of thousands more are spent in isolation and perpetual fear.” Yet, in covering honor killings, ABC’s “20/20” kept its millions of viewers in the dark about blood feuds and about the vastly larger number of murdered males. It left them to feel outraged only at the “average of at least 25 honor killings of women each year in Jordan alone.” Apparently to “20/20's” staff, the murder of 25 women is more outrageous – and more news-worthy – than a thousand murdered men and boys.\n\nFurther exemplifying their greater mistreatment of males, governments often punish males more severely than females for the same violations of law. This was true of Afghanistan’s Taliban government, though the mainstream media painted the opposite picture with their exclusive focus on that government’s oppression of women. The Taliban’s penal code required that males be punished for violations by females. In December 2001, a Detroit-area television station ran a story about an Afghan woman who defied the Taliban by operating a school. When Taliban troops discovered her, they beat her father.\n\n||\n|:------:|\n|When an Afghan man or any other man must endure brutality as well as shame for the religiously “inappropriate” or “illegal” behavior of his family members, we can better understand why he so strongly “wants to control\" his children and his wife: from his view, it makes more sense for them to be oppressed than for him to be both oppressed and brutalized, especially if for a while after being beaten he is unable to work and support them.|\n\nThe Taliban’s penal code also mandated that males be arrested for many other “violations.” “While a woman can be beaten if her face accidentally shows from under her head-to-toe covering,” writes gender expert Cathy Young, author of Ceasefire! Why Women and Men Must Join Forces to Achieve True Equality, “a man can be beaten if his beard isn't long enough. While a woman who commits adultery faces execution, the same fate awaits her male lover.” Men were punished even if they didn’t break a certain “rule.” Taliban forces systematically detained and executed male civilians in north-central Afghanistan to deter communities from cooperating with opposition forces. According to one report, Taliban troops were repeatedly described as rounding up unarmed men and boys from their homes and work sites and shooting them in the head. There were no reports of females being shot in the head to deter communities from violating the “Don’t cooperate” rule. Such punishments of Afghan males, unlike those of Afghan females, somehow failed to get a lot of coverage in the mainstream media, especially national television, the sole source of news for a huge number of Americans.\n\nSocial researcher Warren Farrell, author of the riveting [Father and Child Reunion](https://www.amazon.com/Father-Child-Reunion-Bring-Children/dp/0615223931), tells of the 1990 Associated Press story about Bobby Sherrill, who worked in Kuwait. When Sherrill returned to the United States, he was arrested, handcuffed, and taken before a magistrate. He had failed to pay full child support for ninety days. The reason? While he was in Kuwait, Iraq invaded the country and he was kidnapped and taken hostage for three months, during which his father paid some but not all of the support. This explanation failed to impress the magistrate, and he demanded an immediate cash payment. Because Sherrill did not have it on him at the time, he was jailed. (There must be an unwritten law somewhere that requires non-custodial fathers to always carry with them a large sum of cash.)\n\nWhat if Sherrill had been a woman? It is extremely difficult for me to believe she would have been treated so unmercifully for being unable to pay child support as a result of her being kidnapped, being held hostage for three months, and having no cash on her when arrested. Few magistrates would have had the will to jail her under such circumstances and risk incurring the public’s wrath, especially feminists’ wrath. Cathy Young would appear to agree. In Ceasefire! she writes: “There is a deeply entrenched habit in our legal system and our culture of treating female offenders more leniently....” If it were male offenders who were treated more leniently, no doubt many in the media and feminist circles would describe the situation for female offenders as an atrocity. Yet because it is men who are treated less leniently, little is said of it and few people realize that even in the United States, which is often called the world’s most civilized nation, mostly men are denied the civilized part by their government.\n\nCathy Young serves up another example of more severe male punishment: “When American teenager Michael Fay was sentenced [in 1994] to be caned for spray-painting cars in Singapore, the public debate centered on whether harsh penalties were too high a price to pay for public order. The fact that caning is imposed only on men was barely noticed. What if a teenage girl were to be whipped for a petty offense in a country where this penalty was reserved for females? Wouldn’t women’s groups, politicians, and the media have treated this as an outrage against women?” Young apparently thinks yes, for she wrote earlier in a Detroit News column, “...[I]t’s a fact that violence against women shocks us far more than violence against men.”\n\nAnd it is this fact — which is the worst sexism — along with stepped-up feminist pressure to end violence against women worldwide, that has influenced the international community to protest anti-female atrocities and abuses to the point that, as Adam Jones says of Canada’s female-focused mobilizing efforts around ex-Yugoslavia, “one could forget any other category of victim exists.”\n\n**While** the international community’s outrage mostly for female victims intends well, it helps perpetuate governments’ brutality against both males and females for the following reasons:\n\nFirst, there is little evidence to support feminists’ claim in recent years that the greater outcry for female victims has resulted in rape and sexual slavery being taken seriously as war crimes. Cathy Young wrote in September 1996: “‘It's about women and children being tortured and murdered,’ said a Court TV ad for the war crimes trial dealing with the horrors in the former Yugoslavia. Earlier this month, women's rights activists at the 7th International Forum of the Association for Women in Development in Washington, D.C., said the atrocities against women in the Balkans might not have happened if rape and sexual slavery had been taken seriously as war crimes after World War II. Let's look at what has happened to Bosnian men. Time after time, Serb troops would separate the adult men from the women and children, load them onto buses and take them to concentration camps. Many men were subjected to horrible tortures, even forced to sexually mutilate each other. Thousands were massacred. That such crimes were taken seriously after World War II apparently did little to deter the perpetrators.”\n\nAs long as the international community’s outrage is mostly for female victims, some warring groups may think eradicating males will more or less be tolerated if care is taken to safeguard females. But in reality, waging war on males while trying not to harm females is somewhat akin to dynamiting a garden in a vain attempt to kill the weeds but not the vegetables. As stated, women are often beaten or killed for trying to impede warriors’ all-important objective of slaughtering men and boys. Sometimes women simply have the misfortune of being in the path of marauding troops whose respect for life has been traumatized out of them because they have been, Jones says, “brutalized and indoctrinated into committing atrocious and genocidal acts against civilian populations or disarmed enemy forces.” They are not unlike the U.S. troops who in the Vietnam War massacred 300 My Lai villagers, including infants. Such hardened soldiers, realizing they have already committed war crimes against non-combatant males and that their own lives can be violently concluded at any moment, may only sneer at threats of prosecution for committing war crimes against females. Some of them, perhaps having learned of the international community’s demand for treating the sexes equally, may also have learned of the international community’s unequal concern for male victims of governments’ barbarity. Perhaps they are inwardly offended and angered by the hypocrisy and sexism – as a lot of female soldiers surely would be if the concern were mostly for males. “Why should I care for others,” they may think, “when no one cares for me?” Horrible as it is to contemplate, some soldiers may be embittered enough to react to warnings to tread carefully around females in the same defiant manner in which recalcitrants react to “Keep off the grass” signs.\n\n||\n|:------:|\n|“In large part, the atrocities of war are committed as a response to the fear men feel. Terror and humiliation are the combustible fuels of rage.” — Patricia Pearson, *When She Was Bad*, p. 53 hardcover|\n\nHistorically, warring nations and tribes have attacked the enemy’s civilian population as a strategy to terrorize and demoralize. The idea is that if an attack on civilians is massive and shocking enough, an enemy nation might lose its will to fight and surrender, either on its own or under pressure from its citizens. One such attack is the mass sexual assault of women. It often succeeds in terrorizing and demoralizing because, to repeat Cathy Young, violence against women shocks us far more than violence against men. Thus, the more we protest only atrocities against women, suggesting that this violence is more psychologically damaging to a nation, the more we signal that, as Amnesty International puts it, “assault on a woman’s body [can be] used as a weapon of war.” It is true that were the outrage for male victims and female victims equalized tomorrow, the strategic value of assaulting women might not change for some time; the media- and feminist-fueled construct of women as helpless, vulnerable, and deserving special protection — like children — is simply too ingrained in everyone’s psyche. But the international community’s current trend of denouncing only or mostly the atrocities against females can, in the eyes of some warring nations, only help sustain the value of those atrocities.\n\nThe lesser outrage for male victims (it’s lesser largely because for many people “man as victim,” like “woman as victimizer,” is repellent) tends to reinforce – and may in part stem from – the view of males as disposable. Many of us see males this way, explains Warren Farrell, “because we have learned that the more effectively we prepare men to sacrifice themselves, the more we feel protected.” This need for protection, along with the need of a nation to show its will to fight and defend itself from aggressors, may cause many people to think men should be considered disposable. But this view of males carries a significant downside that seems to be rarely thought out. For every aggressive nation or group that “men are disposable” unnerves, it may prompt one or two others to prematurely reject non-violent methods of resolving conflict, and to choose war, setting in motion the atrocities that claim many lives of both males and females.\n\n||\n|:------|\n| [Warren Farrell](https://web.archive.org/web/20060622214727/http://mensnewsdaily.com:80/archive/f/farrell/farrell_1.htm): There is something about women’s role that is also never mentioned. Can you figure it out? Women not sacrificing their lives in war is never discussed as female privilege, as matriarchy.|\n||\n|We saw in the Canadian study of newspapers discussed above how violence against women was portrayed disproportionately to men’s, and was personalized even as men’s was at best a cold statistic.|\n||\n|Here’s why this bias hurts women....|\n||\n|When only women’s suffering is personalized, it motivates us to rescue the woman and assume the cause must be the man. So in problems like domestic violence we blame the man and ignore the male-female dance that leads to both sexes battering each other equally.|\n||\n|This hurts women because, when the man feels he is the assumed cause, he becomes resistant to counseling. He experiences the counseling as identical to his wife – unable to hear him. To him, the counseling is now part of the problem. No, it’s worse than that. Hope disappears, and cynicism appears. And it doesn’t stop there.... He feels both his wife and the system are ganging up against him. Now it’s him against the world, and that’s the set up for mass killings followed by a suicide, which is, and will remain, the male style until men become no more or less worthy as victims than women.|\n\n**Human** rights groups, feminists, the mainstream media, and UN Secretary-General Kofi Annan must cease, as Prof. Adam Jones puts it, “hierarchizing human suffering” to the extent that, for example, “the mass rape of women is privileged over the mass slaughter of (non-combatant) men.” Politicians such as Sen. Hillary Clinton must understand that women do not become war's primary victims by surviving genocides and being driven away from their homes to squalid camps where they have the hope, however dim, of rescue and restoration. War's primary victims are, and have always been, the men who are killed — the husbands, fathers, and sons of the women whose lives generally are spared.\n\nThe international community must express an equal outrage for male victims of atrocities and other abuses. It is a matter not only of honoring true gender equality, but of curbing governments’ brutality against both sexes. As the nuclear age advances, it may also be a matter of preserving our very existence.\n\n***[posted Wednesday, 17 December 2003](https://web.archive.org/web/20061029083745/http://battlinbog.blog-city.com/governments_violence_against_the_sexes.htm)***",
    "title": "From The Archives (2003) - \"The Greater Outrage for Female Victims of Governments' Brutality Perpetuates Risk to Both Sexes\"",
    "subreddit": "MensRights",
    "timestamp": 1495710751,
    "score": 7,
    "keyword": "black director"
  }
]