[
  {
    "text": "Finished grad school, got hired by a very prestigious organization in a position that I am frankly unqualified for and don't want to make a career out of. What do I do!? (X-post from r/career guidance in order to case a wider net) Buenos Nachos, good people of r/jobs.\n\nSo, last March I finished grad school. I fairly randomly applied to a data-science position with a world-renowned nonprofit which is a BIG name in my field. I never really expected to even interview for the position, let alone be offered the position. As I said, it's a data-science type position, which involves a fair amount of computer programming and statistics. Frankly, I'm utterly unqualified. I spent about 6 weeks learning enough about programming in a particular language to be able to sound like I knew what I was talking about during the interview, but outside of that, I had no CS experience. I also only took one math class ever in both my undergraduate and graduate programs.\n\nI honestly have no idea how I landed a job offer, but given that this organization is so well known and well respected and in my field, I of course said yes. I've been working in the position for the past six months, and I've been doing everything I can to try and learn what I need to know to fulfill the responsibilities of this position.\nI've spent the last 6 months learning what I can about computer programming and statistics, and doing my best to complete any projects and assignments I've been given. I've spent hundreds of dollars on CS and stats textbooks to try and learn what I don't know, to try and be able to do this job, but I don't think it's working. The CEO and my Department's director have both expressed that they are impressed with my work, thought to be honest, I suspect that they simply don't know enough about it to spot that I have no idea what I'm doing. I often, as in on a near daily basis, feel like someone is going to realize that I really have no clue what I'm doing, which is incredibly uncomfortable.\n\nThe most important aspect of all this, I feel, is that the longer I'm in this position the more I realize that despite the potentially highly lucrative career opportunities, should I be able to make a career out of this type of work, it's not work I want to do for the next 30 years.\n\nSo, I guess that brings me to my question. Given that this data-science field isn't a field I'm comfortable in, and a field that I don't want to be in forever, and I really only accepted the position because having work for this organization on my resume will open doors in my field, what do I do? On the one hand, the longer I work for this organization, the better it looks, and I certainly don't want to leave after only being here for six months. On the other hand, when it eventually comes to light that I really have no clue what I'm doing (which I suspect will happen as soon as we try to publish a scientific paper I was requested to write, because people that actually know what they're doing will look at my work and instantly recognize that I'm clueless), I'm afraid that it will leave an indelible black spot on my career.\n\nSo how do I resolve that conflict between knowing that this isn't the type of position I want to make a career out of, knowing that I truly have no idea what I'm doing, wanting to have a position with this organization long enough that it will open doors for me, but having that feeling of dread and ticking time bomb-ness that eventually someone is going to realize that I am utterly unqualified for my position? Do I cut bait and start applying for positions that I'm actually qualified for/want to make a career out of immediately? Do I sit in my corner cubicle with my head down, wait for the other shoe to drop, and deal with that fallout when it happens? Do I wait around for another 6 months or a year and try to get out before anyone realizes that I have no business being employed in this position?\n\nI'm familiar with \"impostor syndrome\", and freely acknowledge that feeds in to some degree to my feeling of being a fraud, which is exacerbated by the fact that I often find myself going days at a time without really any \"work\" to do. However, I also freely acknowledge that, objectively, I do not have the technical skills or education to perform this position exceptionally and it is only the fact that no one in the building is a computer scientist or statistician that has prevented that revelation among my superiors.\n\ntl;dr - I bullshitted my way into a highly technical position with a leading organization in my field, I don't want want to make that position into a career (and I'm not sure I'm capable of doing so if I did), and I'm not sure how, or how quickly, to extricate myself before someone with the ability to fire me realizes I'm horribly out of my depth. What do I do?\n\nThanks for the advice, and I apologize for the ridiculously long post.",
    "title": "Finished grad school, got hired by a very prestigious organization in a position that I am frankly unqualified for and don't want to make a career out of. What do I do!? (X-post from r/career guidance in order to case a wider net)",
    "subreddit": "jobs",
    "timestamp": 1488823935,
    "score": 2,
    "keyword": "black ceo"
  },
  {
    "text": "FDM Group IT Training Scam, Fraud & Deception There are many agencies and firms that claim to provide you with 'jobs' and 'training', but there is one particular company who seem to con some people and a few of my friends. Unfortunately, I was also conned by this disgraceful firm. This firm is called 'FDM Group'. The FDM Group and their 'Academy' scheme are simply a con. There are a few things you should be aware of. They mostly do NOT guarantee you a job in IT after training with them. Most people I know were forced to take up positions that were not related to their IT training. For example, one of my friends who wanted to be a Java programmer, was never actually given a job in programming. He was doing their training and then pushed into a 'call-centre' job doing some IT support - nothing to do with Java or programming. They struggle to put people into their so called 'guaranteed' jobs so they pressure you into doing something a 'bit' different - so they make their money out of you with a 'huge' cut in commission out of your wages. In fact, FDM Group employs sales people who have NO knowledge of the IT industry - it is no wonder that they supply jobs that are not even IT-related.\n\nI was simply conned from the start with FDM Group and their dodgy contract. They make you sign a contract before your training which contains some dodgy clauses in it. They employed an old faggot called Scott Black who is used to lure people into this deception and false contract. Scott Black is another guy who has been used to contribute to the scams of this firm. The FDM Group like to scare-monger people into doing the jobs that they want you to do - not what you actually want to do or have trained to do. After starting with the FDM Group, I heard rumours from a few other colleagues about the scare-mongering tactics that are used. Mr Scott Black and other staff members have been employed to do this scare-mongering activity. They tried to threaten me once and forced me to take a job with a Bank that was not IT-related and nothing to do with my vast range of IT skills. They might seem nice at first, BUT after you sign their contract you are simply stuck in a rut with their scam. Please note that you are NOT guaranteed 2 years of work after training. Their contract contains a dodgy clause in it - they can 'terminate' your contract at any time and for any reason at all. If you don't comply with their wishes of doing any bullshit job then they can use their dodgy contract to get of rid you at any time. While I did their training, I received hardly any support from their trainers who were pathetic in their attitude towards me. Most of the training itself is copied off the internet - you could probably find much of it already on the net. This is what other trainees told me after I started with FDM. After using and abusing me, they discarded me like a piece of shit. They used me as just another scape-goat for their fraudulent activities. FDM Group were going through some turbulent times and struggling – so to cut their costs……they cut a lot of jobs, and owe 1000s in wages.\n\nI later discovered that this firm was investigated for fraud and deception. In particular, their operations manager, Steve Buxton was investigated and convicted of several counts of fraud by conning many graduates and promising them with careers and training in IT. As well as a racist, who abused many workers, he obtained 1000s of pounds from vulnerable graduates who were desperately seeking their careers in IT. In 2003 Steve Buxton was convicted but narrowly escaped a prison sentence. He already served a prison sentence in the 80s for Fraud, but his close connections to important people at the FDM Group helped him to secure a new future and conceal his criminal past. The FDM Group managed to pull some strings in order to cover up the traces of most of their fraudulent activities. Their CEO, Rod Flavell and his assistant, Julian Divett, were also investigated for their part in the scam. Due to their cold hearted manipulation of people, they concealed their traces of illegal activity that they still continue to this day. They have changed their management staff and shuffled their executive team to hide the scamming and fraudulent activities.  Rod Flavell and his staff are despicable fraudsters and con artists who deceive and target vulnerable young people who simply want a future in the IT profession. It is astonishing that this firm is still in business and still trying to con many innocent graduates. What a shame to the IT industry.....The FDM Group mainly give pathetic or non-existent training, lack of support, bullshit jobs with fake promises and a dodgy contract. It's no wonder they were investigated for fraud and deception.",
    "title": "FDM Group IT Training Scam, Fraud & Deception",
    "subreddit": "consulting",
    "timestamp": 1492362592,
    "score": 5,
    "keyword": "black ceo"
  },
  {
    "text": "There Are Only 23 Black Owned Banks Left in America > Black-Owned Banks Hit Their Peak a Century Ago \n\n> In late 19th and early 20th century, 57 black-owned charter banks entered the system\n\n> Black-owned banks arose and flourished in a period when African-Americans were kept out of other financial institutions, both overtly and through practices that effectively walled off their neighborhoods from other banks.\n\n> The sector hit a peak in the late 19th and early 20th century, a period when 57 black-owned banks and credit unions existed. \n\n> Six CEOs of black-owned banks locked themselves in a New Orleans conference room for more than a day in late 2016. Surrounded by papers, drawing boards and PowerPoints, the group strategized ways to reverse a trend 15 years in the making: the decline of their own banking sector.\n\n> The number of black-owned banks operating in the U.S. has been dropping steadily for the past 15 years and fell to 23 this year, the lowest level in recent history, according to the Federal Deposit Insurance Corp. That has left many African-American communities short of access to capital and traditional financial services, according to some banking experts.\n\n> “We have a crisis among black banks,” said Doyle Mitchell, CEO of Washington-based Industrial Bank. “We met…to save the industry. To save ourselves.”\n\n> The 2008 recession hit the black banking sector especially hard, and if the current rate of closures of about two a year, as well as the industry-wide reluctance or inability to start banks, continues, black-owned banks could disappear entirely within the next eight to 12 years.\n\n> The trend is worrisome to some analysts who argue fewer banks serving low-income, minority groups could expand “financial deserts”—communities with few or no banking institutions—and increase the likelihood that black and Hispanic communities could become susceptible to redlining, a discriminatory practice that excludes poorer minority areas from financial services.\n\n> “These banks are banks that serve relatively poor neighborhoods,” said Russell Kashian, an economics professor who studies black-owned banks. “There are neighborhoods that if…the black-owned bank isn’t there, nobody is there.”\n\n> Most black-owned banks typically have a few branches in one city, although one of the category’s largest players, New Orleans-based Liberty Bank, has a multistate presence. Such banks comprise just a sliver of the overall U.S. financial sector, with collective assets of $5.5 billion, versus $16.3 trillion in the industry overall.\n\n> As a result, some economists question the significance of the sector’s decline. “Size-wise they’ve been small,” said Nicholas Lash, a business professor at Loyola University Chicago who studies minority banking. “So their total impact on black communities can’t be very, very large.”\n\n> Yet those who live in communities that have been served by black-owned banks say the impact there, both practical and psychological, is deeply felt. The most recent example is in Chicago, where Illinois state regulators in January closed Seaway Bank & Trust, determining that its financial health had so deteriorated that pumping in more money couldn’t save it.\n\n> “It was like air coming out of a balloon,” said Bob Fioretti, a former Chicago alderman who was previously involved in raising money to keep Seaway open. “People were deflated. Seaway was a standing icon of the community.”\n\n> Seaway, formerly Chicago’s largest black-owned bank, helped anchor the famed black business community on the city’s South Side.\n\n> Claire Adams, a former board president of a South Side Chicago housing community that was one of the first businesses to use Seaway when it opened in 1965, said she now fears that with fewer small, community banks in her part of the city, payday lenders and check-cashing institutions, which often charge exorbitant rates and fees, would be many African-Americans’ only nearby banking option.\n\n> “The only thing that’s left are these predatory institutions,” Ms. Adams said.\n\n> In some areas of the South Side, Seaway was the first bank some African-Americans had access to, making it a symbol of black enterprise and economic development, patrons say. Many speak of the bank with admiration, often mentioning a program that allowed children to open a bank account with a small amount of money.\n\n> “I [could go to] Chase or something…but I like Seaway,” said Nell Robinson, who has used Seaway for more than two decades. “Seaway was here before Chase. It’s a black bank [and], we have to pull our people up.”\n\n> With such concerns in mind, members of the South Side’s religious community raised more than $100,000 in deposits for Seaway in 2016. But the effort wasn’t enough. Seaway was sold to the State Bank of Texas, then sold again to North Carolina-based Self-Help Credit Union.\n\n> A prolonged period of low interest rates and intense competition, as bigger banks slowly move into underserved areas, have combined to contribute to the black banking sector’s decline, even after the recession’s end. Now a practical concern in Chicago and elsewhere is that, even if bigger institutions step in, they won’t be as accommodating in lending to black-owned businesses.\n\n> A survey of entrepreneurs by the U.S. Census Bureau in 2014 found that 47% of black business owners had gotten the full amount of funding requested from banks, credit unions or other financial institutions, compared with 76% of whites.\n\n> That survey also showed fear of rejection was the top reason cited by black business owners who chose not to seek needed capital at all.\n\n> “When I have an applicant that comes into my bank and comes into XYZ large bank, and they’re on the edges, there are things that I can understand and appreciate about their situation that XYZ large bank won’t, and that makes the difference,” Mr. Mitchell, of Industrial Bank, said.\n\nI feel like we have to do whatever we can to keep these financial institutions alive man. Some of these banks & credit unions have been serving us and our communities since before integration. No way we should let them down now by continuing to take our business to people who don't care about or respect us. \n\nI have an account w/ Industrial Bank here in DC which is black owned in fact it was my very first bank account ever. My parents are the reason for this, and I'm proud to say I still do business with them to this day.",
    "title": "There Are Only 23 Black Owned Banks Left in America",
    "subreddit": "blackladies",
    "timestamp": 1503677750,
    "score": 80,
    "keyword": "black ceo"
  },
  {
    "text": "WealthyLife | The Wealth Factory, Inc. (from CEO Angel Rich, the Black Woman that Forbes referred to as 'the next Steve Jobs')",
    "title": "WealthyLife | The Wealth Factory, Inc. (from CEO Angel Rich, the Black Woman that Forbes referred to as 'the next Steve Jobs')",
    "subreddit": "blackladies",
    "timestamp": 1506086992,
    "score": 8,
    "keyword": "black ceo"
  },
  {
    "text": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office So l worked in an all female workplace. I was marketing and communications manager for a nonprofit with a staff of 11. I did social media, desktop publishing, graphic design, web, light IT, anything to do with marketing. The new black female ceo came in and harassed me about everything she could take issue with like being \"intimidating\" because I'm tall. \n\n\nAfter three years of exemplary performance under the previous ceo they eventually fired me for leaving work 15 minutes early and called it \"job abandonment\" and denied me unemployment and hired a female to replace me. She lasted a few months since she couldn't do the job and they hired another woman I went to school with who was totally incompetent. \n\n\nI tried to get out before the fired me since I knew they were trying to pressure me out. I interviewed for a similar position at the nearby university but they hired one of my boss's middle age Hispanic female colleagues over me and the black female who interviewed me told my boss I interviewed for the spot. The Hispanic female they hired instead of hiring me called me a week later to ask me \"how to do what I do.\" Of course there was no reason for me to teach her how to do a job she should have known how to do to get hired in the first place nor could I teach her in a phone conversation what took me years of work and study to learn. They fired me about a week later. \n\n\nIncidentally I set up my email to forward to the new ceo before I was removed from the system after asking on my way out if they wanted me to do that as we had with other employees who had quit and they said yes then the new ceo called the police because I was \"harassing her\" with thousands of emails...from a company account I was not in control of that was set up to forward under her instructions. Because of my job I handled dozens of accounts for various platforms and software and got probably 100 emails a day, like analytics reports and such. My favorite part was near the end when her Outlook needed to be fixed she left the calender open on the desktop and it said \"make [myname] f up\" for a day that week.  \n\nThen she trashed my name all over town so nobody would hire me. I tried to be a stay at home dad and my wife and I broke up. Haven't seen my kid in 3 years. Thanks for making the workplace more diverse. I used to be a liberal.",
    "title": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office",
    "subreddit": "MensRights",
    "timestamp": 1497839644,
    "score": 68,
    "keyword": "black ceo"
  },
  {
    "text": "Just watched The Red Pill, here's some random thoughts First and foremost, it was an incredibly intelligent yet *mild* look at both pro and anti MRAs. In the end, she stayed level headed, gave us a summary, concluded her topics and said she's not a feminist anymore. A total Streisand Effect, thanks to the protests, who led us to believe that this is hate speech. I expected to be shocked. I expected a Michael Moore style of biased editing from the filmmaker. I expected a big, mean slant against feminists. But nope, she gave both sides a chance, and all we got were mental gymnastics from our critics. \n\nThings you should know about this documentary, if you haven't seen it yet: She focuses on a handful of pioneers for men's rights and sticks mostly with them, while bringing in other interviewees. Some of the primaries: The guy from A Voice for Men; Warren Farrell; a guy from the National Coalition for Men; an ex writer for Playboy who lost his son in family court, and a British woman who started the first women's shelter in Britain and was later ostracized for being critical. Plenty others that I'm forgetting.\n\nAs for the rest of the interviewees: I loved the chillness of Girlwriteswhat at the bar and was glad to see her in this doc, although I wish she would've dressed a little nicer. The CEO of Ms. Magazine seemed smart and level headed, despite being a huge critic. Her focus is obviously on women, and that's fine. I simply wish her agenda would leave men alone, which it obviously doesn't. Those sociology and gender studies professors she interviewed were completely barfy.\n\nHey Big Red, how many times can you blame the patriarchy for everything wrong in your life? Do you know who you sound like? Black culture in the 90s that would blame \"the Man\" for keeping them down. But I see that you two have teamed up to blame white privilege and the patriarchy now. Smart thinking. Speaking of Big Red, even in a relaxed café setting, she stills comes off as bat shit crazy. \n\nI had to close my eyes during the circumcision scene.\n\nI was sooo so happy to see that she included that disgusting protest at the University of Toronto against Farrell's speech. I was on this sub when that happened, and I knew this event was getting us close to a tipping point against the misandry of Feminists and SJWs. Sadly, I noticed that some of the faces from the original vid were missing. That could be because she was pressed for time, but I think it was because they threatened legal action against YouTube and probably against Cassie too. That was another tipping point: When Feminists/SJWs realized that they're too chicken shit to come out from behind their computer and engage us in a rational manner.\n\nLastly, the video diaries were super duper important in conveying how she felt about this and how her aim was changing. Sometimes docs need a human element, and that's what she did. Without these logs, I think the doc would've lost a lot of its strength, and I'm gonna go ahead and say it: Having an attractive, blonde, white woman be the predominant face of men's rights in this film is the huge punch that we need.\n\nGood work, Cassie, and thank you very much for doing this!",
    "title": "Just watched The Red Pill, here's some random thoughts",
    "subreddit": "MensRights",
    "timestamp": 1495478150,
    "score": 25,
    "keyword": "black ceo"
  },
  {
    "text": "A Day Without Men So I keep seeing news about women going on strike to show how invaluable their contributions are to the workplace, to society, to the economy, etc. \n\nI feel that the minds behind the strike didn't really think it through. \n\nWhen millions of people get through their day, have dinner, go to bed, and wake up tomorrow without being inconvenienced in the slightest by the women's strike all it will do is prove the opposite of the point they wanted to make.\n\nI am a supporter of equal rights for all, men, women, black, white, pink, purple, I don't care, equality for all means just that, for all, so please don't think I'm saying that I think, even for a second, that women are unimportant.\n\nBut imagine if we had a Day Without Men, a Men's Strike, a day when all the men in the country refused to work. Everything would fall apart. There'd be garbage piling up on the streets, public transport wouldn't be able to run, construction would grind to a halt, law enforcement would practically cease to exist, the military would do the same. What about slaughter houses that produce all the meat we eat? The kitchens filled with underpaid male immigrants? \n\nI'm sorry female Gizmodo writers, no one cares if you don't write for a day. The fact that you have the ability to not go to work for a day without everything going to shit exposes how expendable your position really is. All it does is highlight the dichotomy between true workplace equality and what all the third-wave feminists call equality. \n\nYes, gender inequality exists, I don't think it should, but historically it has. Men have been ahead in the game for millennia, but at the same time they have been stuck at the very back. Yes, more men hold CEO positions than women, but more men also hold the dirty, overlooked, under appreciated jobs that are the foundation that holds up the rest of society. \n\nThroughout history there have been examples of exemplary women who broke away from the norm and did huge things, who showed that women as a whole are not weak and can do great things. As we march ever forward into the future it is a truly great thing that more and more women are able to rise against any preconceptions that say they should stand by the sidelines of history. But I think it is too easily forgotten that the road that this march of progress, that this march towards equality for all treads  upon is paved with the bones of men.",
    "title": "A Day Without Men",
    "subreddit": "MensRights",
    "timestamp": 1488992766,
    "score": 14,
    "keyword": "black ceo"
  },
  {
    "text": "[Discussion] My industry seems to be hiring and promoting women more due to historical injustice. How is this similar and different than affirmative action in colleges? I just wanted to have an open discussion with y'all so let's try and hold back our biases. I should mention I am for 100% equality but do not think you should create inequality to do so, I'll explain.\n\nMy field has predominantly been male and moved female over the last couple of decades. Now it's fairly even, but the leadership is still majority men, like 70%. I feel this is due to history taking a while to run it's course, as you see the new entrants are fairly equal. Except now I hear the CEO of a certain employer is stating they want more women in leadership. It was not an official statement online but something we heard directly. I'm all for women leaders. But I am concerned with men losing out to these opportunities as a result. \n\nI find this argument similar to that of affirmative action for college admissions. I have mixed feelings but there is no doubt that I, a white guy in a small yet affluent town, had a totally better set of opportunities than say a black woman a few towns over who grew up poorer, etc. I feel that children (18 and under) have little ability to change their opportunities, so AA can help give people an equal footing their parents couldn't. It shouldn't be a kids fault they grew up in a worse place than I did. I didn't do anything to be so lucky. \n\nBut when it comes to workplaces, more so the promotions than the hiring, I feel that it's extremely unequal to promote a woman over me simply because they're making up for past injustices. I feel that if you have a college degree like mine and have the same job as I do, we are on an equal playing field. The promotion should be based on merit and work alone. It hasn't happened to me in any way, but I am wary because I'm seeing what looks like signs of gender preference at work. For what it's worth, I work with 70-80% women and am in fact the only male on my 15-person team. I am the minority which is an odd feeling. Not complaining however. \n\nWhat are your thoughts?",
    "title": "[Discussion] My industry seems to be hiring and promoting women more due to historical injustice. How is this similar and different than affirmative action in colleges?",
    "subreddit": "MensRights",
    "timestamp": 1502377556,
    "score": 9,
    "keyword": "black ceo"
  }
]