[
  {
    "text": "Serious: I walked into my CEOs office and thanked him I have been working with my company for about 2 years now. It’s a small to medium sized company with less than 100 employees generating about $100M+ /year rev. I don’t hold the best paying roles and I had been hopeful for a raise of some sort. Especially my reviews with my bosses were always positive. \n\n\nRight before last Christmas (2018) my baby boy was diagnosed with a rare case of infant leukemia (blood cancer). Doctors in the ICU gave us less than 20% survival rate. Both my wife and I were devastated and felt like we got sucked into a black hole of sadness. My boss talks with his boss and allows me to be off for 2 weeks. Last thing I had in my mind was work and they understood that. Soon we received the road map for the infant cancer treatment protocol and we were expected to be inpatient for basically the first 6 months of the 24 months treatment. \n\nRight before the end of 2 weeks, I receive an email from my HR with my CEO cc’d in it stating that my company is granting me UNLIMITED PTO. I was not expected to do any work but to invest all my time with my baby. And that’s what I did. I stayed in the hospital for 6 long months at the cancer unit. \n\nAfter finishing the front line of treatment ( first 6 months), my son went in remission (MRD negative) and we came home . My wife officially quit her job to stay with him at home and I decided to come back to work as our life is getting some sort of flow. \n\nAfter coming back to work, I heard from others how my CEO took the initiative to the board and other co-founders and pushed to offer the support I received. \n\nSo recently I saw him at his office and his door was open. So I knocked on the side and walked into his office. I was very nervous but I shook his hand and thanked him for all he had done for me and my family and how helpful it was for us to have at least one income. He quietly listens to me and says “we didn’t want you worry about work while you’re taking care of your family and that was the right thing to do” and he stood up and gave me a big bear hug. \n\n\nMy heart is filled with gratitude and respect for him and the entire company. Small companies have challenges and they make mistakes as they grow. But these types of act of kindness makes me want to work for this company as long as I can.\n\n\nEdit: thank you everyone for reading this post. A lot of people are asking for the name of the company to give kudos. I didn’t mention any name because I wanted their kindness to maintain its innocence. Maybe I’ll ask.",
    "title": "Serious: I walked into my CEOs office and thanked him",
    "subreddit": "jobs",
    "timestamp": 1560879062,
    "score": 2992,
    "keyword": "black ceo"
  },
  {
    "text": "Officially left toxic, racist workplace! Yesterday was my last day. I finally made my escape.\n\nFor the past two years, I was working at a company writing software. I was hired as a junior, however I was given the responsibilities of a senior. But it was a step up from my previous job. And the work that I was doing was actually very interesting. It wasn't anything I dreamed of doing. However there were two issues with the company.\n\nFirst, my boss only hired his friends, so outside of me, everyone was really close. This really created a toxic work environment as everyone was willing to fall on their sword and die for the company. They would work really long hours. 60-70 hours a week. But for them it was just hanging out with the friends. The other issue is that they were practically of one mindset. Which brings me to issue number 2.\n\nRacism and racially insensitive comments ran rampant. All the way from my coworkers, to HR, to the CEO himself, I've received comments that I was uncomfortable with. I'm a black guy, and I would love to say that I felt safe in my work environment, but I didn't. And I remember the time I first felt uncomfortable at work.\n\nThe CEO was with me one day and asked me what my ethnicity was. So I told him that my family came from the Caribbean. Word for word, he said to me \"Oh nice. You're one of the good ones, like my wife.\" It was very confusing, because I've met his wife before and she was black. So the fact that he said \"good ones\" was a strange. Then he continued to say \"You guys aren't like the black trash we see on the streets.\"\n\nAt that moment, I knew I had to go. The comments began to flow in. Using the N-Word because they were \"friends with black people\". The constant criticism for getting any food that wasn't American. My least favorite was \"The only reason I'd have black kids is because they would be so good at manual labor.\"\n\nSo I searched and I searched and I saved up money in case I needed to flee the scene without having a job first. But I finally got an offer. I put in my notice and they fought and fought to keep me, but my last day was yesterday. They're still calling me to see if they can work something out now, because I put them in a really bad bind with my project. I was the sole developer of the company and the software is projected to be a multi million dollar product. But they deserve every ounce of the bind they're in.\n\nI think the moral of this story and what I hope everyone takes away from this is you don't have to put with bad people. Neither do you have to feel sorry for them. Take care of yourself and beware of toxic environments.",
    "title": "Officially left toxic, racist workplace!",
    "subreddit": "jobs",
    "timestamp": 1567092853,
    "score": 11,
    "keyword": "black ceo"
  },
  {
    "text": "Why does my boyfriend loves to see me suffer? My boyfriend was my university schoolmate and we live together. I was a school athlete when he knew me. And now I am a lawyer.\n\nI suffer from migraines and cluster headaches. These headaches are so severe sometimes that I have to press and hit my head, moan, even cry and shout. My boyfriend is so kind to me and takes care of me well.\n\nBut last week I found him has been secretly taking photos and video of me suffering from headache and store these in his computer. I caught him while he was viewing one. I questioned him and he said I looks beautiful in these pain. I was furious. He has been doing this for years. Later I learned that he's mom(a company CEO) and ex(a sales manager) also has migraines and he loves seeing powerful women in headaches(holding their heads and temples) since childhood. He thinks that I am strong and pretty and it's interesting to see a strong and pretty women(like me) suffering. Even himself don't know the exact reason behind this.\n\nMay I ask is this kind of behavior common? Why would he do that, exactly? Is he a sociopath or something? Is it safe for me to stay with him(I'm an athlete and have Karate black belt).\n\nIf you don't know what suffering from migarines and cluster headaches looks like. Here are 2 examples.\n\nhttps://youtu.be/h20fnXzID40\n\nhttps://youtu.be/raCnH6BPdKM\n\nDisclaimer: English is not my first language so sorry for the mistakes.",
    "title": "Why does my boyfriend loves to see me suffer?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549199355,
    "score": 6,
    "keyword": "black ceo"
  },
  {
    "text": "You're using 'Patriarchy' wrong **TL:DR at the bottom**\n\n&#x200B;\n\nWhat is a hierarchy?\n\nEssentially, it’s just another way of saying prioritization. So if two people go into a debate, one to assert that men are marginalized, one to assert that women are marginalized, it’s a debate on prioritization. Which sex does our system favor unfairly? The mainstream sentiment is that the plight of women is way direr than is the plight of men (both historically and currently), and men’s advocates are coming out of the woodwork in response saying, “hang on, that’s not how this looks on the ground.”\n\nIf our society is hierarchical, which it undoubtedly is, then there is a prioritization of certain groups and individuals over others in specific ways. But I think this is an emergent feature (not a flaw) of our society. The fact that a hierarchy emerged over time is essential to how we progressed to this point. This is not to say that it will automatically get us to a better place in the future, but we should acknowledge that there were factors we as a species were dealing with across existence that necessitated a hierarchical setup, which emerged as:\n\n1. as groups, adult women and youth take higher priority over adult men\n2. at the top, our most valuable men take higher priority over our most valuable women.\n\nThis is what male advocacy and female advocacy have trouble reconciling. Feminist critique will focus on point 2 as evidence of patriarchal tyranny (why are most CEOs male?). Rebukes of that critique will focus on point 1 as evidence against, or even as evidence of unfair prioritization of females (why only men drafted for war?).\n\nWe can accept Point 1 easily because it relies more on biology and statistics than our perceptions. If humans dwindled to near extinction, we have a better chance at surviving in populations with more women than men. Men, as a group, are much more expendable because of the mechanics of how we procreate.\n\nPoint 2 can be demonstrated via thought experiment. Let’s call it the Black Box Test.\n\nSay an alien came down to earth with a small black box. The alien explains telepathically to all humanity that in one year it will allow 50 humans of uniform sex to board its ship and attempt to solve the contents of the black box. If they do not do so within an indeterminate time (no idea when/if the task ends), the alien will kill all conscious life on Earth. So highest stakes imaginable with very little info to work with. The selection of candidates is overseen by the alien (for fidelity) and has two parts.\n\nFirst, a selection of 50 representatives for each sex (male, female, and intersex) are chosen via democratic vote. Then, a second vote is cast for which of the 3 groups is selected to tackle the black box. Everyone votes in both rounds.\n\nBased on an honest appraisal of humanity’s collective psyche, it would be foolish to presume that the group chosen will not be comprised of men. I don’t care who you are or what you believe is rightful and fair, it is bad logic to think that most of humanity would vote otherwise, given those circumstances. The result is self-evident.\n\n**This is not to say that the 50 men chosen were the objectively** ***better*** **choice for the task**, but it illustrates an objectively real phenomenon in how we think. When the stakes are high, more men will be elevated to the task of *doing*. More women will be elevated to the task of *being*. It’s a trade-off pattern that’s been at work since our species’ infancy. My ultimate challenge to men’s and women’s advocates is that if one imagines a society where either sex is elevated to the task of both, *then and only then* is that society tyrannical (and, therefore, bound for cataclysm).\n\nSo is the USA one of those societies? Are we tyrannically in favor of men? How do we reconcile perhaps the most black-and-white example of patriarchal dominance – the gender pay gap?\n\nIf we scale down this thought experiment from the preservation of our species to the preservation of businesses, we will see the same trend of male elevation almost universally. Men will be elevated to decision-making roles at the behest of the whole group (all sexes) more often than women. Decision-makers are the ones making more money, hence a disproportionate pay grade. It may not be the cause of *all* the pay gap, but it demonstrates how one arises not because of tyranny, but because of this hierarchical decision pattern playing out repeatedly.\n\nAgain, this is not to say that elevating men is the objective right choice for any given business or pursuit. I'm highlighting this to remove the animosity and resentment from how we reconcile an apparently unbalanced system. I don’t think a patriarchal hierarchy developed because of the criminally dominating nature of men, but because *some* kind of arbitrary hierarchy of roles had to emerge for our species to thrive.\n\nMen’s advocates need to accept that we’ve written all the history books not because of an innate superiority, but because of an arbitrary (but beneficial) arrangement with our mates. And we must also accept that the bedrock of that arrangement means most of us are utterly inconsequential when considering our species’ advancement.\n\nTo women’s advocates, I pose that the plight of the average female (in America at least) is not as obvious as is commonly accepted. Yes, we do live in a patriarchy, but using that term as shorthand for male tyranny or domination is frankly bogus. Revealing true injustices in our patriarchal system requires that we demonstrate where men are being elevated to **be** and **do**. You need both for it to be truly unfair. I think examples of this can be found and should be swiftly dealt with (looking at you, organized religion), but actually finding those examples will almost always require more than a casual glance – or tweet, post, etc.\n\nPersonally, I’d like to see the patriarchy reformed into something else, but that will take a sort of gradual renegotiation of roles – a conversation that will last decades or longer. I’d prefer that happen sooner than later, but it’s going to be real slow process if men and women keep posturing against each other. The patriarchy has done its part to hurt *and* help throughout human history. We’re not obligated to keep it intact, but rejecting it outright and calling it 'tyranny' is not the same as reforming it.\n\n&#x200B;\n\n**TL;DR – A patriarchy exists in the US (and elsewhere, generally) but is not tyrannically in favor of men except for specific instances where men are being elevated to do** ***and*** **be. These instances are much rarer than is generally accepted, and we’re all worse off until that perception has changed.**",
    "title": "You're using 'Patriarchy' wrong",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548284399,
    "score": 0,
    "keyword": "black ceo"
  },
  {
    "text": "What would be the middle-ground works in between politics/power (lawyer, politicians, CEO) and art (artist, philosopher, nurse)? \nHi,\n\nMy family background is quite extreme, it seems my dad is narcissistic and my mom is codependent. He is a CEO, my mom was a nurse. Now she is a housewife and it is apparent how their relationship is functioning and I do not like it at all. I don’t want ‘black or white’. It took me long time to get over this and finally set my boundaries and work on myself. \n\nI want to set a goal at this point to motivate myself, but I don’t want to be too extreme.\n\nI hold a BA degree from Fine art, before that, I used to be a class leader often in my middle/high schools. \n\nI do want to find a middle ground, something not too political neither so vulnerable.\n\nWould science be helpful? \nWhat I’ve considered are- design, sports science, teacher, professor. \n\nThanks!",
    "title": "What would be the middle-ground works in between politics/power (lawyer, politicians, CEO) and art (artist, philosopher, nurse)?",
    "subreddit": "careerguidance",
    "timestamp": 1572811115,
    "score": 1,
    "keyword": "black ceo"
  },
  {
    "text": "Do you think minorities are well represented in this industry?  This is probably a more US-centric question, but I guess could apply to the rest of the West.\n\nI don't see many latino/as and black people in software development except for maybe one per medium sized company or one out of a 100. They seem to be more represented in hardware IT.\n\nAmong minorities, I definitely see many Indians and Chinese men on the software side and many of them have gained the highest positions in companies (Microsoft CEO, Alphabet CEO, Nvidia CEO, etc.). Off the top of my head, I can't even think of a black or hispanic CEO in tech or among tech VCs.\n\nAmong white women, the representation is growing, but not necessarily in dev. It's usually positions like PM, UX or maybe front-end dev. Chinese and Indian women are more represented on the software side, though I've seen it more in quality than development. As for black and latina women, I've only seen representation in the Bay Area and even then, that's next to nothing.\n\nI know there are hiring biases and other factors that get in the way such as CTCI tests, salaries, perceptions, lack of interest among the groups, social climate and so on.\n\nDoes anyone here think it's a problem that can ever be fixed? Doesn't think it's a problem at all? I'm trying to get perspectives for career reasons.",
    "title": "Do you think minorities are well represented in this industry?",
    "subreddit": "cscareerquestions",
    "timestamp": 1546286980,
    "score": 2,
    "keyword": "black ceo"
  },
  {
    "text": "How do you feel about working for a giant \"evil\" tech company? Hey guys,\n\nJust wanted to pose a question to people who may have thought about this before or, like me, am currently thinking about. For context, I've been in the job search for a bit, and now have 2 offers to consider. One is at a small company with a great work culture while the other is a fairly big tech company, with a more \"intense\" work culture. By intense, I mean they are known for longer hours, but with higher pay and very unique experiences (think like special gov contracts). At both companies, I know I can grow a lot in many different ways and regardless of how I grow, they all align with my personal career goals.  \n\n\nThe question I'd like to present today is how much weight would you personally put when considering to work for a company that has a controversial history. For instance, Facebook or Amazon would be great examples because both have unfavorable CEOs and have issues with data privacy or unfair workplace conditions. But... at the same time, I know my friends working at these companies or people I will be working with obviously don't agree with the CEO/board's opinions and decisions.  \n\n\nOn one hand, yes, by working for this company, you are indirectly supporting these malpractices because you are helping the company grow and succeed, and thus continuing their bad behavior... but is it really so black & white? Should we really disregard opportunities that would be great for our careers but kind of morally questionable? Is it hypocritical to say you don't support a company's practices but still get that juicy paycheck?",
    "title": "How do you feel about working for a giant \"evil\" tech company?",
    "subreddit": "cscareerquestions",
    "timestamp": 1574212448,
    "score": 1,
    "keyword": "black ceo"
  },
  {
    "text": "BLACK CEO, WHO IS MARRIED TO ‘STAR WARS’ CREATOR, USES BEING MISTAKEN FOR THE KITCHEN HELP TO TEACH AN AMAZING LESSON",
    "title": "BLACK CEO, WHO IS MARRIED TO ‘STAR WARS’ CREATOR, USES BEING MISTAKEN FOR THE KITCHEN HELP TO TEACH AN AMAZING LESSON",
    "subreddit": "blackladies",
    "timestamp": 1561551550,
    "score": 70,
    "keyword": "black ceo"
  },
  {
    "text": "Afraid that my little sister is forgetting who she is. What should I do?? My mother worked her ass off to send us to independent schools because the public (and Catholic) schools in our neighborhood were shitty.  We started in independent school when I was 12 and she was 8. The school did have way better teachers and resources.  It was also predominantly rich white kids. And I mean crazy rich, like the sons and daughters of CEO's of companies.   Meanwhile we were there on almost full scholarships. \n\nI'm now 19 s a sophomore in college and she is 15, a sophomore in high school. Like I said, most of the kids at the school were rich and white and I was not, so there were a lot of times where I didn't feel like I fit in socially.  I never tried to fit in because I could see that they were certain things that I just was not.  That's a big part of why I chose to go to an hbcu for college. I was so tired of that.  \n\nMy sister, on the other hand...I know it was different for her because she was younger when we started.  So for her she's been in independent school for most of her life.  She's always tried so hard to fit in even though my parents and I try to explain to her that we're NOT fuckin rich and will not be like the white families because we don't come from a long line of generational  wealth like they do.\n\nRight now I'm home for Thanksgiving and my sisters behavior is getting worse. It's almost like she's a different person. She's been acting so shallow. She's doing obnoxious stupid shit for attention just like the white girls at my high school did. And obviously she talks the same way they do. I know she's a really smart girl. She does better than I did in school. She has always been a straight a student.  Recently her grades are starting to dip.  My mom had called me last month telling me she has an F in math. Normally my Dad would be the one to discipline her but my parents just got a divorce this summer.  He's not our biological father so he's not required to see us. \n\nI wish I could be here to be supportive while she goes through highschool, but I go to school in another state. I know hs was miserable for me, and she won't talk about how she feels about our parents divorce but I know she was really close to our Dad.\n\n I don't know what to do but I feel like if I don't do something I'm going to lose my sister. She's going to turn into one of these black girls that doesn't know they're black.  \n\nAlso she doesn't want to hear anything about going to an hbcu. She wants to go to school either in our home state or in Cali, and neither of those states has an hbcu. \n\nPlease, if anyone has been through this with a relative of their own, I'd really appreciate any and all advice.  As her sister what should I do??\n\nEdit: also idk if it really matters but I thought I'd add. My mom put her in this Saturday program up in Harlem that is supposed to teach the youth about black history and black artists (it's in the Schomburg center if anyone here is from NYC). So she does have some black friends but clearly not enough to make a big difference",
    "title": "Afraid that my little sister is forgetting who she is. What should I do??",
    "subreddit": "blackladies",
    "timestamp": 1574842264,
    "score": 10,
    "keyword": "black ceo"
  }
]