[
  {
    "text": "Would you stay at a company because you know it will be good for your resume in the long run, or choose a small no-name company with fun projects and people you already know? After leaving Cisco due to strange local regulations, and helping them earn an additional 140+ million USD in revenue, I was jobless for a year. Local markets require a degree, which I don't have, and my relatively short experience in managing team members compared to my total years experience limited my ability to get a new job.\n\n1 year down the line, I accepted a job at a company that recently got acquired by one of the largest corps. in America. If I stay, I will be a part of the team that originally grew the local branch from <10 members, so would get a lot of recognition and lots of impressive things to write on my resume. However, the work is dull as a box of nails, and I find myself translating more than a tranlsation project manager would.\n\nMeanwhile, my ex-boss (who I used to work with at a major poker company before the Black Friday ordeal), set up a new company, with around 16 members. I personally know 4 of them, and the work is extremely fun (I love poker / WSOP / project managing the application), with the same pay, but with less benefits.\n\nWhat would you guys choose? My brain says stick with the large corp. but my heart is crying out saying I need to go work for my ex-boss.",
    "title": "Would you stay at a company because you know it will be good for your resume in the long run, or choose a small no-name company with fun projects and people you already know?",
    "subreddit": "jobs",
    "timestamp": 1493885225,
    "score": 20,
    "keyword": "black manager"
  },
  {
    "text": "Popular Job Boards.. Indeed, Monster, etc.. Impressions? Anyone with positive results? \nAside from the usual discussion about farming email addresses, personal info, and using resume data to sell to other companies.. \n\n**Has anyone gotten positive results with job boards**?  if so, what type of job?  \n\nMy background is manager level in marketing and tech, with relevant skills. (ego aside), and steady work history.  I have posted to boards, and applied to *a lot* of postings, but the few responses I have received are laughable.   \n\nI have seen new ads from Monster and Indeed on TV lately.. so I can only imagine the influx of new people getting into the mix.  \n\n**As a reality(sanity) check.. I am wondering how others are finding things.**\n\n\n*My impressions*:\n**Monster**: Insurance and financial services filling my inbox with sales jobs.  \n\n**Indeed**: Black hole.  Rarely hear back from submissions  \n\n**CareerBuilder**: I get calls from offshore recruiters (who I cannot understand), with non-relevant contract positions at companies they have no direct relationship with , who 'found me on CareerBuilder'.  \n\n**CyberCoders**: Most of the 'recruiters' there are horrible at follow-up, and the site seems to repost the same jobs. I have had submissions 'under review' for over 120 days before the position disappears. \n\n**ZipRecruiter**:Very few responses to applied jobs, and the emails they send regarding matching positions are often irrelevant.\n\nI know finding a job these days is tough.. I am curious to hear what others are experiencing.",
    "title": "Popular Job Boards.. Indeed, Monster, etc.. Impressions? Anyone with positive results?",
    "subreddit": "jobs",
    "timestamp": 1497463354,
    "score": 17,
    "keyword": "black manager"
  },
  {
    "text": "Got fired for a miscommunication about my knees. How do I cope? Let me give some background since I'm also conflicted with the reason and would possibly like some sort of resolution or assurance.\n\n   This happened about 6 hours ago when I arrived at my workplace. Noticed my managers car was there and thought, \"Neat! I can say hi.\" When I go to the back room he has me to close the door and tells me that someone filed a complaint to corporate about me, and that I was being terminated with no warning and no prior infringements. Taken aback I sat next to my boss and asked what happened.\n\n   During work hours on Black Friday I was caught by a customer, from their description saying, \"I'm down on my knees all day, *very sexually*\". Immediately I told my boss that it was pain/exhaustion related from crouching and walking constantly around the store, to which he thought was exactly what context I would have used. Problem is that my co-workers and I are very close and will joke around. When I said my statement I had said it in a serious tone to which one of my colleagues said, \"Whoa!\" in a very humorous tone. I defended myself awkwardly for the next 15 seconds but apparently that was enough.\n\n   I physically couldn't believe it and immediately started crying. Now I may be a tough man but the workplace I had was a place of comfort and wonderful colleagues (I worked at a game store and the subject was a part of my life that I enjoyed waking up for). I sat with my boss and we talked for a bit until I could legibly sign my termination form. After signing I mentioned the exchange between myself and coworkers that had been the likely cause of the complaint. My boss had no idea and told me that it could be useful information.\n\n   The thing is that I told him not to tell anyone. Other than my colleagues so that they can get a second chance. I would rather myself fall before anyone else.\n\n   So this is where I need advice in the situation. The logical thoughts are telling me that I'm in the wrong while the emotional thoughts are telling me that it's okay. I'm very conflicted and have no clue what to do from here on out, whether I'm a bad person or wrongfully accused. \n\nTLDR: Got fired from the job that I loved for a miscommunicated remark about my bad knees. Super conflicted and need advice.\n\nEdit: changed some wording for clarity",
    "title": "Got fired for a miscommunication about my knees. How do I cope?",
    "subreddit": "jobs",
    "timestamp": 1511747047,
    "score": 14,
    "keyword": "black manager"
  },
  {
    "text": "Interview questions to ask to gauge organization and management style A few of my most recent job disasters were plagued with micromanagers and disorganization. Now that I'm interviewing for new positions, I want to try and ask the right questions to weed out managers and companies where these are major issues. What are some specific examples of questions I can ask to gauge this? Should I go with scenario questions, or more black-and-white questions?",
    "title": "Interview questions to ask to gauge organization and management style",
    "subreddit": "jobs",
    "timestamp": 1492639022,
    "score": 9,
    "keyword": "black manager"
  },
  {
    "text": "Job Hunting Tips/Considerations from a Recent Grad I am a recent grad who spent over half a year to find my first full-time job (Tech Consulting) and wanted to share some of my thoughts regarding recruiting for a new job in my context. I am a young professional and would like to see comments about how I can improve the following notes.\n\nApplications: 400+\nInterviews: 20+\n\n--\n\n**Job Hunting Tips**\n\n1.\t**Align your interests** – Explore and identify various careers and industries that interest you. This requires experience, research, or networking with other professionals. Additionally, bringing awareness to what you are NOT interested in is as important as knowing what truly excites you.\n\n2.\t**Recognize your value proposition** - View yourself as a brand and highlight the skills which you can sell to an organization to benefit their business operations (soft/technical skills). Distinguish yourself as the best fit candidate for a role by elaborating on your unique knowledge or experience.\n\n3.\t**Create a company database** - Develop a list of companies which peak your interest by researching their mission, values, business model, etc (LinkedIn.com, Glassdoor.com, Indeed.com). Then, organize the list appropriately to efficiently filter them during your application process.\n\n4.\t**Strategize your search** - Using job search engines such as Indeed.com and LinkedIn.com are great; however, these platforms often fail to retrieve numerous job postings! Therefore, by applying for job applications directly through company websites, you will have full coverage of the public job postings. As a result, you may have a higher probability to interview for positions which receive lower levels of public exposure.  Lastly, familiarize yourself with specific search terms relative to your interests such as the following: Associate, Entry-level, and Junior.\n\n5.\t**Take advantage of your network** - Once you familiarize yourself with a company and its respective job postings, distinguish whether you have connections to the organization through LinkedIn. Expressing your interests to a network of professionals already associated with the company and sharing job requisitions may enable you to directly reach out to hiring managers. However, acknowledge that a professional will only assist you given that he or she believes you are fit for the role, since your profile directly affects his or her reputation for future referrals!\n\n--\n\n**Important Considerations**\n\n1.\t**Don't close the door** - Apply for positions and companies above and below your ideal standard. It is possible that you may be interviewed for positions which you may feel are beyond your qualifications, but let the recruiters be the judge. Occasionally, recruiters forward resumes to other recruiters in the event that there is a job posting more suitable for your candidacy. Additionally, by participating numerous interviews, you will practice your interviewing skills and be more comfortable with the various processes.  \n\n2.\t**Preparation for perfection** - It is important that you practice your interview skills and be familiar with specific information regarding the company and the respective role. When interviewing, demonstrating your knowledge of the industry or company’s business operations will highlight your proactiveness as a candidate. \n \n3.\t**Reality vs Expectations** - It is important to be realistic with your expectations and capabilities when applying for a new job. Having high standards is important; however, be aware of the opportunity costs of chasing the ideal job. Thus, developing a timeline with milestones is a great way of keeping yourself accountable throughout the recruitment process.\n\n4.\t**A competitive pool** - You must acknowledge that each job posting potentially receives tens or hundreds of applications. Similar applicants may be applying for positions left and right each day; therefore, reflect upon your recruiting practices relative to the competitive pool.\n\n5.\t**Be persistent, not annoying** - When reaching out to a professional or recruiter, be certain that your tone expresses curiosity and excitement. Sometimes getting your foot in the door requires persistence and careful communication; however, be conscious of how you may be perceived on the other end.\n\n6.\t**Keep your calm** - After you have completed a step of the recruitment process and  are waiting for further instructions or information, try to focus your attention on other job opportunities. This is the time to be patient and allow the company to deliberate for further feedback. Remember, there is no harm to taking a break from applying to jobs and participating in various hobbies to momentarily clear your mind.\n\n7.\t**No written offer, no stopping** - Do NOT stop applying or participating in any recruitment process until you have received a documented offer. It is possible for an organization which has extended you a verbal offer to suddenly decide to rescind their invitation.\n\n8.\t**\"Resume Black Hole\"** - Applying for jobs may feel like countless hours of throwing your well written resume into a Black Hole. People often refer to recruiting as a “numbers game.” Although this may be a valid argument, it is probably still within your best interest to act strategically when on the job hunt. Lastly, searching for the next chapter of your career may be incredibly discouraging and upsetting; nevertheless, you must remain determined and gritty to succeed!",
    "title": "Job Hunting Tips/Considerations from a Recent Grad",
    "subreddit": "jobs",
    "timestamp": 1512450206,
    "score": 11,
    "keyword": "black manager"
  },
  {
    "text": "Fired from job today due to complete hearsay and \"attitude problems\". Need advice on what to do next. So I worked for a decent size retail company for the past 2.5 years.  Two days ago I got into a verbal and almost physical altercation with a fellow employee and as a result lost my job today.  This is how it happened...\n\nI mentioned over the radios we use that if they were bored or had nothing to do that they could help move some of the gifts and accessories from the back warehouse onto the floor and work them onto the shelves.  The employee in question finds me moving several cases of freight on top of a lift and starts talking up to me with her tone very rude and with attitude, claiming she isn't bored and has plenty to do.  I tell her to then go do those things and stop bothering me.  She mumbles something under her breath and walks away but that irks me so I mentioned how she is lazy and any chance she gets, she walks away from her register to do nothing.  She didn't like that very much and unleashes a tirade of insults at me and I tell her to shut up and go away.\n\nFast forward to a couple hours later...\n\nShe just happened to be in the break room when I go on break. There's also another employee in the break room as well.  I get my food out of the fridge and start heating it up.  I put my water bottle on the table and she immediately speaks up and claims that she is sitting there, in that same nasty tone and attitude the used before.  I look at her and she repeats herself.  I tell her, \"You need to calm the f down with that attitude of yours.\"  She then gets in my face and threatens me.  Claiming that she will \"beat my ass\".  I make her aware that we are at work and that wouldn't be a good idea, in which she says she doesn't care and will beat my ass regardless.  I told her I would like to see her try and then move past her to get my now done food being heated and walk out to go eat elsewhere.\n\nThe next day I get pulled into the office by the SM on duty who is covering for the real SM which is currently at a different store training managers.  She tells me that she has heard the cashiers side of the story and now wants mine.  I tell her everything.  She claims I'm leaving something out.  I ask her what she is talking about because I just told her everything that happened.  The SM on duty claims that someone overheard me say, \"Typical f***ing N word\"!!!  The cashier is black, yes, but I would never say that!\n\nI got pulled into the office today and terminated because of previous \"bad attitude\" and supposedly I used a derogatory term. I never did any such thing. It's not fair but it's not worth fighting either because it was terrible pay anyways and they treat their employees terribly.  I just want to be done with them completely.\n\nI am labeled as a no re-hire by the company and if I ever use them as a reference, they'll have to say as much.  My question is when updating my resume for new jobs, do I even include the 2.5 years I gave to this place? I want to because I learned a lot and gained useful skills with this company. I was promoted quickly and trained in many departments.  If I shouldn't include them in my resume, how do I explain a 2.5 year gap of employment?  I'm at a complete loss as to what to do now with no income to be heard of and I was already living paycheck to paycheck.\n\nAny advice would be greatly appreciated.  Thank you.\n\nTL;DR - Got fired for something I didn't do and am now labeled as a no hire and can't use them as a reference.",
    "title": "Fired from job today due to complete hearsay and \"attitude problems\". Need advice on what to do next.",
    "subreddit": "jobs",
    "timestamp": 1509127669,
    "score": 9,
    "keyword": "black manager"
  },
  {
    "text": "CVS Interview, What just happened? About a week ago, my wife got a phone call from a very enthusiastic manager at CVS to interview as a pharmacist. She told her all these great goodies about the job and how she loves to work with new Graduates and her excitement over my wife's experiences. She said she is especially happy wifey has an RN degree too. She stated she is excited to see her and the interview will be more or less to determine if my wife is willing to hit the ground rolling aka (more of a formality).\n\n&nbsp;\n\nA few days later the district manager calls my wife apologizing about how enthusiastic the manager was stating that she skipped the normal interview process by calling her first, that he has to call and do a pre-interview and then assign her to a manager/region but she jumped the gun; so he has a lengthy interview with her and he is happy to go ahead with the onsite, saying in his career he has had only 10 candidates out of hundreds that had her dual degree. \n\n&nbsp;\n\nToday she went in for the interview, the manager sees my wife and my wife says her whole body language changed, warmness and excitement went out the window, just cold stoic conversations. The manager said she wanted someone with nursing experience, not someone who just went straight from nursing to college (?), the wife said she has over 4 years of working in various departments (per her resume). \nThe interviewer then said she is looking for specific skills (no elaboration), the wife said she has the basics related to the position from her rotations, and that the interviewer had been previously expressed preference of her being a new grad.\n\n&nbsp;\n\nThe interviewer then went on to give her potential negatives on how involving the position is (things she knows) suggesting it might not be something she might want. The wife replied that she's more than up for it. \n\nThe interview ended with \"we will see if we want you for another onsite interview\". \n\n&nbsp;\n\nWhat hurt me the most is when my wife called me really depressed and almost in tears asking me if this went sideways because she was black? Her name sounds Japanese (we are African) and most time people are surprised that the name and voice do not match perceived appearance. \n\n&nbsp;\n\nI refuse to believe that this is a reason, I just need help wrapping my head around all this. How did things go so sideways? I always tell my wife to add these people on LinkedIn so that there are no surprises. This is just gut wrenching sad. \n\n&nbsp;\n\n**TLDR:** Warm exciting phone interview goes cold on meeting my wife in person.",
    "title": "CVS Interview, What just happened?",
    "subreddit": "jobs",
    "timestamp": 1491334385,
    "score": 9,
    "keyword": "black manager"
  },
  {
    "text": "First day at first job and I need to know if I'm exaggerating on how bad it was First of all this place didn't even give me a schedule.\nWhen I came in, the girl who interviewed me told the owner that I was the new girl and he seemed annoyed and said \"I didn't know about this.\" \nNobody told me what to wear, and he asked me why I wasn't wearing a black shirt and pants and I said nobody told me to do that. \nThen everything was fine kind of. All of the girls I was working with except one and the manager were 16. The girl doing samples with me was giving me the weirdest attitude for no reason and taking over what I was told to. This 16 year old girl had her \"not boyfriend\" who was like 20 sitting in there most of the day and the manager was talking to him and they were both swearing and using slurs and calling stuff \"gay\" which I dont really care about generally but I felt like it was really inappropriate because this is like an expensive cafe type place and people were in there. I didn't really say much the entire time. The backroom (which was right next to the kitchen area) was like a long room that was like a foot wide with 400 nats flying around. \n\nThen at 7, for the next 3 hours, the manager and the were being literally inappropriate and annoying as hell. Especially because the 2 girls are under 18 and the manager is like 30. The manager was talking about how many guys she had dated and how many \"broke her heart\". Then they kept asking the one girl if that guy was her boyfriend and she kept saying \"HEZ NAWT MY BOIFRIEND!!!!\" which happened like 7 times. Then the manager was telling one of then that \"your first breakup, is gonna be, like, the worst thing EVER. like. Seriously. Like I've had my heart broken so many times. Every guy I date falls in love with me.\" And I was just thinking wtf is going on in here. Then the manager was telling the other one that when she is old enough she was gonna take her to a bar to get hit on.\n\n\nTHEN while we were closing, shit really made me want to get the fuck out asap. The dude whistled at the one girl while she had his back facing him and then the manager was like \"OOOOO NICE ASS LOOK AT HER ASS IN THOSE PANTS\". \nAnd then they started talking about this guy's dick. And THEN the manager was telling them (16 and 17 year olds) how she is \"in love\" with this guy and hes her \"soul mate\" but that she wants to go with this other guy and then they were telling her \"YA U NEED TO BREAK UP WITH HIM THEN GO FUCK (insertnamehere)\" and they talked about this for like an hour. Then the girl giving me an attitude was talking to one of them about HER boyfriend and how she was crying blah blah blah. \n\n\nI literally felt like I was in a all girl freshman classroom. \n\nAlso, one of them was saying how she will be covering someone's shift and working for 14 hours and said she hoped she would get paid overtime and the manager said nobody gets paid overtime. Nobody took a break, I don't think we get breaks. Nobody gave me a schedule. The manager told me earlier in the day she had to give me paperwork before she left. She went out for a cigarette and didn't come back in, so I didn't get the paperwork I needed. \nSo I literally dont even know when I'm supposed to go back or anything.\n\n\nWhile I was handing out samples, a girl actually came up to me and told me she worked here before and that she didn't understand how I could work there and shook her head and walked away.\nI have absolutely no idea if I should stay here. \n\n\nI need advice Reddit. What the heck is going on there!!",
    "title": "First day at first job and I need to know if I'm exaggerating on how bad it was",
    "subreddit": "jobs",
    "timestamp": 1496896323,
    "score": 7,
    "keyword": "black manager"
  },
  {
    "text": "Casual racism ***** EDIT: Wow, this post got significantly more attention than I expected. Thanks for all the advice and support (and zealous arguments about when stores should and should not allow more customers inside). I will be reporting this employee, mainly because while I do believe that there was wrong on both sides (but thanks to all of you who clearly offer amazing customer service), and I should just get over it, there is something to be said about speaking out about these matters, especially when prior generations have not. Who knows if it makes a difference, but it seems to at least have sparked some discussion here. I'm not going to insist on his firing or other retribution, if they would even do so in the first place; I can totally understand if this guy had a bad day and needed to take it out on someone. But the company should know if a branch allowed an employee to scream at a customer and did not address it immediately.\n\nObviously there's a lot of overt racism in the US, and it's been at a head for a long time now. There is every day violence committed against blacks and Muslims, and the statistics are there to prove it. I'm glad we talk about that. I hope that we can also talk about how comments about one's English or consumption of domestic animals is destructive too. No need to rank racism; it's all bad. For those who asked why saying \"ni hao\" is frustrating, rude, and yes, racist--I speak English. Why are those people assuming that I don't? *****\n\n\nI apologize beforehand if this isn't the right forum, but I need a place to vent, and this subreddit has always been one of the more open ones on this site. I went home this past weekend while studying for Step 1, and my dad offered to drive me back to my apartment as I don't live too far from school. He really wanted to stop by Sam's Club to pick up some fruit for me to take back, and even though I didn't think it was worth the effort, especially since it was nearing closing time, I said okay, because it's nice when your parents want to be nice to you, you know? We got to Sam's Club literally a minute before it closed, and my dad rushed inside while I parked. I decided to just wait for him outside the doors and was standing there when the guy who checks receipts called me inside and asked me if I was with the person who had just run in. He then proceeded to berate me for my dad coming in at closing time. (Edit: I did in fact tell him we were just getting one thing, in English, for those saying I shouldn't have just walked away. But no one has time to be yelled at once you're trying to be reasonable.) I walked away because no one has time to deal with that, and as I was walking away, he said, \"Maybe if I speak your language, ni hao ni hao, you’ll understand.\" I went to the cash registers and asked for the supervisor. When I told her what had happened and what this man had said, he ran up from the doors and started screaming in my face about how I was \"lying on [him].\" He continued to yell that I was lying (honestly if I were going to lie, I would have come up something slightly more creative). The manager said he was just trying to do his job.\n\nI was so frustrated and upset, and I continue to be despite sleeping on it. My dad does not want me to report this person because my dad is a good person and at about the zenith of non-confrontational, and he doesn't think this employee should be at risk for losing his job. But for me, not saying anything feels like implicitly condoning this behavior. Yes, we were in the wrong for entering this store at closing time--that one pack of strawberries better be the best I've ever had--but that didn’t justify outright racism and aggression. I don't know how many times I have heard \"ni hao\" as an insult/pick-up line/greeting and how many times I have been congratulated on not having an accent. I have been followed down the street and called a cunt because I told a stranger that addressing me with \"ni hao\" was impolite. I know this is something that people of color confront on a daily basis and that we are meant to speak out when it happens, but… it's hard, guys. Racism directed at Asians and Asian-Americans in particular seems like the last bastion of racism in comedy (see: Steve Harvey), the last and most insidious form of undercutting a whole group of people. It feels like no matter how hard I work, no matter how much I dedicate my professional (and whatever is left of my personal) life to trying to take care of people, how much my parents have sacrificed, that I can be leveled with the basest of insults.",
    "title": "Casual racism",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485967033,
    "score": 2362,
    "keyword": "black manager"
  },
  {
    "text": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this. Background: I work in a city hospital that serves a very impoverished minority population . Our Institution isn't exactly stellar  , so except for Radiology and Surgery most of our residents and staff are FMGs or IMGs.  Me (FMG) and my posse ( Mostly FMGs)were doing our rounds. Being a Sunday , out team was providing cross-coverage and we had a lot of patients to round on. \n\nWe make to the ED to examine a patient who had come in with shortness of breath and  diagnosed with a PE. The patient was a black transgender patient. She had been in the ED for a couple of hours \n\nThe moment I stepped in the room my spidey-sense started tingling. Started off rough enough \" who are you ? why Are you here ? Why are  you rounding so late?.I'm short of breath\" ( while screaming at the top of her lungs).  Ma'am . I had 30 patients. i needed to prioritize , but you have my attention now . \n\nShe explained that she was basically ignored by the nurse ( which was true - was not hooked up to telemetry or SO2 monitoring ).\nI apologized to her and told her I would talk to the nurse and that she should take it up the charge nurse. So far nothing usual. \nThen she went off on a tirade  .\" My mother worked in this hospital ,I also worked in healthcare . Used to come here sometimes until I started getting my care in  *Brand name * Hospital . This hospital was  much better run when we had Real American Doctors, not all these foreign doctors.\" She repeats this stament verbatim again during the course of the encounter. \n\nNow my interns and resident are visibly disturbed. But she goes on . About how her usual hospital is much better.  I then remind her BTW, I'm also foreign ( my phenotypic  ethnicity is ambiguous- on a good day I can pass off for Hispanic/Italian . I was called \" white trash \" once ).\n\nIn order to diffuse the situation , I agree with all her comments. I  put in a few negative comments about my own hospital( I find this works very  well to calm down a an angry patient/family )  This eventually calms her down , and I manage to get a coherent history and physical exam.\n \nBy the end of the encounter I tell her \" Ma'am, I'm sorry you couldn't get a real american doctor today \". She then suddenly becomes apologetic.  \"Oh, I didn't  mean all foreign doctors are bad . Just like the cops you have good ones and bad ones  . You all have been very professional . \"\n\nI shake her hand and the encounter ends.\n\nI don't know how to feel about all this. My training tells me that the outburst was probably a reaction to the stress of being in a hospital and mistreatment by the ED nurse. She did apologize in the end ( cant vouch for the sincerity of it  though ) . She herself belongs to a very marginalized group ( Black M-to-F transgender ) but had no qualms or second thoughts about espousing xenophobic comments.  \n\n Throughout  my training I've been on the receiving end of irate patients .But this encounter left an especially bad taste in my mouth. I guess the fear of \"the others \" is a very primal urge. And all these civilities are just veneers on a underlying tribal  mindset. \n\nAt least I can watch the WWE Summer Slam tonight and get my mind off this .\n\nAnyone else here had similar experiences ? How would you debrief your residents/interns ?",
    "title": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this.",
    "subreddit": "medicine",
    "timestamp": 1503260107,
    "score": 37,
    "keyword": "black manager"
  },
  {
    "text": "I had a psychotic breakdown at work This will be a very long post. But I feel like it's worth reading. As fellow nurses, you all know that we stretch ourselves too thin. We work long hours. We have stressful shifts. We push our bodies and our minds over and over again. For our patients. For our coworkers. For our families. We all know that we should take care of ourselves. We all know we should eat better, exercise more, drink less. Stop saying yes to picking up extra shifts. Stop going without sleep so we can spend time with our friends and families on our off days. Of course we know all that. But we're nurses, it's just what our life is like. So we keep going. Until we break. This is my story about my break.\n\nI had worked 3 night shifts in a row. Nothing new. I've always worked nights. I hadn't slept well at all, also not new. I've been taking meds for insomnia for about 5 years. I was on call from 2300-0700 for night number 4. I had got somebody to cover the first 4 hours of my call because I wanted to go to a mystery theater dinner thing. The day after shift 3 I didn't sleep. At all. Just could not fall asleep, even with drugs.  I should have skipped the dinner and tried harder to get some sleep. But I was really looking forward to it so I got up an I went. And then of course I got a text saying they would need me at 2300. I was already so tired, my eyes were burning and my face was flushed. I was over emotional already. But they needed me so I had to go. \n\nI work in L&D. I've been at this unit for about a year. Before this I worked step down. I'm pretty comfortable in L&D now. Still haven't encountered a lot of things but for the most part I'm confident in my skills. When I get to work the unit is slammed. And there are 2 triages that had just come in that my charge nurse gives me. Both are rule out labor. As soon as I start working I realize I'm kind of off. I go to the supply room for something and totally forget what. I stare at a fetal strip forever before being able to analyze it. I forget where to go in our charting system to get to certain things. One of the triages is fine, going to be discharged. The other is 38 weeks and having contractions every 2-7 minutes. Her cervix is 2/60/-2. Her doctor happens to be on the unit for another delivery so I let her hang out on the monitors to wait to see what the doctor wants to do. So I start working on discharging the other patient. About half an hour or so later I've discharged the other patient and the MD gets out of the other delivery. She looks at the strip and says \"She's having lates. Why haven't you admitted her?\" I look at her strip (even though I'd been checking it regularly and it looked okay) and see she HAS been having deceleration. Go in the room and patient is obviously in pain. Recheck her she's 4/80/-1. I try to get an IV so I can start her bolus for an epidural. I'm flustered and scared, I have the volume on the monitor up and I can hear baby's heart rate keeps dipping. I can't get the IV. I go to get some help. The other nurse gets the IV quickly and I start a bolus, turn the patient to the left and put her on some oxygen. Strip still looks iffy but I just can't really get a good picture of what's going on. I don't know what to do. So I go out to the nurse's station and ask somebody else to take a look at it. \"Oh yeah, looks like she started having variables here. And then they turn into lates here. And now her variability is minimal.\" I start crying. It was like a faucet got turned on. I can not calm myself down and stop crying. Everybody surrounds me and keeps asking me \"How can I help you? What can I do?\" And I can't even think straight to know what to ask them to do. So my charge nurse switches around assignments and I give the labor patient away and get some post partum patients instead.\n\nThe next few hours are horrible. I keep crying randomly, my eyes are so swollen and my face is red. I can't concentrate on anything. I'm having a hard time keeping up with which patient needs what. All the nurses keep looking at me like \"You poor thing\" and being overly sugary and sweet towards me. \n\nAround 0530 thing start getting worse. I was looking at a nurse telling her something about the labor patient I had and I thought that I saw her eyes dilating and then contracting back. I kept staring straight into her eyes. I would tilt my head to left and then back to center over and over, all while looking into their eyes and seeing them dilate and contract over and over. I snapped out of it after about thirty seconds and was terrified. The nurse was obviously a little freaked out and kept asking if I was okay. I tried to shake it off and kept telling myself the shift was almost over. I'd be able to sleep soon. But then it happened again. My heart was pounding and I started hyperventilating. At this point all of the nurses are very worried about me. My charge nurse talks me into going to the ER. I try to call my boyfriend as my charge nurse walks me down to the ER but he doesn't pick up. Once in the ER ever person I interact with I think is in this little \"trance\" where their eyes glass over and dilate while I stare. I start to think that I'm somehow infecting these people when I look at them and making them go into a trance.\n\nThe get me back to triage quickly. My HR and BP are through the roof. I can hardly talk at this point. I'm trying to explain how I'm feeling to the triage nurse but every time I look at him he starts going into this trance. I really start panicking at this time. I keep telling the triage nurse to get help because I'm making him sick. I keep going over ACLS steps in my head because I think that either I'm about to code or this triage nurse is. My boyfriend calls me back at this point and I tell him to get to the ER because I feel like I'm coding. \n\nThey get me back to a room. Every single person that comes in I think is in this trance. They seem like they're walking slow and moving slow. Their eyes are glazed, pupils dilated. Speech is slow. The nurse and doctor step out at one point and I press the code blue button in the room because I'm certain I'm dying. My heart is racing, my chest is tight, I'm dizzy. And I see all these people in trances and I know I'm going to code and there will be nobody there to help me. I keep snapping in everybody's faces in hopes they will wake up. I'm screaming and crying. \n\nMy boyfriend shows up around this time. I look at him and even HE goes into this trance. I hit him in the chest trying to wake him up. I keep telling him I love him so much and that I'm sorry. I tell him he doesn't have a pulse and I'm so sorry that I've made everybody sick because nobody can help him. There are several nurses and techs and they're trying to hold me down and I'm fighting them. Hard. They try to get an IV but I'm moving too much. They then roll me to the side to give me an IM injection (Benadryl and Ativan). I'm screaming and fighting them because I don't understand what's going on and I think they're giving me something to kill me (because I'm making everybody go into this trance.) I get away from them and get off the stretcher. There are people in and out of the room constantly. They're trying to talk me down. At one point when there is nobody in the room and I sit against the door and try to barricade people from coming in. I manage to get my cell phone and I call 911. I tell them that everybody at my hospital is in a trance and they're trying to kill me. My boyfriend gets the phone from me and is trying his best to calm me down. I keep trying to drag him out of the room (I was trying to get out of the hospital because I thought 911 would be sending EMS). \n\nI start feeling weak and strange. I think that I'm starting to die from the injection they gave me. They're trying to get me back on the stretcher and into wrist restraints. I'm biting and kicking at this point. They try to put paper scrubs on me (I had taken my scrubs off by this point..dunno why). I think they're trying to put a hood over my head so I won't see when they kill me. They give me another injection (Haldol). I'm still trying to get up. Finally all the drugs start hitting me. I'm certain I'm slowly dying at this point. They tell me I've been PEC'd and start explaining things to my boyfriend. I think it's weird that they would bother with a PEC since they tried to kill me. I start feeling very drowsy and weak. They make my boyfriend leave the room since I'm PEC'd. He tells me he'll be back at 1300 for visiting hours. I told him \"Fine, but I'll be dead by then.\" The nurses slowly filter out as it becomes obvious that I won't need to be held down anymore. The leave a sitter in the room that looks terrified. I drifted in and out, at this point I have accepted the fact that I'm going to die and I'm just glad I'm going to be able to sleep. \n\nI sleep a bit on and off and slowly start coming to my senses. I realize I'm not going to die. I start getting scared that I've been PEC'd. My boyfriend comes back and I get him to tell me his side of things. Later that afternoon EMS come to transport me to a psych facility. By that time I'm pretty much back to my baseline. \n\nThe psych facility terrifies me. I'm on a general adult psychiatric ward. The first person to talk to me was a schizophrenic patient that was telling me that I was his daughter and was yelling at me because I took the elevator when he had told me to take the stairs. What in the fuck? I do not belong here. They start me on new meds for sleep (Seroquel). I sleep like a baby and feel fine other then being anxious about being in a psych ward. I think surely they'll let me go home after reviewing the PEC. I'm not a harm to myself or others, I'm not suicidal, I'm not depressed, I'm no hallucinating. Nope. I was there for 9 day. I don't know whether they held me so long because I was a nurse and they wanted to insure I was safe to go back to work. Or maybe because I had good insurance. I saw patients that were in for suicide attempts and active hallucinations leave before me. All medicaid patients. As a nurse, it was definitely enlightening to see this world from a patient side. I now have a very very negative view of short term inpatient psychiatric care. Now this could have been a bad example of typical units. I could write a book. Hell maybe I should.\n\nAnyway. I'm back to work now. Still on nights because I can't find an L&D day position. Thankfully we self scheduled on my unit so I've been able to make sure I don't work more than 3 shifts in a row. The Seroquel is helping with sleep, but I have already had to go up on the dosage for it to be effective. I'm terrified every time I work that I won't be able to sleep. I'm terrified that this will happened again. I never got an official diagnosis but I assume it was a severe panic attack with psychotic features. A small part of me wonders what if this was just a precursor to some psychological illness. All of the nurses on my unit have been so supportive. I still get weirded out at work sometimes, deja vu and what not. I still hate having patients in the room that that labor patient was in. I still feel weird around the nurses that were there that night. It was a terrible experience, I still remember most of it so vividly. The delusion of everybody being in a trance still seems so so realistic to me. I've talked to so many people about how it looked from an outside perspective. I wish I could understand exactly what happened. It's awful to have your mind betray you.\n\nThank you for anybody that read. It feels good to see all of this down in black and white. And please, take my experience as a warning. You are not invincible. You can not keep running your body into the ground. One day your body and mind will say \"Enough.\"",
    "title": "I had a psychotic breakdown at work",
    "subreddit": "nursing",
    "timestamp": 1506545659,
    "score": 564,
    "keyword": "black manager"
  },
  {
    "text": "Manager called me unprofessional Hey everyone, i'm curious to see what everyone's response will be.\n\nI recently got a coveted position at a great hospital in my region. When I was informed they wanted to hire me they gave me a start date 2.5 weeks away. As soon as I received my offer letter I put in my two weeks via email as I am a night shifter and planned on talking to my manager about it when I saw her. Before I could get a chance to talk to her, she left me a nasty voicemail calling me unprofessional for not resigning in person and told me she would 'hold' my resignation till I called her. Yeah. I didn't call her back right away because I honestly didn't know what I would say and was kind of flabbergasted by the voicemail. I work the weekend shift and she comes in that next Monday morning and corners me right before shift change in front of my peers in the middle of the pod and berates me for not calling her back, calls me unprofessional to my face and then makes mention of a comment a friend of mine made on my facebook about the unit. This lady does not have me on facebook. The place I am working at has been driven into the ground by this manager, 70% of people aren't making it through orientation because they quit and since I started almost two years ago 70% of the original staff has quit.\n\nI kind of want to contact HR and her director and let them know what went down. I'm pretty sure there is already an HR investigation against her because they are trying to figure out why people are quitting. What would you all do? I'm worried she might try to black list me somehow. \n\nEdit; My friend who commented on my status was a former coworker who congratulated me on getting out of the 'crap shoot.'",
    "title": "Manager called me unprofessional",
    "subreddit": "nursing",
    "timestamp": 1505868888,
    "score": 16,
    "keyword": "black manager"
  },
  {
    "text": "Making work friends? Something that has really been bothering me lately is that I don't feel like I am friends with anyone from work. There is 1 person that I hang out with *occasionally* (as in like once every few months) and that is it. I try to be social, invite people out places, try to include myself in plans, attend work-organized social events, etc. But I never get the effort returned. I am never included on people's plans, I am never invited out.. Nothing. Even when they are sitting and making the plans right in front of me. \n\nMaybe it's because I'm still kind of new (1 year)...but there are people who have been there less time than I that get invited out. Maybe it's because I'm a guy in a female dominated profession. Maybe it's because I work swing shift. Maybe it's because I'm white and working in a predominantly black hospital. Maybe everyone just fucking hates me. I honestly don't know. Most people seem to enjoy working with me and seem to like me at work.\n\nThis is something I've dealt with my whole life. I've never felt included on plans (barring a small group of really close friends) and always feel like an outsider. I'm so fucking miserable and lonely. It's making it really hard to go to work because people sit around and talk about the last time they all went out. They all post pictures of shit I wasn't invited to on Facebook. They make plans right in front of my face and don't even bother to ask if I want to come out with them. \n\nI think I am going to ask my manager to switch me to night shift (although I am TERRIFIED of working nights) because they seem like the stronger team and they all seem closer outside of work compared to days and especially swing shift. Any other suggestions?\n\nP.S. sorry about the rant.",
    "title": "Making work friends?",
    "subreddit": "nursing",
    "timestamp": 1495002147,
    "score": 9,
    "keyword": "black manager"
  },
  {
    "text": "ED Tales from the Trenches So in the midst of a hospital restructure, my director (who oversaw 24 observation and ED) turned the keys of the castle over of Obs to new management, but shifted me into the ER.  I've floated there often and now I'm full time and getting put through an impromptu orientation whilst flying solo. Am excited to be working with a group of nurses and docs where my personality, sense of humor, and work ethic all mesh well.  \n\nThat being said, didn't take long for the stories to be told, and of course, for my own to occur.  Last night, running an NG tube into a Pt with significant abdominal distinction, the tip of the tube hit that sweet spot in the back of her throat and liquid black death spewed forth.  Needless to say, we were all covered, X-ray confirmed placement, and suction alleviated a lot of discomfort. When all said and done, the patient looked at me with a tear in her eye and smiled and said, well I didn't see that coming....  we all got a laugh, cleaned up, and she was slated for surgery the following AM\n\nJust the start of my time in ER and yeah, one of those tales from the trenches...",
    "title": "ED Tales from the Trenches",
    "subreddit": "nursing",
    "timestamp": 1493092494,
    "score": 9,
    "keyword": "black manager"
  },
  {
    "text": "How does your company manage R&D/Prototype Projects? Hello fellow reddit engineers. I am a mechanical engineer with a couple years experience in industry working in design with two separate companies. I've done 3-4 large prototype projects with varying degrees of complexity and varying degrees of disorganization. I've found what works for me to manage projects and keep a team moving forward but I'm really curious how the rest of you keep your projects, large or small, organized and documented. Specifically I wondered;\n\n - Assuming you have a concept that you are relatively sure will work, do you run a prototype through your ERP/MRP system? Do you have a separate database for engineering projects or do you create part numbers, BOM, etc in the production instance?\n\n - If you work outside of the ERP/MRP system how do you maintain tracking, costing, BOM, and inventory? \n\n - When in the project do you attempt to capture your cost rollup? When does this consideration come into play for your design process?\n\nI know that there is no real black and white answer as it varies so much with the scope of the project. I'm just curious to everyone else's experience. Thanks so much for your ideas!\n\nTLDR; How do you manage your prototype projects so there isn't complete chaos but you still aren't bogged down in paperwork?",
    "title": "How does your company manage R&D/Prototype Projects?",
    "subreddit": "engineering",
    "timestamp": 1490790708,
    "score": 6,
    "keyword": "black manager"
  },
  {
    "text": "[PA] [11/12] - Having a terrible student teaching experience. Advice please **TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**\n\nI am at a AA-sized school in western PA outside of the city. When I was first assigned to this school I was excited as the mentor teacher had received some awards and plaudits both statewide and even a national one. I thought \"what better person to learn from that this person\".\n\nWhen we first started it was going great. She was excellent at teaching me the ins and outs of contracts, etc (which I realize now was totally off-topic and shouldn't have even come up), the mechanics of school politics (again, some bells going off) and so forth.\n\nDuring the first week, I could see how she was a really good teacher. The kids respect her and she has great classroom management. On Tuesday of the first week, she said she would want me to start teaching the following week. So she would take the first Econ class of the day and I would teach the two in the afternoon. She wanted me to start drafting lesson plans for these days and then we'd go over them on Friday.\n\nThe first week of doing Econ in the afternoon went well, so she had me take over that class full time in Week 3, while I took over the second of her two Psych/Soc classes in the same format. In Week 4, it was all me for everything.\n\nWhile I was excited to jump into teaching full time, I should have had a few alarm bells going off:\n\n* why wasn't she modeling her preferred style of lesson planning to me?\n* why was she moving faster than my university's suggested timetable for giving me more responsibility?\n* how was I going to be expected to extrapolate from her incredibly abridged lesson plans?\n\nI took comfort in the fact that, at the beginning, she would sit down with me and go over what she would expect to me to cover the next week and so forth M-F. And it became our ritual, in a sense, for us to sort of broadly go over the next week on Friday and then for me to turn in an overview of the week by Sunday, which she would comment on if there were any concerns.\n\nFast forward to last weekend. She is busy on Friday with students asking about extracurricular stuff and my attempts to connect on the following week's material are rebuffed. So I do my best on Friday evening and Saturday to map out the week, extrapolating from a very thinly detailed syllabus to try to use as a pacing guide. I text her on Saturday evening asking if we could go over the plans for the week, and she responds \"I'm busy right now, I'll call you tomorrow at 5\". (bear in mind, she told me from day one that if I EVER need help to call and she'll \"talk me down from the ledge\" and work with me\".\n\nThe next day, I reach out by email ahead of time, sort of detailing all of my concerns about the upcoming week, my confusion over the pacing and wording in the syllabus and uncertainty as to her suggestions from the past. \n\nThen 5 comes and I get no response, then 7, then 9 - and by this point I'm freaking-the-fuck out. So I send another follow up text stating that I had sent an email with some questions and I was hoping to discuss the following day, at least, as well as the week moving forward.\n\nI get a text at 11:30 pm asking \"have you figured it out yet\". To which I of course responded no and that I thought i at least had a plan for the next day but that I really needed some clarification on the rest of the week. She responded \"**i can keep holding your hand forever, but you'll never learn anything that way. I need those lesson plans before 7 tomorrow. See you then**\n\nSo when she came in the door in the morning, I was hastily wrapping up the weekly overview lesson plan to be turned into the office - basically just going off of whatever she did last year.\n\nThen all week long, there was this tension in the classroom. I could feel it growing. I was frustrated with her for essentially abandoning me with little preparation (a strategy which many of my teacher friends derided as unprofessional and extremely unhelpful). She seemed annoyed with me for seemingly needing any help at this point.\n\nOn Wednesday, I get an email from the director of field placements at my university wanting to have a phone meeting the next day. On that phone meeting is literally everyone in the chain from the top of the school of education down to me. \n\nMy site director first allows me space to give my side, and then proceeds to list a rapsheet of complaints and errors on my part that have been privately communicated to her over the past week or two about my untimeliness in turning stuff in and unpreparedness for the day each day and needing to have my hand held for every little thing...yadda yadda.\n\nI was so taken aback and felt so cornered, but i swallowed my tears and the lump in my throat and did my best to give a fair account of everything from my end, to include - which I've yet to mention - that the previous week she broke her tooth in half and had 2 miss days of school in pain after getting it pulled and i was left with subs, etc. Then the following days she was in pain because she couldn't take her percocet before coming to school and so was always in a foul mood, but I did my best to steer clear, etc.\n\nThe school seemed understanding of my side, and said they aimed to support me in whatever way possible to help get me across the finish line.\n\nThen yesterday was teacher in-service. Teachers are supposed to be given an itinerary at least a week ahead of time. Our teachers were given them on Wednesday. My MT forwarded the email to me, but i notified her that as it was a Google doc, and she was not the creator, it wasn't able to be opened unless shared by the creator. She said she'd follow up, but never did.\n\nSo I arrive at 8 the on Friday morning, and go to meet her in the classroom, which is where we met previously. She's not there; door locked. I go to the auditorium, which is where in-service began last time, and no one is there. Finally I hear an announcement and see teachers walking toward the collaboration center, so I join them and we all walk in the door at 8. I get a text from her at 8:02 saying \"in-service started 2 minutes ago and you aren't here\". So i responded \"im here, in the back of the room\". She turns around and makes eye contact.\n\nLater in the day I get a call from my site director asking how the day is going, if I'm feeling any better after the ambush on the phone the day before, etc. Then she asks, what time did the in-service start this morning? I said, \"8\". \"And when did you arrive?\" \"just before 8\". \"Well, your mentor teacher sent me an email notifying me that you didn't arrive until 9\".\n\nI was PISSED. I forwarder her the texts proving that I was there at 8 and that I had notified my mentor teacher of my presence in the back of the room.\n\nI got ANOTHER call from the university and after some back and forth, they sort of seemed to agree with my suggestion that I felt that I was being sabotaged at this point for whatever reason. They said to not go into school on Monday, don't contact my mentor teacher, don't contact the school - they'll take care of it. What they want is to have a meeting where all the expectations of all parties are laid out in black and white, on paper, so there's no confusion, and then we'll figure out a path forward from there.\n\nI'm so frustrated and confused and exhausted and exasperated over the whole thing. I don't even know what to do going forward. I was told to not make any more lesson plans at this point and to just take the weekend to spend time with my kids and wife and think about some solutions to help get me across the finish line on December 8.\n\nI'm so furious I don't even know what to do. I'm also worried that my MT, if I remain in her classroom, is going to sabotage me by switching subjects this week to throw off any lesson planning I've already done (both classes are combined Psych/Soc and Gov/Econ) and we go back and forth. Everything I've planned for the rest of my time there is in Sociology and Gov, so I half expect to walk in the door tuesday and she'll have been teaching Psych and Econ and tell me to hurry up and make some lesson plans for the rest of the week.\n\nAnyway. Suggestions?\n\n**TL;DR: Cooperating/Mentor Teacher seemed good/great at first. Flipped some sort of switch in her head last week and decided to seemingly sabotage my experience. Wrote tons of complaints about me behind my back to my university but never communicated with me that there was an issue. Now I'm facing two serious conversations with my school in less than a week span trying to find a resolution to move forward.**",
    "title": "[PA] [11/12] - Having a terrible student teaching experience. Advice please",
    "subreddit": "Teachers",
    "timestamp": 1507998970,
    "score": 35,
    "keyword": "black manager"
  },
  {
    "text": "[Southern USA] [Kindergarten] - Please help with class management! Throwaway account, because I'm paranoid of someone in my school finding me. Also posted in /r/ECEProfessionals \n\nI am a second-year teacher at a rural, 90% African American school in the southern United States. I'm having issues with classroom management. Last year, my assistant was very strong- she basically ran my whole classroom. Whenever the kids were being too loud, she'd sternly redirect them to pay attention. Sometimes she even yelled, but it worked. I am not a confrontational person and her methods worked, so I ran with it. She was African American, and told me that her ways were effective because the kids saw her as a mom/grandma figure and respected her. I believe this to be true. However, she has retired and I have a new assistant- an older white lady who is not as strong of a personality.\n\nIn this community, the norm is for children to be scolded/punished for doing wrong things. The ways that some of the other teachers talk to their students align to this method of child-rearing, because culturally they are similar to their students (again, the kids see the teacher as a mom/grandma). I should mention here that I am white. I have been told by the other kinder teacher (and several other friends within the school) that if I spoke to the kids the way the other teachers might, I would be in trouble because \"Black people don't want to see their kids yelled at by a white teacher\". That is a direct quote, please don't call me a racist or tell me that race doesn't matter.\n\nThe issue is that I cannot get the kids to stay quiet or pay attention, even if I raise my voice (which I hate to do). I also feel like they are goofing off when we are supposed to be working. My kids are turning in absolute crap- I know they are capable of better work. When I try to get them to be quiet, they still talk or play at their tables and do half-assed work. I would love to be able to allow them to whisper at their tables about what we are doing (and generally work together in teams), but it seems like the majority of them are always off-task. I try to plan active activities/group work/movement into our day. I also allow them to talk during breakfast and snack.\n\nWe have a school-wide management system using a 'green, yellow, red' behavior chart. If a kid misbehaves, I'll warn them. If they repeat, I'll change their color. I've thought about starting some kind of token-based economy, but at this point I'm not sure they'd be quiet or attentive long enough for me to tell them about it.\nI've tried all the positive behavior things we learn in college, like highlighting kids that are doing what is expected, etc. We made our class rules together. All the positive/reinforcing/'let's talk about your choices' stuff doesn't work. Changing their colors doesn't work. Having them practice walking in the hallway quietly (because we can't seem to do that correctly, either) doesn't work. None of it seems to work. I'm frustrated and upset and not sure what else to do. Any advice would be greatly appreciated.",
    "title": "[Southern USA] [Kindergarten] - Please help with class management!",
    "subreddit": "Teachers",
    "timestamp": 1504303176,
    "score": 11,
    "keyword": "black manager"
  },
  {
    "text": "Have a Master's degree in Biology - can't find a job to save my life. How do you get the ball rolling? Girlfriend and I moved up to Kansas City in January after I graduated with my Masters of Science degree in Biology from MoState. She got an amazing job offer and it was time for a change for me location-wise. Problem is that I can NOT find a job in my field here. I'm looking for anything in the environmental field. I've applied for jobs with the city, as well as national/global environmental consulting and engineering companies like Terracon, TetraTech, Stantec, Black & Veach, Ramboll, and Burns & McDonnell (as well as at least 20 other jobs in other cities). Nothing.\n\nI have a Masters degree, 2 internships, and 2 years of experience as a Biological Field Technician for a Public University, and 6 months experience as a field tech for a wind-turbine company, and can't find anything here in Kansas City. I've personalized each cover letter, followed up with hiring managers, made as many connections on LinkedIn as possible, still nothing. \n\nBasically, I'm at the end of my rope here and looking for any kind of advice or suggestions. I'm not looking for sympathy. I'm in the process of creating a resume in the food-service industry as I need something. I don't know what else to do.\n\nHas anyone else been in my shoes before? How did you get the ball rolling? Thanks.",
    "title": "Have a Master's degree in Biology - can't find a job to save my life. How do you get the ball rolling?",
    "subreddit": "careerguidance",
    "timestamp": 1500315571,
    "score": 16,
    "keyword": "black manager"
  },
  {
    "text": "I am starting to have big doubts about my second job after college. Can somebody please give me some advice on what to do? I have been at this company for 1 year and almost 3 months because of a rotational program for the job I am in now. The company was extremely vague about the position I was hired for, but the pay was decent and it had a big name. I'm not going to say the name of the company but I work in the finance division of a major automobile company. I pretty much make credit decisions for consumer auto loan applications while being a customer service agent /mediator for managers at car dealerships. The issue is that this is an extremely extroverted emotional thinking job. I am an INTP personality type to quickly sum up my personality.\nFirst, I have to be really good at small talking because this builds stronger relationships with the dealerships. I'm an reserved introvert, so I cannot make small talk to save my life and these are car salesman so I'm having to interact with the most extroverted peppy type A people this planet has to offer. If I don't do well in my conversations with the dealers then I get dinged on my performance.\nNext, the work is extremely repetitive and requires that emotional gray minded way of thinking. Decisioning a credit application isn't black or white and plus if I make a decision somebody doesn't like then I either have one of my 8 bosses yelling at me or an angry sales manager calling me. I can't listen to music at my job because I have constantly be ready for inbound phone calls or have to deal with small talk from my bosses.\nLast, getting promoted is not an option. I have to be at my job for at least 3 years before I can even be considered for promotion. In addition, they only promote the best performing people because they are natural fits for upper level positions in the company. Lets just say my job is like the gateway in to management or other specialized parts of the company. If you do not get promoted then you will most likely retire at my job. In addition, I have zero interests in those jobs above me because they are either more extroverted or repetitive than mine.\nIn conclusion, I have no idea what to do. I'm 24 I quit my first job after college after 7 months because I was in a desolate part of the country and the pay was terrible. Am I just broken and destined to fail? Sorry for any grammar mistakes because I was in a hurry to type this.",
    "title": "I am starting to have big doubts about my second job after college. Can somebody please give me some advice on what to do?",
    "subreddit": "careerguidance",
    "timestamp": 1513203302,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "Looking for a job (after being out of steady work since October 2016) Why is it so hard to get (and keep a job) these days in Seattle?  I primarily work contract roles because that's mostly whats out there.  Getting a fulltime position seems nearly impossible!  The last few companies that interviewed and/or considered me for full time positions flaked on me (even some of the contract hiring managers have been flaking also).  What is the big deal with this area lately?\n\nI'm an experienced SDET/HW engineer with 7+ years of industry experience.  My resume speaks for itself, I have worked at Microsoft on contract multiple times, have a diverse set of skills (not just one) and does great work, but ever since October, it's like the market has just... dried up.  What's the deal here?\n\nLately, Microsoft has been actively opening new positions for the Surface and Azure team.  I had two interviews for the Surface team.  The feedback was that for one I was not as qualified as the other candidate, while the other one didn't specify (likely because I was overqualified).  I'm not being picky about salary or anything, or even where I work, but the software engineering and IT industry has never been stable for me, and I've never had a full time position in my entire life because they are so hard to come by and much harder to get considered for.\n\nI post my resume on monster, careerbuilder, indeed, etc. and just started using LinkedIn, hired.com, and a few more.  No success at all.  The prior years before have been much more successful.  2016 hasn't been a good financial year for me, ant 2017 is just abysmal.\nNothing, nothing, NOTHING!\n\nI'm not trying to complain here, but I'm amazed that I haven't been kicked out of my place yet.  I don't have money to buy food, pay for transportation, and debt just keeps piling up (thanks alot, my idiot ex girlfriend), so I feel like it's do or die at this point.  I even thought of committing suicide several times.  There just has to be a way out of this, right?\n\nOne of my ultimate goals is to get back into Microsoft, specifically on the Surface team.  I've been on the Surface Hub team before, and did an outstanding job with tools development and automation but ever since the budget cuts in 2016, things have just been downhill from there.\n\nIf you want to know my skillsets, here's some of the languages and technologies I've used.\n- Visual C++, Visual C#, Java, Objective-C, some Javascript, some Python\n- .Net frameworks, open source APIs for Linux and MacOS\n- Cross platform native app development for iOS, Android, Win10 (UWP) and Blackberry 10\n- Automation using Selenium Webdriver, TAEF, Eclipse\n- Xbox testing and development\n\nAnd that's just a basic summary of the things I've used and excelled at, and yet I STILL can't find anything this year!  Once again, I'm not trying to complain but I really don't know what to do anymore.  6+ months of seemingly non-stop job searching with next to no results makes me want to quit software engineering and do something else that's going to provide SOME sort of stability because what's the use of getting paid an upper 5 figure or 6 figure wage if you just keep getting laid off all the time??  It really does just seem hopeless.  And lastly, I'm not trying to play the race card or anything (because I don't use the \"white man got me down\" excuse) but is it because I'm black?  No really, I'm running out of ideas.  My resume used to get me tons of interviews.  Now, not so much...\n\nAny ideas or insights would be really appreciated.\n\nShogun",
    "title": "Looking for a job (after being out of steady work since October 2016)",
    "subreddit": "cscareerquestions",
    "timestamp": 1495488734,
    "score": 3,
    "keyword": "black manager"
  },
  {
    "text": "Minor vs BS vs MS in Computer Science I posted in this sub reddit the other day asking for advice but this is a different question or set of questions for advice. Sorry for posting again but I just need more advice.\n\nI currently have a BS in ChemE and working as a process engineer (I have my black belt in six sigma also), but have grown interested in being a software engineer but have no prior experience coding or programming. I plan on teaching myself some coding through Udemy or other similar ways, but I was wondering if a degree for computer science would be beneficial or worth the money in my situation. \n\nI'm also currently pursuing a MS in engineering management but have thought about switching it to some sort of CS degree.\n\nWhat would you recommend out of a minor, BS or MS in computer science and why?",
    "title": "Minor vs BS vs MS in Computer Science",
    "subreddit": "cscareerquestions",
    "timestamp": 1512417414,
    "score": 3,
    "keyword": "black manager"
  },
  {
    "text": "Is this a good response to the question \"tell me about a time you disagreed with your manager\"? My response to this is the following story:\n\nThere was a time about a year into my career when I was working on a project to convert a data feed from a mainframe process to a SQL stored procedure. The feed was sending data from our systems to another area of the company, and receiving a feed back and storing the data. It was a monthly feed.\n\nWe worked closely with our business partners to analyze the requirements and develop the stored procedures. In one of the feeds there was some ETL logic required that neither my manager nor I really had a good understanding of. We reached out to some other folks in our department and found that another BA (business analyst), who was previously a developer, had some SQL code that did almost exactly what we needed, we only had to change a few data sources and outputs. From what I can remember his code was joining several data sources and using a cursor to output a temporary table to be used later in the feed. We worked with him to get this logic into our feed and to try and understand what it was doing.\n\nWhen it came down to it though, my manager and I did not have a 100% understanding of what Mike's (the BA) code was doing. We knew it would work, Mike knew it would work, but even after stepping through the code and working with Mike are understanding of this portion was still lacking. Mike is a bit a white-beard and we knew we could trust him and that the code was solid though. \n\nMy manager wanted to move forward with this portion of the feed being a \"black box\". I didn't really like the idea of doing that and voiced my opinion. However, since I was junior at the time I didn't really have much of a say in the matter. Even my manager's manager was OK with doing this. Especially since we were in a bit of a time crunch.\n\nIn order to mitigate as much risk as possible I made sure to test this code 200%. I wasn't happy that we were doing this, since it was going to be our name's at the top of the SQL script and we were owning it, but at the end of the day there wasn't much I could do.",
    "title": "Is this a good response to the question \"tell me about a time you disagreed with your manager\"?",
    "subreddit": "cscareerquestions",
    "timestamp": 1502151694,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "Are coding bootcamps a \"black mark\" on a CV? I've joined a small organisation to learn coding on the job. After two months the lead dev said that I am not where they'd like me to be, skill-wise, and that my brain must work differently to his (and other junior-devs) and that they can't offer me the job as a dev.\n\nI'm frustrated because I thought I was doing well, right up to that conversation.\n\nI'm considering a coding bootcamp in London, UK as a slightly more formal way of learning. However, having done some research, I learned that some hiring managers consider it a \"black mark\", and that CodeWars, FreeCodeCamp, and MIT course at EdX will give you the same knowledge.\n\nI would like to hear from those who do the hiring if they do indeed view the bootcamps as a strike against, and if yes, what would they suggest to do instead that would help me develop programmer career.",
    "title": "Are coding bootcamps a \"black mark\" on a CV?",
    "subreddit": "cscareerquestions",
    "timestamp": 1505401683,
    "score": 2,
    "keyword": "black manager"
  },
  {
    "text": "Story Time: Firm Holiday Parties Let's go guys. \n\nSaw a senior manager (married) making out with a 3rd year tonight.\n\nEDIT: It was a Partner. I was blacked last night when I posted this.",
    "title": "Story Time: Firm Holiday Parties",
    "subreddit": "Accounting",
    "timestamp": 1512298442,
    "score": 190,
    "keyword": "black manager"
  },
  {
    "text": "Tried writing a game of thrones like scene set in an accounting firm. Prompt which inspired me:https://www.reddit.com/r/WritingPrompts/comments/5tdx45/wp_a_take_on_office_politics_with_a_game_of/\n\n\n\nThere are two types of people in this world. The nice guys ,the type of guys who wouldn’t hurt a fly. They keep their head down and they work. They abhor conflict in all forms and they are terrified of being unfair. Then there is the second kind, the kind of person who achieves what he wants. Which do you think I am?\nI am a senior manager in one of the top 4 accounting firms on the planet. Which one?As if I’d tell you. This isn’t my first rodeo. This is purely a work of fiction and any resemblance of characters to people living or dead is purely coincidental.\nI walked into my clients office at 8. The audit room faced a beach, an empty beach. That is the carrot and I am the stick. The room smelled of sweat and associate tears. I approach Johnson.\nJohnson is a twat. Be that as it may he’s next in line for manager and with the economy being what it is ,suffice it to say this firm isn’t big enough for the both of us.I missed the birth of my first child  for this company.I’ll be damned if I get thrown off the partner track by an overachieving, brown nosing upstart.\n“Excuse me?” \nShit  I think I said that out loud.\n“Johnson! Just the man I wanted to see”\n“Hello sir. Hows the family?”\nMy wife is a bitch and my kid doesn’t network enough\n“Oh couldn’t be better!And how about you?Hows the wife?”\n“Oh Janines pregnant”\nShit.Hope that’s not mine.\n“That’s fantastic Johnson. So about this assignment. It’s going to be a good learning experience for you”\nThat’s code for ‘You’re going to have a bad time’.He knows it and I know it.\n“Also I have given you Harold and Brenda.Two of my best people no less”\nHarold was indeed the best at getting the team coffee and I suspect Brenda has a burgeoning glue addiction.\n“If you say so Chad”\nThe sucker bought it! What did I tell you? Massive twat.\n“Excuse me?”\nShit I really should stop talking to myself.\n“Oh just talking to myself.You know how it is”\nJohnson gave me a symphathetic nod and went back to his laptop. With a severely underequipped team at his disposal,an inviting beach and a non-cooperative client, his rating will plummet. I have just enough pull with the partners to deny him his promotion if that happens.\nSo I banged his wife and stabbed him in the back.Some would pat themselves on the back and call it a day.But not I,I decided to put one final nail in the coffin;I was going to steal his sandwich.\n“Chad your wallet”\n“Huh?”\n“You’ve left you wallet”\n“Oh,thanks man” \nI went to the pantry and grabbed the lunch box which had “PROPERTY OF MR JOHNSON” emblazoned on it.I grabbed a huge bite of the sandwich and swallowed it whole.Victory tasted like…peanuts?Shit.Shit.Shit! I felt my throat closing up.I fumbled for my wallet.Opened it.Cant breathe. Hit the epipen its not there.Why the fuck isn’t it there.Then it hit me. Johnson had my wallet. Johnson knew I was fucking him over. Killing me would mean the manager position opens up and he’ll get the job irrespective of how shitty a job he does over here. Shit.\nI crumbled to the floor and then saw black.\n*****************************************************************************\n“Thank you Mr Chad.Your story confirms what we already knew” the balding detective assured me.\n“The Epipen was found in his bag hours after you were taken into the hospital” he ruffled through his rather shabby notes\n“And Glenda from your HR Department confirmed that Johnson had fleeting access to your HR Records”\n“So the bastards going to jail, isn’t he?”\n“For a long time Mr. Chad”\nThe detective and his partner left.It was just me,my laptop and the ECG now.\nI ignored the call from Glenda. I owe her and she will be rewarded….in time. I opened my laptop and got back to work.This is why I love this firm;its work life balance.\nOh, you want to know what happened? Wouldn’t you like to know? Going back to the two type of people that exist. The only thing I can tell you is I’m of the second variety.",
    "title": "Tried writing a game of thrones like scene set in an accounting firm.",
    "subreddit": "Accounting",
    "timestamp": 1486843642,
    "score": 9,
    "keyword": "black manager"
  },
  {
    "text": "FDM Group IT Training Scam, Fraud & Deception There are many agencies and firms that claim to provide you with 'jobs' and 'training', but there is one particular company who seem to con some people and a few of my friends. Unfortunately, I was also conned by this disgraceful firm. This firm is called 'FDM Group'. The FDM Group and their 'Academy' scheme are simply a con. There are a few things you should be aware of. They mostly do NOT guarantee you a job in IT after training with them. Most people I know were forced to take up positions that were not related to their IT training. For example, one of my friends who wanted to be a Java programmer, was never actually given a job in programming. He was doing their training and then pushed into a 'call-centre' job doing some IT support - nothing to do with Java or programming. They struggle to put people into their so called 'guaranteed' jobs so they pressure you into doing something a 'bit' different - so they make their money out of you with a 'huge' cut in commission out of your wages. In fact, FDM Group employs sales people who have NO knowledge of the IT industry - it is no wonder that they supply jobs that are not even IT-related.\n\nI was simply conned from the start with FDM Group and their dodgy contract. They make you sign a contract before your training which contains some dodgy clauses in it. They employed an old faggot called Scott Black who is used to lure people into this deception and false contract. Scott Black is another guy who has been used to contribute to the scams of this firm. The FDM Group like to scare-monger people into doing the jobs that they want you to do - not what you actually want to do or have trained to do. After starting with the FDM Group, I heard rumours from a few other colleagues about the scare-mongering tactics that are used. Mr Scott Black and other staff members have been employed to do this scare-mongering activity. They tried to threaten me once and forced me to take a job with a Bank that was not IT-related and nothing to do with my vast range of IT skills. They might seem nice at first, BUT after you sign their contract you are simply stuck in a rut with their scam. Please note that you are NOT guaranteed 2 years of work after training. Their contract contains a dodgy clause in it - they can 'terminate' your contract at any time and for any reason at all. If you don't comply with their wishes of doing any bullshit job then they can use their dodgy contract to get of rid you at any time. While I did their training, I received hardly any support from their trainers who were pathetic in their attitude towards me. Most of the training itself is copied off the internet - you could probably find much of it already on the net. This is what other trainees told me after I started with FDM. After using and abusing me, they discarded me like a piece of shit. They used me as just another scape-goat for their fraudulent activities. FDM Group were going through some turbulent times and struggling – so to cut their costs……they cut a lot of jobs, and owe 1000s in wages.\n\nI later discovered that this firm was investigated for fraud and deception. In particular, their operations manager, Steve Buxton was investigated and convicted of several counts of fraud by conning many graduates and promising them with careers and training in IT. As well as a racist, who abused many workers, he obtained 1000s of pounds from vulnerable graduates who were desperately seeking their careers in IT. In 2003 Steve Buxton was convicted but narrowly escaped a prison sentence. He already served a prison sentence in the 80s for Fraud, but his close connections to important people at the FDM Group helped him to secure a new future and conceal his criminal past. The FDM Group managed to pull some strings in order to cover up the traces of most of their fraudulent activities. Their CEO, Rod Flavell and his assistant, Julian Divett, were also investigated for their part in the scam. Due to their cold hearted manipulation of people, they concealed their traces of illegal activity that they still continue to this day. They have changed their management staff and shuffled their executive team to hide the scamming and fraudulent activities.  Rod Flavell and his staff are despicable fraudsters and con artists who deceive and target vulnerable young people who simply want a future in the IT profession. It is astonishing that this firm is still in business and still trying to con many innocent graduates. What a shame to the IT industry.....The FDM Group mainly give pathetic or non-existent training, lack of support, bullshit jobs with fake promises and a dodgy contract. It's no wonder they were investigated for fraud and deception.",
    "title": "FDM Group IT Training Scam, Fraud & Deception",
    "subreddit": "consulting",
    "timestamp": 1492362592,
    "score": 5,
    "keyword": "black manager"
  },
  {
    "text": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office So l worked in an all female workplace. I was marketing and communications manager for a nonprofit with a staff of 11. I did social media, desktop publishing, graphic design, web, light IT, anything to do with marketing. The new black female ceo came in and harassed me about everything she could take issue with like being \"intimidating\" because I'm tall. \n\n\nAfter three years of exemplary performance under the previous ceo they eventually fired me for leaving work 15 minutes early and called it \"job abandonment\" and denied me unemployment and hired a female to replace me. She lasted a few months since she couldn't do the job and they hired another woman I went to school with who was totally incompetent. \n\n\nI tried to get out before the fired me since I knew they were trying to pressure me out. I interviewed for a similar position at the nearby university but they hired one of my boss's middle age Hispanic female colleagues over me and the black female who interviewed me told my boss I interviewed for the spot. The Hispanic female they hired instead of hiring me called me a week later to ask me \"how to do what I do.\" Of course there was no reason for me to teach her how to do a job she should have known how to do to get hired in the first place nor could I teach her in a phone conversation what took me years of work and study to learn. They fired me about a week later. \n\n\nIncidentally I set up my email to forward to the new ceo before I was removed from the system after asking on my way out if they wanted me to do that as we had with other employees who had quit and they said yes then the new ceo called the police because I was \"harassing her\" with thousands of emails...from a company account I was not in control of that was set up to forward under her instructions. Because of my job I handled dozens of accounts for various platforms and software and got probably 100 emails a day, like analytics reports and such. My favorite part was near the end when her Outlook needed to be fixed she left the calender open on the desktop and it said \"make [myname] f up\" for a day that week.  \n\nThen she trashed my name all over town so nobody would hire me. I tried to be a stay at home dad and my wife and I broke up. Haven't seen my kid in 3 years. Thanks for making the workplace more diverse. I used to be a liberal.",
    "title": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office",
    "subreddit": "MensRights",
    "timestamp": 1497839644,
    "score": 73,
    "keyword": "black manager"
  }
]