[
  {
    "text": "I walked out today You might remember my post: \"Might walk out today.\" \n\nWell I did it. \n\nThe principal called me into a mandatory meeting to show her how I write IEPs because I take too long. She proceeded to try to belittle me the entire time. I had a rebuttal for everything she said. Because she's stupid and inattentive - it was easy. \n\nBut when she told me to calm down (Spoiler alert: I'm black), I said: \"You know what? You're not going to talk to me that way. I'll be back with a union rep.\" \n\nI walked to my classroom. Collected my prepacked tote and left. \n\nI don't have students in my class today. But they do have 4 IEP meetings scheduled for next week. She should probably get a headstart on those.\n\nI wanted to do one more week. I tried, y'all. I really tried.",
    "title": "I walked out today",
    "subreddit": "Teachers",
    "timestamp": 1676060648,
    "score": 1666,
    "keyword": "black principal"
  },
  {
    "text": "I was told I needed to remove a poster from my classroom because it was political. So I teach Biology and Environmental Science in a small town high school, which I graduated from. I was told today by my principal that he received a call from our district board office stating that I had a poster in my room that was political and needed to be removed as it does not relate to my content. The poster states the following: \"In this space we believe black lives matter, love is love, science is real, feminism is for everyone, humans are not illegal, and kindness is everything.\" Now, my school *loves* to tout that it prioritizes making all students feel safe and welcome so I figured there would be no harm in having a poster like this to show the students that anyone is welcome in my room, regardless of who they are. However, my principal told me that the individual who called him was not my superintendent but rather a board member who specifically stated that they did not inform the super of the \"issue\". \n\nMy principal told me that he was not telling me what to do, but that he recommends removing the poster to, \"save you some trouble down the road.\" This is all occurring in a public school system where multiple teachers (at least in my building) have very similar posters, and even *actual* political stickers/posters (not just social studies teachers) in their rooms, and we have prayer in our school as well (not forced, but it does happen during morning assemblies occasionally). I spoke to my local union representative and they reached out to our district representative, they also said they will be getting the super's opinion during tonight's board meeting. I just love small town politics (pun intended).\n\nEdit: Thanks for the support. As for the ones telling me why I’m in the wrong, I think you’re missing the overarching points. It’s meant to spread kindness, not spark some heated debate. The only ideologies that I “attack” in my classes are those that support over exploitation of natural resources lol\n\nEdit 2: Okay allow me to clarify some things:\n\n1. This isn’t the hill I’m dying on. If my super says take it down, I’ll take it down and replace it. \n2. It’s not like I’m saying that this is super unbelievable. I knew the risks when I put it up, considering we have teachers who are very open about their dislike for other individuals that don’t agree with them.\n3. I’m not trying to shove anything down anyone’s throat. I’m simply just trying to spread acceptance and kindness in a time when we really need it. I tell all my classes at the start of the year that all kinds are welcome, even if we don’t share similar views, at least respect the other side as we are all human.\n4. Some of you really need to learn to respect others’ opinions and values lol",
    "title": "I was told I needed to remove a poster from my classroom because it was political.",
    "subreddit": "Teachers",
    "timestamp": 1693253941,
    "score": 1225,
    "keyword": "black principal"
  },
  {
    "text": "Student cussed and yelled at me today after telling them to put the phone away \nI am a ELL instructional specialist/IC and I am helping a teacher with classroom management (not ESL but they still assigned her to me because we're understaffed). I was in her classroom and saw a student on the phone. Our principal has been very strict about the no-phone policy, students are supposed to put their phone in a bin as they walk into the classroom and only take it out at the end of the block. The principal has been reprimanding this teacher because of phone usage in her classroom, and since I am trying to help her and I don't want her to get in trouble, when I saw a student on her phone I told her to either give it to me to put it in the bin, or do so herself, like I always do in this kind of situation. She kept it in her hand so I stood there waiting and hell broke loose...\n\nShe started yelling at me, telling me to leave her alone, she called me a b*tch multiple times, told me to go f*ck myself multiple times. 2 of her friends intervened and doubled down, yelled all kinds of profanities, and also called me a racist (these students were black but so is 80% of the class and the other 20% are Hispanic students, she was just the only one I saw on her phone).\n\nIn the end she put the phone in the bin and I walked away. At the end of class, I talked to her 1:1 explaining that I am trying to help, telling her that the school is strict on the policy (which she already knows) and I don't want the teacher to get in trouble. She was much calmer, she said she understood, and she even smiled. Even so, I am very ashamed to admit that I have been shaking and my heart has been racing since that happened and once the bell rang I hid in the bathroom to cry. I feel so stupid for reacting like this but unfortunately I am autistic and this kind of direct confrontation really takes a toll on me.\n \nEven though I really enjoy my job, I feel like I have no business working in education because I am weak and not assertive enough and I constantly get disrespected and walked over not just by students but colleagues as well. I feel stupid because I think I handled this very poorly but at the same time I don't know what I could have done differently besides minding my own business. I just want to help this teacher because if she doesn't get this under control, she will keep being reprimanded by the principal and might get written up.",
    "title": "Student cussed and yelled at me today after telling them to put the phone away",
    "subreddit": "Teachers",
    "timestamp": 1692890473,
    "score": 1038,
    "keyword": "black principal"
  },
  {
    "text": "Well it finally happened As a social studies teacher in Texas, I have always tried to be very VERY careful about divulging my personal political views to my students. Fairly often, however, my students will ask me if I support/oppose something either to bait me or just because they're genuinely curious. When this happens I usually say something about how that's a personal question to ask someone and that I don't share my personal opinions on that stuff in class because I want to give them the tools to form their own informed opinions about issues without me influencing it. \n\nThat being said, I really value making my classroom a safe and supportive space for all my students. I make it a point to shut down any racist/sexist/homophobic comments I hear (they're 13, so there's a lot lol) and emphasize respect even though we all have different opinions on things. My LGBTQ students pick up on this early on in the year and tend to latch onto me as a safe person to talk to. \n\nToday, I got a calendar invite from my principal that was just titled \"curriculum chat\", which I joked with a coworker that it sounds like what you would call it if you wanted a serious meeting to feel nonthreatening lol. Shortly after, I got an email from my principal giving me a heads up on what she needed to talk to me about.\n\nApparently, a parent sent her an email about \"disturbing comments\" made in my class. They accused me of making LGBTQ issues a part of my classroom instruction, and that I had expressed my intent to teach lessons on Pride Month in May since we would be out of school in June. \n\nI can safely say that this did not happen. I'm assuming they are referring to the fact that I let my handful of gay or trans students have conversations about their lives and experiences like any other students so long as they aren't being disruptive or inappropriate. The only comment I have ever made about Pride month was when one of my gay students asked if there was an LGBTQ history month since we discussed had black and women's history month. I responded that there are definitely members of the LGBTQ community that have made great contributions to our country and that I was pretty sure that those people are usually celebrated and acknowledged during Pride month, which was in June so we wouldn't be in school to talk about it. \n\nThankfully, my principal is pretty understanding and once I explained the context of the comments the parent mentioned said that she didn't think I had really done anything wrong, but to try to keep student conversations focused on whatever the topic at hand was. I'm a little surprised it took this long for someone to accuse me of bringing my personal views into the classroom considering how much teachers (especially history and social studies teachers) have been under a microscope in recent years, but I'm glad that it was just because of a lack of context. \n\nAnyways, thanks if you read this far lol. Between this and state testing I just needed to vent about it :)",
    "title": "Well it finally happened",
    "subreddit": "Teachers",
    "timestamp": 1683079571,
    "score": 669,
    "keyword": "black principal"
  },
  {
    "text": "How to survive your first years of teaching (from a veteran teacher) 1. Dress Code. If gym teachers can wear Nike shorts and a t-shirt then best believe its jeans and a polo everyday for me. Get creative. Blue jeans. Black jeans. Gray jeans. I call it professional comfort.\n2. The \"Nod and Smile\" Technique. Meeting with your principal? Check. Meeting with a parent? Check.\n3. Duties? Ha! If its not paid I'm not there.\n4. Emails. 1) Whenever an email states, \"we would like to invite..\", you are off the hook. 2) Whenever you get an email from Human Resources I highly recommend you don't reply until after a few days have passed. I call it a calculated email delay.\n5. Contract hours. School day ends at 2:45? I'm in my car by 2:50. 2:49 if I'm strategic. I'm home by 3:10. The old, \"I have to pick up my daughter from preschool\" works all the time.\n6. PD time is lesson planning time. \n7. Embrace ChatGPT essay grading. Its a great tool to save time. Grade smart not hard.\n8. Invest in a mini cooler and desk fan.\n9. Classroom policies. There are things worth letting go and other I will die on a hill for. My phone policy I will wage world wide war for.\n10. Take it easy. In all seriousness this job can be stressful but learn where to take it easy.",
    "title": "How to survive your first years of teaching (from a veteran teacher)",
    "subreddit": "Teachers",
    "timestamp": 1693331348,
    "score": 574,
    "keyword": "black principal"
  },
  {
    "text": "This is why teachers quit Hmph my new principal moved me from math grade 4 to self contained grade 3. Days till the start of school year: 3 days.\n\nIn fourth grade math last year, 85% of my students went up at least one level. \n\nMy other group was special needs and a lot of them moved up as well even though they didn't jump levels like my homeroom. \n\nAdmin saw this and my classroom management and decided I would be the best/safest bet to fill the spot, which I'm flattered by. But one week's notice,after I spent the summer on fourth grade curriculum and prepping with my partner is so unprofessional I've considered walking or best case scenario, leaving after the year is up.\n______________________________________\n\nUpdate: 2 days into the school year, one of the fourth grade teachers that they moved up to replace me wound up quitting due to outside circumstances, leaving the 4th grade one teacher short.   \n\n\n4 days into the school year, the principal decided to allow an assembly with only black students to encourage them to get better test scores and subsequently was forced to resign.   \n\n\n5 weeks into the school year, the fourth grade class still had not received a new teacher, and the other 4th grade teachers pitched to have me move back up to take the class over. So now i am back in 4th grade teacher ELA and social studies. They were able to find a teacher to replace me in third almost immediately.   \n\n\nThings aren't perfect, but way better than the beginning of the year.",
    "title": "This is why teachers quit",
    "subreddit": "Teachers",
    "timestamp": 1691197888,
    "score": 548,
    "keyword": "black principal"
  },
  {
    "text": "A student called me the N-word today. Had a student yell at me and call me an N-word today  because I told him to get to work. I'm not black and neither is the student. I sent them to the vice principal and ploughed ahead with the rest of class.\n\nNext period, I saw that the student was in their next class and hadn't heard from the VP about any sort of punishment. Just last week a student got suspended for 5 days for calling the VP the N-word. Apparently it is okay to abuse teachers though. \n\nSo I wrote an email to the parent about what had happened and then wrote an email to my principal and VP that I was requesting that they student be suspended from my class. I attached work for the student to do when they were not attending my class. To my surprise, my VP got back right away and agreed to suspend the student from my class.\n\nIf I had it my way, the student would face the same 5 day suspension that the other student did, but I'll take the small victory I guess. I guess the moral of the story is to make sure to follow up on punishment and always leave an email trail.",
    "title": "A student called me the N-word today.",
    "subreddit": "Teachers",
    "timestamp": 1683584014,
    "score": 484,
    "keyword": "black principal"
  },
  {
    "text": "Student threatened me at school January 25: \n\nI took away Student X’s phone because he was using it when he was not supposed to. He asked for his phone back. I said no. He became angry. Then he said, \"I know what car you drive. It's a real nice car.\" \n\nI reported it to the vice principal. She got the police involved, gave him five day’s suspension, his probation officer, and asked if I wanted to press charges. I said no. The vice principal told me that she would switch him to a different teacher. \n\nFebruary 3: \n\nStudent X is back in my class. His name is still on my roster. He told the entire class why he got suspended. He said to the ENTIRE class, \"I got suspended because all I did was compliment her car. I complimented her car, and I got in trouble for that. It's because I am black. She hates black people. Miss is really racist.\" So then some of the other kids started to get up and say, \"Miss, you have a really nice car.\" The majority of the class kept saying that I had a really nice car and asking me why I was racist. Then Student F actually came to my desk and said, \"I saw you drive your car this morning to school. You do have a really nice car.\" The entire environment felt hostile. \n\nI reported this to the vice principal, but she said that she wanted to see me handle the situation on my own. \n\nI am a first year teacher. \n\nSo, what should I do? How do I handle this situation?",
    "title": "Student threatened me at school",
    "subreddit": "Teachers",
    "timestamp": 1675520476,
    "score": 460,
    "keyword": "black principal"
  },
  {
    "text": "Kids made an outlet explode A couple of my 10th graders were messing with an outlet and a power strip. I warned them that this was unsafe and a \"dumb way to die\".\n\nOne of them, G.M., told another, F.C. (who was not supposed to be there and had been told to leave) to knock a penny onto the plug. So he did.\n\nThere was a loud *pop* noise and a flash like a camera. Then the projector turned off. The outlet was covered in black soot.\n\nI sent a message to admin via the staff GroupMe, and the ass't principal collected the two students a few minutes later.\n\nWe all had a sit-down after school. Idk what the AP said, but both students were in tears. G.M. apologized for \"doing stupid shit\" and \"adding to [my] stress level\". F.C. promised not to visit my room anymore (OK, sure) and apologized for \"almost starting a fire\".\n\nLuckily, the projector was fine, and facilities fixed the fuse that day. But the total damage was $140 (to be split among the students).\n\nOne girl wants out of that class because she feels unsafe... which, honestly, is valid.\n\nEdit: I marked this as “Humor” because the “RANT” flair is no longer available, not because I think it’s funny (though there is *some* humor to be found in the situation).",
    "title": "Kids made an outlet explode",
    "subreddit": "Teachers",
    "timestamp": 1699737313,
    "score": 451,
    "keyword": "black principal"
  },
  {
    "text": "Teacher being unkind to racist student. We got a new student a couple months ago. They are white and the teacher and other aide in the room are black. This is a LIDS (low incidence disabilities) room, so all the kids have some type of disability. I am an aide and white as well. The student got into an argument with the other aide and told her they didn’t like black people and neither did their mom and that’s why they wanted me to give them their spelling test and not the black aide. They then began crying because they worried the aide would confront their mom and ask her if the family was racist. **I talked to the student about this and told them they need to apologize because disliking someone for their skin color is a horrible thing and what they said was mean.**\n\nThe aide then told the teacher who was already having some difficulty with the student as far as misbehavior and laziness concerning classwork. The past couple days, the teacher has been making comments to and about this student in front of them and the other students, who laugh. For example, the teacher said, “For the most part I’m proud of you guys… except you, (student’s name.) I’m disappointed. Do better when we come back from the break.” She has also said, “Why are you asking her for a cookie? You don’t like her.” When they asked the black aide for a Chips Ahoy cookie as she was passing them out to students for our Christmas party. I can tell the student is embarrassed and wants her to stop.\n\nThe teacher already bought all the students an individual gift and told this student that she shouldn’t have gotten them anything because they don’t deserve it. **While I understand that racism is awful and I do not condone their beliefs**, I think it is a little unfair that the teacher is essentially bullying an 11 year old who obviously learned this belief at home. They lived in a very white state before moving here and they are not used to being around people who aren’t white. I do not believe this student fully knows how to interact with kids of a different race than them. To me, I’d be trying to treat this student as kindly as possible to show them their belief is false. Kill them with kindness sort of thing so they will come to understand on their own racism is a bad thing, through positive experiences with people of other races. Instead, their racism is just being cemented through this negative experience I fear. \n\nShould I say something to the principal? This is a very delicate matter and I don’t know what to do.\n\nEdit: This student is in the life skills self-contained classroom. They can’t just be “moved” to another teacher. I am also appalled that people are telling me I’m an apologist for racism??? WTF?! Did you miss the part where I told the student to apologize because what they said was bad? This student has said a lot of things that are off the wall that make me believe that their family is nutty. \n\nEdit 2: Wow. So many of you are being extremely unreasonable and assuming shit. I can’t believe you’re allowed to teach. Your poor students have a moron for a teacher. If you’re not an educator then THANK GOD but I don’t know why you’re commenting. You’re about as sharp as a marble.\n\nEdit 3: I have known this teacher for years. She was MY principal when I was a student at the school I work at. She was known to always have her paddle ready and wasn’t very lenient with the students in general. She has a paddle she uses on the life skills students as well, saying she’s “old school” and will get through to them one way or another as long as the parents/guardians have agreed to it. Her expectations are quite high and she runs a tight ship.",
    "title": "Teacher being unkind to racist student.",
    "subreddit": "Teachers",
    "timestamp": 1702660814,
    "score": 321,
    "keyword": "black principal"
  },
  {
    "text": "The N word... I am told by the black scholars when I ask them not to use the Nword that they can use it, and I cannot.  A lot of times I let it go... but after so many hard 'r's ...\n\nI do not use that word.    \nI usually say something like, \"Would you like me to get the principal and see what they think about that word?\" or \"this school has a no cussing policy...\".\n\nThat usually works.  \n\nPlease help me, am I being ignorant?    \nIsn't it our goal to live in a world where we are all treated equally?  Not a world where you can use certain words and not face consequences that are based solely on the color of  your skin?\n\nAre my feelings wrong on this?  How do other people feel?/deal with that particular cuss word?",
    "title": "The N word...",
    "subreddit": "Teachers",
    "timestamp": 1678635706,
    "score": 206,
    "keyword": "black principal"
  },
  {
    "text": "Update: Don't Ask For help Then Get Mad. So I didn't get a response from that teacher over the weekend like I thought I would. Instead, she apparently went to the new principal to bitch about me giving F's to some of her students. \n\n7:00 AM, I entered the school and went straight to my box to check for notices, handouts, ect and then to my classroom to make coffee. (Yes, I keep a coffee maker in my classroom for my own personal use and yes you can have some. But I make it strong and black.)\n\nJust as I was finishing sorting out the crap admin keeps shoving in our boxes, the new principal called me into her office. She told me that she had a complaint from the ELA teacher and some parents about the grades I gave them. \n\nI immediately raised my hand and cut her off. I simply said \"No\". She responded with \"excuse me\".\n\nI told her in my \"having had coffee yet voice\": \"No! I don't want to hear it. I don't care. And if you try to force me to talk about it or listen to you talk about it, then I'll quit. I shit you not, I will quit. I'll take all my vacation days until the last day of school, force you to find coverage, and never come back to this dump. Now, I'm leaving to get coffee. Bye.\"\n\nI then left the office and went to my room. She didn't say a damn thing to me all day. It was a nice.\n\nI think she is scared I will follow through on my word or she wants HR to talk to me. Doesn't matter to me. I am taking early retirement to be a full time dad to my daughter. I'll pick up some extra money when I need it subbing or doing consultant work. \n\nNote: No one at the school or district knows I am leaving.",
    "title": "Update: Don't Ask For help Then Get Mad.",
    "subreddit": "Teachers",
    "timestamp": 1686022307,
    "score": 74,
    "keyword": "black principal"
  },
  {
    "text": "I wanna wear Converse :( This isn't a super serious post I just feel like whining about \"professional clothing\". I hate my khakis and black pants and I want to wear my converse and my fun tshirts and my sweaters with loud patterns. I'm finally at a stage where I can buy clothes I like but none of them are professional enough. Let me wear my cardigan with the 3d daisies, please!!!\n\nEdit: someone already said it but I will, too. There is no \"just do it\" at a lot of districts. Mine isn't terrible but you can get in trouble for \"unprofessional dress\" and I'm not risking seeing my principal or superintendent so I can wear my converse. I think more and more districts are heading towards informal dress which is amazing because I think the kids connect better. But some of us aren't quite there yet. Hopefully we'll catch up soon :)",
    "title": "I wanna wear Converse :(",
    "subreddit": "Teachers",
    "timestamp": 1675538321,
    "score": 50,
    "keyword": "black principal"
  },
  {
    "text": "I was yelled at by another teacher in front of half the school… I (30, female)work in an urban charter school (K-8) in SW Ohio. I’m a title teacher (mostly with 5th grade and specials) and it’s my first year in a proper school.The job is incredibly stressful for everyone. We cope with a lot of disrespectful students and a lot of existing trauma/added challenges inside the classroom. \nBefore I explain what happened, I must explain how the 8th grade schedule works. \n\nThere are 2 teachers for 8th grade: Brooks and Dunn (not their real names, just the first 2 that came to mind.) They have their own classrooms, but Brooks teaches ELA and history, while Dunn teaches math and science. Students switch between the classrooms and their schedules alternate each day. \nSo if Brooks’s home room is with him in the morning on Monday, they’ll be with Dunn that afternoon. Tuesday morning, Dunn’s home room starts with Brooks and goes back to Dunn’s room for math that afternoon.  \n\nEvery day before lunch, 8th grade has Specials (SEL or STEM) with either Mr Collins or Mr Bacon. Mr Bacon is known for his very short fuse and his booming voice. After Specials is finished, Bacon takes the students to lunch.\nThere are 2 cafeterias and 2 lunch periods. \nThe transition to lunch is always chaotic—half the school will be moving from one place to another and the hallways are quite narrow. \nRecently, one of the 8th grade classes lost the privilege to eat in the cafeteria and now has to eat in their classroom. \n\nMain events:\nI went to do lunch room duty and was asked by the principal to deliver lunch to Brooks’s classroom. So I started pushing the trolley down the hallway. Halfway to my destination, I saw a bunch of 8th graders being led by Bacon to the cafeteria. We greeted each other and I said I was taking food to Brooks’s room. Apparently, this WAS Brooks’s class (his home room) and I was briefly confused. I told Bacon there must be some mistake, because Brooks’s students weren’t supposed to be in the cafeteria today. (Admittedly, I may have talked over Bacon briefly-but not intentionally. We just started speaking at the same time.) Bacon then shouted at me in a booming voice that carried down the hallways and it honestly left me a bit shaken. \nSo I followed that group to back the cafeteria, where the principal told Bacon to take the food back to Brooks’s classroom. Bacon apologized a bit lamely for shouting at me, saying the 8th grade had been on his last nerve all morning and he shouldn’t have snapped at me. \nIt was a minor misunderstanding that left an odd taste in my mouth, but nothing too significant—until this afternoon. \nI had to teach specials in 4th and 5th grade and the kids were rowdier and more disrespectful than normal. Throughout the last 3 hours, I was asked by at least 6 or 7 kids why I “got in trouble” with Mr Bacon or “what I did wrong” or “why he yelled at [me]”. \nThey seemed to think this was yet another excuse not to respect me as a teacher. And that’s what got me upset enough to write this novella. The fact that kids saw him treat me that way and may have concluded that I’m not important enough to take seriously. I’m already very young-looking, relatively inexperienced, and white in a 98% black school community. I have enough trouble as is. \nShould I take this issue to my mentor or to the principal? Should I chat with Bacon 1-on-1?  Do I just move on and let it go? I don’t want to cause trouble for anyone, but a lot of this feels very not-okay. \nAny support, advice, or kind words would be appreciated. \nPS-sorry for any spelling/formatting error or lack of clarity. I’m on my phone and have never posted here before. \n\nThank you!",
    "title": "I was yelled at by another teacher in front of half the school…",
    "subreddit": "Teachers",
    "timestamp": 1695668173,
    "score": 40,
    "keyword": "black principal"
  },
  {
    "text": "Tutorial: how to implode your exit from a horrible school (This is tagged as humor because I’m pleased with myself snd it was hilarious. I actually did this. This place was THAT bad)\n\nStep one: work for a horrible school \n\nStep two: suffer through an incredibly awful year\n\nStep three: find a new job, put in your notice, and wait \n\nStep four (optional): upon leaving schedule an exit interview to tell your superintendent all the things that lead to your departure. \n\nStep five: send a email to the entire staff, address it to your principal, state that you chose to address him publicly because he’d share it anyways so really you did him a favor. In this email refrain from using vulgar language and name calling. Instead, write your story. The story about how you were so excited to be a teacher and this school year. The story about how one man and his cronies just destroyed your mental health. \n\nStep five: receive an email from his side that reads as follows: \n\n“How discourteous, nasty, unprofessional, unethical, unprincipled, and downright inappropriate it is to send such an email on a professional platform. If this is the best that the district has to offer, then I am appalled. You never wanted what was best for everybody (just yourself, thanks for confirmation.\nThese are the things that you're allowed to do when you're in the \"Sup't Club!\" Good luck in all your future endeavors.\nHashtag- BlackExcellence\nHashtag- CancelCulture\nHashtag- BFY\nHashtag- Toodaloo” \n\nAnd laugh because you clearly hit a nerve and she had the audacity to go send this to the entire school. \n\nStep six: the superintendent will send an email the following day that tells staff that this behavior is unacceptable and that all emails are subject to the Freedom of Information Act \n\nStep seven: *middle finger* *edit this is hyperbole y’all. I didn’t *actually* give the middle finger.",
    "title": "Tutorial: how to implode your exit from a horrible school",
    "subreddit": "Teachers",
    "timestamp": 1685572816,
    "score": 40,
    "keyword": "black principal"
  },
  {
    "text": "Racist Assembly=Suspension The principal and a teacher at a Florida elementary school are on paid administrative leave after an assembly was held only for fourth and fifth-grade Black students, who were collectively told to improve their school performance, regardless of how each student was doing individually.\n\nWow! The anti-woke shit is going nuts in FL. \n\nhttps://news.yahoo.com/florida-elementary-school-principal-teacher-053122391.html",
    "title": "Racist Assembly=Suspension",
    "subreddit": "Teachers",
    "timestamp": 1693020362,
    "score": 29,
    "keyword": "black principal"
  },
  {
    "text": "How to deal with entitled parents? I teach 4th in a Title 1 school. I would've never expected so much parent entitlement from this school setting, but this year most of my prep time has been spent dealing with student issues and demanding parents (and it's always the rich white parents who are in the minority at my predominantly Black school). It almost feels as though I'm punished for telling these parents anything contrary to the idea that their sweet little baby is perfect and can do no wrong. For example, I set up a meeting with a parent because I noticed a decline in a student's work. Mom reacted with anger, was skeptical of MY teaching, threatened to go to my principal, and is now emailing every day or every few days asking for \"data to back up the interventions I have put in place.\" With another kid, I wrote home to tell them that he said several insulting things to another kid (\"Your mom is fat,\" \"your writing is stupid,\" etc.) and they said that their son claims he didn't say those things and I'm lying. I'm now receiving texts from this mom twice daily asking for updates on her precious baby and what I'm doing to \"help him feel less fearful in the classroom.\" I'm feeling really discouraged and angry because I put in so much work in the first half of the year to cultivate strong relationships with students and families. Then, one small issue arises, and suddenly I'm considered a liar, a bad teacher, and someone who is out to get their kid. It almost feels as though it would have been easier to not report any issues home and just pretend everything is fine.\n\n&#x200B;\n\nWhat's worse, it would be somewhat manageable if this was one parent, but I have 4-5 parents who are this demanding. I really cannot handle this many parents demanding my time every single day. I've been having to prep for hours at home the past few weeks because all my prep time is taken by parent meetings. \n\n&#x200B;\n\nTL;DR: How do I deal with entitled parents who demand frequent contact and updates?",
    "title": "How to deal with entitled parents?",
    "subreddit": "Teachers",
    "timestamp": 1679066045,
    "score": 25,
    "keyword": "black principal"
  },
  {
    "text": "Black eye from student. Hello everyone. I am a 27 year old 2nd year Special Education Para. I work in a small school district with the SPED department being managed by another district. We currently have a female 8 year old 120lb 5 foot tall non-verbal severely autistic student. She has multiple aggressions per day. She loves to pinch, bite, grab and yank our faces, necks, and the rest of our bodies. She uses her body as a bulldozer and she is so forceful. \n\nFor context: Us paras are alone with this student in a room for at least an hour per day per Para. This room unfortunately not only has a hallway door but it also has a fire escape door. \n\nYesterday during my hour and 30 minute time with her this student became extremely aggressive (for no apparent reason) and started pinching, grabbing and biting me. The student then tried to run outside using the fire escape door (which opens directly into our busy parking lot and the student has no comprehension of traffic) I made it to the door right before the student to try and redirect but she then charged me and using her arms or body (unsure, it was all a blur) she slammed my face into a wall. I was finally able to call for backup and we were able to calm her down. \n\nI did not realize the extent of my injury until 20-30 minutes later when I was able to look into a mirror. I had major swelling and redness on my cheekbone where I struck the wall. After an hour I started bruising. After applying ice for 3 hours and working for the last 4 hours of my shift I came home with a completely swollen, black eye. \n\nNo immediate actions were taken upon the child the day of incident or the day after. Today (day after) my principal approached me wanting pictures to send to the superintendent and SPED COOP I work for. Pictures were sent to the mother of the student which she responded with asking if we could put cameras in the room so she can watch us. This request was turned down due to other students being in that room as well as events are able to be misconstrued. \n\nThis is not the first major injury I have sustained from this student, although it is the most severe. \n\nI cannot refuse to work with this student because all of us paras are getting hurt and it’s not fair. We have no proper training whatsoever to compare her aggressions. \n\nI do not want to quit my job because other than this student I love my job. \n\nIf you were in my situation, what would you do? \n\n(Picture of my injuries on my profile if you’re curious)",
    "title": "Black eye from student.",
    "subreddit": "Teachers",
    "timestamp": 1680144269,
    "score": 25,
    "keyword": "black principal"
  },
  {
    "text": "You don’t fit into the community I teach in a predominantly Hispanic and black school in the south. I am a white, female, history teacher. I understand my privileges I have and I know I will never fully understand the true struggles my kids will face, but I love and respect them. \nI have been playing a cat and mouse game with my principal to see if I am being rehired and I finally was able to talk to him today. I have had great observations, never been pulled in to be disciplined, volunteer as much as I can, and try everything to help my students pass. He then shocks me by saying he’s “not planning to rehire me at the moment for a couple reasons.” \n\n1) He needs a teacher who will do more hand holding with the students. I literally do the assignments in class with my students so they don’t have to do homework. All I require of my kids is to participate in the discussion, ask questions, and write down the answers we come up together. \n\n2)The biggest issue: I apparently was accused of a racist incident before spring break. The accusation of what I supposedly said shocked me to the core because this wouldn’t have been a slip of the tongue mistake I made. But a bonefided racist comment which I would never make. This shocked me to my core. I was never told there was an investigation, what I was accused of, and the outcome until this meeting where he’s telling me that he’s worried I would make the school have another news worthy racist incident (we had a huge one at the beginning of the year.) He then said there was no substantiation behind the claim or they found no evidence but still…\n\nBecause of reason 2 he is not rehiring me. He essentially told me to only apply to the primarily white schools in the county and none of the diverse schools. He also said that he’d write me a recommendation letter a good one but not a glowing. \n\nI don’t understand how I can do everything they tell me, use all the crappy district resources, take abuse daily, and have never complained and still I’m not rehired. I’m just trying to wrap my head around this and my anxiety is spiking that not only does someone believe I am possibly racist but this can affect my future career. I just needed to vent, because I’m spiraling thinking of every interaction.",
    "title": "You don’t fit into the community",
    "subreddit": "Teachers",
    "timestamp": 1681351440,
    "score": 23,
    "keyword": "black principal"
  },
  {
    "text": "Venting about a veteran teacher I’m a first year teacher and I would like to preface this by admitting I’ve definitely struggled with classroom management. There is this teacher on my team that I think has lost her mind. She screams at my students when she finds them in the hall, even when they are on calm down walks or Ive instructed them to head somewhere. She will run down the hall to come yell at my students when she hears them being loud(most of the time by the time she gets there, they already quieted down and are back on task). I’ve looked past all of that chalking it up to my inexperience. \n\nWe had field day last Thursday and some of my students were sharing food(a big no at our school). She and I were told and she declared it wasn’t her job to deal with it. I walked over to my students, calmly told them they can’t share food. I was about to deal consequences. She jumps in and starts yelling at them. I tell her I got this and she steps in front of my and continues yelling. \n\nShe comes up to me later and starts telling me about how undeserving my students are and how I WILL cancel my activities and lesson for tomorrow. I had planned to use black lights and let the students do all of our normal work, but with highlighters to help keep them engaged. She says that’s a reward and my students don’t deserve rewards. \n\nWell fast forward to the next day and she has called out sick. All I can say is thank god I don’t have to deal with her drama today. Well I have some of her homeroom students in my math block and they come in saying they have a sub. I brush that off saying I hope she felt better. Her students get excited and tell me she isn’t sick, but it’s a secret. I once again brush them off with a well if it’s a secret then you shouldn’t tell me. The girls blurt out that she told them she was tired of me and my class and our behavior issues. I brush the girls off again because I’m not discussing that with them. I’m obviously livid. I think it was totally inappropriate for her say that to a gaggle of 10 year olds. I know she’s a gossip and I really don’t give a shit what she says to adults but that pissed me off. I’ve emailed the principal and I’m going to talk to him about her. She sticks her nose is my business way to much and I’m tired of her screaming at my students when she doesn’t even know what’s happening. I even got a phone call from a parent about the field day incident demand to know why she was even involved. \n\nOn a positive note, I had a great day when she was out with my students. No behaviors. Everyone on task and working hard. Even my student know for her behavior was completely engaged. I just needed to vent.",
    "title": "Venting about a veteran teacher",
    "subreddit": "Teachers",
    "timestamp": 1685906427,
    "score": 21,
    "keyword": "black principal"
  },
  {
    "text": "Should I tell my prospective boss that I left something off of my application? I am trying to land a better teaching job, and I interview for a great job soon. I have a really really good chance at landing this job, however, in my application, I left the \"have you ever been fired from a job\" field blank, which isn't 100% true.  \n~13 years ago, I was (I feel unfairly) fired from a job for someone else's procedural error (this company is a national chain and is still around today).  \nI am a very upfront, straight forward person, and I feel really bad about omitting this information on my application, but this black mark made it hard to even get an interview for my current position, and it would not be fair for me to miss out on this opportunity for something unfair that happened 13 years ago.  \nI have a very strong resume and have been a rock star teacher, but I'm worried that this new district's background check will turn up that I was fired from a position, I will be labelled as dishonest, and I won't get the job.  \n**After the interview, should I tell my prospective principal about this? Am I worrying about nothing?**",
    "title": "Should I tell my prospective boss that I left something off of my application?",
    "subreddit": "careerguidance",
    "timestamp": 1682269703,
    "score": 1,
    "keyword": "black principal"
  },
  {
    "text": "Nigga is an empowering word. No white people can't police our use of it. And yes they still can't say it. When did these takes become controversial? I ask because I saw a post on here where everyone in the comments were bemoaning the fact a black person wanted to say nigga. They didn't mind that it it was white folks policing the black persons use of nigga. Even going as far to act like it's the same as a white person using it.\n\nAll of that thread got me to thinking. Is this mindset normal now? When did the shift happen?\n\nLike in the south everyone black I know says it. My family old and young, teachers, principals, doctors, hbcu professors. Errrrrrbody lol it's so shocking to me to see folks saying that on the internet.",
    "title": "Nigga is an empowering word. No white people can't police our use of it. And yes they still can't say it. When did these takes become controversial?",
    "subreddit": "blackladies",
    "timestamp": 1684522731,
    "score": 45,
    "keyword": "black principal"
  },
  {
    "text": "Lean Wit It, Rock Wit It I absolutely love the song Lean Wit It, Rock Wit It, and sing it often in 2023 🤣. Last night, I was thinking what the opposite of the word lean was and my mind could only say \"rock\" so I made a cute little black joy mini skit for a second-grade classroom. Enjoy! \n\n&#x200B;\n\nThe camera pans in on a class of 2nd graders. The teacher is a black woman with an afro pulled into a puff. She stands at the front of the room.\n\nTeacher: “Okay class, what’s the opposite of yes?”\n\nStudents, in unison: “No”\n\nTeacher: “What’s the opposite of dog?”\n\nStudents, in unison: “Cat”\n\nTeacher: “What’s the opposite of go?”  \n\n\nStudents, in unison:  “Stop”\n\nTeacher: “Alright now, last one, what’s the opposite of lean?” (1 second sound from the start of lean with it rock with it plays ominously as she says lean)\n\nStudents pause, making I don’t know sounds and gestures *except for one girl who can be seen throwing nothing into the air in slow motion*, the camera zooms in on her as a smile crosses her face as she catches it and yells **“Rock”** while rocking the rockiest rock that anyone ever did rock, elbows SHARP!\n\nFull song comes on and after 2 lean/rocks everyone catches on and starts leaning and rocking\n\nAfter 2 more leans/rocks, the principal enters the room and everyone pauses. \n\nGirl who screamed Rock: \"Hey Mr. Howard, catch!\" and throws him that mysterious nothing\n\nMr. Howard looks stern but his gaze is following her throw and students gasp. He misses the catch and looks like he's about to turn around to leave. Suddenly he scoops down and picks it up and does the second meanest rock this world has seen after the first one. The music turns back on. \n\nStudents form a line and start dancing down it. After three 2nd graders slide down the line, the scene suddenly cuts to the entire school in a line, leaning/rocking zooming in to catch students in all grades and staff at all levels smiling, leaning, rocking coming down the line. At the end, DEM franchise boyz come down the line leaning/rocking and the students all run away screaming \"Who is that?\" because of the generational divide. \n\nThe End.",
    "title": "Lean Wit It, Rock Wit It",
    "subreddit": "blackladies",
    "timestamp": 1685274608,
    "score": 16,
    "keyword": "black principal"
  },
  {
    "text": "Feeling isolated and exhausted at teaching job where black teachers are the minority I’m currently working at a predominantly white staff school. I’d safe about 7 teachers out of 70 are people of color. The demographic of students is almost evenly spilt between blacks,whites, and Latino students. \n\nI returned to this school after I had a rough experience in a metropolitan area school district . I’m in Georgia btw. I did this because I thought my principal was reasonable and nice ( he was the previous assistant principal when I left the first time and was super kind).  Now I’m regretting coming back . I genuinely think my principal is trying but it’s getting to  me.\n\nOne day last week, one of my students broke down crying telling me that a white boy asked if could call him a n*gger and if his daddy was a slave ? “ I was livid . I told him I heard and felt him but do not ever make them make you feel bad about being black.\n\nI brought this incident up to the assistant principal and he said he “understood”. Never followed up with me. So I went to the principal about this and he told that he had the kid on his “radar” and that the kid was having a “rough time”. I was perplexed at why he was telling me this. He added that the kid could be valedictorian if he wanted to but was just not in a good situation now. But then my principal would jumped back to the fact that he wasn’t condoning his behavior and gave me a long story about how he grew up with black friends and because he was darker skin he was mistaken as Hispanic. \n\nI got more irritated as he continued and essentially let him finish off his point. What causes more pain is that I’m currently in school learning about critical race theory and just how awful American history is in regards to treating Blacks. I need health insurance and a salary but im fearful that if I move districts I’ll have another issue. I just want a space where I feel heard. I’m not sure how to proceed.",
    "title": "Feeling isolated and exhausted at teaching job where black teachers are the minority",
    "subreddit": "blackladies",
    "timestamp": 1674524140,
    "score": 13,
    "keyword": "black principal"
  },
  {
    "text": "Advice needed. How to move forward with some making bad choices especially making racist comments Advice needed on how to move forward with son making bad choices especially making racist comments.\n\nTrigger warning: racist comments \n\nI am a Black and Native American woman married to a Native American man who adopted two Native American children. We are a blended family, I had three children, my husband had four and we have the two together. My son is 13 years old and has been acting out a lot lately. He has been drinking and smoking weed. A couple weeks ago we found a weed cartridge and a nicotine vape in his backpack. I warned him if it happened again I would homeschool him. Well, a week later we found alcohol in his room so I checked his backpack again and there was a weed pen in it. He has excuses for everything but I don’t believe any of them. I pulled him out of school last week. He also stole $200 from my husband’s wallet. We got $120 of it back. \n I talked with his counselor and set up an appointment and drug and alcohol evaluation for Friday. We went and she didn’t think he had a problem she suggested I let him go back to school so against better judgement I let him go back on Monday. I wasn’t sure if I was overreacting because I am scared especially of the drinking because my son has type 1 diabetes and it could easily kill him. So Wednesday his principal calls me and says my son was in a bathroom where they were vaping. They checked his bag and he had stuff so my husband picked him up and he will be homeschooled now. \n\nI went through his phone. The only reason he has a phone is because he needs it for his continuous glucose monitor. It sends his levels to my phone so I can tell him how much insulin to take. I thought it was locked down but it was not. I read his message and he has been making racist comments to a Black girl. She makes them too but they are always about Black people. They think it’s funny.\n Some of the comments he made:\n“ I have 16 slaves picking cotton for me and 5 house slaves cooking that good fried chicken and good koolaid\nHe sent a pic of some enslaved people and said those or mine. Straight thugs from the trenches of Africa \nThen he sent another pic with more enslaved people and said that’s us now. I paid extra for the kidnappers to get a whole village for me. \nHe called her a thug, monkey, slave, blacky, cotto picker, koolaid drinker, chicken bone sucker, and a watermelon eater. \nShe would write back that she had slaves too and call him monkey, slave, and the same. \n\nI am so disgustedwith him. i am hurt and pissed beyond words. I feel betrayed. I found this today and called him a racist. I asked him if he thought that was funny. I said “say that shit to me. You can say that to a little girl so say it me. I want to laugh too.” He just kept crying, and crying and crying. I am so mad. I was in the room when this boy was born. I cut the cord.  I spent the night in the  room with him and took him home. Ever since he has been diagnosed with type 1 I stay up at night to watch his levels. To give him insulin if he’s high or have him eat if he’s low. He knows all the racist things me and my biological kids have had to deal with and he still does this. We watched the 1619 project as a family. Every day I wear some type of black pride clothing. I don’t know how to get past this. It’s so raw right now but I can’t see a way out. I can forgive him for all the other stuff but I have such hatred for racists. Please give me some advice. I don’t know what to do. \nMy husband doesn’t get it. He said “he’s young and dumb. He didn’t mean it.” He asked me how I’m gonna deal with this. I said I don’t know. I have no idea. I said you don’t understand.  \n\nMy son has been in counseling for a couple years. We were able to meet with her today and but it was minutes after I found the racist posts so I was crying and yelling. Telling her all that he said. My husband and daughter (14) were also there. They were both crying too. My husband because he saw how broken I was. My son was crying and wouldn’t talk at all. He had his head down and was just bawling.",
    "title": "Advice needed. How to move forward with some making bad choices especially making racist comments",
    "subreddit": "blackladies",
    "timestamp": 1702020705,
    "score": 9,
    "keyword": "black principal"
  },
  {
    "text": "Richard Bilkszto, Kike Ojo-Thompson, pluralism, solipsism, and a culture clash that led to a man's suicide **Warning: Very long post. Extensive discussion about suicide and mental health follows.**\n\n\nFor this essay I am drawing from two sources:\n\n[The National Post: Toronto principal bullied over false charge of racism dies from suicide](https://nationalpost.com/opinion/jamie-sarkonak-toronto-principal-bullied-over-false-charge-of-racism-dies-from-suicide)\n\n[The Star: A Toronto principal’s suicide was wrongly linked to anti-racism training. Here’s what was really said](https://archive.is/RWzEE#selection-5255.212-5255.229)\n\nMany of my arguments below are also inspired by John Ralston Saul's book about Canada, \"A Fair Country.\"\n\n---------\n\nA man in Toronto, Richard Bilkszto, committed suicide on July 13th, 2023, after a mental health crisis set off by events at a diversity, equity and inclusion training session in 2021. He was a school principal who had a long career working in adult education and special ed. The National Post describes him as \"frequently recognized and greeted warmly within the halls of his school.\" He was 60 years old.\n\nI'm writing this because his story and experiences are so similar to my own. These two articles give very different accounts of an interaction that happened over the course of two staff training sessions. The truth, of course, is surely somewhere between the two accounts. There is no such thing as unbiased media sources in the present day, so the best we can do is to compare:\n\nPer The National Post:\n\n*His stellar career took on a sour note after he was bullied in a diversity, equity and inclusion training session for Toronto District School Board (TDSB) administrators in 2021, according to a lawsuit Bilkszto filed in court. His sin, in the eyes of facilitators at the KOJO Institute, was his questioning of their claim that Canada was a more racist place than the United States. Canada wasn’t perfect, he said, but it still offers a lot of good. For the rest of the training session, and throughout a follow-up training session the week after, facilitators repeatedly referred to Bilkszto’s comments as examples of white supremacy. The experience was humiliating — particularly because Bilkszto placed a great emphasis on equality and anti-discrimination during his career.*\n\nPer The Star:\n\n*At issue, based on news reports, were two statements. One, Ojo-Thompson challenging a beloved Canadian myth by stating “Canada is more racist than the United States” and, two, “reacting with vitriol” when the former principal objected as well as “humiliating” him by calling him a “white supremacist” and a “resistor.”\nThe Star obtained a copy of the recording of the two sessions in question from a source who was present at the meetings. Based on it:\nOjo-Thompson never said: “Canada is more racist than the United States.”\nShe never called Bilkszto a “white supremacist and resistor.”\nThe recordings reveal for the first time a fuller picture of the conversation and disagreement that has been cherry-picked, shorn off context and nuance, and presented by those with an agenda to villainize diversity initiatives.*\n\n--------\n\nIn this context, I'd like to say a few things about Canada. I am interested in **equality**, **diversity**, and especially I'd like to speak about **pluralism**. I have been writing about these things lately, from my perspective and my experiences as a white man whom all his grandparents were born here in Canada. I was born in 1989. Canada at its best is a beautifully diverse and loving, welcoming society. At its worst, of course, its history and its present are in so many ways so abhorrent. \n\nI had the good fortune to grow up in a healthy left-wing Church community, where I learned important and deeply Canadian things about how to interact as a group of people. Canadian culture is about sitting in a circle. Things took a turn for the worse, though, and I had a falling out with the Church in a way that has caused me a lot of psychic distress over the years. I recognize what happened to Richard Bilkszto and *people need to understand*. This is clearly a story of two cultures failing to communicate, this is obviously a culture clash, that had tragic consequences.\n\n--------\n\nIt is not recognized widely, but truly Canadian culture has deep roots in the traditions of the Indigenous people who were here when the Europeans first made contact. This is where we get our strange Canadian ability to all function together in such a diverse, multicultural society. We have always been a society of immigrants - around 85% of new arrivals here become citizens, compared to about 40% in the States. Canada also has one of the highest rates of interracial marriage in the world.\n\nCanada also had both the French and the English settling at the same time, so in a way Canada was never a nation-state, it was always a story of different groups of people negotiating their way through the climate. This history was covered over in the late 19th Century with Confederation and a new wave of British colonial influence. We do things so weirdly compared to other places, but we do not know our own history - today we only know the bad parts.\n\nIt is broadly recognized now how the past centuries have led to the present shocking inequality and ongoing injustice for Indigenous peoples. What is overlooked is how over these centuries there were (and continue to be, in many places) also so many positive exchanges and rich cultural development between the settlers and the Native people, an interaction that played out very differently here than in the United States, who have their own history. For a further discussion of this see the book by John Ralston Saul, *A Fair Country*.\n\n-------\n\nI believe that a fundamental Canadian value is that of Pluralism. There is more than one voice. There is more than one valid opinion. There can even be multiple perspectives that seemingly contradict each-other. There are lots of us here, and we're all different. We need to figure out how to all get along. There are so many angles, many different people with different lives, and each of us can contribute by bringing our perspective into the conversation. Pluralism is something that is deeply connected with Equality, in its real sense.\n\nThe historical context here is very different, and Canada cannot be understood simply through comparisons to our southern neighbours. As I like to joke, Canada is not America's hat! The black people in Canada whose families have been here the longest are mostly the descendants of escaped slaves. I can't speak for them, just the history and the context is *very different* and needs to be recognized as such when speaking about the culture and social justice here. Canada, in this obviously idealized image of the country, has a lot to offer to the world.\n\nThe National Post:\n*Michael Teper, a representative of SOS TDSB, described Bilkszto’s philosophy as a classical liberal approach — he believed in providing equal opportunities to all, and offering outreach to underserved communities. He opposed the use of “artificial means to produce an equal outcome” and the use of racial stereotyping in hiring and school admissions. Bilkszto previously appeared on TVO to explain the debate as it was unfolding in Toronto schools.*\n\nI believe that *this* could be what Bilkszto was trying to speak up for, if he highlighted Canadian health care and funding for social programs. It's very difficult to have your life and values be rooted in this Canadian experience because it is not something that is well-represented at all, and we so often get lumped in with our neighbours to the South and painted over with the same brush - a brush that isn't really adequate for their culture either. \n\n--------\n\n**Solipsism and the threat of Authoritarianism**\n\nThe opposite of Pluralism is Solipsism. The Pluralist understands that they are one of many, while a solipsistic viewpoint sees itself as the only valid frame of reference. For a solipsist, everything orbits around them, and they are the ones who are here to direct and teach the rest of us and show the way forward. Solipsism comes with Dogma, Theology, entrenched viewpoints - we've reached a point where feminism in the 21st century needs to be discussed in the context of religious doctrine.\n\nThe person who showed me the article from the Star described the situation as being between people who are progressive and people who are still learning. This makes it sound as if any objection must come from a point of ignorance. It is autocratic, and at its very worse this is a looming threat of Authoritarianism. There are many frames, and all of us can learn from the others, and if we believe truly in equality in this century, this is what needs to happen. Of course, inequality still exists - there is disagreement here on the means, not the ends.\n\n-------\n\nThe Star:\n*In response, Ojo-Thompson leans on her personal experience as a Black woman to say: “I felt more normalized as a Black woman there than I do here. We’re invisibilized from the cultural fabric of this nation. Canada has never reckoned with its anti-Black history,” and, “I lived in the South. And I’m saying this factually without any hiccup. The racism we experience is far worse here than there.”*\n\nShe did not grow up here. She's *welcome* here. Of course this does not invalidate her as a person, or her perspective, it's not a bad thing that she is from elsewhere, just she is bringing her context as a person who grew up in a very different society. She is bringing to the table a comparison between her experiences in the US and Canada, and she is surely completely right that in many ways her time in the South was preferable. That is not at all what I am objecting to here. \n\nShe is only one person. She is one of the voices in the room. I object to the shape of the relationship that she makes with the participants of her workshop, putting herself in the position of authority, like a preacher - and taking full control of the conversation in the room. She clearly knows who her enemies are. A leader should be a facilitator and should create space for something beyond us to form between us. \n\n-------\n\nThe Star:\n*At a subsequent meeting the next week, Ojo-Thompson began by revisiting the concept of resistance that she mentioned even before the interaction with Bilkszto and how resistance upholds white supremacy. “I want to open by going back to the concept of resistance,” which “is going to be the most transformational, because we don’t talk enough about the many, many responses to the work, what they look like.”*\n\n*Soon after she says, “One of the ways that white supremacy is upheld, protected, reproduced, upkept, defended is through resistance.”*\n\n*Then she references the interaction with Bilkszto from the previous week, saying, “who would have thought my luck would show up so well last week that we got perfect evidence of a wonderful example of resistance that you all got to bear witness to. So we’re going to talk about it, because it doesn’t get better than this.”*\n\n*She's quoted as saying: “So we’re here to talk about anti-Black racism, but you in your whiteness think that you can tell me what’s really going on for Black people? Like, is that what you’re doing? Because I think that’s what you’re doing, but I’m not sure. So I’m going to leave you space to tell me what you’re doing right now.”*\n\nLet me be snarky for a moment here: What does she know about making space, really? Does she honestly believe that her behaviour here is making space? He was chastised for the way he attempted to interact. The ability to make space is sacred, and she is being sarcastic to him about it.\n\n**He tried to present himself as an equal to her**, and she repeatedly cast him in a negative light for that. She was the one in the position of authority. And she took it on and started using him as a negative example. \n\nThe Star criticizes him for not asking the right type of questions - not looking up to her from a submissive role, for him not being a diligent pupil:\n*That’s not a help-me-understand question typically posed by workshop participants to trainers. That’s a man saying to a woman, an expert on anti-racism, at the end of a session that is replete with history, data, experience and nuance, that she’s flat-out wrong.*\n\nThis is egregious. He did not say that she was outright wrong, he said that Canada had good things too. Ojo-Thompson is out of line. What is being described here is not Equality, it is one person casting herself as the Authority, the Leader and the Teacher. Furthermore, to claim authority by having science and data on your side is another hallmark of an over-regimented solipsist, who wants control over what is and isn't valid. She needs to learn to be one of many, so that we can all move forward. And, of course this is not to say that inequalities do not exist. Such an objection to the argument I am giving here would be in poor faith. \n\nThe beautiful thing about being Canadian is that I do not need to negate my culture, in order to welcome yours. My culture is not here to be overthrown, it's a beautiful, living, healthy thing. Cultural growth happens best through mutual understanding and exchange - the path forward is revealed in front of us merely if we'll have the conversations. There is still so much work to do, but it has to happen truly as equals.\n\nThis kind of interaction happens all over the world these days, not only in the Canadian context, but it is important to understand how deep of a cultural attack it was on Bilkszto to associate him with white hegemony and to call his words \"resistance.\"\n\n---------\n\nThis man's suicide is consistent with my own experiences being male in our society, and it is spoken about in similar terms in many places where men speak about these things. This is not an isolated case. This is a common pattern in men's experience today: wanting to contribute, not knowing how, trying something, then getting a hostile reaction. He was a special ed teacher, adult education, etc. - was this man autistic? He was surely walking to the beat of a different drum. We'll never know.\n\nWhat I do see though, is that he was trying to make a positive contribution to the community. He was living a generous life, and likely had his own idiosyncratic views of things. This workshop probably brought up a bunch of feelings buried deep inside. That's the male experience today. Self-censorship, self-doubt, and feelings of guilt associated with having your own views, which in turn leads to feelings of alienation, and then it just gets worse and worse and spirals out of control when you try to find help.\n\nIn the article in the Star, they highlight how he didn't speak up until the last 10 minutes of the session. Kind of with a tone that's blaming him for that. You know what I think was happening? I think until then, he was too afraid to speak.\n\nThe article in The Star calls this man's suicide an \"isolated incident.\" I find that shocking.",
    "title": "Richard Bilkszto, Kike Ojo-Thompson, pluralism, solipsism, and a culture clash that led to a man's suicide",
    "subreddit": "MensRights",
    "timestamp": 1690773568,
    "score": 10,
    "keyword": "black principal"
  },
  {
    "text": "My thoughts on Female-only wagons Some countries like India, Japan, and Brazil have wagons exclusive for women. That means only women are legally allowed to enter. If you're a man and enter a Female-only wagon, you're charged for a crime and receive punishments. The countries have different punishments, and a video shows a man in India being slapped all the way out and forced to do squats in public with the hands on his ears by an apparent female cop. https://youtu.be/ggWy50I9et8\n(I couldn't find the neat video, so this link is a report on it. This report had even the guts to defend the law and authorities who did this. Not even if you're caught stealing it's considered right to do this. He received that punishment for being a man). In India, there are not only entire trains dedicated to women, but they also have bus seats reserved to them, among many other things, not to mention the \"women-only\" facilities. I was surprised to see that a bunch of MRAs agreed or sympathized with these laws. So I've decided many years later to make this post telling my thoughts about it. One of the reasons they (MRAs) defended those laws was due to Japan's and India's massive number of passengers, making it nearly impossible to identify abuse. However, we have to understand that there aren't wagons reserved for men like male and female restrooms. Those facilities are reserved for women, and we don't have a similar thing for men. That is, women have the option to opt for the cars, trains, seats, and facilities that are available for everyone or the ones available only for women, while men don't have a similar option. This is practically a manifestation of the thought that women are pure, innocent, and/or victims. This contradiction (the lack of choice for men and women being free to choose) is important for us to comprehend the nature of the discussion, rather than thinking we're being \"equaly\" split (like men and women are commonly match with same-sex roommates, cellmate, etc. or the existente of male and female restrooms, in this case, the discussion takes other parameters. And I'm not saying that it's \"equal\", since women inmates receive better treatment in prison than men does and female restrooms are sometimes better built or has better care than male ones do.) That's why I believe those are just one more female privilege.\nhttps://at.tumblr.com/batatafrita1936/710237251503800320/53jq9jlh9awb\n\nSo, as feminists obviously turn every issue that majorly affects men into a consequence of social cheuverism, sexism against women or other terms, that case would be no different even as you're surprised for common sense saying it's completely absurd. Feminists groups basically split into two positions; those who advocate for female-only wagon as it'd be a need since men represents a danger to women in the train; and the other feminist group that don't accept Female-only wagon as they define it as \"women segregation\".\nIf you're asking yourself how feminists still think it's segregating women by giving them a place only they can access and prevent men from entering it, \"feminism\" is the only answer I can possibly give you.\nIf you have to teach a young boy, \"That train, you're not allowed to go there.\"But why, Daddy?\" \"Only women are allowed in there\" I don't think that's exactly \"segregating women\" as they (women) can legally go anywhere men are (except those who have a similar place for them, where men also cannot go like separated male and female restrooms) and are socially accepted to do so. But that's just an inequality society pretends not to see and they would label it childish if you complain that as a teenager (greetings from a teenager boy who just turned 18 and is forced into the military).\nAnd for the other group of feminists who points out (sometimes biased) numbers of women being abused on the train, or posting on tweeter news that they found a man spying under women's skirt using a camera, I have an answer that will even churn up many MRAs. Yes, I'm very sorry for this, but sometimes, reason has to overcome feelings. My answer to this group would be \"f*** them, it's their problem.\" Honestly, if you're angry about that, congratulations, you just committed a double-standard. If you think a male abusing woman or a male spying women's underwear are a reason to prevent men from entering a place, why don't you prevent black people from entering places as they're the majority of the accused and the majority of inmates in several places of the world? Black people are obviously victims of the social system. That's why they're often targeted as offenders (for instance, everyone knows police tend to target black people more). Men, however, have different views towards them. The reason for that is that we don't simply let aside all moral and ethical principles when it comes to black people. For men, however, society doesn't care about moral principal since they're not considered human to begin with. In some places of the world, a woman is arrested for sexually abusing a dog but can legally rape a man without committing any crime. If a black, asian, christian, or muslim person pulls a gun in the supermarket, it'll never be a reason to prevent that religion or race from entering that place or beginning the new apartheid. I come to the conclusion that every argument feminist or female only facilities advocates make is simply justifying the unjustifiable. And that women only facilities should not exist regardless of the conditions as it's against all equalities principles and moral principles (which are useless when the ones damaged are males) and nothing can justify such vileness.\nPlease share your thoughts or any other additional information you have.",
    "title": "My thoughts on Female-only wagons",
    "subreddit": "MensRights",
    "timestamp": 1677349689,
    "score": 5,
    "keyword": "black principal"
  }
]