[
  {
    "text": "How to find the right job as a black woman? Hi everyone, \n\nMy wife has been very stressed out and feels lost to what she needs to do next. For the past 2 years she has been in and out of jobs. \n\nMost recently, she was working for a non profit helping mothers. You would think this place would not have the discrimination, infighting, and drama that other workplaces have but it does. And its not just drama, it has affected her job and she is now on a PIP plan because the people who were supposed to be training her did nothing and now the supervisor has her hands tied, but she also hasn't been helpful.\n \nThe organization seems to have laid a lot of people off when the new CEO took over a few years ago and honestly a lot of people with less color are in charge and in place of those ousted. \nThis comes at a time when we finally feel more stable but it seems like they are trying to push her out the door and they definitely sabotaged her. \n\nShe has copywriting, marketing, customer service, event planning, tutoring etc. experience with a degree in psychology and worked in a clinic for a bit. She has also expressed being self employed but we are not sure what she could do. She has tried a few things and they haven't panned out. \n\nWe have been trying for a long time now to research different businesses and careers but she is feeling disheartened. Please give any advice and ill try to get to all the comments. Thank you\n\nWe are also considering moving away from Florida where we currently live. If you have any suggestions to where there would be more opportunities for a black woman with her qualifications please let me know.",
    "title": "How to find the right job as a black woman?",
    "subreddit": "jobs",
    "timestamp": 1698255211,
    "score": 4,
    "keyword": "black ceo"
  },
  {
    "text": "Should I work for a racist boss? TLDR: My old boss was toxic and racist but wants me to work part time as a contractor. \n\nBackground: I recently quit working for a very toxic company and boss as a project manager for a short time. I enjoyed the projects themselves because I’ve been doing this type of work/projects for several years. My life dream is to eventually be self employed in this type of work and I’ve worked for and with several other good companies and bosses I’m the past. The most recent though, was a very toxic environment. My direct manager was manipulative, and a micro manager. They would often lie or spread false rumors about other employees to create their own narrative and make themselves look good. They were a workaholic themselves and literally spent 24/7 on call to the CEO, and expected the same of me (and all other employees) even though they were being paid a huge amount to be on call (like $400k+) while the rest of us were being paid a normal amount ($50k-$60k). I’ve been working a long time and I’ve had my share of dealing with difficult managers, but this was a new level. The stress was manifesting in my life physically and even though the issues came up early in the job, I couldn’t afford to leave for at least a year. I managed to buck up and have several tough conversations with my manager about my own expectations and boundaries, and for the rest of my time there was able to keep them from trying to control my entire life and keep it professional. They did manage to make my coworkers lives hell, because they were not experienced/brave enough to have the same tough conversations. I tried  advocating for them but it would only go so far when they were not able to stick to their own boundaries. My manager still respected my high quality work and promoted me a couple times to take on higher responsibilities. Towards the end, they asked me to be involved in hiring process to replace one of my lower rolls. I was the 2nd round interviewer after the standard initial HR 1st round, and my manager would be the final interviewer. I interviewed no less than 10 people, all of whom were well qualified and a couple were even over qualified. There were 5 candidates I passed along to my manager who I thought would be the best for the job for several factors (flexible schedule being the main one). 4 of the candidates were black women and 1 was a Hispanic woman. I provided in depth notes on their strengths and offered to help set up the final interviews. Immediately without looking at my notes, my manager asked me to find and send their linked in and social media accounts. I assumed they wanted to check for anything dangerous or inappropriate, since it was a client facing role. So I sent the profiles I could find. Most had linked in and a few had Instagram. I’m sure they had others but from what I saw, all of them had updated and professional looking profiles. The Instagram photos were normal. Within a day, my manager let me know they wanted me to keep interviewing and asked about one of the other candidates who did not make my top 5. (A young white woman, very conventionally attractive and skinny). I let them know she had the least amount of experience and would not be able to stay late ever, which was a requirement. I had to do several more interviews only to eventually have my manager tell me “not to be racist, but they just don’t work hard and always start issues”. I was so in shock I was speechless. I didn’t ask for clarification about “they” but it was a buoys after I questioned why all 8 candidates I had sent were black or Hispanic or even just older. I realized they wanted a young thin white woman. We eventually hired the attractive one who had the least experience and ended up giving my manager some headache because she needed a lot of training and was constantly calling out “sick”. I began job hunting almost immediately and left a few months later. \n\nFast forward to today, I have a new job where I’m doing well and with a healthy working environment. My old boss reached out to ask if I would help on a contract basis with their largest project they have every year. I could charge my higher rate and only work a few hours a week until the project is finished at the end of the year. And it would add to my portfolio. I wouldn’t have to deal with the usual stress since I would be a contractor, not an employee. I just can’t get past the fact they are inherently racist. I feel like I would be selling my soul.",
    "title": "Should I work for a racist boss?",
    "subreddit": "jobs",
    "timestamp": 1694456513,
    "score": 1,
    "keyword": "black ceo"
  },
  {
    "text": "mental health issues? I work at a large, woke nonprofit.  CEO is black.  We recently hired a black section manager.  Since week 1, he's been disruptive and haranguing his upline and downline.  No one wants to work with him.  His dept head has been stopped by the CEO from writing him up.\n\nWhy would anyone new behave like this?  Hes not friend with CEO. Just same race.  My conclusion is he's not well mentally.  And because it's a woke organization, he's been getting away with very bad behavior.",
    "title": "mental health issues?",
    "subreddit": "jobs",
    "timestamp": 1673594818,
    "score": 0,
    "keyword": "black ceo"
  },
  {
    "text": "Do Quiet-Quitting as much as possible I want to share my wisdom as guy thats been working actively for the last 7 years. cooshy IT job, even working from home etc. 95% of bosses and managers are complete assholes. they dont care about your ideas or talent. they are more obsessed with making you over-work and suffer than you making the company millions. the dumbest people i have seen. do anything possible to take it easy, practice quiet quitting, abuse welfare as much as possible, value your work, sabotage your workplace to be unable to function without you. in short....declare a SILENT WAR on your employer and be 10 steps ahead in fucking them. they are NOT your friends.\n\nyou have no idea how much i hate them. i run a little podcast, im supposed to be an \"alt-right racist\" but i focus 100% on speaking against corporations, bankers and politicians. Keep in mind something like cheese is 3 times cheaper and REAL compared to what they sell you in walmart. when i see black people stealing from walmart i cheer for them. when all jobs expect you to work for 15$/h and everyone is looking to abuse you....the only winning move is to go OUTSIDE the game...and make them starve and beg.\n\njust last week we heard some investment asshole speak how we workers need to be crushed and reminded that the employer is king and we dont make the rules.\n\nive been practicing various ways to combat corporation and government greed, and urging people to try it too - piracy, growing vegetables at home, canning/preserving, buying in bulk, now im even looking to make my own cheese at home.\n\n9 out of 10 popular bulgarian \"sheep cheese\" brands were caught putting 50% cow milk in the mix (when they are not using palm oil). 9 out of 10. that means EVERYONE is scamming you. EVERYONE.\n\nremember from me - always do anything possible to fuck with the \"ceo\" class and corporations. become so self sufficient that they will have NO POWER over you. abuse welfare and lie on your CV as much as possible.",
    "title": "Do Quiet-Quitting as much as possible",
    "subreddit": "jobs",
    "timestamp": 1695585967,
    "score": 0,
    "keyword": "black ceo"
  },
  {
    "text": "Feelings about Pava Lapere: How do we live like this? I'm sorry guys, this is a lot and its gonna be brutal. I tried not to be too graphic out of respect for her and her family.\n\nIf you haven't heard (which I hadn't until this morning, through TikTok of all places), [a young tech CEO, Pava LaPere, was raped and murdered  in her apartment last Friday night.](https://www.nbcnews.com/news/us-news/baltimore-tech-ceo-pava-lapere-was-found-apartment-rooftop-died-strang-rcna117928)\n\nI haven't been able to stop thinking about it all day. How do we live? How do we exist like this? How do we not just combust from all the injustice and abuse and rage that we're forced to carry? How do we not collapse, like a black hole? Its like I open my mouth to scream and nothing comes out, and I wonder how all these things can exist within the human body, held in by skin like a plastic bag filled with water, about to burst apart at the seams.\n\nHe pretended to be locked out of the building, and she was  in the lobby so she let him in. She was being nice. She probably heard the warnings in her head, and thought, \"Don't be ridiculous, he's locked himself out in the cold. What am I gonna do, sit here and ignore him?\"\n\nI think about what it was like, the actual occurrence. Because when you hear somebody was murdered, you can't really conceive of it, can you? You just hope they didn't suffer and are sorry they're gone. But when someone is raped? I can't help think about it. Do you think men think about it? Do you think they can even conceive of what its like?\n\nAnd whats worse is that the cops knew, and they did nothing. He was a repeat offender. He'd been  sentenced to 30 years for rape and assault, but they let him out after 7. After 7 fucking years on a 30 year sentence, and they let him out. Imagine being the victim, hearing that news... He was charged with assault in 2009, then again in 2011. He'd been arrested for beating his girlfriend. And they let him out.\n\nHe did it just a few days prior, too. He tied up a woman and her boyfriend, and beat and raped her while he was forced to watch. He slit her throat, and then he set them both ON FIRE. He set them on fucking fire.\n\nAnd the cops knew. I am so furious because the cops knew. He was a repeat offender, he'd been arrested multiple times, he had an active warrant out, and apparently he was \"under surveillance\". WELL EVIDENTLY NOT BECAUSE THEN THIS WOULDN'T HAVE HAPPENED.\n\n**HOW DO WE LIVE LIKE THIS???**\n\nHalsey gave a speech once where she read a poem, and she talked about how she felt like her fame and success had bought her safety. Like once you reach a certain level in life, these things don't happen to you anymore. And maybe thats true, for men. But there's nowhere where we're safe. She screamed, \"What the hell do you mean this happened to ***me***?!\" And I feel that in my gut, in the place we put all the things so we can wake up in the morning and not fall to the floor with the horror of it. Pava was a graduate of Johns Hopkins, she was a doctor and a CEO. She made Forbes 30 under 30 list just this year. She was fierce and strong and successful, and none of it protected her. Which means none of it is going to protect me. Or you. Or any of us.\n\nHow do we live like this?",
    "title": "Feelings about Pava Lapere: How do we live like this?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1696004023,
    "score": 89,
    "keyword": "black ceo"
  },
  {
    "text": "Unpopular Opinion: I don’t find ‘girlboss’, ‘female founder’ or ‘women CEO’ as offensive. So I just came across a tweet sarcastically saying that we should start using ‘male founder’ and ‘male CEO’ since we’ve constantly been called ‘female founder/xyz’.\n\nI don’t think there’s something highly problematic with using the phrase Female X. If anything, it highlights how the path taken by a woman to achieve the same position was much more different/possibly difficult. Isn’t it empowering in a way? As in you did not just become a CEO but also did so while being a woman and facing the issues that women face growing up. You say a female founder is a founder. But we’re not just a typical founder, are we? We fought against a patriarchal system to emerge in a male-led industry. Shouldn’t we be highlighting that? \n\nI especially love to support a female owned business because it makes me proud as a woman. \n\nSomeone also mentioned under the tweet that we should also probably start lessons like “How to get taken seriously as a male founder” or “how to get funding as a male founder”. This doesn’t make sense. Articles about helping women establish themselves in the work environment are needed because these are in fact real problems that women actually face in their work due to historical inequalities. \n\nWouldn’t this same logic apply to something like people saying “all lives matter” when asked about BLM. Like yes Jason, all lives matter but black people are a historically disadvantaged group and thus highlighting that aspect is important.\n\nI’m posting this here to start a conversation. I’m open to gaining new perspective and changing my view. Please be kind.",
    "title": "Unpopular Opinion: I don’t find ‘girlboss’, ‘female founder’ or ‘women CEO’ as offensive.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1675541186,
    "score": 0,
    "keyword": "black ceo"
  },
  {
    "text": "\"common excuses for centering men in fandom and why they don’t work\" (from, Helenisadoorable, a Magnus Archives Blog). Blog post discusses the issues in female protagonist shows and stories, and why it is harmful for people to put obsessive focus on male side characters. Anyway, please watch Barbie. **disclaimer**: i am not trying to start a fight, or call out anyone personally. the goal is to encourage critical thinking and self-examination. also, this is a tma blog so a couple things will be tma-specific, but the general principles apply to all fandom.\n\n**definitions:** “centering men” is a concept i learned from black lesbians, and it means “to prioritize men, to pay more attention to them, to make discussions about them, essentially to place/keep them at the center of whatever is happening.” centering men =/= liking or being attracted to them, because you can do both those things without centering them.\n\n**why we all center men at first:** in a patriarchal society, we are all conditioned to center men at all times. a lot of us don’t even realize we’re doing it. men comprise most ceos, politicians, legendary heroes, main characters, folks taking up space in discussions, etc. so a lot of us don’t even question men’s right to be at the center of fandom matters too. that’s perfectly normal, but it is all of our responsibility to question it and do something about it.\n\n**what to do about that:** very few people center men on purpose, because it is the default for all of us, but *unlearning* that patriarchal conditioning has to be on purpose. that is a choice you need to make if you want the world to be more equitable for women and other non-men, and i cannot make that choice for you, but i strongly encourage you to make it and continue making it every single day.\n\n**what centering men looks like in a fandom context:** prioritizing making art of male characters. prioritizing writing meta about male characters. prioritizing writing fic about m/m ships. mostly reading/seeking out/sharing fan content about male characters. having lots of complex, in-depth meta and headcanons about male characters, but flattening the female characters to “badass” or “soft cinnamon roll” or “evil.” condemning evil or morally grey female characters for the bad stuff they do, and then turning around and stanning male characters who are equally evil or morally grey. inventing detailed personalities and storylines for background male characters, while ignoring main female characters who already have detailed personalities and storylines.\n\n**common excuses for centering men in a fandom context:**\n\n* *“female characters(/wlw ships) just aren’t that compelling or well-written”* this excuse may work in some fandoms, but in tma and other pieces of media with complex, well-written female characters, this doesn’t work. the female characters are compelling, the wlw ships have depth, and the only reason that *you* don’t find them interesting is because you have a subconscious bias towards men. i’m not saying you have to like every character or ship, but if you categorically ignore all the women, there is a problem and it is *not* with the media.\n* *“i am a gay/trans man so i relate to male characters more”* cool, good for you. but just because you relate to men more, doesn’t mean that women don’t exist or are unworthy of attention. make an effort. you are still a man, and thus still capable of perpetuating misogyny. you’re allowed to relate to the men more, but it is your responsibility to unlearn patriarchal tendencies and make fandom a welcoming space for women & female characters.\n* *“i just like/relate to male characters more”* hmm, and why is that? no really, why do you think it is? could it have anything to do with the patriarchy that tells us in a million ways *every day* that men are better, worthier, more interesting than women? your preferences don’t come from nowhere. examine them, unlearn them. \n\n**how to unlearn patriarchal conditioning and start de-centering men in fandom:** seek out media with complex women in it. pay attention to them, their backstories, their motivations, their opinions. create & seek out fan content about them, whether that be fic, art, meta, jokes, whatever. pay attention to your reactions (i.e. if a scene is primarily about a female character, ask yourself, “why am i focusing more on how a male character is reacting?”) and then shift your focus accordingly. it will be difficult, it will be uncomfortable, it will be hard work. but *don’t* take that as an excuse to be like “oh well i just wasn’t meant to enjoy female characters in fandom” and go back into your men-centric comfort zone. no. the discomfort means you’re going against the flow of the patriarchy, *which is a good thing.* the more effort you make to center women in fandom, the easier it will get, and you’ll be so glad you did.\n\n**conclusion:** no one is telling you you can’t like male characters (and if that’s your main takeaway from this post, you need to learn better reading comprehension). what we *are* telling you is that you need to examine your internal biases and stop making men the be-all end-all of your fandom experience. not only is it the right thing to do, but you will experience media in a richer way than ever before. make an effort, and try it out.\n\n[https://www.tumblr.com/helenisadoorable/636249229494550528/common-excuses-for-centering-men-in-fandom-and-why](https://www.tumblr.com/helenisadoorable/636249229494550528/common-excuses-for-centering-men-in-fandom-and-why)",
    "title": "\"common excuses for centering men in fandom and why they don’t work\" (from, Helenisadoorable, a Magnus Archives Blog). Blog post discusses the issues in female protagonist shows and stories, and why it is harmful for people to put obsessive focus on male side characters. Anyway, please watch Barbie.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1692471510,
    "score": 0,
    "keyword": "black ceo"
  },
  {
    "text": "The Fairmont's Jasper Park Lodge Corporate Manslaughter This is a true story that exposes a skeleton in the closet of an extremely wealthy business. And how I caused the vice president of the Fairmont’s Jasper Park Lodge to resign. \n\n(Please watch the Video for picture evidence)\n\nSo I took a job to work for a mega wealthy multi billion dollar company that literally caters to royalty and A list celebrities. I initially thought this was going to be an amazing opportunity to start my life over fresh. I was going to make some new friends, learn some new skills, and finish the practical half of my power engineer course. At first glance, the face of this company looked absolutely beautiful. But it wasn’t until I got there that I learned the ugly truth about how they operate and managed to accumulate this massive wealth. \n\nOn my first day working at this place I was put through orientation. During this time the presenter boasted about how they just received a “10 million dollar luxury budget” to be spent on their most expensive cabins. I thought to myself wow this place really will spare no expense when it comes to upgrading their facilities. After the orientation was finished I went to check into my room in the employee living area as this business operates in a national park which is somewhat remote. \n\nAs I approached my designated cabin I immediately noticed what poor condition it was in. The first thing I noticed was the stairs that led up to the cabin were completely rotted and there was a step missing from the set of stairs. I avoided the hazard the best I could and made it to my assigned room. When I entered my domicile my jaw hit the floor. The room was covered in black mold as if the room had not been cleaned in several years. I had actually gotten strep throat from sleeping in a room that had a patch of black mold and this place was 10 times worse. \n\nObviously annoyed, I went to call a friend I had made early in the day to see how I should handle this. But my phone was dead so I pulled my charger from the bag and went to plug it in the wall. As soon as I inserted the charger and released my hand the charging block fell to the floor immediately.  The electrical contacts in the wall outlet were so loose I couldn’t even charge my phone. (For those who don’t know that is a serious fire hazard as the gap between electrical contacts can ark out and start a fire from inside the wall). There were only a couple outlets in the room and neither were functional. \n\nEven more annoyed, I walked over to my new buddy’s room to use his wall outlet and tell him about the conditions of the room I was put in. This was the start of the rabbit hole I fell head first into. After ranting for a couple minutes to my buddy about the room, he informed me that the company hasn’t put a penny into maintaining their employee housing area in years since they previously hired foreign workers and they would never complain about their living conditions for obvious reasons. \n\nI was shocked hearing this, given the stark contrast of the customer facing side of the business and what they offer their employees. But… it gets worse. He goes on to tell me that an employee actually died falling down stairs that didn’t have handrails and weren’t maintained 4 years ago. I asked him to show me where it happened and he took me outside and pointed to a building called “le pub”.\n\nI walk over to le pub and a few moments later my mood changed from annoyed to fking pissed! Standing on the stairs leading to le pub I could tell that they were pretty much in the same condition as the cabin they moved me into. I thought to myself “how can these stairs owned by a multi billion dollar company be in such a horrible condition after they were directly related to a death of a colleague?” \n\nNow, a little background about myself. Before my switch to power engineering I was a journeyman welder/fitter, so I understand building codes, as I have built more than a few set of stairs over my career. There have been multiple studies showing that if stairs are off by more than 1/8th, it drastically increases the chances of someone tripping and fall. With that in mind, can you guess how poor of condition these steps were in? \n\n1 and 1/4 inch. Yeah – that’s 10 times more that is permitted in building codes.\n\nAfter coming to the realization that I had just taken residency is a literal death trap, I expanded my gaze and went for a stroll around the property. And oh boy what I found should make any reasonable person disgusted. For contrast, here is an example of a hazard on the customer facing side of the business that proves they are fully aware of how to control and mitigate a hazard that could potentially cause harm. \n\nNow here is a barrage of uncontrolled hazards in the back end of their billion dollar business.  \n\nNow armed with extensive documentation of blatant gross negligence on be half of the company, I was now ready to speak with the people charged with managing this train wreck. \n\nThe four main managers I dealt with are Ken  (President of JPL), Eric (VP of JPL), Wayne  (Engineering Director at JPL), and Heather (CEO of Accor Hotels). Wayne has an interesting background as he worked his way up from being a dishwasher to being the director of engineering without any formal education to my knowledge. I had multiple conversations with these managers and I started recording them when I started catching them in lies. When I called these men out, they seemed somewhat reasonable at first, saying that everything would be taken care of. I ask them when they planned on getting the work done and they told me that it will be a project for next year. \n\nI told them that’s unacceptable and they need to start on the repairs yesterday. They said things don’t happen that quickly and things like this take time. I told them they’ve had over 4 years to fix the steps that took their employees life. Don’t you think that’s more than enough time to fix a serious hazard? And what would happen if someone else got hurt in the time that they’re putting off these repairs?\n\nEric gave me an answer that left me completely flabbergasted. He said and I quote “if someone gets hurt then that’s just something that happens.” I was honestly shook when I heard those words slip from his mouth. He then told me that trades people don’t work in winter. Mind you this conversation occurred in October. I told him that’s not true and if they can’t find anyone to do the work that I would be willing to do it. He refused my offer and said my priority is to make sure the customers are satisfied.  \n\nWayne told me that “if I wasn’t happy with the situation I should quit.” So, I came to the conclusion that these managers did not care about the welfare of their employees. It turned out they wanted to delay these urgent repairs so that they could slip decades worth of neglect into their current budget, so that they wouldn’t have to ask their higher ups for additional funding. This in my opinion was a whole new level of gross negligence. The only option was to go over their heads. I came to the realization that I couldn’t work under these callous managers and I took Wayne’s advice and quit. \n\nAfter their higher ups were informed of the state of the property and how Eric handled the situation, he knew his career with the company was over and resigned a few months later. After I quit my job, I contacted the Fairmont’s parent company and spoke with one of their executives. She appeared sympathetic and assured me that these issues would be taken care of and I would receive updates on their progress. My confrontation occurred 6 years ago and I haven’t received any updates as of this post. \n\nSoon after I quit, I was contacted by Ken Hall, the president of the Fairmont’s jasper park lodge, pleading with me to lie to Employment insurance about why I was forced to quit this job. He asked if I could tell them that I was moving to assist with a family emergency, since I would have to report my findings to occupational health and safety. I ignored this request to lie and reported the truth. They were given multiple violation notices (and my application for EI was granted).\n\nI left out quite a few details for the sake of time. if this story gains any traction I will post updates including my conversation with the police that results in one officer admitting to neglect of duty in the case. I’m also in contact with the family of the victim and can fill you all in from their perspective. \n\nIn your opinion, does it sound like the administration of Fairmont’s jasper park lodge got away with corporate manslaughter? Or is the preventable death of an employee just something that happens?",
    "title": "The Fairmont's Jasper Park Lodge Corporate Manslaughter",
    "subreddit": "WorkReform",
    "timestamp": 1694057489,
    "score": 57,
    "keyword": "black ceo"
  },
  {
    "text": "This is America  What is the true America? Not the America that we broadcast to the public through thinly veiled lies but the America that is built by the workers yet \"represented\" by our officials. This is the true America.\n\n&#x200B;\n\n[America where if wages increase we need to stop that. ](https://preview.redd.it/vywgrb6wmgda1.png?width=490&format=png&auto=webp&s=9b03fbdae69cb7f891f605ffc9e0161532c97b74)\n\nMinimum wage was last increased in 2009 over 13 Years ago. How do you survive on that in todays age? \n\nIf you would like to know what life was like on minimum wage 7 years ago watch this: [Life on Minimum wage $7.50](https://youtu.be/-SCB1t28nDU). This was 10 years ago and minimum wage remains the same while inflation has only gone up since then making that measly $7.50 worth even less. This is not even mentioning rent prices increasing, all food items increasing, medical bills increasing. Everything that was paid for 7 years ago on this wage is not substantially higher while wages have stayed the same except for CEOs.\n\n&#x200B;\n\nhttps://preview.redd.it/m7y4g3gjngda1.png?width=777&format=png&auto=webp&s=0c5e27ca17b55519baeffdc0855e8c1177ad00eb\n\nhttps://preview.redd.it/rpojw1igngda1.png?width=675&format=png&auto=webp&s=25025b7ab84ea40d3ffbbebaf9300ca3a9f08707\n\n[Source](https://www.cbsnews.com/news/fed-interest-rate-hikes-unemployment-increase-layoffs-inflation/)\n\nSo whats the plan? The plan from the Fed (They print your currency find out more [here](https://www.reddit.com/r/explainlikeimfive/comments/2h3c8o/eli5_the_united_states_federal_reserve_system/)) is to crush the rise in wages and to make unemployment rise. Who does this hurt the most? The working class. Yet we have Biden touting that there is low unemployment so are they trying to increase or decrease unemployment?\n\n&#x200B;\n\nhttps://preview.redd.it/llza6c9mngda1.png?width=516&format=png&auto=webp&s=21383aac6921d14008f2ef78f6a72334c5f052ad\n\nSo we have the Fed wanting wages to stop rising yet these corporations can buy back stocks and reward their executives while the workers struggle to live day in day out. This is America.\n\n&#x200B;\n\nhttps://preview.redd.it/j45hc6znngda1.png?width=391&format=png&auto=webp&s=a13ef1a14effabf875e54477759d62e5f8bbf799\n\nWe have Microsoft paying for a private concert for their executives but then the next day laying off 10,000 employees who depend on that paycheck. This is America.\n\n&#x200B;\n\nhttps://preview.redd.it/dg0xiehcpgda1.png?width=706&format=png&auto=webp&s=236aa48c57c932adfc01228933b3b2f604e4240a\n\nIn America we cater to the rich while everyone else suffers. What do our elected officials do? Look the other way as they are the ones getting paid by [lobbyists aka corporations and wall street](https://unusualwhales.com/politics/article/lobbying). This is America.\n\nhttps://preview.redd.it/9jvn53txngda1.png?width=475&format=png&auto=webp&s=457c90d5ffc328a6a92332eb2a97c8073878d6dd\n\n&#x200B;\n\nInstead of focusing on these companies that rack in millions in profit and who pay [very little taxes](https://www.reddit.com/r/WorkReform/comments/10a8s0a/tax_the_damn_rich/), why don’t we just let them steal workers wages that they use to survive. Instead of redistributing the rising profits to the workers we give it back to shareholders and CEOs. Who are these shareholders? Oh that's right institutions like [BlackRock, Fidelity, Vanguard](http://www.welcometothemachine.co/index.html#_5-5-4). This is America\n\n&#x200B;\n\nhttps://preview.redd.it/moii80osngda1.png?width=420&format=png&auto=webp&s=2da231ca0f1493e819bd5a438389e2baf9dbe5b5\n\nThis is America.\n\n&#x200B;\n\nhttps://preview.redd.it/1qsdx3pepgda1.png?width=342&format=png&auto=webp&s=75709364ea52ad2a11b31c411ad1fff0e77d5307\n\nHere we care about the Rich while blaming the poor for everything even not willing to work lots of hours for little pay while the business makes millions and billions.\n\nThis is America\n\n&#x200B;\n\nhttps://preview.redd.it/2v4fq8dhpgda1.png?width=357&format=png&auto=webp&s=7780a88047502811ec77601937aa6c4181a377d3\n\nHere our election officials are bought by the Rich yet “represent” the working class.\n\n&#x200B;\n\nhttps://preview.redd.it/5l831qfipgda1.png?width=412&format=png&auto=webp&s=0f9b76cd017684d1cbf8344c6d725462eef637c1\n\nThis is the true America where corporations are our oligarchy and we are complacent and blame each other. When is enough enough?",
    "title": "This is America",
    "subreddit": "WorkReform",
    "timestamp": 1674335663,
    "score": 49,
    "keyword": "black ceo"
  },
  {
    "text": "Blind loyalty to your boss, the corporation and the system must be stopped. I have noticed a pattern within American culture. A culture which revolves around blind praise of anyone who has and the blatant disrespect of those without. A homeless man sleeping in his car while working full time will be treated like a speck of dirt and the millionaire who made his fortunes from inheritance and the stock trade will be treated as some sort of deity.\n\nWe do not live in a fair society. We are not all equal. We are not moral and we are not just. It is all based on those who have and those who do not have. A baby that is born to a parent who is working two jobs to pay rent will not be given the same opportunity's as someone who was born inside an elite household in a position of privilege and excess. Even the most basic concepts of health and nourishment are not guaranteed. Healthcare, dental, housing, free time and travel are all classified as a luxury.\n\nThe argument of \"Just get a better job\" is null and void in a substantial amount of cases. At some point the responsibility falls on regulatory powers to do the right thing and make sure living beings contributing in a society are not being exploited. We have millions of people who are simply stuck in poverty due to their inability to get ahead mostly due to their constant struggle to obtain basic needs such as healthcare. If a person has been injured on the job or experiences a mental illness is it not mandatory that those needs are addressed so that individual can re-engage within the work force? It is my belief that the reason we are seeing large fragments of our society living in tents and on the streets is because these people have been utterly forgotten and the burden being put on the worker has reached a breaking point. in an endless cycle of trauma and pain there it is no wonder so many are hopeless.\n\nWhy do we regard the people who continue to exploit these people and leave them in such a tired state? The CEO did this to them. Yet we worship them as super-heroes. Jeff-bezos is a name everyone knows and everyone reveres yet no one knows the name of the man who was left dead because Amazon didn't pay him enough to afford basic medical care and ended up dying in the streets because he couldn't pay his rent. We need a list of those names right now. economic warfare is being waged on the people to continue this cycle is nothing more than guaranteed self destruction. It may not happen now. It may not happen 50 years from now. But eventually we will wake up one day and look to our left and look to our right and we will all have nothing and be subjugated in totality by those that have everything. The land, the housing, the healthcare, industry, food, safety and security will be treated as another \"Luxury\".\n\nWhen will we as a people put our foot down and demand that we no longer are treated as second class citizens? How many people do you know who own land? How many people do you know who own a house? How many people do you know who have adequate healthcare, dental care and if they chose to could support a family of four? If you are under 30 then the answer is practically no one. Think about it. Here you are struggling to survive working 40 hours of your life a week with your blood, sweat and tears and you are not even given a shovelful of land. You are expected to sit down and shup up in the hopes that maybe 40 years down the line you will be able to buy a place to live at old age. Black rock has no problem swallowing up the fruits of your labor to gobble up as much of your communal space as it possibly can. In the end you get poorer. You own less. You get shafted. There is zero benefit to this system and it is no longer even fit for basic survival. No one in their right mind could sustain their life for a prolonged period of time on 7 dollars an hour. You will eventually either lose your mind or destroy your body attempting to do so. But somehow this is seen as normal in our country to knowingly give the OK to paid self-annihilation.\n\nJust a few decades ago you could easily pay a worker a living wage, a roof over their head, land, healthcare, benefits and a pension but now it seems as if getting these companies to give anything at all beyond a simple paycheck and leaving the worker to fend for themselves is next to impossible. Our generation has never experienced the American dream. We have always been exploited by industries, corporations, and debters. Your quality of life as a worker is seen as an after thought. I have no doubt the people who make the decesions in this country have no problem utterly defiling the vision it was built on. There was once the American...living on open land free to do as the American wished while maintaining and owning ideas, property and having ties to a family. None of which are possible now for pretty much everyone. Now you work yourself to death until you alienate yourself from your family and friends. Or you decide to go the route of \"sticking with family\" and inevitably ending up broke and with nothing. None of these values are guaranteed and are actually pretty rare in the grand scheme of things. I urge all of us to take this into account when promoting a Darwinistic narrative on success instead of just blind luck, power and privilege. If you think there is anything American about the way the \"free\" market is now you have been living under a bridge. No pun intended.\n\nI just don't get it. The only people who would even argue against these points are the people who would stand to lose their god like status in society from any reform being generated. People have been shouting for 15 dollar minimum wage for the last 15 years and they are treated as radicals. When realistically 15 dollars an hour is far far too generous on the ownership elite. I'd say 30 dollars would be a fair start. I love it how they have no problem raising rent but god forgive us if we raise the wages of hard working people by a couple of dollars. Sickening.",
    "title": "Blind loyalty to your boss, the corporation and the system must be stopped.",
    "subreddit": "WorkReform",
    "timestamp": 1673888510,
    "score": 40,
    "keyword": "black ceo"
  },
  {
    "text": "It is currently “proxy season” and It is your duty to understand a proxy statement, the significance it has, and the information you can learn from it. If you claim to care about work reform, excessive CEO pay, diversity of people and ideas on company boards, corporate governance, the same old crusty dudes on a board since the 1980s, but don’t know what a proxy statement is, you need to learn otherwise you’re part of the problem. I’ll simplify:\n\nAbout 90% of companies file their proxy in March or April. A proxy statement (Def14A filing) is an annual filing for every single publicly traded company. [Here’s an example of Bloomin Brands proxy statement](https://www.sec.gov/Archives/edgar/data/1546417/000119312517068018/d294794ddef14a.htm)\n\nEach year there are minimally 3 items voted on by every shareholder, whether it’s your cousin who owns 1 Tesla share or your Grandpa that has owned the same 5000 shares of ExxonMobil forever, at an annual meeting (which occurs roughly 30-45 days after a proxy statement comes out):\n\nAlways on ballot:\n\n1. Approval of each individual board member.\n\n2. Approval of the CEO (and top 5 paid named executives) for the year in review.\n\n3. Approval of the auditors.\n\nSometimes on ballot:\n\n1. Equity plan - Requesting to dilute the shares of existing holders to add more shares to the pool to pay for CEO bonuses and m&a activity (primarily).\n\n2. Shareholder proposals - this can be anything from a request to disclose sustainability or DEI metrics to reducing the allowable tenure of board members.\n\nIf any of the first 3 get below 90% support that usually puts them immediately in the bottom quartile and will likely trigger action. Meaning, a CEO pay review or a board member approval of 87% is actually terrible and will almost certainly result in action. \n\nNow you know why votes matter here. You can lobby to the major holders of a company (publicly available, just Google) to vote against something based on what is shown in the proxy filing. But let’s now focus on what can be learned from a proxy filing:\n\nWhen it comes to CEO pay, you can save a ton of time by focusing on a few key areas. The compensation discussion and analysis (CD&A), the list of peers, and the summary compensation table. \n\nYou want to identify a few red flags:\n\n1. Are the peers the company is basing CEO pay on fair? Are these companies much larger? Did they cherry pick companies that has amazing stock price growth years?\n\n2. Summary comp table shows the total breakdown of comp (if you’ve ever been curious why CEOs reduce salary of bonuses you’ll quickly realize bonuses make up the vast majority of their comp.\n\n3. Board member tenure and # of outside boards. 9 years is generally defined as “lengthy tenure” and being on more than 4 other boards is considered too many that you can’t keep focus on each company you serve.\n\nIn closing - educate yourselves. Learn which CEOs are truly bringing value to their companies where a lot of comp is actually merited compared to a CEO making half as much but performing terribly. \n\nYour personal vote may not matter much, and yes the major stock holders do their own research, but the power of people matters and you can sway influence with enough voices, media coverage, and proper education. Pension funds and international investment groups are more likely to be swayed than a firm like BlackRock, Fidelity or Vanguard.\n\nIf you seek to learn more, post here and I’ll answer as best as possible.",
    "title": "It is currently “proxy season” and It is your duty to understand a proxy statement, the significance it has, and the information you can learn from it.",
    "subreddit": "WorkReform",
    "timestamp": 1679760220,
    "score": 35,
    "keyword": "black ceo"
  },
  {
    "text": "Career Crisis at 27, what do I do? Hi all, this is my first reddit post and I'm going to do something I don't usually do: Be completely open and vulnerable.\n\n&#x200B;\n\nMy Current Situation\n\nI recently started this new job which is to get sponsors for an upcoming concert, it's currently September as of this post and the concert is in November. I'm doing the best I can to push for meetings with potential sponsors but my boss is hounding me to get more meetings. I can't exactly ask a CEO of a company to drop everything they're doing in order to see me. I'm just a small fry in the work. Yet no matter how many calls, emails or meetings I get, somehow it's never good enough. I checked with many other sponsorship salespeople, they've all told me that usually to get sponsors, they need to talk to them at least eight months in advance due to budgetary constraints. Anyway I feel dumb everyday for not doing my job properly. I'd been unemployed for the past year and I feel like I'm failing at the first job I've got. Prior to my year of unemployment I finished a Masters in Politics/Economics. Before the week of this post, I was in a constant state of nervousness about my job because I care and I want to do a good job. Now I'm just apathetic, the concert is two months away, we don't have any sponsors and he's expecting me to get two in one month. \n\n&#x200B;\n\nThe personal side\n\nI work in a large office building on the top floor, the view is great and the chairs are comfy. This building is shared with tons of other companies (the corporate type). On my commute to work I feel so out of place there. Everyone is wearing some variation of a white shirt and black pants. I feel like such a cookie cuter sheep among the heard. I wonder what it's all really for? I used to chase corporate jobs but now I'm wondering why. So I can put it on my CV? and I'm questioning if corporate is really for me. I spent so long chasing it and listening to the advice of others without asking: Is this what I really want? I thought directionless before when I was unemployed but if I leave the corporate stream I'll truly be directionless. At least back then I was aiming for something. Also I'm questioning materialism, so many of the other people in the same building wear Rolexes and have Armani shirts. I used to chase those things. Now I'm questioning what the purpose of having those things is and where did I get my values of needing certain names on my CV without questioning what I wanted for myself rather than listening to others. And my values of materialism too. I mean do I really want my tombstone to say that I just owned a lot of expensive stuff? And another thing, I see so many of my friends working corporate jobs in their 20s and I see my uncles in much higher positions (all scattered around the world). The thing they have in common, they all go out drinking after work on the weekends. Is this what my life is destined to be, just an endless cycle of work 5 days a week and then go out drinking with your buddies over the weekend? Not that I'm against going out for drinks, I enjoy time with my friends drinking too. But still, am I doomed to just repeat this cycle? And I can't help but wonder of all the employees who go to a corporate job. How many of them are here as a last resort because of failed dreams? I look at myself in the mirror sometimes and I don't even know who I am, what I want or what I value anymore.\n\n&#x200B;\n\nThe positive side\n\nDespite being made to feel like I'm not good enough for what my boss wants I am learning how to keep on moving and show up. So I suck at my job but I'm trying to learn things as much as I can.",
    "title": "Career Crisis at 27, what do I do?",
    "subreddit": "careerguidance",
    "timestamp": 1694014689,
    "score": 1,
    "keyword": "black ceo"
  },
  {
    "text": "The Jaguars’ $22 million question: How did four years of theft go undetected? [https://theathletic.com/5129370/2023/12/12/jacksonville-jaguars-amit-patel-credit-card-fraud/](https://theathletic.com/5129370/2023/12/12/jacksonville-jaguars-amit-patel-credit-card-fraud/)\n\nHow could this happen?\n\nThat question swept through the offices of [NFL](https://theathletic.com/nfl/) teams last week after *The Athletic* broke [the news](https://theathletic.com/5118308/2023/12/06/jacksonville-jaguars-employee-theft-amit-patel/) that Amit Patel, 31, a former employee in the finance department of the [Jacksonville Jaguars](https://theathletic.com/nfl/team/jaguars/), allegedly stole more than $22 million from the team over a four-year period.\n\nPatel was a mid-level employee who worked for the Jaguars from 2018-23. He allegedly created fraudulent charges on the club’s virtual credit card and then covered his tracks by sending falsified files to the team’s accounting department. According to a charging document, he used that money to buy vehicles, a condominium and a designer watch worth over $95,000. He also purchased cryptocurrency, splurged on luxury travel for himself and others and used the funds to keep a criminal defense lawyer on retainer. Patel’s attorney said that the vast majority of the $22 million he stole were gambling losses; Patel allegedly [placed bets](https://theathletic.com/5121029/2023/12/07/jaguars-amit-patel-betting-fantasy-losses/) on football and daily fantasy sports with online gambling sites.\n\nPatel is expected to plead guilty to multiple charges — wire fraud and an illegal monetary transaction — in a court appearance Thursday, his attorney, Alex King, said.\n\nIn a statement, the Jaguars said that the franchise engaged “experienced law and accounting firms to conduct a comprehensive independent review, which concluded that no other team employees were involved in or aware of his criminal activity.” That fact makes the question people around the league were asking last week even more salient: How was Patel, working alone, able to steal more than twice the amount quarterback [Trevor Lawrence](https://theathletic.com/nfl/player/trevor-lawrence-0gjixjs0a34LXvKj/) counts against the Jaguars’ salary cap?\n\n*The Athletic* spoke to two people familiar with Patel’s work for the Jaguars as well as nine people who work or have worked in finance for NFL teams or other pro sports franchises. Patel was no mastermind, people who knew him said, but rather a guy in the right place at the right time. The Jaguars may be a franchise worth an estimated $4 billion (according to Forbes), but the team’s finance department was understaffed. And turnover in key positions and a switch to a new credit card system created an opening that Patel exploited. The people who knew him and others who work or have worked for NFL teams questioned why Jacksonville didn’t have better safeguards in place that would have made it more difficult for Patel to get away with what he did and for so long.\n\n“If you’re running a tight business, this would be impossible to pull off more than once,” said a former chief operating officer for an AFC team. “For (four) years, somebody was asleep at the switch.”\n\n“I know people won’t believe it. But he was super basic.”\n\nThat was how one person who knew Patel during his time working for the Jaguars described him. That person and others who spoke to *The Athletic* were granted anonymity to discuss his work, which remains under federal investigation. Patel didn’t wear fancy clothes or flash his new expensive watch or brag about trips he took on private jets with friends. “Aside from the fact that he drove a Tesla, if you were to see Amit, you wouldn’t assume like, Oh, here’s a dude that is siphoning millions of dollars from his job,” the source said.\n\nPatel was friendly and well-liked in the office. His job required him to interact with many department heads, and the source said he had “really great connections with everyone across the organization.” Patel oversaw the budget activity for each department, and he was responsible for helping department heads code individual expenses. If an expense came through on a corporate credit card, Patel was the person Jaguars employees would go to to ask: Hey, where does this need to go?\n\nThe staffing hierarchy for an NFL office is similar to any organization: coordinator, manager, director, vice president, senior vice president. Patel joined the Jaguars in 2018 as the coordinator of financial planning and analysis and was not promoted until three years later — to manager of financial planning and analysis. So the bulk of the alleged fraud occurred when he was a coordinator.\n\nCourt documents detail how Patel helped prepare the Jaguars’ monthly financial statements, oversaw department budgets and acted as the administrator of various programs, including the Jaguars virtual corporate card program. In October 2019, Patel’s direct supervisor, the director of financial planning and analysis, moved to a role in a different department and was not replaced. Two sources familiar with Patel’s work for the team said two other staffers also left the finance department, forcing others, including Patel, to pick up their work. It was not uncommon for staffers to arrive at work at 8 a.m. and not leave until 9 p.m.\n\n“There was some transition in the organization which I believe created an opportunity for this to flourish,” said one source.\n\nAdded King, Patel’s attorney: “They were short-staffed in those departments. Normally you’d have segregation of duties, those kinds of internal checks and balances and they had lost people through attrition. … You’re supposed to have Person A do this part and Person B do this part as a check and balance and segregation of duties and all of a sudden he was doing both roles.”\n\nThe Jaguars switched to a virtual credit card system after Patel had been with the team for about a year. VCCs are considered more secure than having employees carry around physical cards, and they keep the card information private when making online transactions. However, it takes time for employees to transition to the new system, and the person introducing the system is relied upon to answer questions. He or she becomes the go-to, the trusted expert.\n\nPatel was that trusted person in Jacksonville. When he first started managing the VCC program, there was an employee from accounting who checked Patel’s submitted sheets, but then that employee left, and that layer of security also went away.\n\n“The number one rule you learn in accounting is you need to have dual controls for a reason,” said one source.\n\nThe federal charging documents state that as the sole administrator of the VCC program, Patel had the power to create user accounts, approve new VCCs, request changes to the available credit for the VCCs, and classify all VCC transactions in the Jaguars’ general ledger. Each month, he created an “integration file” that listed each VCC transaction with cost coding information. But instead of accurately reporting the VCC transactions, Patel is alleged to have created fraudulent entries using a variety of methods to ensure that the total dollar amount of VCC expenses matched the balances paid by the Jaguars. Charging documents state that he “identified legitimate recurring VCC transactions, such as catering, airfare and hotel charges, and then duplicated those transactions; he inflated the amounts of recurring VCC transactions; he entered completely fictitious transactions that might sound plausible, but that never actually occurred; and he moved legitimate VCC charges from upcoming months into the month of the integration file that was immediately due to the accounting department.”\n\nPeople who might assume an NFL franchise would be a tightly monitored operation are not wrong. Still, in Jacksonville, that description only applied to the football side of the business, because the league office monitors each team for salary cap compliance.\n\n“We were so anal about everything,” said a former Jacksonville employee on the football side. “It went down to the penny. Constant communication with internal accounting, constant communication with the NFL management council, with player personnel (in) NFL headquarters, so by the time an official audit (from the NFL) came down, it was yesterday’s news.”\n\nAudits of the non-football side of the Jaguars did happen, according to a source, but they did not scrutinize every transaction. “The thing with any audit is everything is samples. So if they pull a sample and the support aligns and supports the transaction, then there are not that many questions.”\n\nIn 2019, the FBI [caught](https://www.justice.gov/usao-edca/pr/former-sacramento-kings-executive-sentenced-7-years-prison-multimillion-dollar-fraud) Sacramento Kings chief revenue officer Jeff David stealing $13.4 million from five companies by representing to them that payments they made were going to the Kings, when instead they were going to bank accounts that only he controlled. David was sentenced to seven years in prison but [was granted an early release](https://www.abc10.com/article/news/local/former-sacramento-kings-executive-released-from-prison-early/103-96ec0c10-7860-4611-a04c-b7266ef08ee0) in September 2023.\n\nAn [ESPN article ](https://www.google.com/search?q=How+NBA+executive+Jeff+David+stole+%2413+million+from+the+Sacramento+Kings&oq=How+NBA+executive+Jeff+David+stole+%2413+million+from+the+Sacramento+Kings&aqs=chrome..69i57.15538j1j4&sourceid=chrome&ie=UTF-8)chronicling the mess in Sacramento described how it became a “cautionary tale” within [NBA](https://theathletic.com/nba/) circles, with CFOs sharing different methods of internal stress tests at the league’s annual sales and marketing meeting. One NBA team president told ESPN the franchise “initiated a full audit of its operations” days after David’s fraud became public knowledge.\n\nDavid was a top executive stealing from other companies, not a lower-level employee allegedly defrauding his own organization. But the reaction from the NBA community mirrors what is now happening across the NFL.\n\n“We saw a mess out there with the Sacramento Kings, so it’s not the first time,” one current AFC team president said. “But you certainly step back and think, what do we have in place?”\n\nAccording to interviews with officials from other NFL teams as well as individuals working in finance at other professional sports franchises, the Jaguars may be an outlier in how little they were doing to monitor an employee with so much control over spending. Most of those interviewed were gobsmacked that one person would have unchecked oversight of the VCC setup.\n\n“Talk about having egg on your face. That’s a whole f—-ing omelet,” said a former finance specialist for an [NHL](https://theathletic.com/nhl/) team.\n\nA former finance employee for an NFC team said that their CFO ran the corporate card program, accounts payable received the statements for the cards, and then a manager approved each report. That finance employee reviewed the court filing that detailed Patel’s alleged crimes and said the sheer number of falsified transactions he created should have resulted in detection at an earlier point.\n\n“A lot of times a big number might not look like an outlier,” said a former chief administrative officer of an NFL team. “Usually, you have someone who charges a payment and then expenses it to someone else. Then the money comes back to the budget and you see the figure hitting your account as an outflow of cash. Someone would notice if they turned in a bill for $100,000 and it was paid out by someone else at $150,000.”\n\nBut if one person handles multiple layers of the process, it can go “upside-down” quickly. “It certainly was a flawed system they had in Jacksonville,” he said. “Somebody was given way too much leeway and way too much trust.”\n\nA former NFL COO said in a text message that he had “never heard of an employee having that kind of access without layered controls in place. … Usually everybody up to and including CEO level has another party who has to approve expenses. Sometimes it might be at a certain level (say above $10k) but their situation sounds highly unusual.”\n\nAnother former NFL COO said that Patel’s alleged fraud would likely have been detected at his organization because his fraudulent charges would have blown the annual budget. “Once a fiscal year was underway, each department head would receive a monthly update of expenses for the month versus the plan. Sometimes the actual spending might vary from the planned spending for simple timing reasons. Anything over a 5 percent variance would receive scrutiny from a number of sources including the finance department, the person that budget reported to and/or myself,” he said in a text message.\n\nThe spreadsheet integration file Patel allegedly falsified might not have even been reviewed by superiors, said the former finance employee for an NFC team, but rather something that accounting merely uploaded to a server. “It’s accounts payable, so that’s not like a fine tooth comb. When it gets back to accounts payable, you’re under the assumption that it’s all taken care of, and it’s ready to be paid,” the employee said.\n\nA third former COO explained that teams often undergo three different audits annually: a league audit focused on compliance with the salary cap, then two others, one done internally, then another initiated by a banking institution (if the team borrows money). The internal audit would have been the one most likely to detect Patel’s alleged fraud, the COO explained.\n\nThe finance people who spoke to *The Athletic* said they expected NFL teams to review their reporting structure and potentially beef up those internal audits in light of what happened in Jacksonville. The senior members of the Jaguars’ financial operations while Patel was there remain in their posts. According to the team’s website, the organization has increased the size of the finance department by six employees since Patel was fired in February. Two of those positions are new — a vice president of accounting, and a senior manager of accounting. The team added in a statement: “With the assistance of external experts, (the organization) has extensively reviewed its own policies and procedures, added staff to its finance department, and taken other measures to ensure the integrity of its financial controls.”\n\nAs for Patel, his attorney said Patel checked himself into an inpatient recovery center this past spring and has cooperated with the government and the Jaguars. King said his client is remorseful, takes “full responsibility for his actions” and has opened a gambling addiction recovery center, where he plans to be “active in the treatment community.”\n\nHe was also working for Uber, driving the black Tesla that is referenced in court documents as one of the spoils from his alleged crimes. (His attorney said Patel purchased the car with his own money.)\n\nA few days before his alleged fraud became a national headline, Patel picked up Chris Chaney, a product marketer from Cincinnati, and his wife from the Jacksonville airport and drove them 40 minutes to their Airbnb in Jacksonville Beach. They were in town to see the [Bengals](https://theathletic.com/nfl/team/bengals/) play the Jaguars.\n\nChaney said Patel made small talk as he drove, pointing out the country club where he is a member and telling the couple he’d been a Jaguars fan since he moved to Jacksonville as a kid. Patel told Chaney he’d worked in finance for the team but was recently laid off because of some restructuring.",
    "title": "The Jaguars’ $22 million question: How did four years of theft go undetected?",
    "subreddit": "Accounting",
    "timestamp": 1702395986,
    "score": 151,
    "keyword": "black ceo"
  },
  {
    "text": "We Should Be More Concerned About Palestine... I know a lotta y’all not gon like me for this. I can just sense it. I feel like y’all might eat me up for this one too but I’m gonna say it anyway. \n\nThe way the black community—at least from what I’ve seen in America—is being so non-chalant about what’s happening in Palestine right now and it is really breaking my soul. In my opinion, we should be more vocal. And before you jump down my throat, let me say this: I *get* that a lot of us do not feel like we should have a social responsibility to “care” or be involved with non-black people’s political issues, I do. I get that we are *tired*. I get that we feel that we shouldn’t be the superheroes of every single non-black issue out there in the world because our emotional labor is already relied upon without ever giving us our just due back or giving us credit, *I get that*. \n\nHowever, I feel that this situation is unique. Not only is it unique, but it is also a literal genocide. A literal ethnic cleansing. I could never turn a blind eye to something like that. I say it’s unique to us because the Palestinian struggle has been similar to our own (I’m not saying it’s the *same*). And historically, the Palestinians have had black people’s backs in terms of our right to freedom and self-determination. I just listened to a talk with Angela Davis on Sunday where she said that Palestinians supported her while she was in jail. The Black Panthers stood with the Palestinians. As did Malcolm X, Martin Luther King Jr., James Baldwin, Toni Morrison, Audre Lorde, June Jordan, Nelson Mandela. And not just in the past, but as recently as 2020, during the George Floyd protests, Palestinians were teaching how to get tear gas out of our eyes. They painted a mural of George Floyd in Gaza (I believe it was Gaza, I may have to fact check on that). \n\nI don’t see how anyone could look at these videos of dead and mutilated babies, children with no parents, people fainting, people being blasted to bits, screaming out for god to save them and not feel anything? I don’t see how you can say “it’s not my problem” when it literally is because YOUR tax dollars are funding it, and YOUR elected officials are providing weapons and getting involved in the mix. And we are way more involved with Israel than we realize. Produce, shoes, printers, fast food...either sourced directly from or funding Israel. \n\nPlus, Afro-Palestinians exist. We are out there. I’m watching videos of people in Gaza and I’m literally seeing Afro-Palestinians in the videos. Afro-Palestinians are also in Jerusalem. There are documentaries about them. So black people are not removed entirely from the situation at all. We are out there and they’re here in America. My friend is Afro-Palestinian for Pete’s sake. So it’s very fucked up to say “not my problem.” What if the black non-Americans said that to us during Black Lives Matter? I’m sure some did, but how would you feel?\n\nAnd before you come at me with the whataboutism, yes, I agree, why don’t we also talk about Sudan and Haiti? I’ve seen black people come onto these Palestinians’ live streams and say what about Sudan and Haiti and I think it’s extremely disrespectful. If a Palestinian did that to us, we would be pissed. And why don’t we ask ourselves that? Why haven’t we made any noise for Sudan and Haiti? Because I BARELY see any creators talking about it. All I see on tik tok live streams with black people are conversations about body count, and who should pay for a date, and interracial dating. Never anything about what’s going on with black people in the world today. \n\nAnyways, eat me up. I know some might not agree.\n\nEDIT: excuse any typos please, I’m trying to get them all, but my tablet has weird autocorrect and I may not see them all\n\n2nd EDIT:\n\nI should say this. It’s crazy that we can be so apathetic about a literal ethnic cleansing. If we become so desensitized to this ethnic cleansing, this genocide, then what will happen once they come for us? If we show our government, if we show the world that we are okay with this, that we can simply turn a blind eye to it, then who’s to say it won’t happen to us next? Because you *know* how vulnerable we are as a population. There should never be a time where we take a stance of neutrality to genocide. Not ever. Because I guarantee you if they can do it to them, they will do it to us—in some places they already are doing it to us as some have pointed out in the comments. It should not be that hard to say: “I do not condone violence. I do not condone genocide.” But for some reason we find ourselves trapped in the false sense of stability that America brings to us. We love to sit in our privilege here and say if it’s not on my doorstep then it’s got nothing to do with me. But no one has ever heard of complicity. We are complicit. We pay for this. Our elected officials make decisions in our names. We are complicit and much more involved than we like to realize. We are supporting white supremacy, just under a different name and to a different brand of folks. And to me, that sounds like hypocrisy. I do not accept white supremacy in *any* of its forms. No matter what name it falls under. I do not support colonialism. Now how that make sense if I say I am neutral to white supremacy? But I’m black? Come on mane. Make that make sense. \n\nEDIT 3:\n\nSomeone asked me to post numbers to call for actions. \n\nHere are some of them:\n\n[White House Comment Line](https://www.instagram.com/p/CyzK48RRPbG/?igshid=MzRlODBiNWFlZA==)\nThis one is open Tues - Thurs, 11AM - 3PM EST. \n\n[Tell Congress Ceasefire Now](https://www.jewishvoiceforpeace.org/resource/call-congress-support-ceasefire/?fbclid=PAAaYvFphm9UDi9v3TiQreAVxgZqSuyXPuCLRFgcWoAhtqKxf5Pp4RJ-CeoQg_aem_AYk1oeqKcP2Oojq6EB1jN4qWPmlSSjkQgBMWFx4GJmSunN3XKZ82uHv1l1IhZ_fL1T8)\nThis one is by Jewish Voice for Peace. It calls for you and you leave a voicemail mail using the script to your representative. Takes less than 5 minutes.\n\n[Email Your Congress Member](https://www.jewishvoiceforpeace.org/resource/email-congress-support-ceasefire/)\nThis one is also done by Jewish Voice for Peace. Literally about 2 minutes.",
    "title": "We Should Be More Concerned About Palestine...",
    "subreddit": "blackladies",
    "timestamp": 1698290869,
    "score": 428,
    "keyword": "black ceo"
  },
  {
    "text": "How can a black woman find the right job? Hi everyone, \n\nMy wife has been very stressed out and feels lost to what she needs to do next. For the past 2 years she has been in and out of jobs. \n\nMost recently, she was working for a non profit helping mothers. You would think this place would not have the discrimination, infighting, and drama that other workplaces have but it does. And its not just drama, it has affected her job and she is now on a PIP plan because the people who were supposed to be training her did nothing and now the supervisor has her hands tied, but she also hasn't been helpful.\n \nThe organization seems to have laid a lot of people off when the new CEO took over a few years ago and honestly a lot of people with less color are in charge and in place of those ousted. \nThis comes at a time when we finally feel more stable but it seems like they are trying to push her out the door and they definitely sabotaged her. \n\nShe has copywriting, marketing, customer service, event planning, tutoring etc. experience with a degree in psychology and worked in a clinic for a bit. She has also expressed being self employed but we are not sure what she could do. She has tried a few things and they haven't panned out. \n\nWe have been trying for a long time now to research different businesses and careers but she is feeling disheartened. Please give any advice and feel free to ask any questions, I will try to get to all the comments. Thank you\n\nWe are also considering moving away from Florida where we currently live. If you have any suggestions to where there would be more opportunities for a black woman with her qualifications please let me know.",
    "title": "How can a black woman find the right job?",
    "subreddit": "blackladies",
    "timestamp": 1698259021,
    "score": 14,
    "keyword": "black ceo"
  },
  {
    "text": "Women did influence politics before suffrage, and the government did rely on their opinions, and people worried suffrage would prevent them from influencing the government. It wasn't simply men who created society's rules. Here's some information: Many feminists like to argue that any problem men face is caused by themselves because \"but the government who creates these laws are all men!!!1\". The problem is only 1% of men are in the government, and they blame men for their suffering based off what the top 1% of men do (the apex fallacy). They also assume all social norms, which often aren't created by the government, were created by men, which is just false. The problem is, men could only vote in early United States if they owned property, which only 3% did, and women were never property or forbidden to own property, contrary to what feminists say. In fact, universal suffrage wasn't given to men until around the mid-19th century in America, and the reason they only gave it to men wasn't due to hatred of women, but because men served in the military, and military rights and voting rights overlapped. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), in virtually all countries, men were originally not given universal suffrage until some point in time, and usually they gave women the right to vote simultaneously or somewhat later. If they originally only gave men the right, it's because men served in the military.\n\n**Many women opposed the right to vote, and many men supported it.**\n\n[Many people don't realize that many women were against the right to vote and only a minority originally supported it](https://web.archive.org/web/20210420082758/http://www.societyforhistoryeducation.org/pdfs/M15_Miller.pdf). Hell, many pro-suffragists were men. Why did people oppose the right to vote? A few reasons and it wasn't exactly because people thought women belong in the kitchen:\n\n1. People thought the world of politics was too dangerous for women, and were very protective of women and didn't care if men got harmed.\n2. People thought it would be a slippery slope and lead to Jim Crow laws being abolished and allowing blacks or immigrants to vote. In fact, the fact that people of color could technically vote is a big reason why suffragists wanted the right to vote in the first place.\n3. People believed women would influence laws more if they couldn't vote, and believed allowing them to vote would make it harder for them to influence the government and laws. In fact, women's opinions often did influence the government and their laws historically.\n\n**Women did influence the government, society's norms and rules, and laws, and people worried allowing them to vote would prevent that. Many laws are even in favor of women.**\n\nContrary to what feminists think, laws weren't created based strictly on the opinions of men. Only 1% of men worked for the government, and they usually made laws based on what they thought was best for the land or its people, but not for men. Totalitarian leaders might be all about themselves, but certainly not men either. Women's opinions mattered a lot to men. [In fact](https://presidentlincoln.illinois.gov/Blog/Posts/141/Abraham-Lincoln/2021/8/Lincolns-avoided-duel/blog-post/), [Abraham Lincoln](https://www.battlefields.org/learn/articles/abraham-lincolns-duel) even used female pen names pretending to be a woman to attack political rivals, including James Shields.\n\nAlongside speaking against recent policy decisions made by Shields, Lincoln implied that his opponent was weird and unpopular with women.\n\n>*\"His very features, in the ecstatic agony of his soul, spoke audibly and distinctly – 'Dear girls, it is distressing, but I cannot marry you all. Too well I know how much you suffer; but do, do remember, it is not my fault that I am so handsome and so interesting.’”* \\-- Rebecca (Abraham Lincoln)\n\nLincoln's wife also wrote several letters against Shield under a female penname. Lincoln apparently consulted with her about his letters to make them sound like a woman wrote them. What does this mean? Women were seen as pure and moral compared to men, so their voices mattered a lot in politics, and because they couldn't vote, they were seen as fair and reasonable. **This is why women often opposed the right to vote, because they worried it would prevent them from being influential in politics.** If the 1800s were so patriarchal, why would he have used a female penname to pretend that a man was unpopular with women to destroy that man's career?\n\n[Moreover](https://daily.jstor.org/women-against-womens-suffrage/), Catharine Beecher, an advocate for women’s education and economic advancement, argued that women were most effective when they united to press their fathers, brothers, and husbands for reforms in terms that rose above intense partisan politics. Using anecdotal evidence, she pointed to her sister, Harriet Beecher Stowe, whose [*Uncle Tom’s Cabin*](https://daily.jstor.org/frederick-douglass-feud-over-uncle-toms-cabin/) had contributed to anti-slavery sentiment in the country, selling quickly before the Civil War and humanizing enslaved black people. It changed American's views of enslavement at the time, especially in the North. Another example was the women’s clubs that fought for pure food laws, [compulsory schooling](https://daily.jstor.org/why-would-parents-oppose-compulsory-education/), and other reforms that were easily framed in terms of maternal care.\n\n[Women influenced politics in many other ways, too](https://americanhistory.si.edu/blog/5-ways-women-influenced-politics-they-got-vote). In the 1800s, men and women flirted at political rallies and met their potential spouse. Politically-charged women charmed men into supporting certain political views, especially first-time male voters. In his new book *The Virgin Vote*, Smithsonian political history curator Jon Grinspan explains that women even \"turned down marriage proposals specifically because of a young man's political affiliations.\" These actions pressured husbands and suitors to vote in favor of a woman's views.\n\nCarry Nation, a female leader in the Temperance movement, used to use hatchets to smash saloons. Churches and theaters paid her to against alcohol. In the Victorian era, if a man smashed alcohols, he'd be stabbed, but men were chivalrous towards women and refused to harm her. Many people laughed at her, but respected her integrity for her beliefs anyway. Carry's radical approach helped launch the Temperance movement into mainstream American politics.\n\nHell, [even in Saudi Arabia](https://web.archive.org/web/20131109094735/https://www.theguardian.com/commentisfree/2013/nov/02/saudi-protest-driving-ban-not-popular), almost 80% of women were against the right to drive, and believed it'd create sexual harassment of women and give men the ability to betray or cheat on their wives. Usually, these laws were created to be overprotective of women, which is benevolent sexism, not \"misogyny\" (which means hatred). Laws changed a few years ago about this, but you can see that many laws in these countries are based off of overprotection of women and benevolent sexism, not hostile sexism (which is the sexism feminists THINK is the norm but is not). In fact, in Saudi Arabia, they are one of the happiest nations and women there were happier than men, and didn't consider themselves oppressed at all.\n\n**Laws might be created a small top percent of men, but they aren't created for men.**\n\nWe have the Office on Women's Health, Office for Research on Women's Health, etc. (even though men die a lot more than women), Violence Against Women Act (even though men are just as likely to be victims of domestic abuse and more likely to be victims of crime or murder), laws in other countries that seem \"misogynistic\" but are really about social norms or even overprotection of women, the [criminal justice system going easier on women and law enforcement going harsher on men](https://www.reddit.com/r/MensRights/comments/xyl5wb/comment/jj676ln/?context=3), tons of battered women's shelters but none for men, more funding and research for breast cancer than prostate cancer even though prostate cancer is just as common and deadly, a draft for men but not women, alimony, a women's bureau to protect working women but no bureau for men even almost all workplace deaths are men and way more men die at work each year than men who ever become CEOs, affirmative action for women even though women are more likely to make it to college, etc.\n\nYes, the government is mostly men, but they don't make these rules for men. In fact, the reason men were involved in the world of politics through government and voting but not women is because people thought if men were the ones fighting for our country at war, they'd be the ones who work in the government or vote, not due to hatred of women. The fact that men were the ones involved directly in politics that way is why it says all men are created equal instead of all humans, not because people didn't view women as human.",
    "title": "Women did influence politics before suffrage, and the government did rely on their opinions, and people worried suffrage would prevent them from influencing the government. It wasn't simply men who created society's rules. Here's some information:",
    "subreddit": "MensRights",
    "timestamp": 1690392635,
    "score": 116,
    "keyword": "black ceo"
  },
  {
    "text": "APA: \"Boys are facing key challenges in school. Inside the effort to support their success\" [https://www.apa.org/monitor/2023/04/boys-school-challenges-recommendations](https://www.apa.org/monitor/2023/04/boys-school-challenges-recommendations)\n\n**Published in a lengthy article on 01-April-23**\n\nFirst section is just background and facts/stats\n\nSecond section below:\n\n>**Making the case for boys**  \n>  \n>The reasons for that are rooted in the way schools are set up and how boys are socialized. At the biological level, boys are at higher risk for inattention, hyperactivity, and externalizing behaviors (Tuvblad, C., et al., Journal of Abnormal Child Psychology, Vol. 37, 2009). Classrooms, meanwhile, typically require students to sit quietly and self-regulate—what some call the “sit and get” approach to education. When boys struggle with that, getting out of their seat or ignoring a teacher’s instructions, for example, they are often punished for it. **Boys, particularly boys of color, are disciplined at much higher rates than girls, starting at ages 4 and 5**  \n>  \n>***“The fact that children, primarily boys, are being suspended and expelled for these behaviors so early on is incredibly alarming and problematic,”*** Reigeluth said.  \n>  \n>Research shows that boys tend to receive more severe punishment than girls for the same behaviors, especially if they are Black or have a bigger body type, pointing to bias in the application of school policies, Those racial disparities in suspensions and expulsions predict higher rates of incarceration, lower college enrollment, and worse overall health.  \n>  \n>Compared with just 10% of female students, 18% of male students are diagnosed with learning disabilities and referred to special education services). Like boys who are suspended and expelled, these students often disengage from school and experience worse academic outcomes as a result.  \n>  \n>Perhaps the most pervasive—and most entrenched—challenge that plagues boys at school is their gender socialization. As boys grow up, adults and pop-culture messages often push them to project an image of dominance, indifference, and self-sufficiency while hiding vulnerability, curiosity, and the need for intimacy. They see male role models in the media succeeding in athletics, business, and entertainment, but few in academia. They learn that school isn’t “cool”; that it’s better to excel at sports.\n\n**This is interesting:**\n\n>Despite these troubling disparities, it can be tough for those studying and advocating on the issue to make the case that boys and men require more attention and resources.  \n>  \n>**“How do we acknowledge and address the fact that even though men hold more structural power in the U.S.—in Congress, as CEOs, and as billionaires—there are also men and boys who are struggling substantially?** How do we help the ones who are struggling, without further ‘padding the pockets’ of those who are doing well?” said Andrew Smiler, PhD, a clinical psychologist based in Winston-Salem, North Carolina, and cochair of the TFBS\n\n**Third Section:**\n\n>**Opportunities for engagement**  \n>  \n>This section talks about how to get boys to engage in school better an overcome stereotypes.  \n>  \n>“***When a boy is presenting in a way that seems to be resistant to learning, we should take time to understand what’s going on, rather than immediately disciplining him,”*** Reigeluth said. Rather than a behavioral problem, Smiler said, a boy who is acting out or not completing schoolwork could have a learning disability, attention-deficit/hyperactivity disorder, poor vision, a chaotic home life, or feel social pressure about not wanting to appear engaged in school.  \n>  \n>**Fourth Section:**  \n>  \n>**Interventions that work**  \n>  \n>Given the degree of disparity boys face, some advocates are proposing more sweeping changes. **“Redshirting”** boys, or starting them one year later in kindergarten (different from holding a child back for documented developmental reasons), has become popular in some high-income communities. But psychologists say the practice isn’t yet backed by research. In fact, for boys at highest risk, the opposite approach—giving all children access to affordable, high-quality preschool—could help more.  \n>  \n>Another intervention with growing support is single-sex education, particularly for boys of color. Research is still limited, but Nelson is involved with a national effort to evaluate the efficacy of such schools, which some community leaders believe are a possible solution to the bias and disparities boys of color face in U.S. public schools. So far, this research has found that single-sex schools excel in parent and community engagement, as well as racial and gender identity development.  \n>  \n>**“The school environment becomes a context where boys can explore and examine, where there’s a lot of possibility, rather than another context in their lives where stereotypes of Black men and boys are imposed,”** Nelson said.  \n>  \n>Many feel that offering interventions before and during the K–12 years is the best way to support healthy development and help boys thrive at school. But men in college can benefit from help, too, which is why some higher education institutions are creating “male success centers,” to provide a place of community and support for men on campus.\n\n**This is a bit suspect to me:** It looks like a male feminist training program of all men's problems are men's sexist, racist, male privilege attitudes.\n\n>At Northwestern University, Hill leads NU Men, a 6-week mentoring program where participants deconstruct masculinity as a means of violence prevention. For example: What does it mean to be masculine? What are men expected to do to obtain power (be the breadwinner, initiate sex)?  \n>  \n>Hill also oversees Northwestern’s Masculinity, Allyship, Reflection, Solidarity (MARS) peer education group, which examines policy related to gender and violence, combats rape culture, and promotes healthy masculinity on campus. In 2019, members of the group wrote to the Trump administration about proposed changes to Title IX regulations. For example, they argued that live hearings could put survivors of sexual violence at risk of further trauma by requiring them to confront their attackers. Hill also consults with other universities and organizations to help them hire and train their own masculine engagement directors.\n\n**Closing statement:**\n\n>Ultimately, to help boys at school, the task force’s plea is simple.  Review the evidence, see this gender gap for what it is—an equity  issue—and act.  \n>  \n>“This is an equity issue, full stop. It’s systemic, it’s  consequential, it’s impactful. It’s between groups that we can readily  identify, and it cuts across multiple contexts,” Boutakidis said. “If  there’s something we can do to address it, we absolutely need to.”",
    "title": "APA: \"Boys are facing key challenges in school. Inside the effort to support their success\"",
    "subreddit": "MensRights",
    "timestamp": 1682816809,
    "score": 83,
    "keyword": "black ceo"
  },
  {
    "text": "[Essay] Progressives/Feminists are bad at talking about men’s issues ###Preface\n\nI am not a feminist or an MRA. I only feel the need to preface with this given how uncharitable people can get when you’re even remotely critical of ideologies such as the one’s discussed here. I am also not an anti-feminist - though I do have strong objections to feminist rhetoric, institutions, and academia.\n\n###Introduction\n\nGender issues - we’re all aware of them. Men and women are expected to conform to certain roles, and are often punished when they don’t.\n\nIn the last century an ideology known as feminism emerged and rooted itself in progressive circles. Their initial concerns were legitimate; women couldn’t vote, own property, or divorce, among other things. The ideology achieved many victories, both legislative and social. Today, feminism is more popular than ever, garnering support from celebrities and multinational organizations like the United Nations. It’s taught in many schools as part of their mandatory curriculum, it’s widely supported among most progressives, and many would argue you would need to be one in order to even call yourself a progressive.\n\nWhy, then, is feminism so polarizing? Surely, there are plenty of women’s issues that exist today, and aside from far-right tradcons, who could really disagree with the fundamental premise of gender equality? Detractors of the ideology commonly claim that it’s “gone too far” - but what does that even mean? Many progressives claim that detractors of the ideology are reactionaries who simply misunderstand it. Is this really true? What’s actually going on here?\n\n###The Feminist Hypothesis\n\nFirst, it’s important to define feminism. If asked to define the ideology, most would say something like “the belief that both genders are equal / should be treated equally under the law”. This is an incomplete definition, however. This would be similar to defining liberalism as the belief in democracy. Of course, whilst believing in democracy is a necessary condition of liberalism, it’s not sufficient. Socialists (and even some fascists) believe in democracy, and they certainly aren’t liberals. Liberalism requires other beliefs, such as the right to private property (which socialists reject) and the belief in human rights (which fascists reject).\n\nFeminism, then, is more than just the belief in equality under the law. The other beliefs varies depending on the school of thought, but they’re all united in sharing one fundamental claim: that we live in a patriarchy that privileges men at the expense of women. More specifically, they argue that femininity is seen as inherently inferior to masculinity, and thus, all gender issues are fundamentally rooted in misogyny. For instance, it’s socially acceptable (even celebrated) for women to act masculine (eg, tomboys), but men who act feminine or often punished for it (they might be denigrated with insults that compare them to women - ‘pussy’, ‘sissy’, etc.). You can likely name several films with relatively masculine women (Ripley from Alien, Sarah Connor from Terminator, etc.), but almost no feminine male heroes. Women are punished for being women, men are punished when they aren’t masculine enough.\n\nFeminists conclude that the patriarchy hurts both men and women, and thus, everyone should be feminists and dismantle the patriarchy. \n\n###Critique\n\nThe issue with this hypothesis, and progressive gender ideology as a whole, is that it promotes a massive asymmetry in the way we view men’s issues compared to women’s. Progressives claim to value gender equality, but in reality they end up reinforcing the most rigid form of gender essentialism, even more-so than modern conservatives. This can be seen both in their rhetoric and in the legislation/social policies they support. I will demonstrate this by examining popular rhetoric and arguments used by feminists and progressives.\n\n**Toxic Masculinity**\n\nA controversial term that has emerged in recent years, “toxic masculinity” refers to the harmful set of expectations placed on men that causes them to hurt themselves or others. For instance, men are expected to be stoic, and so they may be less likely to seek out help when they need it. Men are expected to sleep with women, so they may physically lash out when rejected, since sexual conquest is tied to their self-worth.\n\nMany progressives claim that opponents of the term simply misunderstand it, but in reality, the reason people dislike the term is because there is a hypocritical asymmetry since “toxic femininity” is never discussed. Progressives end up being the biggest reinforcers of the traditional “toxic” masculine roles they claim to oppose. \n\nFor instance, the male suicide rate is often condescendingly blamed on “toxic masculinity”. We get the typical spiels from mainstream media about how men are pressured to be stoic, and if they could just open up emotionally, the male suicide rate would drop. This is an utterly bizarre argument, because statistically women are actually more likely to attempt suicide than men (men are more likely to succeed), yet this is never blamed on “toxic femininity”. Notice how mainstream media never claims that women are conditioned to be hyper-emotional, and if they could just learn to suppress their emotions, the attempted female suicide rate would drop. \n\nConsider too that women tend to not report rape or sexual assault out of a sense of shame or guilt. Would any progressive claim this is a consequence of “toxic femininity” - that women are pressured to be sexually chaste and “pure”, and that explains the lack of reporting? If anyone were to actually make such an argument, those same progressives would likely call them a victim blamer, yet this rhetoric is completely acceptable when it comes to men.\n\nIn other words, men and women both share the same reasons for committing suicide or not reporting rape (eg, shame), but it’s only framed as a systemic failure for women. For men, it’s framed as an insecure shortcoming, that they’re letting the pressures of “toxic masculinity” get to them, and they should just “do better” and seek help.\n\nIt’s also worth noting that women reinforce these “toxic” gender norms just as much as men, but that’s never acknowledged by progressives. Consider the [controversial Gilette ad](https://www.youtube.com/watch?v=koPmuEyP3a0) from a few years ago, where they attempted to “tackle toxic masculinity”. In the entirety of the ad, only men are blamed for reinforcing harmful masculine gender norms, women are completely absolved (aside from a couple of audience members during the sitcom segment). In fact, [at one point the ad shows](https://youtu.be/koPmuEyP3a0?t=29) a male employee silencing a female employee - even when progressives try to talk about men’s issues, they can’t help but make it about women’s issues as well. \n\nThis asymmetry is more explicitly clear when you enumerate all the possibilities:\n\n* Man is sexist against man: Toxic masculinity\n\n* Man is sexist against woman: Toxic masculinity (not “toxic femininity”)\n\n* Woman is sexist against man: Toxic masculinity\n\n* Women is sexist against woman: Internalized Misogyny (not “toxic femininity”)\n\nWhen men receive sexism, it’s their “toxic masculine gender role” that oppresses them - in other words, they oppress themselves. But when women receive sexism, they are just simply victims to misogyny. If a woman tells a man to man-up, it’s considered toxic masculinity since it reinforces the traditional masculine gender role of stoicism. But if a man criticizes a woman for sexual promiscuity, it’s not considered toxic femininity, despite it reinforcing the traditional feminine gender role of chastity (in fact, it’s considered another instance of toxic masculinity). So whether men or women reinforce harmful gender expectations of either gender, it’s labelled “toxic masculinity”. The term essentially becomes synonymous with “sexism”. This is the fundamental issue people have with the term - the inherit conflation of ‘masculinity’ with ‘sexism’ - the asymmetry. \n\nThe great irony here is that progressives end up reinforcing the very traditional gender norms they claim to be against. That is, that men possess hyper-agency and can never be victims, that their problems are of their own causing, and that women are just helpless victims who do no wrong. \n\nIt's not surprising, then, that the biggest feminist messages to men in the last few years have just reinforced the traditional “toxic” gender norm that men should be protectors. Look at the United Nation's [#HeForShe](https://www.heforshe.org/en) campaign, that suggested men should essentially protect women. It's no different than telling men to \"man up\", it's just rebranded in woke packaging to make it palatable to progressives, and it works. Notice too that these demands are never asked of women (there is no #SheForHe). Progressive demand men to be traditionally masculine, whilst simultaneously criticizing them for it.\n\n**Patriarchy**\n\nThere is perhaps no term in modern discourse more useless or vague than “patriarchy”. It’s used as a buzzword by progressives (along with “capitalism” and “white supremacy”) to explain away almost any phenomenon in modern society. Earlier we defined the patriarchy as a social system that “privileges” men at the expense of women (or values masculinity over femininity), but the way progressives have abused this term borders on unfalsifiable tautology - framing all gender issues as women’s issues.\n\nAccording to progressives, if women commit more suicide than men, that's evidence that we live in a sexist patriarchy. But if men commit suicide more than women, that's also evidence we live in a sexist patriarchy, and this is an instance of the patriarchy hurting men. Men are given harsher sentences for the same crime? Actually that’s patriarchal backfiring, since society views women as having no agency. Women get custody more often? Well that’s because society views women as the caretaker, so it’s actually misogyny. Only men are drafted? Of course, society views women as weak and incapable - misogyny. No matter the outcome, it's always framed as patriarchy/misogyny, it’s just taken as an axiomatic truth.\n\nTo test whether a claim is vacuous, a useful exercise is to reverse the situation and see if the conclusion still holds. Suppose we lived a society where gender roles were reversed. Men would have issues with domestic violence, date-rape, representation in politics, wouldn’t be taken as seriously in the workplace, catcalling, were judged more for their looks, etc., and women would have a higher suicide rate, get harsher prison sentences for the same crime, get worse school grades for the same work, it would be legal to cut off their clitoral hoods at birth and suck their genital wounds (the male equivalent would be “oral suction circumcision” - yes this is an actual thing).\n\nWould anyone look at such a society and deem it an “oppressive matriarchy” that “privileges” women over men? If not, then why is it when the roles are reversed (as it is in our society) it’s deemed as an “oppressive patriarchy” that “privileges” men over women?\n\n**Male Privilege** \n\nProgressives are also very selective when they examine gender inequality, largely overlooking men’s issues, or even framing them as a privilege.\n\nConsider the gender wage gap. Progressives/feminists argue that the reason women earn less than men is because of sexist social pressures that encourage women to be stay-at-home mom’s and discourages them from higher-paying careers. Whether this is truly the result of sexism or biological predispositions is not what I care to discuss, but what is interesting is that the other side is never talked about; that is, that men are socially pressured to earn money. Consider if the roles were reversed; suppose men were pressured to be stay-at-home dad’s and take care of the children, whereas women were pressured to work dangerous jobs, work overtime, and would be considered deadbeats otherwise. \n\nIf this were the case, there would be no discussion of a gender pay gap for men. Instead, we would hear of a gender labor and death gap for women. We would hear complaints that women were expected to work more hours than men, expected to take physically dangerous work, and die more often on the job. We would get statistics about how “on average, women work X amount of hours more than men in a year”. We would hear about the negative health consequences of stress and working overtime, the toll that being the primary breadwinner has on a person, how men need to “step up” and stop placing the burden of income on women alone. Yet, when this expectation is placed upon men, there is zero discussion about the burden of being the breadwinner - in fact, quite the opposite, it’s framed as a privilege.\n\n**”But the Patriarchy hurts men too!”**\n\nOne popular talking point among progressives is that the “patriarchy” hurts men as well, and that critics of feminism mistake “patriarchy” as synonymous with “men”, but this is far from the truth.\n\nConsider the recent overturning of Roe v Wade. To be clear, I think the ban is wrong, but the response from many feminists is telling; they immediately jump to blaming men, despite the fact that men and women [share similar views](https://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion) on abortion. Abortion is split among political lines, not gender lines, and despite progressives wishing the opposite, conservative women do exist.\n\nSo here we see the hypocrisy. On one hand they will claim that the patriarchy hurts men and women, and therefore feminism ought to be accepted by men. Yet, as soon as women are hurt by “the patriarchy”, the blame is immediately put on men, despite the fact that women reinforce/uphold harmful gender norms just as much as men. The fact that plenty of women supported the ban is ignored in favour of a convenient “male bad” narrative.\n\nSimilarly, if the “patriarchy” ends up hurting men, women’s agency/responsibility is totally ignored, and thus, the blame will lie on men. The term “patriarchy” becomes synonymous with “men”, with progressives blaming all of societies shortcomings on men alone.\n\nIf the hypocritical rhetoric is bad, the hypocritical institutions are far worse. Self-proclaimed feminist organizations like the United Nations (which claims to stand for gender equality) [finances the genital mutilation](https://news.un.org/en/story/2011/12/397192-un-launches-plan-accelerate-male-circumcision-aids-prevention-africa) of men in the Third World. whilst condemning the same mutilation of women. Then, that very same institution has the audacity to suggest that “men aren’t doing enough”, that “men need to stand against sexism”, and proceed to roll out initiatives like #HeForShe.  \n\nIt’s also worth noting that in the case of circumcision, the discarded foreskin is sometimes used to [produce skincare products](https://thesun.co.uk/fabulous/7836602/foreskin-facial-kate-beckinsale-how-serum-made/) for wealthy celebrities and socialites (likely the same that virtue signal about how misogynistic our society is). Could anyone imagine if male celebrities used skincare products derived from the skin tissue of amputated clitoral hoods from infant girls? Doubtless we would have international outrage and academic discourse about the “commodification of the female body” and whatnot. When it happens to men - radio silence (or mockery).\n\n**Progressives use right-wing rhetoric when it comes to men’s issues**\n\nMen’s issues are dismissed by progressives in the same way black issues are dismissed by conservatives. For instance, progressives blame the fact that men are more likely to be victims of violent crimes on other men, since men commit the majority of violent crime. Notice how this is no different to when conservatives blame black issues on black people. Compare “but it’s mostly men killing other men” to “but it’s mostly black people killing other black people”. Would progressives be okay with terms like “toxic blackness” to describe the negative aspects of black culture - eg, high crime rate, lack of fathers, misogyny in rap music, etc?\n\nConsider the fact that men are given harsher sentences for the same crime, compared to women. Feminists would argue that this is because society assigns hyper-agency to men and views women as weak and infantile, thus, men get harsher sentences. They would argue this is an example of how sexism against women ends up hurting men, that this is our patriarchal society “backfiring” on men. But notice that this logic completely falls apart when you swap gender for race. For instance, black people are sentenced to harsher sentences for the same crime compared to white people. Would any progressive unironically argue that this is because society views white people as weak and incapable, and thus this is an example of how racism against white people ends up hurting black people, that this is our “black supremacist” society backfiring on black people? The latter would be rightfully ridiculed, whereas the former is accepted and taught in sociology classes.\n\nUnder the feminist framework, it’s okay to blame men’s biological predispositions to dismiss male violence / male victims of violence, but don’t you dare suggest that those same biological predispositions may explain why men are more likely to be CEO’s. In other words, men’s failures are their responsibility, but their successes are not - their successes are the result of sexism, they’re illegitimate. (To be clear, I am not suggesting that biological predispositions are indeed the reason why men are more likely to be CEO’s; I am merely pointing out the hypocritical reasoning)\n\n\n**Media**\n\nSo how are men’s issues talked about by the media? Well, for the most part, they aren’t. But when they are, it can vary from blaming men for their issues (the typical spiels on toxic masculinity) to outright hostility.\n\n“Progressive” media outlet, Slate, once [ran an Op-Ed](https://slate.com/technology/2013/09/intactivists-online-a-fringe-group-turned-the-internet-against-circumcision.html) where they characterized and straw-manned the entire anti-circumcision movement as nothing but unhinged freaks, comparing them to anti-vaxxers. The article goes into great length smugly psycho-analyzing the motives of these activists, not even pretending to show balance or their side of the argument.\n\nThe United Nations absurdly claimed that [women would be the most impacted](https://www.cnbc.com/2022/03/11/un-women-says-russia-ukraine-war-exacts-high-price-from-women-girls.html) in regards to the invasion of Ukraine, despite men (some still being in high school) being banned from leaving the country. Evidently, men being forcibly conscripted to fight and possibly die doesn’t count as gender-based violence. It’s also worth noting that the UN emphasizes girls specifically, rather than all child refugees (boys and girls). Again, this is the same institution that tells men they just need to “do better” and stand up against inequality. \n \nVice, another “progressive” outlet, [recently wrote an article](https://www.vice.com/en/article/y3vx8k/south-korea-incel-gender-wars-election-womens-rights) about the South Korean election, titled “Young, Angry, Misogynistic, and Male: Inside South Korea’s Incel Election”. \n\nTo summarize, the article describes how anti-feminist rhetoric has emerged as an electoral campaign topic among the populist candidate Yoon Suk-Yeol (in fact, he won the election as of writing this). The article mentions how these male voters feel disenfranchised from South Korean society, given the blatant double standards. For instance, military service is mandatory for men when they finish high school, but not for women. This means men have to abandon their families for 1.5 years while women get a head start in their careers. The candidate, Yoon, vowed to abolish the Ministry of Women, a division of the government concerned with women’s issues. Aside from some vague mentions of political bias and claims that the ministry “treats men like criminals”, the article never describes why he wants to abolish it, or why the voters want him to abolish it, it’s just taken as a presupposition that the Ministry is fair and just. \n\nThat’s it. That’s the entire article. This, according to Vice, makes you a “misogynistic incel”. We’re so deeply-entrenched in “progressive” gender politics that merely pointing out the double standard that men must do mandatory service is enough for “progressive” outlets to label you a women-hating incel. There’s not a single man they interview in the article that express any entitlement to women. Just being opposed to the hypocrisy makes you an incel apparently.\n\nIt’s totally possible that the candidate is indeed a misogynist or has sexist policy positions - I don’t know much about South Korea - but the greater point here is that the article never mentions any of this. According to the internal logic of Vice, men merely being upset at blatant double standards is enough for them to be labelled misogynistic incels. It’s also worth noting the hypocrisy of these “progressive” media outlets in labelling young men who are rightfully upset about being discriminated against as incels, despite these same outlets decrying how widespread “toxic masculinity” is, completely oblivious to how they reinforce it by characterizing any man who points out male discrimination as being a bitter, angry virgin.\n\nNone of these articles were hard to find. I found the first one through a basic google search, and the other two from trending twitter/reddit posts. There are dozens of more like this written every year, this was just a small sampling of how ridiculously hysterical progressive media is towards men’s issues.\n\n**Nice Guys**\n\nSpeaking of incels, the entire phenomenon of \"nice guys\" (men who disingenuously befriend women in an attempt to sleep with them) is ironically exacerbated by the very same \"progressives\" who claim to want to \"liberate\" men from their confined gender roles.\n\nProgressives, and mainstream media as a whole, demonizes male sexuality, characterizing it as creepy or predatory. Consider again the controversial Gilette ad from a few years back. There's a [scene where a man goes to approach a woman](https://youtu.be/koPmuEyP3a0?t=56), and then is stopped by his friend. It's the middle of the day, broad daylight, busy street, etc. so the woman is in no danger, yet according to progressives, even approaching women in public is problematic nowadays.\n\nIt’s no surprise that teenage boys take these messages to heart - that they’re inherently predatory and must suppress any desire to be blunt or forthcoming with what they want. They act amicable, nice, and passive, because that’s what they were told to do, and more importantly, they don’t want to risk being branded as a creep or sexual predator. When this inevitably doesn’t work out, they express frustration, and then the very same group that told them to act that way demonizes and mocks them for it.\n\nIt’s no surprise then why figures like Jordan Peterson and Andrew Tate get popular. The right-wing gives an alternative to alienated young men that doesn’t demonize them for being born with a penis.\n\n###Conclusion\n\nThe message from progressives/feminists is clear. Women’s issues are caused by society, and so society must change to accommodate women. Men’s issues are caused by men, and so men must “do better” and change to accommodate society. Women’s issues are systemic - men’s issues are individual failures. Social change for women - pull yourself by your bootstraps for men. \n\nUnder the feminist framework, sexism against men is framed as male privilege, whereas sexism that benefits women is framed as female oppression (consider the term “benevolent” sexism - even when women benefit, they’re still victims). Their rhetoric and language portray a victim narrative for women, and an oppressor narrative for men, no matter the circumstance.    \n\nAt the heart of progressive gender ideology is this absurd notion of trickle-down equality - that if we just focus on fixing women’s issues, men’s issues will just magically solve themselves. As time has come to past, it’s clear that this is simply not true. Women have made great strides in almost all sectors of life, whereas men have stagnated or even regressed, usually as the result of questionable social policies created in the name of “equity”. It is now blatantly clear that schools discriminate against male students for the same work compared to women, that universities and employers favour female candidates, and that ironic misandry is tolerated (even encouraged) in the public sphere, but even mentioning this is considered controversial. \n\nProgressives and feminists fundamentally view gender equality as a zero-sum game. Attention and resources given to men’s issues are resources that could be used towards women’s issues. In doing so, they must frame any good-faith opposition to their absurd ideology as right-wing reactionaries (take the “Manosphere” for instance - a new buzzword that lumps mass murdering incels with pick-up artists and men’s right’s activists - despite these groups having almost nothing in common). \n\nAll of this goes to show what is essentially tantamount to gaslighting on a global scale. \n\n“The patriarchy hurts both men and women” - but women’s issues are the only one’s taken seriously, whereas men’s issues are treated with condescension (or ignored). \n\n“Both genders reinforce harmful gender norms” - but only men are told to change, whereas women are assumed to be perfect.\n\n“We should encourage men to speak up about gender issues” - but if they do they’ll be labelled a misogynistic incel.\n\n“Feminism is for men” - but feminist organizations actively support blatantly anti-male legislation and policies (eg, UN financing male circumcision in the Third World).\n\nThe progressive hostility towards men’s issues is directly responsible for the rise of people like Andrew Tate, and I fully expect more figures like him to gain popularity in the near future. It’s hard to express just how frustrating it is to see even the most trivial of women’s issues discussed ad-naseum by progressives and mainstream media (eg, female multimillionaire actresses make slightly less than their male counterparts), whereas some of the most egregious human rights violations still being legal to commit against men is totally ignored, or even supported. The progressive failure has obviously reached a tipping point now - red pill content has exploded in popularity over the last year, and when the pendulum swings back, I expect there will be a fierce overcorrection from progressives. Unless progressives become willing to actually discuss men’s issues, things are only going to get worse, but chances of that seem slim.",
    "title": "[Essay] Progressives/Feminists are bad at talking about men’s issues",
    "subreddit": "MensRights",
    "timestamp": 1680527489,
    "score": 64,
    "keyword": "black ceo"
  },
  {
    "text": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones Historically men have always been the problem-solvers for most of human existence. Men have always been counted onto to be problem-solvers because for the most part because we are hardwired to detect what is wrong with our environment or location. So I feel like when the industrial revolution came about to be, society counted on us to be not only problem-solvers, but also example-setters, the role models, the innovators, in other words, historically men fought tooth to the nail to try to make the world a safer, healthier and more stable place\n\nSo when the Industrial Revolution came to be, this put more pressure on men to be even more ''advancing'' and ponderous on to the grid and infrastructure of society, so we naturally have inclined to depend on men not only for advancing society, but to be the prime example-settlers for people to follow. I think that might be part of why we put so much pressure on men to be established and groomed by a certain age, where as women don't face those very same productivity pressures. I mean sure obviously people will judge a woman if she's being what they call a ''leech'' on the system, but for the most part what I am saying is they don't really get hit with the memo of hustle culture to the same degree men do, no one is going to judge a woman for working at McDonald's more than her being a nurse, but for a man that implies lack of intrinsic worth and respect and a good work ethic.\n\nI noticed this also disturbingly amongst ethnic minority male groups, whether it is the ''trabajador'' culture in the Hispanic community or the ''Be a baller'' mentality in the black community or the Silicone Valley Techie trope in the Indian community, I think those pressures are even more pronounced among men of color, but gonna try to refrain from over-emphasizing, I think you get my point though.\n\nBut this is also mostly used against working-class men, for example no top CEO in a fortune 500 company is gonna be told that their hard work doesn't pay off, even if they ended exploiting the resources along the way.\n\n&#x200B;\n\nI believe this to be a men's rights issue because since the working class consists mostly of men, this keeps the average man in the trenches",
    "title": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones",
    "subreddit": "MensRights",
    "timestamp": 1682608588,
    "score": 18,
    "keyword": "black ceo"
  },
  {
    "text": "Ellen K. Pao and her feminist work as the CEO of Redddit, and how people strove to oppose her for it &#x200B;\n\nhttps://preview.redd.it/l0s9lk47jmrb1.jpg?width=1056&format=pjpg&auto=webp&s=a46f1883a985b5c41b9fe644bfbc4d1b4a96c62c\n\n Casual reminder that while she was CEO at Reddit she created a salary negotiation policy that evened the playing field for women employed by Reddit.\n\nNot-at-all-casual-reminder that she left Reddit in 2015 after being forced to resign because Reddit lost its collective \\*\\*\\*\\* at her when the site banned 5 subreddits for harassment; not-at-all casual reminder that Ellen Pao was the CEO of Reddit when it banned revenge porn after The Fappening.\n\nOne of the subreddits that was banned that led to her resignation was r/fatpeople hate. The others were transphobic and racist. \n\nIn her time at Reddit Pao did more than the site had ever before done to fight harassment from its user base and for that someone started a subreddit calling for her firing and trying to make nazi and ISIS imagery come up in searches associated with her name.\n\nIf \\*anyone\\* in the tech industry knows what the [blackpill subculture](https://href.li/?https://rationalwiki.org/wiki/Manosphere_glossary#Black_pill) is like and how vile and toxic groups spawned in subreddits can be it’s Ellen Pao.\n\nThis isn’t someone who’s oblivious to the fact that her former company is a source of the problem, this is someone who is speaking from personal experience with online harassment campaigns orchestrated by people who want the freedom to post celebrity nudes who were \\*enraged\\* that she made it harder for them to do so. \n\n(also basically the rest of her twitter is about #metoo, the need for labor regulation and worker protections, and salary transparency so maybe go check her out)",
    "title": "Ellen K. Pao and her feminist work as the CEO of Redddit, and how people strove to oppose her for it",
    "subreddit": "Feminism",
    "timestamp": 1696180480,
    "score": 32,
    "keyword": "black ceo"
  }
]