[
  {
    "text": "Job hunting is pretty comical Romanian here. I'm not sure how it is for other countries, but going through the recruitment processes of any kind of company that has an office in Bucharest is one of the funniest things ever. Of course, it's not \"haha\" funny, it's more like giving yourself a nudge in the head at how laughably predictable HR and hiring managers are.\n\nFirst off, any job that has \"x\" positions available has a huge luck factor included in it. Since there is a surplus of candidates literally everywhere, you can be rejected for anything, literally anything.\n\nNot smiling enough, smiling too much, not smiling with your eyes, having a buzz cut, having too much hair, not having your hair tied up, having your hair tied up, not shaving, being too eager, not being eager enough, interrupting the interviewer once, asking too many questions not asking any questions, daring to even ask a question, trying to negotiate your pay, not trying to negotiate your pay, not being a student, not being a recent graduate, not knowing  the company's core values, not following the company on linkedin, having tattoos, not having pets, having pets, living with your parents, having noisy children or roommates, living in a rural area, living in a ghetto, being unemployed for more than 2 months, BEING EMPLOYED (lol i swear to god), scoring less than 70/100 on logic tests, scoring less than 80/100 on logic tests (yes, I have gotten both reasons), being white, being black, being male, being female, being a foreigner, being a fucking native, not knowing english, KNOWING TOO MUCH ENGLISH, going through a divorce, going through a family funeral, saying \"hello\" instead of \"good morning/afternoon/evening\", being too skinny, being too fat, having pimples, wearing too much makeup, wearing no makeup at all, not knowing how to apply makeup, wearing makeup as a male, not being in an enclosed space when you have an interview (zoom), being too quiet, being too loud, nodding too much, saying \"mhm\" too many times (have you ever heard of active listening, man?), not saying enough about yourself, saying too much about yourself, not having good teeth, not having trimmed nails, not blurring your background on zoom, blurring your background on zoom, liking to play video games, looking too much like a gym bro, not knowing who the CEO of the company is, liking fast food, not liking fast food, not liking vegan fast food and liking mainstream fast food, not having experience, having too much experience, not having enough experience, not having experience on one of the 8 different tools the job requires you to use, being overqualified (this is having too much experience and also knowing all the tools and processes, i guess), having worked for the company before, not having worked for any company so far, having worked for too many companies so far, having too many colleges under your belt, having only one college under your belt, not having gone to a prestigious college, mumbling too much when you solve a test, CLEARLY EXPLAINING WHAT YOU ARE DOING ON A TEST WHILE YOU ARE SOLVING IT AND APPEARING ARROGANT BECAUSE OF IT, being in more than one hiring processes (you mad because I want more options?), NOT BEING IN MORE THAN ONE HIRING PROCESSES (what the fuck, you drones have literally gone crazy), having beady eyes (lol, i just didn't get enough sleep), not having a signature when you reply to an email, having the audacity to reschedule an interview, having a weird name, having your resume give off a \"weird vibe\" (??????), not putting effort in your resume, putting too much effort in your resume, having worked for a shady company, not putting the shady company you have worked for on your resume, having wet hair (yea i just got out of the shower, excuse me), BEING \"EXPRESSIONLESS\" FOR THE FIRST 5 SECONDS OF THE VIDEO INTERVIEW BECAUSE OF INTERNET LAG, not wearing a tie, not wearing a business shirt, not wearing a normal shirt, not laughing at the interviewer's stupid joke, saying you checked out the reviews of their company (which are obviously bad, but even if you don't say so, they'll realize), NOT CHECKING OUT THE REVIEWS OF THEIR COMPANY (oh, so if you have good reviews, I'm in the wrong??), saying you didn't check out their reviews, but you actually did, you just didn't want the convo to go here; them being a bit disappointed in the fact that you didn't and you backtrack and say you actually did tho but now they think you're not trustworthy (can we just stop with the reviews, hr, please?), not wanting to do a polygraph test, doing a polygraph test and being rejected for the fact that you have friends that smoke weed (whoever came up with this idea for a software developer interview should be have his feet tickled for eternity).\n\n&#x200B;\n\nOk, so I did embellish a few of those. You can kind of guess what, but most of those are accurate representations of what's going through a recruiter's head (or a hiring manager's head) when they're thinking of rejecting you. This isn't something I came up with on my own, these are actual reasons that I've heard from friends that work for the companies I applied to and recruiters that I've talked with (or eavesdropped on).\n\nGood luck on finding that dream job guys. Love\\~",
    "title": "Job hunting is pretty comical",
    "subreddit": "jobs",
    "timestamp": 1630065569,
    "score": 2,
    "keyword": "black ceo"
  },
  {
    "text": "Walgreens said Tuesday it has tapped Starbucks executive Roz Brewer as its new CEO, which will make her the only Black woman leading a Fortune 500 company | cheers for her achievement",
    "title": "Walgreens said Tuesday it has tapped Starbucks executive Roz Brewer as its new CEO, which will make her the only Black woman leading a Fortune 500 company | cheers for her achievement",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1611804265,
    "score": 1240,
    "keyword": "black ceo"
  },
  {
    "text": "Misogynistic Brandy Melville CEO fires anyone who isn't white and thin in their clothing stores, sent employees a picture of the show Happy Days with the caption, “There were no Black people in this show—that’s why it was called ‘Happy Days.’” Story here: (TW, sexual assault, racism, body shaming)\n\n[https://nypost.com/2021/09/07/brandy-melville-ceo-doesnt-allow-black-or-fat-girls-to-work-in-his-stores-report-claims/](https://nypost.com/2021/09/07/brandy-melville-ceo-doesnt-allow-black-or-fat-girls-to-work-in-his-stores-report-claims/)\n\nEven brands like Abercrombie and Fitch are super inclusive nowadays (if you only remember them from the 2000s and early 2010s, go look at their website, you'd probably be very surprised!), but one brand that has not caught up with the times is Brandy Melville. I always thought something was wrong with their one size fits all policy : clothes were made so that if you weren't the right size, you were SOL. \n\nIt's so irritating how this is legal, and how the CEO was never help accountable for his actions. Seriously, why is what he's doing legal?",
    "title": "Misogynistic Brandy Melville CEO fires anyone who isn't white and thin in their clothing stores, sent employees a picture of the show Happy Days with the caption, “There were no Black people in this show—that’s why it was called ‘Happy Days.’”",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1639350637,
    "score": 338,
    "keyword": "black ceo"
  },
  {
    "text": "Anonymous writings of a covid nurse - part 2 *One…two…three…four…five…six…seven….*\n\nIt takes me exactly three hundred and eighty-seven steps to walk the entire loop of my unit and arrive back where I started. I should know…I’ve counted it hundreds of times by now.\n\nBack in the days before when I could find the time, I would toss my Vocera at any willing coworker and meander around campus for fifteen minutes or so to get a break from the demands of being a bedside nurse. I’d wander outside to the employee patio and get a glimpse of the sky, sit next to the fountain, enjoy the sun a bit. Maybe pick my way through the gift shop and buy some trinket to bring home to my daughter. Sometimes I’d go visit my friends that had transferred to other floors. Such social calls were normal back then. It wasn’t always possible of course, but before all of this it was possible to find the time more often than it wasn’t.\n\nIt started with a single patient at first. Then it was two. Six. Fourteen. They’ll only be placed in negative pressure rooms, it was announced. That lasted for approximately five days. Then any positive case requiring less than six LPM were allowed in standard rooms. Thirty-five. We can handle it, our CEO proclaimed. There were plans in place. Fifty-three. Elective procedures were cancelled. PPE was short, you’ll need to reuse your N95. Place it in this brown paper bag and keep it on your iso carts. Nono, it’s perfectly safe, probably. Seventy-nine. Units were locked. Patient loads were getting top-heavy and cumbersome to manage. Incentive pay was announced. Then increased. Then increased again. One hundred and four. “Heroes work here” signs. Codes overhead every hour, the sickening feeling of ribs breaking under your hands. Exhaustion. Difficulty sleeping. Two hundred and twenty-two. So many stroke alerts. The sound of families sobbing over Zoom as their loved ones gasped their last breaths. Two hundred and fifty-four. Will this fucking pager ever *stop beeping.* Single rooms are now doubles, a Black Friday two for one. Two hundred and ninety-nine. Coworkers are getting sick at an alarming rate. Anna’s on the vent in MICU waitlisted to be transferred to a different facility for ECMO because we’re at capacity. Chris was just admitted, he’s on IMCU riding the vapotherm and looking like shit. Three hundred and thirty-one. Blistered feet. Nine days in a row and three more on the schedule. Crash intubation after crash intubation. The claustrophobic feeling of drowning in patients, tasks, and dexamethasone. Three hundred and eighty-eight. Bleeding cuticles, grinding teeth without noticing until your jaw aches. How can this continue? How can this…how….\n\n…\n\nAnd just when I thought this whole godforsaken house was about to collapse, it began to ease.\n\nI took to pacing my locked unit like a caged tiger after the last wave crested, turning corner after corner within the same four walls. There was still no time for campus walks anymore, and we were forbidden that sort of freedom of movement anyway. But by then it felt like a cardinal sin to sit down and do nothing. Returning to some semblance of normal didn’t quite feel normal to me yet. Instead, my usual fifteen minute cool-down period had turned into a way to expend bottled anxiety and energy.\n\n“Getting your steps in, Taylor?” my coworkers would ask.\n\nI’d fake a smile, nod, and keep going.\n\nTwo hundred and five. I cut down to a normal amount of overtime. One hundred and seventy-one. My arm hurt like a motherfucker after that vaccine. Ninety-eight. Electives resumed. Sixty. Floors were converted back to their original service designations. Fourty-four. My dad, full of optimism and synthetic mRNA, visited for the first time in eleven months. We drank a beer on the patio and laughed at the absurdity of the cardboard cutout fans in the stands of the game we were watching. Twenty-seven.\n\nIt’s oddly quiet around here now. The amount of emails I receive from administration have dropped off precipitously. During the surge, I would count the number of red-orange covid isolation signs taped to the doors on my daily prowls. At one point they adorned every single room.\n\nToday, I count three.\n\nIt feels as if the dust has settled a bit. The place looks normal but has the same palpable tension as an empty street, littered with the broken glass and spent tear-gas cannisters that inevitably follow a riot. We may have swept the debris into the gutters, but the memory of the event hangs in the air like the lingering scent of sulphur. The faces of my colleagues are no longer so worn. We’re all dealing with what we’ve seen in different ways. Some are dealing better than others. Some aren’t dealing with it at all. A stoic few deny there’s anything to deal with in the first place. This is what we do, they scoff. This is what we’re here for.\n\nI don’t know where I fall on this spectrum.\n\n“Try not to focus on all the lost causes,” my favorite tech instructs me after we rambled a bit on the topic at lunch. “I mean…have you thought about all the ones we saved?”\n\nI pause. It’s so easy to focus on the negative that I’m ashamed to admit I haven’t.\n\n“What about that one guy that was in bed 3 forever?” she continues. “You discharged him on New Year’s Day. He’d been on a vent for like two weeks. That was pretty amazing.”\n\nIt was, I agree.\n\n“And remember Mrs. Graham, or Garman, or…whatever her name was. She was here for over 90 days and walked out under her own power without oxygen.”\n\nI must have taken care of her at least a dozen times or better and I’d completely forgotten about her. Unbelievable.\n\nI spend the remainder of my two scheduled shifts catching my coworkers during lulls and asking them about their saves, too. Ashley tells me about Mr. Sacks who she discharged to LTACH. He’s walking now, she quips. Casey reminds me of another patient who was able to have their trach and PEG discontinued before leaving. That guy that had the stroke while SAPed? We thought he’d leave in a body bag but he’s back to work. And we all remember our most memorable case, a failed compassionate extubation that sent a freakin’ Christmas card to the staff after breezing through rehab.\n\nThe stories start piling up. Five. Twelve. Twenty-eight. I stop counting and catch myself smiling, feeling lighter than I have in a year.\n\nIt’s unrealistic to think that any of us will ever be exactly the same as we were before living through these times. God knows I won’t. But at least now, I can view these memories like a coin. One side contains all of the anger, the hurt, and the sheer misery that we were forced to stomach as we performed our duties. But the other? It holds the precious victories, the joy we saw on our patient’s faces as they left our facility. The times we went toe to toe with death and won.\n\nI’m back at work tomorrow morning. Maybe I’ll skip down to the fountain, take my mask off, and sit for a bit. It's past time to see if things still looks the same.",
    "title": "Anonymous writings of a covid nurse - part 2",
    "subreddit": "medicine",
    "timestamp": 1618002070,
    "score": 1187,
    "keyword": "black ceo"
  },
  {
    "text": "It’s my cake day, *itches. I don’t know, I’m just thrilled to have survived this far.  Got my multistate licenses approved. Moving to Georgia to work maternity after years of wanting to help with the lack of care ESPECIALLY for African American women.  And now I’m doing it.  I will be hands on with my patients in a low income, high minority area to give these women the love and care they DESERVE.  (Their pain is VALID.  If they say something isn’t right we INVESTIGATE WHY.  I hope my diligence saves lives).  This whole mission started by making friends with the CEO of “Femly” who is a young beautiful black woman who lost her first baby and nearly her life because she was ignored and now makes wholly organic feminine products.\n\nAnyway.  It’s my cake day.  I survived the first year and landed exactly where I wanted.  Yay!",
    "title": "It’s my cake day, *itches.",
    "subreddit": "nursing",
    "timestamp": 1616394174,
    "score": 20,
    "keyword": "black ceo"
  },
  {
    "text": "Should I cancel my interview? Hi everyone,\n\nHappy Wednesday!\n\nFirst time poster looking for input/advice/etc. I humbly ask that responses be kept kind (which is not to say they cannot be constructive - I will be mentioning political perspectives below so I just wanna keep it nice, yannow?). Also this post is long, so I will include a TL;DR at the bottom.\n\nA bit of backstory - I voluntarily left my job back in January due to burnout and mental health concerns. I anticipated taking a few months off for some R&R (I did this two years ago and had great success) and then I planned to jump back into the job market.\n\nIt's no surprise that the job market is bleak, to say the least right now. I do have a Bachelor's degree but it's not very useful. My professional experience has been in the nonprofit sector and then for a local credit union - one of which doesn't pay the bills, and the other which requires that I take an in-person job with minimal COVID protections.\n\nI recently turned down a job offer because about 1/3 of my job interview was meant discussing that I would need to get onboard with no masks, social distancing, vaccine verification, etc. at the job which I can't do for my own health and the health of my partner.\n\nEthics are VERY important to me when it comes to accepting a job, as much as they apply in a capitalist system. This, again, poses an additional challenge on top of needing to be compensated fairly and minimize contact with the general public for health reasons.\n\nQueue the problem - I have a phone interview for a company on Friday. The job is fully remote, it's email-only customer service (which is my favorite), it's a local company, and the pay is well above market rate.\n\nSince I'm new to Reddit I decided to see if this company has a subreddit - which they don't, but the good people of Reddit linked several screenshots/articles/tweets stating that the CEO repeatedly donated to a very volatile (and very orange) former president, has openly bashed a former presidential candidate that I supported, AND is anti-LGBTQIA+ (and their statements about the BLM left something to be desired, almost as if they just discovered Black people have opinions).\n\nI'm not ignorant to the fact that most CEOs vote a particular way. But given that this CEO runs a small but successful company AND has made multiple decisions that actively harm communities I am either a part of and/or support...it just isn't sitting well with me.\n\nSince I've been unemployed for 8 months and didn't qualify for unemployment, I obviously need to make some job decisions in the near future. Savings can only carry me another couple of months or so.\n\nFinally, the question - should I cancel my interview? Should I accept that any for-profit companies are likely going to have similar C levels? Are my expectations too high?\n\nThanks for reading this far if you have, and heck - even if you skimmed I appreciate it.\n\nJust feeling like my moral compass and my need to eat are constantly at odds.\n\nTL;DR: found out CEO of company I'm trying to get hired at is anti-LGBTQIA+ and pro-bad orange man and it's not sitting well with me. Looking for advice.",
    "title": "Should I cancel my interview?",
    "subreddit": "careerguidance",
    "timestamp": 1631153649,
    "score": 1,
    "keyword": "black ceo"
  },
  {
    "text": "Are we actually gonna see the complete globalization of the tech industry? Well, I'm not sure that I am allowed to question here.I am actually on the learning programming phase- enrolling in a college soon.\n\nSo Everyone is going remote nowadays.So, what stops it from going global. And I'm not talking about spegatti coders or incompetent people (Although that's usually what peanuts gets), what I'm trying to say that for the same job in the same level a 100k job in America is  10k here- end of story. So if they pay me let's say 30k and another 20k from  them in tax and crap.But still it's a win win situation for both.\n\nI mean corona fucked everything up.It has definitely globalised me and millions of others.So instead of paying local tutor, I'm accessing the top uni courses, downloading their textbooks and following that curriculum and planning to grind the same leetcode.The culture has been also  quite neutralized in the few years.So if I'm in the mainstream American learning system,can I enter the job market as well?\n\nI mean not now.But think about next five years.We already see big companies doing it .Even have non American CEO.So will the smaller ones follow?\n\nlike what's your opinion and thoughts.Knowing I'm studying for 50k vs 10k is a big difference.One can make you sit in front of the black screen day and night,but the other is not so exciting",
    "title": "Are we actually gonna see the complete globalization of the tech industry?",
    "subreddit": "cscareerquestions",
    "timestamp": 1639992110,
    "score": 0,
    "keyword": "black ceo"
  },
  {
    "text": "Leon Black (CEO and Founder of Apollo $24 billion private equity and alt asset mgmt firm) paid Epstein $158 million for \"tax advice\"....but Apollo pays EY around $2 million a year to do their taxes? head scratcher, yes?",
    "title": "Leon Black (CEO and Founder of Apollo $24 billion private equity and alt asset mgmt firm) paid Epstein $158 million for \"tax advice\"....but Apollo pays EY around $2 million a year to do their taxes?",
    "subreddit": "Accounting",
    "timestamp": 1622600857,
    "score": 33,
    "keyword": "black ceo"
  },
  {
    "text": "First Week as Director of Finance in a small non-profit Good Evening everyone,\n\n&#x200B;\n\nFirst up I am going to cross post this to a couple reddits since it does not seem to have a specific place that is perfect for it, if you have a suggestion of another reddit to post it to that would be better please let me know!\n\n&#x200B;\n\nBit of background:\n\nI started a position as director of finance for a small (5 staff, 50 faculty) non-profit this week. There is no direct handover of duties from the previous director who left about a month before I started.  The CEO has enough experience with the systems to work through the payrolls in between and some bills were paid but not entered anywhere.  With the small staff I will be managing everything from basic bookkeeping to working with the finance committee of the board. \n\n&#x200B;\n\nMy Current plan\n\nI am going to focus on getting the items entered that were missed, learn how to do payroll and process that and then close the month of March since that has not happened yet.  After that I want to get through to the audit at fiscal year end in June.  Beyond that I would like to make some larger changes but that is for some other post in the future. \n\n&#x200B;\n\nMy Questions:\n\n1. Where would you start?  There is a ton of information to take in and a lot of work to be caught up on.  What would you start with?\n2. What would you plan to do in the first week? Month? Year?\n3. Does anyone have any experience with the BlackBaud program Financial Edge? 99% of my experience is with quick books and sage. Any tips or tricks for this program would be appreciated. It is an older version since they have not paid to keep up with it, 7.8 I believe. \n\n&#x200B;\n\nI would greatly appreciate any help and all thoughts and ideas are welcomed!",
    "title": "First Week as Director of Finance in a small non-profit",
    "subreddit": "Accounting",
    "timestamp": 1618277875,
    "score": 1,
    "keyword": "black ceo"
  },
  {
    "text": "Rosalind Brewer officially takes the helm at Walgreens, becoming the only Black woman Fortune 500 CEO",
    "title": "Rosalind Brewer officially takes the helm at Walgreens, becoming the only Black woman Fortune 500 CEO",
    "subreddit": "blackladies",
    "timestamp": 1615833317,
    "score": 77,
    "keyword": "black ceo"
  },
  {
    "text": "Walgreens CEO Rosalind Brewer on being one of two Black women heading Fortune 500 companies",
    "title": "Walgreens CEO Rosalind Brewer on being one of two Black women heading Fortune 500 companies",
    "subreddit": "blackladies",
    "timestamp": 1620250912,
    "score": 27,
    "keyword": "black ceo"
  },
  {
    "text": "Breaking The ‘Concrete’ Ceiling: Roz Brewer To Become The S&P 500’s Only Black Female CEO",
    "title": "Breaking The ‘Concrete’ Ceiling: Roz Brewer To Become The S&P 500’s Only Black Female CEO",
    "subreddit": "blackladies",
    "timestamp": 1611945908,
    "score": 24,
    "keyword": "black ceo"
  },
  {
    "text": "Am I wrong? So, I work in a predominantly white company. I’m the only black person in administration. \n\nThe CEO’s admin treats me like shit. I brought it up to my boss this summer. Things improved slightly. Sometimes the admin was nice. Sometimes the admin wasn’t. And even my new coworker noticed. \n\nTuesday, I’m in the office and the admin starts asking me questions. But she’s not asking, she’s accusing me of not doing my job and then snaps at me to change website info on the company that I have zero control over. I bring her to my office and show her what I have and she begins demanding again. Remember, I did my job and boss hasn’t had any complaints. My daughter was witness to it since she came with me to my job. She’s commented from time to time how the admin doesn’t treat me nice. \n\nBecause the admin was demanding and being rude af, I lose it and storm to my boss’s office and ask why is this admin checking my work, is this an issue with job performance or is this about something else. \n\nThe admin, just like that, becomes syrupy sweet to my boss. She tells her it was just a question and she just happens to browse through. That’s not what she said to me. \n\nNow, before you say talk to HR, I am in HR. There’s nothing worse than crap happening to you as an HR employee and your options are hella limited. I apologized to my boss for bursting into her office and to my coworker, who happened to be in the office when I confronted my boss about this admin. \n\nSince then I’ve been asked questions by my boss. She’s a nice white woman, in fact, very sweet. I don’t have issues with her at all or my other HR coworker, who is also white. All I said, which I’ve said before to her about this admin, is I want this admin to treat me with the same respect she does to everyone else. I mentioned unconscious bias and the immediate question was does this admin do this to other black people. There are 3 black people, other than myself, who work on my side of the building. One is a part timer who comes in after 3, the other works from home, and the other comes in and out of the office. Does her question count? My defense has been, out of everyone in administration, she talks down to me or is flat out rude. Everyone else she’s nice and laughs and all that. I’m the only consistent black person she sees. \n\nI’ve been thinking of quitting for weeks because of this and other issues, also considering doing virtual school because of Covid. Is this racial? I think it is. But I feel like I’m being gaslit and maybe it’s not racial?",
    "title": "Am I wrong?",
    "subreddit": "blackladies",
    "timestamp": 1613140704,
    "score": 23,
    "keyword": "black ceo"
  },
  {
    "text": "Men are actually underrepresented in politics. I've been thinking about this a lot recently. I hear a lot on the intent, reading scholarly articles and official government reports that a good measure of representation in politics is the number of people of your group that are sitting in government. If you look at any measurement of gender equality they always make the assumption that this is aa good way to measure representation. As such women are often present as being underrepresented in politics and men overrepresented. But to me at least that logic doesn't make much sense. There are two main problems with this thinking,\n\nFirst, men as a class do not exist. men do not make political decisions based on the impact it would have on their gender. They do not care and so male politicians have no incentive to support any male positive legislations. If every person in parliament was left-handed that would not mean that right-handed people are not represented. It might be argued that they don't have to do so. The status quo already so greatly benefits men that they don't need to change anything. To which I would call you blind. Men face systemic discrimination in the criminal justice system to such an extent it makes black people look privileged. Like if I was going to jail for a crime, it would be better to be a black woman then a white guy. In the UK at least men make up 95% of the prison population yet the government 2 years ago created a female's offenders stagey to decrease the number of women in prison with no equivalence for men. Despite the academic scholarship showing overt discrimination faced by men in the criminal justice system mens views on these issues have yet to be fully crystallised and have no real way to express themselves. You can thus compare the amount of time and effort put into promoting female issues than men's issues in areas like health where men face significant disadvantage. so for example despite the fact that globally men have significantly worse health outcomes the un spend the vast majority of there gendered health promotion on women. While men enjoy a dominant status in society, their gendered interests have been neglected due to complacency. Women have fought to identify and assert their interests because their interests risked being neglected due to their descriptive under-representation. Men have not fought any such battles, and the gendered dimension of their interests is often overlooked. As a result, some men’s interests may remain uncrystallised even though there has been ample opportunity to represent them politically ([https://zenodo.org/record/4298815#.YB5zquj7QuY](https://zenodo.org/record/4298815#.YB5zquj7QuY)) For me, to actually take into consideration gender representation in politics you need to look no only at the number of women in parliament but also the number of female-oriented policies, the amount to a political organisation is focused to that group's political aims and the amount of time/money used talking about female issues.\n\nsecondly, it would be erroneous to argue that all men have the exact same goals and aims. and that all types of men are represented in government. working-class men increasingly become less representing in governments. they often are being replaced by middle-class women. This is not me being angry or blaming these women. They have done nothing wrong and I am happy to see more women government. But we need to understand that if you went to a private school you do not necessarily have the same interests as a plumber whose mum was a crack addict. To say that all types of men have the exact same interests is completely ignoring the unique experiences different types of men have ( intersectionality has some good points). Also please do not confuse the interest with one group of men to show politics only cares for men. just because most CEO's are men doesn't mean that a country passing business-friendly laws is meant the benefits men. If every CEO was a woman this law would have made no difference. Men are a unique class of people and are not synonymous with anything else.\n\nLastly, there is quite a bit of evidence that the more a group in government doesn't actually help those groups and can actually hurt. When there a few women in parliament many men feel a need to represent the interests of female constituents as more women join they increasingly are likely to leave this to women to whom they believe would be better at advocating for these rights. While this is true in part, women, especially when more of them enter government, can become less likely to support female proposals. As different types of women join with different views the impact of a small but dedicated group can be more effective than a large but divided one. On the other hand when we have large amounts of men in government the assumption is made that they will automatically represent there own interests which is not shown at all.\n\nThe pretty big cavitate I will admit is that I speak only for western nations. Although I'm sure that this does exist on some level in other parts of the world. the impact of sexism may be much greater there then is the UK or USA. and more tradnital views may make the idea that men don't express there views wrong. I just can't say as I'm not familiar with many of these countries.\n\n&#x200B;\n\nEdit: it's probably a good idea to clarify what I mean by representation and why people get it wrong. Representation is not how many people there are in government. Its the ability for the interests of that group to be enacted on. Men have very little way to get there interests argued for or supported and therefore have very little representation.",
    "title": "Men are actually underrepresented in politics.",
    "subreddit": "MensRights",
    "timestamp": 1612719567,
    "score": 71,
    "keyword": "black ceo"
  },
  {
    "text": "Obviously discussing class is essential, but feminists use this as a way to say men have no issues, and IMMEDIATELY STOP DISCUSSING MENS ISSUES, STOP IT, MY FUNDING AND GRAVY TRAIN IS AT RISK Class analysis is essential\\*\\*\n\nHowever,  specifically when it comes to mens issues it is used by feminists as a  distraction tool. For example, a feminist article by a PROFESSOR on a  reputable education publication was so bad it was actually funny (I'll  explain why it was funny in a sec).... she basically says we need to stop seeing  education as a gender issue and measuring girls doing better than boys,  its nothing to do with gender, its class etc. Dont say boys.... which  boys? which girls etc.\n\nWell professor should have know this is bullshit. A rich boy does worse than a  rich girl, a black boy does worse than a black boy, a chinese boy does  worse than a chinese girl, a special needs boy does worse than a special  needs child, a privetly educated boy does worse than same girl..... in  other words, in every single scenario it is a gender issue... gender is the underlying thread.... and as the CEO of the entire university application system said, boys and girls come from the same family, and live in the same neigbourhoods, have same parents, are brothers and sisters etc so if there is a gender gap then of course it is a gender issues not class etc. It is of course class, but it is also a gender issue.\n\nThe  worst example by feminsits is saying for example the forced  consicription of all males in Switzerland and those who cant for MEDICAL  reasons need to pay 3% tax for 10 years is NOT a gender issue, its a  class issues...... that is literally the stupidest thing I have ever  heard in my life.... obviously its a gender issue first then it can be  other things. Or that male circumcision is not a gender issue.... da fuck?\n\nTHis is where  feminsm actually gets misandric.... that above isn't sexism or stupid,  its actual misandry trying to erase male issues due to the hatred of  men. Now I am one that says sexism, misogyny etc are overused and used  where they dont belong, but in this case misandry is the EXACT thing  here.\n\nNow why is it so bad its  funny (going back to professors article)?.... in this SAME article the author was saying not to talk about girls outperforming boys in school etc, she suddenly does the most random segway and IN THAT SAME ARTICLE says the real gender  issue is kids sending dick pics in schools, other harrasment etc and proceeds to  gender the shit out of it only talking about girls.... hey professor  what happened to its not a gender thing? Which girls, which boys etc. why is it only girls now? Are boys not victims of these things?\n\nAlso feminist why dont you apply this to you beleoved gender wage gap? As clearly it isnt a gender issue. Its actually very specific people and groups of people. E.g. parents. And in fact many entire groups of women (not indivuals, but entire groups) of women get paid more than men e.g. in UK part time women get 6% more than men, young women get paid more etc etc..... so why aren't feminists applying this same lens to women issues which by the authors metric shouldnt be gender issues any more? For women EVERYTHING is a gender issue. Air conditioning is gender issue.... yet for men.... literally even the picking of people by male gender and consrciptuing them on a national level.... so imagine twins, one boy and one girl, it only applies to the boy.... IS NOT A GENDER issue according to feminism.\n\nFeminism is not just a hate movement full to the brim with racists, white supremacists, elistists (and before you cry feminists, FEMINSITS themselves say this relentlessly about feminism) misandry and even misogyny ironically...... its just dumb.\n\n\\*\\*And  as I have stated the issue with feminism is that its analysis is  overlym simplisitic. THere are THOUSANDS of reasons behind one simple  thing/what led to that thing e.g. a specific court in London handing  over custody of a child to mother..... yet feminisms one word answer is  patriarchy.",
    "title": "Obviously discussing class is essential, but feminists use this as a way to say men have no issues, and IMMEDIATELY STOP DISCUSSING MENS ISSUES, STOP IT, MY FUNDING AND GRAVY TRAIN IS AT RISK",
    "subreddit": "MensRights",
    "timestamp": 1622978344,
    "score": 59,
    "keyword": "black ceo"
  }
]