[
  {
    "text": "Please help me. A boy in my town is being allowed to come back high school after raping a girl AND ADMITTING TO IT. Please, please tell me what I can do. Anything. This whole situation sickens me because of how sexist and fucked up it is. I NEED to do SOMETHING about this. \n\n\nI am in a state that is pretty sexist and religious and therefore this school in question is too. I graduated last year but my whole experience was shitty because of the rampant sexism in this school that is brushed off by its sexist administration. Many of the rules (dress code) are sexist. We weren't even allowed to show our shoulders in school and would be horribly ostracized if someone thought we were wearing something \"inappropriate\". I once was told by the principal \"some battles aren't worth fighting\" when I was trying to discuss the sexism of the schools rules with him. \n\n\nGetting into the issue, a boy one year younger than me (he is an adult) raped a minor. He admitted this to the police saying that he didn't really thing she meant no, despite her saying no multiple times. He strangled her too and she was begging him to stop. He said he wouldn't until she had sex with him. (All of this information is from the article I'm not going to post it though since I'm sure that breaks privacy rules)\n\n\nHe paid bail and is now being allowed to go back to school. WHAT???? He is an adult and she is a child he raped her! How is this possible?? How is he not expelled or suspended?? Someone was expelled for getting caught with weed in my grade but rape isn't enough? As a female student you get sent home if you wear something \"immodest\" but a admitting rapist is allowed to be at school?? Many parents and female students are protesting but he principal is saying there is not proof.... EVEN THOUGH HE ADMITTED TO IT WHEN HE WAS ARRESTED TO THE POLICE! I don't understand? Am I overlooking something?\n\n\nI just hate that in my town girls safety is never taken into consideration and they let guys do what ever they want. I know so many guys that were in my grade that have raped girls at parties while they were black out drunk and the girls don't have the courage to speak up because nothing is done about it! And to make matters worse on social media this guy and his friends are saying that they just had sex and she regretted it afterwards and they are making rape jokes... I am just so disappointed in humanity right now. Please any advice??",
    "title": "Please help me. A boy in my town is being allowed to come back high school after raping a girl AND ADMITTING TO IT.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1486077105,
    "score": 14,
    "keyword": "black principal"
  },
  {
    "text": "Sick Of My Racist Students  I knew what I was getting into signing on to teach at a rural southern private school as a foot in the door. But February has rolled around and I'm starting to crack.\n\n My principal talks about \"Mexicans living on top of each other.\" Never mind that our lone two Mexican kids have more money than anyone else here.\n\n I had a kid write an essay about interracial couples being \"an abomination to God.\" Principal didn't see what the problem was.\n\n One of my kids went to a basketball game and yelled \"GO PICK MY COTTON!\" to a black player. Coach didn't see what the problem was.\n\n Was showing a TED Talk about mercy and forgiveness and a kid said \"just because I'm blessed doesn't mean I should help these poor black people strung out on drugs.\" I semi-snapped and said \"Really? That's funny. Because I grew up poor and my mom was a junkie. Do I look black to you?\"\n\n I'm done here after the year whether I have another job lined up or not. I just want to figure out how I keep from snapping until then.",
    "title": "Sick Of My Racist Students",
    "subreddit": "Teachers",
    "timestamp": 1486393508,
    "score": 380,
    "keyword": "black principal"
  },
  {
    "text": "The music teacher is only singling out the black students in my class. My students go to music for an hour during my prep on Tuesday morning. The music teacher has been at it for decades and can sometimes be a little old fashioned in her teaching style. \n\nThe last few times she has been complaining to me about my class being disruptive. I talked to my class about it last week and reinforced what my expectations were, they agreed to try harder to be focused and respectful during class. This morning she complained again so I asked her which students specifically were giving her problems.\n\nShe called out the names of every black student in my class (I have 5) and nobody else. 2 of these students give me problems so I can understand if they were being difficult for her but the other 3 are usually pretty good.\n\nIt left me feeling weird and I wasn't sure how to handle it. I talked to those students in private and they said that everyone was laughing at one of the songs she played but she only singled them out. I told them to not give her any reason to single them out, even if everyone else is causing problems too.\n\nI don't know how I can talk to the music teacher about this without accusing her and I don't want to undermine her authority in anyway with my students but this has been rubbing me the wrong way all day. \n\nEDIT: Wow, so much great advice, thank you everyone! I'm going to check in with the music teacher and the students involved privately (and separately) next week to see if it is still an issue. If it is still happening, I think I'll try to observe the class. Going to my principal is an option, my principal is trustworthy and on it. If I go to my principal though, I want to have documentation. I'm also going to check in with my grade level team tomorrow when we meet to see if she has been talking to them about specific students (black students) in their class.\n\nEDIT EDIT: She said everyone was great this great week so I'm just keeping an eye on the situation for now.",
    "title": "The music teacher is only singling out the black students in my class.",
    "subreddit": "Teachers",
    "timestamp": 1505848757,
    "score": 136,
    "keyword": "black principal"
  },
  {
    "text": "About to read Frederick Douglass Narratives in 8th grade inner city... advice on the n word? Most of my 8th graders are pretty mature. I have about 20 in each class, and 2 in each that are not black (they also volunteer to read often).\n\nThe n word is said a few times in the book and I'm unsure how to handle it. Here are my options:\n\n* Option A - take a bit to explain the word and it's context in the novel. I'm apprehensive about this because the moral SHOULD be \"It was treated differently then, and this is a historical document\", but in all honesty, I wouldn't say it if I was reading the paragraph.\n\n* Option B - Tell them \"just skip the n word when you see it\" and not make a big deal about it. Remind them \"the n word is coming up, so please censor yourself\". I'm apprehensive about this because it sounds like I'm babying them and essentially saying \"you're not as mature as the book we're reading.\"\n\n* Option C - Let them decide in the moment. My fear with this is that one of the non black kids is going to read it without thinking and it's going to start a big commotion.\n\nIt's a whole novel so I'm not about to just not read it because of a few pages. It's also the last novel I have available and we just ordered this year so I know my principal won't have much guidance. What would you guys do?",
    "title": "About to read Frederick Douglass Narratives in 8th grade inner city... advice on the n word?",
    "subreddit": "Teachers",
    "timestamp": 1489238652,
    "score": 48,
    "keyword": "black principal"
  },
  {
    "text": "Absolutely Gutted I don't even know what to do. I'm at the end of my rope. \n\n5 years ago I realized I was in a career I absolutely hated. I was completely miserable so I decided I needed a change. I went to consult an academic adviser at the local college about obtaining a teaching license. I had a bachelor's degree in political science, but I took night classes to get the prerequisites I needed for the program. When it came time to student teach I cashed in my 401k, my life's savings, I took out a loan so I could have enough money to live on while I basically worked an unpaid year long internship. \n\nI finally had what I needed. I got the license. I had a hell of a time finding my first job but I caught on with a rural school a couple weeks before school started. I moved an hour north, away from my family for the job. I worked like hell. It was in a rural district so I was pretty much on an island, but I did the best job I could and was respected by my colleagues. \n\nI worked there for three years, and completely out of the blue my principal, who I thought I had a good working relationship tells me I'm being non-renewed. He suggests I resign so I don't have a black mark on my record. \n\nI get my references in order, I have three years of experience and effective ratings, it should be easier now to find a job than it was three years ago right? \n\nI've applied for every open high school job since May. I've had two interviews. One in May... and one just this morning. School starts next week and they're scrambling. It looks like an amazing fit. I killed the interview, I thought I had this job in the bag...\n\nNope, I just got called and told that they went another direction.\n\nI've poured my heart and soul into teaching, and it's gotten me nowhere. Unemployed and my last check comes in 11 days. I have less than $700 in savings, and in heavy debt and my wife is a preschool teacher, so it's impossible for her to carry our household finances on her own. I feel like this interview was my absolute last chance to stay in teaching. For the last few months, with no teaching interviews I've applied for every job on Indeed I'm even remotely qualified for. \n\nMy lease lasts until next May (signed days before the unexpected non-renewal) and I don't think I can even make rent for one extra month on my meager savings. \n\nI could literally cry right now, I'm at the end of my rope and have no idea what to do.",
    "title": "Absolutely Gutted",
    "subreddit": "Teachers",
    "timestamp": 1502485836,
    "score": 25,
    "keyword": "black principal"
  },
  {
    "text": "Hit a new low today It has been a struggle this year, to say the least.  Today was especially terrible, for several reasons.  My toughest group arrived to the gym completely out of control. Diving down the stairs, crawling on the floor, shouting in the halls, and blatantly disregarding all attempts by peers and myself to gain control and behave.  It took 22 minutes for the class to stop this nonsense and enter the gym.  Once they got in the gym they went bananas. I sent them back into the hall, told hem my expectations, and let them back in.  Again, total chaos.  Back to the hall we went, and I explained the expectations again.  We finally made it inside and STRUGGLED through attendance.  One student in particular was way over the top so I had administration remove him from the class.  \n\nI am so beyond myself with this class, I straight up asked them what it would take for them to respect me and to behave themselves.  What followed was the most disheartening question and answer I have ever heard.  The overarching answers were that they would only listen to their Dean, who is essentially the middle school principal.  They told me she is he only one they listen to when given directions.  They told me the only way they would stop interrupting was if they were all put in rows and made to sit out of reach from another person so they wouldn’t be distracted. And the worst answer, that most of class all agreed on was this: one student told me I need to “act black, and yell at us”.  She said that was the only way she would follow my directions.  I asked her to clarify what she meant, and she said black people yell at you and that’s how you can get us to follow directions. The other students, black and white, nodded and agreed. How unbelievably sad is that? These students literally feel that they should be yelled at.  I can only attribute this attitude to the dean.  She is a black woman, and she yells at them.  I have never experienced so little respect for adults by children.  These kids are 10 and 11 years old.  I’m meeting with my principal tomorrow and will discuss this with her.  I just can’t believe how low my class felt today.  I really have lost faith in my school, and in my career choice.",
    "title": "Hit a new low today",
    "subreddit": "Teachers",
    "timestamp": 1507684996,
    "score": 18,
    "keyword": "black principal"
  },
  {
    "text": "White principal told staff at predominantly black elementary school to put what white students there were in the same classes so they would feel 'comfortable'",
    "title": "White principal told staff at predominantly black elementary school to put what white students there were in the same classes so they would feel 'comfortable'",
    "subreddit": "blackladies",
    "timestamp": 1493167341,
    "score": 19,
    "keyword": "black principal"
  }
]