[
  {
    "text": "After not being able to get $15/hr entry level jobs in desired field, I blew an interview for dream job opportunity significantly exceeded my salary expectations and don't know how whether I should feel like a doged a bullet or not. Advanced apologies for novel length of a post ..... OK so a few things to clarify:\n\n1. **The opportunity was my dream job, but with my nightmare employer.**\n   1. I'm 26 and I recently graduated university. **I intend on applying to law school** but prior to doing so, I have been looking for an entry level job in the legal field near me to be able to first move out of an abusive household, etc.\n   2. **The job exceeded my expecatations and it felt like a dream come true when I got called for an interview.**  zero work or intern experience in the legal field (But extensive knowledge about the law and have done legal writing/research) , I couldn't even find an entry level legal assistant job.\n      1. I see an an ad for a top rated trial attorney who owns a successful firm. He was hiring candidates with experience, or recent college grads who maintained a certain GPA which I exceeded.\n      2. The job was not only offered me a 40 plus starting salary with 0 work experience when every other place wouldn't even give me 15/hr for less experienced roles, but it was the only place that allowed me that position without requiring that I have a 2 yr certificate. **And it was being offered in my favorite part of town that I always wanted to work at.**\n      3. **Therefore, it was a dream job But it was for a nightmare employer.** On glassdoor, 2 out of 5 reviews stated that the firm had issues with sexual harassment, it was a \"boys' club, that \"inappropariate comments were made all the time\", and \"good luck if you're a female attorney\\*\\*.If you want to doubt the veracity of these reviews, please just stop; I understand if you may be skeptical of these reviews . but if you're going to totally doubt the veracity of them, then please just stop. There's a fine line between a sexual harassment complaint, and having a REPUTATION for it. I 've seen many disgruntled reviews for various companies, but there's a difference between being disgruntled and multiple claims of serious sexual harassment.\\*\\*\n      4. Other reviews cited long hours and bad pay, with one stating how they messed up on her paycheck a few times and another citing how they put off annual performance employee evaluations. **I didn't mind long hours & working overtime though, because it's what I needed.** One review also cited 20 out of 50 employyes got fired or quit in a year, and that the place was known for being a revolving door. almost all of them cited bad management, with one customer even commenting on a google review that they had lost her paperwork. (was still a very successful firm; the lawyers do \\*VERY\\* well for themsleves and have been nationally ranked as top trial attorneys)\n      5. **And to those who doubt the reviews are true, I could smell the truth of these reviews from miles away and even tried giving them a chance. But as soon as I** heard about how disgustingly routine it was to be sexually harassed, **the \"dream job\" instantly turned into a dream nightmare that I didn't even want to work. The thought of working there (long hours with little training and frequent harassment) depressed me.** I couldn't sleep for more than 3 hrs a night, my head constantly span as I decided whether to work there or not, and I had the worst acne I've had all year. **I've also been right about a bad situation anytime I've felt it, and ignoring that pit feeling only led to bad experiences throughout life.**\n      6. I'm 26, living with my parents and just want a stable career that just so that I can pay for a roof over my head to study and get into law school to prosecute guys like him, or start my own firm doing something similar. Since graduating in Aug 2020 I've worked extremely hard to overcome my mental health disorders and I've cut off anyone toxic /abusive in my life that was preventing me from being in the position I am today to move forward and become independent. **I have zero time to lose, and I have zero games to play after having worked hard to free myself of people who tried to play games with me for years. Because there was a solid chance that I would be sexually harassed again, taking this job meant possibly putting myself in a position that I might have to escape from within a short amount of time only to be back in the same position** without a job with additional challenges to overcome such as explaining to employers why I had a job that ended quickly. . **Even if the reviews \"weren't true\", I'm looking for stability, not additional games or opportunties that might lead to being back on my feet with greater gaps in my resume.**\n      7. **Reviews also stated no training, a lack of structure , and inconsistent expectations. This scared me since I had zero experience in the field, so it felt like a sink or swim job. I wanted to succeed but didn't know it the office cultivated an environment for that to be able to occur.**\n      8. **I wanted to cancel the interview sooooooo bad, but it was the only opportunity I had at a law firm so I thought I'd check it out.** But I felt like I was going to be working a dead end position that could stifle future oppoturnities as there was a chance that I might have to terminte myself from the job if being sexual harassed on a continued basis. Again, it could be that the sexual harassment would stop after telling him to, but seeing how arrogant he seems in TV interviews, the fact that he owns his own firm, and my experience with older business men like him(on the street after being sexually harassed) didn't guarantee that would happen. I'm not stereotyping older men, but he obviously thinks he can do whatever he wants in his own office simply because he is the owner of it and I'm just saying that the worst kind of harassment comes not from young men off the street, but people in positions who feel that they can abuse their power. And his behavior did not settle this feeling in any way whatsover because **THERE WERE RED FLAGS ALL THROUGHOUT THE PROCESS, STARTING FROM THE MOMENT HE EMAILED ME FOR AN INTERVIEW ALL THE WAY LEADING UP TO WHEN I WALKED INTO HIS OFFICE:**\n\n\\---------------------------------------------------------\n\n1. **The managing attorney aggressively recruited me.** I got notifications that he viewed my resume many times over the weekend, he gave my resume a like, and at 9AM the next business day, he asked me If I was available for an interview within the next 48 hrs. On the actual day of the interview, I also saw him waiting outside his office door for me a few minutes before the actual interview time. I applied on a Friday. He e-mailed me at 9AM the next business day asking if I could interview. But, I knew something was up based on how he asked me to interview which he did over e-mail like this :*(details of the actual interview in seperate section further below*):\n\n* \"XYZ(my name), Can you interview with me on X date (48 hrs away)? Please advise.\n   * first reaction: **i was digusted at his arrogance and immediately felt like an object; he was speaking to me like a pawn when I wasn't even an employee.** Such disregard for boundaries is a characteristic commonly held by (although not exclusively held by) employers who sexually harass or abuse their employees\\*\\*. I felt underappreciated and immediately had my guard up b/c it was as if he was expecting me to be there.\\*\\*where can i start lol?\n\n1. he didn't even start the e-mail with a HI, or say anything about my application . I was expecting something along the lines of Hi, Thank you for interest in XYZ firm/ something about my resume. Would you be available for an interview sometime this week (with a time **range as opposed to a single date and time 48 hours prior)**? normally employers discuss availability for interviews in the context of with at least more than one date or time......................................, especially after I suggested alternative, but very flexible time/dates that better suited my avaiability on the application which he clearly disregarded smh.\n2. Secondly, the subject line of the e-mail was \"interview with Jones law firm\" when name of the firm was Jones, Brown, and Yellow (not revealing actual name for confidentiality) . He was the owner of the firm, but failed to include the names of the others who shared partnership in the name of firm smh.\n\n* AFter replying with my availability, **he didn't even try to hide how he spoke to his other employee.** Didn't even ask her to *please* send me directions to get there after I confirmed. Instead, he literally replied back saying \"**We'll see you then**\\*(not even great, or I look forward to seeing you, etc);\\* **Janet, circulate invites\".**\n\n1. *Lol..we'll see you then as if it's my duty to be there?* And, If I were him, I'd be embarassed that a prospective employee who I'm trying to hire actually saw me ORDERING a current employee like that. **I didn't have a good feeling about firm b/c owner seemed like he embarassingly had no manners.**\n\n* didn't thnk that the reviews talking about bad management among other things were true? **LOL. \"Janet\"** never set me anything. She did send me something the morning before the interview, and it didn't even include the fact that there'd be a parking garage, etc which most receptionists include in info to interviewees. *Again, not surprising given that a former client stated on google reviews that they had lost her paperwork a few times.*\n\n\\------------------------------------------------------------------------------\n\n**Final stage: The interview.**\n\n* **Day of the interview.** I Wanted to be happy about being offered a chance to work a job that had everything I was looking for in a way, but I couldn't no matter how hard I tried and felt like I was trapping myself into a position and settling me for something that would backfire. **I Wanted to be happy, but I couldn't knowing that even if offered the job, I wouldn't be guaranteed the stability that I desire.** **I knew I that was gambling a zero sum game that if I rolled the dice on, would lead me back to where I was now. I** Was ready to go to sue him for sexual harassment in court if need be , but knew that I didn't want to waste any more time after gotten out of a court battle a few months ago where I had to fight off a narcissist slandering my name in front of judge. **The thought of working there literally caused my stomach to churn and my head to spin I recall constantly thinking about how I didn't want to work there.** I also felt like I was settling b/c they had contacted me so fast & I wanted to hear back from other employers that made me happier to work for. **I felt a huge sense of relief at the thought of not being offered the job, and wished that he didn't pursue interviewing me as proactively as he did.**\n* **I'm finally about to walk into the office**. **I felt like I was walking into another one of life's dead ends,not an exicitng job opportunity. I remember approaching him and feeling like I was meeting my next harasser, not my next employer. I did not feel scared at this, because** I am not scared of men who harass me by the way. I confidently confront it head on. Thinking as if I was approaching my next harasser just made me angry and feel on edge throughout the interview b/c no one wants to be in a position to \"confront them head on\" anyway. And i've been sexually harassed on the street almost every weekend for the past 6 yrs as a result of walking alone in form fitting clothing with 0 other people around me .\n* I walk into his office. **the lack of of bad management was not a lie lol; front desk seemed to be clueless about my interview at 5.** just as I was explaining it to them, he walked in and said \"I think she's here to see me\" . Angry at his earlier sense of entitlement towards me given to me in his e-mail and seeing it occur again in his office, I ignored him lol. *Likee, if you think i'm here to see you then say something to me not your employees..don't expect me to fall at your feet just because I was there to see you.* I continued to speak to the receptionists, which idk if that annoyed him or something because when I finally approached him, I don't even recall him saying hi or how are you? Maybe he did say hi, **but the first thing he said to me was not \"right this way\" or anything similar, but rather \"Follow me, Nancy\" in a slightly annoyed and joking tone.** Like what the actual fuck..follow you and in that tone when your receptionists were the ones who told me to sign in & you said nothing about it ??\n* I probably should have walked out right when he spoke like that but this was my first job interview so I wanted to see what would happen. So since this was my first job interview and compunded with what I had heard thus far, I was extremely on edge and just not my confident usual self.\n* So, he only asks me 3 questions in the interview while implying that he throught I was qualified. **One question he asked was how long I wanted to work there.** I've never been asked that questiion before so I was caught off guard. Because of that and the fact that I couldn't stop thinking about how I didn't want to work there, I immediately and stupidly blurted out \"for one year\" **only to remember that the job description stated in capital letters that this was a CAREER OPPORTUNITY (if it really was you wouldn't have to persuade people into thinking that it is because your management is so bad and b/c no one actually wants to work there lol)** /I normally might have thought of something else to say on the spot but instead stated the first thing that came to my mind because I thought he'd be ok with it given the super high turnover rate at his firm. *This was right before I mentioned to him my plans of relocating to a different city after a year SMH.*\n* In the interview, he also stated that he believed smart hardworking people had what it took to complete the job. He remarked \" If I recall, you (something to the effect of did really well in school), right?.\" After answering yes and asking what seperated the employees who he thought succeeded vs those who didn't, he stated 3 qualities and told me that because of my performance in school thus far, I have those 3 qualities even if may not know it yet. He basically thought I was qualified, **liked my resume, but didn't like me lol** which is why I want to explain a few other things which occurred:\n   * So first off, I'll say that the impression I got of him so far and the horrible things I read about his firm made it extremely hard for me to keep a straight face for just like just a few minutes into the interview . He wasn't able to see this b/c of my mask but it was telling of my headspace.\n   * the first thing he told me was \" So, I want to interview you and not your resume\" **which I knew were code words for \" I want to test your loyalty and not your skills. \"**\n   * **He tried to steer the interview into inquiring about personal details.**\n      * I'm 26, **I don't speak like a shy ditsy girl at all** but the only thing he knew about me was that I recently graduated college. So when I mentioned interning at a particular place he was like \" so that must have been when you were a sophomore or freshman in college, right?\" I was like I'm not going to tell you my age...... He casually responded by saying \"right, but I must at least be in the ballpark that you're 21 or 22 right now b/c you just graduated, correct?\n      * I'm someone who thrives on standing up for herself, loves doing it, but only learned this ability after years of experience .This was my very first job interview and I've never been asked that question in a subtle way before. **At the same time, I was eager to reassure anyone (even someone off the street) that I was certainly 21-22 b/c I've been bullied for months by those close to me about graduating at 26.** So I told him \"of course i am 21-22\"\n      * When revealing to him the name of the (republican ) senator I formerly interned for,his creep ass asked if he was \" a MAGA type\" in a joking tone (I assumed he was a republican merely pretending for me he didn't like MAGA types to find out my political leanings before realizing after the interview that he once showed up at a clinton fundraiser). Looking back I really regret not saying that \"sorry, I don't pay attention to the politics of those who I work with b/c I don't think the job has anything to do with it\" but instead I just kept telling him I didn't know b/c senator was never in the office.\n      * This was all right before he asked what was one of the biggest red flags of all especially in regards to harassment claims online by asking \" what was your most unforgettable experience there\" while smiling at me with a huge grin and shiny eyes after mentioning attending school in Austin ( a city known for being a rowdy college town). Instead of getting annoyed, I (perhaps blindly) **saw this as an opportunity to make a connection a**nd solidify my desire to pursue legal work; **I also wanted to send a message that I was strong enough to not volunteer details about my personal life even if he was curious about it .** So my face lit up when I told him that my most unforgettable experience there were conversations I had on campus about constitutional law and history **(which was true)**\n      * Towards the end, he kept asking me (with a huge cheesy grin on his face) whether I was ready to talk some of the other paralegals already working at the firm. **I couldn't tell whether he actually wanted me to do so if he was just trying to pursue a less awkard of closing the interview**.\n      * Either way, before that happened, an intense exchange occured when he told me in a very douchey tone that **If I was only going to be there for a year, then I couldn't pursue litigation (being in court)** right before condescendingly remarking that \"this wasn't some internship.\" Initially, I told him my focus wasn't on salary or advancement at the jump but rather on present work in a present role.\n      * He was fine with that, but as someone passionate about law and going to law school, **likeee unless you're a judge sweetheart, you aren't going to tell me I can't be in court.** Granted his reasoning was very understandable, but those are the kinds of comments you keep to yourself lol **like you don't have to be INTENTIONALLY be both a dick and dumbass about it and tell me \"What I can't do\" when all you have to do is not hire me anyway?? So I sternly reminded him** that my plans after 1 year could very well change so I shouldn't I be able to pursue litigation then?\n\n1. I made sure to sound as if I was looking for serious answers (because I certainly was). He nicely said of course before beating around the bush; I questioned him further, and he said \"this position is all we are going to talk about for today though ok?\" with a smile and a wink . I simply paused in silence, & with a dead expression on my face, told him I could meet another co-worker as discussed earlier.\n\n* He left and brought in another co-worker. I have to reinstate that none of the co-workers looked happy. The moment i walked in, none of the receptionists smiled or anything it seemed dead before the attorney greeted me. The co-worker I spoke to seemed just as on edge and stressed I was during the interview?You know how you're trying to aggressively make your interviewer think some type of way about you with filler words at a job interview? **that's exactly how she was acting.** She continued to stressfully emphasize how \" there are no stupid questions here, you can ask the attorneys anything(lol as if they have time to answer), how you'll get all the training you need with no experience(I beleived this), and that if there's a place to gain experience, it's here\". But, **She was like trying to sell the job to me and seemed tense & pressured.**\n* By the way, before introducing to me her, the employer asked if I had any questions or \"if I wanted to meet people.\" He barely gave me a chance to answer, but when I told him \"I do have questions for you\" he looked at me with a straight face lmao. I was thinking to myself, *\"Oh you think you wouldn't be asked any questions?\"*\n\n1. When asking him \"what do you think seperates employees who succeeed vs those who don't and what kind of culture does your firm promote for that\" he emphasized :\n   1. success of employees as long as they don't \"Clock watch\" , are dedicated & conscientious (which he said I was even if I myself didn't know that yet) . *Lol i wasn't surprised to hear that he looks for \"non clockwatchers\" especially when 1 of the reviews said he messed up on pay for long once.*\n2. then he also said **\" we have a culture in this firm where if something is in your lap even if someone before you messed it up, it is your responsibility to fix since it is in your lap\"**. I guess when I looked at him dead in the face quiet in response, he spoke up with a smile and said \"it's what I do all the time, I'm always cleaning up someone else's mess\" (personal injury accident firm)\n3. Anyway, after I was done speaking to the other paralegal,the attorney did not return; the paralegal looked around not knowing what to do **as if he hadn't told her he'd be back.** she suggested that she was going to speak to the receptionist and come back, but annoyed at the attorney's negligence in the interview ending smoothly, I followed her out with my backpack & knew it was time to leave. The attorney was speaking to one of the other attorneys in a seperate room, and when he saw us outside his door he immediately stepped out and and asked if we got a chance to speak. *umm of course we did.* But I just said it was a thorough chat before he just nodded and smiled without saying much. I didn't like that, so I subtly adjusted my backpack and turned the other way wanting to leave. He immediately said goodbye and have a good night in a nice tone but like in a fluttery \"okay sweetie if it's like that goodbye then\" tone. But I honestly can't remember which one of us motioned for the goodbyes first\n\n**Concluding thoughts & my question to audience (if anyone's reading) -----------------------------------------**\n\n**He called me in so quickly to do an interview that I didn't even have the chance to explore all my options & apply for college to grad hire programs with similar pay being offered to grads of my college. So I immediately felt like if I were to have automatically agreed to work for the lawyer, I would have settled without knowing whether it was the best option.** But after seeing that much of those college to grad opportunities have expired, I feel as if that firm was a great opportunity. I didn't realize this till after getting rejected/ spending more time to search for other opportunities (that aren't available ) online. **But, I am not sure how long that opportunity would have listed given the poor management and rife sexual harassment that I read occurs there.**\n\nI've realized that the extent to which I cried is a testament to how passionate I am about becoming one of the best lawyers in the country. **As a result, i don't want to just sit around and fulfill someone else's legal dream, I want to fulfill my own which is why I'm willing to take anything that pays decently just so that I can afford my own place and work towards not just getting into law school, but fucking dominating the process of it.** I want nothing else in life right now. I'm also proud of the fact I had such little time to make a life changing decision (whether to actually want to work there or not), and I chose my mental peace. Not just in a \"feel good \" way, but because not having mental peace was signifcantly impeding me from succeeding in past career related goals for many years.\n\n**Questions for Audience:-------------------------------------------------------------------------------**\n\nI just don't what  to feel? I've simultaneously felt a huggeee sense of relief from not having to think about when I may be harassed at work, but I've also felt a tremendous amount of loss from reasons already state\n\nSo being back to square 1 which is struggling to find a job in a way, idk whether:\n\n* I should feel proud or happy for dodging a blessing in digsuise?\n* I should feel like a failure for being so on edge and slightly akward during the interview? **in all honesty, i did come off that way because hoping that I wouldn't have to deal with being offered a position simply because I felt like it'd cause additional stress b/c I wasn't quite sure whether I even wanted to work there.** This all changed after the interview of course.\n   * Even though I didn't want the job right before interviewing, I feel like a failure that I bombed the interview simply because I may have let the people distract me away from and depress me about the actual job itself. While not doing this might have resulted in me actually wanting to interview and by default being in a different position than I am in right now, i'm pretty sure it would have led to me being in court.\n* I should feel like a wuss for not wanting to risk going to court to sue him ?\n   * *I read somewhere about a female encouraging another to take on a job if the other had the stomach for sexual harassment so that she could win in court and the employer could learn that he can't just abuse the hell out of whomever he wishes.*\n   * **That's exactly what I wanted to do and was ready to do (I'd win in court with body cam evidence). I have a history of taking on battles with people who have tried to abuse me just to \"put them in their place\" but there's more consequences involved when you might lose wages and time in your career when trying to fight those battles.** Likee, I dreaded the thought of fighting my own court battle (I'd fight it myself and win) while being unemployed and finding a new job.\n* If anyone is actually able to read/ respond to this Harry Potter book length of a post, I apologize in advance for potentially responding late as I am in the middle of job apps and meal prepping , but I definitely do respond to thank NICE people who have commented",
    "title": "After not being able to get $15/hr entry level jobs in desired field, I blew an interview for dream job opportunity significantly exceeded my salary expectations and don't know how whether I should feel like a doged a bullet or not. Advanced apologies for novel length of a post .....",
    "subreddit": "jobs",
    "timestamp": 1622942091,
    "score": 2,
    "keyword": "brown manager"
  },
  {
    "text": "How do I best handle a colleague who's obsessed with me and my race, but also kinda hates me? I have a Japanese colleague who when she first met me was under the impression I must have had some Japanese ancestry. I do not but I am one of those brown skinned racially ambiguous women who get mistaken for literally everything under the sun and who some people become really fascinated by my looks and fetishize me.\n\nThis woman started off our work relationship by telling me if I need more work she can hand off some of her petsitting jobs to me, then proceeded to ask me my age, and when I told her she cooed \"your skin is so dewy, you look so young!\" (i'm barely in my 30s.)\n\nAnd then she proceeded to assume I was part Japanese and asked me literally dozens of questions over the next couple weeks like \"so did you watch Pokemon growing up? I didn't because I grew up here speaking English\" and all sorts of other weird shit. When I brought in one of those cutesy Japanese animal pens, she asked where it was from. I said some company in Texas, and she asked if that's where my family was from. I told her no it was some website in Texas. Every conversation had my family's origins as a subtext and shoehorned in.\n\n I told her I am not Japanese, I do not speak Japanese, that this is your culture and your people.\n\nAnd never have I ever been mistaken as having English as a second language either. The weird thing about that example is that months later I'd learn she actually didn't grow up speaking English and grew up in Japan. So not sure why she lied about that. There were other times I just walked away because I was so uncomfortable by her questions and race related chatter.\n\nWhen she cornered me and just point blank asked me where my family was from, I said California. She was like wow cool Cali girl, WHAT ARE YOU??? \n\nI just walked away. \n\nI also noticed by then that she mimics how I talk. She mimics how I talk to customers, VERBATIM, and in the same tone. I don't code switch sometimes and will say y'all or ain't, etc, and she has started to talk like that too.\n\nFrom then on I would disinterestedly say hi to her and answer her work related questions, but I would never have a conversation with her. She started mispronouncing my name all the time when she hadn't before, then she stopped talking to me. She also talked shit behind my back like I was the problem here. I'm guessing this included to the owner, who she's close with.\n\nIn December where there was a work related shitfight among the whole group she called me \"snarky\" when I said I felt marginalized in this group. She then called me a waste of time for stating she made me uncomfortable with her dozens of personal questions and that was why didn't answer her phone call, and because I said I could not pay my rent if we went on strike for two weeks.\n\nShe ignored me and was passively hostile for a few months until April this year when she became super friendly and then started talking non-stop about how woke she is, how she translates anti-racist literature etc. She stopped when I pointed out to her she LOVED our last manager, who was really racist and screamed at Black women, and screamed at us non-Asian WOC.\n\nI did get a slight sexual vibe off her obsessive questioning, which made me surprised she has a boyfriend and was straight. Having said that it's an open relationship and now that we get along again, I have seen how she falls in love with anyone who comes into our store and finds attractive.\n\nI think she is obsessed with me and my race, but considering dozens of Black men come in asking for her, and how she mimics everything I do, I also wonder if she's trying to find out how to snag a Black boyfriend.\n\nI need to make clear I don't think this woman really likes me. I think she still hates me for the perceived rejection last year and because I won't admit to being Japanese, which I'm not, but I also do think she's obsessed with me.\n\nI don't know what to do at this point other than maintain a distance and don't really engage but in a far more diplomatic way than last fall, when saying nothing more than hi and one word answers made me her worst enemy. I'm also at a loss because the boss seems to like her, though I made sure I let the boss know over the winter that this woman really hates her and was going to wage a social media campaign against her with burner accounts as a way to discredit the garbage she was telling people about me.",
    "title": "How do I best handle a colleague who's obsessed with me and my race, but also kinda hates me?",
    "subreddit": "jobs",
    "timestamp": 1625323435,
    "score": 0,
    "keyword": "brown manager"
  },
  {
    "text": "Managers: How can your employees share compliments and say \"thank you\" without coming off as brown nosing?",
    "title": "Managers: How can your employees share compliments and say \"thank you\" without coming off as brown nosing?",
    "subreddit": "AskReddit",
    "timestamp": 1629398589,
    "score": 1,
    "keyword": "brown manager"
  },
  {
    "text": "Got told by my boss that i'm not professional-looking because I don't wear makeup I'm currently training as a relief manager for hotels/motels, there's a guy a few years older than me that's also training here and I just gotta vent a little bit about this whole thing. \n\nSo this job is dope, it's such a great way to make loads of money and have the lifestyle I want i.e. travelling around the country and basically only needing to work for ~20 weeks of the year to make the same amount I make doing waitressing/bartending full-time. I'm super hyped about it, very enthusiastic doing my best to learn every aspect of the job and find the best way for me to complete all my tasks in an efficient and effective way. \n\nIn that aspect, my boss has said i'm doing great. The guy i'm training alongside is achieving half the stuff I do, with less efficiency and just a general sense of 'I hate this'. Which is fine, maybe this isn't for him, we're still pretty early in the process. The boss is giving him the exact same amount of 'you're doing great!' though. Hurts a lil bit. Thought maybe she's just nice and says that to keep your self-confidence up.\n\nToday was our 5th day on the job, we're here from 7am to 7pm so by now we're all pretty comfortable with each other and speaking our minds. Boss pulls me aside today after I finished all my morning tasks and tells me I don't look very professional and if I could dress more appropriately in future.\n\nThis is when the exhaustion finally got to me. I've been wearing smart-casual clothes all week. Today I was wearing black jeans and this lovely light brown velvet shirt with a collar, in my mind a perfectly okay outfit. I even thought I was overdressing when I first put it on because the other trainee just wears your average kmart V-neck and jeans.\n\nThe boss left for a few hours so I took the chance to ask the other guy if she said anything to him too. 'No, she hasn't even hinted at it..' he replied.\n\nAt the end of the day I asked the boss what she'd prefer I wear, thinking maybe I had completely misunderstood this whole thing, and after beating around the bush she got to point and told me I should wear some makeup.\n\nI hate makeup. Not as a principle like, you do you queen. It's just I personally hate wearing it and after the age of 16 never really felt like I needed to. Besides the odd PMS pimple, I have good skin. Even barring the mental side of it, literally as soon as I have any on I can *feel* my face way too much, I feel like i'm wearing a mud mask and can't express myself fully. Mascara always ends up smudged on my cheeks and I decided many many years ago that the whole thing just wasn't my jam.\n\nI just can't believe in this day and age, in this job I thought was so perfect for me that I could live my vanlife dreams and travel all year round, this is the fucking thing i'm being pulled up on. The double standards that lace our society like  a fancy top-hat made with mercury, it's exhausting!!\n\nAfter a big-ol cry and complaining to a friend, i've decided i'm not budging. I have never been treated poorly or like i'm unprofessional because I don't wear makeup. I used to work at a top-end hotel as a bartender, the kind that made me wear a waist-coat, polyester pants and leather shoes- and even there it wasn't an issue. Maybe i'm wrong. Maybe this will blow up in my face. But at least if it does, it'll blow up in *my* face- not the face someone else made me wear.\n\n\nEdit: Gooood morning reddit... Holy crap this went bananas! Thank you for all the awards and upvotes. It's so lovely to have support from so many of you, and i'm so so glad my little rant gave us all the opportunity to gather together and share stories and wisdom. I don't know if i'll have time to reply to everyone, but i'll try my best!\n\n\nEdit 2: Some of you lovely people were asking for an update on how confronting her goes down. I finished all the office work and most of the check-ins for today, so I sat down with her and just told her I thought about what she said, but I really don't feel comfortable wearing makeup, that it distracts me and actually makes me feel more selfconscious. She completely understood! She said she was sorry, that she thought i'd never considered wearing makeup before and that she was trying to help me. \n\nWe both agreed it will probably be a recurring conversation i'll have to have, and might sometimes cost me a job somewhere high-end. But in the end of the day that's not the kind of job i'm looking for when more casual places suit me down to the ground! \n\nThank you again for all your incredible messages of support and similar stories from your own experiences. I feel more confident now to put my foot down (in a non-aggressive way) whenever this comes up in future. And if I ever feel like Dolling up a bit, you've given me some great suggestions of ways to do it without spending a fortune or feeling too restricted. I love you all!!",
    "title": "Got told by my boss that i'm not professional-looking because I don't wear makeup",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613557733,
    "score": 16692,
    "keyword": "brown manager"
  },
  {
    "text": "I'm a woman in construction... This is a bit of a vent so bare with me, I have a lot to say...\n\nI'm a woman and I work in construction.  I used to be strictly in construction administration, but recently was promoted to production manager.  I was promoted to production manager because I know what I'm doing, I know the industry, I know how to talk to people, and I'm good with the crews.  Basically, I was promoted because I am, in deed, good at it.  And yes, I am a woman.  I'm also a small woman and an attractive woman and I wont make apologies for that or pretend that it isn't a factor in my day to day life.  Being a small, attractive, woman has often been an asset to me so no, I'm not going to \"hide it\" or pretend it isn't a thing.  Because goodness knows, if you're a woman in construction, you at least should have the decency to be butch enough that the men aren't attracted to you.  Sorry.  It's not my problem if you can't control yourself at work... Even if, it often becomes my problem in reality...\n\n1st vent: the white conservative men who dominate my industry are ALL racist and sexist.  This isn't y the first yard I've worked on an every single construction company I have worked for has rewarded a toxic culture of verbal abuse that is usually racially or sexually/homophobically motivated.  IF any of these men AREN'T actually racist, it is impossible to tell because they ALL laugh along with the constant jokes about race and sexuality.  There is one guy who calls all the crew members \"Mexicans\" as if that's an insult and not a country.  He knows full well that NONE of them are Mexican, but they are brown so he doesn't respect them.  So he makes a point of calling them all Mexicans basically to say without saying \"Don't come at me with that we're different cultures/countries bullshit.  You're brown so I don't respect you so you're Mexicans to me.  Try to say something about it.\"  He likes to call me \"The Jew\" because I'm Jewish.  He makes comments like \"Is that Jew speak?  Let the Jew handle the money.  Is that some weird Jew custom?  Is that Jew food?\"  Like, I'm not offended by being called a Jew, but he is obviously trying to offend me.  Lord knows what he says when I'm not around.  And they all go along with it.  The crew can't talk back to him because he's higher on the food chain and everyone with any power thinks he's hilarious.\n\n2nd vent: I went to the lumber yard to pick up a unit of CDX and some guy who recognized my company vehicle asked if I was the owners wife.\n\n\"Um... No?\"\n\n\"Then what are you doing here?\"  He actually had the nerve to ask me what I was DOING there.  As if it's a private fucking club.\n\n\"Working?\"\n\n\"This is YOUR job?\"\n\n\"Um... Yeah?\"  Cue he and his counterpart literally looking me up and down and proceeding to feel very entitled to comment on my physique and \n\n\"Well, you ARE pretty fit!  You have a GREAT body!  I bet you're stronger than you look.\"  Cue me just rolling my eyes and walking away.  Like, seriously?  Is this just a thing you do to everyone or just me?\n\n3rd vent: The only men who have crossed boundaries with me have been the white conservative men.  The latinos - who are supposedly all rapists - have been nothing but respectful.  They see me driving the big rig and think it's fucking great.  The white guys make inappropriate comments to/about me all the time and one of them actually went so far as being banned from talking to me outside of email because he was sexually harrassing me in the middle of the goddamned night.  They act completely fucking shocked to see me drive the box trucks and act like I turned into a watermelon if I correctly identify a screw.  Meanwhile they all tell me to \"watch out for the Mexicans\", who are almost all Salvadorean and most of them are married and have, like, I said, been nothing but respectful.\n\nI know I chose this.  I chose to be a feminine woman in a conservative and male dominated industry.  So, may be it's my fault.  Like, I could've been a nurse or something that is more acceptable for women to do, and still probably get sexually harrassed and have to deal with assholes and fuckwads.  But, I'm not going to apologize.  There is a toxic culture of racism and sexism in this industry and me being a small attractive woman who can drive a box truck is not the problem.  The problem was already there and I love getting out of the big rig and shocking everyone in Dunn Lumber who thinks it's a private boys club.  Get used to it motherfuckers!  Women can drive box trucks and fork lifts, too motherfuckers!  Small women are mighty!  Pretty girls can be tough!  I don't have to ugly myself up to make you comfortable, I don't have to dumb myself down to make you comfortable, and being 5\"0 has never stopped me from doing ANYTHING I wanted to do.\n\nAnyways, I don't know what the answer is.  I'm just venting and I'm done now.  Thanks.",
    "title": "I'm a woman in construction...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1632365976,
    "score": 214,
    "keyword": "brown manager"
  },
  {
    "text": "Consent should be taught in every school   \nI think that consent is CRITICAL for children's education. It is important because it allows them the courage to say no when others try to groom or assault them. Also, it is important because many children are assaulted and have no way to process that trauma as adults. It is estimated that 1 in 3 girls and 1 in 6 boys are assaulted, with the average age at the time of assault being 9. It will take a lot to end these atrocities, but I think that teaching consent is the first step. So I would like to start a letter writing campaign to representatives. To make it easy, I've posted a template for the letter below and a link to find your representative so you know who to email. Please help me change this! As of now only 9/50 states teach consent as part of sex education! This is unacceptable and we can make all the difference!!!\n\n  \n\n\n[Find your Representative here.](https://ziplook.house.gov/htbin/findrep_house?ZIP=)\n\n&#x200B;\n\nLetter Template:\n\nDear Representative \\_\\_\\_\\_\\_\\_\\_\\_\\_,\n\nI am writing because I believe that consent should be taught in schools in America. In a society where 1 in 3 girls and 1 in 6 boys  are sexually assaulted, something needs to be done. \\[1,2\\] The average age these children are affected is 9 years old. \\[3\\] The cost of this abuse is 23 billion dollars annually. \\[4\\]\n\nConsent is an important part of sex education, but it doesn’t need to be sexual in nature. There are age appropriate ways of presenting consent and teaching children that they have control over their own bodies, and they can say no if they do not want something. Helping children understand this and recognize warning signs will give them power over their body to mitigate grooming strategies from perpetrators and the tools to inform other adults about the abuse.\n\nPlease create federal mandates for ALL schools in the US to be required to teach age appropriate consent lessons to every grade K-12. Our current system is not enough.\n\nThank you for your time and consideration of this issue.\n\nSincerely,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nReferences:\n\n1. Dube, S.R., Anda, R.F., Whitfield, C.L., et al. (2005). Long-term consequences of childhood sexual abuse by gender of victim. American Journal of Preventive Medicine, 28, 430-438.\n2. Briere, J. & Elliot, D.M. (2003). Prevalence and psychological sequelae of self-reported childhood physical and sexual abuse in a general population sample of men and women. Child Abuse & Neglect, 27, 1205-1222.\n3. David Finkelhor, Kimberly J. Mitchell, and Janis Wolak, 2000, Online Victimization: A Report on the Nation’s Youth, National Center for Missing & Exploited Children: Arlington, VA. Darkness 2 Light. Statistics Surrounding Child Sexual Abuse.\n4. T. R. Miller, M. A. Cohen, B. Wiersema, Victim costs and consequences: A new look. (US Department of Justice, Washington, DC., 1996).\n5. Holmes, W.C., & Slap, G.B. (1998). Sexual abuse of boys: Definition, prevalence, correlates, sequelae, and management. Journal of the American Medical Association (JAMA), 280, 1855-1862.\n6. Lisak, D., Hopper, J. & Song, P. (1996). Factors in the cycle of violence: Gender rigidity and emotional constriction. Journal of Traumatic Stress, 9, 721-743.\n7. Finkelhor, D., Hotaling, G., Lewis, I. A., & Smith, C. (1990). Sexual abuse in a national survey of adult men and women: Prevalence, characteristics, and risk factors. Child Abuse & Neglect, 14, 19-28.\n8. Holmes, G.R., Offen, L., & Waller, G. (1997). See no evil, hear no evil, speak no evil: Why do relatively few male victims of childhood sexual abuse receive help for abuse-related issues in adulthood? Clinical Psychology Review, 17, 69-88.\n9. Widom, C.S. & Morris, S. (1997). Accuracy of adult recollections of childhood victimization part 2. Childhood sexual abuse. Psychological Assessment, 9, 34-46.\n10. Widom (1999). Posttraumatic stress disorder in abused and neglected children grown up. American Journal of Psychiatry, 156, 1223-1229.\n11. Felitti, V.J., Anda, R.F., Nordenberg, D., Williamson, D.F., Spitz, A.M., et al. (1998). Relationship of childhood abuse and household dysfunction to many of the leading causes of death in adults. American Journal of Preventive Medicine, 14, 245-258.\n12. Lisak, D. & Luster, L. (1994). Educational, occupational and relationship histories of men who were sexually and/or physically abused as children. Journal of Traumatic Stress, 7, 507-523.\n13. Dube, S.R., Anda, R.F., Whitfield, C.L., et al. (2005). Long-term consequences of childhood sexual abuse by gender of victim. American Journal of Preventive Medicine, 28, 430-438.\n14. Briere, J. & Elliot, D.M. (2003). Prevalence and psychological sequelae of self-reported childhood physical and sexual abuse in a general population sample of men and women. Child Abuse & Neglect, 27, 1205-1222.\n15. Arata, C. (2002) Child Sexual Abuse and Sexual Revictimization. Clinical Psychology, 9: 135-164.\n16. Hopper, J. (1998). Child Sexual Abuse: Statistics, Research, Resources. Boston, MA Boston University School of Medicine. Child Sexual Abuse: A Mental Health Issue. Kentucky Division of Child Abuse and Domestic Violence\n17. American Academy of Pediatrics, Preventing Sexual Violence, An Educational Toolkit for Health Care Professionals, The Facts about Sexual Violence, [https://www2.aap.org/pubserv/PSVpreview/pages/factsheet.html](https://www2.aap.org/pubserv/PSVpreview/pages/factsheet.html)\n18. Hanson, R. F., Resnick, H. S., Saunders, B. E., Kilpatrick, D. G., & Best, C. (1999). Factors related to the reporting of childhood rape. Child Abuse and Neglect, 23, 559–569. doi:10.1016/S0145-2134(99)00028-9. [http://www.nsvrc.org/sites/default/files/publications\\_nsvrc\\_factsheet\\_media-packet\\_statistics-about-sexual-violence\\_0.pdf](http://www.nsvrc.org/sites/default/files/publications_nsvrc_factsheet_media-packet_statistics-about-sexual-violence_0.pdf)\n19. David Finkelhor, Director of the Crimes Against Children Research Center. [https://www.victimsofcrime.org/media/reporting-on-child-sexual-abuse/child-sexual-abuse-statistics](https://www.victimsofcrime.org/media/reporting-on-child-sexual-abuse/child-sexual-abuse-statistics)\n20. National Center for Victims of Crime and Crime Victims Research and Treatment Center, 1992\n21. US Department of Justice Sex Offense and Offenders Study. 1997.\n22. Sobsey, D. (1994). Violence and abuse in the lives of people with disabilities: The end of silent acceptance? Baltimore: Paul H. Brooks. [http://aspires-relationships.com/the\\_invisible\\_victims.pdf](http://aspires-relationships.com/the_invisible_victims.pdf)\n23. U.S. Department of Health and Human Services. Administration for Children and Families, Child Maltreatment, 1995.\n24. Simpson, C., Odor, R., & Masho, S. (2004 August). Childhood Sexual Assault Victimization in Virginia. Center for Injury & Violence Prevention. Virginia Department of Health, Snyder, H N. (2000). Sexual assault of young children as reported to law enforcement: Victim, incident, and offender characteristics. National Center for Juvenile Justice, U.S. Department of Justice.\n25. U.S. Department of Justice, Office of Justice Programs, Sexual Assault of Young Children as Reported to Law Enforcement: Victim, Incident, and Offender Characteristics, by Howard N. Snyder, Ph.D., National Center for Juvenile Justice, July 2000, NCJ 182990, [http://www.bjs.gov/content/pub/pdf/saycrle.pdf](http://www.bjs.gov/content/pub/pdf/saycrle.pdf)\n26. The Alan Guttmacher Institute. 1994. Sex and American Teenagers.\n27. Hanson, R.F., Resnick, H.S., Saunders, B.E., Kilpatrick, D.G., & Best, C. (1999). Factors Relating to the Reporting of Childhood Sexual Assault. Child Abuse and Neglect, (23) 559-569; FBI Law Enforcement Bulletin\n28. David Finkelhor and Gerald Hotaling, Sexual Abuse in a National Survey of Adult Men and Women: Prevalence, Characteristics, and Risk Factors, Child Abuse and Neglect (1990), 14, 19-28.\n29. Finkelhor D, Browne A. The traumatic impact of child sexual abuse: A Conceptualization. J Orthopsychiat. 1985;55:530–541.\n30. Browne, A., & Finkelhor, D. (1986), Impact of child sexual abuse: A review of the research. Psychological Bulletin, 99, 66-77.\n31. Merrill, L.L., Newell, C.E., Gold, S.R., and Millen, J.S. Childhood Abuse and Sexual Revictimization in a Female Navy Recruit Sample. Naval Health Research Center, Pub. 97-5, 1997. [http://www.dtic.mil/dtic/tr/fulltext/u2/a331433.pdf](http://www.dtic.mil/dtic/tr/fulltext/u2/a331433.pdf)\n32. Larry K. Brown, M.D., et al, American Journal of Psychiatry 2000;157:1413-1415.\n33. Jennifer Brownell, Director of the local CAC, Finger Lakes Child Abuse Response Team [http://www.waynepost.com/article/20150802/NEWS/150809976a](http://www.waynepost.com/article/20150802/NEWS/150809976a)",
    "title": "Consent should be taught in every school",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1614555991,
    "score": 108,
    "keyword": "brown manager"
  },
  {
    "text": "Anonymous writings of a covid nurse - part 2 *One…two…three…four…five…six…seven….*\n\nIt takes me exactly three hundred and eighty-seven steps to walk the entire loop of my unit and arrive back where I started. I should know…I’ve counted it hundreds of times by now.\n\nBack in the days before when I could find the time, I would toss my Vocera at any willing coworker and meander around campus for fifteen minutes or so to get a break from the demands of being a bedside nurse. I’d wander outside to the employee patio and get a glimpse of the sky, sit next to the fountain, enjoy the sun a bit. Maybe pick my way through the gift shop and buy some trinket to bring home to my daughter. Sometimes I’d go visit my friends that had transferred to other floors. Such social calls were normal back then. It wasn’t always possible of course, but before all of this it was possible to find the time more often than it wasn’t.\n\nIt started with a single patient at first. Then it was two. Six. Fourteen. They’ll only be placed in negative pressure rooms, it was announced. That lasted for approximately five days. Then any positive case requiring less than six LPM were allowed in standard rooms. Thirty-five. We can handle it, our CEO proclaimed. There were plans in place. Fifty-three. Elective procedures were cancelled. PPE was short, you’ll need to reuse your N95. Place it in this brown paper bag and keep it on your iso carts. Nono, it’s perfectly safe, probably. Seventy-nine. Units were locked. Patient loads were getting top-heavy and cumbersome to manage. Incentive pay was announced. Then increased. Then increased again. One hundred and four. “Heroes work here” signs. Codes overhead every hour, the sickening feeling of ribs breaking under your hands. Exhaustion. Difficulty sleeping. Two hundred and twenty-two. So many stroke alerts. The sound of families sobbing over Zoom as their loved ones gasped their last breaths. Two hundred and fifty-four. Will this fucking pager ever *stop beeping.* Single rooms are now doubles, a Black Friday two for one. Two hundred and ninety-nine. Coworkers are getting sick at an alarming rate. Anna’s on the vent in MICU waitlisted to be transferred to a different facility for ECMO because we’re at capacity. Chris was just admitted, he’s on IMCU riding the vapotherm and looking like shit. Three hundred and thirty-one. Blistered feet. Nine days in a row and three more on the schedule. Crash intubation after crash intubation. The claustrophobic feeling of drowning in patients, tasks, and dexamethasone. Three hundred and eighty-eight. Bleeding cuticles, grinding teeth without noticing until your jaw aches. How can this continue? How can this…how….\n\n…\n\nAnd just when I thought this whole godforsaken house was about to collapse, it began to ease.\n\nI took to pacing my locked unit like a caged tiger after the last wave crested, turning corner after corner within the same four walls. There was still no time for campus walks anymore, and we were forbidden that sort of freedom of movement anyway. But by then it felt like a cardinal sin to sit down and do nothing. Returning to some semblance of normal didn’t quite feel normal to me yet. Instead, my usual fifteen minute cool-down period had turned into a way to expend bottled anxiety and energy.\n\n“Getting your steps in, Taylor?” my coworkers would ask.\n\nI’d fake a smile, nod, and keep going.\n\nTwo hundred and five. I cut down to a normal amount of overtime. One hundred and seventy-one. My arm hurt like a motherfucker after that vaccine. Ninety-eight. Electives resumed. Sixty. Floors were converted back to their original service designations. Fourty-four. My dad, full of optimism and synthetic mRNA, visited for the first time in eleven months. We drank a beer on the patio and laughed at the absurdity of the cardboard cutout fans in the stands of the game we were watching. Twenty-seven.\n\nIt’s oddly quiet around here now. The amount of emails I receive from administration have dropped off precipitously. During the surge, I would count the number of red-orange covid isolation signs taped to the doors on my daily prowls. At one point they adorned every single room.\n\nToday, I count three.\n\nIt feels as if the dust has settled a bit. The place looks normal but has the same palpable tension as an empty street, littered with the broken glass and spent tear-gas cannisters that inevitably follow a riot. We may have swept the debris into the gutters, but the memory of the event hangs in the air like the lingering scent of sulphur. The faces of my colleagues are no longer so worn. We’re all dealing with what we’ve seen in different ways. Some are dealing better than others. Some aren’t dealing with it at all. A stoic few deny there’s anything to deal with in the first place. This is what we do, they scoff. This is what we’re here for.\n\nI don’t know where I fall on this spectrum.\n\n“Try not to focus on all the lost causes,” my favorite tech instructs me after we rambled a bit on the topic at lunch. “I mean…have you thought about all the ones we saved?”\n\nI pause. It’s so easy to focus on the negative that I’m ashamed to admit I haven’t.\n\n“What about that one guy that was in bed 3 forever?” she continues. “You discharged him on New Year’s Day. He’d been on a vent for like two weeks. That was pretty amazing.”\n\nIt was, I agree.\n\n“And remember Mrs. Graham, or Garman, or…whatever her name was. She was here for over 90 days and walked out under her own power without oxygen.”\n\nI must have taken care of her at least a dozen times or better and I’d completely forgotten about her. Unbelievable.\n\nI spend the remainder of my two scheduled shifts catching my coworkers during lulls and asking them about their saves, too. Ashley tells me about Mr. Sacks who she discharged to LTACH. He’s walking now, she quips. Casey reminds me of another patient who was able to have their trach and PEG discontinued before leaving. That guy that had the stroke while SAPed? We thought he’d leave in a body bag but he’s back to work. And we all remember our most memorable case, a failed compassionate extubation that sent a freakin’ Christmas card to the staff after breezing through rehab.\n\nThe stories start piling up. Five. Twelve. Twenty-eight. I stop counting and catch myself smiling, feeling lighter than I have in a year.\n\nIt’s unrealistic to think that any of us will ever be exactly the same as we were before living through these times. God knows I won’t. But at least now, I can view these memories like a coin. One side contains all of the anger, the hurt, and the sheer misery that we were forced to stomach as we performed our duties. But the other? It holds the precious victories, the joy we saw on our patient’s faces as they left our facility. The times we went toe to toe with death and won.\n\nI’m back at work tomorrow morning. Maybe I’ll skip down to the fountain, take my mask off, and sit for a bit. It's past time to see if things still looks the same.",
    "title": "Anonymous writings of a covid nurse - part 2",
    "subreddit": "medicine",
    "timestamp": 1618002070,
    "score": 1186,
    "keyword": "brown manager"
  },
  {
    "text": "Level 4 L&D vs Level 4 NICU offer Hello fellow nurses! Maybe you remember me from a week ago, but this has been the magical week of dream offers for ya girl. I am in the sweet sweet position of have 3 verbal offers from unit managers (still waiting on official paperwork): postpartum unit transfer at my current hospital, L&D at a different hospital with a level 4 maternity unit and 400-450 births a month (not sure what this level means to be honest - I understand the difference of levels for NICU and adult ICUs though), and a level IV NICU from a local children's hospital. \n\nI'm trying to decide which offer I should take. I'm leaning towards L&D or NICU since they are non-HCA/non-profit hospitals, hourly pay seems like it's be much higher but waiting on confirmation (current hospital is owned by HCA). I would be in a fellowship training program for either the L&D or NICU with 4 months/16 weeks of preceptorship and intensive classes followed by monthly seminars. \n\nWhile last week I was leaning towards postpartum since it is a dayshift position and I'm getting married soon (end of April) and going to start trying for kids closer to the end of 2022 (we don't want to put it off too long since we're both 32), this week I'm leaning towards NICU or L&D for long term employability reasons - more job openings and contract work availability in major cities across the country (we need to move for soon to be spouse's job in a year or two), and I could probably always move to mother-baby later if I find the job I take to be too stressful/another bad match. It seems to be easier to move down in acuity than up in acuity when looking for jobs, but would be harder to move from L&D to NICU and vice versa (maybe not this year with a huge nursing shortage, especially where I live in the lowest paying major Texas city).\n\nI'd love to hear from nurses who work in NICU and L&D, or from nurses who left those specialties for something else: \n\nWhat do you love about your specialty? \n\nWhat do you hate/find hardest about it? \n\nDo you find your unit has a certain personality that does better there - this seems to be true of ICU nurses and many of my coworkers told me that I didn't have the typical ICU personality. My manager really pushed for me to consider L&D or Postpartum or even Oncology over neonatal critical care when I told her I was leaving. I wonder how seriously to take this recommendation.\n\nHow is Covid affecting your work? \n\nWhat would you estimate are the burn out rates among your colleagues? Especially lately? \n\nAre there generally more lifers/happy nurses on both of these units or is one specialty known for better satisfaction than the other? \n\nWhat would you tell me (an inexperienced first year nurse) to look out for when choosing between the units (especially when shadowing)?\n\nAre there any resources you'd recommend for someone new to your specialty? I already follow bundle birth nurses, if theres anything similar for NICU, let me know! \n\n&#x200B;\n\nAnd if you're dying to give advice: things I've liked in ICU are responding to emergency codes and the controlled chaos in the room/physical work of doing compressions and feeling useful and like I know exactly what to do, the sense of teamwork, working with patients and their families and trying to make ICU less scary/stressful, providing comfort and support to families who are losing a loved one (an ear to listen, a warm blanket, some coffee or juice). I find great satisfaction in the emotional labor of bedside nursing and my patients families typically appreciated having me as their nurse/would ask for me back and I took a lot of pride in that. I also liked learning about the different medications, procedures, and progressions, though I could be a little slow on mastering and applying the knowledge (I'm a hands on and visual learner who really needs to experience something for it to become instant recall, read and recall is weaker) - still I was never shy about asking for help and letting the more experienced nurses know that I think I know what I'm doing but would love their input/help to make sure. Loved seeing our surgical patients get better and go home/discharge straight from unit. I actually really liked our neuro ICU patients - both the long termers and acute post surgical, helping to control their pain, doing neuro checks, watching as they got better or worse, etc. Hated our medical ICU and covid patients. I would have probably stayed on the unit a full year or longer if I could work exclusively with neuro or post surgery patients. \n\nThings I hated: multiple code browns a night or cleaning heavy patients every few hours, worried about bring home disease and gunk to my family, worried about spreading covid to a friends child (many of their kids are under 5 and I struggled with immense guilt over rotating through covid ICU every few weeks and wanting/needing a social life as everyone else in the world returned to socializing in person), being behind in general pathophysiology knowledge and not knowing where to look for answers/not having time/feeling too burnt out when I got home due to full time grad school and full time work (graduating in December and would start new job in February so it won't be a continued problem), the general yuckiness of adult ICU patients and their seemingly endless amounts of sputum, pee, poop, etc that I and all of my coworkers needed help with cleaning - I think the endless nature and extreme sickness of the patients did it for me (but who really wants to clean up CDIFF poop all night on a total care patient?), but I have a dog at home and don't mind cleaning up after him, having creepy old men wanting me to hold their genitals while they peed/ wipe their bum. Hated feeling like a punching bag for stressed out charge nurses who weren't used to working with so many new grads with such acute assignments, etc. These reasons are why I'll never go back to an adult medical/mixed ICU, but I don't think they'll be huge problems on L&D or NICU.",
    "title": "Level 4 L&D vs Level 4 NICU offer",
    "subreddit": "nursing",
    "timestamp": 1635538789,
    "score": 6,
    "keyword": "brown manager"
  },
  {
    "text": "Does this describe your school? How modern segregation works in an American school... A user in the politics sub laid out in comments a very lucid account of how his seemingly integrated school is in fact very segregated and has very different outcomes for white and PoC students. I've seen aspects of this in schools I've worked in -- although not quite as stark or severe -- and I wondered how common this from the perspective of U.S. teachers here. And what can we as educators do to address this sort of structural inequality?\n\nThis sub doesn't allow x-post links, so I'm excerpting -- you can find the post on r/bestof.\n\n>At my high school the way it worked was the school itself was a very old  and historic downtown institution. Hundreds of years old.  Big beautiful  building literally on the tallest hill.  \n>  \n>Lots of famous people graduated from it in the early 20th century, and not surprisingly it was all-white for most of that time.  \n>  \n>\\[...\\] in the  2000s the freshman class was about 30% black and 20% Latino.  \n>  \n>It was a relatively good school; so it’s not a surprise that PoC students who lived in walking distance wanted to attend.  \n>  \n>And they *really* wanted to attend, because their other options were the two all-black high schools or the one Latino high school. \\[...\\]  \n>  \n>Side  note:  those two schools were literally toxic (built on a superfund  site), and literally crumbling (walls falling down). They were sh$t  holes.   The Latino high school was a little nicer, but still seriously  underfunded and >95% Spanish speaking IIRC.  \n>  \n>None of those three schools had college admission rates over 25% or graduation rates over 75%.  \n>  \n>Anyway,  the white kids however, were mostly rich kids who were 2nd, 3rd, 4th,  or even 10th generation students! \\[...\\]  \n>  \n>“4th  generation rich white kids” don’t live near downtown in the modern American Midwest city— so most of the white students were commuting up to an hour to get to class. \\[...\\]  \n>  \n>The school actually had a  very very big waitlist for these “out of district” spots, and was  operating significantly over capacity.  We even had portable “temporary”  classrooms set up on the practice football field.  \n>  \n>But the **alumni donations**  from these rich multigeneration families made up a large portion of the  operating budget of the school.  That money was the main reason the  school was so good!  \n>  \n>I know I’m getting a little off track here, but think about that dynamic.  \n>  \n>explicit segregation is illegal  \n>  \n>more rich white kids from the suburbs want to attend than you have space for  \n>  \n>parents of the rich white kids fund the school  \n>  \n>the school is way over crowded  \n>  \n>you can’t stop local black & brown kids from attending  \n>  \n>So what do you do?  \n>  \n>1️⃣ First, you segregate the students during the school days.  \n>  \n>You do this because the rich racist parents don’t want their brats going to class with undesirable black, brown, or poor people.  \n>  \n>This  is pretty easy to do, because the rich white kids are going to 1st-8th  grade at their suburban schools in a different district.  \n>  \n>Those suburbanites get funnled straight into an all-white “honors system” of classes on the first day of freshman year.  \n>  \n>The prerequisites for those “honors” classes are conveniently only offered at the suburban schools.  \n>  \n>PoC students have no way in.  \n>  \n>(I put “honors” in quotes because these kids were NOT smarter, and there were no tests they had to pass.)  \n>  \n>2️⃣  You make the school experience for the white kids as high quality as  possible while making the experience for everyone else as bad as  possible.  \n>  \n>The white kids’ have  nicer classrooms with lots of sunlight, digital white boards, and 20  students or so.  They have better teachers, and more rigorous academics  available to them.  They get guidance counseling aimed at helping them  navigate the college admissions process, etc.  \n>  \n>The  black kids are packed 33 at a time into crappy basement classrooms with  chalk boards. Their teachers are alcoholic sports coaches, and their  “counseling” is about picking a ~~menial~~ working class career  after graduation (something that doesn’t involve college, like:  mechanic, waiter, hairstylist, taxi driver, etc).  \n>  \n>3️⃣  You segregate all the extra curriculars as much as you can.  \n>  \n>The newspaper and yearbook were white.  The debate team was white.  \n>  \n>The  only integrated extracurriculars were a few of the varsity sports  (basketball, track, and football had black kids \\[...\\]  \n>  \n>Oh, and the choir and the school musical were integrated because they had open auditions.  \n>  \n>(Although  the drama department still managed to do a second big production every  year that was, you guessed it, more exclusive, bigger budget, and all  white).  \n>  \n>\\[...\\]  \n>  \n>4️⃣ you create a system to funnel the black and brown kids you don’t want there out of the school as fast as possible.  \n>  \n>This  can be done through selective enforcement of truancy rules. It can be  done with extremely harsh grading of the “bad” classes.  \n>  \n>Lots of ways to do it.  But the end result is pretty easy to describe in numbers, because my class size was nearly 1000 exactly.  \n>  \n>On the first day of high school, me and about 999 other students showed up.  \n>  \n>About 500 white freshmen (mostly from suburbs)  \n>  \n>About 300 black freshmen  \n>  \n>About 200 Latinx freshmen\n\n\\[...\\]\n\n>Of the 500 white students, about 50 would drop out or transfer before graduation.  BUT, a new 50 would transfer *into* the school.  \n>  \n>So  the graduating white class would be about 500. Over 95% of the white  graduates went on to attend a four year colllege, many of them Ivy  Leagues.  \n>  \n>Of the 500 PoC students,  about 250 would drop out, or be forced by the academic office to change  schools by Junior year.  Another 100 would drop out or transfer before  the end of senior year.  \n>  \n>About 150  total would graduate.  About half of them would go to college, and less  than half of that group would graduate college.  \n>  \n>So final score for “preparing students for life” is:  \n>  \n>500 PoC freshmen = about 150 high school diplomas and about 40 college diplomas.  \n>  \n>500 white freshmen = about 500 high school diplomas, and about 400 college diplomas.  \n>  \n>Also,  it’s hard to even know the distinction between drop out and transfer,  as the system was designed to hide the drop out rates.  My high school **officially** listed all drop outs as transfers.  \n>  \n>And the schools they “transferred” to?  They just never listed those kids as attending.  \n>  \n>The  kids functionally just disappear from the system like they have moved  out of state.   No one looks to check if that happened, because no one  wants to know.  But everyone knows.  \n>  \n>This is still happening to this day.  \n>  \n>It’s a nice neat little system beautifully encapsulating white hegemony & how *systems* can enforce white supremacy.  \n>  \n>\\[...\\]TLDR:  the system was  & still is essentially designed so that rich white kids can go to  their parent’s alma-mater downtown, but won’t have to interact with  black or brown students. The way that is achieved is by making life as  bad for PoC students as possible.",
    "title": "Does this describe your school? How modern segregation works in an American school...",
    "subreddit": "Teachers",
    "timestamp": 1619360404,
    "score": 438,
    "keyword": "brown manager"
  },
  {
    "text": "Nobody wants to do this job! I was hired as the 4th grade ELA teacher. Six weeks into the school year, the district decided that we didn't have enough students to justify two 4th grade teachers so I became self contained with 33 kids. District policy is that 34 students justifies 2 teachers. My co-teacher was moved down to 1st grade self contained with 30 students because the 1st grade teacher quit.\n\nAbout 2 months later, I am still self contained with 34 kids. My school managed to hire another 1st grade teacher, but they quit before even entering the building. Half the 1st grade is now taught by a TA. I am lucky enough to have an amazing TA assigned to my room full time, but for the last two weeks she has been called to sub in a different classroom almost every single day due to staff absences. Schools on my side of town have a \"reputation\" (\\*cough\\*black and brown students\\*cough\\*) so substitutes seldom accept jobs in this area. There's already a sub shortage so the biases have caused the well to run completely dry...\n\nA school in my city had to get rid of their 6th grade class because they could not find a single teacher or long term sub to teach the class. \n\nI am posting this with the \"rant \\[administration\\]\" flair but honestly, my admin has done everything they can to keep the ship afloat... The fact is that nobody wants to do this job. Y'all already know the reasons why. We're all on this sub to make sense of the absolute nonsense that we subject ourselves every day. \n\nI love teaching, I love my students, I love my school and my colleagues, but I hate this job. I completely understand why nobody wants to do this anymore. It's just getting exponentially worse as more and more teachers leave and the district/government does NOTHING to stop it.",
    "title": "Nobody wants to do this job!",
    "subreddit": "Teachers",
    "timestamp": 1636224139,
    "score": 23,
    "keyword": "brown manager"
  },
  {
    "text": "I'd like to work the weekend of my first week on the job to get up to speed with training. Should I ask my manager, or does that look like brown-nosing? What is the best course of action here?",
    "title": "I'd like to work the weekend of my first week on the job to get up to speed with training. Should I ask my manager, or does that look like brown-nosing?",
    "subreddit": "cscareerquestions",
    "timestamp": 1617899556,
    "score": 0,
    "keyword": "brown manager"
  },
  {
    "text": "My Personal Perspective of Big 4 Audit (UK) upon leaving after 5 years.   \n\nLast Thursday was my final day in Big 4 audit (UK). Whilst working my notice period I've had the opportunity to reflect on my time in the profession over the past few years. I thought it would be useful to write these down on the off-chance it could help provide some balanced perspective about Big 4 audit and give some honest feedback about my experiences.\n\n**Some background about me:** I joined over five years ago as a graduate, having studied accountancy and finance for my undergraduate degree at university. I spent the first 3 years as a trainee, working on audits whilst simultaneously sitting my professional exams, of which I  fully qualified as chartered in 2019. Over the past couple of years I have moved onto the role of senior, which has meant field managing on some larger engagements and acting as engagement manager on some of the smaller clients.\n\nA lot of my graduate intake left after 3 years, either to other client-facing roles internally, or externally into industry, doing a variety of jobs such as financial reporting, internal audit and management accounting/decision support. My decision to stay another two years post-qualification goes slightly against the norm here in the UK, but this was driven primarily by combination of a lack of knowing what I wanted my next move to be and wanting to still leverage the development and progression opportunities within Big 4 that would allow my next career move to potentially be a notch or two higher up the ladder at the exit stage.\n\nFirstly, to give some balance, here are what I consider to be the pros and cons of working in Big 4 audit based on my experience:\n\n***Pros:***\n\n* **It's a priceless addition to your resume/CV**. My experience with job applications and speaking to peers is that having big 4 in your employment history is at times already like having like one foot in the door for your next career move, particularly if you are moving to a big company. In the UK I know of some FTSE companies that hire predominantly from Big 4, some even exclusively too. There is seemingly still a bit of prestige about working at Big 4 therefore in the marketplace.\n* **The staff**. Cliché, I know, but I've worked with some of the most intelligent, friendly and helpful people during my five years. If you ever come across anything troublesome, whether that be a difficult client conversation, or something highly technical in terms of accounting, there is always someone within the company you can leverage for advice or help dealing with it. I was lucky enough to be assigned to engagements that had staff that were genuinely pleasant to work with alongside you in the audit room through the thick of it. Appreciate this won't be everyone's experience, but there is definitely an element of camaraderie of *\"we're in this together*\" that helps you get through the stressful times and long hours.\n* **Development and promotions**: It's tough going, but being thrown into the deep-end for a lot of it means that you do learn very fast and during your first few years, it's normal to be promoted every 12 months and improve your salary each time. Graduate salaries in the UK at Big 4 are typically quite modest, but within 3-4 years they pretty much double from what you started on.  I was also quite a shy and introverted person when I joined, and Big 4 has worked wonders on my soft skills and confidence. I can now comfortably hold difficult conversations with experienced senior management clients, carry out presentations to audit committees and facilitate training courses to an audience, all of which would have been terrifying to me a few years ago.\n* **Social**: Offices tend to be filled with quite like-minded people and are typically quite young too. This means that there is usually ample opportunity to attend social events, both official and unofficial. You get to attend team dinners, after work drinks where money is put aside behind the bar etc. \n* **Job stability**: audit staff turnover is significantly high and retention is a real issue at Big 4. As such, unless you do something completely inappropriate or commit serious misconduct, it's actually \\`very difficult to be fired or made redundant as an auditor.\n* **Opportunities to move elsewhere within Big 4:** Once you're in the door, if audit isn't for you, there is the ability to utilise the global nature and scale of the company you're in by transferring to another department or even another country. \n\n***Cons******:***\n\n* **Hours**. I've experienced necessary unpaid overtime at all grades during my time at Big 4. Busy season has also gradually extended beyond the classic Jan-March as you go up the chain and laterally for me has now reached the point where it's busy September-May. That's a significant amount of time and burnout is a real threat to all staff if expectations are not properly managed. Morale is generally quite low as a result which has gotten progressively worse over the years. It's just about manageable if you're busy period is confined just to a few weeks, but when there is a real lack of end in sight, it can become a struggle. It's also an awful environment if you have a young family. I've been in the office working late and overheard people saying goodnight to their kids over the phone because they've had to work late again. Fuck that.\n* **Difficulty in switching off**: Once you hit senior/field manager, it becomes very difficult to properly switch off during your time off. Unless there is an upcoming immediate deadline while you are away, handovers are not really a thing, and as a result you will be expected to pick things up as they were when you get back. Also there is a lack of cohesion on certain engagements between team members that mean some people will be forced to answer queries when they're on vacation/holiday because only you have the knowledge to answer it and nobody else has been involved with it. I purposely handed back my work phone so I could actually get around this and thereby making it physically impossible for me to respond, and forcing managers in the team to take on the responsibility for covering for me.\n* **Well-being**: this one particularly frustrates me given what a lot of people have been through during COVID. I think there is a genuine lack of understanding from senior management about the struggles of WFH that some people have, particularly those that either live alone, have inadequate working space/home offices, or even those that have joined the company and have only been working remotely since starting. A lot of partners and directors have young families, and are therefore blinded through ignorance about the struggles that some people often have because all they are personally experiencing themselves is getting to spend more time at home with their family, so anecdotally it therefore must be good for everyone else too. Also I truly believe that Big 4 are guilty of 'empty gesturing' - they will send firm-wide emails in relation to mental health, well-being and promoting staff to speak up if they are going through some struggles. Ultimately though, if you do speak up about it, sadly, there is actually very little that can be done to help the situation. There is so little flexibility in the business model or resourcing that allows things to be moved around. Everyone is busy and there is no slack. Moreover, I've also observed first hand people that have spoken up and then been passed over for promotion or had their career progression within the company stagnated. \n* **Stress**: I think a good proportion of the partners/directors have an attitude of \"as long as the work gets done, I don't care\" when it comes to staff well-being, stress and number of hours worked. My advice is if you're struggling with mental health as a result of this job, just look for another one - it really isn't worth trying to persevere through the struggles at the expense of your own health.\n* **Clients**: Don't get me wrong, some clients are very helpful and empathetic towards what we're trying to do. On the other hand though, a lot in my experience are incredibly frustrating. Combination of stubbornness, painfully slow response times (or straight-up ignoring) and sometimes even just being outright rude. You can be the most organised auditor and also be crystal clear with what you're requesting or asking of the client, but it can still be like pulling teeth at times. Client delays are the single biggest reason why some of my engagements have dragged on and been a mad rush at the end to complete. You are truly at their mercy but just don't take it personally because most of the time it isn't personal.\n* **Pay**: You can still live more comfortably than the average person in the UK, but relative to the hours you work and the baseline salary, you can probably get a higher paid job within accounting outside of audit quite easily. And without the same levels of stress too or number of hours.\n\n**Tips and general advice.**\n\nI also have some tips for seniors/field managers that may be useful for anyone moving into this role:\n\n* **Saying no**: It's ok to say no to additional work. If you have a lot on your plate and can't take on anymore, just be honest and say you can't do it. You don't want to get a reputation for being that person that is happy to pick up anything and everything going as you will just end up being a doormat for people around you to offload work to. All it does is sets an unsustainable expectation of you.\n* **Be nice to the EAs/PAs/secretaries**. They will save your bacon at some point when there is inevitably something that requires partner review or input at the last minute but their diary is typically full. It's definitely worth having them on your side.\n* **Find junior staff that you trust**. It will make your life so much easier if you can book the same people to your jobs that you know are competent and efficient, and will allow you to get on with your own work with minimal fuss.\n* **Don't forget your roots.** Remember what it was like to be junior staff. Treat them well and with respect. They should be your allies. The more coaching and patience you show, the more you will get out of them in the long-run. \n* **Make an effort to get yourself known to directors/partners**. I'm not obviously advocating anything like brown nosing etc. but a lot of opportunities in Big 4 come about because of who you know rather than what you know.\n* **Be forward thinking**. Look ahead at the calendar - consider what you need to hit the ground running an day 1 of fieldwork. Reach out the client and agree onsite days a couple of months in advance, send out deliverables lists out ahead, and make sure you have staff booked at the right grades and for the key dates in your audit plan.\n\n*TLDR;* It's a tough environment with long-hours and stress, but no regrets about working at Big 4 all considered personally. It's not for everyone though, and there is nothing wrong with that too.\n\nFor anyone still reading, thanks for taking the time to look over this. If there are any questions, feel free to respond below or drop me a DM and I can try to answer what I can.",
    "title": "My Personal Perspective of Big 4 Audit (UK) upon leaving after 5 years.",
    "subreddit": "Accounting",
    "timestamp": 1635258378,
    "score": 146,
    "keyword": "brown manager"
  },
  {
    "text": "Have any minority males here experienced racism/discrimination at work? I know many might not consider this a serious issue, and I do not wish to make light of this issue but I'm in need of help due to a couple of hurtful comments made by my coworker with regards to race.\n\nI'm afraid of getting into the details of the situation here but I\"m facing issues because 1) I'm a male and the system is absent from helping us with whatever mental health problems we have 2) I'm a minority - while the system has gotten better to help minorities in general, I have an ethnic name and I feel that if I make a complaint to HR, I could get fired.  It's very hard for me to find a job with my ethnic name.\n\nI'm just briefly going to say that a female coworker made a couple of comments about a certain race that I visibly resemble that has a negative stereotype in society.  Those comments were negative.  I spoke to the manager about this and she brought us together over a zoom call where the coworker apologized.  That coworker has now been promoted to supervisor.\n\nThere are times where I just cannot focus on my job due to her comments.  I have had thoughts about quitting my job or thoughts about suicide because I didn't feel like my career was progressing.  I'm hurt and I'm depressed, but I try to be as friendly, pleasant and happy as I can be to ensure that the signs of depression are not visibly seen.\n\nI don't know where to go from here without being put on the spotlight to get fired by HR.  I feel alone.  I don't want to blame any race (white, black, brown, Asian).  White people have come a long way to help minorities get adjusted.  Please do not assume that the person who has affected me is white.",
    "title": "Have any minority males here experienced racism/discrimination at work?",
    "subreddit": "Accounting",
    "timestamp": 1615396526,
    "score": 15,
    "keyword": "brown manager"
  }
]