[
  {
    "text": "I am losing my goddamn mind. Yeast infection that won't fully die/go away. Or just...vagina hell. Hi I'm 29F (Have PCOS and Insulin Resistance) and I have been in vagina hell since June 2023.\n\nI'd like to note at this time, my house did not have good AC/basically none and we were dealing with MASSIVE heatwaves. It all started when I got a constant sensation that I needed to pee, even when I just peed. I didn't go to the doctor for a bit, thinking I just needed to drink crap tons of water and it would go away. Two days went by and it didn't, so I talked to my doctor. I got a urine test, no results.\n\nI decided to see if there was something irritating it and found discharge that looked like wet toilet paper. I figured this was a yeast infection so I went to the doctor who just took one look and went \"Yep that's yeast\" and prescribed me diflucan. I took that and there was very little improvement. So I went back and she said the swelling was down and gave me another. It didn't get that much better, the sensation was still there. So I went to a hospital clinic and got tested there. She said I had BV, so I got antibiotics. Took that, felt better but then things came back all of a sudden. She figured it was the yeast from the last bit so she gave me more diflucan but for once a week for four weeks. Which did jack all. So I went back to my primary care. She said my sensation and even thin vaginal discharge was normal. I didn't feel like it was since I usually had clear or milky or none.\n\nI tried relaxing for awhile. (I even got to masturbate for the first time in months)  but it didn't do much better. So I went to the hospital again. That's when she diagnosed me with a UTI. I got two rounds and finally the constant sensation is gone but the discharge is still there. So I went back to my primary (For the record, each of them kept going on vacation so I had to go to the other), and she said it was just my body recovering. So I listened but then my vagina ITCHED like CRAZY. I had diflucan given along with the antibiotics so I got that. That made everything better almost INSTANTLY. But I was only given four days and after the fourth, things were getting bad again so I used monistat cream on the outside.  So far that has made things manageable and I was having better days but my discharge is still white and thick.\n\nI just went to the doctor AGAIN and got tested and she's saying there's no growth even though my discharge is still white, clumpy and thick.\n\nI have no idea what to do anymore. It feels like no one is listening to me. My periods have also not been fun as they have been like one-two days of blood flow and then the rest is brown and annoying. I am figuring that's because I messed up on birth control a few times and my hormones have to regulate. But I doubt that has anything to do with this.\n\nDoes anyone have any advice? Please? I don't have anyone really to ask about vagina things. My roommates are both AMAB and talking anything about vaginas with my mother will result in getting hung up on.  \n\n\nEDIT: Thank you everyone so much for your input! I have taken in affect everything based off my personal health and how I've been feeling overall. I have also been talking to my boyfriend and best friend. (My roommates mentioned above) They have been super understanding and supportive. My boyfriend's mother was a nurse so he asks her for medical things sometimes. So far I'm pretty sure I have a yeast infection still. Discharge is white, thick and clumpy. Still dealing with itching/irritation. My primary doctor is not listening to my concerns as the growth test was negative but I'm still having issues. My irritation does get some relief after going to the bathroom but not for super long. I also do not have the constant peeing issue as last night I even got to sleep fully and not wake up in the middle of the night or if I do? I just get up once. (I drink a full 16 oz. glass of water before bed for my other medication. So one time is normal for me.) \n\nI will be talking about boric acid things and anything with blood sugar will have to wait until the 20th for my endocrinologist. Just a general thing. I visit them every six months and they're a two hour drive from where I live. (Small towns are fun.) \n\nI'm sorry if I couldn't respond to everyone! I...don't have the mental capacity to handle all of this at once so I had to leave some comments be. I hope any other vagina haver can look at the advice given and use it! Seriously, they need to give us an instruction booklet for this hell. Anyway, everyone have a wonderful day and I'll let you know what my doctor says. (After I fight her AGAIN before going to the hospital clinic.)",
    "title": "I am losing my goddamn mind. Yeast infection that won't fully die/go away. Or just...vagina hell.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1696029825,
    "score": 281,
    "keyword": "brown manager"
  },
  {
    "text": "The funniest case of men trying a period cramp simulator: Lux Perry, CEO and co-founder of Canadian period management company Somedays, on Breakfast Television Toronto last August with Dina Pugliese, Sid Seixeiro and Devo Brown",
    "title": "The funniest case of men trying a period cramp simulator: Lux Perry, CEO and co-founder of Canadian period management company Somedays, on Breakfast Television Toronto last August with Dina Pugliese, Sid Seixeiro and Devo Brown",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1682657639,
    "score": 10,
    "keyword": "brown manager"
  },
  {
    "text": "First talking stage went shit, update to my previous post  \n\n16F's first serious talking stage did not go well. Rookie mistakes were made.\n\nHere's the story. I downloaded this stupid app called Wizz, its like Tinder for teens (i know what you're thinking, yes its as stupid as you may think, and yes all the guys are horny). I was dealing with my fair share of not so interesting guys, maybe 1 or 2 actually in my city, most of them from out of town, wanting nudes though. Then a guy messages me, lets call him A. A hits me up with this cringy ass Cars movie pickup line that I don't understand. I kinda asked him to clarify, he didnt really. Then I asked Snap AI, sent a screenshot to him showing that I asked AI and he said my stupidness was cute. We talked a bit and we exchanged Snapchat. From the start. it was a pretty romantic tone. He came on me kinda hard, and I was slowly falling for him. There were a few things I thought were cute, one that stood out to me is that he grew up in a Indian/Desi enclave (Brampton), so he was familiar with the culture. I liked this A LOT because I never had a guy understand it. He isn't completley conventionally attractive, but he is hot imo. Hes got a kind of smolder naturally, its pretty good. Anyways, we talked for maybe a day or 2 before I realized, it looks like he wants a girlfriend. I knew that I'm not too keen on being in a relationship rn, especially since my parents dont allow it. So I messaged him, and I told him \"Hey, yk I like u and i think ur cool but i feel like im not what you're looking for, so if a girlfriend is what you want maybe you should talk to someone else\". He says \"Ru trying to get rid of me\". I said no, I'm just saying if a girlfriend is what you want then maybe you should find someone else. He said lets try talking romantically. I said sure, why not. We got to know each other a bit, I found out his ex is a lot like me (Brown girl from GTA who likes kpop), etc. I will admit, the way we talked to each other, the fact he called me \"my love\", etc. was a bit too much like we were already dating. I thought about this, and I thought it was weird but I didnt act upon it, because I was falling for him, pretty hard. Soon the topic came to meeting in person. He really wanted to, I was not super keen. But, I agreed anyways. I liked him too much to say no, plus I was really attracted to him, and I havent even had my first kiss. I started realizing, this is the closest I've ever gotten to having a boyfriend. That excited me, I really wanted one. I started to get pretty attached. I've had some heartbreaks before because I got attached, but I feel like this one was the worst, especially since the attraction was mutual. We both liked each other, he would say \" I want u\", and \"I wanna see you\". I reciprocated. Anyways, past few days-ish he started getting a bit distant, and although he was a dry texter in general, he was getting worse. Also, he would not respond for a longggg time to my simple texts of hey how are you. This is probably the main reason he lost interest in me. I was a bit clingy, maybe even acting like a girlfriend. But also the tone was such that one would feel that way. This was my first talking stage too, keep in mind, so I wasnt very sure how this stuff works. Anyways, Pitbull is coming to our city for a music festival, and I really wanted to go. A had bought tickets for all days, so I thought im killing two birds with 1 stone. I struggled, but I managed to get tickets, and find someone I know to go with, and to also cover up for me (I told my parents I was going with her, but I was actually going to be with A). I texted him yesterday, saying hey, i bought the tickets! cant wait to see u in person.\n\nThis mf.\n\n\"Oh idk if I’ll be able to see u tho\"\n\n\"I Wanna be with my friends and I’m scared to meet yours\"\n\n\"Lately honestly I’m not feeling ready for a relationship\"\n\n\"My mental health is fucked\"\n\nhe FUCKING LED ME ON. SO BAD. HE PLAYED ME, HE MADE ME ATTACHED, AND THEN JUST LEFT AND NOW WANTS TO BE FRIENDS? HE SAID HE WANTS TO HAVE KIDS WITH ME, WANTS ME, WANTS TO SEE ME, WANTED TO TALK TO MY PARENTS AND CONVINCE THEM TO LET HIM DATE ME.\n\nWhere did this all come from? Well he said hed been feeling like this for not too long now, and that I should find someone else, but we can still be friends. I cant actually believestill went ahead and talked with this mf after red flags, like him ont really trying to get to know me, him following ig models (most notably a mom breastfeeding her child), etc.\n\nYall. The impact that this has had with me. I didnt sleep last night, I still feel like a numbness in my body, and a hole in my stomach. I thought we could be something, and then he springs this on me. Where was his mental health 2 weeks ago when we started talking? Why would he say he wants a girlfriend to love when hes not ready? He doesnt even want a situationship, so basically he wants no romance with me. I am extremely hurt, and might be my first real heartbreak. Ik im 16, ik what you're thinking. There will be more, even better. I agree, but it hurts a lot. I tried downloading Wizz again but theyre all the same, and I feel like I wont find someone like him. Yes I am desperate for attention I think, because I've felt ugly and unwanted all my life, and heres a guy who does like me, calls me cute, beautfiul, my love, and wants to be with me.\n\nSomeone help me please I don't know what to do.\n\n**tl;dr:** first talking stage went bad, I now feel sad and hurt, and I need guidance.",
    "title": "First talking stage went shit, update to my previous post",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689276510,
    "score": 0,
    "keyword": "brown manager"
  },
  {
    "text": "Do you ever meet someone and think “ Man I’m so glad they don’t have a call light.” ? There’s a man I know, we’ll call him jedd. Jedd will hold you to a conversation as long as possible. He’s a property management employee. In which the place I reside. When I was 38 weeks pregnant he stops me in my car and says “ I may stop by the hospital when you have your baby.” In my head I’m thinking ‘no you may not.’ Cause this man is 70ish years of age, and..I don’t know him at all. But he says he “may stop by”. It was odd but I politely declined with “ they don’t allow not related visitors.”\n\nFast forward to weeks later. Jedd and my dad got to talking; enough for my dad to agree to take him hunting. Jedd drive separately from my dad and arrives at the camp at 3am, wakes everyone up with the flash light through the tent “I’m here! I’m here!” The next morning, Jedd was complaining about the walking, so he decided to go back from camp. My dad, after a day of hunting, walks back to camp and sees jedd urinating outside the tent and go back inside. When he gets to the tent, jedd says “ can you grab my bag from my pickup? My glucose is really high and I just don’t have the energy to get up.” Whilst sitting next to him is a pile of Reese’s wrappers. \n\nThe following night he continued to eat Reese’s, one after another. And had to have a timer going off every 30 minutes to check his sugar all night long keeping everyone else awake. My dad finally falls asleep, and jedd wakes him up and says “ I can’t get the zipper of the tent open, I’m gonna pee my pants. So my dad hd to get him and let him out after finally getting to sleep. The following morning my dad made everyone breakfast. Eggs, sausage, hash browns. He hands a plate to jedd and jedd goes, “well I can’t eat that, my sugar will be too high.” \n\nAll this time I’m sitting here thinking, ‘thank god No one gave jedd a call light.’",
    "title": "Do you ever meet someone and think “ Man I’m so glad they don’t have a call light.” ?",
    "subreddit": "nursing",
    "timestamp": 1698472362,
    "score": 34,
    "keyword": "brown manager"
  },
  {
    "text": "How is the pediatric nurse environment? Had a terrible experience in BMT and nervous (Long post) \nTLDR in bottom\n\nDisclaimer: I understand now a heavy BMT unit is just not a new grad appropriate place because mistakes are more serious than a floor unit. Do not recommend for a new grad, maybe try it after you pick up your fundamentals.  \n\nNew grad in my first month. One of the top 4 hospitals had a job opening with literally “New grads welcome! BMT RN” so I happily applied since I do feel long term ICU care really can fit my interest. \n\nQuite literally I got the same vibes from my preceptor as I did in nursing school which is just a nurse who gets furious with any mistake. Imagine blonde high school bully from a Disney movie and you get the picture, it felt I could never win. It got so bad I would go to work tachy in the 130-140 range when I never am tachy besides a workout lol. \n\nIf I didn’t know something and asked how to do something it’s “why don’t you know that already?” And if I try to problem solve it’s “stop trying to pretend you know what you’re doing”. \n\nI actually never got critiqued besides one time when I was doing a sterile cap change for a central line on “just do the whole process, you don’t have to verify with me if this is right, I’ll correct you” which was fair. The other times I had the preceptor constantly TEXT the manager my mistakes while we are in the patients room and NOT tell me what I did wrong. \n\nI only was informed when I was called in the managers office. I got heavily critiqued and had a week to fix my mistakes and got fired with the explanation of “we expect you to have your med surg skills when you start”. \n\nI decided to switch specialties and now work at a heavy adult med surg unit, the staff is amazing for the most part even if we are short staffed. The population though is not for me long term. I really want to work with kids again. Though I think I do an okay job because a lot of my patients and families ask if they can have me as their nurse again lol. There's a lot more teamwork and a lot more support with asking questions a new grad might typically ask. So for developing fundamentals, the unit is good and that's why I'm staying here because the city in general is monopolized by this one huge academic peds hospital and the BMT manager never gave me the option to switch units but outright fired me.\n\nLast point because I feel its important to my unfortunate perception of peds is; I am from a very diverse city, I moved to a much more white dominated city because my wife is in med school here. We're planning on hopefully being elsewhere for residency that's more diverse populated. This matters a lot because in the unit I am (and I am not exaggerating), the only nurse who is not a white women and am a dark brown, southeast asian \"male\" nurse. There is quite literally no nurse, no NP or any staff besides the HUC who is remotely similar to my skin tone or background. Whereas the patient population is HEAVILY similar to my own ethnicity (side note: another reason I was really interested in this unit was this. How the nurses treat those patients and their families is a whole other issue that deserves a post honestly)\n\nI don't know how else to explain this so bare with my explanation, but the way people were looking at me was in a way I have never been looked at besides in one context. The only previous times i have been looked at with the vibe of you don't belong here (as a general gist of how it felt) is when I am in extremely white, very conservative dominated areas in the past. I asked other new grads do they also have this feeling assuming this is a new grad thing or if they have been thrown into drama and everyone said they have not. One experienced male nurse who is precepting another new grad told me that this unit just is very gossipy after talking about this. Who also said the mistakes I made is ones he's made in the past and the preceptors can be rude.\n\nAs I am already being thrown in drama with nurses who I have no clue who they are stating, and telling the managers, that I said \"This unit is easy, this is just a typical med surg unit. It's not hard to deal with this\" when I literally said none of this. This became an issue and the managers pulled me to the office to ask more about this and said that the staff in general is \"concerned\" about my approach as a nurse who is \"not taking this seriously\"\n\nTLDR; Is peds nursing super judgmental and am I going to be scrutinized for every detail or is it different in other units?\n\nEdit: sorry if this turned into a rant, I haven't been actually able to talk to any nurses about this experience so a lot of it might be a bit bottled up.",
    "title": "How is the pediatric nurse environment? Had a terrible experience in BMT and nervous (Long post)",
    "subreddit": "nursing",
    "timestamp": 1682956518,
    "score": 1,
    "keyword": "brown manager"
  },
  {
    "text": "New Pre-op/Pacu RN- I feel like a terrible nurse Help﻿! I need to ve﻿nt, or I need reassurance, probably both. I have been a nurse since 2018. I started out on an extremely busy intermediate care unit and had 4-5 fairly high acuity patients per shift, and was immediately overwhelmed, stressed, had daily panic attacks and cried in the bathroom multiple times a day﻿. It was terrible, I was told that if I co﻿uld survive that floor, I could work anywhere. I stayed there for a little over a year, and the COVID hit. I don't even know how I got throug﻿﻿h that time. I transferred to the ICU thinking it would be better for me, but I ende﻿d up hating it. I ended up severely depressed and unable to work, took some FMLA to try and re-evaluate my career choices. The problem was I was constantly running around like a chicken with my head cut off during that time, just trying to keep my head above water and keep patients alive, I don't really feel like I learned anything. After a few months, a friend and colleague from the intermediate care unit mentioned to me that she transfered to Endoscopy and loved it, and there was an opening for ﻿another nurse. I applied, got the job and absolutely loved it. It was amazin﻿g, everything about it. It was just \"easy\". 2 years later, we receive military﻿ orders and I have to leave. I am now working in a smaller hospital in pre-op/PACU and I feel like that baby nurse crying in the bathroom and having panic attacks all over again. I am SO OVERWHELMED. To the point where my brain just shuts off mid day and I can't even take in any more﻿ information. The charting is INSANE and so redundant, and I hate Epic.﻿ It is not uder friendly. I just feel like I will never be good enough, and never get it down. I doubt myself all the time, I﻿ have never felt like I have nurses intuition, or good critical thinking and time management skills. Frankly, I feel like an absolutely terrible nurse. Imposter syndrome? Or is it the truth? I just don't know what to do. I have almost 5 years \"experience\" yet I still absolutely feel like a new nurse, lik﻿e I know nothing. I had a legit panic attack tonight, brown paper bag, dry-﻿heaving , the whole shebang. It wasn't pretty. I really do like the﻿ staff I work with now, my preceptor is great, an amazing nurse which makes me feel worse, like I will never be her. But I can't keep feeling like this, or I'll have a heart attack before I'm 40. I can’t keep taking cry breaks at work, I look ridiculous. I would like to think I’m not a stupid person, but I just can’t seem to gain any confidence in my nursing skills. I feel like I just don’t belong in nursing 😭",
    "title": "New Pre-op/Pacu RN- I feel like a terrible nurse",
    "subreddit": "nursing",
    "timestamp": 1700085603,
    "score": 1,
    "keyword": "brown manager"
  },
  {
    "text": "Corporate BS is destroying my soul today. Just here to vent really. I know I don't have it half as bad as many others but the people machine is just wearing me out already this year.\n\nMy partner was fired from his management job at Aramark (fuck Aramark). I would say unexpectedly fired because they found some BS \"policy\" he broke and fired him immediately (no write ups, no priors), but I saw the writing on the wall based on the usual corporate shenanigans they were already up to. They basically forced his director into retirement at the end of 2022 (I assume because she knew she was about to be fired) and then refused to replace her or his regional manager who they relocated  because they're on a \"hiring freeze\". So instead they tried to double dip by making another director split his time between 2 locations. This director then picked the most brown nosing (and lowest paid) member of management to \"report\" (tattle for fear of her job) to him. She was ultimately who went running to the new director over the policy breech. So yeah, anyway- not surprised aside from never understanding the oppressed who lick the boots of their overlords.\n\nHe was upset but I told him flat out, fuck that job. They also fired another senior manager at another location the same day as him. I told him they're on some corporate profit bullshit and he'll be better off. I make decent money and unemployment isn't terrible (50% of his salary). He used to be employed by the hospital but of course Aramark got the food service contract and I fully believe they just didn't want to pay him what the hospital was.\n\nFuck Aramark and their CEO who got a 2.5 million dollar bonus in 2022. Scumbag.\n\nSo he filed for unemployment the day it happened (about 3 weeks ago) and the case worker or whatever called him, he answered all of her questions and explained that he was fired unexpectedly, deferred to HR when he asked what the policy was and how no one in HR would return his calls. Aramark also hadn't replied to the unemployment office either so we just figured whatever. Obviously we're an at will state, blah blah blah.\n\nWell this morning he got a letter DENYING him unemployment. Which is absolutely mind boggling to me. That was a hit I was not emotionally prepared for. Silly me I guess. So now we have no choice but to go through the lengthy appeal process and hope he can find another job with equal pay sooner rather than later.\n\nFuck Aramark. Fuck Bootlickers.\n\nI had more to say... grossly inflated wealth gap within my own job, no one caring about my department because we're good at our jobs so we don't \"create a need\" for development options while they create fancy Senior titles for upper management out of thin air.. Watching middle management get their bonuses and raises based off of our hard work instead because we make them look good. Not getting my Republican, Boomer, internalized-misogynistic coworkers to realize it. Watching them throw money at the C-Suite and promoting directors and VPs left and right to \"retain talent\" but fuck us hourly corporate peons I guess.\n\nOr how my son is suffering in the 4th grade... and I want to be so mad at his teacher, but also knowing she has more kids in her class than years on this earth... gets zero support from other parents with their hellion kids (probably because they're too busy working to death to have time to actually parent their kids) and is also probably under strict rules from the school district so they don't lose the only funding they get... all while not being paid shit.\n\nI could go on and on because the systemic bullshit is just hitting me all at once today and I'm so tired of it. I'm so tired I can't even verbalize all the ways this affects my family, not to mention so many other families who are worse off than mine. I'm so tired and I see no end to it. I have no answers or solutions.\n\nStay strong out there friends.",
    "title": "Corporate BS is destroying my soul today.",
    "subreddit": "WorkReform",
    "timestamp": 1676597880,
    "score": 21,
    "keyword": "brown manager"
  },
  {
    "text": "Write Down Everything I Do During The Work? Okay Boss!! So there I was at my maintenance job, fixing things and preparing vacant apartments. We were told day 1 that we need to write down what we do, but it doesn't have to be too detailed.  For example, if I fix a sink cartridge in apartment A000, on payroll I write down 9:00 - 10:00, fixed sink cartridge in A000. Replaced.\n\nSounds pretty simple and easy to understand, right?\n\nWell, I got assigned the objectively worst property to work on. Highest crime rate, pipes that are constantly breaking; I spent about 40 hours just organizing and sorting the shop when I got on site.\n\nThe big boss, to say he did nothing is a compliment, actively hurt our job and reputation, the details and such are a whole story for another time. One day, he decided that we were not working hard enough. This is because the hardest property was not filling empty apartments fast enough. So he told the entire maintenance team that we need to write down in more detail everything we do because \"if we were working 8 hours a day legitimately, we would have no vacant units.\" Mind you, we were also working on 2 other properties at the exact same time, and they were as full as possible. Things were already boiling, so we also decided it was quitting time at this point. \n\nNormally, my payroll was 1-2 pages long. However, I decided why not give him what he wants?\n\nMy last payroll entry was 28 pages long. Mind you, I was so done Friday I just wrote a couple of paragraphs about why I was leaving, so I could have made it longer. On average, 3 hours a day were spent filling out all these notes. I also made sure to include slight changes in how I wrote stuff, so that the big boss 100% knew I was doing exactly what I was saying.\n\nDid I also mention, they only let me work 6 hours a day? lol\n\nNow, I present to you some of my favorite sections :) For privacy, I am going to refer all apartment numbers as \"A000.\" We needed to mark which property we are at at some points, so those will be referred to as \"WORK,\" as well, I changed some words and names for privacy. Please enjoy!\n\n**March 6th:**\n\n10:26 Grabbed Spackle from Spackle Drawer\n\n10:26 - 10:27 Locked up shop and leaded back to A000\n\n10:27 Entered A000\n\n10:27 - 10:28 Put shop keys back in work jacket breast pocket.  Left work jacket on stove. Also, put spackle container in Bedroom #1\n\n10:28-10:31 Searched for Spackle knife in Bedroom #1, Bedroom #2, Bedroom #3, guest Bathroom, Living Room, Kitchen, Inside of OP's red tool bag, and inside of OP's blue tool bag.  Failed to find Spackle Knife\n\n10:31 - 10:32 Returned to Bedroom #1 and picked up Spackle Container\n\n\\-\n\n11:52 - 12:00 Unscrewed self piercing screw from shelf in Bedroom #1 Closet.  Placed shelf in living room against north wall.  Unscrewed 2 self piercing screws from bracket and placed next to shelf with bracket. Unscrewed 2 normal screws from closet poll and mounts, and placed next to shelf. Shelf will need to be cut, it is 1-2\" too long\n\n\\-\n\n11:10 - 11:40 Ate lunch at McDonalds.  Research shows that eating healthy foods leads to less brain fog and increases productivity.  As per my personal budget, I am unable to do that.  Expect lower productivity.\n\n\\-\n\n2:22 - 2:25 Cutting on ceiling of Bedroom #2\n\n2:25 - 2:28 Cutting on southern wall of bedroom #2\n\n2:28 - 2:31 Cutting on eastern wall of Bedroom #2\n\n2:31 - 2:34 Cutting on northern wall of Bedroom #2\n\n2:34 - 2:35 Cutting on western wall of bedroom #2\n\n2:35 - 2:36 Cutting on northern wall of bedroom #2 closet\n\n2:36 - 2:37 Cutting on eastern wall of bedroom #2 closet\n\n2:37 - 2:38 Cutting on southern wall of bedroom #2 closet\n\n2:38 - 2:39 Cutting on western wall of bedroom #2 closet\n\n2:39 - 2:43 Cutting on entry of Bedroom #2\n\n2:43 - 2:52 Painted Northern and Western walls of Bedroom #2\n\n2:52- 3:00 Painted ceiling of bedroom #2\n\n3:00 - 3:03 Painted Ceiling and Northern Wall of Bedroom #2 closet\n\n3:03 - 3:04 Painted western wall of closet in bedroom #2\n\n3:04 - 3:06 Painted southern wall of bedroom #2 closet\n\n3:06 - 3:10 Painted eastern wall of Bedroom #2\n\n3:10 - 3:12 Painted Eastern wall of bedroom #2 closet\n\n3:12 - 3:14 Painted eastern wall of bedroom #2\n\n3:14 Put lid on paint can\n\n**March 7th:**\n\n9:15 - 9:20 Went to WORK\n\n9:20 Parked in front of shop\n\n9:20 - 9:21 Unlocked and entered shop\n\n9:21 Turned on lights in shop\n\n9:21t Picked up bolt cutters from work bench\n\n9:21 - 9:22 Placed bolt cutters in 3rd cabinet, 3rd shelf, on top of hammer and 6 in one screw driver\n\n9:22 - 9:24 Picked up wire snips from work bench, and placed in 3rd cabinet, on 3rd shelf, next to ratchet star bits\n\n9:24 - 9:27 Picked up mini hacksaw, and placed in 3rd cabinet, on 3rd shelf, on top of wire snips\n\n9:27 - 9:30 Picked up wrench\n\n9:30 - 9:32 Placed wrench in 3rd cabinet, on third shelf, next to hammer\n\n9:32 - 9:42 Vacuumed up shop, starting in front of door to outside, and finishing about 2\" inside the doorway\n\n\\-\n\n10:30 - 10:31 I required the credit card for A000, to purchase much needed supplies and tools. Co-Worker, wielding both WORK A's and WORK 1's, threw them at me like ninja stars.  They glimmered in the oddly strong March sunlight.  With little time to react, I performed a backflip and caught both of them, one in each hand. \"Has the WORK A card finally been payed off and become useable?\" I thought to myself. \"Better bring both, you never know\" my thought concluded\n\n10:31 - 10:40 I traveled to the hardware store, parking in the 4th spot of the 2nd lane of parking.  Co-Worker doesn't like it when I park here, but he isn't here, so he can't complain\n\n10:40 - 10:54 Purchased stuff for A000\n\n10:54 - 10:55 Good thing I brought WORK 1's card.  WORK A’s card has still not been paid, so it was declined\n\n\\-\n\n2:23 - 2:24 Entered A000\n\n2:24 Put on left glove\n\n2:25 Put on right glove\n\n2:25 - 2:26 Sprayed Clorox Bleach Foamer, Kills 99.99% of Germs, on toilet in bathroom\n\n2:26 - 2:28 Sprayed Clorox Bleach Foamer, Kills 99.99% of Germs, on sink in bathroom\n\n2:28 - 2:31 Sprayed Clorox Bleach Foamer, Kills 99.99% of Germs, on tub in bathroom\n\n2:31 - 2:33 Sprayed Clorox Bleach Foamer, Kills 99.99% of Germs, on southern shower wall in bathroom\n\n2:33 - 2:35 Sprayed Clorox Bleach Foamer, Kills 99.99% of Germs, on Northern shower wall in bathroom\n\n2:35 - 2:38 Sprayed Clorox Bleach Foamer, Kills 99.99% of Germs, on Western shower wall in bathroom\n\n**March 8th:**\n\n9:00 Arrived at work in my personal vehicle and parked in front of WORK shop\n\n9:00 - 9:02 Went into shop\n\n9:02 - 9:17 Bathroom break\n\n9:17 - 9:20 Went to manager's office\n\n9:20 Entered manager's office\n\n9:20 - 9:22 Placed mail from the day in relevant locations\n\n9:22 - 9:24 Went back into WORK shop\n\n9:24 - 9:25 Exited WORK shop and locked up\n\n9:25 - 9:30 Walked over to A000\n\n9:30 A000 is locked and I forgot that I left the keys in the key box\n\n9:30 - 9:32 Furiously and upsettedly marched back to WORK shop\n\n9:32 Unlocked WORK shop\n\n9:32 - 9:33 Walked to manager's office\n\n9:33 Unlocked door to managers office\n\n9:33 - 9:34 Collected keys for A000 from key box\n\n9:34 - 9:35 Exited and locked manager's office\n\n9:35 - 9:37 Walked into WORK shop\n\n9:37 Exited and locked WORK shop\n\n9:37 - 9:40 Walked over to A000\n\n9:40 Finally unlocked A000\n\n9:40 - 9:41 Entered A000\n\n\\-\n\n9:55 Editors note: I wanted to change things up to improve engagement at work. Different work environments help me focus.  I shall start by changing my order of operations.  This happened earlier today.  Sorry for not having 100% accuracy\n\n9:55 Put on right Glove(previously did left Glove first)\n\n9:55- 9:56 Put on left Glove. This change has made me feel more engaged at work\n\n\\-\n\n10:22 - 10:23 Opened up sealer and started to apply it so the cabinets in the kitchen\n\n10:23 - 10:24 Sealed the top left western cabinet door\n\n10:24 - 10:25 Sealed the top left western cabinet body\n\n10:25 - 10:26 Sealed the bottom left western top drawer\n\n10:26 Sealed the bottom left western top drawer body\n\n10:26 - 10:27 Sealed the bottom left western bottom cabinet door\n\n10:27 - 10:28 Sealed the bottom left western bottom cabinet body\n\n10:28 - 10:29 Sealed the left cabinet door under the sink\n\n10:29 - 10:30 Sealed the right cabinet door under the sink\n\n10:30 - 10:32 Sealed the cabinet body under the sink\n\n10:32 - 10:33 Sealed the western corner cabinet door\n\n10:33 - 10:34 Sealed the western corner cabinet body\n\n10:34 - 10:35 Sealed the top right western cabinet door\n\n10:35 - 10:36 Sealed the top right western cabinet body\n\n10:36 - 10:37 Sealed the top left northern cabinet door\n\n10:37 - 10:38Sealed the top left northern cabinet body\n\n10:38 - 10:39Sealed the 2nd top left northern cabinet door\n\n10:39 - 10:40Sealed the 2nd top left northern cabinet body\n\n10:40 - 10:41Sealed the bottom left northern cabinet door\n\n10:41 - 10:42 Sealed the bottom left northern cabinet body\n\n10:42 - 10:44 Sealed the left cabinet door above the stove\n\n10:44 - 10:45 Sealed the left cabinet body over the stove\n\n10:45 - 10:47 Sealed the right cabinet body over the stove\n\n10:47 - 10:48 Sealed the right cabinet door over the stove\n\n10:48 - 10:50 Sealed the cabinet door next to the fridge on the northern wall\n\n10:50 - 10:52 Sealed the cabinet body next to the fridge on the northern wall\n\n10:52 - 10:55 Sealed the bottom right northern first drawer, the northern bottom right second drawer, and the northern bottom right third drawer\n\n10:55 - 10:57 Sealed the lower right bottom cabinet body next to the fridge on the north wall\n\n10:57 - 10:58 Sealed the top left cabinet door above the fridge\n\n10:58 - 10:59 Sealed the top right cabinet door above the fridge\n\n10:59 - 11:01 Sealed the top cabinet body above the fridge\n\n11:01 - 11:03 Moved everything related to sealing into the bathroom\n\n11:03 - 11:04 Sealed the left bathroom cabinet door\n\n11:04 - 11:05 Sealed the right bathroom cabinet door\n\n11:05 - 11:07 Sealed the body of the bathroom cabinet\n\n11:07 - 11:10 Move the sealant supplies back to the kitchen\n\n11:10 - 11:11 Sealed the window in the kitchen\n\n11:11 - 11:12 Sealed the south window in the living room\n\n11:12 - 11:13 Sealed the east window in the living room\n\n11:13 - 11:14 Sealed the window in bedroom #1\n\n11:14 - 11:15 Sealed the window in bedroom #2\n\n11:15 - 11:17 Exited A000\n\n11:17 - 11:18 Took off right glove\n\n11:18 - 11:19 Took off left glove\n\n11:19 - 11:20 Locked up A000, entered my personal car, and headed off to McDonalds\n\n\\-\n\n1:47 - 1:51 Wiped out drawer #2 in kitchen on north wall\n\n1:51 - 1:56 Wiped out drawer #3 in kitchen on north wall\n\n1:56 - 2:00 Sprayed all purpose cleaner in cabinet above stove\n\n2:00 - 2:06 Wiped out cabinet above stove\n\n2:06 - 2:12 Sprayed all purpose cleaner in top right cabinet on north wall in kitchen\n\n2:12 - 2:16 Wiped out top right cabinet on north wall in kitchen\n\n2:16 - 2:20 Sprayed all purpose cleaner in cabinet above fridge\n\n2:20 - 2:21 Left A000\n\n2:21 - 2:23 Reached shop\n\n2:23 Opened shop door\n\n2:23 - 2:26 Bathroom break\n\n2:26 - 2:28 Left through shop and locked up\n\n2:28 - 2:32 Returned to A000\n\n2:32 - 2:33 Entered and walked to kitchen in A000\n\n2:33 - 2:35 Sprayed all purpose cleaner in cabinet above fridge again\n\n2:35 - 2:40 Wiped out cabinet above fridge\n\n2:40 - 2:45 Threw away about 150 - 200 sheets of paper towels soaked in various stains and all purpose cleaner, into a black contractor bag.\n\n2:45 - 2:47 I forgot to write when I took my gloves off, so pretend they are here\n\n2:47 I also put on gloves again\n\n2:47 - 2:50 Cut up green weenies into smaller, more useable greenie weenies\n\n2:50 - 3:00 Did extra scrubbing on the inside of the cabinets.  While I would say they are at \"minimum viable product\" state, they still look gross to me.  Still ash stains, yellow nicotine stains, they do not smell anymore\n\n**March 9th:**\n\n11:00 Made a joke about “The big boss”  It was pretty funny (I legitimately wrote it like that lol)\n\n11:00 - 11:01 Peaced out from the manager’s office\n\n11:01 - 11:03 Left through the shop\n\n11:03 - 11:07 Took the scenic route to A000.  It’s actually a really nice day today.  Vitamin D increases happiness, which I have none at this job.  Unfortunately, 0 X 1 is still = 0, so we are operating with 0 happiness.\n\n\\-\n\n11:49 - 11:50 Grabbed the Clorox, Kills 99.99% of Germs, Bleach Foamer from the kitchen counter\n\n11:50 - 11:55 Sprayed the ever living Covid out of the spot where the stove was with the Clorox, Kills 99.99% of Germs, Bleach Foamer. That I grabbed from the kitchen counter\n\n11:55 - 11:56 Placed the bottle of Clorox, Kills 99.99% of Germs, Bleach Foamer on top of the Fridge.  A little cloud of cigarette dust poofed up from on top of the fridge.\n\n11:56 - 11:57 Grabbed our super amazing and tough long yellow scrub brush from the floor, and prepared for scrubbing\n\n11:57 Note, currently the floor is pure brown and black.  I have no idea what happened under this stove, but it looks like a rip in the space time continuum\n\n11:57 - 12:00 Scrubbed off the easy stains from the floor\n\n12:00 - 12:04 Scrubbed the brown patch that was in the middle, closest to me\n\n12:04 - 12:06 Scrubbed the western side of the floor where the stove goes.  A second scrub is needed\n\n12:06 - 12:08 Scrubbed the western side of the floor where the stove goes.  A third scrub is needed\n\n12:08 - 12:12 Finally, I scrubbed the western side of where the stove goes\n\n12:12 - 12:14 Scrubbed the north side of where the stove goes.  It turned from black to brown.\n\n12:14 - 12:16 Scrubbed the now brown north side of where the stove goes.  It’s a musty yellow now.\n\n12:16 - 12:18 Scrubbed the musty yellow north side of where the stove goes.  It’s good enough\n\n12:18 - 12:21 Scrubbed the greasy and grimy eastern side of the stove spot\n\n12:21 - 12:45 Finally got all that grease off of the east side where the stove goes.  Now it looks passible\n\n12:45 Ripped off a paper towel\n\n12:45 - 12:47 Wiped up some bleach\n\n12:47 Ripped off another paper towel\n\n12:47 - 12:48 Wiped up more bleach\n\n12:48 - 12:50 Ripped off even more paper towels, I have a giant ball of them\n\n12:50 - 12:55 Finally wiped up all the grime and Clorox, Kills 99.99% of Germs, Bleach Foamer off of the floor.  It’s finally passable\n\n12:55 Took off right glove\n\n12:55 - 12:56 Took off left glove\n\n12:56 - 12:58 Left A000\n\n12:58 - 12:59 Was walking back to the shop, but I saw an epic looking cloud, and I just had to take a picture of it.  Sorry, I’m not attaching photos\n\n12:59 - 1:01 Continued my walk to the shop\n\n1:01- 1:02 Walked into the shop and went to the bathroom\n\n1:02 - 1:12 Bathroom Break\n\n**March 10th:**\n\n3:00 - 3:25 Finalized everything that I need to do before I leave\n\n3:25 - 3:27 Turned in my keys\n\n3:27 - 3:28 Dobby has been given a sock\n\n3:28 -3:29 Dobby is a free elf\n\n3:29 - 3:30 I Quit\n\nNow, what happened after I left? Well, actually the whole maintenance team for the 3 properties quit.   We all sent out our emails Sunday night, which the big boss replied to instantly, asking what he can do to make us stay. Well, except for me lmao.\n\nA couple of days later, they posted a job posting for a maintenance personal manager. They never had one before, and it isn't even their idea! A different maintenance guy came up with it!\n\nRight before we quit, they also put Big Boss's spot up for hire as well.",
    "title": "Write Down Everything I Do During The Work? Okay Boss!!",
    "subreddit": "WorkReform",
    "timestamp": 1678938694,
    "score": 21,
    "keyword": "brown manager"
  },
  {
    "text": "I feel it’s time to make a complaint to HR about a coworker. Is this grounds? The newest worker at my company has been here almost a year and does a good job. Her personality however is grating to a lot of us. She’s a brown-noser, nosy, and loud. She doesn’t always read the room and can make things awkward. \n\nShe is very opinionated and a little too vocal and bossy. Just generally a pick-me. \n\nOver the past year, she has yelled at me once (about masking) and leaned over my desk in my face. Another time she yelled at me to mind my business while I was counting thank you notes I had to deliver, and she thought I read hers. \n\nWe ended up having to work in close quarters for a short time and she made a comment to me about how “no one better screw with my ability to do my work or they’re in for it” - uh, okay whatever, yell into the void. \n\nWell today she was given a task to do. It was working off something I had scanned. Somehow the scanner only grabbed one side of the each page, and my boss took the thumb drive it was on and left before we viewed it on my screen. \n\nShe marched over to me and was pissed, aggressively told me she couldn’t do her work because of my mistake and then just stood there glaring at me and shaking the papers at me. Yes, it was my fault. I said as much and she still stood there until I made it clear I was done talking. \n\nShe came and pulled our HR manager over and complained about it. I could hear my name once or twice and I am so angry right now. I don’t know if I should address her behavior, my mistake, or both or neither. \n\nI cannot stand her hostility toward me and I am thinking it’s time I address it. This is about the fourth time she has been aggressive toward me, even though I do not have the dates written down of the prior incidents.",
    "title": "I feel it’s time to make a complaint to HR about a coworker. Is this grounds?",
    "subreddit": "careerguidance",
    "timestamp": 1682450097,
    "score": 4,
    "keyword": "brown manager"
  },
  {
    "text": "Myy boss talks over me constantly. I'm on my way out, but how do I handle this in the mean time? My boss is the CEO of my small organisation. He isn't my line manager, but he may as well be - my line manager is effectively just someone that I ask for small logistical solutions and who approves my time off. Any larger issues or concerns with me wanting to be proactive on my projects so that things aren't last minute or crisis management are met by my line manager with, 'Well, did he tell you to do this thing? If not, you don't need to worry about it.' Which is true - I won't get in trouble. But my job could be much easier if I weren't constantly dealing with that.\n\nThe CEO and I have a meeting, usually weekly online, where I go through different stats and elements of my project and we discuss (read: he tells me, or I have to guess what's in his head) things moving forwards. \n\nDuring planning meetings, he has started to interrupt me - telling me to slow down (patronisingly slow), one thing at a time (I will literally be speaking about the thing he is talking about), or even actually slowing me down by talking over me and going 'up-bup-bup-bup'. And it's just. So fucking RUDE. It makes me want to hang up and say, 'You can call me back when you're going to speak to me like an actual person.'\n\nDo you have any advice for this? He is like this with everybody, but it is definitely slightly worse with me because I am a brown woman. The two senior managers in the company have advised that I just visually look annoyed or do a passive-aggressive sigh or something, and I'm like.......that seems like garbage???\n\n*To people who will tell me to just quit: I know I'm not in a great place right now. I love the work, but I am at the end of my tether with him, and have recently taken over my parents' business and am planning to leave, but am also hoping to use the extra income and secure a mortgage first, so I'm just putting up until then, then I can quit and focus on other projects full-time.*\n\n&#x200B;",
    "title": "Myy boss talks over me constantly. I'm on my way out, but how do I handle this in the mean time?",
    "subreddit": "careerguidance",
    "timestamp": 1694249424,
    "score": 5,
    "keyword": "brown manager"
  },
  {
    "text": "How do I play the game in my toxic workplace? TLDR: My covert narcissistic boss is playing with me and I’m too tired to play their game today. Please provide unbiased advice on what I can do to both not be the asshole and not the doormat they can walk all over.\n\nI work in social services and have been at the same agency for about 5 years. I used to receive recognition until I got promoted a couple years ago. My supervisor and our management team knew my work well and asked me to apply for this role & picked me out of 20 applicants (supposedly). \n\nThe org is huge and what we do mission-wise is amazing. But the top of the leadership chain is corrupt. Like criminal and lawsuit corrupt. But, I digress. In general, recognition here tends to be very showy, public, and brown nosing for those who get it at the org. \n\nMy ✋🏻 supervisor is playing a toxic game of chess with me. She doesn’t give me recognition or praise other than a quick thanks in passing. And then she talks about me to my peers, steals my ideas, exploit me, and make subtle and not so subtle digs and moves. She doesn’t provide any guidance or feedback feedback no matter what I do. I’m a very independent worker but what’s the point of having a supervisor if you can’t learn from them? I got all 4s and 5s and like two 3s on my performance eval out of a 5 scale. \n\nWhen I try to have respectful and DIRECT conversations with her about things that we see happening at the org that are harmful, our working relationship, other things I notice that are odd or harmful, she smiles and lies to my face that everything’s FINE or gaslights me. Then, she serves me on a platter to the higher ups by being like “this is important to get resolved but YOU go tell the higher ups” and then somehow I get thrown under the bus for something that I didn’t do. Someone told me and since I was made aware of it, she tells me I need to ensure the issues are resolved. The messenger gets killed no matter how gentle and sweet they deliver the message ever time!\n\nShe constantly doles out micro aggressions at me aka bite sized racism, homophobia, ableism, and fat phobic crap at me. She has also said discriminatory things about my disability. Being neurodivergent is awesome, so long as she can gain something from it and weaponize it for fun when she desires. And no, I didn’t disclose my disability. \n\nInterestingly, she does not do these things to the rest of our team. She babies them and hand holds them and sings their praises from the rooftops. She does talk down to, behaves passive aggressively, and throws other people under the bus outside our team though. It’s kind of her m.o. and why so many people dislike her except the people at the top.\n\nOf note, I’m not the only person of color on our team. However, on a team of around 10, I’m the only queer person currently. There have been 5 other queer staff in the last 3 years. They all quit within 5 months to a year. Most around 6-9 months. All under my supervisor. \n\nI am the only one who doesn’t act as though she is my lord and savior like the rest of our team. I believe in giving people their flowers bc even if I dislike someone’s personality or their behavior, everyone has value. I have shown my appreciation for her in the past both privately and publicly, verbally, or on our internal department page, in a little card, I gave her some tea to try and when she liked it, I brought her a box of tea, etc. Just small ways to show gratitude and I care without being nauseating. I’m just not a gross suck up like the rest of my team and it’s not working well for me. And yes, none of this situation happened by accident and I am replaying some fun stuff from my abusive childhood at work. I am very bad at playing the game and am trying to figure out how to leave gracefully with my sanity and dignity in tact. Please help me play the game a little better til I’m out. \n\nYesterday, she and the team did some passive aggressive crap to me in a larger group space. Since covid, this was one of our very first in person events. I think other people picked up on it. And, I think my supervisor finally realized she needs to start covering her ass. \n\nThen today, she posted a short and very shallow gratitude for each of us on the team. She has never done this before. The team, of course, brown nosed the fuck out of her in their replies. Thank you [insert deity supervisor’s name here] you are an inspiration, oooh phenomenal, bold leader ohhhh blah blah.. And she is eating it up, of course. I don’t know what to say in reply.\n\nAt first I naively thought aww is she trying to learn from somewhere about creating a workplace culture of belonging and recognition? But, then a colleague told me about what they heard about yesterday. And now I think it is more of her toxic, manipulation game. \n\nI think she is trying to cover her ass and create a paper trail. And get some narcissistic supply—two birds one stone. How do I reply without without falling for her trap? I don’t want to be disrespectful or passive aggressive by either not replying or saying some snippy thing about finally getting some recognition. And I also don’t want to engage in the gross covert narc worship. Thank you for your help with this charade!",
    "title": "How do I play the game in my toxic workplace?",
    "subreddit": "careerguidance",
    "timestamp": 1677887401,
    "score": 2,
    "keyword": "brown manager"
  },
  {
    "text": "What to do now? TLDR: Lesson I can't seem to learn is that it doesn't matter how hard you work, there is always some form of \"preference\".  \nHere's the deal, I work with a tech company where My hours of work are 8 to 5. Sometimes, I get meetings scheduled as early as 6am and at times I've worked until 10PM to get presentations setup or something is due. I also manage a high amount of accounts...  \nPromotion time comes and then...  \nThe person that gets a promotion is the one that has a bit of a brown nose with the manager, has a less than 5 accounts and quite frankly, this person has received feedback that is \"not a good fit\" for handling the higher end customers...  \nI seem to not learn the lesson in that hard work goes unnoticed when it really matters. Now, what to do? work the bare minimum? smile and nod and take it up the arse like an adult?.",
    "title": "What to do now?",
    "subreddit": "careerguidance",
    "timestamp": 1683824561,
    "score": 1,
    "keyword": "brown manager"
  },
  {
    "text": "Can someone explain to me how networking works? I am in my early 30s, professional degree, currently working on my masters part-time. I work in product marketing (positioning, pricing, product launch etc) at a senior analyst level position and I’ve been with the same company for 6.5 years, in various positions of increasing responsibility . I recently applied for a manager level role in a different department, and was told I wasn’t “visible” in the company. \n\nI took this to mean I don’t network enough. But what does “networking” actually mean? I work cross functionally all the time and I have great relationships with everyone I work with at my level and above. I’ve presented many times to senior leadership and have always had positive feedback, not to mention my manager has ranked me in the top category in my annual review for the past three years. I’ try to let my work speak for itself but apparently that’s not enough? I for sure don’t brown nose or take credit for things - I always try to give credit to the people I’m working with and to my team. Is that potentially holding me back?",
    "title": "Can someone explain to me how networking works?",
    "subreddit": "careerguidance",
    "timestamp": 1685620162,
    "score": 0,
    "keyword": "brown manager"
  },
  {
    "text": "I worked for Crowe LLP for about 7 months. Horrible experience I would say. Coming from a brown background (ethnicity) was definitely a huge factor in it. Mainly, I was always encouraged to ask questions but when I actually asked questions, my partners and senior managers claimed that this will take too much time from my incharges by distracting them. How come you’re going to encourage me to ask questions but then give me a hard time about?\n\nWhen I started my first month, I didn’t have a car and I was placed at a client location that would take me 2-3 hours to get their in transportation. Partner gave me a horrible feedback for not being able to make it there. Even though I communicated this to the senior manager and they were fine with it. \n\nCompany had two offices, one in Chicago and other in the suburbs. I was asked to move to Chicago because that’s where I was placed. Turns out, all my managers lived in the suburbs and wanted to meet there. Yikes, stuck in traffic all day where I had to pay ridiculous amount of rent just to be in Chicago for their office location. My managers would come in after traffic and leave before. Always claiming that they had an appointment. How come you have the same appointment every day at the same time? \n\nIn general, please don’t let anyone disrespect you or make you feel worthless. A lot of these people are ruthless and toxic to work with.\n\nI would like to know what people in the same industry think about this, or if they have experienced something similar to this.",
    "title": "I worked for Crowe LLP for about 7 months. Horrible experience I would say.",
    "subreddit": "Accounting",
    "timestamp": 1678982800,
    "score": 15,
    "keyword": "brown manager"
  },
  {
    "text": "Three people have been arrested after employees at a Kenyan cheese factory were allegedly forced to undress to check who was on their period. A manager at Brown's Food Company assembled female workers to find out who had thrown a used sanitary towel in an incorrect bin, an official said.",
    "title": "Three people have been arrested after employees at a Kenyan cheese factory were allegedly forced to undress to check who was on their period. A manager at Brown's Food Company assembled female workers to find out who had thrown a used sanitary towel in an incorrect bin, an official said.",
    "subreddit": "Feminism",
    "timestamp": 1688729392,
    "score": 245,
    "keyword": "brown manager"
  }
]