[
  {
    "text": "Anyone watching TNF? They just had a clip of Browns players doing a little assembly at a local elementary school that culminated in tickets to the Super Bowl being given away...to the principal. \n\nEven though that's the only person working in the building who could afford to go on a long weekend to Vegas, I'd still walk out.",
    "title": "Anyone watching TNF?",
    "subreddit": "Teachers",
    "timestamp": 1703821112,
    "score": 98,
    "keyword": "brown principal"
  },
  {
    "text": "California Elementary School Bullying Honestly this has been the most asinine school year so far. California education is certainly something special and not in a good way.\n\nMy son and daughter are in elementary school. My son is 8 and since the beginning of the year he’s had a female bully. I only mention her gender because the school is showing her extreme leniency due to her minority category AND being a female. My son is also in the minority category even though he does not immediately appear that way.\n\nAnyway, At the beginning of the year it started with name-calling. Then it escalated to her grabbing his hat off his head. Then it escalated to hitting him in the head while grabbing his hats off his head dozens of times. Then it escalated too frequently pushing him in line. Then it escalated to pushing him into a table in the cafeteria and trying to break his wrist. Then it escalated to her grabbing him by the head and throwing him to the ground and putting her weight on his neck. During the same incident, she attempted to punch him in the face. When this was unsuccessful, she tried to push him into a wall.\n\nEven though my son has never and would never touch her, they have implied that her assaults are excused because he was talking to her or, as in the most recent attack, he was \"antagonizing\" her during a game of four square.( she was mad that he got her out). \n\nWhere are all the adults and principal? Great question! We were not notified of the first physical assault. We had to learn that from our son. The school said that they are aware of her abuses and are “taking care of disciplinary actions”…..the next big assault(honestly all assaults are big, but I digress) I asked what the principal’s plan was for the bully and he pussyfooted and didn’t answer my question. “We’re addressing it”….\n\nNow this last assault. She put her weight on his neck restricting his breathing( my son is 60ish lbs, 4ft5 and this girl is 80ish lbs and roughly 5ft tall.) tried to punch him and attempted to throw him into a wall….\nAs a result of this violent assault we requested the child be put into a different classroom to which the principal said yeah that’s gonna be a no on that.\n\nThe principal has no official paperwork on her assaults(we asked for a copy). And he doesn’t even say what her crime is. He won’t say assault. He’s a mandated reporter but as far as I know the cops and cps have not been contacted.\n\nSo now I may have to get a restraining order on an 8 year old. None of these people are doing this young person of color any favors…..they are doing her grave disservice by basically sanctioning her violence because she’s clearly had no actual punishment. Example the school messaged me today to tell me that my son was too close to the bully during outside recess. He was enjoying running around and playing. He hasn’t assaulted anyone so why should his fun and enjoying be taken away because the bully could assault him. They should be telling HER to move away from him. She should spend recess stressed about where he’s at…..I see the trap that they are trying to set. I see the narrative that they are trying to spin. And I am pissed. Trying to create a narrative that he’s a problem child and make it seem like they tried to keep him safe. To cover their asses…..\n\nYes she has her rights as a student but just like if you assault someone in the real world you forfeit those rights. Or do they think that her rights are even more special because she’s a chocolate bar brown and he’s more of a roasted macadamia nut?\nOr is she more important because she’s a girl?\n\nLike literally Is it that goddamn hard to change her class?\n\nSide note: our daughter broke her arm and the nurse sent her back to class with a wet paper towel. Refused to give her ice. She went back to class for two hours in excruciating pain and we weren’t notified. When we came to pick her up she was distraught and when we looked it was very clearly broken……so do we trust the nurse to help our son if this bully severely hurts him? Fuck no!",
    "title": "California Elementary School Bullying",
    "subreddit": "Teachers",
    "timestamp": 1675224205,
    "score": 13,
    "keyword": "brown principal"
  },
  {
    "text": "Adaptive Assessment Gone Wrong The following are ACTUAL questions given to one of my 6th grade students on an adaptive math assessment provided by the Into Math program (which is created by Houghton Mifflin). I took pictures of the questions, so this is word-for-word from the assessment, typos and all.  \n\n\nWhich of these means the same as 34?   \nA) 3 divided by 4  \nB) 3 times 4  \nC) 4 divided by 3  \nD) 4 times 3  \n\n\nJenny exercised for 26 hour each day for 7 days. How many hours did Jenny exercise?   \nA) 146 hours   \nB) 913 hour   \nC) 232 hour   \nD) 1442 hour  \n\n\nMrs. Smith is making cookies. Her recipe calls for 68 cup of white sugar and 24 cup of brown sugar. How much sugar will Mrs. Smith use all together to make the cookies?  \nA) 23 cup  \nB) 34 cup  \nC) 118 cups  \nD) 114 cups  \n\n\nThe first time my student raised his hand to tell me he didn't think the right answer was offered, I brushed him off and told him to just do his best and choose whatever answer he thought was best. But as he kept raising his hand, I started to listen to him. It became clear very quickly that not only were the contexts of the questions absolutely ridiculous, but the correct answers were not among the options. I started taking pictures of the ridiculous questions and after the fifth time he raised his hand I was furious. I took the pictures to my principal and he was angry about it so he asked me to forward the pictures to him. Apparently he's going to forward them to the district where they will undoubtedly be ignored and swept under the rug.  \n\n\nThis adaptive assessment (called the \"Growth Measure Math Assessment\") is the only data my district will use to measure my students' progress other than the end of year state testing.  \n\n\nI don't know what my purpose is in posting this, but I just want to say how unfair it is that my district will hold me accountable for this student \"not making growth\" when this assessment is so clearly FLAWED- to put it nicely.  \n\n\nMy district exclusively uses this Into Math program by Houghton Mifflin and it's riddled with flaws like this. How is it okay that we spend an ungodly amount of taxpayer dollars on these math programs, only for them to create bogus assessments that waste my students' time and make me look like a bad teacher?  \n\n\nChatGPT could create a better assessment.",
    "title": "Adaptive Assessment Gone Wrong",
    "subreddit": "Teachers",
    "timestamp": 1675136121,
    "score": 10,
    "keyword": "brown principal"
  },
  {
    "text": "I have a meeting with my principal and a coworker tomorrow I teach at a very small charter school (I'm looking for another job for the fall).   My school does not have an ap so the lead teacher (who teaches middle school with me) acts as the AP in addition to \"teaching\".   She was good friends with the principal who left in November. We have our kids for 2 hrs each and she will leave for 1.5 hrs and want me to listen out for them.   \n\nWe are supposed to go to her with any questions we have.   If I ask her any questions, she never knows the answer.  I ask the principal if it is urgent and she hates it.   For example, we had to type up our goals for our evaluations.   They were due by the end of the day, i wasn't sure how many goals to write so I asked her (she didn't know).  Turning things in on time factors into our evaluations so I asked the principal (he told me three so I wrote 3 goals).   After school, another teacher asked her how many goals we needed and she said she didn't know.   They asked me and I told them I wrote 3.   The appraiser (someone we've never met before) sent emails to set up preconferences and I was the only one to response out of 14 teachers.   I had my preconference yesterday and one of the other teachers asked the lead what to expect and she told them to ask the brown-noser (me) since I know everything.   I told the teacher asking what I discussed in my preconference and the teacher felt better.  The lead made a comment that I always have to butt in.   The principal overheard and said the three of us need to have a conference so we can iron out our differences.   I think it will just make it worse.",
    "title": "I have a meeting with my principal and a coworker tomorrow",
    "subreddit": "Teachers",
    "timestamp": 1676422163,
    "score": 4,
    "keyword": "brown principal"
  },
  {
    "text": "If I plan to leave my job within a year, do I report someone's bad behavior (someone who is more senior than I am) or do I just play the game and eventually leave? Hi All,\n\nI'm a school administrator and could use some advice! I've been encouraged by the support in this subreddit, and thought I'd see if any of you have had similar experiences and advice for me, as this is the first time in the 12 years of my career in which I'm *really* unsure how to navigate the situation, namely, a higher-up.\n\nI currently work at a private school as a lower-tiered administrator (in other words, somewhat important, but not that important....think department head), and there is a more senior coworker (one of the assistant principals) who is extremely manipulative/crafty, smiles in everyone's face, but does things behind people's backs to try to elevate herself at the expense of others. She is also a **big** brown noser and her boss (the school principal) enjoys it and is blinded by some of the things she does when he's not watching.\n\nWithout getting into too many details, she has been actively trying to diminish my position/department, in hopes to take on more responsibility for herself and have more control at the school. This includes trying to take certain operations away from me for the upcoming year (but doing it slowly and craftily) even though I'm running things well; she also recently tried to poach one of my PT staff to work for her FT at a higher rate behind my back. While I have spoken up and pushed back (as I don't see myself as a pushover at work), I am also mindful that she is in a higher position of power and this might be a losing battle. The other administrators, including the principal, respect me and my work, but I also know my place!\n\nI'm already trying to figure out an exit plan (and started applying to jobs), but don't want to leave until I have something better lined up. My question is, if I'm planning to leave in the next year (and my job is *not* in jeopardy), do I just play the long game, go in with a good attitude, let her do her thing to get what she wants, and leave on a good note when the time comes? Or, do I set up a meeting with the principal (her boss) letting him know how I really feel, potentially sharing some of the things she's been doing in the background? I don't think anything will happen as a result of me speaking up (since her role is more important than mine, and the principal would likely take her side), but I really just want to speak up, say my piece (partly to put a small ding on her reputation and partly to not let her get what she wants)? I might *feel* better knowing that I'm standing and speaking up, but is it worth it though?!?? What would you do?\n\nSorry, I was going to keep this brief and to the point, but it ended being long! Thanks for reading!",
    "title": "If I plan to leave my job within a year, do I report someone's bad behavior (someone who is more senior than I am) or do I just play the game and eventually leave?",
    "subreddit": "careerguidance",
    "timestamp": 1701845145,
    "score": 3,
    "keyword": "brown principal"
  }
]