[
  {
    "text": "Unprofessional Boss I have a super unprofessional boss, and IDK what do to about it. She is one of those people who have been at the company for a long time, so logically she would be promoted to a managerial position, but that doesn’t necessarily mean she is a good “manager” if you get what I mean. \n\nI’ve worked here for over 2 years and I’ve never had a performance review or a discussion about where this job might be going for me. I’ve also brought up a few tweaks I thought our team could make that would make things better for everyone on the team, but she always shuts me down and insists we continue doing things the way we’ve been doing them. Also, one time I asked her for help with dealing with an aggressive coworker, and she looked at me in complete shock (like she just got electrocuted), and she said “I don’t think I can help you with that, maybe you should just talk to him yourself.” She’s utterly useless. \n\nOn top of it, we work in a small satellite office in Dallas (of about 5 people), and the main office is in NYC. Because her boss works out of NYC, I personally feel like she takes advantage. For example, she’s rarely shows up to our own office. She’ll let us know on the day of that something “urgent” came up and now she has to “work from home.” It’s almost every day that she has a new excuse; I honestly don’t know how she comes up with so many random and creative excuses (my cat seems sick, I think my house is infested with termites, my credit card was stolen, my A/C broke down, I have to pick my friend up from the airport, etc.)  And then, because I can tell from the instant messenger system our company uses, she is literally only “online” and on her computer for about 3 hours of the normal workday. \n\nFirstly, this bothers me because it’s just the principle. That she thinks she’s special and doesn’t have to work full hours like the rest of us, but probably gets paid like twice as much as we do. Secondly, this bothers me because she makes me do some of her work. In a normal situation, I wouldn’t mind helping my boss out, but it bothers me that she’s out gallivanting throughout town, while I’m at the office ALL DAY EVERY DAY doing her work, especially when I have a full plate of my own work as it is. \n\nI’ve brought up the fact that I and my other teammates seem to be drowning in work and how we thought we should hire more employees. The head boss in NYC said no, and insinuated that it was a budget restraint. So now it also bothers me that the company pays her however many dollars to work like 3 hours a day, so we don’t have the budget to hire real additional workers that we need. \n\nI feel like all hope is lost because she is such a brown noser to the head boss and I don’t think he would ever fire her. Our company as a whole is pretty small so we don’t have a real HR department to complain to. \n\nI’ve been actively looking for a new job for 8 months, but I haven’t landed anything yet, which is super discouraging. So, now I’m even more hopeless because I’m literally stuck with this horrible boss. I can’t simply quit because I need the money. \n\nTL;DR My boss is unprofessional, but there is no way to get her fired. I’m not sure what else there is to do. I’m trying to find a new job, but I’ve been looking for 8 months and haven’t landed anything yet.",
    "title": "Unprofessional Boss",
    "subreddit": "jobs",
    "timestamp": 1498835355,
    "score": 9,
    "keyword": "brown manager"
  },
  {
    "text": "If you're offered a job through a recruiter, could the employer circle back to you later on? Long story short, I was offered a job a month ago.  I ended up turning it down, but for some reason the recruiter insisted on doing the negotiations, and I'm nearly 100% sure that my actual salary requirements didn't make it to the company until the point where I turned down the job.  I'm also convinced that this resulted in the company itself seeing this as a money grab from my end.  The kicker is that the HR manager told the recruiter that had we \"gone in with this at first\" she thought they would have just offered it.  Conclusion: Fuck this recruiter.\n\nAnyway...It's been over a month since they offered me the job.  The job is still open, I know they're having trouble finding someone; the position is 60 miles from any major metro area and for the right price I was willing to drive it 3 days a week, but I imagine that there aren't many others, and especially not at the senior level I'm at.\n\nWhen I turned it down with the recruiter, I also sent a \"don't burn any bridges\" email to the HR manager, just mentioning that I feel like my requirements weren't accurately communicated and that it was my first time negotiating for a position through the recruiter and I was unfamiliar, etc.  I wished them luck in their search, and said I really liked the team and hiring manager, nose as brown as can be, yada yada.\n\nI know I'm the first they offered it to, I even know I'm the first they brought in for an interview.  I am the most senior person that was presented to them by the recruiter which does the majority of the placements with this company.\n\nMy question are:\n\n1. What are the chances the company might circle back to me if they continue to not find anyone?  \n2. At some point does their contract for this position end with the recruiter and what are the possible pit falls of going around them and coming back to me?\n3. Is that something that can even possibly happen, or is it a pipe dream?",
    "title": "If you're offered a job through a recruiter, could the employer circle back to you later on?",
    "subreddit": "jobs",
    "timestamp": 1501593701,
    "score": 0,
    "keyword": "brown manager"
  },
  {
    "text": "Why do all the soccer teams have white coaches/managers and none of them have a black, brown, Asian, etc?",
    "title": "Why do all the soccer teams have white coaches/managers and none of them have a black, brown, Asian, etc?",
    "subreddit": "AskReddit",
    "timestamp": 1503899533,
    "score": 3,
    "keyword": "brown manager"
  },
  {
    "text": "I spoke out against discrimination today I don't normally let people's hateful words bother me, but this...it was too much. I was sitting at my desk when a lady walked up, wanting assistance to order checks. She was older, seemed nice.\n\nShe sat down and I was pulling up the check order system when she goes, \"thank god you're not one of those brown people.\"\nI was taken aback. I couldn't have heard that right. \"Excuse me?\" Was all I could even think to say.\n\"I can never understand those Mexicans. And they can't help me. Thank goodness you're not one.\"\nI take a lot of shit at work. But that type doesn't fly. I gave her back her debit card and told her that if she wished to speak like that she could leave. She continued while she tried to take out her ID card, which was expired anyways. I told her I would not be able to help her today, and that she would be welcome to come back when she could speak about other human beings in a respectful manner.\n\nI know it's not a big thing, but that...I can't tolerate that.\n\nThanks for listening.\n\nEdit: To clarify some things. I work at a bank, and my manager heard the conversation and backed me up. We have a no tolerance policy for hate. I was firm but polite, I did NOT demean her. She did not make a scene. She said okay and left.\nAlso, I am also brown. I am mixed and my husband and his family are Mexican.",
    "title": "I spoke out against discrimination today",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1495755227,
    "score": 98,
    "keyword": "brown manager"
  },
  {
    "text": "Anybody else experience more sexism as a blonde? Usually a mousey brown, recently I've gone light blonde, aiming for white/platnium and in the last few weeks in my retail job, I've experience sexism on a daily basis from older men who either make sexual comments or completely disregard what I say, only to completely agree when a male staff member repeats what I said. \n\nI swear I didn't experience this when my hair was brown! Anybody else experience more sexism as a blonde? \n\nExamples? Refusing a return, saying the product isn't broken and works fine. Customer totally disregards me, but when the manager (man in 60s) comes out and repeats exactly what I said the customer smiles, agrees and walks out without a fuss. \n\nI've also had \"oh yeah girl, you can help me... But I'd get in trouble if you do\" \n\"thank you pretty young thing\" \n\"oh that's such a woman thing to say.. Is a man around? \"",
    "title": "Anybody else experience more sexism as a blonde?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1492584919,
    "score": 4,
    "keyword": "brown manager"
  },
  {
    "text": "I'm a Confused and Scared Virgin Convinced She is Pregnant. Please Help? Hi everyone. I just found this website a week ago and I have been spending a lot of time reading up on threads and such to get familiar. I think this is the place to be asking questions and getting advice for these sorts of things, but if not, could someone please point me in the right direction?\n\nI'm a 21 year old college student, and I feel like the universe is kind of conspiring against me. I've always had fears of intimacy because my parents are very \"wait until marriage\" centered, so I'm still a virgin, seeing as I live with them and I want to respect their rules. However, my boyfriend (22) and I have been taking very small steps to get away from that mindset, and I've finally managed to see sex and intimacy as something that isn't \"wrong\" or \"sinful\". My boyfriend and I have been together for six years and we are very serious about the idea of marriage when I graduate, so we thought that we were ready to take our relationship to the next level.\n\nOn December 4th, 2016 I felt comfortable enough to engage in oral sex (me to him). I enjoyed it, which I didn't expect, but I'm terrified that I somehow got pregnant from it. It's very irrational, I know, but I can't get the thought out of my head.\n\nI know it's incredibly unlikely that I am pregnant. I didn't allow him to touch me, not even with his hands and especially not with his mouth (I'm still much too shy and guarded when it comes to receiving pleasure instead of giving it). I'm scared that when I went to the restroom about 40 minutes afterward that I accidentally got semen from my hands or mouth inside me and impregnanted myself. When I went to the bathroom I discovered that I had started my period as well, so I thought maybe while I was wiping/ putting on the panty liner some managed to wiggle it's way in me. At the time I wasn't on birth control (parents refused to even talk about it), but I have since started it on January 31st. \n\nI thought my fears would go away once my next period rolled around, but it only brought more fear. Leading up to my period, I began experiencing \"symptoms\" of pregnancy. My lower back hurt a lot, I had headaches (something I had never had before this), but the worse thing was this pressure in my bladder/uterus area as well as this feeling of a \"bubble\" pressing down on my left ovary. The pressure in my bladder/uterus began on December 23, and continued until I couldn't stand it anymore and went to a hospital on December 28th. At the hospital I was so scared that they were going to tell me I was pregnant. They gave me a urine test, which came out as negative, and I also got a CT scan to see if I was having any internal damage. The CT scan found that I had a cyst the size of a large raisin that burst on my right ovary recently. Lab tests showed that I had a kidney infection/UTI, which explained the pain in my back and bladder. I was given a prescription for Macrobid and sent home.\n\nI was okay until January 2nd rolled around and I didn't get my period. This terrified me. Before this, I have only had one late period my entire life. My \"period\" shows up on January 6th (4 days late), but it's unlike any I've ever had before. It's mostly brown blood and it's so light I almost don't notice it. I typically have moderate to heavy periods, so this was a huge flag to me. As the day wore on the bleeding turned more red and I began seeing some of the \"chunks\" I'm used to, but I'm still not bleeding as much as usual. However, I'm mostly convinced my period has come and I'm safe. When I go to change my liner, however, I notice this chunk of flesh thing. It scares me because I assume I'm having a miscarriage or something. As the day wears on I get more and more of these fleshy things, some short and flat, others long and stringy. I break down and start crying because this has never happened to me before. I call my mother into the bathroom to show her and she laughs at me and tells me what I'm experiencing is normal, especially after a ruptured cyst. My mother was a nurse for 12 years, so I do believe her, but I'm not entirely convinced. My \"period\" continues very lightly until the 8th (unusual for me, because I typically menstruate for 4 days), stops on the 9th, and begins around noon on the 10th with very dark, small spotting that lasts about six hours. \n\nAlmost as soon as my period ends, my UTI flares up again. I go to the doctor and get a prescription for Cipro, and it clears out the bacteria and I'm okay again. Two days later I begin feeling the signs of another, I go back to the doctor, but this time my test comes up negative. He says he will send my urine off to be cultured to see if there is anything unusual in it. At this point I have a mental breakdown. This pressure won't go away in my bladder, but now I'm convinced it's my uterus. The \"bubble\" on my left ovary is still present. I can't sleep, I cry constantly, I can't focus on college or even my hobbies, all I do is stay on the couch and torture myself with fears of being pregnant. My fears cause me to see symptoms in everything. My back pain is omnipresent, along with my bladder/uterus and ovary pain. I'm dizzy, I have headaches, and my breasts are sore. I begin obsessively checking my breasts for signs of darkening or growing nipples, as well as if they're growing or feel sore. I don't notice any physical changes as far as size/color/vein popping goes, but the breast pain is definitely there. I begin \"tracking\" my ovulation based on my discharge, but since I've never done it before I find it very hard to trust myself. \n\nDue to the ruptured cyst, my mother makes an appointment with the Gyno. At 21 I had never been before, but I was scared and I just needed reassurance. I was so sure that he'd find why this \"bubble\" on my left ovary never went away, and I could get medicine and be okay. He does the exam and tells me that my ovaries and breasts are completely normal, and he sends off my samples for a Papsmear. He asks me to meet him in his office and I'm so relieved, because I can finally get answers to my questions. \n\nWhen I get to the office my mother is there. Instead of letting me talk to the Gyno, she does most of the talking and makes me feel like a little kid. The Gyno prescribes Apri birth control for me, with instructions to begin it on the first day of my next period. He tries to leave, but I buck up the courage to ask to speak to him privately. My mother leaves the room and I ask him if the situation with my boyfriend could have led to pregnancy. He basically tells me that it's silly to think anything like that could lead to a baby, and that my fear/symptoms are all in my head. I'm not convinced but there's nothing else he can do for me. He sends me home, and I begin taking pregnancy tests.\n\nMy boyfriend has bought me so many pregnancy tests, I bet he's lost at least $30. I took the tests on the following dates: December 28th, January 8th, January 15th, January 21st, January 28th, February 3rd, and February 5th. Since then he has bought me three more tests that I have yet to take. All the above tests came out negative, and they were a mixture of First Response, Clearblue, and Clearblue Digital, as well as those simple \"dip\" tests that doctors/hospitals do. Each time I see \"negative\" I feel much better, but in a day or two my \"pregnancy symptoms\" return and I begin worrying again. I've lost six pounds from stress, because I simply don't have an appetite anymore. Once I took a bite from a fried egg and it tasted like rat poison. Since then I have forced myself to eat fried eggs, just to be sure that I'm not missing any \"symptoms\". No food has bothered me since then.\n\nHowever, when I got my \"period\" again, it was even worse than the last one. It started January 31st, which is almost a whole week early, and it was brown as well as light. I had very, very few \"chunks\" and those I did have were small. I again had the \"flesh\" (which I've since Googled and learned were chunks of my uterine lining that didn't dissolve), and I bled for only 2 1/2 days. I began my birth control and I have been taking it every night at exactly 9:00, and so far I don't seem to be having any side effects.\n\nHowever, for almost three months I've been plagued by this feeling of a \"bubble\" on my left ovary. Some days it's so bad I can't wear a belt, and I spend all the time I can in my pajamas. The pressure on my bladder/uterus is always there, and I'm terrified that that means that I'm pregnant. Sometimes it feels like my bladder/ uterus is a piece of taffy that is being stretched until it snaps back into place. I've never experienced this sensation before I was intimate with my boyfriend, and when I went to my Urologist she couldn't explain it, and she has me booked for further testing on March 1st. I'm at a loss as to what to do.\n\n2X, I've never been so scared in my life. I know it's incredibly unlikely that I am pregnant, but I feel like all the signs are there that I am. I've gotten so many negative pregnancy tests and I continue to get them, but it doesn't comfort me when it constantly feels like a baby is laying on my bladder while squeezing my ovary in its fist. If I was pregnant I'd be 9 weeks. Are these symptoms of a nine week pregnancy? Am I overthinking this? \n\nAll this has done is contributed to my fear of intimacy. My boyfriend is scared to touch me because of how I've reacted to all this, and I'm afraid I'll never be \"ready\" for actual sex after this. I want so badly to tell my parents about my worries, so that I can see a Gyno and get a bloodtest or ultrasound and know for sure, but if they knew that I was being intimate with my boyfriend, they would never allow me to see him again, and I'd be the family mockery. Sex is worse than drugs to them, it seems. I'm terrified of disappointing them, but I'm even more scared of being pregnant. I don't know what to do anymore\n\nCan any one give me advice or alleviate my fears? Any tips on how to tell my parents? Or am I worried about nothing at all? Has anyone experienced any ovary/uterus/bladder pain that's similar? I'm lost and I have no one with sexual experience to turn to.",
    "title": "I'm a Confused and Scared Virgin Convinced She is Pregnant. Please Help?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1486660943,
    "score": 0,
    "keyword": "brown manager"
  },
  {
    "text": "Data behind ACLS guidelines for medicines From time to time (but certainly no less than weekly, with the last one being [this one](https://www.reddit.com/r/medicine/comments/6hi5ya/not_medical_advice_1mg_epinephrine_ivp_during/?ref=share&ref_source=link)) threads pop up where the ACLS guidelines come into play. Sometimes because someone didn't follow them, sometimes because someone claimed they were followed the wrong way.\n\nWe rarely discuss why we have the guidelines we have, and never if this constitutes the standard of care, if it is evidence based guidelines or if it is a list of what some people think you should do.\n\nThe latter is true, and it is actually based on animal studies during the 60ies, namely [Redding JS, Pearson JW. *Resuscitation from asphyxia.* JAMA. 1962 Oct 20;182:283-6.](https://www.ncbi.nlm.nih.gov/pubmed/13973494/) and [Redding JS, Pearson JW. *Resuscitation from ventricular fibrillation. Drug therapy.* JAMA. 1968 Jan 22;203(4):255-60.](https://www.ncbi.nlm.nih.gov/pubmed/5694097/) where the second one found\n\n> Resuscitation [of dogs] was more successful when epinephrine was used than when no drug therapy or sodium bicarbonate were used. \n\n**Vasopressors**\n\nThe ACLS algorithm since at least 2009 have included adrenaline/epinephrine 1mg every 3-5 minutes. This is based on a single randomized study ([Jacobs IG, Finn JC, Jelinek GA, Oxer HF, Thompson PL. *Effect of adrenaline on survival in out-of-hospital cardiac arrest: A randomised double-blind placebo-controlled trial.* Resuscitation. 2011 Sep;82(9):1138-43. ](https://www.ncbi.nlm.nih.gov/pubmed/?term=21745533) which is best summarized by their own conclusion\n\n> Patients receiving adrenaline during cardiac arrest had no statistically significant improvement in the primary outcome of survival to hospital discharge although there was a significantly improved likelihood of achieving ROSC.\n\nROSC isn't the end result of CPR, survivability is. The same conclusion is shown in other retrospective studies as well, e.g. [Hagihara A, Hasegawa M, Abe T, Nagata T, Wakata Y, Miyazaki S. *Prehospital epinephrine use and survival among patients with out-of-hospital cardiac arrest*. JAMA. 2012 Mar 21;307(11):1161-8](https://www.ncbi.nlm.nih.gov/pubmed/?term=22436956) which concludes that while more patient in the epinephrine/adrenaline group achieved ROSC they were equally likely (actually slightly less likely) to be discharged.\n\nAnother study found that among patients who are at a hospital when they fall into cardiac arrest early ephinehrine/adrenaline push (as within 2 min of the first defibrillation which is against the guidelines that says after defibrillation nr 2) is associated with a worse outcome, per [Andersen LW, Kurth T, Chase M, Berg KM, Cocchi MN, Callaway C, Donnino MW; American Heart Association’s Get With The Guidelines-Resuscitation Investigators. *Early administration of epinephrine (adrenaline) in patients with cardiac arrest with initial shockable rhythm in hospital: propensity score matched analysis.* BMJ. 2016 Apr 6;353:i1577.](https://www.ncbi.nlm.nih.gov/pubmed/?term=27053638)  \nIt is a short article, well worth a read (and it is open access), but here is an excerpt\n> In conclusion, we found that early administration of epinephrine after the first defibrillation (that is, contrary to guidelines) was common (>50%) in patients who experience cardiac arrest in hospital with a shockable rhythm. Moreover, the provision of epinephrine at this time point was associated with a decreased chance of good outcome, including decreased in hospital survival.\n\n**The AHA guidelines**\n\nThe ACLS guidelines are heavily based on the [AHA guidelines](https://www.ncbi.nlm.nih.gov/pubmed/20956224/).  They say\n> It is **reasonable to consider** administering a 1 mg dose of IV/IO epinephrine every 3 to 5 minutes during adult cardiac arrest.\n\nReasonable to consider is the wording used. Think about that for a minute. \n\nI would also like to add that high doses of epinephrine/adrenaline is associated with a worse outcome. If that is because the patient is in cardiac arrest for longer, or because the people doing it are less experienced and doesn't follow protocol is hard for me to say. \n\n**Amiodarone**\n\nThere are 2 studies (ALIVE and ARREST). Neither was powered to really detect what we are interested in (survivability). \n\nThe first of these two, [Dorian P, Cass D, Schwartz B, Cooper R, Gelaznikas R, Barr A. *Amiodarone as compared with lidocaine for shock-resistant ventricular fibrillation.* N Engl J Med. 2002 Mar 21;346(12):884-90.](https://www.ncbi.nlm.nih.gov/pubmed/?term=11907287) found that more patients who got amiodarone was admitted to the hospital, but failed to show (due to how it was constructed) that they were discharged more often. The second trial ([Kudenchuk PJ, Cobb LA, Copass MK, Cummins RO, Doherty AM, Fahrenbruch CE, Hallstrom AP, Murray WA, Olsufka M, Walsh T. *Amiodarone for resuscitation after out-of-hospital cardiac arrest due to ventricular fibrillation.* N Engl J Med. 1999 Sep 16;341(12):871-8.](https://www.ncbi.nlm.nih.gov/pubmed/?term=10486418) showed the same, but didn't focus on survival to hospital discharge.\n\nTherefor the evidence is lacking. And again from the AHA  \n> Amiodarone may be considered for VF or pulseless VT unresponsive to CPR, defibrillation, and a vasopressor therapy (Class IIb, LOE B). An initial dose of 300 mg IV/IO can be followed by 1 dose of 150 mg IV/IO.\n\n**Edit 1.** /u/transmogrification pointed me towards another study, more recent then the above, [Kudenchuk PJ et al. *Amiodarone, Lidocaine, or Placebo in Out-of-Hospital Cardiac Arrest*. N Engl J Med. 2016 May 5;374(18):1711-22.](https://www.ncbi.nlm.nih.gov/pubmed/?term=27043165). This study concludes that\n\n> neither amiodarone nor lidocaine resulted in a significantly higher rate of survival or favorable neurologic outcome than the rate with placebo among patients with out-of-hospital cardiac arrest due to initial shock-refractory ventricular fibrillation or pulseless ventricular tachycardia.\n\nbut also\n\n> Finally, the point estimates of the survival rates in the placebo group and the amiodarone group differed less than anticipated when the trial was designed, which suggests that the trial may have been underpowered.\n\nSo there still may be a difference, but you would need 9000 study participants to find it with a 90% certainty. If it did have an effect of ca 3% that would be 1800 lives per year it could save, but the data as is doesn't support an effect larger than 3%.\n\n**Fibrinolysis**\n\nA lot of cardiac arrests are due to PE or AMI, and it would there go to reason that treating the clots would have an effect on survival. The problem is that when you give tPA you don't actually know why the patient went into cardiac arrest, and there hasn't been shown any benefit (a bit better effect on survival to ICU admission has been found), see [Böttiger BW, Arntz HR, Chamberlain DA, Bluhmki E, Belmans A, Danays T, Carli PA, Adgey JA, Bode C, Wenzel V; TROICA Trial Investigators; European Resuscitation Council Study Group. *Thrombolysis during resuscitation for out-of-hospital cardiac arrest.* N Engl J Med. 2008 Dec 18;359(25):2651-62](https://www.ncbi.nlm.nih.gov/pubmed/?term=19092151) and [Böttiger BW, Bode C, Kern S, Gries A, Gust R, Glätzer R, Bauer H, Motsch J, Martin E. *Efficacy and safety of thrombolytic therapy after initially unsuccessful cardiopulmonary resuscitation: a prospective clinical trial.* Lancet. 2001 May 19;357(9268):1583-5.](https://www.ncbi.nlm.nih.gov/pubmed/?term=11377646).\n\nIf we could select the right patients that may change, and with an increased amount of ultrasound used by ICU docs and even used during CPR we may be at a point where it is worth redoing such a study at a hospital (my own point of view).\n\n**Edit 2** As pointed out by the PEAPETT study [Sharifi M, Berger J, Beeston P, Bay C, Vajo Z, Javadpoor S; “PEAPETT” investigators. *Pulseless electrical activity in pulmonary embolism treated with thrombolysis (from the \"PEAPETT\" study).* Am J Emerg Med. 2016 Oct;34(10):1963-1967](https://www.ncbi.nlm.nih.gov/pubmed/27422214) and /u/macreadyrj there have been newer studies then the ones cited above. However PEAPETT included 23 patients where 16 had a previous diagnosis of PE by CT pulmonary angiography, which isn't the case for a random cardiac arrest and 3 were diagnosed with PE by ultrasound criteria. I would thus interpret the study more as a safety study than anything else, since it also didn't show any significant bleedings. \n\n**Sodium bicarb**\n\nThe AHA states\n> There are few data to support therapy with buffers during cardiac arrest. There is no evidence that bicarbonate improves the likelihood of defibrillation or survival rates in animals with VF cardiac arrest. A wide variety of adverse effects have been linked to administration of bicarbonate during cardiac arrest. Bicarbonate may compromise CPP by reducing systemic vascular resistance.\n\nAnd the study this is based at least partly on [Vukmir RB, Katz L; Sodium Bicarbonate Study Group. *Sodium bicarbonate improves outcome in prolonged prehospital cardiac arrest*. Am J Emerg Med. 2006 Mar;24(2):156-61.](https://www.ncbi.nlm.nih.gov/pubmed/?term=16490643) which despite the name states\n> **The empirical early administration of sodium bicarbonate (1 mEq/kg) has no effect on the overall outcome in prehospital cardiac arrest.** However, a trend toward improvement in prolonged (>15 minutes) arrest outcome was noted.\n\nIt should be said that there are specific circumstances were bicarb has it's use, but routinely using it simply hasn't been shown effective as stated by the AHA\n> In some special resuscitation situations, such as preexisting metabolic acidosis, hyperkalemia, or tricyclic antidepressant overdose, bicarbonate can be beneficial\n\n**Edit 3. Endotracheal Intubation** \n\nPer the AHA\n> However, intubation attempts by unskilled providers can produce complications, such as trauma to the oropharynx, interruption of compressions and ventilations for unacceptably long periods, and hypoxemia from prolonged intubation attempts or failure to recognize tube misplacement or displacement. It is now clear that the incidence of complications is unacceptably high when intubation is performed by inexperienced providers or monitoring of tube placement is inadequate.\n\nThere aren't any high quality studies and only a few retrospective studies, one of them saying that early intubation has a trend toward better survival at 24hrs; [Wong ML, Carey S, Mader TJ, Wang HE; American Heart Association National Registry of Cardiopulmonary Resuscitation Investigators. *Time to invasive airway placement and resuscitation outcomes after inhospital cardiopulmonary arrest*. Resuscitation. 2010 Feb;81(2):182-6.](https://www.ncbi.nlm.nih.gov/pubmed/20022157) and one study of poorly trained EMS on intubation of children failed to find an effect (and remember we think that ventilation is more important in children than in adults) [Gausche M, Lewis RJ. *Out-of-hospital endotracheal intubation of children*. JAMA. 2000 Jun 7;283(21):2790-2](https://www.ncbi.nlm.nih.gov/pubmed/10838643).\n\nA more recent study in Japan [Hasegawa K, Hiraide A, Chang Y, Brown DF. *Association of prehospital advanced airway management with neurologic outcome and survival in patients with out-of-hospital cardiac arrest*. JAMA. 2013 Jan 16;309(3):257-66](https://www.ncbi.nlm.nih.gov/pubmed/23321764) found that\n> Among adult patients with OHCA [out of hospital cardiac arrest], any type of advanced airway management was independently associated with decreased odds of neurologically favorable survival compared with conventional bag-valve-mask ventilation.\n\nYou also have another study, [Kajino K, Iwami T, Kitamura T, Daya M, Ong ME, Nishiuchi T, Hayashi Y, Sakai T, Shimazu T, Hiraide A, Kishi M, Yamayoshi S. *Comparison of supraglottic airway versus endotracheal intubation for the pre-hospital treatment of out-of-hospital cardiac arrest*. Crit Care. 2011;15(5):R236.](https://www.ncbi.nlm.nih.gov/pubmed/21985431) which found two things. A supraglottic airway is equally effective to endotracheal intubation, but having a person certified to do endotracheal intubation was associated with a better outcome regardless of wether they did or didn't. Early placement of an advanced airway was associated with a better outcome.\n\n**Edit 4**\nThanks to dr /u/CytokineShitStorm for pointing me to this study, [Andersen LW, Granfeldt A, Callaway CW, Bradley SM, Soar J, Nolan JP, Kurth T, Donnino MW; American Heart Association’s Get With The Guidelines–Resuscitation Investigators. *Association Between Tracheal Intubation During Adult In-Hospital Cardiac Arrest and Survival*. JAMA. 2017 Feb 7;317(5):494-506.](https://www.ncbi.nlm.nih.gov/pubmed/28118660) which is a 2017 observational study on cardiac arrest in the hospital setting which found\n>Although differences existed in prespecified subgroup analyses, intubation was not associated with improved outcomes in any subgroup. [...] Among adult patients with in-hospital cardiac arrest, initiation of tracheal intubation within any given minute during the first 15 minutes of resuscitation, compared with no intubation during that minute, was associated with decreased survival to hospital discharge.\n\nand thus it doesn't support intubating patients even at a hospital setting. As the guidelines stand intubation may still be the way to go, and by intubating the patient you may free up valuable resources. I always have an ICU/OR/anesthesia nurse present who can maintain any advanced airway or ventilate the patient if necessary so for me it wouldn't tie up any more hands to not intubate the patient. \n\n**Summary**\nHigh quality CPR and defibrillate as soon as possible. The rest is mostly guesses.",
    "title": "Data behind ACLS guidelines for medicines",
    "subreddit": "medicine",
    "timestamp": 1497702505,
    "score": 308,
    "keyword": "brown manager"
  },
  {
    "text": "Terrible performance in school and only took QA internships. All hope of a software developer position was lost.. until today as I just accepted a software developer job! (A retrospective view of my job hunt) I thought that I was stuck in QA for the rest of my life.  A software development gig in the USA (I'm Canadian) was my end goal, but with terrible performance in school and internships in QA, I thought that was out of reach.\n\n**Before interviewing (my credentials)**\n\nI took my first internship in QA because it seemed like a cool place to start.  And it was.  I really enjoyed it.  It was a blast finding bugs and speeding through every single manual test case faster than my other coworkers in QA.  I learned so much about QA that I didn't realize existed before.  I made it my goal to learn as much as I can, since internships are a great opportunity to learn too.  My boss was a great mentor; he taught me everything there was to know about QA.  Near the end of my internship (it was 8 months) my boss took a few days off and allowed me to lead the team with another member of QA.  Though I thoroughly enjoyed it, programming was always my end goal, so probably 5% of my time (and some lunch hours) was spent working on scripts that would automate things.  Sometimes I would show my QA coworkers the scripts, sometimes they'd glance at me and ask it.  They weren't a lot of scripts, but they were enough to pad my resume with.\n\nMy next internship was in QA because I couldn't find a position in software development (I feel like my grades and cover letter were the reason why, with more emphasis on grades).  All of the software developer jobs that I applied for didn't respond, while 10%-20% of the QA jobs that I applied for did, so I took them with the intention of doing things similar to my first internship (ie. write scripts in my own time while at work).  At this company my boss liked my performance which lead to an extension of my internship.  My boss got a QA intern for another 4 months, while I got a few extra bullet points to put down on my resume.\n\nI failed my first CS class, which shows up on the first page of reading my transcript.  Imagine reading someone's transcript and seeing an F on the first page.  Not a good start, eh?  I also ended up failing data structures and algorithms. But hey, that's okay, a lot of people fail, so I put on my big boy pants and attempt it again.  This time is different though; I get a tutor and go to every single office hour.  Yet even with tutors and getting extra help the final was too much for me to handle, so I end up failing it once more.  That's *not* okay, how the hell does someone bounce back from this?  Turns out, there's a way.  My school requires you have a streak of great semesters before you can take a class for a third time.  So I ponied up and fucking had three semesters of great performance (not enough to bring my GPA above 3.0, but enough to retake the class again).  I retook the class and somehow passed it.  How I did so much better this time... I have no clue.  Every single examination was so much easier (except for my final, which I fucked up on, but the rest of my grades were enough to save me from another dreaded F).  I also had to retake Calculus 1 because I didn't meet the prerequisites for Calculus 2.\n\n**Getting that interview**\n\nSo how does someone that graduates with a bad GPA (2.7), failed Data Structures and Algorithms twice, retook four classes, and only took QA internships get interviews for software developer positions?  Honestly, the only relevant thing in that list of fuck ups is that I only took QA internships.  Not a single company asked for my GPA, and only one of 250 companies asked for my transcript.  So how *does* someone that only took internships in QA get an interview for a software developer position?  By marketing themselves as a developer.\n\nI wasn't a software developer nor did I have any work experience in roles that didn't have the letters \"QA\", so a lot of people that reviewed my resume often tossed it after reading those two letters.  90% of the work that I did at both places was QA work (manual testing).  However, that 10% is what I capitalized on in my resume.  I made sure that I never mentioned anything about manual testing, designing test cases, or anything else that I learned from my first internship in QA.  I did know that testing knowledge is very important, though, so I touched up on it in my cover letters.  I didn't shy away from my job title being \"QA Tester\", since that's the role that I was given.  With that said, my resume gave off the impression that I was a tool developer from the scripts that I created.  I was able to say that I worked on x, or developed y, or extended the functionality of z even though I only spent 3 hours on it.  I was also able to put that my internship was extended, which is a great thing to put on a resume when the things above it are development oriented.  Lastly, I was able to talk about the specific bullet points without hesitations or \"umm\"s.  If it was on my resume, you know damn well that I'd be able to talk about it for 10 minutes.\n\nI also had a lot of help from my personal projects.  These are VERY important.  Don't just make CRUD apps that you can whip up in a few hours.  I took concepts from my upper division CS classes and applied them to my own questions to find interesting answers.  One of these projects took one month, while another took four months.  I also had an iOS app that took 9 months.  These say a lot about your programming work ethic.\n\n**My actual job application process and interviewing**\n\nThough I graduated in June, I started applying in January 2017.  A lot of people here suggest applying in the Fall so that you'd have full time positions lined up by graduation, but a lot of the places that I applied to in January said that they \"can't see that far into the future\" for May positions.  They also said that \"they're looking for people to join the team in the next few weeks, not months\".  But that's okay.\n\nAt the beginning of my job hunt, my cover letter began as a full page of text with one paragraph brown-nosing the company, three paragraphs explaining how well I'd perform three bullet points from on the ad, and a final paragraph rewording the first paragraph.  It was very formal, with the name of the hiring manager (if their name is gender ambiguous I'd waste a lot of time doing my research on the company website or Linkedin trying to find out if they're male or female so that their salutation is correct; or address it to Hiring Manager), address, country, zip/postal code.  At the end of my job search (and the cover letter that got me a job) my cover letter was usually half a page.  The first paragraph was one sentence that said that I saw their ad on Indeed/company's career site/Friend's Facebook post.  The next paragraph was a paragraph that linked as much of their required skills and job duties to my own experiences in software development (basically saying how I'm a 80% match to what they're looking for).  I also added that I have a brain for testing, if it was an SDET role.  Sometimes I'd separate this into two paragraphs, cause no one likes reading big-ass paragraphs.  The last paragraph was a closing statement about me getting my degree, and how excited I am to work for that company.  If the company was american, I'd include ~~my favorite beer, why, and a link to the political party that I fully support~~ that I'm eligible for TN status to work at said company.\n\nOf around 250 applications, I had 26 companies actually move forward to a phone interview or online assessment.  My favorite interview experiences are the ones that started off with an HR phone screen.  It felt like they actually cared about the people that they were interviewing.  I applied to several positions at every company, and while I wrote a cover letter for every single one, it was difficult for me to know exactly which position I was being interviewed for.  One thing that I really appreciated was when the recruiter would tell me exactly the position that I was being interviewed for, rather than guessing what position it's for.  If they didn't tell me, I'd ask, but sometimes the responses and answers are more vague than the job duties in the position description.  This is painful when the first interview is a technical interview and you don't know if you need to brush up on your linux admin tools cause one of the jobs that you applied to was part of the infrastructure team.  This happened and it was so annoying.  My worst technical phone interview experience was one where the guy asked me a question that was totally irrelevant to the things that he suggested online in preparation for technical interviews.  In this experience I was given the name of my interviewer, and the HR person suggested that I visit his LinkedIn and tech blog.  On his tech blog he had suggestions on how to prepare for interviews, but the interview that I had with him was totally fuckin different than what he suggested on his blog post.  The phone call also cut off in the middle of the conversation (never ever happened with my other phone interviews which are all done in my room)!\n\nOf those 26 companies, I had on-campus interviews with 5 different companies.  Three of them were in Canada (local), and two of them were in the USA (they paid for flight, hotel, expenses, and one of them paid for the rental car).  I had no experience with LeetCode when I started.  Looking back at how I approached my interview questions, holy shit did I need LeetCode.  I never thought it would make me a better developer, but it did.  It changed the way that I thought about my problems.  I never broke down problems into potential data structures that I could use, and instead, just hacked something together.  But then again, interviews just want to see that someone knows how to program, right?! (no)  Though exhausting, my favorite on-campus interviews were the ones where you were there for the entire day.  I appreciated this because you didn't need to go back to the company for a second time.  It also helped with nerves to get past the first interviewer.  In the first interview, my brain is foggy as hell and I'm not as sharp when it comes to coming up with an optimal solution.  But once that first interview is done my brain is wired and ready to go.  It also helps me understand the culture of the workplace when I'm there for 6-8 hours, rather than there for just one.\n\nOf those 5 different companies, I had a verbal offer from two of them (both in the USA) and got a written offer from one of them.  I got Company A's verbal offer on a Thursday morning, and got Company B's verbal offer on the afternoon of the Friday following it.  Company A offered more than Company B and offered a signing bonus that Company B did not offer, so I told Company B my offer from Company A, and she told me that she'd try to get the guys upstairs to match it, but there's no guarantees.  At 5:40 PM (on that Friday) I receive an email from Company A that they won't be continuing with me.  On Monday (That weekend felt like months tbh, couldn't sleep, questioned whether I should've just taken the offer and tell HR that the verbal offer with the other company fell through) she called me and told me that there's no jump in salary but she could give me a signing bonus which was higher than Company A's signing bonus (which was effectively 0, and so was their salary), to which I accepted.\n\n**Too long, did not read**\n\n* I had two 8 month internships in QA but wanted to get a software developer job\n\n* At both QA gigs I would devote 5-10% of my time (Lunch hours, time that wasn't spent on Reddit) to working on scripts\n\n* Marketed myself as a developer on my resume.  Some interviewers even said that they would consider my previous roles as a tool developer, not a QA tester\n\n* My cover letter started off as a full page of filler for two to three points related to the job, but eventually was trimmed down to half a page of good content that was really really related to the job\n\n* Sent 250 applications, 26 moved forward with phone interviews or online assessments\n\n* Only one company asked for my transcript\n\n* From 26 phone interviews/online assessments came 5 companies that wanted to see my human form\n\n* From 5 companies that saw me in person, I got two verbal offers (both USA) and one written offer (accepted after an excruciating weekend)\n\n* Verbal offers can fall through\n\n**Last minute comments**\n\n* If I could do it again, I wouldn't.  I hate interviews and hate applying for jobs even more.\n\n* Rejections hurt in the beginning, but eventually you become numb to them\n\n* The mental toll that I had waiting for Company B to come back to me was worse than waiting for marks to come back from an exam that you're not sure if you passed or not.  If you're not a top tier developer like myself and you're desperate for a job, I recommend taking it.  The signing bonus that I got is great but mental health is greater.\n\n* Start using sites like Leetcode and Geeksforgeeks.  I really like the Leetcode random button.\n\n* For the most part, Glassdoor interviews were unreliable\n\n* To be honest this subreddit didn't help at all\n\n* What helped more than anything is looking my interviewers up on Linkedin so that I can ask questions that are more tailored to them.  \n\n* At one company I asked HR what work-life balance was like, and she said that it's great, that the company values having your own healthy life outside of the company.  At the same company, I asked about worklife balance to a senior developer that's been there for 3 years, and he said that typically developers show up at 10 am and leaves at 7:30 pm.  Noped out of that.\n\nThanks for reading, everyone.\n\nEdit: Made things easier to read.",
    "title": "Terrible performance in school and only took QA internships. All hope of a software developer position was lost.. until today as I just accepted a software developer job! (A retrospective view of my job hunt)",
    "subreddit": "cscareerquestions",
    "timestamp": 1501741477,
    "score": 44,
    "keyword": "brown manager"
  },
  {
    "text": "Employment for terrible programmers? I'm a horrible programmer pursuing a computer science degree at a (supposedly) good school in Canada (UBC) with a high GPA; I also have a Math degree from a (supposedly) better school (Waterloo). I enjoyed finding out that Math degrees at a bachelor's level don't have the greatest prospects, so I decided to adult up and get an actual professional career. However, not much seems to have changed. I have little practical experience (8 month internship with the statistical agency of the government in Canada) and am incredibly awful at programming interviews. Two of the interviews I had were fairly simple, but I failed because I didn't even know about string immutability. I also have very little in the way of projects. I'm not particularly smart, and mostly rely on hard work. I've never struggled with the stuff I've worked with in school or work apart from the algorithmic trivia questions which seem to give me fits...\n\nThe only projects I've done involved a few simple GUI based applications in Java using Spring (tic-tac-toe game and a basic calculator) and some web stuff like HTML, CSS, jQuery, Bootstrap, etc (nothing in demand like AngularJS, NodeJS, ASP.net etc). I also have a few school projects, but I only worked on sections of those for assignments (some code was provided to us). I, somehow managed to get an internship with the government as the questions asked were primarily knowledge-based questions after failing the aforementioned interviews.\n\nI have accepted that I will not be able to get into one of the highly sought after tech giants, and it's not something I lose sleep over. Despite my best efforts by working through books on programming and frequenting websites like leetcode, i just don't feel cut out of for these types of interviews. However, reading job ads online on indeed just makes me sad. Many positions require at least 2 years of experience for new developers and reading reviews regarding some of these companies on glassdoor is even more disheartening. I understand that reviews on these websites tend to attract people who have had bad experiences, but seeing a lot of these does seem to imply more than a few disgruntled past employees.\n\nBased on that, it seems to me that, unless you get in with one of these sought after companies (i.e. Google, MSFT, FB, etc), you're just wasting your time. I don't expect to make over $70k starting out. I just want a stable job, with reasonable working hours with understandable overtime when needed, that pays the bills and allows me to focus on my true passion; learning. I'm not really interested in pursuing further education of an academic nature like a PhD given the politics involved and the difficulty associated with getting a tenured position.\n\nCurrently, I'm in my final year, but with only 1 internship under my belt. I'm planning to get another one and am still hopeful, unsure why, that with past experience, a good GPA, and a few senior level courses, I can snag a position that doesn't require me to be an algorithmic wiz. However, on the other I feel I'm just running away from the realization that I'm just doing this to run away (I had to throw a recursive joke because I had to throw a recursive joke) from the inevitable grind of finding a full-time job and the feeling that the longer you're unemployed, the more difficult it is to actually find a job, so even if I can't find anything, recruiters can't screw me over for being unemployed. Sorry for that run-on sentence...\n\nThe government's full-time hiring processes are hit or miss to say the least, and do involve some degree of brown nosing from what I have gathered hearing people talk at work. Getting an internship with them is much easier, and I'm not the most sociable guy in the world, so that's also a strike against me. Apart from my supervisor who seems impressed by more hard work, I made no connections with anyone in the workplace and the best he can offer is a reference, which although nice to have, does little to promise future employment.\n\nIf anyone actually, read this far...should I even stay in this field or get the hell out? I don't even know what else I could do at this point...",
    "title": "Employment for terrible programmers?",
    "subreddit": "cscareerquestions",
    "timestamp": 1491465729,
    "score": 23,
    "keyword": "brown manager"
  },
  {
    "text": "Words of advice from a former 4th year associate at PwC I had an interesting time at this firm.  I was a third year with a 3 rating all three years but wasn't promoted.  My understanding was that if you're not on promotion track you'd have known about it before your 3rd year CRT results, but my snapshots my 3rd year were all on point (about 60% at next level, 40% partially at next level with multiple high level performance differentiators from managers and no performance improvement points).  In my fall and spring career meeting I was told I was on track... I even had discussions with multiple managers stating they were actively pushing for me to be promoted.\n\nSo what happened?  I guess one manager in my 3rd year didn't like me personally.  \n\nThe official firm reason for not promoting was, although my knowledge and ability were there, that they felt that there was one alternative procedure that I should have done one day sooner on one job than I did... This is not an exaggeration or a joke.  The kicker is that this task was actually in a 2nd years queue, I only took it on to help the team because I worked more efficiently, had completed my more difficult workload and was able to pick the task up from him to get it done... The procedure was done 6 days sooner than the prior year and we signed off 5 days sooner than the prior year so it clearly had no bearing on the audit... Yet that 2nd year was early promoted and this task was what was used to not promote me.  He had a better relationship with that manager and was able to better connect because they had more in common personally (religious beliefs).\n\nThe other concern was that I didn't volunteer for something irrelevant (which the promoted 2nd year didn't volunteer for either...).  This the only quantitative feedback they gave regarding the decision.\n\nI went back and forth with my Relationship Leader, my other managers (outside the one day late manager) and HR but obviously it was moot.  In those discussions HR, the HR manager revealed to me the following:\n\nWhen I referred to the high level of my snapshots, I was told by HR that snapshots have no bearing on rating or promotion.\n\nWhen I referred to the fact that I was doing another associates work as a favor and it was held against me, I was told by HR that we aren't evaluated against our peers.\n\nWhen I brought up that other managers were willing to stand up for me for promotion, I was told by HR that it doesn't matter what the majority of my managers and senior managers say, one manager who says no overrules 2-3 who say yes.\n\nI found this astounding, so I quit on the spot.  My feeling was that they had ample time to tell me that they didn't think I was meeting expectation... In fact the 3 rating in my 3rd year kind of outlines that, if they thought I wasn't \"senior ready\" they should have rated me a 4, put me on a Performance Plan and not asked me to be \"acting senior\". Instead, in the same conversation, I was told I had a good year, had been given positive feedback but they felt that I was not ready to be a senior but that I was ready to continue as \"acting senior.\" The whole thing was very confusing.\n\nBased on this, I think all the incoming associates deserve to know the following: \n\nSnapshots are complete and utter bullshit (according to PwC HR).\n\nThe firms claims of \"real time feedback\" and \"flexibility\" are complete and utter bullshit (according to PwC HR)\n\nThe 'PwC Professional Framework' is complete and utter bullshit (according to PwC HR).\n\nI would imagine everything the firm publishes you should expect them to act literally the opposite when it comes down to things.\n\nLastly, my suggestion to incoming first years:\n\nBrown-nose, Brown-nose, Brown-nose... hell even suck some dick if you have to... Because you're never getting back that Thanksgiving Dinner with family that you are asked to skip... and you're never getting those meaningful personal relationships that you lose when working 80+ hours back.  But a quick BJ in the men's room stall might be the difference between you and your peer, who is not evaluated on the same factors you are and probably already beaten you to that blowie in the men's room anyway.\n\nBecause what you actually do here for 80+ hours a week doesn't mean shit, making that one miserable manager feel good about their sad decision to stay so long in such a shitty job is all that matters.\n\nOh, and my industry job pays 15% more than I would have made if I had been promoted, I'm home by 6:15 every day and I'm never asked to work holidays and rarely do I need to open my computer on the weekends.  The grass is actually much much greener.\n\nEdited for spelling.",
    "title": "Words of advice from a former 4th year associate at PwC",
    "subreddit": "Accounting",
    "timestamp": 1499925077,
    "score": 113,
    "keyword": "brown manager"
  },
  {
    "text": "Tried writing a game of thrones like scene set in an accounting firm. Prompt which inspired me:https://www.reddit.com/r/WritingPrompts/comments/5tdx45/wp_a_take_on_office_politics_with_a_game_of/\n\n\n\nThere are two types of people in this world. The nice guys ,the type of guys who wouldn’t hurt a fly. They keep their head down and they work. They abhor conflict in all forms and they are terrified of being unfair. Then there is the second kind, the kind of person who achieves what he wants. Which do you think I am?\nI am a senior manager in one of the top 4 accounting firms on the planet. Which one?As if I’d tell you. This isn’t my first rodeo. This is purely a work of fiction and any resemblance of characters to people living or dead is purely coincidental.\nI walked into my clients office at 8. The audit room faced a beach, an empty beach. That is the carrot and I am the stick. The room smelled of sweat and associate tears. I approach Johnson.\nJohnson is a twat. Be that as it may he’s next in line for manager and with the economy being what it is ,suffice it to say this firm isn’t big enough for the both of us.I missed the birth of my first child  for this company.I’ll be damned if I get thrown off the partner track by an overachieving, brown nosing upstart.\n“Excuse me?” \nShit  I think I said that out loud.\n“Johnson! Just the man I wanted to see”\n“Hello sir. Hows the family?”\nMy wife is a bitch and my kid doesn’t network enough\n“Oh couldn’t be better!And how about you?Hows the wife?”\n“Oh Janines pregnant”\nShit.Hope that’s not mine.\n“That’s fantastic Johnson. So about this assignment. It’s going to be a good learning experience for you”\nThat’s code for ‘You’re going to have a bad time’.He knows it and I know it.\n“Also I have given you Harold and Brenda.Two of my best people no less”\nHarold was indeed the best at getting the team coffee and I suspect Brenda has a burgeoning glue addiction.\n“If you say so Chad”\nThe sucker bought it! What did I tell you? Massive twat.\n“Excuse me?”\nShit I really should stop talking to myself.\n“Oh just talking to myself.You know how it is”\nJohnson gave me a symphathetic nod and went back to his laptop. With a severely underequipped team at his disposal,an inviting beach and a non-cooperative client, his rating will plummet. I have just enough pull with the partners to deny him his promotion if that happens.\nSo I banged his wife and stabbed him in the back.Some would pat themselves on the back and call it a day.But not I,I decided to put one final nail in the coffin;I was going to steal his sandwich.\n“Chad your wallet”\n“Huh?”\n“You’ve left you wallet”\n“Oh,thanks man” \nI went to the pantry and grabbed the lunch box which had “PROPERTY OF MR JOHNSON” emblazoned on it.I grabbed a huge bite of the sandwich and swallowed it whole.Victory tasted like…peanuts?Shit.Shit.Shit! I felt my throat closing up.I fumbled for my wallet.Opened it.Cant breathe. Hit the epipen its not there.Why the fuck isn’t it there.Then it hit me. Johnson had my wallet. Johnson knew I was fucking him over. Killing me would mean the manager position opens up and he’ll get the job irrespective of how shitty a job he does over here. Shit.\nI crumbled to the floor and then saw black.\n*****************************************************************************\n“Thank you Mr Chad.Your story confirms what we already knew” the balding detective assured me.\n“The Epipen was found in his bag hours after you were taken into the hospital” he ruffled through his rather shabby notes\n“And Glenda from your HR Department confirmed that Johnson had fleeting access to your HR Records”\n“So the bastards going to jail, isn’t he?”\n“For a long time Mr. Chad”\nThe detective and his partner left.It was just me,my laptop and the ECG now.\nI ignored the call from Glenda. I owe her and she will be rewarded….in time. I opened my laptop and got back to work.This is why I love this firm;its work life balance.\nOh, you want to know what happened? Wouldn’t you like to know? Going back to the two type of people that exist. The only thing I can tell you is I’m of the second variety.",
    "title": "Tried writing a game of thrones like scene set in an accounting firm.",
    "subreddit": "Accounting",
    "timestamp": 1486843642,
    "score": 8,
    "keyword": "brown manager"
  },
  {
    "text": "I'm just wondering if there are any LEO's, Prosecuting Attorneys, Judges or politicians/bureaucrats that lurk or post here. I only ask because if there are, how, exactly do you function in your job knowing what you read in this subreddit? Do you work to change any of it? Do these things being expressed by us seem ok to you somehow? Do you feel powerless to change it? Are all these men and women simply wrong about how the world works and what should be done to change it?\n\nI've been working for the past few years to finally do whatever it takes to overcome the abuse, addiction, trauma, depression and feelings of abandonment I've had to suffer these past 56 years. I tried and failed over and over again despite being as diligent and persistent as I could.\n\nI've risen and fallen so many times I can barely remember some of them. If you are one of the people I mentioned in the title, do you understand that there are tens and HUNDREDS of thousands of men like me? Do you feel you bear NO responsibility to us? Do you ever ponder what will begin to happen if you keep doing what you do?\n\nEvery day. Every. Single. Day. In spaces like this and others you read, see and hear about male imprisonment, alienation of fathers, butchering the genitals of male infants, VAWA, the Duluth Model and the attendant arrest policies and training for LEOs. The educational and academic crises boys and men are facing. Terrorizing men in the workplace, in social situations, hell, at the PARK ffs... I swear, I could go on forever with this list.\n\nAre you all afraid to address these things? Do you just not understand them and so feel you can't do anything about them? Are you all stupid, or just malicious and indifferent? Regardless of how you answer those questions, do you have any concern for what will happen if you DON'T address them? If your answer to THAT question is no, then I'll have to conclude that you are stupid... Because there are many, many more of us thrown away men EVERY DAY. We're giving up. We're killing ourselves (either quickly with guns, ropes and other forms of violence or slowly with drugs, alcohol or other self-destructive behaviors).\n\nThe hell of it is, society is telling us NOT to give up! I hate to be the one to bring this up, but what do you suppose will happen if we DO stop giving up and killing ourselves...? Do you honestly believe we will simply accept our lot in life and remain quietly on the garbage pile you've put us on? Again, that's just willful blindness and ignorance.\n\nAnd whom do you point us to in the social sphere...? Men like Jackson Katz, Michael Kimmel & Michael Messner? Women like Amanda Marcotte, Jessica Valenti and Clementine Ford? Jeezus, the most honest example of a woman even recognizing the humanity of ordinary men is Brene Brown.... She's a protege of Oprah Winfrey!! Sorry, but that's just not gonna cut it.\n\nDo you all in the public sector just not understand the forces you're playing with? Don't you get it?\n\nWhat the hell is going to happen when this all leaks out into the streets and you have open, violent unrest and conflict... Not between classes, or races or politics or religion, but among the genders? How the hell are you going to manage that? Really. I'd love to hear the contingency plan for open, violent conflict between men and women breaks out.\n\nLike I said, tens and hundreds of thousands of us now, and more every day. Just lately we either kill ourselves or just ghost to one degree or another.\n\nYou all do NOTHING about this other than more draconian laws, more anti-male policies for employers, educators and healthcare providers, the outright embarrassment that is social support for victimized men and boys and more and more aggressive, brutal and punitive law enforcement and courtroom policies aimed solely at MEN.\n\nHow long do suppose we're going to put up with this...?",
    "title": "I'm just wondering if there are any LEO's, Prosecuting Attorneys, Judges or politicians/bureaucrats that lurk or post here.",
    "subreddit": "MensRights",
    "timestamp": 1508605281,
    "score": 17,
    "keyword": "brown manager"
  }
]