[
  {
    "text": "HELP NEEDED : PLEASE SAVE ME FROM INDIAN RECRUITERS.   \n\nBefore you jump the gun, this is a disclaimer: I am not racist, bigoted or prejudiced.\n\nI am as brown skinned as an Indian (as in from Asia) recruiter. I have lived in North America for 18 years, but now what is happening to me, is making my life, a living hell. I have been managing huge IT projects for many years, and have my resume posted on the major job sites (Dice, CareerBuilder etc.) and on LinkedIn Now why is that? Well, I am in consulting, and in today's day and age, it makes sense to have a \"Plan B\" at all times.\n\nSo what's my problem?\n\nI get 20-30 calls a day from Noida, Gurgaon, Delhi, Chennai and some some obscure places. It's always the same line \"I am calling about an opportunity I have with my direct client...... blah, blah\". Obviously, these are VOIP calls and always have a US number. Now these so called \"Recruiters\" have no idea of what the job entails, just read from a script, and have to meet a quota of \"X\" number of calls and \"X number of emails sent. 99.99 % of these firms are based in India, with a local (NJ/WA/NY) address.\n\nFine, so what? \n\nThese calls are a nuisance. No time in the past has my resume even reached a hiring manager - so what is this resume \"harvesting\"? I believe there is an ulterior motive behind this. Also this is a waste of my precious time. So why do I leave my contact information on the resume - so that I can have internal recruiters of US companies contact me. If I took my phone number off, genuine recruiters of consulting companies and internal HR folks from corporations here, cannot contact me - that would cut me off from good opportunities/\n\n**Two quick questions:**\n\nIs there an easy way out for me to get out of this situation?\n\n&#x200B;\n\n* When a recruiter from India calls about a potential      opportunity from say AT & T, Verizon or CBRE, there is NO local      recruiter that calls. I would imagine that consulting companies and headhunters      would be equally interested in sourcing a candidate and make some $$\n* Does this mean that these so called \"opportunities      are fake and do not exist?.\n\nThanks in advance for your help. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
    "title": "HELP NEEDED : PLEASE SAVE ME FROM INDIAN RECRUITERS.",
    "subreddit": "jobs",
    "timestamp": 1548104323,
    "score": 3,
    "keyword": "brown manager"
  },
  {
    "text": "Don't be afraid to give your honest opinion in interviews. It can make you stand out more than other people who suck up I recently finished my first week at a new job. I was interviewed the previous Thursday. At the end of the interview, I was offered the job without even being asked for references or a second interview, something very common for the type of job I was applying for.\n\nToday, the general manager called a meeting with about 14 various staff from admin assistant to department managers. He was looking for ideas on something he wanted to overhaul. He was seeking input from anyone who has knowledge of the desired change or could be affected by it. It was a very productive meeting, and everyone there contributed something useful.\n\nLeaders like this truly value people that can speak their mind. While reflecting on my interview after today's meeting, I think I know when he decided to hire me. Near the end, he was asking me what I knew about the company, if I had checked out there website, and what I thought of it. I told him in polite terms but no minced words that I thought the site was awful and needed a rehaul. It looked like something from about 2006-2008. It had terrible design and SEO, no use of social media, and the content could be written in a way that would create more value per view. Other than that one answer, it was a pretty standard accounting interview. \n\nI thought I nailed the rest, but that's uncommon for positions like this. It's usually just enough to get you on a shortlist with several other candidates who gave just as good answers, or maybe even better. Certainly not to be offered the job instantly like that. \n\nI know earlier in my career, I would have brown nosed, giving answers about how I like what the company is doing, agree with their values etc. I would have been too scared to offer blunt criticism to someone who decided if I get the job or not.\n\nDisclaimer: My advice, just like any is not universal. It is just my experience and may or may not apply in different types of jobs, companies, and hiring managers. If you are desperate for a job and get the sense they don't want to hear it, and it is how it is, maybe keep your mouth shut.",
    "title": "Don't be afraid to give your honest opinion in interviews. It can make you stand out more than other people who suck up",
    "subreddit": "jobs",
    "timestamp": 1550294875,
    "score": 2,
    "keyword": "brown manager"
  },
  {
    "text": "Did I secure it? Am I in the clear? I think I did! First of all, I’m a broke nursing student, I wanted to find a position that would decently help me get ahead in my studies, while also working with patients. I’ve been unemployed for 4 months, and have been living off of ramen, my mom and dad’s leftovers and my sisters car food. It’s been hard, \n\nI had an interview today with an amazing doctor and I’m not sure if I secured the job or not. (I think I did)\n\nI walk in. My nerves are steeled and I literally say “You got this Vick, you got this”. \n\nI meet with the doctor, and he compliments me on my attire. (Blue Slacks, White Shirt, Red Tie, Navy Blue Belt, Brown Shoes)\n\nHe goes over my resume, and is impressed by my retail experience, tech experience, clinical experience. I also attached two letters of recommendations from my clinical preceptors, and also a sample of my class work with my transcript (3.7 GPA, Straight A+s in Science courses)\n\nI honestly thought the interview was over, when he said “I think we’re done here”, but he asks me to follow him. I follow him into the break room and he asks me to stay a bit and see how the office functions. I was ecstatic. I got to see how his office works, as well as learn some info on how he functions. \n\nJesus, I’m amazed at how efficient he works. Really courteous, and extremely nice. That was a major “yes” factor, when I see a doctor actively looking out for the best of his patients. \n\nAfter 2 hours, we sit down. He asks me for the number of my previous manager. I gave it to him. \n\nMy manager really cherished me when I was working in retail. I had an unwavering work ethic and would always try my best to top sales. Unfortunately school and work schedules didn’t work out, so I had to leave. (She still says hi when I come in for school supplies and likes it when I pass by the store!)\n\nWhen I was walking out the door, he gives me the ultimatum. “When can you work here?”. I immediately responded as soon as possible, as I didn’t have anything to do for the summer. \n\nHe follows up with; “Okay, I’ll just call your manager, and after we talk, we’ll see you Friday for your first day.”\n\nI’ve given a post-interview email thanking him for his time exploring my candidacy!\n\nToday was a change for me. If I land this job, I’ll work even harder. I need to get up and do something with my life. I’m sick and tired of being home being broke and sleeping. I want to put my youth to the test!\n\nDo you all think he’ll give me a call back? I think so! You never know!",
    "title": "Did I secure it? Am I in the clear? I think I did!",
    "subreddit": "jobs",
    "timestamp": 1566345952,
    "score": 1,
    "keyword": "brown manager"
  },
  {
    "text": "Deciding whether or not to nominate my line manager for a company award On mobile so I apologise before we get into it all.\n\nI work for a medium sized charity in the UK as part of a team of 10 including our director. The CEO has just launched a company awards scheme and you can nominate people if you think they deserve them.\n\nI wanted to nominate my line manager for the 'mentor' award because they've effectively created an unofficial mentoring program with me and has taken a real interest in my career progression which I'm incredibly grateful for.\n\nThe problem is is that it's a small team and the nominations process isn't anonymous. I want to do a nice thing for my line manager, however I don't want to get a reputation as a brown noser or a suck up, especially given the size of the team. People can be extremely petty, and whilst we have a great working relationship, we've struggled as a department with other departments before. \n\nIf anyone has any words of wisdom that would be greatly appreciated! \n\nShould I nominate her regardless of any effect this might have on my reputation amongst the larger organisation or should I find an alternative way to show how appreciative I am of her efforts?\n\nThanks!",
    "title": "Deciding whether or not to nominate my line manager for a company award",
    "subreddit": "jobs",
    "timestamp": 1561758674,
    "score": 1,
    "keyword": "brown manager"
  },
  {
    "text": "Looking for work for my longtime friend and 1st time parents in SoCal So 2 of my closest friends have moved to California, Corona to be exact \\[hope thats ok here\\], from the East Coast where we grew up and they now have a beautiful baby boy together, less than 6months old. They are currently living with her family which is doing a great job of supporting them, for now, but the Male \\[M\\] is not working now and wants to be. M is just about 30, and has 14 years experience working in the food industry (his dad pulled him out of HS to start working F/T so he can help support the family, which he did to help). I have worked with M in the past, even was sort of his manager at one time, and he has worked long 12/14 hr shifts straight through, killing it. Very good employee and hard worker. He would be best suited for a job in the kitchen somewhere as a cook although he could be a cashier, work the desk, make deliveries, etc. he knows the food business and can do a lot of jobs within it... I think about 90% of his experience is in a nice Italian restaurant that was also a pizzeria with normal food for the pleebs \\[still to this day the best cheesesteaks I probably ever had\\]. He is from Morocco and cooks ethnic food as well, including Spanish food so he's not stuck to just one type of food. His English is great, he won't be ghost writing the next Dan Brown novel, but he is completely fluent \\[just clarifying due to the following\\] The rub is that he does not have all his documents for now, so no social to show. He is married to a US citizen and his child is a US citizen and he will be sorting out the paperwork soon, but he needs a job now. He is a great guy, just having trouble finding a place to take him bc they all want a SSN. He is a hard worker, EXTREMELY clean while working in the kitchen \\[his first job that he did for over 10 years, the boss would have him clean the walls when it was slow\\] he is super dedicated and has even more motivation now to help his baby boy. He also has a genuine passion for food and cooking and any restaurant would be lucky to have him. The mother, also my friend since 7th grade, is going back to school to get her degree as well. They are a very nice family trying to build their life and get on their feet... So, please, help me help them, Reddit. Any and all advice is appreciated. BTW: She has a car so it is possible for him to travel \\[a reasonable amount\\] to work, but they do have a 6 month old to take care of. Thanks everyone!\n\nEdit: there is nothing that can be done now immigration/documents wise that is not explored, I am extremely well versed in immigration matters. Just really would love someone who knows of a place who might just let a hard worker start working.",
    "title": "Looking for work for my longtime friend and 1st time parents in SoCal",
    "subreddit": "jobs",
    "timestamp": 1551344115,
    "score": 0,
    "keyword": "brown manager"
  },
  {
    "text": "Today I felt validates This might sound a bit dumb but I was preparing a presentation with my manager. She was testing out this app on an ipad that uses object recognition to showcase how AI can detect objects and people. When pointing to a person, it gives you their age, hair, gender and emotion (it also reads out the results when you turn on sound).\n\nContext: I'm a transgender woman (guess where this is going).\n\nShe was testing it using selfie mode. Sometimes it didn't work (because of her short arms) and sometimes it gave back \"A 40-year-old woman with short brown hair who looks happy\".\n\nSuddenly, the 40+ visitors (lots of managers and senior staff) walked in and we quickly had to get ready to give the presentation. I introduced myself, did my part and demos and decided to stay in the front row of the audience because I had nothing else to do.\n\nWhen my manager reached the object recognition demo, she pointed the camera at people in the front row (4 woman) then skipped a few people and pointed the camera at me. It felt like someone pointed a gun to me in slow motion. I managed to crack a smile somehow. My chest and my stomach turned, fearing that the app would say that I'm a man in front of quite a sizeable audience.\n\nThen it said \"processing...a 24 year old woman with long brown hair who looks happy\"\n\nI felt so validated that this facial recognition app saw me as a woman that I almost started crying.",
    "title": "Today I felt validates",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1575999046,
    "score": 18,
    "keyword": "brown manager"
  },
  {
    "text": "As a baby faced 24 year old brown woman I am having a really hard time managing a group of disrespectful brown men. What do I do? Hi everyone, \n\nThis summer I am working as a supervisor for a math program at my university. Part of my job is to manage a team of 7 people. 6 males and 1 female. 4 of the guys are brown and come from the same culture as I do. They are insistent on not taking me seriously, sometimes they say things in the native tongue which they assume I don’t pick up on, but I do. \n\nI hold a similar position in a different department during the usual semester and I don’t have this problem then. So at first I thought that maybe the problem was I was not being assertive enough, so I rectified that and their behaviour continued, albeit at the cost of subtle taunts made in my native tongue. For instance, putting my foot down about punctuality elicits a response where they say something like “ah are you going to report this too?” said in the tone of a joke. This comes from the fact that their behaviour has been reported to my boss and people higher up the chain and these guys are under scrutiny. However, their behaviour doesn’t change. \n\nEventually if it gets bad enough they will get fired but, until then what ways can I ensure that they don’t act this way?",
    "title": "As a baby faced 24 year old brown woman I am having a really hard time managing a group of disrespectful brown men. What do I do?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1560028636,
    "score": 7,
    "keyword": "brown manager"
  },
  {
    "text": "Sharing a tough time at the beginning of my career as a Psych nurse in the '90's; can anyone relate or have a similar experience? Hi Everyone,\n\nI decided to be brave and talk about a rough time I went through a long time ago when I was a new psych nurse.  Been having memories of it all, and thought maybe sharing it and seeing if anyone else has had similar experiences will help me get through these memories and see that I'm not alone.  \n\nA little background before the main part of the story.  I graduated as a Psych nurse in one province in Canada in 1990.  The forensic unit I did my last two month student preceptorship on was a great experience, and they ended up hiring me after I graduated, got my license and become 'official'.  They were welcoming and encouraging, and I worked with a great crew of men and woman, psych nurses and psych aides.  I gained more knowledge, confidence, experience, and became familiar with the 'real' world of psych nursing beyond being a student.  At the end of 1990/beginning of '91, word came down that there was going to be a downsizing of nursing jobs, including our facility.  I knew as one of the more recent hires, my hours would be declining, so started looking at different jobs.  Ended up getting a position at a hospital in another province, in forensics, which I loved.  Moved there in spring 1991, went through orientation, and at the end of that, found out I was rostered to the unit I really wanted.  It was a male patient, Maximum Security Remand/Assessment Unit.  And then it began...\n\nMy first day, a male staff Health Care Worker (HCW) stopped me in the hallway.  He was a big guy, probably at least 6'4\", husky, a little bit intimidating.  He told me he was going to what he could to get me off his set (the same 4 day on/2 day off rotation that we were both assigned to), his shift, and his ward.  I don't really recall what I said or did, but I was shocked.  I barely new him or anyone there, why all this hatred.  Well, I am a female.  Apparently females 'don't belong here', and sure don't belong in maximum security forensics. (there were a couple of other females, but they were the pretty, popular type, and I wasn't, so I didn't belong).  So it began.  The best I can label it in hindsight is bullying and harassment.  He would do anything to undermine me, ignore me (when I was the Nurse in Charge), and just make my life as miserable as possible.  If I had assigned certain tasks to him, he would wait for the very end of the shift before he did them, because he knew I would stress out about them not being done in time, because I would catch the flack for work undone . Of course he had friends there, who more than happy to help him out.  There were things we were to do in pairs, for safety reasons.  He would refuse to come with me, I had to try and find someone that would.  So many things that I just can't even cover them all in this post.  It was a very tough time.  I'm in a new province, a new workplace, zero friends, no support, isolated on my own.  Friends from my old town slowly drifted away, I really was alone.  I won't go into all the things he did, but needless to say other people became unhappy when they had to work with the two of us together.  Remember this is back in the early '90's.  There was no HR to go to to complain.  Supervisors would talk to us, and I would be told to 'try better to get along with him' and just ignore it all.  They didn't see what he was doing as 'bullying' (as we would call it today), we just 'didn't get along' in their eyes.  He would be the 'concern' on my evaluations, and I on his.  Every time.  There was just no where to turn for professional support.\n\nThen it got worse when we were assigned a new Unit Manager.  He was a known entity to some workers, doesn't like females, and didn't hide it.  Well no matter what I did (especially when I was Nurse In Charge), it was wrong.  Getting told \"I need to see you in my office\" became words I panicked hearing.  One time I apparently said 'Hello Everyone' when I came on shift, I didn't say \"hello 'name'\", and I was hauled into the office for a 10 minute lecture on my \"hostile attitude\" for not greeting him personally.  Even with a union rep (it got that bad I refused to see him alone and had a rep in with me), they would say there is nothing we can do.  If I did \"A\" on my shift, I should have done \"B\".  Next time I do \"B\", nope, I should have done \"C\", and on and on.  One time someone from a different discipline came in to chart in a patients chart, and used the wrong coloured pen (we all had different colours to use, nurses-black, doctors-red, etc).  Well apparently I didn't notice this and got in trouble.  Did the person who charted wrong get in trouble, nope, just me.  I 'should have been paying better attention' to someone else doing their patient notes, while I was busy with my own stuff and the rest of our crew.  Of course, they guy I didn't get along with was a total brown noser to the new unit manager.  Did everything he wanted right away and became his favourite. I  lasted a few more months, then transferred to a different unit in the hospital, the female Remand/treatment unit.  It was so much better.\n\nPersonally, I wasn't coping well with all of this outside of the job.  Began drinking a lot.  Never at work, but afterwards, to drown my sorrows, so to say.  Long story short, became an alcoholic, went to AA for a few years, but am now 27 years sober.  Also ended up with my own mental health issues.  Depression and anxiety.  Have had various amounts of time off of work because of my own illnesses.  Actually spent two weeks in a psych ward myself in 2000, but that's a whole other story.  Maybe I'll share it sometime, I don't know if anyone wants to hear about that, lol.\n\nAnyway, I may think of more things to add, but those were my first few years in psych nursing (well the first year at the first hospital was good).  Is there anyone else in the medical field, or other psych nurses that have had their own trials and tribulations in the workplace.  Would love to hear your stories, so that I don't feel so alone in all of this.  \n\nI've since become disabled, and have been out of the workplace for a few years now.  I guess coping with not being able to work anymore has popped some of these memories into my mind.  Thank you all for 'listening';  I really appreciate it.  Sorry it turned out so long!",
    "title": "Sharing a tough time at the beginning of my career as a Psych nurse in the '90's; can anyone relate or have a similar experience?",
    "subreddit": "nursing",
    "timestamp": 1574411416,
    "score": 9,
    "keyword": "brown manager"
  },
  {
    "text": "I want to move into a better paying role in the next year or two. What can I do to improve my chances or getting a job around ~50K or higher? I am a woman in my early 30's with a BS in Psych and a Master's in Ed (not teaching, but related). I have been at my current job for about 2 years and I love it, but the pay is abysmal. And because of my Master's, I have over a 100K in student debt that I would really like to pay down. Currently I am basically the assistant GM of the gym I work at, I directly supervise 3 part-time staff, and I am in charge of a lot of the day to day decisions of our location. My job title says operations, and I was wondering how I might leverage this into maybe getting a job into operations? I was also thinking trying for project management or HR roles.\n\n&#x200B;\n\nI'm good with building relationships with people, I've been told I'm a good manager by my staff (I don't think they're trying to brown nose), and I am very organized and enjoy creating processes/systems to get things done. Before my current job, I worked in education/human services and I am not interested in returning to that field. I am also down for some learning opportunities, but I cannot afford to go back to school (I'm thinking online courses, workshops, etc). I'm looking for some feedback about the feasibility of going into any of these fields, and what I can do over the next year or two to increase my chances.",
    "title": "I want to move into a better paying role in the next year or two. What can I do to improve my chances or getting a job around ~50K or higher?",
    "subreddit": "careerguidance",
    "timestamp": 1563375123,
    "score": 6,
    "keyword": "brown manager"
  },
  {
    "text": "What’s worse, the devil you know, or the devil you don’t? Need some quick advice. Currently in a dilemma with 2 companies. (Ones purple, ones brown) Also should point out my degree in diesel technology for info reasons. \n\nI’ve worked for the purple company since  2012 going from a dock worker roll to a management roll. I’ve been in management for 1.5 years, during which I’ve been working 3rd shift. Basically midnight to 10/11 am Monday - Friday. And between my fiancé and I, it’s starting to get very tiresome. \n\nEnter the brown company.\n\nThe brown company wants me to come in and go through their “automotive development program”. Which is a program to get people from the outside of their company in to management rolls, especially in fields with “dying trades”.  They offered me a job where it’s training for 6 months, then I’d have the title of “automotive supervisor”. Working 6am to 4pm mon-fri, and I’d be making about 8k more a year. AND it’s in my field. \n\nSeems like a no brainer, but I’ve been so loyal to the purple company I’m not sure I can leave. Has anyone else been in a similar situation?",
    "title": "What’s worse, the devil you know, or the devil you don’t?",
    "subreddit": "careerguidance",
    "timestamp": 1550004187,
    "score": 3,
    "keyword": "brown manager"
  },
  {
    "text": "What should an Associate/Manager have in mind early on to increase their likelihood of making partner? I'm familiar with many of the skills and attributes that define a good Associate/Manager, but I'm hoping to learn more about what they can do early on to expedite their rise through the ranks.\n\nAs meritocratic as top firms strive to be, I imagine there must be additional ways to gain an early edge for their progression through the firm (e.g. strategies finding key allies higher in the firm, how they define themselves within the firm, or next-level schmoozing and brown-nosing).\n\nWhat insights or advice can you share beyond getting your work done and meeting expectations?",
    "title": "What should an Associate/Manager have in mind early on to increase their likelihood of making partner?",
    "subreddit": "consulting",
    "timestamp": 1548637679,
    "score": 5,
    "keyword": "brown manager"
  },
  {
    "text": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education   \n\nOrwell’s famous dystopia *1984* is often cited as a parable  about the banality of administrative evil. The ever-vigilant bureaucrats  of Oceania position themselves not only on the Left side of history,  but also at its *end.* To err from their ideology is treason.\n\nThe citizens of Oceania live in a state of self-imposed hypnosis  where they have to pretend that even the simplest of words signify their  exact opposites. The government agency that specializes in espionage  and torture is thus called *The Ministry of Love*. The Ministry views every sexual act as a potential crime unless proven otherwise via affirmative surveillance.\n\nImagine a federal agency that has invested itself with the authority  to monitor the most private details of citizens to root out sexual  heresy. Imagine a federal  agency which once contemplated [installing security cameras](http://pgbovine.net/OET-Draft-Grit-Report-2-17-13.pdf) in every classroom in order to monitor the facial and optical muscles of all students nationwide.\n\nThis agency was so devoted to its ideological mission that it never presented its [unconstitutional rules](https://www.thefire.org/did-the-office-for-civil-rights-april-4-dear-colleague-letter-violate-the-law/) to the American public to consult their opinion, considered itself to be [a superior alternative](https://www.huffpost.com/entry/why-students-are-fighting-for-title-ix_b_58e27314e4b0ca889ba1a848) to the criminal justice system, granted itself [universal jurisdiction](https://www.insidehighered.com/news/2018/01/19/feds-find-buffalo-state-failed-investigate-alleged-sexual-assault-created-hostile), threatened many colleges with financial death unless they punished [constitutionally protected speech](https://www.nas.org/blogs/dicta/ocrs_new_sexual_harassment_guidelines_threaten_academic_freedom_due_process), sought to abolish the [“reasonable person” standard](https://reason.com/2016/09/12/ocr-to-frostburg-state-university-common), and created [a class of imitative bureaucrats](https://www.nas.org/blogs/dicta/gender_inequity_among_the_gender_equity_enforcers) in academic institutions to perpetuate an industry of victimhood.\n\nImpossible, you think? We have just objectively described the record  of the Department of Education’s civil rights branch, the Office for  Civil Rights.\n\nThe Office for Civil Rights (OCR) received bipartisan and  professional criticism for its unconstitutional actions during the Obama  administration. Formal critics include the [Federalist Society](https://regproject.org/wp-content/uploads/RTP-Race-Sex-Working-Group-Paper-Campus-Misconduct-Proceedings.pdf), [Heritage Foundation](https://www.heritage.org/crime-and-justice/report/campus-sexual-assault-understanding-the-problem-and-how-fix-it), [National Association of Scholars](https://www.nas.org/articles/nas_applauds_secretary_devos_decision_on_title_ix),[ California Governor Jerry Brown](https://www.wsj.com/articles/jerry-browns-title-ix-veto-1508280834), [Justice Ruth Bader Ginsburg](https://reason.com/blog/2018/02/19/ruth-bader-ginsburg-due-process-me-too),  [American College of Trial Lawyers](https://www.actl.com/docs/default-source/default-document-library/position-statements-and-white-papers/task_force_allegations_of_sexual_violence_white_paper_final.pdf), and [Reason Foundation](https://reason.com/blog/2017/09/07/betsy-devos-rape-ocr-title-ix-campus).\n\nMoreover, courts that have heard cases involving OCR’s Title IX  procedures have often strongly denounced them. Examples include  condemnatory opinions from the [Second Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca2/15-1536/15-1536-2016-07-29.html) and the [Sixth Circuit of Appeals](http://www.opn.ca6.uscourts.gov/opinions.pdf/18a0200p-06.pdf). In a recent [Seventh Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca7/17-3565/17-3565-2019-06-28.html)  opinion, Judge Barrett stated that “Purdue’s process fell short of what  even a high school must provide to a student facing a days-long  suspension.” Professor KC Johnson [has covered the case in greater detail. ](https://www.city-journal.org/john-doe-v-purdue-univ)\n\nObama’s OCR espoused a particular brand of radical feminism.  According to this doctrine, taught across the nation in women’s studies  departments, men have brutalized women since the beginning of history.  Past oppression must be remedied through government intervention,  eliminating the due process principles that are meant to protect every  American.\n\nThe perils of government tyranny aside*,* the fundamental  assumptions of the “patriarchy theory” cannot survive rational scrutiny.  While it is true that women were historically denied various rights,  they have also been sheltered from grievous harm (combat, for example).  Also, analysis of federal aggregate data from the United States  demonstrates that women are [as likely to engage in sexual coercion](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) against men as [vice versa](https://www.sciencedirect.com/science/article/pii/S1359178916301446?via%3Dihub), which undermines the “patriarchy” narrative.\n\nAt any rate, past historical wrongs cannot be rectified by unfair treatment in the present, as the Eighth Circuit stated in [this ruling](https://cases.justia.com/federal/appellate-courts/ca8/18-3077/18-3077-2019-03-06.pdf?ts=1551889833).\n\nOCR’s historical record speaks to its lack of fairness. The agency  authored a total of 255 resolution letters (formal decisions in a case)  from 2012 to 2019.\n\n[Pekgoz summarizes the circumstances in a Synthetic Analysis](https://static.wixstatic.com/media/ea7b71_a751c44c74dc4e8fa8f35666ab9b81a1~mv2_d_3812_2108_s_2.jpg/v1/fill/w_3812,h_2108/PrintScreen%2C%20Synthetic%20Analysis.jpg).\n\nThe analysis shows that whenever OCR wrote a resolution letter  between 2012 and 2019 to adjudicate adversarial proceedings between  female and male parties, they sided with the female 216 times but only 9  times with the male (2400% more likely to side with the female). Their extreme partisanship is clear in every  aspect of Title IX.\n\n&#x200B;\n\n* **Athletics.** The Department’s athletics compliance tests have been [rightfully criticized](https://www.nccivitas.org/2010/title-ix-blind-quota-system-or-how-kneecap-college-sports/)  for imposing unconstitutional quotas. The agency sided with female  athletes 63 times, but sided with the male only once between 2012 and  2019. The only resolution letter favorable for male athletes is the [Temple University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03142257-a.pdf).\n* **Grading.** The Department sided with female students who alleged [discrimination](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/06112126-a.pdf) in [grading](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11162077-a.pdf) on [multiple occasions](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15132147-a.pdf), while dismissing [very similar allegations by male students](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/07132238-a.pdf).\n* **Retaliation.** The Department sided with female  complainants alleging retaliation on many occasions. There are at least  23 letters in this category, such as the [Jacksonville State University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/04142086-a.pdf)  where the agency sided with a “falsely accused” woman. There is no  clear example of the Department siding with a male student alleging  retaliation on the basis of sex, [but dismissal letters do exist](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10111376-a.pdf).\n* **Sexual Harassment.** Male students who petitioned the  agency to allege bias in sexual harassment disputes (either as the  accused, or the accuser) had a success rate of 1.1 percent during  2012-2019 (6/532). The Department was very aggressive when it came to  siding with female accusers while consistently dismissing the concerns  of accused males. This is despite male students often suffering  life-altering consequences, such as expulsion or a permanent notation on  their transcript, in addition to severe emotional distress. [Some have committed suicide](https://www.insidehighered.com/news/2017/05/02/title-ix-cases-resulted-suicide-suicide-attempt-two-colleges-prompt-fresh-debate).\n* **Reasonableness.** OCR urged schools to get rid of the  “reasonable person” standard at least twice:  One letter involved a  female student who accused a male teacher of [staring at her breasts for 3-4 seconds](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09141376-a.pdf). Another letter involved a costly systemic review because very young students [were playing “National Grab Ass Day”](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131106-a.pdf) during play time. The agency even sided with a female student whose claims of sexual violence [were disproven via DNA evidence](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15112115-a.pdf).\n* **Due Process.** While sending a dismissal letter to an accused male student, OCR argued that [“due process” is not covered by Title IX](https://www.scribd.com/document/426012564/Samuel-Meritt-University-Dismissal).  As long as the accused is a man, that is. Federal bureaucrats  aggressively sided with women who were accused of various sexual  infractions. On one occasion, the Department condemned a university for  allowing a male [to file a counter-claim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11116001-a.pdf) of misconduct against a female student. Another time, the agency [threatened a university](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/01102089-a.pdf)  with loss of federal funding for pressing fraud charges against a woman  who made false accusations. There is also an example of OCR using [defamation theory to side with a female complainant](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11141175-a.pdf), even though the agency has never accepted any complaints concerning the damaged reputations of accused men.\n* **Single-Sex Programs.** Women are the majority of college students, but many colleges offer dozens of support programs [for women only](https://www.jamesgmartin.center/2019/05/identity-politics-versus-basic-logic-should-colleges-offer-affirmative-action-for-the-female-majority/).  Whenever male complainants challenge female-only programs, such as  women’s centers or STEM camps for girls, the Department has dismissed  their complaints on various pretexts. One popular pretext is that these  female-only programs cannot be challenged unless men specifically apply  to them and receive rejections, thus creating a putative victim.  However, OCR has resolved [procedural complaints in the absence of any victim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/02152290-a.pdf) on many occasions, as long as the objective [was consistent with their agenda. ](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03121217-a.pdf)\n* **American Psychological Association (APA) Guidelines.** OCR dismissed a Title IX complaint challenging the APA guidelines, which sought to [classify masculinity as a mental illness factor](https://www.dailywire.com/news/46458/foia-request-reveals-boston-title-ix-office-has-ashe-schow).  This was despite serious public outcry against those guidelines. In the  dismissal letter, officials argued that Title IX cannot be applied in a  manner that would interfere with curricular materials. That was false.  OCR has aggressively interfered with [the training materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11142219-a.pdf) and [the curricular materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131096-a.pdf) of [various colleges](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10131040-a.pdf) as long as doing so furthers their gender agenda.\n* **Administrative Closure.** OCR has a rule requiring  the dismissal of pending complaints if similar allegations have been  filed elsewhere. This rule is rigorously applied [to male students to dismiss their Title IX complaints.](https://www.documentcloud.org/documents/3479594-Stanford-University-09-15-2324.html) However, when [female students file complaints against their institutions](https://www.ed.gov/news/press-releases/office-civil-rights-launches-investigation-university-southern-californias-handling-sexual-harassment-claims), administrative closure is not applied to dismiss their allegations.\n\nSome might assume that OCR has received few meritorious complaints  from male students. According to a Freedom of Information Act request,  however, the Department received [532 complaints](https://www.scribd.com/document/426016051/FOIA-All-532-Cases-With-545-Relevant-Allegations) from men in the sexual harassment category alone between 2011 and 2019.\n\nThe Department of Education became a hive of identity politics under  Obama and there is little evidence of improvement. The modest reforms  proposed by Secretary Betsy DeVos have not yet been implemented.\n\nResolution letters published under the Trump administration perpetuate the Obama doctrines. For example, [the Stanford University letter](https://provost.stanford.edu/wp-content/uploads/sites/4/2018/04/OCR-Redacted-Stanford-Letter-of-Finding.pdf) tried to eliminate the reasonable person standard. [The Butte-Glenn Community College letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09132096-a.pdf) involved a retroactive review of many old complaints, demanding the creation of a complex bureaucracy. [The Buffalo State University letter](https://www.insidehighered.com/sites/default/server_files/media/OCR-SUNY-Buffalo-State.pdf) wrongfully claimed that off-campus incidents fall under the jurisdiction of Title IX, [despite case law to the contrary.](https://caselaw.findlaw.com/us-8th-circuit/1410731.html)\n\nUnsurprisingly, some politicians want to abolish the entire Department of Education. Representative Thomas Massie has [introduced a bill](https://massie.house.gov/newsroom/press-releases/rep-massie-introduces-bill-to-abolish-federal-department-of-education)  to do just that. While we cannot predict whether the Department will  ever be abolished, we must never cease our vigilance against our very  own *Ministry of Love.* \n\n*Kursat Christoff Pekgoz is a PhD student at the University of Southern California.*\n\n*James E. Moore, II is professor of industrial and systems  engineering; public policy and management; and civil engineering at the  University of Southern California.*\n\n[*https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/*](https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/)",
    "title": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education",
    "subreddit": "MensRights",
    "timestamp": 1570815774,
    "score": 16,
    "keyword": "brown manager"
  }
]