[
  {
    "text": "The funniest case of men trying a period cramp simulator: Lux Perry, CEO and co-founder of Canadian period management company Somedays, on Breakfast Television Toronto last August with Dina Pugliese, Sid Seixeiro and Devo Brown",
    "title": "The funniest case of men trying a period cramp simulator: Lux Perry, CEO and co-founder of Canadian period management company Somedays, on Breakfast Television Toronto last August with Dina Pugliese, Sid Seixeiro and Devo Brown",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1682657639,
    "score": 10,
    "keyword": "brown ceo"
  },
  {
    "text": "Corporate BS is destroying my soul today. Just here to vent really. I know I don't have it half as bad as many others but the people machine is just wearing me out already this year.\n\nMy partner was fired from his management job at Aramark (fuck Aramark). I would say unexpectedly fired because they found some BS \"policy\" he broke and fired him immediately (no write ups, no priors), but I saw the writing on the wall based on the usual corporate shenanigans they were already up to. They basically forced his director into retirement at the end of 2022 (I assume because she knew she was about to be fired) and then refused to replace her or his regional manager who they relocated  because they're on a \"hiring freeze\". So instead they tried to double dip by making another director split his time between 2 locations. This director then picked the most brown nosing (and lowest paid) member of management to \"report\" (tattle for fear of her job) to him. She was ultimately who went running to the new director over the policy breech. So yeah, anyway- not surprised aside from never understanding the oppressed who lick the boots of their overlords.\n\nHe was upset but I told him flat out, fuck that job. They also fired another senior manager at another location the same day as him. I told him they're on some corporate profit bullshit and he'll be better off. I make decent money and unemployment isn't terrible (50% of his salary). He used to be employed by the hospital but of course Aramark got the food service contract and I fully believe they just didn't want to pay him what the hospital was.\n\nFuck Aramark and their CEO who got a 2.5 million dollar bonus in 2022. Scumbag.\n\nSo he filed for unemployment the day it happened (about 3 weeks ago) and the case worker or whatever called him, he answered all of her questions and explained that he was fired unexpectedly, deferred to HR when he asked what the policy was and how no one in HR would return his calls. Aramark also hadn't replied to the unemployment office either so we just figured whatever. Obviously we're an at will state, blah blah blah.\n\nWell this morning he got a letter DENYING him unemployment. Which is absolutely mind boggling to me. That was a hit I was not emotionally prepared for. Silly me I guess. So now we have no choice but to go through the lengthy appeal process and hope he can find another job with equal pay sooner rather than later.\n\nFuck Aramark. Fuck Bootlickers.\n\nI had more to say... grossly inflated wealth gap within my own job, no one caring about my department because we're good at our jobs so we don't \"create a need\" for development options while they create fancy Senior titles for upper management out of thin air.. Watching middle management get their bonuses and raises based off of our hard work instead because we make them look good. Not getting my Republican, Boomer, internalized-misogynistic coworkers to realize it. Watching them throw money at the C-Suite and promoting directors and VPs left and right to \"retain talent\" but fuck us hourly corporate peons I guess.\n\nOr how my son is suffering in the 4th grade... and I want to be so mad at his teacher, but also knowing she has more kids in her class than years on this earth... gets zero support from other parents with their hellion kids (probably because they're too busy working to death to have time to actually parent their kids) and is also probably under strict rules from the school district so they don't lose the only funding they get... all while not being paid shit.\n\nI could go on and on because the systemic bullshit is just hitting me all at once today and I'm so tired of it. I'm so tired I can't even verbalize all the ways this affects my family, not to mention so many other families who are worse off than mine. I'm so tired and I see no end to it. I have no answers or solutions.\n\nStay strong out there friends.",
    "title": "Corporate BS is destroying my soul today.",
    "subreddit": "WorkReform",
    "timestamp": 1676597880,
    "score": 22,
    "keyword": "brown ceo"
  },
  {
    "text": "Myy boss talks over me constantly. I'm on my way out, but how do I handle this in the mean time? My boss is the CEO of my small organisation. He isn't my line manager, but he may as well be - my line manager is effectively just someone that I ask for small logistical solutions and who approves my time off. Any larger issues or concerns with me wanting to be proactive on my projects so that things aren't last minute or crisis management are met by my line manager with, 'Well, did he tell you to do this thing? If not, you don't need to worry about it.' Which is true - I won't get in trouble. But my job could be much easier if I weren't constantly dealing with that.\n\nThe CEO and I have a meeting, usually weekly online, where I go through different stats and elements of my project and we discuss (read: he tells me, or I have to guess what's in his head) things moving forwards. \n\nDuring planning meetings, he has started to interrupt me - telling me to slow down (patronisingly slow), one thing at a time (I will literally be speaking about the thing he is talking about), or even actually slowing me down by talking over me and going 'up-bup-bup-bup'. And it's just. So fucking RUDE. It makes me want to hang up and say, 'You can call me back when you're going to speak to me like an actual person.'\n\nDo you have any advice for this? He is like this with everybody, but it is definitely slightly worse with me because I am a brown woman. The two senior managers in the company have advised that I just visually look annoyed or do a passive-aggressive sigh or something, and I'm like.......that seems like garbage???\n\n*To people who will tell me to just quit: I know I'm not in a great place right now. I love the work, but I am at the end of my tether with him, and have recently taken over my parents' business and am planning to leave, but am also hoping to use the extra income and secure a mortgage first, so I'm just putting up until then, then I can quit and focus on other projects full-time.*\n\n&#x200B;",
    "title": "Myy boss talks over me constantly. I'm on my way out, but how do I handle this in the mean time?",
    "subreddit": "careerguidance",
    "timestamp": 1694249424,
    "score": 4,
    "keyword": "brown ceo"
  }
]