[
  {
    "text": "After not being able to get $15/hr entry level jobs in desired field, I blew an interview for dream job opportunity significantly exceeded my salary expectations and don't know how whether I should feel like a doged a bullet or not. Advanced apologies for novel length of a post ..... OK so a few things to clarify:\n\n1. **The opportunity was my dream job, but with my nightmare employer.**\n   1. I'm 26 and I recently graduated university. **I intend on applying to law school** but prior to doing so, I have been looking for an entry level job in the legal field near me to be able to first move out of an abusive household, etc.\n   2. **The job exceeded my expecatations and it felt like a dream come true when I got called for an interview.**  zero work or intern experience in the legal field (But extensive knowledge about the law and have done legal writing/research) , I couldn't even find an entry level legal assistant job.\n      1. I see an an ad for a top rated trial attorney who owns a successful firm. He was hiring candidates with experience, or recent college grads who maintained a certain GPA which I exceeded.\n      2. The job was not only offered me a 40 plus starting salary with 0 work experience when every other place wouldn't even give me 15/hr for less experienced roles, but it was the only place that allowed me that position without requiring that I have a 2 yr certificate. **And it was being offered in my favorite part of town that I always wanted to work at.**\n      3. **Therefore, it was a dream job But it was for a nightmare employer.** On glassdoor, 2 out of 5 reviews stated that the firm had issues with sexual harassment, it was a \"boys' club, that \"inappropariate comments were made all the time\", and \"good luck if you're a female attorney\\*\\*.If you want to doubt the veracity of these reviews, please just stop; I understand if you may be skeptical of these reviews . but if you're going to totally doubt the veracity of them, then please just stop. There's a fine line between a sexual harassment complaint, and having a REPUTATION for it. I 've seen many disgruntled reviews for various companies, but there's a difference between being disgruntled and multiple claims of serious sexual harassment.\\*\\*\n      4. Other reviews cited long hours and bad pay, with one stating how they messed up on her paycheck a few times and another citing how they put off annual performance employee evaluations. **I didn't mind long hours & working overtime though, because it's what I needed.** One review also cited 20 out of 50 employyes got fired or quit in a year, and that the place was known for being a revolving door. almost all of them cited bad management, with one customer even commenting on a google review that they had lost her paperwork. (was still a very successful firm; the lawyers do \\*VERY\\* well for themsleves and have been nationally ranked as top trial attorneys)\n      5. **And to those who doubt the reviews are true, I could smell the truth of these reviews from miles away and even tried giving them a chance. But as soon as I** heard about how disgustingly routine it was to be sexually harassed, **the \"dream job\" instantly turned into a dream nightmare that I didn't even want to work. The thought of working there (long hours with little training and frequent harassment) depressed me.** I couldn't sleep for more than 3 hrs a night, my head constantly span as I decided whether to work there or not, and I had the worst acne I've had all year. **I've also been right about a bad situation anytime I've felt it, and ignoring that pit feeling only led to bad experiences throughout life.**\n      6. I'm 26, living with my parents and just want a stable career that just so that I can pay for a roof over my head to study and get into law school to prosecute guys like him, or start my own firm doing something similar. Since graduating in Aug 2020 I've worked extremely hard to overcome my mental health disorders and I've cut off anyone toxic /abusive in my life that was preventing me from being in the position I am today to move forward and become independent. **I have zero time to lose, and I have zero games to play after having worked hard to free myself of people who tried to play games with me for years. Because there was a solid chance that I would be sexually harassed again, taking this job meant possibly putting myself in a position that I might have to escape from within a short amount of time only to be back in the same position** without a job with additional challenges to overcome such as explaining to employers why I had a job that ended quickly. . **Even if the reviews \"weren't true\", I'm looking for stability, not additional games or opportunties that might lead to being back on my feet with greater gaps in my resume.**\n      7. **Reviews also stated no training, a lack of structure , and inconsistent expectations. This scared me since I had zero experience in the field, so it felt like a sink or swim job. I wanted to succeed but didn't know it the office cultivated an environment for that to be able to occur.**\n      8. **I wanted to cancel the interview sooooooo bad, but it was the only opportunity I had at a law firm so I thought I'd check it out.** But I felt like I was going to be working a dead end position that could stifle future oppoturnities as there was a chance that I might have to terminte myself from the job if being sexual harassed on a continued basis. Again, it could be that the sexual harassment would stop after telling him to, but seeing how arrogant he seems in TV interviews, the fact that he owns his own firm, and my experience with older business men like him(on the street after being sexually harassed) didn't guarantee that would happen. I'm not stereotyping older men, but he obviously thinks he can do whatever he wants in his own office simply because he is the owner of it and I'm just saying that the worst kind of harassment comes not from young men off the street, but people in positions who feel that they can abuse their power. And his behavior did not settle this feeling in any way whatsover because **THERE WERE RED FLAGS ALL THROUGHOUT THE PROCESS, STARTING FROM THE MOMENT HE EMAILED ME FOR AN INTERVIEW ALL THE WAY LEADING UP TO WHEN I WALKED INTO HIS OFFICE:**\n\n\\---------------------------------------------------------\n\n1. **The managing attorney aggressively recruited me.** I got notifications that he viewed my resume many times over the weekend, he gave my resume a like, and at 9AM the next business day, he asked me If I was available for an interview within the next 48 hrs. On the actual day of the interview, I also saw him waiting outside his office door for me a few minutes before the actual interview time. I applied on a Friday. He e-mailed me at 9AM the next business day asking if I could interview. But, I knew something was up based on how he asked me to interview which he did over e-mail like this :*(details of the actual interview in seperate section further below*):\n\n* \"XYZ(my name), Can you interview with me on X date (48 hrs away)? Please advise.\n   * first reaction: **i was digusted at his arrogance and immediately felt like an object; he was speaking to me like a pawn when I wasn't even an employee.** Such disregard for boundaries is a characteristic commonly held by (although not exclusively held by) employers who sexually harass or abuse their employees\\*\\*. I felt underappreciated and immediately had my guard up b/c it was as if he was expecting me to be there.\\*\\*where can i start lol?\n\n1. he didn't even start the e-mail with a HI, or say anything about my application . I was expecting something along the lines of Hi, Thank you for interest in XYZ firm/ something about my resume. Would you be available for an interview sometime this week (with a time **range as opposed to a single date and time 48 hours prior)**? normally employers discuss availability for interviews in the context of with at least more than one date or time......................................, especially after I suggested alternative, but very flexible time/dates that better suited my avaiability on the application which he clearly disregarded smh.\n2. Secondly, the subject line of the e-mail was \"interview with Jones law firm\" when name of the firm was Jones, Brown, and Yellow (not revealing actual name for confidentiality) . He was the owner of the firm, but failed to include the names of the others who shared partnership in the name of firm smh.\n\n* AFter replying with my availability, **he didn't even try to hide how he spoke to his other employee.** Didn't even ask her to *please* send me directions to get there after I confirmed. Instead, he literally replied back saying \"**We'll see you then**\\*(not even great, or I look forward to seeing you, etc);\\* **Janet, circulate invites\".**\n\n1. *Lol..we'll see you then as if it's my duty to be there?* And, If I were him, I'd be embarassed that a prospective employee who I'm trying to hire actually saw me ORDERING a current employee like that. **I didn't have a good feeling about firm b/c owner seemed like he embarassingly had no manners.**\n\n* didn't thnk that the reviews talking about bad management among other things were true? **LOL. \"Janet\"** never set me anything. She did send me something the morning before the interview, and it didn't even include the fact that there'd be a parking garage, etc which most receptionists include in info to interviewees. *Again, not surprising given that a former client stated on google reviews that they had lost her paperwork a few times.*\n\n\\------------------------------------------------------------------------------\n\n**Final stage: The interview.**\n\n* **Day of the interview.** I Wanted to be happy about being offered a chance to work a job that had everything I was looking for in a way, but I couldn't no matter how hard I tried and felt like I was trapping myself into a position and settling me for something that would backfire. **I Wanted to be happy, but I couldn't knowing that even if offered the job, I wouldn't be guaranteed the stability that I desire.** **I knew I that was gambling a zero sum game that if I rolled the dice on, would lead me back to where I was now. I** Was ready to go to sue him for sexual harassment in court if need be , but knew that I didn't want to waste any more time after gotten out of a court battle a few months ago where I had to fight off a narcissist slandering my name in front of judge. **The thought of working there literally caused my stomach to churn and my head to spin I recall constantly thinking about how I didn't want to work there.** I also felt like I was settling b/c they had contacted me so fast & I wanted to hear back from other employers that made me happier to work for. **I felt a huge sense of relief at the thought of not being offered the job, and wished that he didn't pursue interviewing me as proactively as he did.**\n* **I'm finally about to walk into the office**. **I felt like I was walking into another one of life's dead ends,not an exicitng job opportunity. I remember approaching him and feeling like I was meeting my next harasser, not my next employer. I did not feel scared at this, because** I am not scared of men who harass me by the way. I confidently confront it head on. Thinking as if I was approaching my next harasser just made me angry and feel on edge throughout the interview b/c no one wants to be in a position to \"confront them head on\" anyway. And i've been sexually harassed on the street almost every weekend for the past 6 yrs as a result of walking alone in form fitting clothing with 0 other people around me .\n* I walk into his office. **the lack of of bad management was not a lie lol; front desk seemed to be clueless about my interview at 5.** just as I was explaining it to them, he walked in and said \"I think she's here to see me\" . Angry at his earlier sense of entitlement towards me given to me in his e-mail and seeing it occur again in his office, I ignored him lol. *Likee, if you think i'm here to see you then say something to me not your employees..don't expect me to fall at your feet just because I was there to see you.* I continued to speak to the receptionists, which idk if that annoyed him or something because when I finally approached him, I don't even recall him saying hi or how are you? Maybe he did say hi, **but the first thing he said to me was not \"right this way\" or anything similar, but rather \"Follow me, Nancy\" in a slightly annoyed and joking tone.** Like what the actual fuck..follow you and in that tone when your receptionists were the ones who told me to sign in & you said nothing about it ??\n* I probably should have walked out right when he spoke like that but this was my first job interview so I wanted to see what would happen. So since this was my first job interview and compunded with what I had heard thus far, I was extremely on edge and just not my confident usual self.\n* So, he only asks me 3 questions in the interview while implying that he throught I was qualified. **One question he asked was how long I wanted to work there.** I've never been asked that questiion before so I was caught off guard. Because of that and the fact that I couldn't stop thinking about how I didn't want to work there, I immediately and stupidly blurted out \"for one year\" **only to remember that the job description stated in capital letters that this was a CAREER OPPORTUNITY (if it really was you wouldn't have to persuade people into thinking that it is because your management is so bad and b/c no one actually wants to work there lol)** /I normally might have thought of something else to say on the spot but instead stated the first thing that came to my mind because I thought he'd be ok with it given the super high turnover rate at his firm. *This was right before I mentioned to him my plans of relocating to a different city after a year SMH.*\n* In the interview, he also stated that he believed smart hardworking people had what it took to complete the job. He remarked \" If I recall, you (something to the effect of did really well in school), right?.\" After answering yes and asking what seperated the employees who he thought succeeded vs those who didn't, he stated 3 qualities and told me that because of my performance in school thus far, I have those 3 qualities even if may not know it yet. He basically thought I was qualified, **liked my resume, but didn't like me lol** which is why I want to explain a few other things which occurred:\n   * So first off, I'll say that the impression I got of him so far and the horrible things I read about his firm made it extremely hard for me to keep a straight face for just like just a few minutes into the interview . He wasn't able to see this b/c of my mask but it was telling of my headspace.\n   * the first thing he told me was \" So, I want to interview you and not your resume\" **which I knew were code words for \" I want to test your loyalty and not your skills. \"**\n   * **He tried to steer the interview into inquiring about personal details.**\n      * I'm 26, **I don't speak like a shy ditsy girl at all** but the only thing he knew about me was that I recently graduated college. So when I mentioned interning at a particular place he was like \" so that must have been when you were a sophomore or freshman in college, right?\" I was like I'm not going to tell you my age...... He casually responded by saying \"right, but I must at least be in the ballpark that you're 21 or 22 right now b/c you just graduated, correct?\n      * I'm someone who thrives on standing up for herself, loves doing it, but only learned this ability after years of experience .This was my very first job interview and I've never been asked that question in a subtle way before. **At the same time, I was eager to reassure anyone (even someone off the street) that I was certainly 21-22 b/c I've been bullied for months by those close to me about graduating at 26.** So I told him \"of course i am 21-22\"\n      * When revealing to him the name of the (republican ) senator I formerly interned for,his creep ass asked if he was \" a MAGA type\" in a joking tone (I assumed he was a republican merely pretending for me he didn't like MAGA types to find out my political leanings before realizing after the interview that he once showed up at a clinton fundraiser). Looking back I really regret not saying that \"sorry, I don't pay attention to the politics of those who I work with b/c I don't think the job has anything to do with it\" but instead I just kept telling him I didn't know b/c senator was never in the office.\n      * This was all right before he asked what was one of the biggest red flags of all especially in regards to harassment claims online by asking \" what was your most unforgettable experience there\" while smiling at me with a huge grin and shiny eyes after mentioning attending school in Austin ( a city known for being a rowdy college town). Instead of getting annoyed, I (perhaps blindly) **saw this as an opportunity to make a connection a**nd solidify my desire to pursue legal work; **I also wanted to send a message that I was strong enough to not volunteer details about my personal life even if he was curious about it .** So my face lit up when I told him that my most unforgettable experience there were conversations I had on campus about constitutional law and history **(which was true)**\n      * Towards the end, he kept asking me (with a huge cheesy grin on his face) whether I was ready to talk some of the other paralegals already working at the firm. **I couldn't tell whether he actually wanted me to do so if he was just trying to pursue a less awkard of closing the interview**.\n      * Either way, before that happened, an intense exchange occured when he told me in a very douchey tone that **If I was only going to be there for a year, then I couldn't pursue litigation (being in court)** right before condescendingly remarking that \"this wasn't some internship.\" Initially, I told him my focus wasn't on salary or advancement at the jump but rather on present work in a present role.\n      * He was fine with that, but as someone passionate about law and going to law school, **likeee unless you're a judge sweetheart, you aren't going to tell me I can't be in court.** Granted his reasoning was very understandable, but those are the kinds of comments you keep to yourself lol **like you don't have to be INTENTIONALLY be both a dick and dumbass about it and tell me \"What I can't do\" when all you have to do is not hire me anyway?? So I sternly reminded him** that my plans after 1 year could very well change so I shouldn't I be able to pursue litigation then?\n\n1. I made sure to sound as if I was looking for serious answers (because I certainly was). He nicely said of course before beating around the bush; I questioned him further, and he said \"this position is all we are going to talk about for today though ok?\" with a smile and a wink . I simply paused in silence, & with a dead expression on my face, told him I could meet another co-worker as discussed earlier.\n\n* He left and brought in another co-worker. I have to reinstate that none of the co-workers looked happy. The moment i walked in, none of the receptionists smiled or anything it seemed dead before the attorney greeted me. The co-worker I spoke to seemed just as on edge and stressed I was during the interview?You know how you're trying to aggressively make your interviewer think some type of way about you with filler words at a job interview? **that's exactly how she was acting.** She continued to stressfully emphasize how \" there are no stupid questions here, you can ask the attorneys anything(lol as if they have time to answer), how you'll get all the training you need with no experience(I beleived this), and that if there's a place to gain experience, it's here\". But, **She was like trying to sell the job to me and seemed tense & pressured.**\n* By the way, before introducing to me her, the employer asked if I had any questions or \"if I wanted to meet people.\" He barely gave me a chance to answer, but when I told him \"I do have questions for you\" he looked at me with a straight face lmao. I was thinking to myself, *\"Oh you think you wouldn't be asked any questions?\"*\n\n1. When asking him \"what do you think seperates employees who succeeed vs those who don't and what kind of culture does your firm promote for that\" he emphasized :\n   1. success of employees as long as they don't \"Clock watch\" , are dedicated & conscientious (which he said I was even if I myself didn't know that yet) . *Lol i wasn't surprised to hear that he looks for \"non clockwatchers\" especially when 1 of the reviews said he messed up on pay for long once.*\n2. then he also said **\" we have a culture in this firm where if something is in your lap even if someone before you messed it up, it is your responsibility to fix since it is in your lap\"**. I guess when I looked at him dead in the face quiet in response, he spoke up with a smile and said \"it's what I do all the time, I'm always cleaning up someone else's mess\" (personal injury accident firm)\n3. Anyway, after I was done speaking to the other paralegal,the attorney did not return; the paralegal looked around not knowing what to do **as if he hadn't told her he'd be back.** she suggested that she was going to speak to the receptionist and come back, but annoyed at the attorney's negligence in the interview ending smoothly, I followed her out with my backpack & knew it was time to leave. The attorney was speaking to one of the other attorneys in a seperate room, and when he saw us outside his door he immediately stepped out and and asked if we got a chance to speak. *umm of course we did.* But I just said it was a thorough chat before he just nodded and smiled without saying much. I didn't like that, so I subtly adjusted my backpack and turned the other way wanting to leave. He immediately said goodbye and have a good night in a nice tone but like in a fluttery \"okay sweetie if it's like that goodbye then\" tone. But I honestly can't remember which one of us motioned for the goodbyes first\n\n**Concluding thoughts & my question to audience (if anyone's reading) -----------------------------------------**\n\n**He called me in so quickly to do an interview that I didn't even have the chance to explore all my options & apply for college to grad hire programs with similar pay being offered to grads of my college. So I immediately felt like if I were to have automatically agreed to work for the lawyer, I would have settled without knowing whether it was the best option.** But after seeing that much of those college to grad opportunities have expired, I feel as if that firm was a great opportunity. I didn't realize this till after getting rejected/ spending more time to search for other opportunities (that aren't available ) online. **But, I am not sure how long that opportunity would have listed given the poor management and rife sexual harassment that I read occurs there.**\n\nI've realized that the extent to which I cried is a testament to how passionate I am about becoming one of the best lawyers in the country. **As a result, i don't want to just sit around and fulfill someone else's legal dream, I want to fulfill my own which is why I'm willing to take anything that pays decently just so that I can afford my own place and work towards not just getting into law school, but fucking dominating the process of it.** I want nothing else in life right now. I'm also proud of the fact I had such little time to make a life changing decision (whether to actually want to work there or not), and I chose my mental peace. Not just in a \"feel good \" way, but because not having mental peace was signifcantly impeding me from succeeding in past career related goals for many years.\n\n**Questions for Audience:-------------------------------------------------------------------------------**\n\nI just don't what  to feel? I've simultaneously felt a huggeee sense of relief from not having to think about when I may be harassed at work, but I've also felt a tremendous amount of loss from reasons already state\n\nSo being back to square 1 which is struggling to find a job in a way, idk whether:\n\n* I should feel proud or happy for dodging a blessing in digsuise?\n* I should feel like a failure for being so on edge and slightly akward during the interview? **in all honesty, i did come off that way because hoping that I wouldn't have to deal with being offered a position simply because I felt like it'd cause additional stress b/c I wasn't quite sure whether I even wanted to work there.** This all changed after the interview of course.\n   * Even though I didn't want the job right before interviewing, I feel like a failure that I bombed the interview simply because I may have let the people distract me away from and depress me about the actual job itself. While not doing this might have resulted in me actually wanting to interview and by default being in a different position than I am in right now, i'm pretty sure it would have led to me being in court.\n* I should feel like a wuss for not wanting to risk going to court to sue him ?\n   * *I read somewhere about a female encouraging another to take on a job if the other had the stomach for sexual harassment so that she could win in court and the employer could learn that he can't just abuse the hell out of whomever he wishes.*\n   * **That's exactly what I wanted to do and was ready to do (I'd win in court with body cam evidence). I have a history of taking on battles with people who have tried to abuse me just to \"put them in their place\" but there's more consequences involved when you might lose wages and time in your career when trying to fight those battles.** Likee, I dreaded the thought of fighting my own court battle (I'd fight it myself and win) while being unemployed and finding a new job.\n* If anyone is actually able to read/ respond to this Harry Potter book length of a post, I apologize in advance for potentially responding late as I am in the middle of job apps and meal prepping , but I definitely do respond to thank NICE people who have commented",
    "title": "After not being able to get $15/hr entry level jobs in desired field, I blew an interview for dream job opportunity significantly exceeded my salary expectations and don't know how whether I should feel like a doged a bullet or not. Advanced apologies for novel length of a post .....",
    "subreddit": "jobs",
    "timestamp": 1622942091,
    "score": 2,
    "keyword": "brown judge"
  },
  {
    "text": "What to teach young girls before puberty, based on things that I was not taught growing up I (17) have been contemplating this post for a while, but i finally decided it would be worth the effort to post. seeing more women my age become comfortable talking about sex and puberty, i’ve realized the lack of education i’ve had about my body. for the most part, i was handed a book and kinda figured it all out myself. my parents wanted to avoid the awkward conversations, which worked, but in turn i grew up with no knowledge of woman health. and from what i’ve seen online, this is not an uncommon thing. it’s frustrating how this last decade has been so empowering to women, but still lacks the strength to teach women about their bodies. even in sex ed at school we would learn all about men’s bodies, and the boners and wet dreams they would have. when we learned about women’s bodies, i learned what a period was and that was it. it feels like women’s health is taboo, and to a certain extent it is. contrary to popular belief, teaching a girl about her vagina before puberty is not going to ruin her childhood, it helps her understand what her body is doing. so i figured i would share some of the things that i wish i would’ve known as a preteen to maybe help parents or guardians of girls, and also shed some light on the sheer lack of sexual education women receive in schools. \n\nthis is all mostly coming from my experiences, i’m sorry if they aren’t accurate for everyone! also so sorry if there’s formatting issues, i’m on mobile. \n\n\n1. DISCHARGE \ndischarge seems so normal now that it’s weird to think about it not happening. but i’m here to remind all of you that there was an age when girls did not have discharge. nearly every girl i’ve talked with has had a similar experience when they started getting discharge, they thought they had cancer. not because there was something off in color or smell, they simply didn’t know that it was normal. to this day, i have never had anyone genuinely try to teach me about my vagina, especially about anything like discharge. if anyone is wondering, discharge is a natural, healthy, and COMPLETELY normal way of a vagina cleaning itself. vaginas actually self clean, there should never be a need to put soap up there or anything because it’s all under control! the problem comes when discharge shifts in color, to be more green, yellow, brown, or red, and also switches in smell. it’s important to pay attention to what your discharge looks like, but also be aware that having daily discharge is nothing strange or unordinary. \n\n2. BREAST CANCER CHECKS\none of the other few things i learned in sex ed was to check your breasts for tumors, and that feeling bumps inside of there is a sign of breast cancer. little did i know, there are actually milk ducts in your chest that you can feel! so along with many other girls i thought i had breast cancer based off of misinformation. \n\ni think what i’m getting at with most of this, is that you should tell your child how to self examine their own bodies for problems. that’s completely fine. BUT in turn teach them what is normal, and avoid that confusion and thoughts of cancer. \n\n3. PERIODS \njust some general period things that i think would’ve been nice to know, blood comes in many different colors, textures, and amounts. having a heavier flow does not mean that your vagina is “loose”, it just means your flow is heavier! tampon sizes mean nothing except how much they absorb. there is no shame in not wearing tampons or any other kind of inserted menstrual product, external products are just as great! everyone has a preference, and it doesn’t mean anything is wrong about you for using one thing rather than the other. it’s also extremely normal to have an irregular period at the beginning! sometimes you don’t settle into a regular cycle for well over a year, it’s completely normal. \n\n4. PET NAMES\nplease do not use a pet name when talking about genitalia. there’s nothing wrong with teaching children the word for a vagina or penis. it makes it uncomfortable when parents go out of their way to make it “kid friendly”, when it’s part of the human body. pet names have always never felt right to me, i don’t think that there’s anything wrong with using the correct terminology for genitalia. it makes the topic less uncomfortable, and it makes kids less embarrassed to talk to their parents about issues or questions they may have.\n\n5. THE HYMEN\noh wow is this a topic. the idea of virginity is already pretty fucked up, but on top of that the idea or purity around the hymen is very strange. \n\nkeep in mind, i am not meaning to offend any religions, religious beliefs, or cultures, i am just speaking about my opinion, as an american non religious woman, about the stigma around the hymen ( if i am being insensitive, please let me know :) ). \n\nthe idea of “virginity” is becoming more outdated as time goes on. is it the action of sexual penetration? how is virginity effected with same sex couples? and especially the idea of virginity is lost when the hymen breaks. if that logic is applied, hundreds of thousands of women have lost their virginity to tampons. some movement, such as riding a bike, can naturally stretch your hymen. it’s completely normal for your hymen to stretch and tear before you have sex. virginity is determined by you, because it’s your virginity. it’s demeaning and unfair to judge a woman’s purity on their hymen, especially when they can’t control when it breaks. the term “pop her cherry” is really demeaning, the hymen is not a indicator or sexual virginity. virginity has to do with sexual activity, not whether the hymen is present or not. ALSO on top of this, there is nothing wrong with being or not being a virgin. if you are comfortable with your sex life, you are doing great!\n\n6. ABSTINENCE \nit’s worth the time to correctly teach how to have safe sex. teaching abstinence doesn’t lead to no sex, it leads to STDs and teen pregnancy, because without safe sex education how are people going to know what safe sex is. abstinence does not stop sex, it stops safe sex. it’s impossible to stop an entire generation of teenagers from having sex, that’s not going to happen. it is completely worth it to teach what sex is and what it should be. this can lead to less teen pregnancy, which is always a good thing. \n\n\n\nit is worth the awkwardness to sit down and educate young women about their bodies. i knew more about the male anatomy than the female anatomy up until i was 15 years old, which is pretty bad. lots of confusion, especially with the idea of cancer, can be easily avoided with some body knowledge. every woman’s body is different and will behave differently, there is nothing wrong with yours ( unless you are experiencing some unhealthy symptoms, you might want to get that checked ). \n\nat the end of the day i mostly wanted to bring awareness to the lack of sex education women receive. to give you an idea, i have never met anyone who has genuinely known much about their body. i’ve known women who think they pee out of their vagina, because they were never taught any different. same goes for men’s view on women’s health. many men don’t really have a good idea on what a period is, unless they’ve been taught by other women, because sex education is so bad. all of this is no ones fault but the educators, how can we know what we aren’t educated on if we don’t know what it truly is. \n\nif there’s any young women reading this, don’t be afraid to ask questions to a trusted adult. i hope as your generation gets older, you will have had a better sex education than i did.\n\nEDIT: thank you so much for the awards! i’m comforted and also disappointed in the amount of women who can relate to this. keep educating and asking questions! i really appreciate all of the additions in the comments. there are no stupid questions, and no matter how old you are it’s important to learn about your body.",
    "title": "What to teach young girls before puberty, based on things that I was not taught growing up",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616137564,
    "score": 331,
    "keyword": "brown judge"
  },
  {
    "text": "Got blocked and ghosted after calling out a guy I was seeing for joking about domestic abuse Hey! So I'm at a loss right now like.. I've (24F) been seeing this guy (25M) and everything has been nice, today we go on a date and all is great, we get into his car cause he was taking me home and we begin talking about music, I ask for his favorite artists and among others he names Chris Brown, I go yikes and he says \"why? Cause of the Rihanna sh*it? Thats nothing, who cares\" and I'm like.. what? He doubles down and keeps going about how I'm judging him based on only one side of the story and that maybe she did something to him. He was being kind of playful? While saying all that, but I was done and in a very serious tone asked him if he was serious to which he replied that he was just joking and I told him pissed off I don't like joking about that sort of thing. He said ok and didn't speak a single word to me the rest of the ride, when we get to my place I was still cold but said goodbye and to let me know when he landed (he had a flight later that day).\nSo I get home, some time passes and I realize he must be there by now but haven't heard from him, go to check the WhatsApp chat and he f*cking blocked me! He blocked me on Instagram too and omg I'm so confused like.. I should be the one blocking him! WTF\n\nAnyways I just needed to vent I'm so pissed at myself for going out with that guy and believing he was nice. And I'm also super confused so if anyone was some kind of input it'd be appreciated.",
    "title": "Got blocked and ghosted after calling out a guy I was seeing for joking about domestic abuse",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630896192,
    "score": 95,
    "keyword": "brown judge"
  },
  {
    "text": "Opinions On Ethnic Women Having Blonde Hair So, here's the situation. I recently dyed my hair blonde, and it took a lot for me to muster up the courage to not care about having blonde hair as an Asian-American. Of course, you see a bunch of Asian American women with a blonde balayage, and they look amazing with it. I have had light brown hair for over a year, and I just really felt inclined to switch it up late last year because I needed a fresh new start (things ended badly with the guy I was dating). I thought going blonde would help me feel more confident, but instead it makes me feel so weird about myself in public (especially when I am hanging out with my white friends). I have this perception that people think I am trying to be something I am not (\"act white\") and that as an Asian American, I should stick to the darker hair colors. I know that so many non-white women can rock the blonde hair (I was inspired by yanyanchan on IG) and that wanting to be blonde does not stem from a desire to look Caucasian. The blonde color is just pretty (especially when you wear so much black clothing) and can spice up your hair.\n\nI was just wondering what everyone's views are on this. Have any of you guys regretted going blonde or felt weird about being a blonde when you aren't white? I spent hundreds of dollars to go blonde, and now that I am, I feel like I should just go back to the salon and dye it brown/black again. I hate that I feel like this, but I've spent way too much time thinking about my hair. Even though my hair looks great and that I still think I look pretty, I just feel weirdly judged when I see people look at me in public.",
    "title": "Opinions On Ethnic Women Having Blonde Hair",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613283524,
    "score": 9,
    "keyword": "brown judge"
  },
  {
    "text": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans] Noticeably absent:\n\n* University of Texas - Austin\n* Fordham\n* Iowa\n* Alabama\n* George Mason\n* Baylor\n* Notre Dame\n* Texas A&M\n* Kansas\n\n&#x200B;\n\n&#x200B;\n\n[https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/](https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/)\n\nJanuary 12, 2021\n\nLaw Deans Joint Statement on the 2020 Election and Events at the Capitol\n\n&#x200B;\n\nWe are deans of a diverse range of law schools across the country. We do not use our positions to advance our individual views. But we do have an obligation to support the rule of law and preserve the integrity of the legal profession. On rare occasions, despite our differing situations and views, that obligation requires us to speak as one to defend the fundamental commitments of our profession. This is such a moment.\n\nThe violent attack on the Capitol was an assault on our democracy and the rule of law. The effort to disrupt the certification of a free and fair election was a betrayal of the core values that undergird our Constitution. Lives were lost, the seat of our democracy was desecrated, and our country was shamed.\n\nMany lawyers and judges worked honestly and in good faith, often in the face of considerable political pressure, to ensure the 2020 election was free and fair. However, we recognize with dismay and sorrow that some lawyers challenged the outcome of the election with claims that they did not support with facts or evidence. This betrayed the values of our profession. Our profession demands that when lawyers pursue legal action, they must bring claims in good faith, grounded in facts and evidence, and demonstrate respect for the legal system. Only then can lawyers fulfill their responsibilities as lawyers and public citizens to promote public confidence in the rule of law and the justice system — duties that extend to all professional activities, whether lawyers are representing a client or not. The rule of law is as much a touchstone of our profession as it is of our Constitution.\n\nAs law deans, our mission is to train the next generation of leaders to uphold the core values of our profession and sustain the rule of law. This should be a moment of reflection for legal educators and members of the legal profession. A sustained effort will be necessary to repair and preserve our precious democratic institutions. As legal educators and lawyers ourselves, we must redouble our efforts to restore faith in the rule of law and the ideals of the legal profession. We have enormous faith in the law’s enduring values and in our students, who will soon lead this profession. We call upon all members of the legal profession to join us in the vital work ahead.\n\n&#x200B;\n\nSigned,\n\n^(Alicia Ouellette President and Dean Albany Law School)\n\n^(Robert Dinerstein Acting Dean and Professor of Law American University, Washington College of Law)\n\n^(Jace C. Gatewood Dean and CEO Atlanta's John Marshall Law School)\n\n^(Melanie Leslie Dean and Samuel Belkin Professor of Law Benjamin N. Cardozo School of Law, Yeshiva University)\n\n^(Vincent Rougeau Dean and Professor Boston College Law School)\n\n^(Angela Onwuachi-Willig Dean and Professor of Law Boston University School of Law)\n\n^(Michael T. Cahill President, Joseph Crea Dean & Professor of Law Brooklyn Law School)\n\n^(Sean M. Scott President and Dean California Western School of Law)\n\n^(Reynaldo Anaya Valencia Dean and Professor of Law Capital University Law School)\n\n^(Anita K. Krug Dean and Professor Chicago-Kent College of Law, Illinois Institute of Technology)\n\n^(Charles H. Rose III Dean and Professor of Law Claude W. Pettit College of Law, Ohio Northern University)\n\n^(Lee Fisher Dean and Joseph C. Hostetler-BakerHostetler Chair in Law Cleveland-Marshall College of Law, Cleveland State University)\n\n^(Gillian Lester Dean and Lucy G. Moses Professor of Law Columbia Law School)\n\n^(Jens David Ohlin Interim Dean & Professor of Law Cornell Law School)\n\n^(Joshua P. Fershée Dean and Professor of Law Creighton University School of Law)\n\n^(Henry C. Strickland Dean Cumberland School of Law, Samford University)\n\n^(Mary Lu Bilek Dean and Professor of Law CUNY School of Law)\n\n^(Rodney A. Smolla Dean & Professor of Law Delaware Law School, Widener University)\n\n^(Jennifer Rosato Perea Dean and Professor DePaul University College of Law)\n\n^(Jerry L. Anderson Dean and Richard M. and Anita Calkins Distinguished Professor of Law Drake University Law School)\n\n^(Kerry Abrams James B. Duke and Benjamin N. Duke Dean and Professor of Law Duke University School of Law)\n\n^(April M. Barton Dean and Professor of Law Duquesne University School of Law)\n\n^(Horace Anderson Dean and Professor of Law Elisabeth Haub School of Law, Pace University)\n\n^(Luke Bierman Dean and Professor of Law Elon University School of Law)\n\n^(Mary Anne Bobinski Dean and Asa Griggs Candler Professor of Law Emory University School of Law)\n\n^(Deidré A. Keller Dean and Professor of Law Florida Agricultural and Mechanical University College of Law)\n\n^(C. Peter Goplerud Dean and Professor of Law Florida Coastal School of Law)\n\n^(Antony Page Dean & FIU Foundation Professor of Law Florida International University College of Law)\n\n^(Erin O’Hara O'Connor Dean and McKenzie Professor of Law Florida State University College of Law)\n\n^(William M. Treanor Dean & Executive Vice President Georgetown Law)\n\n^(Leslie E. Wolf Interim Dean and Distinguished University Professor Georgia State University College of Law)\n\n^(Eric C. Christiansen Dean of the Law School (Interim, 2020-21), Professor of Law Golden Gate University, School of Law)\n\n^(Jacob Rooksby Dean and Professor of Law Gonzaga University School of Law)\n\n^(John F. Manning Morgan and Helen Chu Dean and Professor of Law Harvard Law School)\n\n^(Danielle Holley-Walker Dean and Professor of Law Howard University School of Law)\n\n^(Austen Parrish Dean and James H. Rudy Professor of Law Indiana University Maurer School of Law)\n\n^(Karen E. Bravo Dean and Professor of Law Indiana University Robert H. McKinney School of Law)\n\n^(Gordon Smith Dean and Woodruff J. Deem Professor of Law J. Reuben Clark Law School at Brigham Young University)\n\n^(Jennifer J. Johnson Dean and Erskine Wood Sr. Professor of Law Lewis and Clark Law School)\n\n^(Matthew R. Lyon Vice President & Dean Lincoln Memorial University Duncan School of Law)\n\n^(Colin Crawford Dean and Professor of Law Louis D. Brandeis School of Law, University of Louisville)\n\n^(Lee Ann Wheelis Lockridge Interim Dean and Professor of Law Louisiana State University Law Center)\n\n^(Michael Waterstone Dean and Professor of Law Loyola Law School, Los Angeles)\n\n^(Michael J. Kaufman Dean and Professor of Law Loyola University Chicago School of Law)\n\n^(Madeleine M. Landrieu Dean and Judge Adrian G. Duplantier Distinguished Professor of Law Loyola University New Orleans College of Law)\n\n^(Gail Prudenti Dean Maurice A. Deane School of Law at Hofstra University)\n\n^(Cathy Cox Dean and Professor of Law Mercer University School of Law)\n\n^(Lincoln L. Davies Dean & Frank R. Strong Chair in Law Michael E. Moritz College of Law, The Ohio State University)\n\n^(Melanie B. Jacobs Interim Dean & Professor of Law Michigan State University College of Law)\n\n^(Patricia Bennett Dean & Professor of Law Mississippi College School of Law)\n\n^(Anthony Niedwiecki President and Dean Mitchell Hamline School of Law)\n\n^(Anthony W. Crowell Dean and President New York Law School)\n\n^(Trevor Morrison Dean and Eric M. and Laurie B. Roth Professor of Law New York University School of Law)\n\n^(James Hackney Dean and Professor of Law Northeastern University School of Law)\n\n^(James Speta Interim Dean Northwestern Pritzker School of Law)\n\n^(José Roberto (Beto) Juárez, Jr. Dean and Professor of Law Nova Southeastern University Shepard Broad College of Law)\n\n^(Jim Roth Dean and Professor of Law Oklahoma City University School of Law)\n\n^(Danielle M. Conway Dean and Donald J. Farage Professor of Law Penn State Dickinson Law)\n\n^(Hari M. Osofsky Dean, Penn State Law and Penn State School of International Affairs Distinguished Professor of Law, Professor of International Affairs, and Professor of Geography)\n\n^(Paul L. Caron Duane and Kelly Roberts Dean and Professor of Law Pepperdine University Rick J. Caruso School of Law)\n\n^(Jennifer Gerarda Brown Dean and Professor of Law Quinnipiac University School of Law)\n\n^(Gregory W. Bowman Dean & Professor of Law Roger Williams University School of Law)\n\n^(David Lopez Co-Dean & Professor of Law Rutgers Law School)\n\n^(Kimberly M. Mutcherson Co-Dean & Professor of Law Rutgers Law School)\n\n^(Elizabeth Kronk Warner Dean S.J. Quinney College of Law, University of Utah)\n\n^(William P. Johnson Dean and Professor of Law Saint Louis University School of Law)\n\n^(Judith Daar Ambassador Patricia L. Herbold Dean and Professor of Law Salmon P. Chase College of Law, Northern Kentucky University)\n\n^(Douglas J. Sylvester Dean and Professor of Law Sandra Day O’Connor College of Law at Arizona State University)\n\n^(Anna M. Han Interim Dean Santa Clara University School of Law)\n\n^(Martin H. Brinkley Dean and Arch T. Allen Distinguished Professor School of Law, University of North Carolina at Chapel Hill)\n\n^(Annette E. Clark Dean and Professor of Law Seattle University School of Law)\n\n^(Kathleen M. Boozang Dean and Professor of Law Seton Hall University School of Law)\n\n^(Jennifer M. Collins Judge James Noel Dean and Professor of Law SMU Dedman School of Law)\n\n^(Susan Westerberg Prager President and Dean Southwestern Law School)\n\n^(Michael A. Simons Dean and John V. Brennan Professor of Law St. John’s University School of Law)\n\n^(Jenny S. Martinez Richard E. Lang Professor of Law & Dean Stanford Law School)\n\n^(Michèle Alexandre Dean and Professor of Law Stetson University College of Law)\n\n^(Andrew Perlman Dean & Professor of Law Suffolk University Law School)\n\n^(Craig M. Boise Dean and Professor of Law Syracuse University College of Law)\n\n^(Gregory N. Mandel Dean & Peter J. Liacouras Professor of Law Temple University, Beasley School of Law)\n\n^(Dayna Bowen Matthew Dean and Harold H. Greene Professor of Law The George Washington University Law School)\n\n^(Christopher J. (C.J.) Peters Dean and C. Blake McDowell, Jr. Professor of Law The University of Akron School of Law)\n\n^(Thomas J. Miles Dean and Clifton R. Musser Professor of Law and Economics The University of Chicago Law School)\n\n^(Katharine Traylor Schaffzin Dean & Professor of Law The University of Memphis Cecil C. Humphreys School of Law)\n\n^(Sergio Pareja Dean The University of New Mexico School of Law)\n\n^(Benjamin Barros Dean and Professor of Law The University of Toledo College of Law)\n\n^(Lyn Suzanne Entzeroth Dean and Dean John Rogers Endowed Chair The University of Tulsa College of Law)\n\n^(Daniel M. Filler Dean and Professor of Law Thomas R. Kline School of Law, Drexel University)\n\n^(David D. Meyer Dean and Mitchell Franklin Professor of Law Tulane University Law School)\n\n^(Theresa Beiner Dean & Nadine Baum Distinguished Professor of Law UA Little Rock William H. Bowen School of Law)\n\n^(Kevin R. Johnson Dean UC Davis School of Law)\n\n^(Jennifer L. Mnookin Dean and Ralph and Shirley Shapiro Professor of Law UCLA School of Law)\n\n^(Darby Dickerson Dean and Professor of Law UIC John Marshall Law School, The University of Illinois at Chicago)\n\n^(Barbara Glesner Fines Dean & Rubey M. Hulen Professor of Law UMKC School of Law)\n\n^(Aviva Abramovsky Dean and Professor of Law University at Buffalo School of Law, The State University of New York)\n\n^(Marc L. Miller Dean & Ralph W. Bilby Professor of Law University of Arizona James E. Rogers College of Law)\n\n^(Margaret Sova McCabe Dean & Professor of Law University of Arkansas School of Law)\n\n^(Ronald Weich Dean and Professor of Law University of Baltimore School of Law)\n\n^(David L. Faigman Chancellor & Dean and John F. Digardi Distinguished Professor of Law University of California Hastings College of the Law)\n\n^(Erwin Chemerinsky Dean and Jesse H. Choper Distinguished Professor of Law University of California, Berkeley School of Law)\n\n^(L. Song Richardson Dean and Chancellor’s Professor of Law University of California, Irivine School of Law)\n\n^(Verna L. Williams Dean and Nippert Professor of Law University of Cincinnati College of Law)\n\n^(S. James Anaya Dean and University Distinguished Professor University of Colorado Law School)\n\n^(Eboni S. Nelson Dean and Professor of Law University of Connecticut School of Law)\n\n^(Andrew Strauss Dean and Professor of Law University of Dayton School of Law)\n\n^(Bruce P. Smith Dean and Professor of Law University of Denver Sturm College of Law)\n\n^(Phyllis L. Crocker Dean and Professor of Law University of Detroit Mercy School of Law)\n\n^(Laura Ann Rosenbury Dean and Levin, Mabie & Levin Professor of Law University of Florida Levin College of Law)\n\n^(Peter B. Rutledge Dean University of Georgia School of Law)\n\n^(Camille A. Nelson Dean and Professor of Law University of Hawai‘i at Mānoa, William S. Richardson School of Law)\n\n^(Leonard M. Baynes Dean and Professor of Law University of Houston Law Center)\n\n^(Jerrold Long Dean and Professor of Law University of Idaho College of Law)\n\n^(Vikram David Amar Dean and Iwan Foundation Professor of Law University of Illinois College of Law)\n\n^(Mary J. Davis Dean and Ashland-Spears Distinguished Research Professor of Law University of Kentucky J. David Rosenberg College of Law)\n\n^(Daniel W. Hamilton Dean & Richard J. Morgan Professor of Law University of Las Vegas, William S. Boyd School of Law)\n\n^(Donald B. Tobin Dean and Professor of Law University of Maryland Francis King Carey School of Law)\n\n^(Eric J. Mitnick Dean & Professor of Law University of Massachusetts School of Law)\n\n^(Anthony E. Varona Dean and M. Minnette Massey Professor of Law University of Miami School of Law)\n\n^(Mark D. West Dean and Nippon Life Professor of Law University of Michigan Law School)\n\n^(Garry W. Jenkins Dean & William S. Pattee Professor of Law University of Minnesota Law School)\n\n^(Susan H. Duncan Dean and Professor of Law University of Mississippi)\n\n^(Lyrissa Lidsky Dean & Judge C.A. Leedy Professor of Law University of Missouri School of Law)\n\n^(Richard Moberly Dean and Richard C. & Catherine S. Schmoker Professor of Law University of Nebraska College of Law)\n\n^(Megan Carpenter Dean and Professor of Law University of New Hampshire Franklin Pierce School of Law)\n\n^(Michael S. McGinniss Dean and Professor of Law University of North Dakota School of Law)\n\n^(Katheleen R. Guzman Interim Dean and Professor University of Oklahoma College of Law)\n\n^(Marcilynn A. Burke Dean and Dave Frohnmayer Chair in Leadership and Law University of Oregon School of Law)\n\n^(Theodore W. Ruger Dean and Bernard G. Segal Professor of Law University of Pennsylvania Carey Law School)\n\n^(Amy J. Wildermuth Dean and Professor of Law University of Pittsburgh School of Law)\n\n^(Vivian I. Neptune Dean University of Puerto Rico School of Law)\n\n^(Wendy C. Perdue Dean and Professor of Law University of Richmond School of Law)\n\n^(Robert Schapiro Dean and Professor of Law University of San Diego School of Law)\n\n^(Susan H. Freiwald Dean and Professor of Law University of San Francisco School of Law)\n\n^(William C. Hubbard Dean and Professor of Law University of South Carolina School of Law)\n\n^(Neil Fulton Dean University of South Dakota Knudson School of Law)\n\n^(Andrew T. Guzman Dean and Carl Mason Franklin Chair in Law, and Professor of Law and Political Science University of Southern California Gould School of Law)\n\n^(Robert K. Vischer Dean and Mengler Chair in Law University of St. Thomas School of Law)\n\n^(Douglas Blaze Interim Dean and Art Stolnitz and E.O. Overton Professor of Law University of Tennessee College of Law)\n\n^(Renée McDonald Hutchins Dean & Rauh Chair of Public Interest Law University of the District of Columbia David A. Clarke School of Law)\n\n^(Michael Hunter Schwartz Dean and Professor of Law University of the Pacific, McGeorge School of Law)\n\n^(Risa Goluboff Dean and Arnold H. Leon Professor of Law and Professor of History University of Virginia School of Law)\n\n^(Mario L. Barnes Toni Rembe Dean and Professor of Law University of Washington School of Law)\n\n^(Daniel P. Tokaji Fred W. & Vi Miller Dean and Professor of Law University of Wisconsin Law School)\n\n^(Klint Alexander Dean and Professor of Law University of Wyoming College of law)\n\n^(Chris Guthrie Dean Vanderbilt Law School)\n\n^(Thomas McHenry President and Dean Vermont Law School)\n\n^(Mark C. Alexander Arthur J. Kania Dean and Professor of Law Villanova University Charles Widger School of Law)\n\n^(Jane H Aiken Dean and Professor of Law Wake Forest Law School)\n\n^(Carla D. Pratt Dean and Professor of Law Washburn University School of Law)\n\n^(Brant J. Hellwig Dean and Professor of Law Washington and Lee University School of Law)\n\n^(Nancy Staudt Dean and Howard & Caroline Cayne Distinguished Professor of Law Washington University School of Law)\n\n^(Richard A. Bierschbach Dean and Professor of Law Wayne State University Law School)\n\n^(James McGrath Dean and President Western Michigan University Cooley Law School)\n\n^(Sudha Setty Dean and Professor of Law Western New England University School of Law)\n\n^(Allen K. Easley Dean & Professor of Law Western State College of Law at Westcliff University)\n\n^(Brian Gallini Dean & Professor of Law Willamette University College of Law)\n\n^(A. Benjamin Spencer Dean & Chancellor Professor William & Mary Law School)\n\n^(John E. Taylor Interim Dean and Jackson Kelly Professor of Law WVU College of Law)\n\n^(Heather K. Gerken Dean and Sol & Lillian Goldman Professor of Law Yale Law School)",
    "title": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans]",
    "subreddit": "LawSchool",
    "timestamp": 1610491035,
    "score": 15,
    "keyword": "brown judge"
  },
  {
    "text": "Question about formal wear for judicial clerkship interviews Hey everyone,\n\nSo, I have absolutely no sense of what good vs. bad fashion is, especially when interviewing for older judges. For such clerkship interviews, would a navy blue suit, light colored tie, and brown shoes/belt be appropriate? Or should I stick to more traditional black shoes/belt? If anyone has an opinion, I'd love to hear it.",
    "title": "Question about formal wear for judicial clerkship interviews",
    "subreddit": "LawSchool",
    "timestamp": 1623675578,
    "score": 7,
    "keyword": "brown judge"
  },
  {
    "text": "Intersectional Feminism on r/Feminism I apologies in advance for this unformatted rant.\n\nI just got perma banned for disagreeing with a post about the hijab, that imo painted specifically brown muslim women as lacking any agency even in countries that don't support/inflict the wear of religious headcoverings.\n\nWas my tone a little harsh? Yes.\nDid I insult or derail the convo though? Nope. \n\nTo be fair, I am tired of western white ladies doing their version of white savior syndrome and judging an entire population for what OP called an inherently patriarchal garnment.\n\nSo obviously my first thought was that my comment must have been botted, since I didn't really break any of the sub's rules, so I messaged the mods a 3 liner asking how exactly did I \"promote mysoginistic practices\". Hell, I explicitly criticised when the hijab is forced upon women and when it's not an explicit choice, which sadly still largely exist. All I argued was that there is more to it, and that we can't discount the narrative of feminism that includes Muslim women wearing hijabs by their own free will. Because, you know, that actually exists.\n\nGuess what? I was muted for a month from messaging the moderators. After 3 lines asking for an explanation.\nThis is the part where I want to say fuck white feminism. But oh well, that would be too harsh wouldn't it?\n\nI am overlooking something here?",
    "title": "Intersectional Feminism on r/Feminism",
    "subreddit": "blackladies",
    "timestamp": 1635889145,
    "score": 96,
    "keyword": "brown judge"
  },
  {
    "text": "(STUDIES SHOW) Domestic violence against women was condemned and illegal way before the 1970s. Back then, they were some of the most hated people on Earth whereas domestic violence against men was tolerated back then. This idea it wasn't condemned until the 1970s is a myth. [https://web.law.columbia.edu/sites/default/files/microsites/law-culture/files/2010-files/Katz\\_Workshop\\_Paper.pdf](https://web.law.columbia.edu/sites/default/files/microsites/law-culture/files/2010-files/Katz_Workshop_Paper.pdf)\n\n[https://scholarship.law.wm.edu/cgi/viewcontent.cgi?article=1404&context=wmjowl&httpsredir=1&referer=](https://scholarship.law.wm.edu/cgi/viewcontent.cgi?article=1404&context=wmjowl&httpsredir=1&referer=)\n\nMany people, including historians, believe this myth that until the 1970s, domestic violence was tolerated and police did nothing about it. These research papers debunk this myth, showing overwhelmingly large amounts of evidence that the opposite is true. People took domestic violence far more seriously than they do nowadays. Back then, however, the word domestic violence was not commonly used. Instead, people just said \"wife beating\" or \"wife beater\". People back then advocated whipping posts for wife beaters and people wanted you killed even if you beat your wife only once (imagine if Chris Brown beat Rihanna back then!). A couple of states, such as Maryland, Delware, and Oregon, had whipping posts, and public opinion approved of murder vigilantism and whipping posts against wife beaters. Vigilantism also happened every now and then (which is rare nowadays). Telling someone back then you're a wifebeater is like telling someone today that you're a child molester.\n\n**But guess what?**\n\nWomen who beat their husbands were relatively tolerated. Although many people hated women who beat their husband, many people didn't care about what they did. Women who beat their husbands were used in popular culture for humor-related purposes and people made jokes about it. Judges were also far more lenient on women who beat husbands, with some judges even outright praising them. Here's a quote:\n\n>It is striking that judges condoned wives’ use of physical punishment when they found their husbands drunk. One judge declared in open court, “\\[a\\]ny wife has my official permission to beat her husband with any weapon she chooses if the man comes home drunk late at night.” In a similar type of case, a “young and pretty” wife explained to a judge in Kansas that she had given her husband a severe beating because he had broken her rule that he must be home each night by 9:00 P.M. “You are a good woman,” the judge told the wife, “and I want to compliment you for taking the law into your own hands. We ought to have more women like you.” The judge discharged her immediately but only agreed to discharge her husband after he promised to return home before his wife’s curfew.  \n>  \n>Outside courtrooms, a similar understanding seems to have existed. A news brief in one paper summarized: “\\[a\\]n Indiana woman is to get a medal for beating her husband. While admittedly the best in the world, the American husband evidently needs toning down occasionally.” Legislators debating appropriate punishments for hus- band beating in New Jersey thought “it would be a splendid thing if there were more women who were willing and able to chastise worthless husbands properly.” Even a man whose “husky” wife “sent him down for the count and an ambulance surgeon” after attacking him in his sleep was reported as acknowledging the appropriate- ness of his wife’s assault. He told the police, “I guess she was right. But I’m surprised at her for using the stove lifter, just the same.”\n\nMale victims of domestic violence were never taken seriously. Judges \"harshly condemned male perpetrators—sentencing men to fines, prison, and even the whipping post—for failing to conform to appropriate husbandly behavior, while rewarding wives who exhibited the traditional female traits of vulnerability and dependence. Based on the same gendered reasoning, judges trivialized or even ridiculed victims of 'husband beating.' Men who sought protection against physically abusive wives were deemed unmanly and undeserving of the legal remedies afforded to women.\"\n\nMale victims were often seen as \"weak\" or \"unmanly\" for being victimized by a woman, and they were mocked, ridiculed, stigmatized and overlooked. Although small men who were attacked by bigger wives still received ridicule and lack of sympathy, men who were attacked by smaller wives were even more ridiculed. Many newspapers would point out the physical disparity between the two to emphasize this, while refusing to point out physical disparities when a husband beat his wife. Many times when women beat their husbands, crowds would be amused and would watch and observe or even applaud instead of intervening. If people knew about a husband beating his wife, he'd be either reported or arrested or become the victim of a vigilante mob, being attacked or even killed.\n\nAlthough battered women's shelters didn't exist until the early 1970s, people still took domestic violence against women far more serious a century ago than they do nowadays. Being a male victim of domestic violence is stigmatized and difficult today, but was way worse back then.\n\nJudges were far more lenient towards women who beat their husbands. Women who beat their husbands were never put on the whipping post or attacked by vigilantes/judges. A man could just beat his wife only once (without severe injuries) and people back then already wanted him dead. Just imagine if Chris Brown beat Rihanna back then.",
    "title": "(STUDIES SHOW) Domestic violence against women was condemned and illegal way before the 1970s. Back then, they were some of the most hated people on Earth whereas domestic violence against men was tolerated back then. This idea it wasn't condemned until the 1970s is a myth.",
    "subreddit": "MensRights",
    "timestamp": 1623679408,
    "score": 100,
    "keyword": "brown judge"
  }
]