[
  {
    "text": "In need of a pick me up Never thought I would work for a school but here I am. \n\nI work at a school(first year) where I am an expeditions director and we focus on experiential learning. I take kids on trips to go hiking, camping, canoe, backpacking, etc. Its a beautiful job where I can show these black and brown the healing and awesome power of these green spaces. \n\n Coming from outdoor rec programming for a state/fed agency I’m used to people want to be there. The kids however who i work with take these moments for granted and  I feel like I am dragging or having to convince them the entire time. When we finally get to the trip I’m annoyed and lose my enthusiasm for our trips. I think it’s the lack of appreciation for me. \n\nI know that these experiences are some where they may not  appreciate it now but will in the future, buts it hot trash now for the person running it. ME. Is this normal to expect? \n\nWhat advice or skills would you implement?",
    "title": "In need of a pick me up",
    "subreddit": "Teachers",
    "timestamp": 1683464551,
    "score": 0,
    "keyword": "brown director"
  },
  {
    "text": "Corporate BS is destroying my soul today. Just here to vent really. I know I don't have it half as bad as many others but the people machine is just wearing me out already this year.\n\nMy partner was fired from his management job at Aramark (fuck Aramark). I would say unexpectedly fired because they found some BS \"policy\" he broke and fired him immediately (no write ups, no priors), but I saw the writing on the wall based on the usual corporate shenanigans they were already up to. They basically forced his director into retirement at the end of 2022 (I assume because she knew she was about to be fired) and then refused to replace her or his regional manager who they relocated  because they're on a \"hiring freeze\". So instead they tried to double dip by making another director split his time between 2 locations. This director then picked the most brown nosing (and lowest paid) member of management to \"report\" (tattle for fear of her job) to him. She was ultimately who went running to the new director over the policy breech. So yeah, anyway- not surprised aside from never understanding the oppressed who lick the boots of their overlords.\n\nHe was upset but I told him flat out, fuck that job. They also fired another senior manager at another location the same day as him. I told him they're on some corporate profit bullshit and he'll be better off. I make decent money and unemployment isn't terrible (50% of his salary). He used to be employed by the hospital but of course Aramark got the food service contract and I fully believe they just didn't want to pay him what the hospital was.\n\nFuck Aramark and their CEO who got a 2.5 million dollar bonus in 2022. Scumbag.\n\nSo he filed for unemployment the day it happened (about 3 weeks ago) and the case worker or whatever called him, he answered all of her questions and explained that he was fired unexpectedly, deferred to HR when he asked what the policy was and how no one in HR would return his calls. Aramark also hadn't replied to the unemployment office either so we just figured whatever. Obviously we're an at will state, blah blah blah.\n\nWell this morning he got a letter DENYING him unemployment. Which is absolutely mind boggling to me. That was a hit I was not emotionally prepared for. Silly me I guess. So now we have no choice but to go through the lengthy appeal process and hope he can find another job with equal pay sooner rather than later.\n\nFuck Aramark. Fuck Bootlickers.\n\nI had more to say... grossly inflated wealth gap within my own job, no one caring about my department because we're good at our jobs so we don't \"create a need\" for development options while they create fancy Senior titles for upper management out of thin air.. Watching middle management get their bonuses and raises based off of our hard work instead because we make them look good. Not getting my Republican, Boomer, internalized-misogynistic coworkers to realize it. Watching them throw money at the C-Suite and promoting directors and VPs left and right to \"retain talent\" but fuck us hourly corporate peons I guess.\n\nOr how my son is suffering in the 4th grade... and I want to be so mad at his teacher, but also knowing she has more kids in her class than years on this earth... gets zero support from other parents with their hellion kids (probably because they're too busy working to death to have time to actually parent their kids) and is also probably under strict rules from the school district so they don't lose the only funding they get... all while not being paid shit.\n\nI could go on and on because the systemic bullshit is just hitting me all at once today and I'm so tired of it. I'm so tired I can't even verbalize all the ways this affects my family, not to mention so many other families who are worse off than mine. I'm so tired and I see no end to it. I have no answers or solutions.\n\nStay strong out there friends.",
    "title": "Corporate BS is destroying my soul today.",
    "subreddit": "WorkReform",
    "timestamp": 1676597880,
    "score": 21,
    "keyword": "brown director"
  },
  {
    "text": "When husbands are victims of marital abuse  \n\nFor professional golfer Lucas Glover, abuse included being verbally attacked by his wife, Krista, for not proceeding to the next round of a golf tournament. Following a 2018 altercation involving Glover and his mother, Krista was arrested and charged with domestic battery. Glover admitted in the police report that this wasn’t a rare occurrence and that his wife would often say things like “You’re such a loser” or “You better win or the kids and I will leave you and you will never see us again.”\n\nCollege professor Dr. Timothy Golden shares in a 2016 TEDx talk1 that his ex-wife repeatedly criticized and degraded him because of his body weight. He says she would constantly remark on how attractive other men were compared with him and eventually declared celibacy until he “made himself more attractive.”\n\nRon Mattocks, a former army officer and senior business executive, revealed that his now ex-wife tried to convince him that his anger was the problem in their marriage even though he had no history of anger issues. As he writes2 in “When Men Are Victims of Abuse,” she convinced him that his parents were abusive and to cut ties with them. She often called him a “14-year-old boy trying to get laid” and asked him when he’d ever be a man. She regularly made him endure “several hours of passive-aggressive silence before being forced to talk things out.” His offenses? Hanging pictures up too high, making the bed the wrong way or folding T-shirts poorly. This constant barrage on his person and isolation from everyone else led him to the brink of suicide.\n\nThe National Domestic Violence Hotline in the U.S. defines abuse as “a pattern of behaviours used by one partner to maintain power and control over another partner in an intimate relationship.” By this definition, abuse knows no gender and is a weapon effectively wielded by women as well as men. Nonetheless, society often expects men to endure torment without so much as batting an eye. “Be a man” is shorthand for, “Toughen up. Don’t be a wimp or a loser.” This means army officers, business executives, professional athletes, college professors and many other men often silently endure abuse at the hands of their wives – because to speak up would show weakness.\n\n## Living with an abusive wife\n\nMen can experience abuse in all its forms – even physical abuse. According to the Centers for Disease Control and Prevention, “One in seven men report having experienced severe physical violence from an intimate partner in their lifetime.” The National Domestic Violence Hotline reports that 13 per cent of their documented contact comes from male victims. One meta-analysis concluded that abusive “women are slightly more likely than men to use one or more acts of physical aggression and to use such acts more frequently,” while men are more likely to cause injury. Although “intimate partner” statistics are broader than the context of the biblical definition of marriage, these studies indicate that men experience abuse too.\n\nMen can also experience sexual abuse from their wives. A sexually abusive wife may push her husband into sexual situations against his will, such as being recorded or including other partners in their sex life. Sometimes sexual abuse comes in the form of unwanted touch.\n\nAnother type of sexual abuse husbands may experience is called Made to Penetrate, defined by the CDC as sexual violence when a victim is “made to, or there was an attempt to make them, sexually penetrate someone without consent as a result of physical force or when the victim is unable to consent due to being too drunk, high or drugged, (e.g., incapacitation, lack of consciousness, or lack of awareness) from their voluntary or involuntary use of alcohol or drugs.”\n\nPsychological (emotional) abuse is cited by one study3 as likely to be “the most pervasive form of relationship maltreatment.” According to the research in this study, 8.3 per cent of men report experiencing emotional abuse in their relationships. The researchers define emotional abuse as abuse that can include “verbal assault, dominance, control, isolation, ridicule or the use of intimate knowledge for degradation.” Verbal assault can manifest as intimidation (“You better win or I’ll leave you”), aggression (cursing, etc.), humiliation (“When will you ever be a man?”) or even silent treatment. Other characteristics of verbal abuse are blaming, criticism, gaslighting and judging.\n\nTim Sanford, Clinical Director for Counselling Services at Focus on the Family in the U.S., agrees that the research matches his counselling experience. “With \\[abusive\\] women, I don’t think you see as much of that huge explosiveness,” he says. “It’s more of this purposeful pick, pick, pick.” He compares the difference between a single abusive event and constant abuse as the difference between being chomped once by a T. rex or a million times by piranhas. Sanford’s conclusion? “Either way you end up dead. So, either way, it’s abusive.”\n\n## Why men stay with an abusive wife\n\nWhy would a husband put up with this kind of treatment? Counsellors who work with abused men say there are multiple reasons.\n\n### Fear of losing status\n\nIf a man’s wife is abusive, he may hide it because he doesn’t want to deal with the social fallout of admitting he’s been hurt – especially by a woman. Speaking up about the abuse can cost him the respect of his co-workers or church community. Admitting abuse might feel like admitting to being a victim. In many men’s minds, victims are weak and weakness is not considered a characteristic of manhood. To avoid the loss of “manly” status in society, many husbands choose to continue to suffer.\n\n### Fear of not being believed\n\nAs many women in abusive relationships do, men may wonder who will believe them if they speak up. Societal images of abuse usually portray men as the aggressor. It’s difficult for many to see a man as a victim in his relationship – especially if he’s physically bigger than his spouse. Golden, the professor who shares his emotional abuse story on the TEDx stage1, shared in a separate interview that he recalls calling more than eight different sources for help and none of them had any resources for men. He said one therapist, while laughing, told him that men don’t get abused.\n\nThis perspective is only amplified by the media. Men are fair game for slaps, punches and crotch-kicks. Sanford points out that violence against men in the media is played for laughs. “It’s laughable if the woman hits the guy; it’s a joke. But if a guy hits the wife . . . call 911. And so, there is a double standard there.”\n\nHusbands in media are also fair game for ridicule. Many TV shows portray making fun of the husband or calling him names as normal behaviour. Wendy Brown, registered marriage and family therapist, says she sees this in her office, as well. “I get couples who come in and the husband will say, ‘She calls me all of these horribly demeaning names. She curses at me.’” Yet Brown says that this behaviour is *not* normal or healthy. “To me that’s kind of crossing that line. Then it’s not just nagging you about ‘let’s work on the relationship or clean out the garage’ or whatever it is, it becomes an attack on your \\[the husband’s\\] character, your identity.”\n\n### Fear of being named the aggressor\n\nBrown points out that husbands in abusive relationships fear being accused of being the abusers if they protect themselves from their wife’s attacks. “There’s that fear of, if I grab her and hold her, then I’m accused of hurting her.”\n\nIt’s not unheard of for an abusive wife to call or threaten to call the authorities and report her husband as the abuser. Lucas Glover’s wife called 911 and reported that he and his mother had attacked her, but the police were able to assess the situation and arrested her instead.\n\n### Desire to remain married\n\nBrown says that many husbands in abusive relationships love their wives and want to maintain their relationship. They want her to be seen as the wonderful person that people think she is, so they don’t report the abuse or tell anyone. Sanford adds that in some cases where there is a history of previous trauma, husbands may hold on to the relationship because it’s less painful than being alone.\n\n### Fear of losing access to children\n\nStatistics from the U.S. Census Bureau show that fathers make up only 19.6 per cent of parents with full custody of their children. There is an upward trend, but historically it’s been more difficult for men to gain full custody of their children. Registered marriage and family therapist Glenn Lutjens points out that many husbands with an abusive wife stay because they believe their children will be safer or they fear they will lose access to them. Abusive wives may use the threat of cutting off the father’s contact with his children as leverage to keep their victim silent.\n\n### Misapplication of Scripture\n\nAmong Christians, the Bible can be misused to excuse abusive behaviour. Lutjens some people have a “spiritualizing tendency to misunderstand or misinterpret Scripture.” For example, in Matthew 5:39 Jesus advises his listeners, “Do not resist the one who is evil. But if anyone slaps you on the right cheek, turn to him the other also.” Lutjens explains that this passage can be misinterpreted to mean accepting abusive behaviour from your spouse but he emphasizes that, in context, that is not what Jesus is talking about.\n\nBecause of false Bible teaching, Sanford says some husbands can feel pressure to have a perfect household. He says husbands may be told, “If the marriage falls or breaks or makes it it’s on him because he’s the head of the house.” This can lead to a desire to tough it out even when a situation turns abusive. “All that teaching, he can just take that as ‘I guess that’s what I have to do. This is just my cross to bear,” says Sanford. But abuse is not God’s design for marriage. While every marriage has its trials, counsellors advise husbands in an abusive relationship to seek help.\n\n### Disconnection from emotions\n\nGolden speaks about his socialization as a man to “ignore how you feel, even when it hurts.” He cites this as a useful tool on the football field but a much more harmful mentality in real life.\n\nThe National Domestic Violence Hotline corroborates his experience by reporting that many men do not report or seek help for their abuse because, “Men are socialized not to express their feelings or see themselves as victims.” Brown adds that this suppression of emotions can lead men to have an internal disconnect between the things that are said or done to them and the emotional impact of those words and actions. Men who experience this disconnection between actions and their emotional impact may be unable to name the harm inflicted on them by their abusive wife. Coupled with the societal expectations of men to be strong, this makes it almost impossible for a man to see himself as a victim of abuse.\n\n## Effects of abuse\n\nDomestic abuse has a life-draining effect on the victim, both physically and mentally.\n\nCommon effects of abuse on the victim are:\n\n* Depression\n* Harmful coping strategies such as workaholism or substance abuse\n* High blood pressure\n* Loss of confidence\n* Insomnia\n* Physical injuries; e.g., broken bones\n* Low self-worth\n* PTSD\n* Suicidal thoughts\n\n## How to get help\n\nWhile marriage remains the best and safest context in which men, women and children thrive, it’s important to recognize when things go awry and abuse of anyone, including men, occurs. Maybe you’re wondering if you’re in an abusive relationship and aren’t sure what to do. Consider taking these simple steps to help gain clarity on your situation.\n\n### Name what’s happening\n\nSanford recommends writing down “what is really happening to you in the course of a week or a month.” He also suggests keeping track of the frequency. Is this happening twice a month, twice in 10 minutes or every 10 minutes?\n\nFor example,\n\n* She threw her cell phone at my head.\n* She cussed me out for not loading the dishwasher correctly.\n* She read my text messages to make sure I didn’t say anything that would make her look bad.\n\n### Name the emotional impact of your wife’s actions\n\nHow are your wife’s actions affecting your internal state? Do you feel powerless? Ashamed? Scared? Isolated? Rejected? Lutjens says that understanding the emotional impact of your wife’s actions is a crucial step in determining if you’re experiencing abuse. “If it’s just about what’s taking place and you’re not exploring, ‘OK, what’s my emotion in this?’ it’s just a factual account,” he says. It’s easy to brush off a list of offences as “not a big deal” or “not anything to whine about,” but Lutjens stresses the importance of exploring the emotional impact of those actions. Remind yourself that your feelings matter in your marriage. Ask yourself without judgment or condemnation, *How does this make me feel?* or *What am I feeling in this moment?*\n\nA feelings wheel is an effective tool to help you name your emotions. Remember that while we all hurt our spouses sometimes, abuse is *a pattern* of harmful behaviour used to control and manipulate. If your wife is purposefully and habitually causing you physical or emotional harm, you need to address the issue.\n\n### Speak up\n\nLutjens advises that the only way to experience a change in your relationship is to speak up about what’s not working. “There are so many things that stay as secrets,” he says. “That’s when they fester. They just stay the same. They don’t change.”\n\nFind a safe space to give voice to what you’re experiencing. A trusted friend, family member or church leader may be a good place to start. Lutjens suggests speaking to a good Christian counsellor: “Counselling is the opportunity to give voice to what your experiences are and to know what you feel.” Focus on the Family Canada offers a [free one-time phone counselling consultation](https://www.focusonthefamily.ca/get-help/counselling) which is a first step toward that process. It may seem difficult to find the right person to share with, but pray that God will guide you to someone who is empathetic and wise.\n\n### Plan\n\nFormulate a strategy to bring you and your children to safety. Healing for you and your spouse may require a time of separation. A [healing separation](https://www.focusonthefamily.ca/content/why-and-how-to-pursue-a-healing-separation) is time to evaluate and change dysfunctional patterns and behaviours in your marriage. (If you feel you’re in imminent danger, call 911 or find a full list of helplines and shelters across Canada at [**EndingViolenceCanada.org**](https://endingviolencecanada.org/Getting-Help/).) You may need to seek support from family, friends or your church community.\n\nWhile many domestic abuse resources cater to women, there are a growing number of organizations with resources for men in abusive relationships. [Focus on the Family Canada offers a free, one-time phone counselling consultation](https://www.focusonthefamily.ca/get-help/counselling) and can connect you with a counsellor in your area. Additionally, here are some places and resources (not faith-based) that can provide help:\n\n[Canadian Centre for Men and Families](https://menandfamilies.org/canada-trauma/)\n\n[HeadsUpGuys](https://headsupguys.org/help-male-victims-domestic-abuse-violence/)\n\n[Male Survivors of Intimate Partner Violence in Canada study](https://www.victimsfirst.gc.ca/res/cor/ipv-ipv/Male%20Survivors%20of%20IPV%20in%20Canada,%202020.pdf)\n\n### Lean on God\n\nIn Psalm 27:1 David clings to God as his “light and salvation.” He asks, “Whom shall I fear?” Sometimes fear can keep us from experiencing God’s salvation and deliverance, but the Bible says God is our refuge and “very present help” in times of trouble (Psalm 46:1). If you’re in an abusive relationship, draw from the Lord’s strength. Seek godly counsel to help bring you out of the darkness of an abusive relationship and into the light of health and wholeness\n\n## How to help an abuse victim\n\nIf a man talks to you about his abusive wife, affirm his openness and courage in speaking up about the abuse. Counsellors say it’s important to validate the fact that harmful behaviour is taking place and acknowledge its impact. One of the key reasons men don’t speak up is a fear that they won’t be believed or that they will be ridiculed. Provide a safe and non-judgmental space for them to share and process their experience.\n\nUse statements such as, “It makes perfect sense that you feel devalued by that” or “It’s not OK for her to hit you.”\n\nYou may also ask clarifying questions to help the victim connect the harmful behaviour to their emotions. Ask questions such as, “What was that like for you when . . . ?” or “How did that make you feel when . . . ?”\n\nAs the professor who shared his story of abuse in a TEDx talk1 says, it’s important for men and the people around them to be aware of abuse against men. Golden was able to start his journey to healing when he finally found a men’s group at a small church where he could share his feelings. He discovered he “was far from being the only one who experienced what he had been experiencing for so long.” He ends his talk with this call to action, “I hope that as a result of something I’ve said tonight someone, some man, somewhere, somehow, some way will cease to suffer in silence because someone has listened in a way that has allowed them to be touched by the story . . . the story of the men, or man in your life.”\n\n[https://www.focusonthefamily.ca/content/when-husbands-are-victims-of-marital-abuse](https://www.focusonthefamily.ca/content/when-husbands-are-victims-of-marital-abuse)",
    "title": "When husbands are victims of marital abuse",
    "subreddit": "MensRights",
    "timestamp": 1688087845,
    "score": 27,
    "keyword": "brown director"
  },
  {
    "text": "Mistreatment of women in my country  \n\nHello girls, I'm Moroccan and I just want to let my thoughts about because I'm frustrated, I have observed that a significant number of Moroccan Muslim( my default assumption) men, and men from other Muslim-majority countries like Egypt and Algeria, treat women unfairly and disrespectfully. Some women also exhibit this behavior, but it is unclear what else these individuals have in common other than the religion, I'm trying to understand what is the common ground that they share. although it mostly has nothing to do with what Islam preaches. For instance, I have come across a Facebook group with over 200K members that refers to women in derogatory terms such as \" lmra hashak\" which is kind of hard to translate correctly but it means something along the lines of \" women are something disgusting, something you're sorry to see\" because the term \" hashak\" is mostly used while talking about donkeys or dogs  ,and \" 9hwya\" which literally means \" the brown girl\" but in a very offensive manner, obviously both racist and degrading because that's what their intention is while using it. Other Arabic groups share similar content, including pictures that are demeaning to women. Additionally, there was a post mentioning a national team competing in mathematics with only one girl and four boys, people left derogatory comments, calling women stupid. because there aren't more girls there, and because in my country it's known that girls mostly get higher grades and pass more exams than men, such as exam to become a lawyer teacher etc., so when there is any post about any team that contains more men than women they immediately make everything girls did worthless,  And It happens with any post where there is anything about women sadly. I always check the comments hoping I'm wrong, just to be let down. They also do not acknowledge women's achievements throughout history or recognize the success of many women who did not get the recognition they deserved due to historical discrimination.\n\nIt is disheartening to see that many individuals in these communities blame the victim in rape cases and even defend pedophilia. In my high school, I witnessed four teachers who slept with 13-15-year-old girls or even younger. I want to understand why such mistreatment of women is prevalent in these societies and why some individuals think it is acceptable. I had hoped that in other environments such as university, things would be better, but unfortunately, I was once again disappointed. Even my professors speak about women in a derogatory manner, giving examples of them being stupid, crazy, and so on, even when the material they're teaching is unrelated to such topics. When they ask my mostly male classmates if they agree, they laugh and make even more offensive remarks. Some even go as far as to suggest that they would do worse things themselves.\n\nI once even tried to stop the professor and all he did was telling me \"you'll understand why men are better when you get married\". \n\nI just want to know if it's okay for me to have hatred for men in my country, and all the ones with similar mentality, or am I wrong? because I don't know why even the girls agree with them, if there is a rape case, it's women's fault, if there's assault case, it's women's fault. etc.\n\nThere is also a whole group that has the hashtag \"#NoToMarryingWorkingWomen\" where they say they won't marry any woman who works, because she gets exploited by her director and she isn't only his, but his and the director's too, and that they don't cook, and won't find time to take care of the children and him, and because she will start to go out with friends etc.\n\nAnd the list goes on obviously. \n\nI just don't get the hatred, is this also this common in your countries?\n\n Examples of such posts that they share, I provided translation :\n\n[https://ibb.co/c8Rn9ZM](https://ibb.co/c8Rn9ZM) \\- this photo was taken from a video where a girl was walking with a skirt and some man lifted her skirt and obviously sexually harassed her and slapped her bottom. they call him king for doing so. and when this happen most men were saying the girl deserved it for going out like that.\n\n[https://ibb.co/wQwzDm3](https://ibb.co/wQwzDm3) : insulting an inventor, and the comments kept saying she didn't help them make WIFI, she just opened her legs.\n\n> [https://ibb.co/jwM9Cjh](https://ibb.co/jwM9Cjh) : as for this one, the post says \" does women deserve to and the answers are \" she does \" \"she doesn't\" and everyone picked she doesn't, meaning they stopped at \" she doesn't deserve \" referring to she doesn't deserve anything. \"",
    "title": "Mistreatment of women in my country",
    "subreddit": "Feminism",
    "timestamp": 1683878025,
    "score": 549,
    "keyword": "brown director"
  }
]