[
  {
    "text": "Life with Fibroids, a gross story *again story not for those who get faint at the sight of blood.*\n\n\n\n\nI know I have an important meeting today with one of my new directors so I go to the Bathroom. Everything checks out  par was changed at lunch and relatively clean, the mooncup could be drained... But I really don't want to go through that hassle... I'll do it after the meeting when there aren't other girls in the bathroom. I decided to roll up a bunch of toilet paper as backup and went on my merry way to my meeting. \nNearing the end of the meeting I started cramping. I decided I would go to the bathroom again as soon as the meeting was out. I need to talk less, I went over on my meeting and the next meeting a training presentation. It was about that time I really started gushing... I needed to go now... But I could not move. I was doing everything I could to try and hold in the feeling so I could stand up. I finally was able to excuse myself and I went to get a new overnight maxi. I started walking to the bathroom calmly at first. Then my hand brushed my butt, wetness, I started walking faster. Through the mantrap, across a hall in a sea of cubicles, in front of the break room finally to the bathroom. I was confident that my strategicly chosen black pants were shielding me. \n\nAgain warning it's gross.\n\nWhen I went to change I found soaked panties almost no dry cloth left, silent tears started falling. I need to get that damn surgery, no I needed to change my pad, see if my massive leak is visible, get my stuff and run like the wind home to change. I stopped crying and started cleaning. I was still excited that I was wearing black pants. When I left the stall  I walked past coworkers and tried to hurry and wash my face. I was fortunate no one talked to me. I turned around to see a redish brown, it was pretty much glowing... :'( I couldn't hold back the tears anymore. I just didn't know what to do at this point. I was fucked, there was no way I could leave this room. There was nothing I could do and it wasn't stopping. I called my coworker to bring my stuff to the bathroom. Luckily she brought another one of my friends to help. I just sobbed, I let them know what happened. It was then I realized I probably soiled the chair and that we needed to get it before someone sat in it. Then I realized that the presentation I left suddenly was being recorded... That is right... Fucking recorded. I put on my backpack lowered it to cover my butt walk with my coworker who followed behind me. I am grateful for having her to talk to and she walked me all the way to my car. I gave her a hug and thanked her for helping me. It was time for my work day to end.",
    "title": "Life with Fibroids, a gross story",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1510236263,
    "score": 12,
    "keyword": "brown director"
  },
  {
    "text": "Christmas presents for supervisors Hi all, \n\nWas hoping to gain your input. MS3 here. We have about 5 students on our medicine clerkship and have a truly amazing clerkship director for 3 months incl Christmas (about 2/3 thru). He teaches us personally every day and never writes negatively about students that rotate with him. We really want to show our appreciation.\n\nWhat are the ethics pertaining to gifts for supervisors? Not trying to brown nose, but just to show our appreciation. The gift wouldn't have to be bought/expensive, maybe just making him something by hand. Thoughts?\n\nThanks for your advice.",
    "title": "Christmas presents for supervisors",
    "subreddit": "medicine",
    "timestamp": 1511713562,
    "score": 8,
    "keyword": "brown director"
  },
  {
    "text": "Colleague is moving to another district... and i am trying to move to the same district I'm in a situation that feels weird.\n\nA colleague of mine is moving to another district next year. They have worked as the director of my subject area the past few years, and they are moving to do that same job in another district. I have essentially worked as the assistant director to this person for a few years.\n\nTurns out that the district they are going to has an opening to work as the assistant director. I'm applying to it, and I would basically be working the same position I am now, with the same colleague.\n\nUnfortunately this just makes every interaction I have with my colleague extremely awkward. I feel like I'm treating them both as a colleague and as a job interview, and I can't figure out how to behave. It's extremely frustrating. I feel so fake around them; like I'm sucking up and brown nosing to make them like me. Not to mention that my colleague apparently has a lot of weight in the selection process, so I'm freaking out because I don't think I did a very good job as their assistant the past few years.\n\nI guess my question is... is there a right way to handle this situation? Or should I just accept that it's probably just going to be awkward? Sorry for the rambling.",
    "title": "Colleague is moving to another district... and i am trying to move to the same district",
    "subreddit": "Teachers",
    "timestamp": 1490915542,
    "score": 2,
    "keyword": "brown director"
  },
  {
    "text": "Enrollments, budgets fall short at universities known for ‘social justice warfare’  more people are getting the message. not attending these indoctrination centres is more effective. less students less revenue.\n............................................\n\nhttp://www.washingtontimes.com/news/2017/sep/14/enrollment-drops-at-schools-known-for-social-justi/\n\nUniversities known for being hotbeds of campus protest and liberal activism are struggling with declining enrollments and budget shortfalls, and higher education analysts say that’s no coincidence.\nTake Oberlin College. According to a document leaked to The Oberlin Review, the school’s student newspaper, the small liberal arts college famous for social justice hoaxes has had trouble attracting and retaining students, missing this year’s enrollment mark by 80 and racking up a $5 million budget deficit in the process.\nWilliam A. Jacobson, a professor at Cornell Law School who runs the Legal Insurrection blog, said the “most obvious culprit” in Oberlin’s dwindling admissions is “relentless social justice warfare.”\n\n“Social justice warfare at Oberlin has been more intense and sustained over a longer period of time than at most schools, and has come to define Oberlin in the media,” Mr. Jacobson said. “The resulting mockery and derision, even in liberal publications, has damaged the Oberlin brand.”\nSurveys support the notion that, in the era of Trump, conservatives have become more skeptical about the value of a college degree.\nThe polarizing presidential election was felt in the dip in applicants at some top-tier colleges such as Ohio’s Kenyon College.\n\n“This is a year in which you were vulnerable if you were a small liberal arts college in a rural red state and you attract a significant portion of your student body from the East Coast or West Coast, which would certainly be the case with Kenyon,” Diane Anci, Kenyon’s vice president of enrollment and dean of admissions and financial aid, told the Ohio school’s Kenyon Collegian newspaper.\nA study published by the Washington-based Pew Research Center in July found that just 36 percent of Republicans believe colleges and universities have a positive effect on the country, down from 54 percent two years ago.\nGallup released a poll in August that found just 33 percent of Republican and Republican-leaning respondents had a “great deal or quite a lot of confidence in higher education.” Sixty-seven percent said they have “some or very little” confidence in academia.\nHigh school counselors report that, in the past few years, parents have been more likely to express concern about sending their children to schools with progressive reputations.\n“Many won’t consider Oberlin or Wesleyan, and Brown is completely off the table,” one counselor told Inside Higher Education in June.\n\nThe problem may be especially pronounced among the nation’s heartland. Inside Higher Education reports that several prestigious, small liberal arts colleges in the Midwest have missed their enrollment marks this year.\nSome college administrators have taken notice. According to Inside Higher Education’s annual survey, 52 percent of admissions directors from public colleges and 28 percent from private ones said they were stepping up their recruitment of students from rural areas in the wake of the presidential race.\nDeclining enrollments have previously been observed at colleges and universities that became notorious for chaotic campus activism, including the University of Missouri and Evergreen State College.\nBy some estimates, enrollment at the former is down 35 percent since fall 2015, when student protests helped launch the Black Lives Matter movement.\nMeanwhile, Evergreen faces a $2.1 million budget shortfall this year since students took over the campus last spring, barricading themselves in the library, berating administrators on a regular basis and forcing one dissenting professor to teach off campus out of fear for his safety.\nA spokesperson for Oberlin College did not respond to a request for comment from The Washington Times.\nThe school’s problems cannot be traced to a single incident but to several.\nIn February 2013, mass hysteria ensued after racist and anti-Semitic flyers and graffiti began to appear all over campus. Classes were canceled, meetings were held and students began to see racism around every corner, including when someone reported seeing a member of the Ku Klux Klan on campus. It turned out to be a woman walking around wrapped in a blanket to keep warm.\nNot only that, the perpetrators behind the racist paraphernalia turned out to be two progressive students, one of whom was confirmed to be an Obama supporter, trying to get a reaction out of their classmates and the administration.\nRather than admit the whole thing was a hoax and move on, the Oberlin administration doubled down on a social justice agenda, including the implementation of a privilege and oppression “reorientation” for first-year students.\nIn the ensuing years, Oberlin students would go on to make frequent demands of the university, ranging from the end of culturally appropriated meals at the dining hall, such as General Tso’s chicken and sushi, to the elimination of grades below a C.\nIn 2015, after the University of Missouri protests, the Oberlin Black Student Union issued a 14-page letter making 50 demands of the administration. They included exclusive “safe spaces” for black students and the elimination of graduation requirements for classes in Western civilization.\nLast November, Oberlin students targeted Gibson’s Bakery, a beloved store in Oberlin, Ohio, after an employee called police when he saw someone attempting to shoplift by concealing two bottles of wine under his jacket. The accused shoplifter turned out to be a black Oberlin student.\nThe Black Student Union, Oberlin Student Senate and College Democrats spearheaded a boycott of the bakery and organized protests outside of the store. Even the Oberlin administration, responding to calls from Black Lives Matter supporters on campus, stopped purchasing goods from the bakery.\nThree students involved in the incident ended up pleading guilty to attempted theft and aggravated trespassing. As part of a plea deal, the students acknowledged that the bakery’s actions were “not racially motivated” and that the store was “merely trying to prevent an underage sale.”\nMost of the enrollment deficit at Oberlin came from a smaller-than-expected freshman class, which totaled 742 instead of a projected 805.\nPeter Wood, president of the National Association of Scholars, said that drop-off is more serious than it may appear.\n“That doesn’t sound like an astonishing number of people not coming, but weighed on a percentage basis, that’s a huge drop in just one year,” Mr. Wood said. “And Oberlin has for some time been struggling to make its classes. This wasn’t just some negligence: ‘Oh, we didn’t realize that we had to try harder to get students.’ They’ve been trying really hard to get students, and students just aren’t coming.”\nHe said Oberlin can easily recoup the $5 million deficit by cutting the “apparatus of political correctness” that has swelled in the past several years. When that happens, he said, it will be a sign that the school is serious about reform.\n“The signal that I would look for is when they begin to divest from the large number of personnel who are employed wholly because of their political orientations,” he said. “When that happens, I think we will have seen a college that has decided to reposition itself in the market. Until then, it’s all just show.”",
    "title": "Enrollments, budgets fall short at universities known for ‘social justice warfare’",
    "subreddit": "MensRights",
    "timestamp": 1505503566,
    "score": 82,
    "keyword": "brown director"
  },
  {
    "text": "Til that in 2013 archeologists uncovered evidence of an ancient matriarchy in Peru; it was a \"brutal and ritualistic\" society that collapsed into civil war Jordan Peterson has suggested we may be entering a new era of female totalitarianism, which he describes as unique in history.   Apparently there was at least one other example:\n\n[The Mochica](https://www.yahoo.com/news/blogs/geekquinox/unearthed-peruvian-tomb-confirms-women-ruled-over-brutal-160013738.html?ref=gs)\n\n>This find makes it clear that women didn't just run rituals in this area but governed here and were queens of Mochica society,\" said project director Luis Jaime Castillo, according to the Associated Free Press.\n\n>\"It is the eighth priestess to be discovered,\" he added. \"Our excavations have only turned up tombs with women, never men.\"\n\nMen were apparently forced into ritual combat where the losing side was sacrificed.  \n\nThere was a fad in the 70s and 80's started by figures like Riane Einsler (\"The Chalice and the Blade\") suggesting that if women ran society we would live in peaceful utopias.   The ideology is discussed in [\"Sanctifying Misandry\"](http://www.mqup.ca/sanctifying-misandry-products-9780773538733.php) by Paul Nathanson and Katherine Young:\n\n\"To set the stage, the authors discuss two massively popular books - Dan Brown's The Da Vinci Code and Riane Eisler's The Chalice and the Blade - both of which rely on a feminist conspiracy theory of history. They then show how some goddess feminists and their academic supporters have turned what Christians know as the Fall of Man into the fall of men. In the beginning, according to three \"documentary\" films, our ancestors lived in an egalitarian paradise under the aegis of a benevolent great goddess. But men either rebelled or invaded, replacing the goddess with gods and establishing patriarchies that have oppressed women ever since. In the end, however, women will restore the goddess and therefore paradise as well. The book concludes with several case studies of modern goddess religion and its effects on mainstream religion.\"\n\nVariations of this theme can still be seen today in gender studies departments.  In Sweden they are even pushing for a \"feminist foreign policy\" that would stress diplomacy over war.   Apparently these ladies are unaware of the fact that [Queens initiated more wars than Kings](http://nymag.com/scienceofus/2016/01/european-queens-waged-more-wars-than-kings.html).  Or that men evolved [better making up skills](http://www.bbc.com/news/science-environment-36969103).  \n\nAnother feminist myth bites the dust.",
    "title": "Til that in 2013 archeologists uncovered evidence of an ancient matriarchy in Peru; it was a \"brutal and ritualistic\" society that collapsed into civil war",
    "subreddit": "MensRights",
    "timestamp": 1490132683,
    "score": 41,
    "keyword": "brown director"
  }
]