[
  {
    "text": "Consent should be taught in every school   \nI think that consent is CRITICAL for children's education. It is important because it allows them the courage to say no when others try to groom or assault them. Also, it is important because many children are assaulted and have no way to process that trauma as adults. It is estimated that 1 in 3 girls and 1 in 6 boys are assaulted, with the average age at the time of assault being 9. It will take a lot to end these atrocities, but I think that teaching consent is the first step. So I would like to start a letter writing campaign to representatives. To make it easy, I've posted a template for the letter below and a link to find your representative so you know who to email. Please help me change this! As of now only 9/50 states teach consent as part of sex education! This is unacceptable and we can make all the difference!!!\n\n  \n\n\n[Find your Representative here.](https://ziplook.house.gov/htbin/findrep_house?ZIP=)\n\n&#x200B;\n\nLetter Template:\n\nDear Representative \\_\\_\\_\\_\\_\\_\\_\\_\\_,\n\nI am writing because I believe that consent should be taught in schools in America. In a society where 1 in 3 girls and 1 in 6 boys  are sexually assaulted, something needs to be done. \\[1,2\\] The average age these children are affected is 9 years old. \\[3\\] The cost of this abuse is 23 billion dollars annually. \\[4\\]\n\nConsent is an important part of sex education, but it doesn’t need to be sexual in nature. There are age appropriate ways of presenting consent and teaching children that they have control over their own bodies, and they can say no if they do not want something. Helping children understand this and recognize warning signs will give them power over their body to mitigate grooming strategies from perpetrators and the tools to inform other adults about the abuse.\n\nPlease create federal mandates for ALL schools in the US to be required to teach age appropriate consent lessons to every grade K-12. Our current system is not enough.\n\nThank you for your time and consideration of this issue.\n\nSincerely,\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\nReferences:\n\n1. Dube, S.R., Anda, R.F., Whitfield, C.L., et al. (2005). Long-term consequences of childhood sexual abuse by gender of victim. American Journal of Preventive Medicine, 28, 430-438.\n2. Briere, J. & Elliot, D.M. (2003). Prevalence and psychological sequelae of self-reported childhood physical and sexual abuse in a general population sample of men and women. Child Abuse & Neglect, 27, 1205-1222.\n3. David Finkelhor, Kimberly J. Mitchell, and Janis Wolak, 2000, Online Victimization: A Report on the Nation’s Youth, National Center for Missing & Exploited Children: Arlington, VA. Darkness 2 Light. Statistics Surrounding Child Sexual Abuse.\n4. T. R. Miller, M. A. Cohen, B. Wiersema, Victim costs and consequences: A new look. (US Department of Justice, Washington, DC., 1996).\n5. Holmes, W.C., & Slap, G.B. (1998). Sexual abuse of boys: Definition, prevalence, correlates, sequelae, and management. Journal of the American Medical Association (JAMA), 280, 1855-1862.\n6. Lisak, D., Hopper, J. & Song, P. (1996). Factors in the cycle of violence: Gender rigidity and emotional constriction. Journal of Traumatic Stress, 9, 721-743.\n7. Finkelhor, D., Hotaling, G., Lewis, I. A., & Smith, C. (1990). Sexual abuse in a national survey of adult men and women: Prevalence, characteristics, and risk factors. Child Abuse & Neglect, 14, 19-28.\n8. Holmes, G.R., Offen, L., & Waller, G. (1997). See no evil, hear no evil, speak no evil: Why do relatively few male victims of childhood sexual abuse receive help for abuse-related issues in adulthood? Clinical Psychology Review, 17, 69-88.\n9. Widom, C.S. & Morris, S. (1997). Accuracy of adult recollections of childhood victimization part 2. Childhood sexual abuse. Psychological Assessment, 9, 34-46.\n10. Widom (1999). Posttraumatic stress disorder in abused and neglected children grown up. American Journal of Psychiatry, 156, 1223-1229.\n11. Felitti, V.J., Anda, R.F., Nordenberg, D., Williamson, D.F., Spitz, A.M., et al. (1998). Relationship of childhood abuse and household dysfunction to many of the leading causes of death in adults. American Journal of Preventive Medicine, 14, 245-258.\n12. Lisak, D. & Luster, L. (1994). Educational, occupational and relationship histories of men who were sexually and/or physically abused as children. Journal of Traumatic Stress, 7, 507-523.\n13. Dube, S.R., Anda, R.F., Whitfield, C.L., et al. (2005). Long-term consequences of childhood sexual abuse by gender of victim. American Journal of Preventive Medicine, 28, 430-438.\n14. Briere, J. & Elliot, D.M. (2003). Prevalence and psychological sequelae of self-reported childhood physical and sexual abuse in a general population sample of men and women. Child Abuse & Neglect, 27, 1205-1222.\n15. Arata, C. (2002) Child Sexual Abuse and Sexual Revictimization. Clinical Psychology, 9: 135-164.\n16. Hopper, J. (1998). Child Sexual Abuse: Statistics, Research, Resources. Boston, MA Boston University School of Medicine. Child Sexual Abuse: A Mental Health Issue. Kentucky Division of Child Abuse and Domestic Violence\n17. American Academy of Pediatrics, Preventing Sexual Violence, An Educational Toolkit for Health Care Professionals, The Facts about Sexual Violence, [https://www2.aap.org/pubserv/PSVpreview/pages/factsheet.html](https://www2.aap.org/pubserv/PSVpreview/pages/factsheet.html)\n18. Hanson, R. F., Resnick, H. S., Saunders, B. E., Kilpatrick, D. G., & Best, C. (1999). Factors related to the reporting of childhood rape. Child Abuse and Neglect, 23, 559–569. doi:10.1016/S0145-2134(99)00028-9. [http://www.nsvrc.org/sites/default/files/publications\\_nsvrc\\_factsheet\\_media-packet\\_statistics-about-sexual-violence\\_0.pdf](http://www.nsvrc.org/sites/default/files/publications_nsvrc_factsheet_media-packet_statistics-about-sexual-violence_0.pdf)\n19. David Finkelhor, Director of the Crimes Against Children Research Center. [https://www.victimsofcrime.org/media/reporting-on-child-sexual-abuse/child-sexual-abuse-statistics](https://www.victimsofcrime.org/media/reporting-on-child-sexual-abuse/child-sexual-abuse-statistics)\n20. National Center for Victims of Crime and Crime Victims Research and Treatment Center, 1992\n21. US Department of Justice Sex Offense and Offenders Study. 1997.\n22. Sobsey, D. (1994). Violence and abuse in the lives of people with disabilities: The end of silent acceptance? Baltimore: Paul H. Brooks. [http://aspires-relationships.com/the\\_invisible\\_victims.pdf](http://aspires-relationships.com/the_invisible_victims.pdf)\n23. U.S. Department of Health and Human Services. Administration for Children and Families, Child Maltreatment, 1995.\n24. Simpson, C., Odor, R., & Masho, S. (2004 August). Childhood Sexual Assault Victimization in Virginia. Center for Injury & Violence Prevention. Virginia Department of Health, Snyder, H N. (2000). Sexual assault of young children as reported to law enforcement: Victim, incident, and offender characteristics. National Center for Juvenile Justice, U.S. Department of Justice.\n25. U.S. Department of Justice, Office of Justice Programs, Sexual Assault of Young Children as Reported to Law Enforcement: Victim, Incident, and Offender Characteristics, by Howard N. Snyder, Ph.D., National Center for Juvenile Justice, July 2000, NCJ 182990, [http://www.bjs.gov/content/pub/pdf/saycrle.pdf](http://www.bjs.gov/content/pub/pdf/saycrle.pdf)\n26. The Alan Guttmacher Institute. 1994. Sex and American Teenagers.\n27. Hanson, R.F., Resnick, H.S., Saunders, B.E., Kilpatrick, D.G., & Best, C. (1999). Factors Relating to the Reporting of Childhood Sexual Assault. Child Abuse and Neglect, (23) 559-569; FBI Law Enforcement Bulletin\n28. David Finkelhor and Gerald Hotaling, Sexual Abuse in a National Survey of Adult Men and Women: Prevalence, Characteristics, and Risk Factors, Child Abuse and Neglect (1990), 14, 19-28.\n29. Finkelhor D, Browne A. The traumatic impact of child sexual abuse: A Conceptualization. J Orthopsychiat. 1985;55:530–541.\n30. Browne, A., & Finkelhor, D. (1986), Impact of child sexual abuse: A review of the research. Psychological Bulletin, 99, 66-77.\n31. Merrill, L.L., Newell, C.E., Gold, S.R., and Millen, J.S. Childhood Abuse and Sexual Revictimization in a Female Navy Recruit Sample. Naval Health Research Center, Pub. 97-5, 1997. [http://www.dtic.mil/dtic/tr/fulltext/u2/a331433.pdf](http://www.dtic.mil/dtic/tr/fulltext/u2/a331433.pdf)\n32. Larry K. Brown, M.D., et al, American Journal of Psychiatry 2000;157:1413-1415.\n33. Jennifer Brownell, Director of the local CAC, Finger Lakes Child Abuse Response Team [http://www.waynepost.com/article/20150802/NEWS/150809976a](http://www.waynepost.com/article/20150802/NEWS/150809976a)",
    "title": "Consent should be taught in every school",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1614555991,
    "score": 110,
    "keyword": "brown director"
  },
  {
    "text": "My Personal Perspective of Big 4 Audit (UK) upon leaving after 5 years.   \n\nLast Thursday was my final day in Big 4 audit (UK). Whilst working my notice period I've had the opportunity to reflect on my time in the profession over the past few years. I thought it would be useful to write these down on the off-chance it could help provide some balanced perspective about Big 4 audit and give some honest feedback about my experiences.\n\n**Some background about me:** I joined over five years ago as a graduate, having studied accountancy and finance for my undergraduate degree at university. I spent the first 3 years as a trainee, working on audits whilst simultaneously sitting my professional exams, of which I  fully qualified as chartered in 2019. Over the past couple of years I have moved onto the role of senior, which has meant field managing on some larger engagements and acting as engagement manager on some of the smaller clients.\n\nA lot of my graduate intake left after 3 years, either to other client-facing roles internally, or externally into industry, doing a variety of jobs such as financial reporting, internal audit and management accounting/decision support. My decision to stay another two years post-qualification goes slightly against the norm here in the UK, but this was driven primarily by combination of a lack of knowing what I wanted my next move to be and wanting to still leverage the development and progression opportunities within Big 4 that would allow my next career move to potentially be a notch or two higher up the ladder at the exit stage.\n\nFirstly, to give some balance, here are what I consider to be the pros and cons of working in Big 4 audit based on my experience:\n\n***Pros:***\n\n* **It's a priceless addition to your resume/CV**. My experience with job applications and speaking to peers is that having big 4 in your employment history is at times already like having like one foot in the door for your next career move, particularly if you are moving to a big company. In the UK I know of some FTSE companies that hire predominantly from Big 4, some even exclusively too. There is seemingly still a bit of prestige about working at Big 4 therefore in the marketplace.\n* **The staff**. Cliché, I know, but I've worked with some of the most intelligent, friendly and helpful people during my five years. If you ever come across anything troublesome, whether that be a difficult client conversation, or something highly technical in terms of accounting, there is always someone within the company you can leverage for advice or help dealing with it. I was lucky enough to be assigned to engagements that had staff that were genuinely pleasant to work with alongside you in the audit room through the thick of it. Appreciate this won't be everyone's experience, but there is definitely an element of camaraderie of *\"we're in this together*\" that helps you get through the stressful times and long hours.\n* **Development and promotions**: It's tough going, but being thrown into the deep-end for a lot of it means that you do learn very fast and during your first few years, it's normal to be promoted every 12 months and improve your salary each time. Graduate salaries in the UK at Big 4 are typically quite modest, but within 3-4 years they pretty much double from what you started on.  I was also quite a shy and introverted person when I joined, and Big 4 has worked wonders on my soft skills and confidence. I can now comfortably hold difficult conversations with experienced senior management clients, carry out presentations to audit committees and facilitate training courses to an audience, all of which would have been terrifying to me a few years ago.\n* **Social**: Offices tend to be filled with quite like-minded people and are typically quite young too. This means that there is usually ample opportunity to attend social events, both official and unofficial. You get to attend team dinners, after work drinks where money is put aside behind the bar etc. \n* **Job stability**: audit staff turnover is significantly high and retention is a real issue at Big 4. As such, unless you do something completely inappropriate or commit serious misconduct, it's actually \\`very difficult to be fired or made redundant as an auditor.\n* **Opportunities to move elsewhere within Big 4:** Once you're in the door, if audit isn't for you, there is the ability to utilise the global nature and scale of the company you're in by transferring to another department or even another country. \n\n***Cons******:***\n\n* **Hours**. I've experienced necessary unpaid overtime at all grades during my time at Big 4. Busy season has also gradually extended beyond the classic Jan-March as you go up the chain and laterally for me has now reached the point where it's busy September-May. That's a significant amount of time and burnout is a real threat to all staff if expectations are not properly managed. Morale is generally quite low as a result which has gotten progressively worse over the years. It's just about manageable if you're busy period is confined just to a few weeks, but when there is a real lack of end in sight, it can become a struggle. It's also an awful environment if you have a young family. I've been in the office working late and overheard people saying goodnight to their kids over the phone because they've had to work late again. Fuck that.\n* **Difficulty in switching off**: Once you hit senior/field manager, it becomes very difficult to properly switch off during your time off. Unless there is an upcoming immediate deadline while you are away, handovers are not really a thing, and as a result you will be expected to pick things up as they were when you get back. Also there is a lack of cohesion on certain engagements between team members that mean some people will be forced to answer queries when they're on vacation/holiday because only you have the knowledge to answer it and nobody else has been involved with it. I purposely handed back my work phone so I could actually get around this and thereby making it physically impossible for me to respond, and forcing managers in the team to take on the responsibility for covering for me.\n* **Well-being**: this one particularly frustrates me given what a lot of people have been through during COVID. I think there is a genuine lack of understanding from senior management about the struggles of WFH that some people have, particularly those that either live alone, have inadequate working space/home offices, or even those that have joined the company and have only been working remotely since starting. A lot of partners and directors have young families, and are therefore blinded through ignorance about the struggles that some people often have because all they are personally experiencing themselves is getting to spend more time at home with their family, so anecdotally it therefore must be good for everyone else too. Also I truly believe that Big 4 are guilty of 'empty gesturing' - they will send firm-wide emails in relation to mental health, well-being and promoting staff to speak up if they are going through some struggles. Ultimately though, if you do speak up about it, sadly, there is actually very little that can be done to help the situation. There is so little flexibility in the business model or resourcing that allows things to be moved around. Everyone is busy and there is no slack. Moreover, I've also observed first hand people that have spoken up and then been passed over for promotion or had their career progression within the company stagnated. \n* **Stress**: I think a good proportion of the partners/directors have an attitude of \"as long as the work gets done, I don't care\" when it comes to staff well-being, stress and number of hours worked. My advice is if you're struggling with mental health as a result of this job, just look for another one - it really isn't worth trying to persevere through the struggles at the expense of your own health.\n* **Clients**: Don't get me wrong, some clients are very helpful and empathetic towards what we're trying to do. On the other hand though, a lot in my experience are incredibly frustrating. Combination of stubbornness, painfully slow response times (or straight-up ignoring) and sometimes even just being outright rude. You can be the most organised auditor and also be crystal clear with what you're requesting or asking of the client, but it can still be like pulling teeth at times. Client delays are the single biggest reason why some of my engagements have dragged on and been a mad rush at the end to complete. You are truly at their mercy but just don't take it personally because most of the time it isn't personal.\n* **Pay**: You can still live more comfortably than the average person in the UK, but relative to the hours you work and the baseline salary, you can probably get a higher paid job within accounting outside of audit quite easily. And without the same levels of stress too or number of hours.\n\n**Tips and general advice.**\n\nI also have some tips for seniors/field managers that may be useful for anyone moving into this role:\n\n* **Saying no**: It's ok to say no to additional work. If you have a lot on your plate and can't take on anymore, just be honest and say you can't do it. You don't want to get a reputation for being that person that is happy to pick up anything and everything going as you will just end up being a doormat for people around you to offload work to. All it does is sets an unsustainable expectation of you.\n* **Be nice to the EAs/PAs/secretaries**. They will save your bacon at some point when there is inevitably something that requires partner review or input at the last minute but their diary is typically full. It's definitely worth having them on your side.\n* **Find junior staff that you trust**. It will make your life so much easier if you can book the same people to your jobs that you know are competent and efficient, and will allow you to get on with your own work with minimal fuss.\n* **Don't forget your roots.** Remember what it was like to be junior staff. Treat them well and with respect. They should be your allies. The more coaching and patience you show, the more you will get out of them in the long-run. \n* **Make an effort to get yourself known to directors/partners**. I'm not obviously advocating anything like brown nosing etc. but a lot of opportunities in Big 4 come about because of who you know rather than what you know.\n* **Be forward thinking**. Look ahead at the calendar - consider what you need to hit the ground running an day 1 of fieldwork. Reach out the client and agree onsite days a couple of months in advance, send out deliverables lists out ahead, and make sure you have staff booked at the right grades and for the key dates in your audit plan.\n\n*TLDR;* It's a tough environment with long-hours and stress, but no regrets about working at Big 4 all considered personally. It's not for everyone though, and there is nothing wrong with that too.\n\nFor anyone still reading, thanks for taking the time to look over this. If there are any questions, feel free to respond below or drop me a DM and I can try to answer what I can.",
    "title": "My Personal Perspective of Big 4 Audit (UK) upon leaving after 5 years.",
    "subreddit": "Accounting",
    "timestamp": 1635258378,
    "score": 148,
    "keyword": "brown director"
  },
  {
    "text": "Director telling me to dye my hair back to black for a client meeting I'm still new to the firm and I’m gonna go to the first client meeting soon. And during a prep meeting, my director pointed out that my hair is too light-colored(which is light brown) and told me to dye it black since the client is “conservative”.\n\nNot sure how to take it. \n\nIs it rather a common thing since consulting is client-facing work?\n\nOr is it just a result of an outdated culture of certain offices?\n\nOr is it the manifestation of insecurity for the project?! (we don't have expertise so at least we need to look formal)\n\nAlso wanna know how to push back for those invasive comments :/",
    "title": "Director telling me to dye my hair back to black for a client meeting",
    "subreddit": "consulting",
    "timestamp": 1628527515,
    "score": 92,
    "keyword": "brown director"
  },
  {
    "text": "The Colorism in Media Needs to Stop. *Rant* I just saw this post in Twitter and I feel like most shows and movies nowadays is only showing mixed women or lightskin black women. The BIGGEST offender is Netflix in which all of their new stuff is just that. Brown and dark skin women aren't even being represented anymore. How is it that the 90's had better representation?\n\nIt's even more fucked up that these casting directors will cast someone lighter when the original character is canonically darker (the hate u give, raising dion, etc). Or even worse in the film, The Harder They Fall. Taking a real dark skin, black, plus sized woman and making her a young, biracial , skinny girl?? This isn't okay especially when there's so many actresses that could have played the part and that looks like Mary Fields.\n\nWe also need to hold the actresses accountable too. Why are you auditioning for roles that was meant for darkskin women? Its already hard for darkskin women to get roles but now you want to take roles that's not even meant for you? It's also very irritating that these actresses always make these statements of 'I understand my privilege...I know Colorism exist'. If you get all that, stop being complicit in the problem. The only lightskin actress I know that is actually trying to not be involved with stealing roles is Zendaya. \n\nhttps://twitter.com/chaoticblkgirl/status/1458258476443054094?s=21",
    "title": "The Colorism in Media Needs to Stop. *Rant*",
    "subreddit": "blackladies",
    "timestamp": 1636721100,
    "score": 211,
    "keyword": "brown director"
  },
  {
    "text": "Science Plus Violence Equals Silence: The Gender Church Equation This is an article taken from [a blog](https://lovists.com/2021/03/01/science-plus-violence-equals-silence-the-gender-church-equation/). It discusses and demonstrates with concrete examples and references, how feminism had moved from battering scientific research to controlling it, through censorship and violence. This does not concern only scientists, but rather this is presented to explain how society's understanding of problems that individuals face, and of the reasons and solutions for them, is distorted by a religion-like agenda that controls, well, what would be considered a fact, through its control over research. When we ask ourselves why there's no public discussion on issues that should have been regarded as universal rather than female issues, such as discrimination in education and work, inequality under the law, or violence and sexual violence, a considerable part of the reason is the control over facts. Enjoy the reading.\n\nIn 2016, a panel of brain researchers  convened at a scientific conference carrying the title “The Promise and  Peril of Research on Sex Differences”. In a discussion held on stage by  five researchers, three highlighted only similarities between the sexes,  until two female scientists intervened from the audience to explain  that avoidance of differences is anti-scientific, but more gravely –  neglects medical needs unique to women. The objection didn’t help. One  panelist called the study of differences “a waste of time”, thereby  ignoring a fact [pointed out by another investigator responding to a Newsweek journalist ](https://www.newsweek.com/brain-research-hindered-scientists-afraid-be-sexist-report-526304?amp=1)  – specific treatments such as for Alzheimer’s disease, affect women and  men differently, so studying differences is crucial for discovering  relevant therapies. Why were the scientists on stage so reluctant to  acknowledge sex differences? A comment made by a researcher at the end  of that day revealed the answer: his colleagues, he explained, are so  afraid of being accused of sexism that [they refuse to acknowledge or study any sex differences](https://slate.com/technology/2011/11/boys-brains-girls-brains-how-to-think-about-sex-differences-in-psychology.html). \n\n>*If deletion of publications is relatively rare, it is only because scholars do not dare to hypothesize*\n\nThis fear among both male and female  scientists is well-founded. One example of the atmosphere causing it was  observed in 2019, when a scientific paper about to be published, after  being accepted by two established journals, [was disqualified](https://www.the-scientist.com/news-opinion/a-retracted-paper-on-sex-differences-ignites-debate-64873/amp)  because of a protest by a feminist organization arguing that “the paper  might be damaging to the aspirations of impressionable young women.” [According to one report](https://fcpp.org/2019/01/23/feminists-assault-science/#_ftn3),  some of the authors received threats that if they do not withdraw their  names from the publication they will be fired. Some elements also  demanded that the governmental agency that funded the study will refuse  to be mentioned in print as the funder (as obligatory for  publicly-funded research). The agency complied. To understand what the  article was about and why it was censored, I have to go back to my  psychology degree. Two decades ago, in my first year as a psychology  student, we learned about the history of the concept of intelligence and  the development of formulas to calculate it, and on the PowerPoint  presentation appeared data showing that the average intelligence in men  and women is the same. During break time, in the smoking corner, one  female student argued authoritatively: “This is nonsense. Women are  smarter.” Someone asked why, and she replied, “There are more really  dumb men than really dumb women.” I understood her point. But in the  same semester we also learned about the terms distribution, mean, and  variance, so I noted, “It doesn’t mean that the average intelligence of  women is higher, it just means that the variance in men is larger.” She  asked what I meant by that, so I told her about the enchanted forest. In  the summer, the enchanted forest has trees with an average height of  ten meters.  Some are right at knee height, others so tall you can’t see  the end of them. But, when you return to the forest in winter, you  discover that the smaller trees have grown to the height of a traffic  light, while the wind broke down the huge tree tops and those are now  only two stories high. And here’s why it’s called the enchanted forest:   after all these dramatic changes, its average height remains the same!  How is that possible?\n\nThe answer is that the changes  occurred in the variance, which is a simple concept: it says “to what extent are things different from one another” – a lot, or just a little. In the  summer, tree tops were at large distances from the average – far above  it, and far below. In winter the higher trees came down and the shorter  trees grew higher, both moving closer to the average, becoming more  “alike”, that is, all the changes went into a decrease in the  variability. “The average intelligence in men and in women,” I told that  student (we were already on our way to class), “would remain equal even  if there are more really stupid men than really stupid women, if, there  are also more men than women with exceptional intelligence. The  variability would be the difference between the sexes, without there  being any difference in their averages.” I saw that she was torn between  the intuitiveness of the explanation and the desire – or maybe just the  habit – to believe that women are smarter, but the lecture began and we  couldn’t continue. The idea described here was formulated by  researchers more formally and given a name – the Greater Male  Variability Hypothesis (GMVH). The study mentioned above provided  evidence in support of the GMVH, in general, as well as regarding  intelligence. This, was the reason it was censored, through feminist  actions.\n\nCensorship was also used in the case of [Dr. Lisa Littman](https://en.wikipedia.org/wiki/Rapid_onset_gender_dysphoria_controversy) of Brown University in the US, who in 2018 published in an esteemed journal called PLOS ONE [her study](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0202330)  which demonstrated that much of the trans phenomenon is social, with  evidence that the probability that youth would define themselves as  trans is hundreds to thousands percent higher if they are in a class  with trans-sexual teens compared to the probability in the youth  population, and with findings showing that most of the children and  teens who announced themselves as trans became more popular as a result.  She was attacked. An article in the Guardian called the publication a “[poisonous lie](https://www.theguardian.com/commentisfree/2018/oct/22/rapid-onset-gender-dysphoria-is-a-poisonous-lie-used-to-discredit-trans-people)” and another outlet called it “[bad science](https://theconversation.com/why-rapid-onset-gender-dysphoria-is-bad-science-92742).” Eventually her article was removed from the journal, for what was defined as “re-evaluation”. Although it has been [republished](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0214157),  and without substantial changes, it is necessary to emphasize that the  only way in science to criticize information collected with valid  methodology, is by investigating the topic and publishing another  research, and not by removing publications, which is censorship. On the  day of the re-publication the university canceled a press release on the  article, in a decision that [drew criticism](https://quillette.com/2018/08/31/as-a-former-dean-of-harvard-medical-school-i-question-browns-failure-to-defend-lisa-littman/)  from the former dean of the Harvard Medical School. Because of pressure  on an organization that employed Littman as a consultant, [she was summoned for questioning and fired](https://quillette.com/2019/03/19/an-interview-with-lisa-littman-who-coined-the-term-rapid-onset-gender-dysphoria/).\n\n>*The aggressive censorship that evolved within feminism, eventually and predictably turned against feminists as well*\n\nThese are severe cases of censorship  of science by disqualifying articles that were accepted for publication,  meaning they have successfully passed a scrutinizing examination of  rigor and methodological validity. If deletion of publications is  relatively rare, it is only because scholars do not dare to hypothesize  in the first place anything which they know would be regarded by the  censor as violating the beliefs of what [the book Lovism](https://www.amazon.com/Lovism-Humanist-Alternative-Henry-Blair-ebook/dp/B08RXMS7M2) termed “The Gender Church”. They do not dare conduct studies, many of which are vital for human health and policy making, of [fear of being silenced and fired](https://amp.theguardian.com/education/2020/jan/14/sacked-silenced-academics-say-they-are-blocked-from-exploring-trans-issues), and potentially losing their entire life’s work, as described below. This concrete fear was expressed [in a letter published in the media by 50 researchers](https://www.theguardian.com/society/2018/oct/16/academics-are-being-harassed-over-their-research-into-transgender-issues)  as early as 2018 where they wrote, “Members of our group have  experienced campus protests, calls for dismissal in the press,  harassment, foiled plots to bring about dismissal, no-platforming, and  attempts to censor academic research and publications.” How did science  and medicine get to this state? \n\nFeminism has been [attacking scientific thinking](https://pubmed.ncbi.nlm.nih.gov/11609153) for at least four decades now, arguing that [rational thinking is part of patriarchal oppression](https://newleftreview.org/issues/I207/articles/sabina-lovibond-feminism-and-the-crisis-of-rationality.pdf), that [objectivity is men’s subjectivity](https://now.org/blog/creating-a-more-feminist-science/), that science is [the objectification of nature](https://www.bmartin.cc/pubs/85spp.html),  and that the way physical laws and phenomena are described in science  is not a product of a human endeavor to get as close as possible to a  description of how nature behaves, but only [a projection of masculine thinking](https://www.bmartin.cc/pubs/85spp.html) – depicted as “[phallic](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa)“, “[domineering](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa)“, “[forceful](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa)“.  Within the internal feminist discourse, hostility to science comes from  the fact that feminism does not acknowledge the existence of two sexes,  and believes that all that exists is a socially-generated illusion of  two sexes, created according to this narrative by cultural definitions  that form molds, dubbed in feminism “genders”. In the feminist  perception the two sexes are something that would not have existed if  not for humans “spreading” a concept of two sexes. But science and  medicine have been elaborating for millennia our understanding of the  human body including of the two sexes. Thus [in the eyes of feminism](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa),  the universal acknowledgment that there are indeed two sexes, is  science’s fault – science is what has “spread” the “illusion”. One must  keep in mind that within feminist discourse, the two sexes are not an  innocent “illusion”, but one that was purposely “devised” for oppression  of women. Therefore science, from a feminist perspective, is one of the  principal culprits responsible for whatever feminists would regard as  oppression. The feminist hostility is thus not toward the way science is  conducted (whether it is done by men or women, are its conclusions one  way or another) – but toward its very existence. Beneath a mountain of  arguments, science for feminism is something that must be shattered for  equality to materialize (that is, feminism’s attitude toward science is  very similar to that of religions). \n\nThe aggressive censorship that evolved  within feminism, eventually and predictably turned against feminists as  well, and feminists became the target of censorship by the followers of  this new church. Like Professor Camille Paglia, a feminist researcher  who is well-known within the feminist world and who previously published  a feminist critique, but also a critique of feminism that was  considered highly provocative, arguing that sex differences are  biological and that feminists’ expectations of the relations between the  sexes are unrealistic. Already in the 1990s, members of feminist  academic committees have condemned her first book, but in May 2019 there  was an escalation in the feminist aggression when it was reported that a  student protest on the University of Philadelphia campus where she  teaches, was trying to force the institution [to take away her professor position](https://amp.theatlantic.com/amp/article/587125/)  which she held for the past three decades. In addition to signing a  petition, the students staged a demonstration outside Paglia’s lecture,  eventually interrupting it by activating the emergency alarm which  necessitated the evacuation of the building. The activists quoted an  interview where Paglia said that it’s ridiculous in her view that female  students who regret having sex at a student party half a year or a year  later would complain about it to university authorities. A journalist  who tried to get responses from faculty members reported they were  afraid to openly defend Paglia, asking to remain anonymous, and even in  email correspondence have expressed concerns that the institution would  eavesdrop on their emails, noting that such an atmosphere is  unprecedented in academia.\n\nBut of course, as we have seen, this  is not a precedent, but an academic routine, and the only precedent is  in that the intimidation that feminism has placed the entire research  world under (Paglia was never part of this policing, and perhaps this is  why she was among the first to be targeted), is now directed toward  feminism itself. And so in November 2019 the [Oxford Brooks University barred at the last minute](https://www.thetimes.co.uk/article/oxford-brookes-university-cancels-feminist-speaker-rachel-ara-after-students-accuse-her-of-transphobia-3tdkxscz6)  a feminist artist named Rachel Ara from giving a lecture in the fine  art research unit following a letter from an LGBT organization and  student complaints, and in January 2020 it was reported that the [University of East Anglia canceled a feminist seminar](https://thetab.com/uk/norwich/2020/01/20/uea-cancels-seminar-by-feminist-speaker-to-respect-transgender-community-33377)  by a philosophy professor from Sussex University named Kathleen Stock,  focused on “philosophical issues surrounding  diversity and inclusion,”  because of “security and health and safety issues” following threats  (the intention was probably to blow up the conference). That same month [Oxford University provided two bodyguards](https://www.bbc.com/news/education-51248684)  to Selina Todd, a modern history professor and a feminist researcher,  after she was informed of an intention to harm her and due to a sense of  threat from students and researchers who oppose her views on protected  spaces for women. The guards arrived at the lecture halls before the  students and remained there during the lectures. Two months later, in  March 2020, the organizers of the Oxford International Women’s Festival [canceled ](https://www.bbc.com/news/amp/uk-england-oxfordshire-51737206)Todd’s  planned participation following pressure from women who announced an  intention to disrupt the event, and after one feminist lecturer  boycotted the festival following Todd’s invitation.\n\nBut even these harsh events are overshadowed by the case of [Prof. Kenneth Zucker](https://en.m.wikipedia.org/wiki/Kenneth_Zucker),  former director of the Gender Identity Services clinic for youth at  Toronto’s Centre for Addiction and Mental Health (CAMH), in Canada,  which more than anything else resembles secret trials conducted in the  Soviet Union against doctors, writers and intellectuals considered  anti-revolutionaries. Zucker is one of the founders of the field of  clinical treatment of trans children and youth, which includes the  medical aspects of the transition. A professor of psychology and  psychiatry at the University of Toronto, who has published 211  scientific papers and co-authored 72 books, he was the person who headed  the DSM team that defined the term gender dysphoria, the psychological  definition for trans (Dysphoria literally meaning, “unhappiness”).  During three decades of treating trans children and adolescent, Zucker  has developed an approach of accompanying boys and girls until  adolescence and not transitioning their sex earlier, to allow sexual  identity to crystallize without interfering with their preference, after  which they were assisted with the transition.\n\n>*The second  decade of the 2000s saw a shift in the status of gender studies  departments, from being in discourse with science, to constituting a  managerial body in a position of control over science*\n\nHowever, genderist groups have made  the clinic and Zucker a target. For several years the clinic has been  labeled as performing “conversion therapy,” a term describing a forceful  coercion to change sexual tendencies. On one of the days of December,  2015, Zucker was summoned to the office of the medical center director  as soon as he arrived at the clinic. When entering the director’s  office, she gave him a report and said he could read it in her presence,  and that the document will be published within hours on the center’s  website. When he began reading, he came across accusation after  accusation. The harshest one was alleging that Zucker mocked a trans boy  who was asked to remove his shirt for examination. The director left  and a human resources personnel entered. She would arrange the dismissal  documents.\n\nMonths later, a journalist named Jess Single will publish [a thorough investigation into the report and the event](https://www.thecut.com/2016/02/fight-over-trans-kids-got-a-researcher-fired.html)s.  He will locate the boy, gather details from him that would seem inconsistent  with the possibility that the incident in which he suffered mockery took  place in the clinic, guess from the details which clinic it might be  and send the boy an unnamed picture of another doctor, from that other  clinic. The boy’s words as he sees the picture are quoted by the news  reporter: “Oh my God. Sorry. Yeah.” “I feel like this is the guy”. The  boy confirmed with certainty that the person he reportedly was mocked by  was not Prof. Kenneth Zucker. The report appears to have been written  based on those concerns who have previously threatened the clinic. The  journalist also tried to understand why the clinic staff advised the  parents of toddlers to wait before changing their sex. A psychologist  who worked with Zucker explained that she and the staff observed in the  clinic that by the time they will reach adolescence, over 80% of  toddlers and young children would spontaneously abandon the idea to  change sex (as can also be seen in [the research data](https://www.latimes.com/opinion/op-ed/la-oe-soh-trans-feminism-anti-science-20170210-story.html?_amp=true)),  so the approach was to accompany and support them until the stage when  the desire was consolidated. She also stressed that one of the reasons  for waiting was that they observed that parents of children who are in  initial exploration of becoming trans, become activists, operate in  various organizations and take the children to demonstrations, which  puts pressure on the child to continue with the change even when he or  she do not want it. After Zucker was fired the clinic was closed. Today, six years later, the entire  feminist world regards the closure of the clinic as a human achievement.  Zucker’s senior status meant that his removal was to be perceived as  the overthrow of a monarch. Following the trial conducted in the  shadows, feminist women with a clinical degree in psychology around the  world are encouraging the sex transition of toddlers as young as three.  In one country, a nine-year-old whose sex transition to female began at  age three, was introduced in a[ special feminist journalistic report](https://www.haaretz.com/israel-news/.premium.MAGAZINE-i-was-a-girl-but-no-one-knew-the-incredible-story-of-rina-a-trans-fourth-grader-1.8845974)  published by a daily newspaper, where the approach of the feminist  psychologists who accompany the child was presented to the public as the  triumph of light over darkness. Only in a marginal note, made by one feminist interviewee, was the removal from office and academic exiling of some anonymous villain from Canada mentioned, leaving the impression of a successful  capturing of a contemporary Josef Mengele. The transitioned child was  later[ put on stage in front of a crowd of thousands](https://www.pinknews.co.uk/2020/05/15/trans-girl-nine-haaretz-israel-supportive-parents-gender-affirming/), who gathered following the publication to support the victory of progress and morality. \n\nThe second decade of the 2000s saw a  shift in the status of gender studies departments, from being in  discourse with science, to constituting a managerial body in a position  of control over science, including medicine and psychology. This change,  which placed gender studies and all the groups surrounding it as the  highest ruling body governing science – the role that the Catholic  Church and the Inquisition had over science in the Dark Ages – was  revealed in [an article published in late 2018 in the journal Nature](https://www.nature.com/articles/d41586-018-07238-8),  the most important of scientific journals, the crown of science. It was  written as an editorial. The piece focused on the scientific definition  of sex, and explained in a style appropriate for a blog that the notion  of two genetically distinguishable sexes “has no basis in science.” It  articulated, without citing a source, a statement designed to make the  ordinary reader understand that 1% of humanity has “differences” that do  not allow sex to be determined as male or female, with the sentence  being constructed such that the unscientific reader will understand “1%”  while those responsible for this text could quickly dispose of their  “1%” by pointing to the words “some of which” hidden in the sentence, in  case a scientist demands explanations for this error. The figure 1% is  incorrect – every biology graduate knows that there are very few and  extremely rare disorders occurring during fertilization, which create a  chromosomal array of an atypical chromosomal sex (namely XYY syndrome),  with other rare disorders being characterized by a completely normal  chromosomal sex with reproductive organs that do not express this  definitive chromosomal sex due to a dysfunction during the fetal  development, and that[ all of these phenomena are estimated at tens of cases per million and up to 200 cases per million people](https://www.researchgate.net/profile/Inas_Mazen/publication/43227152_Screening_of_Genital_Anomalies_in_Newborns_and_Infants_in_Two_Egyptian_Governorates/links/561d21cf08aef097132b1a8c.pdf)  – far from 1% of the population which would amount to 10,000 per  million. The inferences made in the arguments of the editorial  repeatedly referred to anecdotal cases or described situations in a  biased manner which is easily responded to, but the general public would  not know how to do so and the writers relied on that. Going through  this editorial would remind the reader of a familiar tone – this is a  typical article coming from the Department of Gender Studies. The  article was written by the censor. \n\nThe convoluted argumentation, the  repression of data, the dogmatism of first proclaiming a truism and then  considering findings in a biased manner with a primary goal of reaching  the predefined conclusion at all cost – thus using science as no more  than a propaganda device for predetermined beliefs – these are no longer  the methods of a division within academy that was battering science for  decades. When these practices appear in the editorial of the most  important scientific publication of our time, it is evident where does  the censorship is coming from: those who apply these methods are now a  power governing science. The impact of feminism and the groups  surrounding it is not marginal. It no longer criticizes science. It  controls it, and it does so through the most important positions of  leadership, put under threat of violence including ostracism. The  control is complete or very close to that – by imposing censorship, by  dictating restrictions, and primarily by spreading fear. Identity  politics groups who gathered under the feminist umbrella are firmly  involved – deleting the sex chapter from science and rewriting it  according to feminist groups beliefs, with threats to cancel open  discussion about data and using violence to dictate the correct beliefs.  It is hard to estimate how many critical studies are not being  conducted out of fear of a fate similar to that of Prof. Kenneth Zucker,  and the damage of this atmosphere, of terror and deceit, to scientists,  to policies that affect lives, and to the human aspiration to achieve a  humane society.",
    "title": "Science Plus Violence Equals Silence: The Gender Church Equation",
    "subreddit": "MensRights",
    "timestamp": 1614662346,
    "score": 11,
    "keyword": "brown director"
  }
]