[
  {
    "text": "Personality Assessment - Was I wrong to turn down job because of one? I just had a chance at a second interview for a job that would have been a significant increase in salary and probably have some wide exposure within my industry.  In all respects, this should have been a great position that I'd have jumped at immediately- did jump at, actually.  \n  \nUnfortunately, the step after the initial interview was a personality assessment questionnaire.  One of those navel-gazing things where you're asked to answer on scale of Strongly Disagree to Strongly Agree whether or not you brag about your personal accomplishments, whether or not you want people in your organization to do better than you do at tasks, whether or not you like working in an environment where nothing stays the same... If I answer Strongly Disagree does that mean I don't have accomplishments, hate my fellow employees, can't handle change?!?!?  \n  \nIn the immortal words of Sweet Brown, ain't nobody got time for that.  \n  \nI politely let the company's recruiter know that I was no longer interested in the position and wished them the best in their candidate search.  \n\nIs it reasonable to consider these things as a \"reverse personality assessment\" where I gauge the suitability of a potential employer by the criterion \"I often can't judge my candidates' character without a psychological questionnaire\" being answered \"Strongly Agree?\"",
    "title": "Personality Assessment - Was I wrong to turn down job because of one?",
    "subreddit": "jobs",
    "timestamp": 1511370467,
    "score": 2,
    "keyword": "brown judge"
  },
  {
    "text": "I was raped on Wednesday and I just needed to write about it a little Why am I so focused on insignificant things? Why am I so bothered that I have to leave my favorite pair of thrift store jeans on a piece of paper spread across the bathroom floor? They cost me less than ten dollars and they were starting to get loose around my hips anyway. Why do I care when the detective and her partner take my bedsheets away in a brown bag? I got them with a coupon at Bed, Bath, and Beyond and the thread count wasn't even that high. Why do I fear that my nurse will judge me when I mention to her I dyed my pubic hair purple a few weeks ago after she clips away several strands? Why do I worry that calling the strawberry Zofran tablet I dissolved under my tongue an antiemetic will make me seem too knowledgeable about a process I've never been through? Will they think I'm lying because I circled around the parking garage a couple times across from the police station instead of just parking in a handicap spot right out front? Will they tell me it's too gray to proceed with charges? I had told him ahead of time that I didn't want a relationship or sex. I told him that things were moving too fast and I was still in love with someone else and I wanted to be celibate for the next year. I told him all of this before we met and he agreed that we should just be friends. And still he came through my door and hugged me and later said on the phone that I gave him mixed signals because I sat down on my bed. I was wearing a t-shirt and jeans. I wasn't trying to send any signals. He started kissing me and I hadn't even looked at his face yet. So he kissed me and I kissed him back even though I didn't want to. And he slipped his hand under my shirt and grabbed my breast and asked me to take my shirt off and I did. And he gnawed on my left nipple piercing and I looked at him for the first time and felt disgusted. And my pants were off and I can't remember how they ended up down at my ankles. Did he do that? Did I? He's biting at my stomach and touching me and licking me and I don't want this. I keep turning away and he asks me why I won't look at him and why I'm hiding my face. I tell him I'm shy because I'm scared if I tell him I think he's repulsive he'll get mad and sometimes when men get mad they hit you. Sometimes when men get mad they kill you. So I just roll over and lift my comforter over my face like a child watching a horror movie. His pants are off and he's standing on my bed looking down at me and I feel small. I don't want to look at his body. He doesn't look like the person in the pictures he sent me. He doesn't even appear to be the nationality he claims to be. He wedges himself between my legs and tries to fuck me and I tell him no and I'm so proud of myself. And he's says \"ok\" and I'm relieved. I explain to him that earlier in the week that things got out of hand at a photoshoot and I slept with the other model and even though it was consensual it wasn't something I felt good about. And he seems like he understands and he says he's sorry about that and then he asks when I'd last been fucked prior to that. I keep turning away. He holds me, spoons me like we're some couple and not strangers that met less than half an hour earlier. And he's touching me again and I feel his fingers near my vagina and then suddenly his fingers are gone and his fucking dick is inside of me and my body slumps like a scruffed cat. I'm lying there, I'm a body, just a body, I'm frozen, he's thrusting into me and I can't believe this is happening and he tosses my body around like I'm not even a person underneath all this flesh. I don't know how much time passes. It feels like a minute or two. He doesn't ask me if I'm okay or if I like this or anything. It's like I'm not even there. And finally I'm able to speak again and I say \"I don't want to do this\". He says \"do you not like me?\" and I can still picture his fucking pathetic face when he asks me this and all of a sudden all I can do is cry and repeat \"I don't even know you I don't even know you\". He says sorry and asks if I want him to leave and I say yes and then he insists that he's going to take me somewhere and I tell him to leave. He asks to use the bathroom and I give him permission and he leaves my house and before I can even get up to lock my door he rings the bell and I realize his sunglasses are on my dresser. I'm wrapped in my comforter and I hold the glasses through the crack in the doorway. Why the fuck do I offer him such courtesy? I shut the door and run back into my room and cry and I want to scream but I don't because I think if I start I'll never be able to stop.\n\nYesterday, the day after, I bought a white pages account and looked up his phone number. He had never told me his last name, just his first name. It turns out it wasn't even his real fucking name. I thought he didn't look Spanish and it's because his name is Pakistani. And when you Google his name it looks like he got married a little over a month ago. He's a rapist and a liar and a piece of shit and I'm so fucking angry.",
    "title": "I was raped on Wednesday and I just needed to write about it a little",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1503108495,
    "score": 87,
    "keyword": "brown judge"
  },
  {
    "text": "What was I supposed to do when I see a lady in distress? I didn’t know where to post, but here we go.\n\nI am a married man with lots of ladies in my family (wife, sister, cousins, mother, aunts). I know ladies are routinely subject to catcalling and verbal harassment. Where I come from it’s a common practice that anyone around should stand up for any lady who is subject to such crap; it’s a social norm. I moved to the US a couple of years ago, but something happened today and I wanted to understand how such things are dealt with here.\n\nToday after having a bike through a park during the lunch break I noticed a young lady at the exit of the park who was clearly in distress. I saw a pickup slow by hear, then move out and the driver seemed to be laughing/waiving at the lady. It just didn’t seem right to me. So I stopped and asked her if she was OK or if she needed any help. She just didn’t respond to me clearly so I got closer and asked her if she was OK, then she just started saying stuff about her cousin/looking for someone/if I know her or the driver, I couldn’t really understand. My English isn’t bad, but I just didn’t understand her. So I asked her what to repeat what she was saying and that’s when she became very agitated. She stared calling me a creep/to leave her alone. She just didn’t seem OK/coherent. So I asked her if she was OK or if she needs the cops. I had seen the exact same behavior once from my sister one time when she was mugged in broad daylight a couple of years ago, and I understand it can be frustrating, but I just didn’t know what to do. At that time I just felt I might be misunderstood or even accused of harassing her. I just didn’t know what to do. Luckily, a park authority pickup just passed by at the same time and I thought I would better leave her -as it might be interpreted that I am harassing her- and they would be better able to judge if she needed help. \n\nI just felt threatened. I didn’t know what to do. I just had through my mind the thought that a brown, alien guy over a bike being shouted at by a lady is just the stereotype of a scumbag harassing a lady, and I just felt the urge to run away although I just wanted to help. I don’t really know what to do if that happens again. I don’t want to be the bystander who lets shit happen because it’s non of his business. What was I supposed to do?",
    "title": "What was I supposed to do when I see a lady in distress?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1511384955,
    "score": 14,
    "keyword": "brown judge"
  },
  {
    "text": "Experienced a ton of sexism and racism in South Korea and need to vent You'd think this was a more appropriate post for the country's sub but, having read so many ~~white men~~ people there apologize for racism, I thought the sexism aspect would at least be appropriate here. **TL:DR at the bottom.**\n\nIt's probably my fault for not reading up on the 'bad' aspects of Korean culture, but I don't know many people who look for those things before visiting a country that has a modern-looking society. Being half Asian the racism and sexism I receive from my mother's homeland is minimal and tolerable. At 5'8\" I stand out. My plain features, brown skin and lankiness draw judgement because 'mixies' are meant to be pale and have more Anglo features. My bad. \n\nAnyway, my stay in Hong Kong and Taiwan was dope. So much to see and so much good food to eat! Shopping was cheaper than back home. Nice. The last leg was South Korea, the source of my mother's beloved K-Dramas and my opportunity to see snow for the first time. What I actually experienced was the opposite of dope. \n\nIt started as I got off of the plane. By far I was the tallest woman there. I stood near the exit and three people approached from behind whispering. I turn around to face my friend and the group glances at me with an audible sigh 'oh, negro'. It was a shock to hear someone refer disdainfully, out loud, to a person as negro. I wondered if they were seeing people who had dark skin or were African (American) around. When there was no person with brown skin other than myself close by I jumped to the conclusion that they might be talking about me and judged based on my features - big lips, booty and wide-ish nose. I dismissed it as me imagining things. \n\nThe next day I was in Meyongdong, a big tourist area, near my hotel. We rushed about and it was packed with stylish people and all the cheap makeup and street food we wanted. As I got bored I tuned in to the crowd around me. So, FYI, the locals LOVE to stare and make comments about foreigners in Hangul, and if they really want to speak their mind a descriptor or two in English as you walk by. By the time I made it back to the hotel I'd been called Japanese (called, not asked) and Chinese and Americano (anyone who can speak English) and... ni**er, once. I saw an African family on a train later with such miserable looks on their faces that I wondered if they were getting the same treatment.  \n\nNow sexism and internalized-mysogyny. Going in I knew Korea has impossibly high beauty standards and I was not exempt from judgement; not that I could hide given I was taller than most people as well as having brown skin. I believe women did not like that I was tall and thin as that is a huge ideal and the vast majority are smaller than 5'8\". Two other girlfriends who were with me have typical Asian height and features and were mostly ignored. Men especially didn't like that I was tall. Contrary to reports, Korean men did not appear any taller to me than other Asian men. So while women laughed as I walked by and grabbed their boyfriends to drag them further away, men got aggressive, like intentional shoves in crowds and 'tch-ing' as they would walk past. Old men turned around after seeing me as I approached. If I stood next to them in a crowd they'd move elsewhere. A kid walked by and called me a giant monster as his parents smirked. It was bewildering how frequent and constant this behavior was. Almost everyone I walked past was laughing or giving dirty looks. Even people some distance away. Christ. By the end of my 2nd day I tired of what was happening and concluded this was top of the range sexism and racism. [I Googled this shit and found that I wasn't alone and the issue is swept under the rug.](http://ireport.cnn.com/docs/DOC-1221602) [Open discrimination is not legislated against and foreigners complaints are dismissed](http://www.koreaobserver.com/nearly-all-foreigners-victim-of-discrimination-in-seoul-29001/). Great. Also found out that speaking English when not white invites scorn for being a snob and 'better' than Koreans, which they mocked me for too. Another layer of bullshit to deal with.\n\nOn the 4th day I had enough and stayed in my hotel. It was great tbh, but my travel companions who had typical Asian appearances thought I was crazy. I was fine with watching action movies all day instead of looking at the ground to try in an attempt to hide myself.\n\nBy the 7th day I was willing to face the music and go on the DMZ tour, which was amazing, then I had dinner and it was back to the bullshit. I decided to go out for the remaining couple of days anyway as I had recharged my spirit staying in the hotel and wanted to see what I could, which was a bad decision. I only remembered Gangnam was the capital of superficiality once I saw all the plastic surgery ads in the train station. Walking around there the laughs were louder and the men yelling 'You're a big girl!' was just enough evidence for my friends to start believing me. \n\nBy the end I was emotionally worn down. I was happy my flight was early morning but the abuse from other Korean travelers continued until I got off the plane in Singapore. The biggest irony was sitting in the departure lounge as a Korean woman walked past with a bag that said 'RACISM' with a cross through it. If I weren't so demoralized I would've laughed. \n\n**TL:DR - Beware of rampant, open, sexism and racism in Korea, and by all means do not be brown, tall and female. People defend Korea's nationalist monoculture and say 'you just have to deal with it' but you'd think there'd at least be some tiny courtesy to keep the racist and sexist comments quieter. Even sadder is that it's being taught to children. I don't hate Korea, it's a beautiful country, but I wish their culture did not foster so much ignorance. For *anyone* visiting there you'll need something tougher than thick skin.**",
    "title": "Experienced a ton of sexism and racism in South Korea and need to vent",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1484496487,
    "score": 2,
    "keyword": "brown judge"
  },
  {
    "text": "Anyone else feel self conscious wearing bright lipstick colors like pinks, magentas, and oranges? In what is probably a result of internalized racism, I feel like my lips are too prominent to pull off bright lipstick. I just bought a pink lipstick from Colorpop that (I'm pretty sure) compliments my skin but every time I wear it. I feel like everyone is looking at my lips and judging me. \n\nI've only worn very neutral nudes and reds that I've thoroughly  blended with brown lipliner so the colors are less bright and noticeable. I recently went to the doctor's and I think she complimented me on my lipstick but I keep running what she said through my head.  She said, \" I like that pink. But enh you can pull off any color.\" WTF does that mean?? Y'all go through any of this?",
    "title": "Anyone else feel self conscious wearing bright lipstick colors like pinks, magentas, and oranges?",
    "subreddit": "blackladies",
    "timestamp": 1497581713,
    "score": 36,
    "keyword": "brown judge"
  },
  {
    "text": "Feminism is about equality, it's NOT a hate movement - “The price of clinging to the enemy [a man] is your life. To enter into a relationship with a man who has divested himself as completely and publicly from the male role as much as possible would still be a risk. But to relate to a man who has done any less is suicide. . . . I, personally, have taken the position that I will not appear with any man publicly, where it could possibly be interpreted that we were friends.” – Ti-Grace Atkinson [Ti-Grace Atkinson, Amazon Odyssey, Links Books, 1974, pp. 90, 91]\n\n- Janet Bajan, a member of the New York Radical Feminists, drew applause when she said that man hatred was “a protective reaction, a survival mechanism to change the situation in favor of women.” – Janet Bajan [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “[Rape] is nothing more or less than a conscious process of intimidation by which all men keep all women in a state of fear.” – Susan Brownmiller [Susan Brownmiller, Against Our Will: Men, Women and Rape, Secker & Warburg, 1975, p. 6]\n\n- “Women have always been the primary victims of war. Women lose their husbands, their fathers, their sons in combat.” – Hillary Clinton, [speech by Hillary Clinton, First Ladies’ Conference on Domestic Violence in San Salvador, El Salvador on Nov. 17, 1998\n\n- “If life is to survive on this planet, there must be a decontamination of the Earth. I think this will be accompanied by an evolutionary process that will result in a drastic reduction of the population of males. People are afraid to say that kind of stuff anymore.” Mary Daly [from a 2001 interview with What Is Enlightenment magazine [referencing] Mary Daly, Quintessence...Realizing the Archaic Future: A Radical Elemental Feminist Manifesto, Beacon Press, 1998, p. ?]\n\n- “MALE:...represents a variant of or deviation from the category of female. The first males were mutants...the male sex represents a degeneration and deformity of the female. – Elizabeth Gould Davis [Elizabeth Gould Davis, The First Sex, 1971, G. P. Putnam’s Sons; reprinted in: Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996]\n\n- “All men are scum and must die.” – Clementine Ford [Twitter, @clementine_ford, Nov. 15, 2016]\n\n- “All patriarchists exalt the home and family as sacred, demanding it remain inviolate from prying eyes. Men want privacy for their violations of women ... All women learn in childhood that women as a sex are men’s prey.” Marilyn French [Marilyn French, The War Against Women, Ballantine Books, 1992, p. 186]\n\n- “The proportion of men must be reduced to and maintained at approximately 10% of the human race.” – Sally Miller Gearhart [Sally Miller Gearhart, “The Future - If There Is One - Is Female,” in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982]\n\n- “Why have any men at all?” – Sally Miller Gearhart [Sally Miller Gearhart, “The Future - If There Is One - Is Female,” in Pam McAllister, Reweaving the Web of Life?, New Society Publishers, 1982, p. ?]\n\n - “I have a great deal of difficulty with the idea of the ideal man. As far as I’m concerned, men are the product of a damaged gene.: –Germaine Greer [Germaine Greer publicly speaking at a Hilton Hotel literary lunch, promoting her book, The Change: Women, Aging and the Menopause, Knopf, 1992, p. ? -- from a news report dated Nov. 14, 1991]\n\n- “Probably the only place where a man can feel really secure is in a maximum security prison, except for the imminent threat of release.” – Germaine Greer [Germaine Greer, in “Security,” The Female Eunuch, Mcgraw-Hill, 1971, p. ?]\n\n- “And if the professional rapist is to be separated from the average dominant heterosexual [male], it may be mainly a quantitative difference.” – Susan Griffin [Susan Griffin, “Rape: The All-American Crime,” Ramparts 10, September 1971, pp. 26-35]\n\n- “if this book leaves the impression that men have conspired to keep women down, that is exactly the impression I mean to convey; for I believe that men could not have succeeded as well as they have without concerted effort” [Ann Jones, Women Who Kill, Ballantine, 1981, p. xvii; quoted in Peter Vronsky, Female Serial Killers: How and Why Women Become Monsters, 2007, Berkeley Books, p. 16]\n\n- “I believe that women have a capacity for understanding and compassion which man structurally does not have, does not have it because he cannot have it. He’s just incapable of it.” – Barbara Jordan [Barbara Jordan, speaking at a women’s political symposium in Sep. 1991; quoted in Lawrence Wright, “Are Men Necessary,” Texas Monthly,  Feb. 1992, p. 84]\n\n- “MAN:...an obsolete life form... an ordinary creature who needs to be watched...a contradictory baby-man...” – original source? [Cheris Kramarae, Ann Russo, editors, A Feminist Dictionary, Pandora Press, 1985, reissued by University of Illinois Press, 1996, p. ?]\n\n- “Men’s sexuality is mean and violent, and men so powerful that they can ‘reach WITHIN women to fuck/construct us from the inside out.’ Satan-like, men possess women, making their wicked fantasies and desires women’s own. A woman who has sex with a man, therefore, does so against her will, ‘even if she does not feel forced.” [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- “I feel what they feel: man-hating, that volatile admixture of pity, contempt, disgust, **envy**, alienation, fear, and rage at men. It is hatred not only for the anonymous man who makes sucking noises on the street, not only for the rapist or the judge who acquits him, but for what the Greeks called philo-aphilos, ‘hate in love,’ for the men women share their lives with--husbands, lovers, friends, fathers, brothers, sons, coworkers.” [Judith Levine, My Enemy, My Love: Women, Masculinity, and the Dilemmas of Gender, Doubleday, 1992, p. ?]\n\n- “Man-hating marks a turning point in the movement. We have been defensive long enough. People often ask me how women can be man-haters. And I wonder, hoe can we be anything else.” – Pat Mainardi [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “The only way to win liberation is to make men miserable so they will have no peace until women are free. Married women invented man-hating.” – Pat Mainardi [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “We have a moral cause for hating men for they have taken away all our power.” – Barbara Mirnoff [Jurate Kazickas, “Hatred of Men On Conference Agenda,” syndicated (AP), Sunday News-Journal (Daytona Beach, Ga.), Sep. 24, 1972, p. 21]\n\n- “I claim that rape exists any time sexual intercourse occurs when it has not been initiated by the woman, out of her own genuine affection and desire.” – Robin Morgan [Robin Morgan, Going too Far: The Personal Chronicle of a Feminist - Theory and Practice: Pornography and Rape, Random House, 1974, p. ?]\n\n- “...rape is the perfected act of male sexuality in a patriarchal culture -- it is the ultimate metaphor for domination, violence, subjugation, and possession.” – Robin Morgan [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Women’s Liberation Movement, Vintage, 1970, p. ?]\n\n- “I haven’t the faintest notion what possible revolutionary role white hetero-sexual men could fulfill, since they are the very embodiment of reactionary-vested-interest-power. But then, I have great difficulty examining what men in general could possibly do about all this. In addition to doing the shitwork that women have been doing for generations, possibly not exist? No, I really don’t mean that. Yes, I really do.” [Robin Morgan, Sisterhood Is Powerful: An Anthology of Writings from the Women’s Liberation Movement, Vintage, 1970, p. ?]\n\n- “Man is but one of a million humble fertilizers. Nature intended woman to reign supreme.” – Marie Petti [William M. Sweets, “Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head,” syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- “Modern man, in his pose of superiority, is but a mere contemptible imposter, who must be subdued. Woman’s superiority has been scientifically established. At the beginning of organic life, woman, created man, and ruled him. He was a parasite, and a slave. At best, man is but an afterthought of nature.” – Marie Petti [William M. Sweets, “Man Is A Mere Imposter And Woman Is Supreme, Says Ultra-Feminist Head,” syndicated (UP), The Pittsburgh Press (Pa.), May 7, 1922, p. 1]\n\n- “I honestly have been reassessing the fact that I am giving care to these little future rapists, and what that says about me and my separatism. I know it is kinda going against my principles to support and care for these little f****rs.” [quoted in John the Other, “Feminists: demented, stunned or cultists: Why Do MRAs Keep Attacking Feminism?” A Voice for Men, Jan. 2, 2012]\n\n- “The male is a biological accident: the ‘y’ (male) gene is an incomplete ‘x’ (female) gene, that is, has an incomplete set of chromosomes. In other words, the male is an incomplete female, a walking abortion, aborted at the gene stage. To be male is to be deficient, emotionally limited; maleness is a deficiency disease and males are emotional cripples.” – Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- “[Males should] ...go off to the nearest friendly suicide center where they will be quickly and painlessly gassed to death.” – Valerie Solanas [Valerie Solanas, SCUM Society for Cutting Up Men Manifesto, The Olympia Press, New York 1968;  (2001 ed., AK Press) , p. ?]\n\n- “We are, as a sex, infinitely superior to men.” –  Elizabeth Cady Stanton (Nov. 12, 1815 – Oct. 26, 1902;  feminist; suffrage leader) (USA)\n\n- “Patriarchy requires violence or the subliminal threat of violence in order to maintain itself... The most dangerous situation for a woman is not an unknown man in the street, or even the enemy in wartime, but a husband or lover in the isolation of their home.” – Gloria Steinem [Gloria Steinem, Revolution from Within: A Book of Self-Esteem, 1992, Little, Brown & Co., pp. 259-61]\n\n- “Only men kill in anger.” [from: Gerald Caplan, “Battered Wives,” National Review, Feb. 25, 1991]\n\n- “Only when manhood is dead--and it will perish when ravaged femininity no longer sustains it--only then will we know what it is to be free.” – Andrea Dworkin [Andrea Dworkin, Our Blood: Prophecies And Discourses On Sexual Politics - The Root Cause, Harper & Row, 1976]\n\n- “Men love death. In everything they make, they hollow out a central place for death, let its rancid smell contaminate every dimension of whatever still survives. Men especially love murder. In art they celebrate it, and in life they commit it. They embrace murder as if life without it would be devoid of passion, meaning, and action, as if murder were solace, stilling their sobs as they mourn the emptiness and alienation of their lives.” –\nAndrea Dworkin [Andrea Dworkin, “Why So-Called Radical Men Love and Need Pornography,” in: Laura Lederer, ed., Take Back the Night, Morrow, 1980, p. 148]\n\n- “...[W]omen and men are distinct species or races ... men are biologically inferior to women; male violence is a biological inevitability; to eliminate it, one must eliminate the species/race itself ... in eliminating the biologically inferior species/race Man, the new Ubermensch Womon (prophetically foreshadowed by the lesbian separatist herself) will have the earthly dominion that is her true biological destiny. We are left to infer that the society of her creation will be good because she is good, biologically good. Andrea Dworkin, Letters From a War Zone - Take Back The Day - Biological Superiority: The World’s Most Dangerous and Deadly Idea, 1977, Dutton Publishing, 1989, p. 146]\n\nCredit to unknown misandry for compiling these.  \n\nEdit: I wanted to add one of my replies from the comments: \n\nThese \"certain people\" include the founder of the feminist movement in the United States, the founder of the first gender studies department, the most well known figures in the second wave, and the quasi-intellectuals who developed feminist theory.\n\nFeminism is rooted in the hatred of men. That's why they've only ever looked at ways in which females are supposedly disadvantaged by the system (ergo, nothing to do with equality). \n\nThat's also why it is absurd to claim that \"feminism helps men too.\" Why would you want to help the people you consider your oppressors and class enemies?",
    "title": "Feminism is about equality, it's NOT a hate movement",
    "subreddit": "MensRights",
    "timestamp": 1486569871,
    "score": 140,
    "keyword": "brown judge"
  },
  {
    "text": "Rape Investigation Handbook - \"Ultimately, we are left to conclude that there is no published study or data to support any claim that the false tape allegation rate is or was ever down around 2%\" |Rape Investigation Handbook|\n|:---|\n|Ultimately, we are left to conclude that there is no published study or data to support any claim that the false rape allegation rate is or was ever down around 2%; not anywhere, even from those who cited that number originally. Rather, it comes from a judge giving a speech to some attorneys almost 40 years ago whose source has, to date, not been identiﬁed or confirmed.|\n||\n|It is not inappropriate to suggest that it is time we move forward and away from the citation of this figure to more contemporary and reliable scientiﬁc data.|\n||\n|**Published Research:** There has been some research specific to the area of falsely reported rapes, resulting in published figures ranging from 8 to 41%:|\n||\n|**1.** MacDonald (1973) provided false report rates for 1968: they were 18% nationwide and 25% in Denver, Colorado \n||\n|**2.** Greenfield (1997), quoting US. Bureau of Justice Statistics, provided a nationwide false report rate of 8% in 1995 and 15% in 1997|\n||\n|**3.** Brown and colleagues (1997) conducted research to address the issue of genital injury in female sexual assault victims presenting to the San Luis Obispo General Hospital emergency room in California between 1985 and 1993. Their study revealed a false report rate of just over 13%, involving women who ultimately removed themselves from the research being conducted|\n||\n|**4.** Kanin (1994), in his study of an unnamed Midwestern city in the United States, revealed a 41% false report rate.|\n||\n|**5.** Kennedy and Witkowski (2000), in their attempt to replicate the Kanin study in a suburb of Detroit, found a false report rate of 32% between 1988 and 1997.|\n||\n|**6.** In April 2002, Her Majesty’s Crown Prosecution Service Inspectorate and Her Majesty’s Inspectorate of Constabulary published ”A Report on the Joint Inspection into the Investigation and Prosecution of Cases Involving Allegations of Rape.” The report revealed that, out of 1379 cases studied, 11.8% were false reports.|\n||\n|**7.** Lea and associates (2003) gathered data in a constabulary in the southwest of England from 1996 to 2000, They revealed an 11% false report rate.|\n||\n|**8.** Jordan (2004) studied police rape and sexual assault files in New Zealand The study revealed a false report rate of 41%.|\n||\n|These numbers, while varying by location and year, combine to suggest that false reports of rape are not rare, but common. The authors are not suggesting that these numbers be used predicatively to infer that false reporting is more or less likely in a given case. Rather, we are suggesting that **this illustrates the need for due process and impartial investigations in cases of alleged sexual assault.**|\n||\n||\n|*John O. Savino; Brent E. Turvey (23 August 2011).* ***[Rape Investigation Handbook.](https://books.google.co.uk/books?id=mGaOIzxRByoC&pg=PA276&lpg=PA276#v=onepage&q&f=false)*** *Academic Press. p. 276. ISBN 978-0-12-386030-9.*|",
    "title": "Rape Investigation Handbook - \"Ultimately, we are left to conclude that there is no published study or data to support any claim that the false tape allegation rate is or was ever down around 2%\"",
    "subreddit": "MensRights",
    "timestamp": 1513256087,
    "score": 134,
    "keyword": "brown judge"
  }
]