[
  {
    "text": "What Not To Do At An Interview Pt. 1 So I have been busy all week interviewing candidates for a few vacancies we have for the 2021/2022 school year. Yesterday was not a great day to interview candidates. I had two candidates in a row for the science position we have that were just....... bad at interviewing. I will describe the first one now. Let me explain how the interview process works in my district. \n\nCandidates apply to the school district via the district website. Those candidates applications are then sorted into what positions they are applying for and what they are also qualified to teach. the district then gives us a list with their stats and we schedule interviews with candidates we are interested in. I meet with the candidate for 5 minutes before the interview begins to make sure information is correct and to just chat with them. If there are no red flags, they meet with myself, the principal, and a member of the department they are applying to work in (Science, Math, P.E., ect..) If we like them, we let HR know and they make the candidate an offer. \n\nThe first candidate I had yesterday for the post was a young man who we will call Abe. Abe is a 24 year old man who has a degree in biology and would need an emergency certification if hired. Not uncommon when you have a position that is hard to fill. Abe showed up onetime and dressed in a polo shirt, brown slacks, and a pair of tennis shoes. I spoke with Abe in my office and I asked him the questions I often do of teachers who are new to the career field. When I asked him \"Why do you want to be a teacher here?\" he gave me an honest answer, but still a terrible answer. I shit you not, here is how this part of the conversation went:\n\nHonest Abe: Oh, I don't want to be a teacher.\n\nMe: What?\n\nHonest Abe: I don't want to be a teacher. I just need a job for a few months until my Master's program begins.\n\nMe: This position is a full time teaching position. It is from August till May. \n\nHonest Abe: Oh I know. But I just want to teach a few classes a day until December. \n\nMe: Ok, that is not going to happen. I need a full time teacher that will complete the school year. I can't hire someone part time to work for only a few months. Sorry.\n\nHonest Abe: So are we going to meet with the principal now? \n\nMe: No. You just told me that you don't want to be a teacher and that you can't complete the school year. \n\nHonest Abe: Can we just forget I said that stuff and meet with the principal?\n\nMe: No. No we can't just forget it. I am not going to hire someone who doesn't want to be a teacher and can't finish their contract. I'll show you out.\n\nHonest Abe: Please. I need a job. \n\nMe: This is a teaching position, not fast food. Good luck in you job search and your Master's program.\n\nI then walked him out and let the principal know why I cancelled the interview. I also let HR know. Just a bit of advice to any new teachers. \n\nDon't tell the interviewer that you don't want to be a teacher or that you plan to quit before the year ends. It won't work out for anyone.",
    "title": "What Not To Do At An Interview Pt. 1",
    "subreddit": "Teachers",
    "timestamp": 1622744603,
    "score": 758,
    "keyword": "brown principal"
  },
  {
    "text": "Once upon a time... It's story time.\n\nThe principal had a problem:  His bio teacher had quit just a week before the start of the year, so he was short.  It was a small school.  Bio was only a part time position.  Probably part of the reason.  \n\nHe got a permit to hire a non-teacher, and posted the position at the local college.  Mike was a grad student at the college and need some work to keep body and soul together.  Mike was hired.\n\nThe principal gave  him 3 sections of biology.  He warned them that the third section was a set of troublemakers.  \"Kids who are good with their hands\" was the euphanism of the day.  Meaning that they mostly too shop, and were not expected to get any further education after high school.  \n\n\"Just keep them from tearing the building apart.  No one expects more than a few to pass.\"\n\nTheir class was last period of the day.  The Principal expected that the new guy would have trouble with classroom control, and so didn't want them wound up before another class.\n\nMike walks into the classroom.  Stands still at the front of the class holding a mousetrap in his hand.  Waits for silence.  \n\n\n\"How do you trap a mouse?\" he said quietly.  This would be a trademark of his teaching style.  He'd sit on the front of the desk 3 feet from the closest student, and talk quietly.  The kids would shush each other to hear what he was saying.\n\nLots of stories came out.  What bait, peanutbutter, cheese, bacon rind.?  Trap placement.  He spent about 5 minutes talking about traps.\n\n\"Now, how would you trap a mouse without injuring it?\"  He brainstormed for 20 mintues, broke them up into groups, but didn't make the groups the same size.  He had a few solitary guys, a raft of 2-3s and one group of 6.  \n\n\nHe didn't have them report their findings that day.  Instead he gave each one a standard trap, and said, \"You can use this as part of your trap system.  On Monday (this was a Friday) come back with a trap.\n\nCome Monday they crowded in.  He had a couple of markers.  \"Mark your trap so you know it's yours.\" and then went out into the empty field adjacent to the school grounds.  \n\n\"Where will you find mice?\"\n\n\"Huh?\"  \n\n\n\"If you're a mouse, this is all a big forest.  When you are in a forest you find the easy paths, right?  Figure out where the mouse paths are.  Think like a tiny rabbit.\"  \n\n\nLots of discussion.  \n\n\"Now remember what was said about trap placement day one?\"  \n\n\n\"That was inside with killer traps\"  \n\n\n\"Some things don't change.  You still have to lure Mr Mouse into your trap.\"\n\n&#x200B;\n\nBy the end of the day there were 27 traps out, one for each kid in the class.  \n\n\\*\\*\\*  \nTuesday they went to check traps.  Some had a mouse.  Many didn't. Some had dead mice. Mike told them to release their catch.\n\n\"Some guys are jsut lucky.\"  \n\"Lucky?  Maybe.  Might be skill.  Everyone who caught a mouse raise your hand.\"  \n\nHands go up.  \"Everyone else:  Go look at at least 3 of the successful guys setups.\"  Successful guys look at the mouseless setups.\n\nBy the end of the week everyone was trapping a mouse nearly every day.  On Friday he had them bring their mice back.  \"What are we going to do with them\"  \n\n\n\"How do you tell Mr. Mouse from Mrs Mouse?\"  Lots of embarrassed faces.  \"Come on, the guys have balls and a dick, right?\"  Laughter.  \"Ok watch.  He opened a trap, and drop a mouse into a large beaker.  \"We want to know sex, weight, and age.\" He showed them how to use a triple beam balance to weigh mouse plus beaker, then weigh just the beaker.  They had to subtract to get the mouse. He showed slides of mouse teeth to teach them how to estimate the age of the mouse.  \n\nIt was nearing the end of class, so he told them to release their mouse near where they had caught it, and reset the trap.\n\nThe next day in class, he asked, \"How many mice per acre on that field?\"  \n\n\"We caught 27 a day last week except when Jim's didn't on Wednesday.  5 times 27 is about 100.\"\n\n\"No, That can't be right.  We don't know that every mouse was caught.  Could be lots more than 100.\"\n\n\"What if we caught the same 27 mice every day but Wednesday.\"  \n\n\nMike jumped on that one.  \"How can we tell if we've had a mouse before?\"\n\nOne of the boys quipped, \"How many female 25 gram mice age 4 months do we have?\"  A quick list showed that there were repetitions.  \n\n\"Besides\" said John, \"How do we know that their weight is constant.  Mr. Mouse may be on steroids to bulk up, or Ms mouse is on a diet for the Mouse Prom.\n\n\"Lets give them all ID's\"  said Mike.\n\n\"You do that, and they are going to the liquor store to buy beer\"\n\n\"How do you ID a mosue?\"  \n\n\n\"Easy.\" Mike reached into his pocket an pulled out a bird banding kit.  The kind they use for banding chickadees and sparrows, and other little brown jobbies.\n\nHe showed them the tiny anodized aluminum rings each with a number, and the special pliers that would close the ring around a leg without crushing it.\n\nGo get your mice, bring them in, do the usual measurements, and we'll band them before letting them go.\n\nAnother week passes.  And the data is showing that yes mice are getting caught multiple times.  Some of the kids are putting a chunk of apple in their traps so the mice are less likely to die of thirst if they are too long in the trap.  Most mice are gaining weight.    \n\nMike comes in:  \"Do mice have turfs?\"\n\n\"Eh?\"\n\n\"Do they have their own territory?  How could we find out?\"  \n\n\nGradually he drew out of them, that if each mouse had his own territory, a given trap would keep trapping the same mouse, or possibly the same pair of mice, or maybe a small clan of mice.  \n\n\"Make a list of all the Mouse IDs you've collected.  Compare to t he guys near you.  See you tomrrow.\"\n\nThe next day the data wasn't conclusive.  There were a fair number of repeats, but also some caught in  at least two traps. \n\n\"We need more traps.  Can we buy our own mousetraps and make mroe traps?\"\n\n\"Go ahead.  You don't have to, but we'll get better numbers.\"\n\nSoon they had about a hundred traps.  The local hardware store (small town) was puzzled by the number of teenagers who came in and only bought one or two packs of mousetraps and nothing else.\n\n&#x200B;\n\nThey also realized that keeping track of 100+ traps was a problem.  So Mike taught them how to make a map, using plane tables and protractors.  This gave them distances between traps.\n\nOne day they were out, and they heard a red tail hawk scream and saw it drop like a stone, and fly off with something in it's talons.  \"Hey bully, bring him back!\"  \n\nTime passed.  Many of the kids were running their traplines twice a day, coming in at 8. Mike scavenged jars so the kids could jar their mice, reset the trap, and do their before school measurements.  \n\nA few times a female that had been caught before showed a big loss of weight.  \"Is she nursing\" asked Mike? \"Waht? \" \"Are her tits full of milk?\" \"Oh...\"\n\nHe taught them statistics and statistical spreads.  ANOVA.  Chi Squared regression analysis. This dummies class knew more statistical analysis than the advanced math class. \n\n&#x200B;\n\nAs winter shut in, he had a few obviously pregnant females brought in and set up in terrariums.  This allow the kids to track how fast a mouse grew up.\n\nThey did more analysis on the trapping patterns and concluded that mice didn't have territories that they defended, but every mouse seemed to stay in a 70 meter neighbourhood.  \n\nThey had to throw out a bunch of data.  When the weather got cold too many mice were dying in the traps.  So they fitted up the traps with nesting material and food and water.  The mice thought this was great, and would submit to their weighing and be in the same trap the next day.  \n\n&#x200B;\n\nEnd of the term was coming.  District superintendant dropped by to check on  things.  The principal wax eloquent on what Mike was doing the non-academic kids.    \n\n\nSo the super sat in on one of Mikes classes.  Freewheeling discussion about mouse population dynamics.  One kids came up, drew a graph of population rise, and crash.  One of the others mocked, \"Nice sketch.  Got any numbers to go with it?\"  Mike directed them into how would they get meaningful numbers.\n\nSuperintendent pulled out the bio curriculum manual.  \"Where does your lesson fit in the bio curriculum\"  \n\n\n\"What does it matter?  I was told that they kids were losers and wouldn't likely even graduate from high school.  I'm teaching them how to think!\"\n\nSuper went to the Principal.  \"Fire him.  He's not following the curriculum\"  \n\n\nAnd that is part of what's wrong with our education system.\n\n&#x200B;\n\n\\*\\*\\*\n\n&#x200B;\n\nI got this story second hand.  My brother was a prof at NMSU for decades.  Mike was a fellow grad student when he also was a grad at Oregon state.\n\n&#x200B;\n\nI don't know if I got all the details right.  But I've captured the essence of the story.",
    "title": "Once upon a time...",
    "subreddit": "Teachers",
    "timestamp": 1614054894,
    "score": 192,
    "keyword": "brown principal"
  },
  {
    "text": "Adventures in Culinary Arts: A Tale of Three Meatballs My Culinary I students learned to make a brown sauce today. After pureeing the sauce, we made a simple derivative by stirring in some cream. The cream sauce was mixed with macaroni and was served with meatballs that the students made from scratch.\n\n[https://imgur.com/H5QT8kW](https://imgur.com/H5QT8kW)\n\nWhile the meatballs were baking in the oven, I told my students the story of Mr. Smith (not his real name).\n\nWhen I first transferred to my current school some six years ago, the principal decided to have a mid-year open house. Since she wanted to showcase my talents and advertise my presence, she gave me a budget and had me produce hundreds of appetizers with my students.\n\nWe made burger sliders, glazed berry tarts, deep fried pork egg rolls, flan with dulce de leche, and lots of other foods. We also made meatballs in a brown sauce.\n\nI teamed up with our business teacher to serve this food. While my students produced the food, the business teacher's FCCLA students wearing white dress shirts with red power ties and blue blazers served as our counter servers to serve the appetizers. We improvised a counter by placing a table sideways in the main hallway outside the kitchen door.\n\nI am told that no open house has ever been so well attended. I teach at a rural Title I high school of some 300 students. Each parent got 3 tickets for coming to our open house. Each ticket was redeemable for one portion of appetizers.\n\nMr. Smith is one of our teachers. It turned out that he LOVES meatballs. Even before we opened, he was in line to order meatballs. The meatballs came 3 to a portion. To the amusement of the students, he was in line FIVE TIMES throughout the night. He paid for the meatballs using extra tickets that he got from his wife. His wife happens to be our school principal.\n\nAfter telling this story to my class, the students asked if they could take Mr. Smith some meatballs. I've told the same story to all of my classes this week and since Mr. Smith is one of our most popular teachers, every single class has asked if they could take him a portion of meatballs.\n\nMr. Smith has been in gastronomic heaven, much to the amusement of his wife.\n\n**EDIT:** Just in case anyone were to wonder if Mr. Smith abused his spousal privileges by getting extra tickets, he did not. Each teacher, administrator, and staff member was given three tickets. Mr. Smith spent all of his tickets and then mooched two tickets from his wife.",
    "title": "Adventures in Culinary Arts: A Tale of Three Meatballs",
    "subreddit": "Teachers",
    "timestamp": 1620760687,
    "score": 18,
    "keyword": "brown principal"
  },
  {
    "text": "A little flub I decided was appropriate in this forum. 5th graders with Genetics.. what a combination. :)  \n\nThis flub was within the last decade. so totally pertinent.\n\nI'm teaching 5th graders all of the subjects, and I'm at a school that gives us a significant amount of leeway with our instruction after state testing (this is also the Bizarro version of how much leeway we're given *prior* to testing). During Science we found ourselves learning about dominant and recessive genes, hitchhikers' thumb, blue eyes, you know, the typical tropes from the Recessive Gene Handbag.\n\nI have a subjectively-fascinating story about genetics, and how my first wife had light eyes (along with me), and we had two sons with light eyes, and how also my current wife and I have three brown eyed children (she's \"all Italian\", but doesn't know her Dad as much as she'd like to, okay well *exactly as much* as she'd like to). We discussed what pigment of the eyes really is/was, and the genetic information related to it being like a crapshoot. We began a project where we used dice to roll to make an imaginary person based on the genetics we were given (literally given by assignment, each group had a specific geno/phenotype for hair, height, eye color, etc.). The kids then drew their person they created.\n\nOf course as this is going on, who enters the room but the administrative team, clipboards in tow. Let me say that I have my principal, (annabel fluster we'll call her) come in on the regular, and how she likes to \"show me off\" to visitors, etc., so I'm used to these walk-ins. This time, however, she happened to be showcasing our school to a group of potential donors who were ultra-conservative, head to toe. As soon as they walked in, with their pilgrim-esque attire, hair-tied back military-style, frumps abounding, I suddenly had a *That's So Raven* moment where my face most assuredly had a mini-seizure as I flashed back to emails I read last week about today's \"on-campus visitors\". Just as this realization comes to me I hear <HomeSkillet>, one of my favorites and least favorites at the same time, answer an apparent question with \"We're making BABIES!!!\". The rest of the class all chimed in like the \"Mine\" seagulls from Finding Nemo, repeating the \"Yeah we're making babies\", peppered with some \"my mom's gonna be mad cuz I'm not sposed to get pregant before my sister!\" and \"I'm done so I\"m going to make baby-babies!\", followed by \"they're grand babies stoopid hahahahahah\".\n\nThis whole thing that could have been funny-enough and explainable following one student's comment, but shit escalated quickly. During this menagerie of reproductive commentary, the donors had, clearly, seen enough and walked out, faces frowning even more than their already-unimaginable frumps. Principal Fluster was the last to leave, holding the door for a quickstepping line of hunched over hags as she turned to look at me, shook her head in disbelief, and disappeared into the broke-ass night.\n\nTL;DR I screwed up royally when kids made comments about making babies during a genetics project I shouldn't have even been doing. We lost out on a lot of money because of it.\n\n\"Update\"- Through this arc of a story, one would assume that these potential donors never got on board with our charter school. In this case, that would be 100% correct.... and yes, it was my fault.",
    "title": "A little flub I decided was appropriate in this forum. 5th graders with Genetics.. what a combination. :)",
    "subreddit": "Teachers",
    "timestamp": 1638208408,
    "score": 8,
    "keyword": "brown principal"
  },
  {
    "text": "At my wits end It's my first year teaching at a charter that is mostly Black and Brown students. I'm a white guy who grew up in a city and went to a public school with similar demographics. A few weeks ago someone left a note on my laptop while I ran out to the bathroom that said \"N***** Abibasman\" hard R and everything. I took a picture and emailed admins and just brushed it off as covid student frustration or some stupid prank. But then last week while doing test review on Nearpod, someone, using another student's account, wrote the same message, for everyone to see. Now yesterday, I left the room twice, first was to get last minute copies that were queued up, and an emergency bathroom break. Both times I came back and had notes that said the same thing on my laptop. And finally today, I got a taunting note \"come and find me cracker n******\" Admins have been supportive saying \"I'm so sorry this happened to you. It shouldn't be happening. It's a terrible way to end your day\" it's nice to hear but it is just so demoralizing. It also feels like they are not doing anything. And what can they really do? The principal walked in today and was just circling around talking to the kids, but barely made eye contact with me. I really feel like calling out tomorrow but I feel like it's unfair to the rest of the kids.  But I also want to seem strong in front of this student and make sure they know that I won't be easily broken. I really don't know what to do.",
    "title": "At my wits end",
    "subreddit": "Teachers",
    "timestamp": 1635384672,
    "score": 2,
    "keyword": "brown principal"
  },
  {
    "text": "Science Plus Violence Equals Silence: The Gender Church Equation This is an article taken from [a blog](https://lovists.com/2021/03/01/science-plus-violence-equals-silence-the-gender-church-equation/). It discusses and demonstrates with concrete examples and references, how feminism had moved from battering scientific research to controlling it, through censorship and violence. This does not concern only scientists, but rather this is presented to explain how society's understanding of problems that individuals face, and of the reasons and solutions for them, is distorted by a religion-like agenda that controls, well, what would be considered a fact, through its control over research. When we ask ourselves why there's no public discussion on issues that should have been regarded as universal rather than female issues, such as discrimination in education and work, inequality under the law, or violence and sexual violence, a considerable part of the reason is the control over facts. Enjoy the reading.\n\nIn 2016, a panel of brain researchers  convened at a scientific conference carrying the title “The Promise and  Peril of Research on Sex Differences”. In a discussion held on stage by  five researchers, three highlighted only similarities between the sexes,  until two female scientists intervened from the audience to explain  that avoidance of differences is anti-scientific, but more gravely –  neglects medical needs unique to women. The objection didn’t help. One  panelist called the study of differences “a waste of time”, thereby  ignoring a fact [pointed out by another investigator responding to a Newsweek journalist ](https://www.newsweek.com/brain-research-hindered-scientists-afraid-be-sexist-report-526304?amp=1)  – specific treatments such as for Alzheimer’s disease, affect women and  men differently, so studying differences is crucial for discovering  relevant therapies. Why were the scientists on stage so reluctant to  acknowledge sex differences? A comment made by a researcher at the end  of that day revealed the answer: his colleagues, he explained, are so  afraid of being accused of sexism that [they refuse to acknowledge or study any sex differences](https://slate.com/technology/2011/11/boys-brains-girls-brains-how-to-think-about-sex-differences-in-psychology.html). \n\n>*If deletion of publications is relatively rare, it is only because scholars do not dare to hypothesize*\n\nThis fear among both male and female  scientists is well-founded. One example of the atmosphere causing it was  observed in 2019, when a scientific paper about to be published, after  being accepted by two established journals, [was disqualified](https://www.the-scientist.com/news-opinion/a-retracted-paper-on-sex-differences-ignites-debate-64873/amp)  because of a protest by a feminist organization arguing that “the paper  might be damaging to the aspirations of impressionable young women.” [According to one report](https://fcpp.org/2019/01/23/feminists-assault-science/#_ftn3),  some of the authors received threats that if they do not withdraw their  names from the publication they will be fired. Some elements also  demanded that the governmental agency that funded the study will refuse  to be mentioned in print as the funder (as obligatory for  publicly-funded research). The agency complied. To understand what the  article was about and why it was censored, I have to go back to my  psychology degree. Two decades ago, in my first year as a psychology  student, we learned about the history of the concept of intelligence and  the development of formulas to calculate it, and on the PowerPoint  presentation appeared data showing that the average intelligence in men  and women is the same. During break time, in the smoking corner, one  female student argued authoritatively: “This is nonsense. Women are  smarter.” Someone asked why, and she replied, “There are more really  dumb men than really dumb women.” I understood her point. But in the  same semester we also learned about the terms distribution, mean, and  variance, so I noted, “It doesn’t mean that the average intelligence of  women is higher, it just means that the variance in men is larger.” She  asked what I meant by that, so I told her about the enchanted forest. In  the summer, the enchanted forest has trees with an average height of  ten meters.  Some are right at knee height, others so tall you can’t see  the end of them. But, when you return to the forest in winter, you  discover that the smaller trees have grown to the height of a traffic  light, while the wind broke down the huge tree tops and those are now  only two stories high. And here’s why it’s called the enchanted forest:   after all these dramatic changes, its average height remains the same!  How is that possible?\n\nThe answer is that the changes  occurred in the variance, which is a simple concept: it says “to what extent are things different from one another” – a lot, or just a little. In the  summer, tree tops were at large distances from the average – far above  it, and far below. In winter the higher trees came down and the shorter  trees grew higher, both moving closer to the average, becoming more  “alike”, that is, all the changes went into a decrease in the  variability. “The average intelligence in men and in women,” I told that  student (we were already on our way to class), “would remain equal even  if there are more really stupid men than really stupid women, if, there  are also more men than women with exceptional intelligence. The  variability would be the difference between the sexes, without there  being any difference in their averages.” I saw that she was torn between  the intuitiveness of the explanation and the desire – or maybe just the  habit – to believe that women are smarter, but the lecture began and we  couldn’t continue. The idea described here was formulated by  researchers more formally and given a name – the Greater Male  Variability Hypothesis (GMVH). The study mentioned above provided  evidence in support of the GMVH, in general, as well as regarding  intelligence. This, was the reason it was censored, through feminist  actions.\n\nCensorship was also used in the case of [Dr. Lisa Littman](https://en.wikipedia.org/wiki/Rapid_onset_gender_dysphoria_controversy) of Brown University in the US, who in 2018 published in an esteemed journal called PLOS ONE [her study](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0202330)  which demonstrated that much of the trans phenomenon is social, with  evidence that the probability that youth would define themselves as  trans is hundreds to thousands percent higher if they are in a class  with trans-sexual teens compared to the probability in the youth  population, and with findings showing that most of the children and  teens who announced themselves as trans became more popular as a result.  She was attacked. An article in the Guardian called the publication a “[poisonous lie](https://www.theguardian.com/commentisfree/2018/oct/22/rapid-onset-gender-dysphoria-is-a-poisonous-lie-used-to-discredit-trans-people)” and another outlet called it “[bad science](https://theconversation.com/why-rapid-onset-gender-dysphoria-is-bad-science-92742).” Eventually her article was removed from the journal, for what was defined as “re-evaluation”. Although it has been [republished](https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0214157),  and without substantial changes, it is necessary to emphasize that the  only way in science to criticize information collected with valid  methodology, is by investigating the topic and publishing another  research, and not by removing publications, which is censorship. On the  day of the re-publication the university canceled a press release on the  article, in a decision that [drew criticism](https://quillette.com/2018/08/31/as-a-former-dean-of-harvard-medical-school-i-question-browns-failure-to-defend-lisa-littman/)  from the former dean of the Harvard Medical School. Because of pressure  on an organization that employed Littman as a consultant, [she was summoned for questioning and fired](https://quillette.com/2019/03/19/an-interview-with-lisa-littman-who-coined-the-term-rapid-onset-gender-dysphoria/).\n\n>*The aggressive censorship that evolved within feminism, eventually and predictably turned against feminists as well*\n\nThese are severe cases of censorship  of science by disqualifying articles that were accepted for publication,  meaning they have successfully passed a scrutinizing examination of  rigor and methodological validity. If deletion of publications is  relatively rare, it is only because scholars do not dare to hypothesize  in the first place anything which they know would be regarded by the  censor as violating the beliefs of what [the book Lovism](https://www.amazon.com/Lovism-Humanist-Alternative-Henry-Blair-ebook/dp/B08RXMS7M2) termed “The Gender Church”. They do not dare conduct studies, many of which are vital for human health and policy making, of [fear of being silenced and fired](https://amp.theguardian.com/education/2020/jan/14/sacked-silenced-academics-say-they-are-blocked-from-exploring-trans-issues), and potentially losing their entire life’s work, as described below. This concrete fear was expressed [in a letter published in the media by 50 researchers](https://www.theguardian.com/society/2018/oct/16/academics-are-being-harassed-over-their-research-into-transgender-issues)  as early as 2018 where they wrote, “Members of our group have  experienced campus protests, calls for dismissal in the press,  harassment, foiled plots to bring about dismissal, no-platforming, and  attempts to censor academic research and publications.” How did science  and medicine get to this state? \n\nFeminism has been [attacking scientific thinking](https://pubmed.ncbi.nlm.nih.gov/11609153) for at least four decades now, arguing that [rational thinking is part of patriarchal oppression](https://newleftreview.org/issues/I207/articles/sabina-lovibond-feminism-and-the-crisis-of-rationality.pdf), that [objectivity is men’s subjectivity](https://now.org/blog/creating-a-more-feminist-science/), that science is [the objectification of nature](https://www.bmartin.cc/pubs/85spp.html),  and that the way physical laws and phenomena are described in science  is not a product of a human endeavor to get as close as possible to a  description of how nature behaves, but only [a projection of masculine thinking](https://www.bmartin.cc/pubs/85spp.html) – depicted as “[phallic](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa)“, “[domineering](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa)“, “[forceful](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa)“.  Within the internal feminist discourse, hostility to science comes from  the fact that feminism does not acknowledge the existence of two sexes,  and believes that all that exists is a socially-generated illusion of  two sexes, created according to this narrative by cultural definitions  that form molds, dubbed in feminism “genders”. In the feminist  perception the two sexes are something that would not have existed if  not for humans “spreading” a concept of two sexes. But science and  medicine have been elaborating for millennia our understanding of the  human body including of the two sexes. Thus [in the eyes of feminism](https://journals.sagepub.com/doi/abs/10.1177/026327648200100217?journalCode=tcsa),  the universal acknowledgment that there are indeed two sexes, is  science’s fault – science is what has “spread” the “illusion”. One must  keep in mind that within feminist discourse, the two sexes are not an  innocent “illusion”, but one that was purposely “devised” for oppression  of women. Therefore science, from a feminist perspective, is one of the  principal culprits responsible for whatever feminists would regard as  oppression. The feminist hostility is thus not toward the way science is  conducted (whether it is done by men or women, are its conclusions one  way or another) – but toward its very existence. Beneath a mountain of  arguments, science for feminism is something that must be shattered for  equality to materialize (that is, feminism’s attitude toward science is  very similar to that of religions). \n\nThe aggressive censorship that evolved  within feminism, eventually and predictably turned against feminists as  well, and feminists became the target of censorship by the followers of  this new church. Like Professor Camille Paglia, a feminist researcher  who is well-known within the feminist world and who previously published  a feminist critique, but also a critique of feminism that was  considered highly provocative, arguing that sex differences are  biological and that feminists’ expectations of the relations between the  sexes are unrealistic. Already in the 1990s, members of feminist  academic committees have condemned her first book, but in May 2019 there  was an escalation in the feminist aggression when it was reported that a  student protest on the University of Philadelphia campus where she  teaches, was trying to force the institution [to take away her professor position](https://amp.theatlantic.com/amp/article/587125/)  which she held for the past three decades. In addition to signing a  petition, the students staged a demonstration outside Paglia’s lecture,  eventually interrupting it by activating the emergency alarm which  necessitated the evacuation of the building. The activists quoted an  interview where Paglia said that it’s ridiculous in her view that female  students who regret having sex at a student party half a year or a year  later would complain about it to university authorities. A journalist  who tried to get responses from faculty members reported they were  afraid to openly defend Paglia, asking to remain anonymous, and even in  email correspondence have expressed concerns that the institution would  eavesdrop on their emails, noting that such an atmosphere is  unprecedented in academia.\n\nBut of course, as we have seen, this  is not a precedent, but an academic routine, and the only precedent is  in that the intimidation that feminism has placed the entire research  world under (Paglia was never part of this policing, and perhaps this is  why she was among the first to be targeted), is now directed toward  feminism itself. And so in November 2019 the [Oxford Brooks University barred at the last minute](https://www.thetimes.co.uk/article/oxford-brookes-university-cancels-feminist-speaker-rachel-ara-after-students-accuse-her-of-transphobia-3tdkxscz6)  a feminist artist named Rachel Ara from giving a lecture in the fine  art research unit following a letter from an LGBT organization and  student complaints, and in January 2020 it was reported that the [University of East Anglia canceled a feminist seminar](https://thetab.com/uk/norwich/2020/01/20/uea-cancels-seminar-by-feminist-speaker-to-respect-transgender-community-33377)  by a philosophy professor from Sussex University named Kathleen Stock,  focused on “philosophical issues surrounding  diversity and inclusion,”  because of “security and health and safety issues” following threats  (the intention was probably to blow up the conference). That same month [Oxford University provided two bodyguards](https://www.bbc.com/news/education-51248684)  to Selina Todd, a modern history professor and a feminist researcher,  after she was informed of an intention to harm her and due to a sense of  threat from students and researchers who oppose her views on protected  spaces for women. The guards arrived at the lecture halls before the  students and remained there during the lectures. Two months later, in  March 2020, the organizers of the Oxford International Women’s Festival [canceled ](https://www.bbc.com/news/amp/uk-england-oxfordshire-51737206)Todd’s  planned participation following pressure from women who announced an  intention to disrupt the event, and after one feminist lecturer  boycotted the festival following Todd’s invitation.\n\nBut even these harsh events are overshadowed by the case of [Prof. Kenneth Zucker](https://en.m.wikipedia.org/wiki/Kenneth_Zucker),  former director of the Gender Identity Services clinic for youth at  Toronto’s Centre for Addiction and Mental Health (CAMH), in Canada,  which more than anything else resembles secret trials conducted in the  Soviet Union against doctors, writers and intellectuals considered  anti-revolutionaries. Zucker is one of the founders of the field of  clinical treatment of trans children and youth, which includes the  medical aspects of the transition. A professor of psychology and  psychiatry at the University of Toronto, who has published 211  scientific papers and co-authored 72 books, he was the person who headed  the DSM team that defined the term gender dysphoria, the psychological  definition for trans (Dysphoria literally meaning, “unhappiness”).  During three decades of treating trans children and adolescent, Zucker  has developed an approach of accompanying boys and girls until  adolescence and not transitioning their sex earlier, to allow sexual  identity to crystallize without interfering with their preference, after  which they were assisted with the transition.\n\n>*The second  decade of the 2000s saw a shift in the status of gender studies  departments, from being in discourse with science, to constituting a  managerial body in a position of control over science*\n\nHowever, genderist groups have made  the clinic and Zucker a target. For several years the clinic has been  labeled as performing “conversion therapy,” a term describing a forceful  coercion to change sexual tendencies. On one of the days of December,  2015, Zucker was summoned to the office of the medical center director  as soon as he arrived at the clinic. When entering the director’s  office, she gave him a report and said he could read it in her presence,  and that the document will be published within hours on the center’s  website. When he began reading, he came across accusation after  accusation. The harshest one was alleging that Zucker mocked a trans boy  who was asked to remove his shirt for examination. The director left  and a human resources personnel entered. She would arrange the dismissal  documents.\n\nMonths later, a journalist named Jess Single will publish [a thorough investigation into the report and the event](https://www.thecut.com/2016/02/fight-over-trans-kids-got-a-researcher-fired.html)s.  He will locate the boy, gather details from him that would seem inconsistent  with the possibility that the incident in which he suffered mockery took  place in the clinic, guess from the details which clinic it might be  and send the boy an unnamed picture of another doctor, from that other  clinic. The boy’s words as he sees the picture are quoted by the news  reporter: “Oh my God. Sorry. Yeah.” “I feel like this is the guy”. The  boy confirmed with certainty that the person he reportedly was mocked by  was not Prof. Kenneth Zucker. The report appears to have been written  based on those concerns who have previously threatened the clinic. The  journalist also tried to understand why the clinic staff advised the  parents of toddlers to wait before changing their sex. A psychologist  who worked with Zucker explained that she and the staff observed in the  clinic that by the time they will reach adolescence, over 80% of  toddlers and young children would spontaneously abandon the idea to  change sex (as can also be seen in [the research data](https://www.latimes.com/opinion/op-ed/la-oe-soh-trans-feminism-anti-science-20170210-story.html?_amp=true)),  so the approach was to accompany and support them until the stage when  the desire was consolidated. She also stressed that one of the reasons  for waiting was that they observed that parents of children who are in  initial exploration of becoming trans, become activists, operate in  various organizations and take the children to demonstrations, which  puts pressure on the child to continue with the change even when he or  she do not want it. After Zucker was fired the clinic was closed. Today, six years later, the entire  feminist world regards the closure of the clinic as a human achievement.  Zucker’s senior status meant that his removal was to be perceived as  the overthrow of a monarch. Following the trial conducted in the  shadows, feminist women with a clinical degree in psychology around the  world are encouraging the sex transition of toddlers as young as three.  In one country, a nine-year-old whose sex transition to female began at  age three, was introduced in a[ special feminist journalistic report](https://www.haaretz.com/israel-news/.premium.MAGAZINE-i-was-a-girl-but-no-one-knew-the-incredible-story-of-rina-a-trans-fourth-grader-1.8845974)  published by a daily newspaper, where the approach of the feminist  psychologists who accompany the child was presented to the public as the  triumph of light over darkness. Only in a marginal note, made by one feminist interviewee, was the removal from office and academic exiling of some anonymous villain from Canada mentioned, leaving the impression of a successful  capturing of a contemporary Josef Mengele. The transitioned child was  later[ put on stage in front of a crowd of thousands](https://www.pinknews.co.uk/2020/05/15/trans-girl-nine-haaretz-israel-supportive-parents-gender-affirming/), who gathered following the publication to support the victory of progress and morality. \n\nThe second decade of the 2000s saw a  shift in the status of gender studies departments, from being in  discourse with science, to constituting a managerial body in a position  of control over science, including medicine and psychology. This change,  which placed gender studies and all the groups surrounding it as the  highest ruling body governing science – the role that the Catholic  Church and the Inquisition had over science in the Dark Ages – was  revealed in [an article published in late 2018 in the journal Nature](https://www.nature.com/articles/d41586-018-07238-8),  the most important of scientific journals, the crown of science. It was  written as an editorial. The piece focused on the scientific definition  of sex, and explained in a style appropriate for a blog that the notion  of two genetically distinguishable sexes “has no basis in science.” It  articulated, without citing a source, a statement designed to make the  ordinary reader understand that 1% of humanity has “differences” that do  not allow sex to be determined as male or female, with the sentence  being constructed such that the unscientific reader will understand “1%”  while those responsible for this text could quickly dispose of their  “1%” by pointing to the words “some of which” hidden in the sentence, in  case a scientist demands explanations for this error. The figure 1% is  incorrect – every biology graduate knows that there are very few and  extremely rare disorders occurring during fertilization, which create a  chromosomal array of an atypical chromosomal sex (namely XYY syndrome),  with other rare disorders being characterized by a completely normal  chromosomal sex with reproductive organs that do not express this  definitive chromosomal sex due to a dysfunction during the fetal  development, and that[ all of these phenomena are estimated at tens of cases per million and up to 200 cases per million people](https://www.researchgate.net/profile/Inas_Mazen/publication/43227152_Screening_of_Genital_Anomalies_in_Newborns_and_Infants_in_Two_Egyptian_Governorates/links/561d21cf08aef097132b1a8c.pdf)  – far from 1% of the population which would amount to 10,000 per  million. The inferences made in the arguments of the editorial  repeatedly referred to anecdotal cases or described situations in a  biased manner which is easily responded to, but the general public would  not know how to do so and the writers relied on that. Going through  this editorial would remind the reader of a familiar tone – this is a  typical article coming from the Department of Gender Studies. The  article was written by the censor. \n\nThe convoluted argumentation, the  repression of data, the dogmatism of first proclaiming a truism and then  considering findings in a biased manner with a primary goal of reaching  the predefined conclusion at all cost – thus using science as no more  than a propaganda device for predetermined beliefs – these are no longer  the methods of a division within academy that was battering science for  decades. When these practices appear in the editorial of the most  important scientific publication of our time, it is evident where does  the censorship is coming from: those who apply these methods are now a  power governing science. The impact of feminism and the groups  surrounding it is not marginal. It no longer criticizes science. It  controls it, and it does so through the most important positions of  leadership, put under threat of violence including ostracism. The  control is complete or very close to that – by imposing censorship, by  dictating restrictions, and primarily by spreading fear. Identity  politics groups who gathered under the feminist umbrella are firmly  involved – deleting the sex chapter from science and rewriting it  according to feminist groups beliefs, with threats to cancel open  discussion about data and using violence to dictate the correct beliefs.  It is hard to estimate how many critical studies are not being  conducted out of fear of a fate similar to that of Prof. Kenneth Zucker,  and the damage of this atmosphere, of terror and deceit, to scientists,  to policies that affect lives, and to the human aspiration to achieve a  humane society.",
    "title": "Science Plus Violence Equals Silence: The Gender Church Equation",
    "subreddit": "MensRights",
    "timestamp": 1614662346,
    "score": 10,
    "keyword": "brown principal"
  }
]