[
  {
    "text": "Anonymous writings of a covid nurse - part 2 *One…two…three…four…five…six…seven….*\n\nIt takes me exactly three hundred and eighty-seven steps to walk the entire loop of my unit and arrive back where I started. I should know…I’ve counted it hundreds of times by now.\n\nBack in the days before when I could find the time, I would toss my Vocera at any willing coworker and meander around campus for fifteen minutes or so to get a break from the demands of being a bedside nurse. I’d wander outside to the employee patio and get a glimpse of the sky, sit next to the fountain, enjoy the sun a bit. Maybe pick my way through the gift shop and buy some trinket to bring home to my daughter. Sometimes I’d go visit my friends that had transferred to other floors. Such social calls were normal back then. It wasn’t always possible of course, but before all of this it was possible to find the time more often than it wasn’t.\n\nIt started with a single patient at first. Then it was two. Six. Fourteen. They’ll only be placed in negative pressure rooms, it was announced. That lasted for approximately five days. Then any positive case requiring less than six LPM were allowed in standard rooms. Thirty-five. We can handle it, our CEO proclaimed. There were plans in place. Fifty-three. Elective procedures were cancelled. PPE was short, you’ll need to reuse your N95. Place it in this brown paper bag and keep it on your iso carts. Nono, it’s perfectly safe, probably. Seventy-nine. Units were locked. Patient loads were getting top-heavy and cumbersome to manage. Incentive pay was announced. Then increased. Then increased again. One hundred and four. “Heroes work here” signs. Codes overhead every hour, the sickening feeling of ribs breaking under your hands. Exhaustion. Difficulty sleeping. Two hundred and twenty-two. So many stroke alerts. The sound of families sobbing over Zoom as their loved ones gasped their last breaths. Two hundred and fifty-four. Will this fucking pager ever *stop beeping.* Single rooms are now doubles, a Black Friday two for one. Two hundred and ninety-nine. Coworkers are getting sick at an alarming rate. Anna’s on the vent in MICU waitlisted to be transferred to a different facility for ECMO because we’re at capacity. Chris was just admitted, he’s on IMCU riding the vapotherm and looking like shit. Three hundred and thirty-one. Blistered feet. Nine days in a row and three more on the schedule. Crash intubation after crash intubation. The claustrophobic feeling of drowning in patients, tasks, and dexamethasone. Three hundred and eighty-eight. Bleeding cuticles, grinding teeth without noticing until your jaw aches. How can this continue? How can this…how….\n\n…\n\nAnd just when I thought this whole godforsaken house was about to collapse, it began to ease.\n\nI took to pacing my locked unit like a caged tiger after the last wave crested, turning corner after corner within the same four walls. There was still no time for campus walks anymore, and we were forbidden that sort of freedom of movement anyway. But by then it felt like a cardinal sin to sit down and do nothing. Returning to some semblance of normal didn’t quite feel normal to me yet. Instead, my usual fifteen minute cool-down period had turned into a way to expend bottled anxiety and energy.\n\n“Getting your steps in, Taylor?” my coworkers would ask.\n\nI’d fake a smile, nod, and keep going.\n\nTwo hundred and five. I cut down to a normal amount of overtime. One hundred and seventy-one. My arm hurt like a motherfucker after that vaccine. Ninety-eight. Electives resumed. Sixty. Floors were converted back to their original service designations. Fourty-four. My dad, full of optimism and synthetic mRNA, visited for the first time in eleven months. We drank a beer on the patio and laughed at the absurdity of the cardboard cutout fans in the stands of the game we were watching. Twenty-seven.\n\nIt’s oddly quiet around here now. The amount of emails I receive from administration have dropped off precipitously. During the surge, I would count the number of red-orange covid isolation signs taped to the doors on my daily prowls. At one point they adorned every single room.\n\nToday, I count three.\n\nIt feels as if the dust has settled a bit. The place looks normal but has the same palpable tension as an empty street, littered with the broken glass and spent tear-gas cannisters that inevitably follow a riot. We may have swept the debris into the gutters, but the memory of the event hangs in the air like the lingering scent of sulphur. The faces of my colleagues are no longer so worn. We’re all dealing with what we’ve seen in different ways. Some are dealing better than others. Some aren’t dealing with it at all. A stoic few deny there’s anything to deal with in the first place. This is what we do, they scoff. This is what we’re here for.\n\nI don’t know where I fall on this spectrum.\n\n“Try not to focus on all the lost causes,” my favorite tech instructs me after we rambled a bit on the topic at lunch. “I mean…have you thought about all the ones we saved?”\n\nI pause. It’s so easy to focus on the negative that I’m ashamed to admit I haven’t.\n\n“What about that one guy that was in bed 3 forever?” she continues. “You discharged him on New Year’s Day. He’d been on a vent for like two weeks. That was pretty amazing.”\n\nIt was, I agree.\n\n“And remember Mrs. Graham, or Garman, or…whatever her name was. She was here for over 90 days and walked out under her own power without oxygen.”\n\nI must have taken care of her at least a dozen times or better and I’d completely forgotten about her. Unbelievable.\n\nI spend the remainder of my two scheduled shifts catching my coworkers during lulls and asking them about their saves, too. Ashley tells me about Mr. Sacks who she discharged to LTACH. He’s walking now, she quips. Casey reminds me of another patient who was able to have their trach and PEG discontinued before leaving. That guy that had the stroke while SAPed? We thought he’d leave in a body bag but he’s back to work. And we all remember our most memorable case, a failed compassionate extubation that sent a freakin’ Christmas card to the staff after breezing through rehab.\n\nThe stories start piling up. Five. Twelve. Twenty-eight. I stop counting and catch myself smiling, feeling lighter than I have in a year.\n\nIt’s unrealistic to think that any of us will ever be exactly the same as we were before living through these times. God knows I won’t. But at least now, I can view these memories like a coin. One side contains all of the anger, the hurt, and the sheer misery that we were forced to stomach as we performed our duties. But the other? It holds the precious victories, the joy we saw on our patient’s faces as they left our facility. The times we went toe to toe with death and won.\n\nI’m back at work tomorrow morning. Maybe I’ll skip down to the fountain, take my mask off, and sit for a bit. It's past time to see if things still looks the same.",
    "title": "Anonymous writings of a covid nurse - part 2",
    "subreddit": "medicine",
    "timestamp": 1618002070,
    "score": 1180,
    "keyword": "brown ceo"
  },
  {
    "text": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans] Noticeably absent:\n\n* University of Texas - Austin\n* Fordham\n* Iowa\n* Alabama\n* George Mason\n* Baylor\n* Notre Dame\n* Texas A&M\n* Kansas\n\n&#x200B;\n\n&#x200B;\n\n[https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/](https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/)\n\nJanuary 12, 2021\n\nLaw Deans Joint Statement on the 2020 Election and Events at the Capitol\n\n&#x200B;\n\nWe are deans of a diverse range of law schools across the country. We do not use our positions to advance our individual views. But we do have an obligation to support the rule of law and preserve the integrity of the legal profession. On rare occasions, despite our differing situations and views, that obligation requires us to speak as one to defend the fundamental commitments of our profession. This is such a moment.\n\nThe violent attack on the Capitol was an assault on our democracy and the rule of law. The effort to disrupt the certification of a free and fair election was a betrayal of the core values that undergird our Constitution. Lives were lost, the seat of our democracy was desecrated, and our country was shamed.\n\nMany lawyers and judges worked honestly and in good faith, often in the face of considerable political pressure, to ensure the 2020 election was free and fair. However, we recognize with dismay and sorrow that some lawyers challenged the outcome of the election with claims that they did not support with facts or evidence. This betrayed the values of our profession. Our profession demands that when lawyers pursue legal action, they must bring claims in good faith, grounded in facts and evidence, and demonstrate respect for the legal system. Only then can lawyers fulfill their responsibilities as lawyers and public citizens to promote public confidence in the rule of law and the justice system — duties that extend to all professional activities, whether lawyers are representing a client or not. The rule of law is as much a touchstone of our profession as it is of our Constitution.\n\nAs law deans, our mission is to train the next generation of leaders to uphold the core values of our profession and sustain the rule of law. This should be a moment of reflection for legal educators and members of the legal profession. A sustained effort will be necessary to repair and preserve our precious democratic institutions. As legal educators and lawyers ourselves, we must redouble our efforts to restore faith in the rule of law and the ideals of the legal profession. We have enormous faith in the law’s enduring values and in our students, who will soon lead this profession. We call upon all members of the legal profession to join us in the vital work ahead.\n\n&#x200B;\n\nSigned,\n\n^(Alicia Ouellette President and Dean Albany Law School)\n\n^(Robert Dinerstein Acting Dean and Professor of Law American University, Washington College of Law)\n\n^(Jace C. Gatewood Dean and CEO Atlanta's John Marshall Law School)\n\n^(Melanie Leslie Dean and Samuel Belkin Professor of Law Benjamin N. Cardozo School of Law, Yeshiva University)\n\n^(Vincent Rougeau Dean and Professor Boston College Law School)\n\n^(Angela Onwuachi-Willig Dean and Professor of Law Boston University School of Law)\n\n^(Michael T. Cahill President, Joseph Crea Dean & Professor of Law Brooklyn Law School)\n\n^(Sean M. Scott President and Dean California Western School of Law)\n\n^(Reynaldo Anaya Valencia Dean and Professor of Law Capital University Law School)\n\n^(Anita K. Krug Dean and Professor Chicago-Kent College of Law, Illinois Institute of Technology)\n\n^(Charles H. Rose III Dean and Professor of Law Claude W. Pettit College of Law, Ohio Northern University)\n\n^(Lee Fisher Dean and Joseph C. Hostetler-BakerHostetler Chair in Law Cleveland-Marshall College of Law, Cleveland State University)\n\n^(Gillian Lester Dean and Lucy G. Moses Professor of Law Columbia Law School)\n\n^(Jens David Ohlin Interim Dean & Professor of Law Cornell Law School)\n\n^(Joshua P. Fershée Dean and Professor of Law Creighton University School of Law)\n\n^(Henry C. Strickland Dean Cumberland School of Law, Samford University)\n\n^(Mary Lu Bilek Dean and Professor of Law CUNY School of Law)\n\n^(Rodney A. Smolla Dean & Professor of Law Delaware Law School, Widener University)\n\n^(Jennifer Rosato Perea Dean and Professor DePaul University College of Law)\n\n^(Jerry L. Anderson Dean and Richard M. and Anita Calkins Distinguished Professor of Law Drake University Law School)\n\n^(Kerry Abrams James B. Duke and Benjamin N. Duke Dean and Professor of Law Duke University School of Law)\n\n^(April M. Barton Dean and Professor of Law Duquesne University School of Law)\n\n^(Horace Anderson Dean and Professor of Law Elisabeth Haub School of Law, Pace University)\n\n^(Luke Bierman Dean and Professor of Law Elon University School of Law)\n\n^(Mary Anne Bobinski Dean and Asa Griggs Candler Professor of Law Emory University School of Law)\n\n^(Deidré A. Keller Dean and Professor of Law Florida Agricultural and Mechanical University College of Law)\n\n^(C. Peter Goplerud Dean and Professor of Law Florida Coastal School of Law)\n\n^(Antony Page Dean & FIU Foundation Professor of Law Florida International University College of Law)\n\n^(Erin O’Hara O'Connor Dean and McKenzie Professor of Law Florida State University College of Law)\n\n^(William M. Treanor Dean & Executive Vice President Georgetown Law)\n\n^(Leslie E. Wolf Interim Dean and Distinguished University Professor Georgia State University College of Law)\n\n^(Eric C. Christiansen Dean of the Law School (Interim, 2020-21), Professor of Law Golden Gate University, School of Law)\n\n^(Jacob Rooksby Dean and Professor of Law Gonzaga University School of Law)\n\n^(John F. Manning Morgan and Helen Chu Dean and Professor of Law Harvard Law School)\n\n^(Danielle Holley-Walker Dean and Professor of Law Howard University School of Law)\n\n^(Austen Parrish Dean and James H. Rudy Professor of Law Indiana University Maurer School of Law)\n\n^(Karen E. Bravo Dean and Professor of Law Indiana University Robert H. McKinney School of Law)\n\n^(Gordon Smith Dean and Woodruff J. Deem Professor of Law J. Reuben Clark Law School at Brigham Young University)\n\n^(Jennifer J. Johnson Dean and Erskine Wood Sr. Professor of Law Lewis and Clark Law School)\n\n^(Matthew R. Lyon Vice President & Dean Lincoln Memorial University Duncan School of Law)\n\n^(Colin Crawford Dean and Professor of Law Louis D. Brandeis School of Law, University of Louisville)\n\n^(Lee Ann Wheelis Lockridge Interim Dean and Professor of Law Louisiana State University Law Center)\n\n^(Michael Waterstone Dean and Professor of Law Loyola Law School, Los Angeles)\n\n^(Michael J. Kaufman Dean and Professor of Law Loyola University Chicago School of Law)\n\n^(Madeleine M. Landrieu Dean and Judge Adrian G. Duplantier Distinguished Professor of Law Loyola University New Orleans College of Law)\n\n^(Gail Prudenti Dean Maurice A. Deane School of Law at Hofstra University)\n\n^(Cathy Cox Dean and Professor of Law Mercer University School of Law)\n\n^(Lincoln L. Davies Dean & Frank R. Strong Chair in Law Michael E. Moritz College of Law, The Ohio State University)\n\n^(Melanie B. Jacobs Interim Dean & Professor of Law Michigan State University College of Law)\n\n^(Patricia Bennett Dean & Professor of Law Mississippi College School of Law)\n\n^(Anthony Niedwiecki President and Dean Mitchell Hamline School of Law)\n\n^(Anthony W. Crowell Dean and President New York Law School)\n\n^(Trevor Morrison Dean and Eric M. and Laurie B. Roth Professor of Law New York University School of Law)\n\n^(James Hackney Dean and Professor of Law Northeastern University School of Law)\n\n^(James Speta Interim Dean Northwestern Pritzker School of Law)\n\n^(José Roberto (Beto) Juárez, Jr. Dean and Professor of Law Nova Southeastern University Shepard Broad College of Law)\n\n^(Jim Roth Dean and Professor of Law Oklahoma City University School of Law)\n\n^(Danielle M. Conway Dean and Donald J. Farage Professor of Law Penn State Dickinson Law)\n\n^(Hari M. Osofsky Dean, Penn State Law and Penn State School of International Affairs Distinguished Professor of Law, Professor of International Affairs, and Professor of Geography)\n\n^(Paul L. Caron Duane and Kelly Roberts Dean and Professor of Law Pepperdine University Rick J. Caruso School of Law)\n\n^(Jennifer Gerarda Brown Dean and Professor of Law Quinnipiac University School of Law)\n\n^(Gregory W. Bowman Dean & Professor of Law Roger Williams University School of Law)\n\n^(David Lopez Co-Dean & Professor of Law Rutgers Law School)\n\n^(Kimberly M. Mutcherson Co-Dean & Professor of Law Rutgers Law School)\n\n^(Elizabeth Kronk Warner Dean S.J. Quinney College of Law, University of Utah)\n\n^(William P. Johnson Dean and Professor of Law Saint Louis University School of Law)\n\n^(Judith Daar Ambassador Patricia L. Herbold Dean and Professor of Law Salmon P. Chase College of Law, Northern Kentucky University)\n\n^(Douglas J. Sylvester Dean and Professor of Law Sandra Day O’Connor College of Law at Arizona State University)\n\n^(Anna M. Han Interim Dean Santa Clara University School of Law)\n\n^(Martin H. Brinkley Dean and Arch T. Allen Distinguished Professor School of Law, University of North Carolina at Chapel Hill)\n\n^(Annette E. Clark Dean and Professor of Law Seattle University School of Law)\n\n^(Kathleen M. Boozang Dean and Professor of Law Seton Hall University School of Law)\n\n^(Jennifer M. Collins Judge James Noel Dean and Professor of Law SMU Dedman School of Law)\n\n^(Susan Westerberg Prager President and Dean Southwestern Law School)\n\n^(Michael A. Simons Dean and John V. Brennan Professor of Law St. John’s University School of Law)\n\n^(Jenny S. Martinez Richard E. Lang Professor of Law & Dean Stanford Law School)\n\n^(Michèle Alexandre Dean and Professor of Law Stetson University College of Law)\n\n^(Andrew Perlman Dean & Professor of Law Suffolk University Law School)\n\n^(Craig M. Boise Dean and Professor of Law Syracuse University College of Law)\n\n^(Gregory N. Mandel Dean & Peter J. Liacouras Professor of Law Temple University, Beasley School of Law)\n\n^(Dayna Bowen Matthew Dean and Harold H. Greene Professor of Law The George Washington University Law School)\n\n^(Christopher J. (C.J.) Peters Dean and C. Blake McDowell, Jr. Professor of Law The University of Akron School of Law)\n\n^(Thomas J. Miles Dean and Clifton R. Musser Professor of Law and Economics The University of Chicago Law School)\n\n^(Katharine Traylor Schaffzin Dean & Professor of Law The University of Memphis Cecil C. Humphreys School of Law)\n\n^(Sergio Pareja Dean The University of New Mexico School of Law)\n\n^(Benjamin Barros Dean and Professor of Law The University of Toledo College of Law)\n\n^(Lyn Suzanne Entzeroth Dean and Dean John Rogers Endowed Chair The University of Tulsa College of Law)\n\n^(Daniel M. Filler Dean and Professor of Law Thomas R. Kline School of Law, Drexel University)\n\n^(David D. Meyer Dean and Mitchell Franklin Professor of Law Tulane University Law School)\n\n^(Theresa Beiner Dean & Nadine Baum Distinguished Professor of Law UA Little Rock William H. Bowen School of Law)\n\n^(Kevin R. Johnson Dean UC Davis School of Law)\n\n^(Jennifer L. Mnookin Dean and Ralph and Shirley Shapiro Professor of Law UCLA School of Law)\n\n^(Darby Dickerson Dean and Professor of Law UIC John Marshall Law School, The University of Illinois at Chicago)\n\n^(Barbara Glesner Fines Dean & Rubey M. Hulen Professor of Law UMKC School of Law)\n\n^(Aviva Abramovsky Dean and Professor of Law University at Buffalo School of Law, The State University of New York)\n\n^(Marc L. Miller Dean & Ralph W. Bilby Professor of Law University of Arizona James E. Rogers College of Law)\n\n^(Margaret Sova McCabe Dean & Professor of Law University of Arkansas School of Law)\n\n^(Ronald Weich Dean and Professor of Law University of Baltimore School of Law)\n\n^(David L. Faigman Chancellor & Dean and John F. Digardi Distinguished Professor of Law University of California Hastings College of the Law)\n\n^(Erwin Chemerinsky Dean and Jesse H. Choper Distinguished Professor of Law University of California, Berkeley School of Law)\n\n^(L. Song Richardson Dean and Chancellor’s Professor of Law University of California, Irivine School of Law)\n\n^(Verna L. Williams Dean and Nippert Professor of Law University of Cincinnati College of Law)\n\n^(S. James Anaya Dean and University Distinguished Professor University of Colorado Law School)\n\n^(Eboni S. Nelson Dean and Professor of Law University of Connecticut School of Law)\n\n^(Andrew Strauss Dean and Professor of Law University of Dayton School of Law)\n\n^(Bruce P. Smith Dean and Professor of Law University of Denver Sturm College of Law)\n\n^(Phyllis L. Crocker Dean and Professor of Law University of Detroit Mercy School of Law)\n\n^(Laura Ann Rosenbury Dean and Levin, Mabie & Levin Professor of Law University of Florida Levin College of Law)\n\n^(Peter B. Rutledge Dean University of Georgia School of Law)\n\n^(Camille A. Nelson Dean and Professor of Law University of Hawai‘i at Mānoa, William S. Richardson School of Law)\n\n^(Leonard M. Baynes Dean and Professor of Law University of Houston Law Center)\n\n^(Jerrold Long Dean and Professor of Law University of Idaho College of Law)\n\n^(Vikram David Amar Dean and Iwan Foundation Professor of Law University of Illinois College of Law)\n\n^(Mary J. Davis Dean and Ashland-Spears Distinguished Research Professor of Law University of Kentucky J. David Rosenberg College of Law)\n\n^(Daniel W. Hamilton Dean & Richard J. Morgan Professor of Law University of Las Vegas, William S. Boyd School of Law)\n\n^(Donald B. Tobin Dean and Professor of Law University of Maryland Francis King Carey School of Law)\n\n^(Eric J. Mitnick Dean & Professor of Law University of Massachusetts School of Law)\n\n^(Anthony E. Varona Dean and M. Minnette Massey Professor of Law University of Miami School of Law)\n\n^(Mark D. West Dean and Nippon Life Professor of Law University of Michigan Law School)\n\n^(Garry W. Jenkins Dean & William S. Pattee Professor of Law University of Minnesota Law School)\n\n^(Susan H. Duncan Dean and Professor of Law University of Mississippi)\n\n^(Lyrissa Lidsky Dean & Judge C.A. Leedy Professor of Law University of Missouri School of Law)\n\n^(Richard Moberly Dean and Richard C. & Catherine S. Schmoker Professor of Law University of Nebraska College of Law)\n\n^(Megan Carpenter Dean and Professor of Law University of New Hampshire Franklin Pierce School of Law)\n\n^(Michael S. McGinniss Dean and Professor of Law University of North Dakota School of Law)\n\n^(Katheleen R. Guzman Interim Dean and Professor University of Oklahoma College of Law)\n\n^(Marcilynn A. Burke Dean and Dave Frohnmayer Chair in Leadership and Law University of Oregon School of Law)\n\n^(Theodore W. Ruger Dean and Bernard G. Segal Professor of Law University of Pennsylvania Carey Law School)\n\n^(Amy J. Wildermuth Dean and Professor of Law University of Pittsburgh School of Law)\n\n^(Vivian I. Neptune Dean University of Puerto Rico School of Law)\n\n^(Wendy C. Perdue Dean and Professor of Law University of Richmond School of Law)\n\n^(Robert Schapiro Dean and Professor of Law University of San Diego School of Law)\n\n^(Susan H. Freiwald Dean and Professor of Law University of San Francisco School of Law)\n\n^(William C. Hubbard Dean and Professor of Law University of South Carolina School of Law)\n\n^(Neil Fulton Dean University of South Dakota Knudson School of Law)\n\n^(Andrew T. Guzman Dean and Carl Mason Franklin Chair in Law, and Professor of Law and Political Science University of Southern California Gould School of Law)\n\n^(Robert K. Vischer Dean and Mengler Chair in Law University of St. Thomas School of Law)\n\n^(Douglas Blaze Interim Dean and Art Stolnitz and E.O. Overton Professor of Law University of Tennessee College of Law)\n\n^(Renée McDonald Hutchins Dean & Rauh Chair of Public Interest Law University of the District of Columbia David A. Clarke School of Law)\n\n^(Michael Hunter Schwartz Dean and Professor of Law University of the Pacific, McGeorge School of Law)\n\n^(Risa Goluboff Dean and Arnold H. Leon Professor of Law and Professor of History University of Virginia School of Law)\n\n^(Mario L. Barnes Toni Rembe Dean and Professor of Law University of Washington School of Law)\n\n^(Daniel P. Tokaji Fred W. & Vi Miller Dean and Professor of Law University of Wisconsin Law School)\n\n^(Klint Alexander Dean and Professor of Law University of Wyoming College of law)\n\n^(Chris Guthrie Dean Vanderbilt Law School)\n\n^(Thomas McHenry President and Dean Vermont Law School)\n\n^(Mark C. Alexander Arthur J. Kania Dean and Professor of Law Villanova University Charles Widger School of Law)\n\n^(Jane H Aiken Dean and Professor of Law Wake Forest Law School)\n\n^(Carla D. Pratt Dean and Professor of Law Washburn University School of Law)\n\n^(Brant J. Hellwig Dean and Professor of Law Washington and Lee University School of Law)\n\n^(Nancy Staudt Dean and Howard & Caroline Cayne Distinguished Professor of Law Washington University School of Law)\n\n^(Richard A. Bierschbach Dean and Professor of Law Wayne State University Law School)\n\n^(James McGrath Dean and President Western Michigan University Cooley Law School)\n\n^(Sudha Setty Dean and Professor of Law Western New England University School of Law)\n\n^(Allen K. Easley Dean & Professor of Law Western State College of Law at Westcliff University)\n\n^(Brian Gallini Dean & Professor of Law Willamette University College of Law)\n\n^(A. Benjamin Spencer Dean & Chancellor Professor William & Mary Law School)\n\n^(John E. Taylor Interim Dean and Jackson Kelly Professor of Law WVU College of Law)\n\n^(Heather K. Gerken Dean and Sol & Lillian Goldman Professor of Law Yale Law School)",
    "title": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans]",
    "subreddit": "LawSchool",
    "timestamp": 1610491035,
    "score": 15,
    "keyword": "brown ceo"
  }
]