[
  {
    "text": "People that have been on Court Drama shows (Judge Judy, Peoples Court, Joe Brown etc), why and how did you end up doing so?",
    "title": "People that have been on Court Drama shows (Judge Judy, Peoples Court, Joe Brown etc), why and how did you end up doing so?",
    "subreddit": "AskReddit",
    "timestamp": 1681110558,
    "score": 1,
    "keyword": "brown judge"
  },
  {
    "text": "brown discharge after ending sex drought so i’m 29, i have an iud, i don’t consistently get my period or spotting usually. i thiiiink it’s maybe around the time i would possibly spot so maybe it’s just “old blood”… but it’s been strangely inconsist. however there’s more! \n\ni had penetrative sex for the first time in 9 months (and before that 6 years) a few days before the brown discharge started. \n\ni kinda assume it’s my body being like wtf? but what are your thoughts?? \n\nalso…..don’t judge, but do you think having sex with this discharge is ok??",
    "title": "brown discharge after ending sex drought",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1699414419,
    "score": 0,
    "keyword": "brown judge"
  },
  {
    "text": "I’m getting social anxiety from non-black people hiding their bags / phones when I am around I’m not sure how to let go of this anxiety and feel more at ease in public when I am out alone. \n\nIt is mostly white and asian women who do this. I feel it’s really unfair for them to have the power to make me feel out of place / unwanted. \n\nI am always hyper aware of my body language and positioning relative to others. While in public I am constantly thinking about how I can look less threatening and I feel uncomfortable in my own skin while out. As a result, I think I am looking at people more intensely to gauge their reactions.\n\n\nFor context, I am a dark brown, attractive girl in my 20s. I dress well, quite chic and often wear designer bags and clothes. I often have makeup on. I don’t think it’s that I look sketchy, it’s just that people see dark skin and judge right away. Unfortunately in the city I live in most all of the homeless people are black so I even catch myself being on guard around other black people on occasion. \n\nI’d appreciate any tips on letting go of the anxiety so I can feel relaxed in public and 100% myself. I asked a few black friends and they said they’re pretty aloof and don’t pay attention to this.\n\na few examples:\n\n- I’m walking down the street, someone passing me will look up and see me and either put their phone away, grip their bag, or eye me until we pass as if to watch for any sudden movement \n\n- when I join a line at checkout or for a bathroom, someone hides their phone or moves their cross body bag to their front side or back side so it’s further than me. once I was in the check out line at zara and turned around to see how much longer the line was. the woman behind me was busy texting and quickly put her phone away and started eyeing me",
    "title": "I’m getting social anxiety from non-black people hiding their bags / phones when I am around",
    "subreddit": "blackladies",
    "timestamp": 1693844898,
    "score": 37,
    "keyword": "brown judge"
  },
  {
    "text": "Dealing with with racial insecurity / hypervigilance 31M gay desi guy living in a progressive/liberal US city here. I have faced a lot of racism (ranging from overt to casual/microaggressions) in my life and it has caused me a lot of CPTSD and stress. This has lead me to being very hypervigilant and insecure about my race.\nI’m already doing therapy but thought might wanna ask here.\n\nMy insecurity is less about “I am ashamed to be brown” but more about “I wish I didn’t have to go deal with all the cultural stereotype baggage”. More examples of triggers include:\n\n- Everytime I am in diverse group of people, I automatically put myself in some sort of social hierarchy. E.g. if I meet a hot white guy, I’ll automatically assume they won’t be into me or that I’d be judged for my skin color\n\n- I watch a movie/TV show set in Europe or hear friends talking about how London/Barcelona is so beautiful and fun and instantly wonder why can’t people talk the same about India (versus the usual stereotypes of poverty, pollution, casteism. India is beautiful, it has some of the most stunning landscapes and historical sites in the world)\n\n- I meet a non-Indian person and they instantly tell me about how they have an Indian coworker who got an arranged marriage or an gay Indian friend who is married but closeted (I don’t make any assumptions when I meet a white person, for e.g. that they have 4 step parents or that their parents are racists)",
    "title": "Dealing with with racial insecurity / hypervigilance",
    "subreddit": "asianamerican",
    "timestamp": 1684296201,
    "score": 14,
    "keyword": "brown judge"
  },
  {
    "text": "A father lamented that he was \"strong armed\" by the judge and the other parent's attorney to drop a year long contempt action for parenting time violations. He has not seen his child in five years. A father lamented that he was \"strong armed\" by the judge and the other parent's attorney to drop a year long contempt action for parenting time violations. He has not seen his child in five years.\n\nI'm not an attorney and this is not legal advice.\n \nYou wrote:\n\n(Above)\n\nI would consider a motion to recuse the judge.\n\n> Liteky v. United States, 510 U.S. 540 (1994)\n\n> 28 U.S.C. §455(a) requires recusal of a judge in any proceeding in which his impartiality may be questioned.\n\n> https://casetext.com/analysis/judges-motion-to-recuse-removal-on-remand\n\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n> Complaints Against Lawyers\n\n> The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.\n\n> https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n> Model Rules of Professional Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/\n\nIf any judge or person exercising judicial decision making authority and subject to the judicial code of conduct (e.g. some Title IV-D child support etc. employees or Title IV-E child welfare employees who make judicial recommendations such as child placement, child custody, parenting time, or child support calculations), they may also be subject to complaints under this process, even if they are not attorneys. \n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n> Model Code of Judicial Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>  How to File a Grievance\n\n> http://jtc.courts.mi.gov/file_a_grievance/index.php\n\nThe United States pays your state's Title IV-D agency to enforce parenting time through federal grants.\n\nFailure of your state's Title IV-D agency to provide parenting time enforcement for five years:\n\nPossible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.efdu/wex/fraud\n\nPossible:\n\n> 18 U.S. Code § 242 - Deprivation of rights under color of law\n\n> https://www.law.cornell.edu/uscode/text/18/242\n\nPressure by agency employees to prevent you from using parenting time services may be:\n\n> Extortion\n\n> Forcing action or obtaining something by illegal means.  Anyone may commit extortion through force or coercion.  A public or private official may also commit extortion under the color of office.\n\n> https://www.law.cornell.edu/wex/extortion\n\nPossibly defrauding the United States:\n\n> If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both.\n\n> 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States\n\n> https://www.law.cornell.edu/uscode/text/18/371\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code §241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nPossible cause for a federal civil rights action or lawsuit under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nAs  a consumer of services by the court or the agency:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nIf the agency or court is discriminating against employees on the basis of sex or association with parents of a sex which it may be systematically defrauding:\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\nGeneral civil rights:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A father lamented that he was \"strong armed\" by the judge and the other parent's attorney to drop a year long contempt action for parenting time violations. He has not seen his child in five years.",
    "subreddit": "MensRights",
    "timestamp": 1698406068,
    "score": 47,
    "keyword": "brown judge"
  },
  {
    "text": "A dad wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing dad and attempting to force dad to agree to an arrangement which he feels is not fair to him and his child. A dad wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing dad and attempting to force dad to agree to an arrangement which he feels is not fair to him and his child.\n\nHere is my response in the hopes that it helps other parents and their children to better advocate for faithful mediation, and that it may protect children from child abuse to which they are at greater risk when they don't have a relationship with both loving parents.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing you and attempting to force you to agree to an arrangement which you feel is not fair to you and your child.\n\nPlease consider:\n\n> What Is a Court Ordered Mediation?\n\n> In legal terms, ‘mediation’ is a type of alternative dispute resolution that can help resolve conflicts and avoid litigation. Parties to a lawsuit or domestic matter (such as a divorce or a child custody case) can choose to go to mediation to work out an agreement. In some cases, however, a court may direct the litigants to attend one or more sessions with an approved mediator. This is called court-ordered mediation.\n\n> Is Court-Ordered Mediation Mandatory and Binding?\n\n> If a judge orders the parties to a lawsuit to attend mediation, they must obey and attempt the process in ‘good faith.’ As with any other judicial order, a party that fails to comply with a court order directing mediation can be held in ‘contempt of court.’ Penalties for contempt can include fines and jail time.\n\n> The Law Dictionary\n\n> https://thelawdictionary.org/article/court-ordered-mediation/\n\nAnd:\n\n> Nature of the Process\n\n> Mediation is a process wherein the parties meet with a mutually selected impartial and neutral person who assists them in the negotiation of their differences.\n\n> Role of the Mediator: What does a Mediator do?\n\n> Mediation leaves the decision power totally and strictly with the parties. The mediator does not decide what is \"fair\" or \"right,\" does not assess blame nor render an opinion on the merits or chances of success if the case were litigated. Rather, the mediator acts as a catalyst between opposing interests attempting to bring them together by defining issues and eliminating obstacles to communication, while moderating and guiding the process to avoid confrontation and ill will. The mediator will, however, seek concessions from each side during the mediation process.\n\n> https://www.jamsadr.com/mediation-defined/\n\nI would gather as much evidence as possible. I would explain my view that neither the mediator nor the other person are acting in good faith. \n\nI would consider communicating all of my concerns in writing. I might ask the court to replace this mediator with a different mediator whose actions I would believe are more consistent with their legal duties.\n\nThe mediator's actions may be:\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nMom and the mediator may be secretly working together against you and your child, and deceptively mispresenting the situation as legitimate mediation to the courts. This is:\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code §241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nI would consider filing a subpoena so that I can understand any or all of the ex-parte communications between the mediator and the other person.\n\nThe mediator's alleged attempts to force you to accept an agreement may not be in your child's interests. Also their attempts to prevent you from discussing relevant issues could be construed by you as attempt to create a false report to the court and in so doing, achieve a corrupt goal. Forcing you to go along under those conditions may be:\n\n> Extortion\n\n> Forcing action or obtaining something by illegal means.  Anyone may commit extortion through force or coercion.  A public or private official may also commit extortion under the color of office.\n\n> https://www.law.cornell.edu/wex/extortion\n\nIf this person is a social worker:\n\nThe National Association of Social Workers has a Code of Ethics:\n\n> https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English\n\nPossible misconduct by a social worker:\n\n> Social Workers:\n\n> How To File a Complaint\n\n> Steps for filing a request for professional review\n\n> NASW is very interested in reviewing situations that affect the integrity of our profession.\n\n> https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint\n\nIf the mediator knowingly files a false report to the court:\n\nPossible perjury:\n\n> 18 U.S. Code § 1621.Perjury generally\n\n> https://www.law.cornell.edu/uscode/text/18/1621\n\nAnyone may report the crime of perjury to the police.\n\nAnyone encouraging or instructing the mediator to not act honestly, and to then make false claims in court that their work is honest, may be guilty of:\n\n> 18 U.S. Code § 1622 - Subornation of perjury\n\n> Whoever procures another to commit any perjury is guilty of subornation of perjury, and shall be fined under this title or imprisoned not more than five years, or both.\n\n> https://www.law.cornell.edu/uscode/text/18/1622\n\nI would  be aware of the possibility that other parties may approve of or support these actions. If I had evidence that the judge in my case did so, I would consider a motion to recuse the judge.\n\n> Liteky v. United States, 510 U.S. 540 (1994)\n\n> 28 U.S.C. §455(a) requires recusal of a judge in any proceeding in which his impartiality may be questioned.\n\n> https://casetext.com/analysis/judges-motion-to-recuse-removal-on-remand\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nMisuse of the mediation process for illicit purposes is a possible cause for a federal civil rights action or lawsuit under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nAs a consumer of mediation and legal services:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nGeneral civil rights.\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A dad wrote about a biased mediator who is not actually attempting to mediate a dispute but rather is silencing dad and attempting to force dad to agree to an arrangement which he feels is not fair to him and his child.",
    "subreddit": "MensRights",
    "timestamp": 1694364900,
    "score": 42,
    "keyword": "brown judge"
  },
  {
    "text": "A father petitioned for custody of his child. The child was in danger in mom's custody, the authorities were aware of this danger, but they denied dad's petition for custody. The child later died in mom's custody. A father petitioned for custody of his child. The child was in danger in mom's custody, the authorities were aware of this danger, but they denied dad's petition for custody. The child later died in mom's custody.\n\nHere is my response in the hopes that it will help families who face injustices, and in the hopes that it will help parents to protect their children from child abuse.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote about a father who wanted custody of his child, the child was in danger in mom's custody, the authorities were aware of this danger, and denied dad custody. The child later died in mom's custody. (Anonymized)\n\nJudges often have judicial immunity for their decisions.\n\n> JUDICIAL IMMUNITY HAS BEEN EXPANDED TO INCLUDE JUDGES, TRADITIONAL QUASI-JUDICIAL INDIVIDUALS, AND SOME COURT-RELATED PERSONNEL, SUCH AS COURT CLERKS AND COURT REPORTERS\n\n> VARIOUS TYPES OF ACTS ARE NO LONGER RECOGNIZED AS JUDICIAL CONDUCT WITHIN THE PROTECTION OF IMMUNITY: (1) ACTS SHOWING LACK OF GOOD FAITH; (2) ACTS CRIMINAL IN NATURE; (3) ACTS IN ABSENCE OF AUTHORITY OR IN EXCESS OF JURISDICTION; AND (4) ACTS OF AN ADMINISTRATIVE OR MINISTERIAL NATURE. \n\n> OVERVIEW OF JUDICIAL IMMUNITY\n> US Department of Justice\n> Office of Justice Programs\n> https://www.ojp.gov/ncjrs/virtual-library/abstracts/overview-judicial-immunity\n\nIt is often the case that judges rely on Title IV-D funded child support agency to exercise judicial authority to make custody recommendations. (They sometimes literally give the agencies rubber stamps and allow them to make orders).\n\nSometimes these agencies focus on their own financial interests or have sexist biases which can impact their recommendations and decisions.\n\nCarol Rhodes is a whistleblower to described such wrongdoings:\n\n> Carol Rhodes Former FOC Enforcement Officer\n> Former Enforcement Officer and Investigator \n> https://www.youtube.com/watch?v=8M7cEi61W24\n\nIf dad was denied custody because of financial conflicts of interests or sexism:\n\nPossible failure to respect:\n\n> \"There is a fundamental right under the Fourteenth Amendment for a parent to oversee the care, custody, and control of a child.\"\n\n> Troxel v. Granville, 530 U.S. 57 (2000)\n\n> https://supreme.justia.com/cases/federal/us/530/57/\n\n> \"protection of civil rights\".\n\n> \"use of the reasonable and prudent parenting standard\"\n\n> 42 U.S. Code § 671\n\n> https://www.law.cornell.edu/uscode/text/42/671\n\nPossible cause for a federal civil rights action under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nMaking child custody recommendations using these biases rather than the factors mandated by law knowingly or through negligence may be possible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.edu/wex/fraud\n\nIntentionally endangering the life of a child through fraud may be depraved indifference.\n\n> To constitute depraved indifference, the defendant's conduct must be 'so wanton, so deficient in a moral sense of concern, so lacking in regard for the life or lives of others, and so blameworthy as to warrant the same criminal liability as that which the law imposes upon a person who intentionally causes a crime.\n\n> https://definitions.uslegal.com/d/depraved-indifference/\n\nFraud or other felonies which cause the death of victim may be:\n\n> As of August 2008, 46 states in the United States had a felony murder rule,[18] under which felony murder is generally first-degree murder. In 24 of those states, it is a capital offense.[19] When the government seeks to impose the death penalty on someone convicted of felony murder, the Eighth Amendment has been interpreted so as to impose additional limitations on the state power. The death penalty may not be imposed if the defendant is merely a minor participant and did not actually kill or intend to kill. However, the death penalty may be imposed if the defendant is a major participant in the underlying felony and exhibits extreme indifference to human life.[20]\n\n> https://en.wikipedia.org/wiki/Felony_murder_rule#United_States\n\nPlease note there is no statue of limitations on the crime of felony murder.\n\nA social worker worker who may have knowingly or negligently manufactured a false child custody recommendation may be abusing that child. In so doing they are failing to report their own abuse, or if they are aware of it, the abuse of their coworkers, a crime.\n\n> A person who, while engaged in a professional capacity or activity described in subsection (b) of section 226 of the Victims of Child Abuse Act of 1990 on Federal land or in a federally operated (or contracted) facility, or a covered individual as described in subsection (a)(2) of such section 226 who, learns of facts that give reason to suspect that a child has suffered an incident of child abuse, as defined in subsection (c) of that section, and fails to make a timely report as required by subsection (a) of that section, shall be fined under this title or imprisoned not more than 1 year or both.\n\n> 18 U.S. Code § 2258.Failure to report child abuse\n\n> https://www.law.cornell.edu/uscode/text/18/2258\n\nThe United States pays for the child support agencies under Title IV-D and that law requires protection of civil rights, including the rights of parents. Denying them those rights to get more federal funds is possibly defrauding the United States:\n\n> If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both.\n\n> 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States\n\n> https://www.law.cornell.edu/uscode/text/18/371\n\nIf they are knowingly or negligently defrauding the public and the United States, it is also possible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code § 241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nAll parents who pary for any services, including recommendation services, parenting classes, etc which are offered under the deceptive pretext of allowing a parent worried about their abused child to enable them to have more time or custody with them in order to protect them, could form a class action lawsuit.\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nAll individuals denied employment, promotion, or who simply quits in disgust because their moral beliefs prevent them from participating in any deceptive acts or crimes could form a class action lawsuit.\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\nAll parents and children who suffer as a consequence of deceptive acts or crimes could form a class action lawsuit:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A father petitioned for custody of his child. The child was in danger in mom's custody, the authorities were aware of this danger, but they denied dad's petition for custody. The child later died in mom's custody.",
    "subreddit": "MensRights",
    "timestamp": 1685898190,
    "score": 42,
    "keyword": "brown judge"
  },
  {
    "text": "A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers. A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers.\n\nHere is my response in the hopes that it helps victims of corruption  and coercion who wish to seek justice, and helps to prevent injustices which can promote child abuse.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote:\n\nA lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers. (Anonymized)\n\nFathers have a right to legal representation free from coercion.\n\nPossible:\n\n>18 U.S. Code § 242 - Deprivation of rights under color of law [https://www.law.cornell.edu/uscode/text/18/242](https://www.law.cornell.edu/uscode/text/18/242)\n\nA pattern or practice of harassing lawyers who successfully argue for fathers may be an attempt to extort ineffective legal services for fathers from all lawyers:\n\n>Extortion Forcing action or obtaining something by illegal means.  Anyone may commit extortion through force or coercion.  A public or private official may also commit extortion under the color of office. [https://www.law.cornell.edu/wex/extortion](https://www.law.cornell.edu/wex/extortion)\n\nThe US funds the child support and parenting time systems which depend on protection for civil rights. Undermining those civil rights for fathers creates more work and billable hours for agencies which means any illegal act to extract more money from the federal government may be:\n\nPossibly defrauding the United States:\n\n>If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both. 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States [https://www.law.cornell.edu/uscode/text/18/371](https://www.law.cornell.edu/uscode/text/18/371)\n\nPossible criminal conspiracy against rights:\n\nAttorneys have a right to practice free from coercion. Clients have a right to legal services not hindered by coercion:\n\n>\"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\" 18 U.S. Code § 241.Conspiracy against rights [https://www.law.cornell.edu/uscode/text/18/241](https://www.law.cornell.edu/uscode/text/18/241)\n\nUse of intimidation, threats, and corrupt persuasion against lawyers and their clients may be witness tampering:\n\n>(b)Whoever knowingly uses intimidation, threatens, or corruptly persuades another person, or attempts to do so, or engages in misleading conduct toward another person, with intent to— (1)influence delay, or prevent the testimony of any person in an official proceeding; 18 U.S. Code § 1512.Tampering with a witness, victim, or an informant [https://www.law.cornell.edu/uscode/text/18/1512](https://www.law.cornell.edu/uscode/text/18/1512)\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n>HHS Office of Inspector General Phone. 1-800-HHS-TIPS (1-800-447-8477) [https://oig.hhs.gov/fraud/report-fraud/contact.asp](https://oig.hhs.gov/fraud/report-fraud/contact.asp)  \n>  \n>HHS Office of Civil Rights [https://www.hhs.gov/civil.../filing-a-complaint/index.html](https://www.hhs.gov/civil.../filing-a-complaint/index.html)\n\nDepartment of Justice Civil Rights\n\n>The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin. [https://www.justice.gov/crt](https://www.justice.gov/crt)\n\nAnyone may report federal crimes to the FBI.\n\n>(202)324-3000 [http://tips.fbi.gov/](http://tips.fbi.gov/)\n\nIf any attorney misused the bar association rules and complaint procedures not as a way to ensure the integrity of the courts, but rather used detestable selective weights and measures such as combing through a targeted attorney's case history to find technical violations of the rules as retaliation for their vigorous defense of their client's interests, that act itself could be a violation of bar rules subject to complaint:\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n>Complaints Against Lawyers  \n>  \n>The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.  \n>  \n>[https://www.americanbar.org/groups/professional\\_responsibility/resources/resources\\_for\\_the\\_public/](https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/)\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n>Model Rules of Professional Conduct  \n>  \n>[https://www.americanbar.org/groups/professional\\_responsibility/publications/model\\_rules\\_of\\_professional\\_conduct/model\\_rules\\_of\\_professional\\_conduct\\_table\\_of\\_contents/](https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/)\n\nIf any judge or person exercising judicial decision making authority and subject to the judicial code of conduct (e.g. some Title IV-D child support etc. employees or Title IV-E child welfare employees who make judicial recommendations such as child placement, child custody, parenting time, or child support calculations), they may also be subject to complaints under this process, even if they are not attorneys.\n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n>Model Code of Judicial Conduct  \n>  \n>[https://www.americanbar.org/groups/professional\\_responsibility/publications/model\\_code\\_of\\_judicial\\_conduct/](https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/)\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>How to File a Grievance [http://jtc.courts.mi.gov/file\\_a\\_grievance/index.php](http://jtc.courts.mi.gov/file_a_grievance/index.php)\n\nAny social worker who purposefully abuses the bar association complaint system as a weapon of retaliation against an attorney who vigorously defends the interests of their client may be acting in an unethical manner, and is also subject to complaint:\n\nThe National Association of Social Workers has a Code of Ethics:\n\n>[https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English](https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English)\n\nPossible misconduct by a social worker:\n\n>Social Workers:  \n>  \n>How To File a Complaint  \n>  \n>Steps for filing a request for professional review  \n>  \n>NASW is very interested in reviewing situations that affect the integrity of our profession.  \n>  \n>[https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint](https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint)\n\nPossible cause for a federal civil rights action under:\n\n>42 U.S. Code § 1983 - Civil action for deprivation of rights [https://www.law.cornell.edu/uscode/text/42/1983](https://www.law.cornell.edu/uscode/text/42/1983)\n\nUS courts provide forms:\n\n>Complaint for Violation of Civil Rights (Non-Prisoner) [https://www.uscourts.gov/.../complaint-violation-civil](https://www.uscourts.gov/.../complaint-violation-civil)...\n\nPossible basis of a class action lawsuit for similar situated people:\n\n>WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS? There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories: ... Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes. Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers. [https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit](https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit) CIVIL RIGHTS CLASS ACTIONS: A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION For over 50 years, class actions have been among the most powerful tools to secure civil rights in America. Brown v. Board of Education, 1 which outlawed school segregation and set the stage for the entire civil rights movement, was a class action lawsuit. More recent examples include the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth Mines and considered to be the first sexual harassment class action lawsuit. CENTER FOR JUSTICE & DEMOCRACY [https://centerjd.org/.../files/CivilRightsClassActionsF.pdf](https://centerjd.org/.../files/CivilRightsClassActionsF.pdf)\n\nI wish you the best of luck in your search for justice.\n\nTweet and gettr with me to seek justice:\n\nA lawyer helped father to stop paying child support for a child which was not his. She was disbarred.  \\[Alleges that\\] she was targeted & lawyers fear retaliation for helping their clients. Look @OIGatHHS @HHSOCR @CivilRights @ABAesq @JudiciaryGOP @POTUS [https://www.reddit.com/r/MensRights/comments/13uzqrp/a\\_lawyer\\_helped\\_a\\_father\\_to\\_stop\\_paying\\_child/](https://www.reddit.com/r/MensRights/comments/13uzqrp/a_lawyer_helped_a_father_to_stop_paying_child/)",
    "title": "A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers.",
    "subreddit": "MensRights",
    "timestamp": 1685378189,
    "score": 37,
    "keyword": "brown judge"
  },
  {
    "text": "A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney. A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney.\n\nHere is my reply in the hopes that it helps other parents who are seeking justice, and it helps to protect children who are vulnerable to child abuse when their parents cannot effectively represent themselves in an effort to protect their children.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote: (above)\n\nThe Supreme Court said that people in court have a right to self representation except for people who have a mental illness. If denied the right to self represent, I might ask the judge what mental illness they believe I have and if they have any evidence that I have not seen or sworn testimony from any medical professional I have not yet met.\n\n> Indiana v. Edwards - 554 U.S. 164, 128 S. Ct. 2379 (2008)\n\n> RULE:\n\n> The United States Constitution permits judges to take realistic account of the particular defendant's mental capacities by asking whether a defendant who seeks to conduct his own defense at trial is mentally competent to do so. That is to say, the United States Constitution permits States to insist upon representation by counsel for those competent enough to stand trial under Dusky but who still suffer from severe mental illness to the point where they are not competent to conduct trial proceedings by themselves.\n\n> https://www.lexisnexis.com/community/casebrief/p/casebrief-indiana-v-edwards\n\nIf anyone intentionally creates a web site which deceptively gives the false impression that they are providing public services such as forms, but in reality has broken the links, that may be wire fraud:\n\n> Whoever, having devised or intending to devise any scheme or artifice to defraud, or for obtaining money or property by means of false or fraudulent pretenses, representations, or promises, transmits or causes to be transmitted by means of wire, radio, or television communication in interstate or foreign commerce, any writings, signs, signals, pictures, or sounds for the purpose of executing such scheme or artifice, shall be fined under this title or imprisoned not more than 20 years, or both.\n\n> 18 U.S. Code § 1343.Fraud by wire, radio, or television\n\n> https://www.law.cornell.edu/uscode/text/18/1343\n\nIt is possible that the court officials to whom you spoke insist on you using an attorney, because they believe the attorneys you will hire have been coerced into providing inadequate legal representation.\n\nI previously wrote about a coercive environment for attorneys:\n\n> A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers.\n\n> https://www.reddit.com/r/MensRights/comments/13uzqrp/a_lawyer_helped_a_father_to_stop_paying_child/\n\nIf this web site is cited in any document as example of how the courts comply with state or federal laws which enable the court to obtain federal funds it may also be:\n\n> (a)Whoever, if the circumstance described in subsection (b) of this section exists— (1)being an agent of an organization, or of a State, local, or Indian tribal government, or any agency thereof— (A)embezzles, steals, obtains by fraud, or otherwise without authority knowingly converts to the use of any person other than the rightful owner or intentionally misapplies, property that— (i)is valued at $5,000 or more, and\n\n> 18 U.S. Code § 666.Theft or bribery concerning programs receiving Federal funds\n\n> https://www.law.cornell.edu/uscode/text/18/666\n\nPossible failure to respect:\n\n> \"There is a fundamental right under the Fourteenth Amendment for a parent to oversee the care, custody, and control of a child.\"\n\n> Troxel v. Granville, 530 U.S. 57 (2000)\n\n> https://supreme.justia.com/cases/federal/us/530/57/\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code § 241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible cause for a federal civil rights action under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney.",
    "subreddit": "MensRights",
    "timestamp": 1689252434,
    "score": 34,
    "keyword": "brown judge"
  },
  {
    "text": "When husbands are victims of marital abuse  \n\nFor professional golfer Lucas Glover, abuse included being verbally attacked by his wife, Krista, for not proceeding to the next round of a golf tournament. Following a 2018 altercation involving Glover and his mother, Krista was arrested and charged with domestic battery. Glover admitted in the police report that this wasn’t a rare occurrence and that his wife would often say things like “You’re such a loser” or “You better win or the kids and I will leave you and you will never see us again.”\n\nCollege professor Dr. Timothy Golden shares in a 2016 TEDx talk1 that his ex-wife repeatedly criticized and degraded him because of his body weight. He says she would constantly remark on how attractive other men were compared with him and eventually declared celibacy until he “made himself more attractive.”\n\nRon Mattocks, a former army officer and senior business executive, revealed that his now ex-wife tried to convince him that his anger was the problem in their marriage even though he had no history of anger issues. As he writes2 in “When Men Are Victims of Abuse,” she convinced him that his parents were abusive and to cut ties with them. She often called him a “14-year-old boy trying to get laid” and asked him when he’d ever be a man. She regularly made him endure “several hours of passive-aggressive silence before being forced to talk things out.” His offenses? Hanging pictures up too high, making the bed the wrong way or folding T-shirts poorly. This constant barrage on his person and isolation from everyone else led him to the brink of suicide.\n\nThe National Domestic Violence Hotline in the U.S. defines abuse as “a pattern of behaviours used by one partner to maintain power and control over another partner in an intimate relationship.” By this definition, abuse knows no gender and is a weapon effectively wielded by women as well as men. Nonetheless, society often expects men to endure torment without so much as batting an eye. “Be a man” is shorthand for, “Toughen up. Don’t be a wimp or a loser.” This means army officers, business executives, professional athletes, college professors and many other men often silently endure abuse at the hands of their wives – because to speak up would show weakness.\n\n## Living with an abusive wife\n\nMen can experience abuse in all its forms – even physical abuse. According to the Centers for Disease Control and Prevention, “One in seven men report having experienced severe physical violence from an intimate partner in their lifetime.” The National Domestic Violence Hotline reports that 13 per cent of their documented contact comes from male victims. One meta-analysis concluded that abusive “women are slightly more likely than men to use one or more acts of physical aggression and to use such acts more frequently,” while men are more likely to cause injury. Although “intimate partner” statistics are broader than the context of the biblical definition of marriage, these studies indicate that men experience abuse too.\n\nMen can also experience sexual abuse from their wives. A sexually abusive wife may push her husband into sexual situations against his will, such as being recorded or including other partners in their sex life. Sometimes sexual abuse comes in the form of unwanted touch.\n\nAnother type of sexual abuse husbands may experience is called Made to Penetrate, defined by the CDC as sexual violence when a victim is “made to, or there was an attempt to make them, sexually penetrate someone without consent as a result of physical force or when the victim is unable to consent due to being too drunk, high or drugged, (e.g., incapacitation, lack of consciousness, or lack of awareness) from their voluntary or involuntary use of alcohol or drugs.”\n\nPsychological (emotional) abuse is cited by one study3 as likely to be “the most pervasive form of relationship maltreatment.” According to the research in this study, 8.3 per cent of men report experiencing emotional abuse in their relationships. The researchers define emotional abuse as abuse that can include “verbal assault, dominance, control, isolation, ridicule or the use of intimate knowledge for degradation.” Verbal assault can manifest as intimidation (“You better win or I’ll leave you”), aggression (cursing, etc.), humiliation (“When will you ever be a man?”) or even silent treatment. Other characteristics of verbal abuse are blaming, criticism, gaslighting and judging.\n\nTim Sanford, Clinical Director for Counselling Services at Focus on the Family in the U.S., agrees that the research matches his counselling experience. “With \\[abusive\\] women, I don’t think you see as much of that huge explosiveness,” he says. “It’s more of this purposeful pick, pick, pick.” He compares the difference between a single abusive event and constant abuse as the difference between being chomped once by a T. rex or a million times by piranhas. Sanford’s conclusion? “Either way you end up dead. So, either way, it’s abusive.”\n\n## Why men stay with an abusive wife\n\nWhy would a husband put up with this kind of treatment? Counsellors who work with abused men say there are multiple reasons.\n\n### Fear of losing status\n\nIf a man’s wife is abusive, he may hide it because he doesn’t want to deal with the social fallout of admitting he’s been hurt – especially by a woman. Speaking up about the abuse can cost him the respect of his co-workers or church community. Admitting abuse might feel like admitting to being a victim. In many men’s minds, victims are weak and weakness is not considered a characteristic of manhood. To avoid the loss of “manly” status in society, many husbands choose to continue to suffer.\n\n### Fear of not being believed\n\nAs many women in abusive relationships do, men may wonder who will believe them if they speak up. Societal images of abuse usually portray men as the aggressor. It’s difficult for many to see a man as a victim in his relationship – especially if he’s physically bigger than his spouse. Golden, the professor who shares his emotional abuse story on the TEDx stage1, shared in a separate interview that he recalls calling more than eight different sources for help and none of them had any resources for men. He said one therapist, while laughing, told him that men don’t get abused.\n\nThis perspective is only amplified by the media. Men are fair game for slaps, punches and crotch-kicks. Sanford points out that violence against men in the media is played for laughs. “It’s laughable if the woman hits the guy; it’s a joke. But if a guy hits the wife . . . call 911. And so, there is a double standard there.”\n\nHusbands in media are also fair game for ridicule. Many TV shows portray making fun of the husband or calling him names as normal behaviour. Wendy Brown, registered marriage and family therapist, says she sees this in her office, as well. “I get couples who come in and the husband will say, ‘She calls me all of these horribly demeaning names. She curses at me.’” Yet Brown says that this behaviour is *not* normal or healthy. “To me that’s kind of crossing that line. Then it’s not just nagging you about ‘let’s work on the relationship or clean out the garage’ or whatever it is, it becomes an attack on your \\[the husband’s\\] character, your identity.”\n\n### Fear of being named the aggressor\n\nBrown points out that husbands in abusive relationships fear being accused of being the abusers if they protect themselves from their wife’s attacks. “There’s that fear of, if I grab her and hold her, then I’m accused of hurting her.”\n\nIt’s not unheard of for an abusive wife to call or threaten to call the authorities and report her husband as the abuser. Lucas Glover’s wife called 911 and reported that he and his mother had attacked her, but the police were able to assess the situation and arrested her instead.\n\n### Desire to remain married\n\nBrown says that many husbands in abusive relationships love their wives and want to maintain their relationship. They want her to be seen as the wonderful person that people think she is, so they don’t report the abuse or tell anyone. Sanford adds that in some cases where there is a history of previous trauma, husbands may hold on to the relationship because it’s less painful than being alone.\n\n### Fear of losing access to children\n\nStatistics from the U.S. Census Bureau show that fathers make up only 19.6 per cent of parents with full custody of their children. There is an upward trend, but historically it’s been more difficult for men to gain full custody of their children. Registered marriage and family therapist Glenn Lutjens points out that many husbands with an abusive wife stay because they believe their children will be safer or they fear they will lose access to them. Abusive wives may use the threat of cutting off the father’s contact with his children as leverage to keep their victim silent.\n\n### Misapplication of Scripture\n\nAmong Christians, the Bible can be misused to excuse abusive behaviour. Lutjens some people have a “spiritualizing tendency to misunderstand or misinterpret Scripture.” For example, in Matthew 5:39 Jesus advises his listeners, “Do not resist the one who is evil. But if anyone slaps you on the right cheek, turn to him the other also.” Lutjens explains that this passage can be misinterpreted to mean accepting abusive behaviour from your spouse but he emphasizes that, in context, that is not what Jesus is talking about.\n\nBecause of false Bible teaching, Sanford says some husbands can feel pressure to have a perfect household. He says husbands may be told, “If the marriage falls or breaks or makes it it’s on him because he’s the head of the house.” This can lead to a desire to tough it out even when a situation turns abusive. “All that teaching, he can just take that as ‘I guess that’s what I have to do. This is just my cross to bear,” says Sanford. But abuse is not God’s design for marriage. While every marriage has its trials, counsellors advise husbands in an abusive relationship to seek help.\n\n### Disconnection from emotions\n\nGolden speaks about his socialization as a man to “ignore how you feel, even when it hurts.” He cites this as a useful tool on the football field but a much more harmful mentality in real life.\n\nThe National Domestic Violence Hotline corroborates his experience by reporting that many men do not report or seek help for their abuse because, “Men are socialized not to express their feelings or see themselves as victims.” Brown adds that this suppression of emotions can lead men to have an internal disconnect between the things that are said or done to them and the emotional impact of those words and actions. Men who experience this disconnection between actions and their emotional impact may be unable to name the harm inflicted on them by their abusive wife. Coupled with the societal expectations of men to be strong, this makes it almost impossible for a man to see himself as a victim of abuse.\n\n## Effects of abuse\n\nDomestic abuse has a life-draining effect on the victim, both physically and mentally.\n\nCommon effects of abuse on the victim are:\n\n* Depression\n* Harmful coping strategies such as workaholism or substance abuse\n* High blood pressure\n* Loss of confidence\n* Insomnia\n* Physical injuries; e.g., broken bones\n* Low self-worth\n* PTSD\n* Suicidal thoughts\n\n## How to get help\n\nWhile marriage remains the best and safest context in which men, women and children thrive, it’s important to recognize when things go awry and abuse of anyone, including men, occurs. Maybe you’re wondering if you’re in an abusive relationship and aren’t sure what to do. Consider taking these simple steps to help gain clarity on your situation.\n\n### Name what’s happening\n\nSanford recommends writing down “what is really happening to you in the course of a week or a month.” He also suggests keeping track of the frequency. Is this happening twice a month, twice in 10 minutes or every 10 minutes?\n\nFor example,\n\n* She threw her cell phone at my head.\n* She cussed me out for not loading the dishwasher correctly.\n* She read my text messages to make sure I didn’t say anything that would make her look bad.\n\n### Name the emotional impact of your wife’s actions\n\nHow are your wife’s actions affecting your internal state? Do you feel powerless? Ashamed? Scared? Isolated? Rejected? Lutjens says that understanding the emotional impact of your wife’s actions is a crucial step in determining if you’re experiencing abuse. “If it’s just about what’s taking place and you’re not exploring, ‘OK, what’s my emotion in this?’ it’s just a factual account,” he says. It’s easy to brush off a list of offences as “not a big deal” or “not anything to whine about,” but Lutjens stresses the importance of exploring the emotional impact of those actions. Remind yourself that your feelings matter in your marriage. Ask yourself without judgment or condemnation, *How does this make me feel?* or *What am I feeling in this moment?*\n\nA feelings wheel is an effective tool to help you name your emotions. Remember that while we all hurt our spouses sometimes, abuse is *a pattern* of harmful behaviour used to control and manipulate. If your wife is purposefully and habitually causing you physical or emotional harm, you need to address the issue.\n\n### Speak up\n\nLutjens advises that the only way to experience a change in your relationship is to speak up about what’s not working. “There are so many things that stay as secrets,” he says. “That’s when they fester. They just stay the same. They don’t change.”\n\nFind a safe space to give voice to what you’re experiencing. A trusted friend, family member or church leader may be a good place to start. Lutjens suggests speaking to a good Christian counsellor: “Counselling is the opportunity to give voice to what your experiences are and to know what you feel.” Focus on the Family Canada offers a [free one-time phone counselling consultation](https://www.focusonthefamily.ca/get-help/counselling) which is a first step toward that process. It may seem difficult to find the right person to share with, but pray that God will guide you to someone who is empathetic and wise.\n\n### Plan\n\nFormulate a strategy to bring you and your children to safety. Healing for you and your spouse may require a time of separation. A [healing separation](https://www.focusonthefamily.ca/content/why-and-how-to-pursue-a-healing-separation) is time to evaluate and change dysfunctional patterns and behaviours in your marriage. (If you feel you’re in imminent danger, call 911 or find a full list of helplines and shelters across Canada at [**EndingViolenceCanada.org**](https://endingviolencecanada.org/Getting-Help/).) You may need to seek support from family, friends or your church community.\n\nWhile many domestic abuse resources cater to women, there are a growing number of organizations with resources for men in abusive relationships. [Focus on the Family Canada offers a free, one-time phone counselling consultation](https://www.focusonthefamily.ca/get-help/counselling) and can connect you with a counsellor in your area. Additionally, here are some places and resources (not faith-based) that can provide help:\n\n[Canadian Centre for Men and Families](https://menandfamilies.org/canada-trauma/)\n\n[HeadsUpGuys](https://headsupguys.org/help-male-victims-domestic-abuse-violence/)\n\n[Male Survivors of Intimate Partner Violence in Canada study](https://www.victimsfirst.gc.ca/res/cor/ipv-ipv/Male%20Survivors%20of%20IPV%20in%20Canada,%202020.pdf)\n\n### Lean on God\n\nIn Psalm 27:1 David clings to God as his “light and salvation.” He asks, “Whom shall I fear?” Sometimes fear can keep us from experiencing God’s salvation and deliverance, but the Bible says God is our refuge and “very present help” in times of trouble (Psalm 46:1). If you’re in an abusive relationship, draw from the Lord’s strength. Seek godly counsel to help bring you out of the darkness of an abusive relationship and into the light of health and wholeness\n\n## How to help an abuse victim\n\nIf a man talks to you about his abusive wife, affirm his openness and courage in speaking up about the abuse. Counsellors say it’s important to validate the fact that harmful behaviour is taking place and acknowledge its impact. One of the key reasons men don’t speak up is a fear that they won’t be believed or that they will be ridiculed. Provide a safe and non-judgmental space for them to share and process their experience.\n\nUse statements such as, “It makes perfect sense that you feel devalued by that” or “It’s not OK for her to hit you.”\n\nYou may also ask clarifying questions to help the victim connect the harmful behaviour to their emotions. Ask questions such as, “What was that like for you when . . . ?” or “How did that make you feel when . . . ?”\n\nAs the professor who shared his story of abuse in a TEDx talk1 says, it’s important for men and the people around them to be aware of abuse against men. Golden was able to start his journey to healing when he finally found a men’s group at a small church where he could share his feelings. He discovered he “was far from being the only one who experienced what he had been experiencing for so long.” He ends his talk with this call to action, “I hope that as a result of something I’ve said tonight someone, some man, somewhere, somehow, some way will cease to suffer in silence because someone has listened in a way that has allowed them to be touched by the story . . . the story of the men, or man in your life.”\n\n[https://www.focusonthefamily.ca/content/when-husbands-are-victims-of-marital-abuse](https://www.focusonthefamily.ca/content/when-husbands-are-victims-of-marital-abuse)",
    "title": "When husbands are victims of marital abuse",
    "subreddit": "MensRights",
    "timestamp": 1688087845,
    "score": 28,
    "keyword": "brown judge"
  },
  {
    "text": "A dad alleges multiple judges in a New Jersey county reportedly have a pattern or practice of consistently giving no physical custody to one parent (normally the father) and giving no physical custody or only one dinner a week to that parent A dad alleges multiple judges in a New Jersey county reportedly have a pattern or practice of consistently giving no physical custody to one parent (normally the father) and giving no physical custody or only one dinner a week to that parent \n\nHere is my reply in the hopes that it helps to protect children from child abuse, and that it promotes the interests of justice, protects victims of domestic violence and discrimination, and provides useful information to individuals who wish to seek justice for themselves and their families.\n\nI'm not an attorney and this is not legal advice.\n \nYou wrote: multiple judges in a New Jersey county reportedly have a pattern or practice of consistently giving no physical custody to one parent (normally the father) and giving no physical custody or only one dinner a week to that parent \n\nNew Jersey Child Custody is based on the best interests of the child:\n\n> c.   The judgment or order may contain any other provision directed against the appropriate party to the proceeding concerning the duty of support, the custody and guardianship of the child , parenting time privileges with the child , the furnishing of bond or other security for the payment of the judgment, the repayment of any public assistance grant, or any other matter in the best interests of the child . \n\n> New Jersey Statues 9:17-53   \n  \n> https://lis.njleg.state.nj.us/nxt/gateway.dll?f=templates&fn=default.htm&vid=Publish:10.1048/Enu\n\nIt is possible that some judges may engage in illegal sexist discrimination against fathers. This may be driven by partisan bias as they may be members of the Democratic party for whom more women vote than men.\n\nPossible failure to:\n\n> \"protection of civil rights\".\n\n> \"use of the reasonable and prudent parenting standard\"\n\n> 42 U.S. Code § 671\n\n> https://www.law.cornell.edu/uscode/text/42/671\n\nPossible failure to respect:\n\n> \"There is a fundamental right under the Fourteenth Amendment for a parent to oversee the care, custody, and control of a child.\"\n\n> Troxel v. Granville, 530 U.S. 57 (2000)\n\n> https://supreme.justia.com/cases/federal/us/530/57/\n\nPossible:\n\n> 18 U.S. Code § 242 - Deprivation of rights under color of law\n\n> https://www.law.cornell.edu/uscode/text/18/242\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code §241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nOther possible federal crimes.\n\nPossible child abuse by denying the child a relationship with loving parent and not reporting their own or colleagues' abuse:\n\n> A person who, while engaged in a professional capacity or activity described in subsection (b) of section 226 of the Victims of Child Abuse Act of 1990 on Federal land or in a federally operated (or contracted) facility, or a covered individual as described in subsection (a)(2) of such section 226 who, learns of facts that give reason to suspect that a child has suffered an incident of child abuse, as defined in subsection (c) of that section, and fails to make a timely report as required by subsection (a) of that section, shall be fined under this title or imprisoned not more than 1 year or both.\n\n> 18 U.S. Code § 2258.Failure to report child abuse\n\n> https://www.law.cornell.edu/uscode/text/18/2258\n\nAny conspiracy to kidnap may be racketeering:\n\n> (1)“racketeering activity” means (A) any act or threat involving murder, kidnapping, gambling, arson, robbery, bribery, extortion, dealing in obscene matter, or dealing in a controlled substance or listed chemical (as defined in section 102 of the Controlled Substances Act), which is chargeable under State law and punishable by imprisonment for more than one year;\n\n> 18 U.S. Code § 1961.Definitions\n\n> https://www.law.cornell.edu/uscode/text/18/1961\n\nPossible cause for a federal civil rights action under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nFor consumers of court ordered services, including parenting evaluation or parenting time coordination, which may be offered in a manner which is deceptive or corrupt:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nFor employees who cannot work in such an environment, who face discrimination, including sex discrimination against potential employees who are men who may be more likely to refuse to participate in potentially criminal acts against fathers, and any who is punished for refusing to go along with such acts, or who quits because of them:\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\nFor fathers who lose access to their children, for children who face an increased risk of child abuse because they have no access to their fathers to protect them:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A dad alleges multiple judges in a New Jersey county reportedly have a pattern or practice of consistently giving no physical custody to one parent (normally the father) and giving no physical custody or only one dinner a week to that parent",
    "subreddit": "MensRights",
    "timestamp": 1689538347,
    "score": 24,
    "keyword": "brown judge"
  },
  {
    "text": "A father complained parents are blamed for the negative behaviors that children exhibit when in the care of their alienating parent. A father complained parents are blamed for the negative behaviors that children exhibit when in the care of their alienating parent.\n\nHere is my response, in the hope that it will help other parents, their children, and families who are attempting to seek justice, and that this information may help protect children from abuse.\n\nI'm not an attorney and this is not legal advice.\n \nI wrote a message to a dad in a similar situation which may help you to seek justice. You can read it here (and several other places)\n\n> A dad says that the mother of his child wants him either in jail or in the ground, and she is manipulating his child to lie to avoid being yelled at by mom. He is fighting to maintain a relationship with child and he feels he is unable to continue.\n\n> https://www.reddit.com/r/MensRights/comments/uzbt02/a_dad_says_that_the_mother_of_his_child_wants_him/\n\nKnowingly making false statements regarding the needs of a child or failing to adhere to standards to protect children and families may be manufacturing a false claim of child abuse:\n\nThe National Association of Social Workers has a Code of Ethics:\n\n> https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English\n\nPossible misconduct by a social worker:\n\n> Social Workers:\n\n> How To File a Complaint\n\n> Steps for filing a request for professional review\n\n> NASW is very interested in reviewing situations that affect the integrity of our profession.\n\n> https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint\n\nA social worker or school worker who may have manufactured a false claim of child abuse is abusing that child. In so doing they are failing to report their own abuse, a crime.\n\n> A person who, while engaged in a professional capacity or activity described in subsection (b) of section 226 of the Victims of Child Abuse Act of 1990 on Federal land or in a federally operated (or contracted) facility, or a covered individual as described in subsection (a)(2) of such section 226 who, learns of facts that give reason to suspect that a child has suffered an incident of child abuse, as defined in subsection (c) of that section, and fails to make a timely report as required by subsection (a) of that section, shall be fined under this title or imprisoned not more than 1 year or both.\n\n> 18 U.S. Code § 2258.Failure to report child abuse\n\n> https://www.law.cornell.edu/uscode/text/18/2258\n\nFalse statements to the the court may be:\n\n> 18 U.S. Code § 1621.Perjury generally\n\n> https://www.law.cornell.edu/uscode/text/18/1621\n\n> 18 U.S. Code § 1622 - Subornation of perjury\n\n> Whoever procures another to commit any perjury is guilty of subornation of perjury, and shall be fined under this title or imprisoned not more than five years, or both.\n\n> https://www.law.cornell.edu/uscode/text/18/1622\n\nMisuse of child protection resources to promote the abuse of children within the home and prevent them from safety within the home is a violation of federal law:\n\n> 42 U.S. Code § 629 - Purpose\n\n> (2)To assure children’s safety within the home and preserve intact families in which children have been maltreated, when the family’s problems can be addressed effectively.\n\n> https://www.law.cornell.edu/uscode/text/42/629\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code § 241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nIt is possible that the fact pattern may be consistent with a scheme or artifice to defraud or embezzle from the children the accurate child custody, parenting time, and child protective services they are due, a federal crime:\n\n> (a)Whoever, if the circumstance described in subsection (b) of this section exists— (1)being an agent of an organization, or of a State, local, or Indian tribal government, or any agency thereof— (A)embezzles, steals, obtains by fraud, or otherwise without authority knowingly converts to the use of any person other than the rightful owner or intentionally misapplies, property that— (i)is valued at $5,000 or more, and\n\n> 18 U.S. Code § 666.Theft or bribery concerning programs receiving Federal funds\n\n> https://www.law.cornell.edu/uscode/text/18/666\n\nOther possible federal crimes.\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n> Complaints Against Lawyers\n\n> The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.\n\n> https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n> Model Rules of Professional Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/\n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n> Model Code of Judicial Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>  How to File a Grievance\n\n> http://jtc.courts.mi.gov/file_a_grievance/index.php\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nFor children and families who consume and pay for services which may be inadequate or corrupted:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nFor potential employees and employees denied access to work such as appointments as LGALs because they refuse to engage in corrupt acts:\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\nFor general civil rights:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A father complained parents are blamed for the negative behaviors that children exhibit when in the care of their alienating parent.",
    "subreddit": "MensRights",
    "timestamp": 1683473012,
    "score": 19,
    "keyword": "brown judge"
  },
  {
    "text": "A mother in law complains that dad is required to pay for a lawyer for his daughter who may be overcharging dad, therapy, and 95% of all expenses, and that mom violates court orders without consequences I'm not an attorney and this is not legal advice.\n \nYou wrote you are required to pay for an LGAL for your daughter in law, but believe the lawyer may be over billing you.\n\nPossible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.edu/wex/fraud\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n> Complaints Against Lawyers\n\n> The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.\n\n> https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n> Model Rules of Professional Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/\n\nYou also suggest that the judge is constantly generating reasons to charge dad and may be failing to protect the child from these potential fraudulent charges. Furthermore, you seem to imply that the judge may be sexist in that they only enforce orders which are injurious to dad and when mom doesn't follow the orders of the court then the judge ignores them. \n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n> Model Code of Judicial Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>  How to File a Grievance\n> http://jtc.courts.mi.gov/file_a_grievance/index.php\n\nYou also suggest that the 95% of costs apportioned to dad are excessive.\n\nPossible sexist deviation from the statutorily required child support formula.\n\n> (2)Expedited administrative and judicial procedures (including the procedures specified in subsection (c)) for establishing paternity and for establishing, modifying, and enforcing support obligations. The Secretary may waive the provisions of this paragraph with respect to one or more political subdivisions within the State on the basis of the effectiveness and timeliness of support order issuance and enforcement or paternity establishment within the political subdivision (in accordance with the general rule for exemptions under subsection (d)).\n\n> 42 U.S. Code § 666 - Requirement of statutorily prescribed procedures to improve effectiveness of child support enforcement\n\n> https://www.law.cornell.edu/uscode/text/42/666\n\nUsing biased child support calculations to economically abuse dad and his child may be a violation of their civil rights.\n\nPossible cause for a federal civil rights action under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\n\nI wish you the best of luck in your search for justice.",
    "title": "A mother in law complains that dad is required to pay for a lawyer for his daughter who may be overcharging dad, therapy, and 95% of all expenses, and that mom violates court orders without consequences",
    "subreddit": "MensRights",
    "timestamp": 1683970418,
    "score": 13,
    "keyword": "brown judge"
  },
  {
    "text": "A parent filed a qui tam lawsuit to seek a court order forcing a state agency to follow the law in their view, but reported what sounded like unreasonable restrictions and expenses A parent filed a qui tam lawsuit to seek a court order forcing a state agency to follow the law in their view, but reported what sounded like unreasonable restrictions and expenses\n\nI'm not an attorney and this is not legal advice.\n \nYou wrote about agency fraud and a qui tam lawsuit in which you fired your attorney.\n\n> What is a qui tam lawsuit?\n\n> Qui tam lawsuits are a type of whistleblower lawsuit that is brought under the False Claims Act, a law that rewards whistleblowers in successful cases where the government recovers funds lost to fraud. Many states also have false claims acts that prohibit fraud against the state government, which can be enforced through a qui tam lawsuit.\n\n> https://www.phillipsandcohen.com/what-is-a-qui-tam-case/\n\nPossible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.efdu/wex/fraud\n\nPossible cause for a federal civil rights action or lawsuit under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nPossible:\n\n> 18 U.S. Code § 242 - Deprivation of rights under color of law\n\n> https://www.law.cornell.edu/uscode/text/18/242\n\nIf I were you and I felt that the judge had ruled I have a set of requirements for my lawsuit (prepaying lawyer, possibly influencing lawyer not to represent me faithfully) which I felt were unreasonable, I would consider:\n\nWhether a decision was patently unreasonable:\n\n> What does a “patently unreasonable” decision look like? The case law tells us to look for decisions that “border on the absurd”, are “clearly irrational”, or cannot justifiably be allowed to stand. While it can be hard to tell just what a judge will consider absurd, certain kinds of mistakes have tended to qualify as patently unreasonable errors more frequently than others:\n\n> the decision comes to a conclusion that has no evidence to support it\n\n> the decision uses the wrong legal test or interprets the law in a way that is clearly wrong\n\n> the decision fails to answer a key question in the dispute or does not adequately explain the how the result was reached\n\n> https://clasbc.net/intro-to-judicial-review-patent-unreasonableness/\n\nI would consider a motion to recuse the judge.\n\n> Liteky v. United States, 510 U.S. 540 (1994)\n\n> 28 U.S.C. §455(a) requires recusal of a judge in any proceeding in which his impartiality may be questioned.\n\n> https://casetext.com/analysis/judges-motion-to-recuse-removal-on-remand\n\nIf I felt my attorney were working in collusion with the judge to prevent me from making my case rather than representing me, I would consider:\n\n> Obstruction of justice\n\n> Definition\n\n> 18 U.S.C. § 1503 defines \"obstruction of justice\" as an act that \"corruptly or by threats or force, or by any threatening letter or communication, influences, obstructs, or impedes, or endeavors to influence, obstruct, or impede, the due administration of justice.\"\n\n> https://www.law.cornell.edu/wex/obstruction_of_justice\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code §241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nalso....\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A parent filed a qui tam lawsuit to seek a court order forcing a state agency to follow the law in their view, but reported what sounded like unreasonable restrictions and expenses",
    "subreddit": "MensRights",
    "timestamp": 1697856651,
    "score": 3,
    "keyword": "brown judge"
  },
  {
    "text": "A father claims LGALS in Los Angeles and elsewhere may be double billing parents for their services A father claims LGALS in Los Angeles and elsewhere may be double billing parents for their services\n\nHe recommends asking the LGAL (lawyer guardian ad litem) for a copy of their billable hours and any sheets they turn into the government for reimbursement.\n\nHere is my reply in the hopes that it helps protect parents from being defrauded by court appointed attorneys and other service providers, promotes the interests of justice, and protects children who are more vulnerable to child abuse when their parents cannot get their parenting time enforced because they owe service providers money based on the criminal acts of those service providers.\n\nI'm not an attorney and this is not legal advice.\n \nYou wrote: (Above)\n\nPossible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.efdu/wex/fraud\n\nLGALs are appointed under the Title IV-D child support program, which mandates \"protection of civil rights\", including the civil right not to be defrauded.\n\nPossibly defrauding the United States:\n\n> If two or more persons conspire either to commit any offense against the United States, or to defraud the United States, or any agency thereof in any manner or for any purpose, and one or more of such persons do any act to effect the object of the conspiracy, each shall be fined under this title or imprisoned not more than five years, or both.\n\n> 18 U.S. Code § 371 - Conspiracy to commit offense or to defraud United States\n\n> https://www.law.cornell.edu/uscode/text/18/371\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nIf more than one person is aware of or involved in these crimes:\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code §241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nPossible basis of a class action lawsuit for similar situated people:\n\nAs a consumer of legal services:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nGeneral civil rights:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n> Complaints Against Lawyers\n\n> The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.\n\n> https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n> Model Rules of Professional Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/\n\nIf any judge or person exercising judicial decision making authority and subject to the judicial code of conduct (e.g. some Title IV-D child support etc. employees or Title IV-E child welfare employees who make judicial recommendations such as child placement, child custody, parenting time, or child support calculations), they may also be subject to complaints under this process, even if they are not attorneys. \n\nIf any judge is aware of these alleged crimes and fails to act to protect parents and children, or is any way involved, or fails to take proper precaution to protect parents from these crimes:\n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n> Model Code of Judicial Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>  How to File a Grievance\n> http://jtc.courts.mi.gov/file_a_grievance/index.php\n\nI wish you the best of luck in your search for justice.\n\nTweet and gettr with me to seek justice:\n\nA father claims LGALS in Los Angeles and elsewhere may be double billing parents for their services @fbi @CivilRights @OIGatHHS @HHSOCR @potus @gophelp   #LosAngeles #FathersRights #Corruption #organizedcrime #Lawyers   https://www.reddit.com/r/MensRights/comments/15m0xkh/a_father_claims_lgals_in_los_angeles_and/\n\nalso:\n\nA father claims LGALS in Los Angeles and elsewhere may be double billing parents for their services. Please look @StateBarCA @ABAesq @AGRobBonta @CAgovernor @LAPDHQ #Fraud #lawyer https://www.reddit.com/r/MensRights/comments/15m0xkh/a_father_claims_lgals_in_los_angeles_and/",
    "title": "A father claims LGALS in Los Angeles and elsewhere may be double billing parents for their services",
    "subreddit": "MensRights",
    "timestamp": 1691544522,
    "score": 0,
    "keyword": "brown judge"
  }
]