[
  {
    "text": "I’m scared to see my old friends because of how much I hate my body... This is my first reddit post at all so I apologize if it is not as graceful as it should be. Backstory: my boyfriend (22m) and I (24f) moved away from our home town roughly a year ago. Everything between us has been absolutely incredible and after this past year I’m more certain than I have ever been that I’m going to marry him. He’s incredibly supportive and has always been absolutely incredible to me. I only say this to ensure no one thinks this is his fault. \n\nHere’s my issue: Tomorrow we are traveling back to our home town to meet up with our mutual friends from before we moved. We have not seen them in roughly one year, in that year I’ve gained about 45 lbs. \n\nI view myself as a very body positive person except when it comes to myself. I was always the “twig” growing up through high school. To give you an idea, I am 5’10” and until the end of high school I weighed under 120lbs. I was extremely active and had a very high metabolism. Since then (as to be expected, naturally) I’ve gained some weight. Usually it was about 5-10lbs per year and my doctor reassured me over and over that it was purely aging and my hormonal birth control. \n\nI was in a 3 year relationship prior to my boyfriend that was incredibly emotionally abusive. My ex was a total gym rat and would openly berate me if I didn’t join him every time he went to the gym (6 days a week about 2.5 hours each time). He constantly talked about other women’s bodies and how many women we knew (that were very fit, not like it matters) needed to “drop 5-10 lbs.” he would also constantly judge me for eating what he determined was “unhealthy.” This would be anything that had carbs in it. Brown rice, sweet potatoes, fruits, etc. Due to this constant berating I developed an unhealthy obsession with what I was eating. I would weigh out every thing that went into my body and make sure I was adhering to his dietary standards. To make matters worse, his ex girlfriend was in a wedding we went to about 4 months before we broke up. I never met her before the wedding but according to him she gained roughly 30 lbs. His exact words to me after seeing her were “see what happens when we break up? You’ll get fat.”  That disgusting misogynistic sentiment has been invading my thoughts daily since we broke up. I feel as if I’ve had a self fulfilling prophecy since. \n\nMy boyfriend is incredibly sweet and he is constantly praising me and my body and always tells me how beautiful/sexy etc he thinks I am. My problem is since I’ve gained all this weight I don’t believe him at all. He is about 6’1” and weighs 145 lbs. I feel like a fucking monster next to him. When we got together I was near my lowest weight as an adult. Probably near about 140lbs, when I went to the doctor about a month ago I weighed 194lbs. I eat as healthy as I possibly can and I exercise 3-4 times a week but literally nothing is working. Other than the emotional stress relief, the only thing that has changed is my birth control. I went from Depo Provera (the shot) to Nexaplanon (implant in the arm). Has anyone else had this happen..? \n\nI have never felt this way about myself before. I’ve never loved myself but I’ve definitely never hated myself in the way I do now.\n\nI apologize if this is not the appropriate place to air all of this but I thought a community of women would be the place that would understand most. \n\nEdit: posted before I finished. Sorry.",
    "title": "I’m scared to see my old friends because of how much I hate my body...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1565321009,
    "score": 8,
    "keyword": "brown judge"
  },
  {
    "text": "A message to the hopeless unemployed/underemployed grad. I've posted on here more than a few times. Generally, my posts dealt with my anger and discontentment with where I was in my life. But, I wanted to share my experience because I'm willing to bet that there is someone out there struggling to just find the hope and courage to make it one more day. \n\nMy story:\n\nI came into law school 60% sure I wanted to practice real estate law. My dad is a general contractor, and I grew up around development all my life. I did well my first year, well enough to secure a SA position at a strong regional firm in the Southeast US. I worked like a fucking dog there (routinely worked 12+ hour days, worked 7 out of 10 weekends I was there), trying to show them I was worth it. I cultivated strong relationships with almost every attorney in that office. \n\nAfter I finished the summer associateship, I had a few weeks before I started my 3L year, so I naturally used some of the gigantic wad of money I had saved up to fly to another state that I've been dying to visit since I learned of it. It's the absolute mecca of my hobby (triathlon). I landed in Colorado, and I was instantly sold. I remember sending a text to my mother while I ate lunch in Boulder, staring at the flatirons, unequivocally stating that I will be moving here eventually. First, I had to do my \"big law stint.\" \n\nAs I returned for my Fall semester my 3L year, my dreams were absolutely shattered one September afternoon when I got word that the firm wasn't projecting enough business to hire either of its summer associates. I was angry, confused, bitter, jaded. I was all of it. How could I work SO hard to only have it taken away from me? I felt that I earned that offer. Funny story: life goes on. Make the best of what you have. So what did I do? I moved. \n\nI spent the last semester of school in Colorado externing at a county gov't agency. It was tangentially related to the work I wanted to do, but I moreso just accepted the reality that it's gunna be an uphill battle and networked my ass off during that time. I had coffee and lunch with a slew of real estate attorneys. I awkwardly found myself sitting in random real estate bar association lunches trying to make small talk with my table mates, attempting to seem eager to make the leap into real estate law if provided the opportunity. But, it didn't pan out. \n\nI graduated in May, and made the commitment by moving 1800 miles away the day after graduation. I began bar prep, still applying to every job I could find, and reaching out to the contacts I made. I would use my downtime during bar prep to apply to jobs, tweak my cover letters, etc. I still met up for coffee and had two interviews during bar prep. I eventually was offered a law clerk spot in a nearby county courthouse. But, it wasn't at all what I wanted to do. I would look at other graduates from my class who didn't necessarily work as hard as I did during school/bar prep, but were reaping the benefits of prestigious firms, gov't agencies, clerkships, etc. I, OTOH, was *stuck* as a lowly state trial court clerk. Comparing myself to them left me even more angry, questioning whether I made he biggest mistake of my life. I never wanted to litigate, much less work in the criminal realm. \n\nThere wasn't a day that went by when I was clerking that I didn't scour the jobs boards, indeed, local bar association job classified, talk to other judges in the courthouse about doing real estate work, etc. I was *constantly* on it. I applied to over 50 jobs (which isn't that much by most standards, but they were all transactional positions, I knew I didn't want to litigate). Over the course of the year, I went on over a dozen in person interviews. I was actually in the running through late stages of a job at a local city attorney's office---what I thought to be the *dream* job. I spent my time day dreaming about moving to this new city, working at the office, etc. Surprise surpise. After three rounds of interviews and after I was dead set I got the job, I got an email late one Friday afternoon from the City Attorney who told me they went with someone else, but if I ever needed anything else, please reach out to him. Again, depression. \n\nWith each unsuccessful interview, I fell lower and lower. But I didn't stop. I would listen to motivational speeches during my morning runs. I would meditate every morning. I would go deep to try and muster up the courage to continue to apply to these jobs that only left me angry and questioning everything about my life. \n\nLong story short, I got an interview at business litigation firm. I had a weird vibe, but they gave me an offer on the spot. I KNEW I wanted to do deals, but he sold me a little on the fact that they had a steady stream of real estate/corporate work. The next day, I received a formal offer. I got completely lowballed. It was barely more than what I make as a law clerk. When I brought that up, the partner insulted me, my law school, and was generally incredibly rude. I ran the situation by a number of people, and they all suggested I forego this opportunity. So I did. \n\nAfter that experience, I was really unmotivated. But I kept applying. This went on for a year. Until I recently saw an ad for a downtown firm looking for a real estate associate. The ad didn't request any years of prior experience, but I applied the day it was posted. \nI received an email two hours later, requesting to set up an interview. \n\nI prepped my fucking ass off. I knew exactly what kind of work they did, I knew as much as I could about the four partners in that office. I wrote out bullet points to over 75 interview questions. I drew notes on my resume to know that I could talk in depth about every single thing on my resume. \nBut one trick hat really helped me and that I will rely on for the rest of my life: the *only* difference between anxiety and excitement is the meaning you ascribe to the physical sensations. I consciously told everyone that I was so *excited* to be able to go in there to this interview. I NEVER said that I was nervous. I was excited to show them why I was the perfect candidate for the job. I don't know who said it, but there's a quote that essentially says that all you need is 20 seconds of insane courage to change your life. \nand it's true. \n\nI walked into that interview excited and confident. I was going to tell anyone who would listen why I wanted to be at THAT firm, why I wanted to do real estate law, and why I was undoubtedly the best candidate. I spoke with 3 partners that day, each individually. The interview was about an hour all together. From the moment I opened my mouth, it just *felt* right. No rude comments, no bad vibes. It seemed like an opportunity where these attorneys would take this new candidate under their collective wing and teach them how to truly run a deal from beginning to end. This opportunity was PERFECT. It’s what I’ve been looking for 1.5 years. I ended up having a second interview and did very well. Same prep, same mindset. \n\n\nI was waiting on pins and needles for over a week. I was sick to my stomach every day, waiting to see my phone light up. \n\n\n\n\n\n\n\n\n\n\n\n\nWell, I was just provided an offer to join the firm as an associate exactly a year from the day I was offered my clerking position. It pays over double what I make now. But more importantly, it’s an opportunity where I can be a sponge and soak up as much information as I can from one of the best real estate attorneys in the state. It’s a seven attorney firm, and the work life balance (1600 billable) seems ideal. \n\nI post this story as hopefully a tiny glimmer of light in the dark for the graduate I was a year ago. I rode a rollercoaster of emotions… highs and lows, but mostly lows. There were days where I didn’t want to continue, where I wanted to go get a non-law job. Almost every day I would question if I could do it. I would question when I would sacrifice who I was to just get any litigation job. \n\nMy advice to you, don’t give up. Don’t ever give up. Work your fucking ass off like your life depends on it. Know what you want and *never* sacrifice who you are to become someone you don’t want to be. \n\nFind out what keeps you going. For me, it was Tony Robbins, David Goggins, TJ Jakes, Les Brown, and a slew of those other thinkers. It was the “what if?” question that was burned into my brain. IT was the, “what if I, as a first generation college grad, worked my fucking ass off to get into law school, made it, and worked my ass off to get a job practicing exactly what I want to do?” I thought about it every day. I would write words and ideas and phrases on my mirror in the morning. I would constantly surround myself with positive and uplifting thoughts, quotes, and speeches. I would drive the 45 minutes to work every morning and listen to those same motivational speakers (*although I hate calling them \"motivational speakers.\" Motivation is shit. You need to be driven*.). \n\nSo here I am, a year later, begging you not to give in. I don’t know how long your struggle will last, but I can promise you that if you give a whole lotta' effort and have a little bit of faith, you will succeed. It's the times when you're in the shit, questioning whether you can go on, that make the success worth it. You are more capable than you think you are. \n\nThe most empowering concept I ever learned (from Tony Robbins's work) was that we are all only the story we tell ourselves. If you don't like where you are, reframe your perspective. If you don't like the story you have been telling yourself about who you are, change it. This concept is WAY deeper than I can describe right now, but I'm happy to explain how I used it. Or just read *Awaken the Giant Within*. \n\nI remember an army commercial that played years ago that asked, \"If someone wrote a book about your life, would anyone want to read it?\" Make your journey worth a read if to no one else but yourself. \n\nI am happy to chat with ANYONE who’s feeling stuck in the mud, feeling like they are getting their teeth kicked in on the daily. PM me. I was you.\n\nBook Suggestions:\n\n\"Can't Hurt Me\" - David Goggins\n\n\"The Obstacle is the Way\" - Ryan Holiday\n\n\"Awaken the Giant Within\" - Tony Robbins\n\n\"Man's Search for Meaning\" - Viktor Frankl",
    "title": "A message to the hopeless unemployed/underemployed grad.",
    "subreddit": "LawSchool",
    "timestamp": 1564157532,
    "score": 269,
    "keyword": "brown judge"
  },
  {
    "text": "A disturbing feeling So I was listening to Shallon Lester last week.  And for those who don’t know she’s like these relationship adviser that annalité celebrities relationship to give you lessons. And before you judge I watch for the comments that are under because I wanna know how can you conclude things based off of staged things. Because you only see a part of their relationships and you legit don’t know what’s going off behind close doors.  I wanna see how she can deduct and what she deduct.\n \n \n \n However she touched up Drake and mentionned Chris Brown ans mentionned him beating Rihanna and even said that she’s sure that he raped her.  \n \n Chris Brown is a colorist and an abuser.  However a rapist? I don’t know about that. Unless you’re a victim or somebody who might have been a victim you can’t sit here and saying people are rapists. She was taking like it was dinner time tea. Like you know when a men’s girl say « I’m sure Heather copied me last week. Or I’m sure Heather bought those at Walgreens and not at Dior. She wore fake chanel last week » she legit talked bout it like that.\n \n \nAnd maybe it’s because when you hear stories of city being burned down and kids being killed because somebody was accusing people of being rapist  (black men being accused by white women) \n\n \n\n Chris Brown is a piece of shit but I don’t condone claims that are thrown out because you think you’re some expert.\n \n \n \n[if he can beat a woman he can rape a woman ](https://youtu.be/-HSLZaL-JlQ) \n \nLike am I wrong for feeling appalled that she’s just throwing it out there?",
    "title": "A disturbing feeling",
    "subreddit": "blackladies",
    "timestamp": 1569019414,
    "score": 3,
    "keyword": "brown judge"
  },
  {
    "text": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education   \n\nOrwell’s famous dystopia *1984* is often cited as a parable  about the banality of administrative evil. The ever-vigilant bureaucrats  of Oceania position themselves not only on the Left side of history,  but also at its *end.* To err from their ideology is treason.\n\nThe citizens of Oceania live in a state of self-imposed hypnosis  where they have to pretend that even the simplest of words signify their  exact opposites. The government agency that specializes in espionage  and torture is thus called *The Ministry of Love*. The Ministry views every sexual act as a potential crime unless proven otherwise via affirmative surveillance.\n\nImagine a federal agency that has invested itself with the authority  to monitor the most private details of citizens to root out sexual  heresy. Imagine a federal  agency which once contemplated [installing security cameras](http://pgbovine.net/OET-Draft-Grit-Report-2-17-13.pdf) in every classroom in order to monitor the facial and optical muscles of all students nationwide.\n\nThis agency was so devoted to its ideological mission that it never presented its [unconstitutional rules](https://www.thefire.org/did-the-office-for-civil-rights-april-4-dear-colleague-letter-violate-the-law/) to the American public to consult their opinion, considered itself to be [a superior alternative](https://www.huffpost.com/entry/why-students-are-fighting-for-title-ix_b_58e27314e4b0ca889ba1a848) to the criminal justice system, granted itself [universal jurisdiction](https://www.insidehighered.com/news/2018/01/19/feds-find-buffalo-state-failed-investigate-alleged-sexual-assault-created-hostile), threatened many colleges with financial death unless they punished [constitutionally protected speech](https://www.nas.org/blogs/dicta/ocrs_new_sexual_harassment_guidelines_threaten_academic_freedom_due_process), sought to abolish the [“reasonable person” standard](https://reason.com/2016/09/12/ocr-to-frostburg-state-university-common), and created [a class of imitative bureaucrats](https://www.nas.org/blogs/dicta/gender_inequity_among_the_gender_equity_enforcers) in academic institutions to perpetuate an industry of victimhood.\n\nImpossible, you think? We have just objectively described the record  of the Department of Education’s civil rights branch, the Office for  Civil Rights.\n\nThe Office for Civil Rights (OCR) received bipartisan and  professional criticism for its unconstitutional actions during the Obama  administration. Formal critics include the [Federalist Society](https://regproject.org/wp-content/uploads/RTP-Race-Sex-Working-Group-Paper-Campus-Misconduct-Proceedings.pdf), [Heritage Foundation](https://www.heritage.org/crime-and-justice/report/campus-sexual-assault-understanding-the-problem-and-how-fix-it), [National Association of Scholars](https://www.nas.org/articles/nas_applauds_secretary_devos_decision_on_title_ix),[ California Governor Jerry Brown](https://www.wsj.com/articles/jerry-browns-title-ix-veto-1508280834), [Justice Ruth Bader Ginsburg](https://reason.com/blog/2018/02/19/ruth-bader-ginsburg-due-process-me-too),  [American College of Trial Lawyers](https://www.actl.com/docs/default-source/default-document-library/position-statements-and-white-papers/task_force_allegations_of_sexual_violence_white_paper_final.pdf), and [Reason Foundation](https://reason.com/blog/2017/09/07/betsy-devos-rape-ocr-title-ix-campus).\n\nMoreover, courts that have heard cases involving OCR’s Title IX  procedures have often strongly denounced them. Examples include  condemnatory opinions from the [Second Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca2/15-1536/15-1536-2016-07-29.html) and the [Sixth Circuit of Appeals](http://www.opn.ca6.uscourts.gov/opinions.pdf/18a0200p-06.pdf). In a recent [Seventh Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca7/17-3565/17-3565-2019-06-28.html)  opinion, Judge Barrett stated that “Purdue’s process fell short of what  even a high school must provide to a student facing a days-long  suspension.” Professor KC Johnson [has covered the case in greater detail. ](https://www.city-journal.org/john-doe-v-purdue-univ)\n\nObama’s OCR espoused a particular brand of radical feminism.  According to this doctrine, taught across the nation in women’s studies  departments, men have brutalized women since the beginning of history.  Past oppression must be remedied through government intervention,  eliminating the due process principles that are meant to protect every  American.\n\nThe perils of government tyranny aside*,* the fundamental  assumptions of the “patriarchy theory” cannot survive rational scrutiny.  While it is true that women were historically denied various rights,  they have also been sheltered from grievous harm (combat, for example).  Also, analysis of federal aggregate data from the United States  demonstrates that women are [as likely to engage in sexual coercion](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) against men as [vice versa](https://www.sciencedirect.com/science/article/pii/S1359178916301446?via%3Dihub), which undermines the “patriarchy” narrative.\n\nAt any rate, past historical wrongs cannot be rectified by unfair treatment in the present, as the Eighth Circuit stated in [this ruling](https://cases.justia.com/federal/appellate-courts/ca8/18-3077/18-3077-2019-03-06.pdf?ts=1551889833).\n\nOCR’s historical record speaks to its lack of fairness. The agency  authored a total of 255 resolution letters (formal decisions in a case)  from 2012 to 2019.\n\n[Pekgoz summarizes the circumstances in a Synthetic Analysis](https://static.wixstatic.com/media/ea7b71_a751c44c74dc4e8fa8f35666ab9b81a1~mv2_d_3812_2108_s_2.jpg/v1/fill/w_3812,h_2108/PrintScreen%2C%20Synthetic%20Analysis.jpg).\n\nThe analysis shows that whenever OCR wrote a resolution letter  between 2012 and 2019 to adjudicate adversarial proceedings between  female and male parties, they sided with the female 216 times but only 9  times with the male (2400% more likely to side with the female). Their extreme partisanship is clear in every  aspect of Title IX.\n\n&#x200B;\n\n* **Athletics.** The Department’s athletics compliance tests have been [rightfully criticized](https://www.nccivitas.org/2010/title-ix-blind-quota-system-or-how-kneecap-college-sports/)  for imposing unconstitutional quotas. The agency sided with female  athletes 63 times, but sided with the male only once between 2012 and  2019. The only resolution letter favorable for male athletes is the [Temple University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03142257-a.pdf).\n* **Grading.** The Department sided with female students who alleged [discrimination](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/06112126-a.pdf) in [grading](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11162077-a.pdf) on [multiple occasions](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15132147-a.pdf), while dismissing [very similar allegations by male students](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/07132238-a.pdf).\n* **Retaliation.** The Department sided with female  complainants alleging retaliation on many occasions. There are at least  23 letters in this category, such as the [Jacksonville State University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/04142086-a.pdf)  where the agency sided with a “falsely accused” woman. There is no  clear example of the Department siding with a male student alleging  retaliation on the basis of sex, [but dismissal letters do exist](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10111376-a.pdf).\n* **Sexual Harassment.** Male students who petitioned the  agency to allege bias in sexual harassment disputes (either as the  accused, or the accuser) had a success rate of 1.1 percent during  2012-2019 (6/532). The Department was very aggressive when it came to  siding with female accusers while consistently dismissing the concerns  of accused males. This is despite male students often suffering  life-altering consequences, such as expulsion or a permanent notation on  their transcript, in addition to severe emotional distress. [Some have committed suicide](https://www.insidehighered.com/news/2017/05/02/title-ix-cases-resulted-suicide-suicide-attempt-two-colleges-prompt-fresh-debate).\n* **Reasonableness.** OCR urged schools to get rid of the  “reasonable person” standard at least twice:  One letter involved a  female student who accused a male teacher of [staring at her breasts for 3-4 seconds](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09141376-a.pdf). Another letter involved a costly systemic review because very young students [were playing “National Grab Ass Day”](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131106-a.pdf) during play time. The agency even sided with a female student whose claims of sexual violence [were disproven via DNA evidence](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15112115-a.pdf).\n* **Due Process.** While sending a dismissal letter to an accused male student, OCR argued that [“due process” is not covered by Title IX](https://www.scribd.com/document/426012564/Samuel-Meritt-University-Dismissal).  As long as the accused is a man, that is. Federal bureaucrats  aggressively sided with women who were accused of various sexual  infractions. On one occasion, the Department condemned a university for  allowing a male [to file a counter-claim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11116001-a.pdf) of misconduct against a female student. Another time, the agency [threatened a university](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/01102089-a.pdf)  with loss of federal funding for pressing fraud charges against a woman  who made false accusations. There is also an example of OCR using [defamation theory to side with a female complainant](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11141175-a.pdf), even though the agency has never accepted any complaints concerning the damaged reputations of accused men.\n* **Single-Sex Programs.** Women are the majority of college students, but many colleges offer dozens of support programs [for women only](https://www.jamesgmartin.center/2019/05/identity-politics-versus-basic-logic-should-colleges-offer-affirmative-action-for-the-female-majority/).  Whenever male complainants challenge female-only programs, such as  women’s centers or STEM camps for girls, the Department has dismissed  their complaints on various pretexts. One popular pretext is that these  female-only programs cannot be challenged unless men specifically apply  to them and receive rejections, thus creating a putative victim.  However, OCR has resolved [procedural complaints in the absence of any victim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/02152290-a.pdf) on many occasions, as long as the objective [was consistent with their agenda. ](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03121217-a.pdf)\n* **American Psychological Association (APA) Guidelines.** OCR dismissed a Title IX complaint challenging the APA guidelines, which sought to [classify masculinity as a mental illness factor](https://www.dailywire.com/news/46458/foia-request-reveals-boston-title-ix-office-has-ashe-schow).  This was despite serious public outcry against those guidelines. In the  dismissal letter, officials argued that Title IX cannot be applied in a  manner that would interfere with curricular materials. That was false.  OCR has aggressively interfered with [the training materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11142219-a.pdf) and [the curricular materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131096-a.pdf) of [various colleges](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10131040-a.pdf) as long as doing so furthers their gender agenda.\n* **Administrative Closure.** OCR has a rule requiring  the dismissal of pending complaints if similar allegations have been  filed elsewhere. This rule is rigorously applied [to male students to dismiss their Title IX complaints.](https://www.documentcloud.org/documents/3479594-Stanford-University-09-15-2324.html) However, when [female students file complaints against their institutions](https://www.ed.gov/news/press-releases/office-civil-rights-launches-investigation-university-southern-californias-handling-sexual-harassment-claims), administrative closure is not applied to dismiss their allegations.\n\nSome might assume that OCR has received few meritorious complaints  from male students. According to a Freedom of Information Act request,  however, the Department received [532 complaints](https://www.scribd.com/document/426016051/FOIA-All-532-Cases-With-545-Relevant-Allegations) from men in the sexual harassment category alone between 2011 and 2019.\n\nThe Department of Education became a hive of identity politics under  Obama and there is little evidence of improvement. The modest reforms  proposed by Secretary Betsy DeVos have not yet been implemented.\n\nResolution letters published under the Trump administration perpetuate the Obama doctrines. For example, [the Stanford University letter](https://provost.stanford.edu/wp-content/uploads/sites/4/2018/04/OCR-Redacted-Stanford-Letter-of-Finding.pdf) tried to eliminate the reasonable person standard. [The Butte-Glenn Community College letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09132096-a.pdf) involved a retroactive review of many old complaints, demanding the creation of a complex bureaucracy. [The Buffalo State University letter](https://www.insidehighered.com/sites/default/server_files/media/OCR-SUNY-Buffalo-State.pdf) wrongfully claimed that off-campus incidents fall under the jurisdiction of Title IX, [despite case law to the contrary.](https://caselaw.findlaw.com/us-8th-circuit/1410731.html)\n\nUnsurprisingly, some politicians want to abolish the entire Department of Education. Representative Thomas Massie has [introduced a bill](https://massie.house.gov/newsroom/press-releases/rep-massie-introduces-bill-to-abolish-federal-department-of-education)  to do just that. While we cannot predict whether the Department will  ever be abolished, we must never cease our vigilance against our very  own *Ministry of Love.* \n\n*Kursat Christoff Pekgoz is a PhD student at the University of Southern California.*\n\n*James E. Moore, II is professor of industrial and systems  engineering; public policy and management; and civil engineering at the  University of Southern California.*\n\n[*https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/*](https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/)",
    "title": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education",
    "subreddit": "MensRights",
    "timestamp": 1570815774,
    "score": 15,
    "keyword": "brown judge"
  }
]