[
  {
    "text": "Did I overreact? A few weeks ago I visited a friend, who's home is a short walk from the bus stop. When I was waiting for the bus to head home, this middle-aged (maybe 40's?) guy comes up to me and asks me something like \"does the X bus stop here?\" I told him yes, and he continues the conversation. He asked me what I was doing in the area, and I told him I'd been visiting a friend. At this point I was starting to feel a bit uncomfortable, but didn't want to stereotype him so I ignored it (I also have anxiety so I figured I was blowing things out of proportion). He asks me if I lived far away and I answered \"not really,\" and give him the nearest major intersection when he asks for specifics. He then starts asking how old I am (told him I was 18), if I was Chinese (yes), and if I had a boyfriend. I lie and say yes to the boyfriend question because now I'm *really* uneasy and there's still no sign of the bus, and when he asks if my boyfriend was Chinese, how old he was, etc I start looking around to see if there's anyone nearby. We're in the suburbs so it's pretty deserted. He starts asking if I thought Chinese people should only date other Chinese people and I start thinking \"okay I completely overreacted\" and relax, explaining that I didn't think relationships should be separated along racial/ethnic boundaries. He then goes, \"what do you think about a Chinese person and a Filipino person?\" and he'd previously told me he was Filipino so my brain goes *i dOn'T liKe tHeSe uNDertOneS* and I blurt out something like \"oh my goodness so sorry but I forgot something at my friend's place nice talking to you bye\" and speedwalk away??? I'm really paranoid that he's following me so I try to go in the general direction of her house and end up ducking into this shortcut/alley thing right between two houses, one of which has people talking in the front yard. I end up staying there for like 15 minutes on my phone wondering if I should call someone (or at least pretend to), and slowly creeping back to the bus station once I'm fairly sure a bus has gone. The guy's gone but I still can't relax and since I told him the general location of my home I end up terrified the entire way back.\n\nSorry about the run-on sentences and rambling but this has been bothering me for a while. I haven't told anyone this happened and I feel like I made assumptions about his intentions. He never actually did anything and the things he said weren't even overt. He could've genuinely been trying to make conversation and just had bad social skills or something and I'm afraid that I misjudged him based on my own biases. My friends are all inherently biased towards me so I wanted the opinion of a neutral third party because if I have no idea what to do if I were ever in that situation again. I don't want to think badly about every middle-aged male stranger who talks to me.\n\nAlso, more info in case people were wondering:\n\n\\- I didn't see a need to lie about where I lived since he seemed pretty friendly\n\n\\- the info I gave on my \"boyfriend\" was really about my ex, who I'm still on good terms with. He's the first person that popped into my mind and while I was hiding in the alley I thought about calling him since I knew he wouldn't judge me (but I didn't because it hadn't been that long since our breakup and me calling him felt strange in that context, plus I didn't want to bother him)\n\n\\- I didn't hide out at my friend's place or call her because we'd both left her place at the same time, just in different directions. I couldn't exactly go back to her empty house and didn't want to bother her with a call\n\nTo anyone who's made it this far: thank you so much for slogging through! I know I should edit this but I don't really want to re-read what I wrote because putting it into words was uncomfortable enough. Even if you don't comment, I'm grateful you took the time to read this <3 thanks again!!\n\nAlso, really sorry if I broke a rule - is there a way to vet posts/comments before I make them?",
    "title": "Did I overreact?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1563511974,
    "score": 5,
    "keyword": "chinese judge"
  },
  {
    "text": "Gap year after just a few months of work experience as an engineer? Hello guys,\n\nSo as the title says I'm planning a gap year after 8-9 months of work. I finished my master's degree on December 2018, Computer Engineering. I'm currently 26 and will be 27 by the time I start my gap year. Let me explain this gap year I'm talking about.\n\nI won a scholarship to learn chinese at a chinese university of my choice. This would take me to China for, at least, 9 months. That means I would need to quit my current job and focus on studying the language for a full academic year. I'm scared shitless that this might impact my career because employers would look at it as something negative. \n\nI already have the acceptance letter from the University (came in the mail today). All I need to do right now is choose. I'm a super anxious and undecided person so the choice is pretty difficult for me (don't help that my father thinks I'm stupid and constantly judges everything I do). I feel wrong for choosing the gap year for some reason, as I already feel old and that I should just focus on my career.\n\nI would really love to hear your opinion on this. Thank you all.",
    "title": "Gap year after just a few months of work experience as an engineer?",
    "subreddit": "careerguidance",
    "timestamp": 1565637197,
    "score": 2,
    "keyword": "chinese judge"
  },
  {
    "text": "Law jobs with a great résumé and a terrible GPA? I graduated from a tier 3 law school 2 years ago. I ended up with a 2.77 GPA due to my own personal issues. I had a 3.6 at a top 20 university undergrad. I lived with my parents during law school, and my mom is a bipolar alcoholic who kicked me out a week before finals first semester. It all went downhill from there with my fiancé breaking up with me at the end of 1L year, and then I was hospitalized with panic attacks and an anxiety attack going into 2L year. I had a major depressive episode my 2L year, and basically the worst 15-18 months of my life right in the middle of law school. I got back on track academically 3L year, but it wasn't enough to bring me up. \n\nI ended up hating law, and never took the bar. I moved into tech due to my bad GPA. Now, two years later, I want to get back into law. So, my college internships were in the U.S. Senate and U.S. House of Representatives. In law school, I worked at Guantanamo Bay as a human rights observer, spent a summer studying Chinese corporate law and trade policy in Beijing, worked in prisons in a country in Africa (not saying where because throwaway), and a professor pulled for me and gave me a post-graduate legal fellowship abroad (again, not saying where) working in refugee and asylum law (on a student law license). I've also run political campaigns at the local/municipal level, and interned for a local judge during the school year. I've now worked for two tech companies. Both experiences have been great. \n\n&#x200B;\n\nIs there any way I can go back now, take the bar, and a law firm would look at a 2.77 from a tier 3 school? Will I have to start at the bottom somewhere wherever they'll take me?",
    "title": "Law jobs with a great résumé and a terrible GPA?",
    "subreddit": "LawSchool",
    "timestamp": 1576453745,
    "score": 9,
    "keyword": "chinese judge"
  },
  {
    "text": "American Born Taiwanese but from my Mainland China friends, I get \"it's a shame your parents didn't teach you Mandarin\". Hello, Born and raised in US. My parents are from Taiwan. I grew up speaking Taiwanese never Mandarin. I guess it's because my parents feel more Taiwanese than Chinese. Taiwanese is how they spoke to each other and all my relatives. \n\nI grew up in New Jersey in a community where me and my family were the only Asians so my challenges growing up were mostly about being judged for being Asian by non Asians. \n\nBut being in New York, more culturally and ethnically diverse community, I feel the judgement is coming from other Asians - specifically Mainland Chinese Asians. I have really close friends that came here from Mainland China for school and  I have known for years who I see eye to eye on so many things but I will constantly get the \"it's such a shame your parents didn't teach you Mandarin\".  \n\nWith the rise of China as a power, sure learning Mandarin would have been an advantage business wise but the comment  comes off more a judgement about how I was raised.. The little digs used to bother me a lot but now it just makes me angry because as friends we should be embracing each other's unique background and experiences rather than disparaging it. And who has control over how they were raised anyway. \n\nI think it is also such a China centric thing to say - that learning Taiwanese was waste of time.  Because to Mainlanders, Taiwan is part of China so of course everyone should know Mandarin instead. They refuse to acknowledge that there are people in Taiwan that might actually think differently. Strangely, they don't have this same close mindedness when it comes to my friends that only speak Cantonese and have parents from Hong Kong. \n\nAnyone else experience this or have insight into this?",
    "title": "American Born Taiwanese but from my Mainland China friends, I get \"it's a shame your parents didn't teach you Mandarin\".",
    "subreddit": "asianamerican",
    "timestamp": 1557556750,
    "score": 50,
    "keyword": "chinese judge"
  },
  {
    "text": "'Chinese food' very broad, vague term: Top Chef judge",
    "title": "'Chinese food' very broad, vague term: Top Chef judge",
    "subreddit": "asianamerican",
    "timestamp": 1557887629,
    "score": 10,
    "keyword": "chinese judge"
  },
  {
    "text": "Arizona Federal Judge Sentences Chinese National For Conspiring To Export Military Secrets",
    "title": "Arizona Federal Judge Sentences Chinese National For Conspiring To Export Military Secrets",
    "subreddit": "asianamerican",
    "timestamp": 1571435041,
    "score": 0,
    "keyword": "chinese judge"
  },
  {
    "text": "Someone asks on Quora the rights that US men have that women do not. Someone else replied with a genius answer. Question: What rights do men have in the USA that women don't?\n\nAnswer:\n\n \n\nWe have a ton more rights in the USA (I’m from Canada but I was there for long enough to see what rights men had)\n\n1. The right to get raped and be forced to pay child support: [Statutory rape victim forced to pay child support](https://www.usatoday.com/story/news/nation/2014/09/02/statutory-rape-victim-child-support/14953965/)\n2. The right to genital mutilation without our consent: See circumcision\n3. The right to be laughed at if we get raped: See prison rape jokes\n4. The right to be “made to penetrate” and not have it count as rape\n5. The right to be legally forced to go die for the country if we want to vote: See conscription.\n6. The right to be falsely accused and robbed of home and possessions: See Duluth Model.\n7. The right to have parental fraud committed against us—It is rather difficult to commit maternity fraud while paternity fraud has been around since sexual reproduction existed.\n8. The right to be forced to become a parent: See sperm-jacking. If an equivalent of deception causing pregnancy was done against a woman, we’d call it rape.\n9. The right to have almost no domestic abuse shelters for men. This is of course in the interests of promoting masculine independence and because men can totally run away from an abusive woman with the kids without getting jailed for “kidnapping”. (sarcasm)\n10. The right to be treated as jokes if we decline sex: [Girlfriend, 21, stripped naked and ‘violently attacked’ boyfriend when he refused sex](https://www.thesun.co.uk/news/8458539/girlfriend-violently-attacked-boyfriend-refused-sex/) I’m quite sure this woman would have gotten away with a slap on the wrist at most if she hadn’t been stupid enough to spit on the cop.\n11. The right to be paid less per hour because you worked longer hours in a harder job than a woman was willing to do and thus are contributing to the “wage gap”, so we must pay women more! [Women in their 20s earn more than men of same age, study finds](https://www.theguardian.com/money/2015/aug/29/women-in-20s-earn-more-men-same-age-study-finds)\n12. The right to be judged short if we’re under 6 feet and labelled intimidating if we’re taller and broader than a woman.\n13. The right to be seen as weak if we don’t work out and brutish if we do.\n14. The right to be discarded as useless if we don’t know something and be decried as mansplaining if we do.\n15. The right to repeatedly and publicly commit the crime of manbreathing.\n16. The right to be publicly hated for existing (or rather, the crime of manexisting).\n17. EDIT 2: The right to be accused of either being predators or just wanking our consciences when we do exactly what women ask us to do and they don’t like it. [Why I won't date another 'male feminist' | Kate Iselin](https://www.theguardian.com/commentisfree/2015/oct/19/why-i-wont-date-another-male-feminist)\n\nThis list is non-exhaustive.\n\nEDIT: Wow, my first answer over 1K upvotes. Just remembered something to add…\n\nThere are a few rights Canadian men have that Americans don’t though. For example, this right observed to be possessed by Canadian men, according to a University of Toronto student who is a Feminist:\n\n1. The right to #FartRape women by farting louder than a woman who farted audibly in public. This is obviously the man chastising the woman for farting audibly in public and therefore violating her. (Source: [Can a fart be misogynist?](https://thewaterpipe.wordpress.com/2013/12/22/can-a-fart-be-misogynist/))\n\n(Since I am Chinese and the Chinese have a idiom that translates to something like “Who rules Heaven and Earth cannot dictate shitting and farting.” you can tell what I think of #FartRape)\n\n&#x200B;\n\nSource: [https://www.quora.com/What-rights-do-men-have-in-the-USA-that-women-dont](https://www.quora.com/What-rights-do-men-have-in-the-USA-that-women-dont) (the first answer with over 2.7k upvotes by Run Ze Cao)\n\n&#x200B;\n\nDISCLAIMER: This answer is in no way, shape, or form mine. I saw this while browsing Quora and wanted to share this with you guys.",
    "title": "Someone asks on Quora the rights that US men have that women do not. Someone else replied with a genius answer.",
    "subreddit": "MensRights",
    "timestamp": 1552623018,
    "score": 368,
    "keyword": "chinese judge"
  },
  {
    "text": "ContraPoints has cisgender heterophobia. Traps are indeed not gay, but entrapment is not virtuous. ContraPoints \"Traps are not gay\" is somewhat agreeable, to an extent..\nhttps://youtu.be/PbBzhqJK3bg\n\nBut she missed out crucial facts about reality.\nAll behaviour, including female behaviour can be traced back to the desire to not get a Darwin award. Women are what must be protected to ensure a successful future of the group provided there is at least _a_ male left, and drives their individual behaviour, like all of us, in ways we are both aware of, unaware of, or find uncomfortable. Like women's increased empathy for their children and family.  Its why we value women's health and judge them on their beauty. A man is evolutionarily replaceable in comparison. One man, no matter how overworked, scarred, mutilated or damaged can make pregnant hundreds of thousands of women, at the same time. Of course it happens to be mainly the strong, adventurous, aggressive risk taking but lucky men, regardless of damage along the way, that were the ones that were not erased from the face of the earth. Any that were were were just society's excess. It's just life for unlucky men, and still is. It's why we value them only by their ability to be successful and provide. One woman can only have one baby at a time, for a maximum in the order of a few tens, and so each woman, provided there are a few men left, is worth more alive and healthy, and has been since the dawn of time. She also acts, in every part of her behavior, to be the one that has a right to any man's sustenance and protection when available. That why we treat men, especially underprivileged men, as disposable - homelessness, war, suicide, healthcare, not caring when \"weak\" men are victims of domestic abuse. Women get a multiple billion £\\$ lobby and support establishment to protect their interests and make sure they are looked after from cradle to grave, however valid it is to want to do this in its own right, and however valid each cause is. And why some feminists hate transwomen \"piggybacking\" on their ruthlessly fought for social privileges.\n\nNow men too _might_ want to have a say in society caring for them as individuals, beyond just hoping they are lucky enough to look after themselves... I don't know, its a controversial opinion. But, regardless of whether men care or not about their genes being killed off - commuting gene suicide - kind of like a one person genocide - something like what people feel like when being \"erased\" - for some odd reason, society shows time and again that men are always the back of the queue for empathy, even when they are actually being erased, because society knows that since the dawn of time that they are in fact replaceable.\n\nLet's just keep playing the game, why not? Bad thing never happen when we treat men as disposable right?\n\nOne further way for a man to get a Darwin award is to have a relationship with a woman that cannot have a child, if she hides from him that she cannot have a child. Sure, up to her, it's personal and her choice not to say. Equally, some men might not want to say that they cannot have kids, or hide that they are a drug addict, or pretend they are much more wealthy than they are, despite being totally broke and in massive debt. Up to them right? He's never laying an trap. Right? It's his business whoever he happens to be.\n\nSure, I'm with her, it's not a trap. Men have the right to withhold any information from who they are dating, regardless of what emotion it would cause if a woman were to find out the truth about him, or what that truth was. He is what is is, and if she's attracted to him that's all she needs to know. /s.\n\nAs it happens, I've had sex with a transwoman, and might potentially date one long term in the right circumstances. But it is not virtuous with withhold information a potential partner. You have a right to, but that does not make it not a trap, when crucial relationship information is being withheld. Of course everyone from gay men, effeminate men, to transwomen, or  bipolar women, or anything that can effect the success of passing on genes - *are not traps*. No-one is fundamentally \"A TRAP\". But everyone is equally capable of trapping someone about the evolutionary potential, or attraction otherwise that they can offer. I do consider it immoral not to be honest about things that are fundamental to a relationship. I have facts about me that if I were to withhold from a woman, she would be within her rights to say it feels just as bad as rape if I were to have a sexual relationship with her and withhold - we all do, no-one gets to say. Of course it isn't rape, or illegal, but it's at very least entrapment. I don't get to say what information being withheld is \"not a trap\". I would never tell women that it's simply my right to withhold that information, regardless of what feeling that may manifest itself in in the woman - and say it's simply my right and her concerns are just \"sexist/abelist/misandrist\".\n\nOf course homophobia and transphobia is a bad thing, but that doesn't deny people a right to dating preferences, no matter where they come from, whether related to evolution or not. If a man claiming to be heterosexual is not attracted to blond haired women, blond women cannot claim he is \"not heterosexual\" because they're blond and that man is not attracted to her, despite being a real woman. Or fat/bipolar/tall/anorexic/Chinese/tomboy/homeless/aggressive/has a child/doesn't have children/trans/Jewish/white. All men that don't date or are not attracted to any type of woman is still heterosexual. Some men might happen to face significant backlash if entrapped by someone of a particular type, through no fault of their own. I know of an Indian man that commuted suicide when he was in love with a white woman because his family wouldn't accept her, and was shamed. It's bad, but not because it's whitephobia. And at least she didn't entrap him, it would have been incredibly irresponsible if it were possible to hide that she were white and did. The Caste system is bad, but people have the choice to it, along with racial dating preferences. Some men might not be ready do deal with a question of what it means to date a transwoman, regardless of the society they come from, and why they are not. Women who don't date homeless men are OK, but having men live on the street is still a bad thing, along with throwing them out on the street.\n\nNo-one is a trap, but people can lay traps. Don't be a manipulative trap and erase someone's feelings about what they find or chose are their dating preferences.\n\nI'd potentially date a transwoman, but never an incompassionate, unsympathetic, manipulative one, to anyone's dating preferences or mine.\n\nThis is what people are often saying when they say \"traps are gay\". When these kind of \"traps\" happen, the entrapment is being justified with a new kind of trans specific heterophobia. Men that don't want to date transwomen are OK, still heterosexual, and can be annoyed to any degree when entrapped. Don't be irresponsible. It's also OK to be heterosexual and date transwomen, of course.",
    "title": "ContraPoints has cisgender heterophobia. Traps are indeed not gay, but entrapment is not virtuous.",
    "subreddit": "MensRights",
    "timestamp": 1549660511,
    "score": 5,
    "keyword": "chinese judge"
  }
]