[
  {
    "text": "Scared shitless for a teaching position Sorry if this is a little bit of a rant, but I am in the process of filling out applications for teaching positions next year, and I just started feeling super scared/nervous. I could really use advice or words of wisdom. Does everyone feel this way when getting their first \"real\" teaching job?\n\nRight now I am teaching at a private preschool and really dislike it. It's difficult to explain, but students learning sometimes seems to be the last thing on the directors and owners mind. The job is not \"easy\" but it's not as much \"paperwork\" (lesson planning, student evidence, backing up my teaching, formal observations) as there would be in a public school. Less of the known modern pressures teachers have.\n\nI walked in my first day to a fully furnished and supply stocked classroom. This school is located in a predominantly Chinese area, and all of my students, TAs, other teachers, and school owners are Chinese. They have traditional views of schooling, which I do not agree with. \n\n\nI went through a 5 year master program for special education and graduated 2 years ago. First year I was a TA, and now I am here. I am really getting nervous at the thought of having a \"real\" teaching position where I have to build a classroom from scratch. The task seems so daunting right now. Is this how all teachers feel their first few years teaching? \n\nThis is actually a little difficult for me to admit. All I've ever wanted to be is a teacher, I've studied hard and have experience, but I KNOW there is knowledge and skills I lack. Of course it's something I'm working on, but I constantly hear about the pressures of teaching, pressure from admin, parent horror stories. Makes me wonder if I'm really cut out for it...",
    "title": "Scared shitless for a teaching position",
    "subreddit": "Teachers",
    "timestamp": 1491437795,
    "score": 8,
    "keyword": "chinese director"
  },
  {
    "text": "My company is running an incredibly insecure production environment while holding millions of sensitive and personal documents. They will not listen to my consult on securing the system. What can I do? My company is running an incredibly insecure environment on a cloud platform and I have ethical concerns with the data security and how the systems are being (mis)managed. I am a senior plus level developer with complete access. I have brought these issues up with executives and management over the past 2 years, and nothing is being done. A few obvious risks our system contains:\n\n- All logins to the SQL database are stored in plain text. These SQL logins are full sysadmin. We have off shore development teams that know the login information because these logins are in nearly all of our configuration files, of which they have access to as they are able to RDC into the production servers and open them up. In fact, I've caught some of them using the logins in order to circumvent the limited access we have setup for their Windows credentials. The engineering director was aware of this when I caught this happening, and did nothing.\n- All Azure blob/Amazon S3 accounts and keys are stored in plain text. Again, these accounts and keys are stored in configuration files that can be accessed by more eyes than we probably even realize. These storage accounts contain sensitive and personal information/documents. All it takes is for a malicious individual to grab hold of the account and key, and press “Delete.” Active replication/geo-redundancy is not a thing here.\n- Windows Update has not been ran (including security patches) in over a year. I understand patching Windows Updates and ensuring application stability incurs additional resource time, but my company is not taking any efforts to implement proper procedure for patching the servers at a regular interval.\n- Our servers are open to the internet and are being brute forced as we speak. Proper Windows RDC 101 should be to require a VPN to access application servers, especially your SQL database servers. Instead, every single one of our servers is completely open to the internet. Anyone with a login is able to connect from any part of the world without a proper audit trail. This isn't even exclusive to our Windows Servers. We have Linux servers that have remote root login enabled, and is seeing endless failed login attempts. Each day there are roughly 40,000 failed attempts to every one of our servers, primarily from Chinese IPs that are directly linked to known botnets.\n\nMy company is not short of funds to hire proper system administrators, or an expert security consultant that will analyze our system and assist with its flaws, or allocate development time towards securing the system even at these most basic levels. However, they refuse and ignore my (and other's) pleas. They funnel resources into new development of new products that are over a year before being release worthy, all the while these items remain untouched and have been untouched for years.\n\nGiven the sensitivity of our data and the sphere in which we work with, I have great ethical concerns with how they are selling this product (especially considering our contracts have bogus \"security\" clauses that state we have robust \"intrusion detection systems\"). All it would take is for one person to become malicious with the database, storage account, etc., and hundreds of millions of incredibly sensitive/personal records would be leaked or lost.\n\nI have sent yet another plea today to my executives and management, but I am sure it will be met again with apathy. Has anyone faced this type of issue? I do not feel comfortable with how my company is handling system security, and I fear that it is only a matter of time before the system is compromised (assuming it isn't already.)\n\nWhat can I do?",
    "title": "My company is running an incredibly insecure production environment while holding millions of sensitive and personal documents. They will not listen to my consult on securing the system. What can I do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1488244931,
    "score": 227,
    "keyword": "chinese director"
  },
  {
    "text": "Accounting Management Question Hello Reddit,\n\nI am a current accounting manager at a private firm that does about 150 million in revenue I am pretty young for my position and was told I by the boss that he is not seeing enough engagement with my direct team one of which is Chinese national whom I have a very hard time communicating or getting to do anything because she fears I might replace her with someone else, not really sure how to get this person to co-operate I get blown off with an “I am busy right now” whenever I try to engage. I was also told by my boss that he is thinking about potentially bringing on someone else at a director level to see how I felt about that and I said I was open for anything though this has me worried about my position I’ve only been here 3 months. There is a senior accountant that works with the company for 15 plus years and a lot of the team including myself look to this person for council if we are unsure about anything I can’t really get my team to look to me for leadership when this senior accountant is always the fallback resource. Any suggestions from my fellow accountants on what I should do or should I be concerned? I feel I might be out of a job in a month or two.",
    "title": "Accounting Management Question",
    "subreddit": "Accounting",
    "timestamp": 1504620228,
    "score": 2,
    "keyword": "chinese director"
  },
  {
    "text": "Telling our own stories, and our short film 'Ella\" Hi there,\n\nMy name is Dan Chen, and I'm a director and cinematographer. You may have seen a post about our film \"Ella\" a few weeks ago, when we had just launched our Kickstarter. I'm happy to announce that we've reached our funding goal, and we're going full steam ahead!\n\nIn recent years, I recall a conversation I had with several other friends who work in film. We came to the conclusion that any American movie with an Asian protagonist would most likely be categorized as an \"Asian\" movie, or a special interest film.\n\n\"What if I wanted to make something like Dazed and Confused, but the main characters just so happen to be Asian American?\"\n\n\"It's still going to be an Asian movie.\"\n\nThe question stayed with me. Maybe I hadn't fully embraced my own race and identity yet. But I didn't want to make a special interest movie. I just wanted to make a movie.\n\nIt took a lot of inspiration to get to making \"Ella.\" Part of it was seeing artistic, successful minority representation in media, with projects like Master of None and Moonlight paving the way. Another factor was my friend Doug Kim, a producer on our short, writing and starring in a pilot we worked on together, which dealt with his real struggles as an Asian American actor in a courageous and comedic way. Finally, I realized that any character driven story needs to take race into consideration, just as it should explore sex, class, age, and other very real factors that affect who we are and who we become.\n\nIn my view, we can't wait for Hollywood to cast Asian Americans in an interesting, complex way, although putting pressure on them can certainly make them reconsider their actions. We need more Asian creators, just as we need more black creators, more Hispanic creators, and most obviously, more women of all kinds in Hollywood. Because these creators will understand the importance and significance of representation.\n\nPlus they'd have experiences and perspectives that we haven't seen yet. That's not just good social justice... that's good entertainment.\n\nSo this short film is my humble contribution (and if all goes well, the first of many contributions). I'd love support, critique, or sharing if you dig the project. We're currently going for our first stretch goal which would afford us the opportunity to hire a great casting director to help us find our second lead, who'd play a fourteen year old Chinese boy who's seeking acceptance in his small Midwestern town.\n\n[Ella, a new coming of age story in the Midwest](https://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid)\n\nI'm glad to be a subscriber to the community, and look forward to sharing more dialogues and upvotes with ya'll.\n\ncheers,\nDan",
    "title": "Telling our own stories, and our short film 'Ella\"",
    "subreddit": "asianamerican",
    "timestamp": 1490220529,
    "score": 23,
    "keyword": "chinese director"
  }
]