[
  {
    "text": "Can I Rely On My Current Role / End of Probation Negotiation Methods? (Software Development / UK Based) Hi all,\n\nI am in the UK and work as an iOS developer in a small sized tech business (not a startup).\n\nI took the job as my first software dev job having worked in marketing, the job was offering 25-30k so i said 25k as i wanted the experience and opportunity to get into the industry.\n\nSince then ive found the job to be not exactly what was promised, im the sole iOS developer when i was told id have a team, the CEO/Line manager who hired me hasnt spoken to me since my first day nearly 2 months ago and stays in his office.\n\nThe company isnt really making much money but has chinese money backing it which keeps it afloat, the management are totally incompetent but are paid highly despite doing no work and some are known to do their own companies work on company time...\n\nI work on the codebase for the iOS app alone, no guidance, no checks, totally solo. However I have removed all the crashes, fixed the bugs, rolled out several new features, and am working on a major user requested feature currently which I hope to complete before the end of probation.\n\nMy thoughts are that im not sure the companies intention, would they likely keep me on as im the only dev for iOS? its not a core part of their business (they make other hardware and iOS is the remote for it), further to this if i am offered the role fully, i really wanted to negotiate more money for the risk of working there.\n\nBased on what ive achieved and how i am not part of a team as promised, i was hoping to at least get the 30k allocated to the role when i started, and ideally, push for 34k as i want to be getting 2k a month post tax.\n\nI am 26 and wanted to move out so the salary and job security are important for me to progress my life. However i wasn't sure how to handle negotiation post probation, how can i approach the salary and should i be looking for job prospects elsewhere if they say no? The CEO is asian and the business operates in a pretty asian style.\n\nI can provide any further background needed, ive tried to be thorough, i just want to make sure i approach this correctly to achieve what I want in the best method!\n\nAppreciate time and help on this matter.",
    "title": "Can I Rely On My Current Role / End of Probation Negotiation Methods? (Software Development / UK Based)",
    "subreddit": "jobs",
    "timestamp": 1496073804,
    "score": 1,
    "keyword": "chinese ceo"
  }
]