[
  {
    "text": "Employer is knowingly manufacturing goods that infringe on a patent Hey all, I am an (underemployed) engineer at a factory in the USA that I recently found out is using patented designs on their product without paying royalties or being a licensee. This place is a small startup factory using imported chinese machinery to make products. Recently discovered that part of our product is patented tech that belongs to another company. They get around this by importing machine parts from connections in China to use here to make the products. \n\nTo be frank I am at this place because I have a large gap in my resume due to end of life care for my family. It seems like most places view that as an issue so I took this job to fill in some engineering work for my next move. I am afraid that if this patent infringement comes out my career will be tarnished along with the company. I am also scared about what to do with this knowledge as I am currently poor and do not want to get into any legal trouble. \n\nHas anyone else been in a situation like this?  Anyone know what kind of options/protections are available to me if I were to report this to the patent company/authorities?\n\n\nEdit: shout out the mods of /r/engineering for approving this post from a new account so quickly!\n\nEdit2 2/9 6 pm PST: I am still here watching/replying in this thread and I appreciate everyone's view on this. I wanted to clarify something here since I has come up in multiple comments. I know that we are using this companies IP because the patent holders name is stamped into the tools and references we use. All the big producers use this particular features in their products and are licenees. Also the CEO remarked on the patent holder being a neighbor at a trade show 5 minutes before I was \"suggested\" if I could redesign this feature.",
    "title": "Employer is knowingly manufacturing goods that infringe on a patent",
    "subreddit": "engineering",
    "timestamp": 1675959174,
    "score": 312,
    "keyword": "chinese ceo"
  },
  {
    "text": "Does the glass ceiling not apply to South Asians? I am Chinese American and have a lot of friends/family who are the same. Many of them are the kind of people who studied hard, went to good schools, work hard and have jobs at big tech companies where they make good money. From what I've heard Asians dominate many tech industries.\n\nHowever it seems like there is a glass ceiling and you rarely see Asian CEO at these companies which the exception of South Asians. If you just look at the US biggest companies #2 Microsoft and #3 Google have Indian CEO's and #5 Berkshire Hathaway it is likely Warren Buffet will be replaced by Ajit Jain who is Indian American. The CEO of Twitter is Indian American and Google just promoted an Indian American to run YouTube.\n\nI have a lot of respect for Indians and some of my best friends are Indian American. Indians are 1% of US population and Asians are 8%. Just curious why it seems like they can pass the glass ceiling while the rest of us cannot.",
    "title": "Does the glass ceiling not apply to South Asians?",
    "subreddit": "asianamerican",
    "timestamp": 1676577327,
    "score": 24,
    "keyword": "chinese ceo"
  }
]