[
  {
    "text": "Chinese Film \"Hi, Mom\" Becomes World's Highest-Grossing Movie by a Female Director",
    "title": "Chinese Film \"Hi, Mom\" Becomes World's Highest-Grossing Movie by a Female Director",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1617761641,
    "score": 8,
    "keyword": "chinese director"
  },
  {
    "text": "How possible is it to avoid an entry level position without direct experience in an industry? My closest direct experience to my desired environmental career was consulting work for a solar company that acted as a go-between for manufacturers in China and companies in the West, but that only lasted a few months and was back in 2013.\n\nFor the past 6 years I have been working my way up in non-profit development (currently Development Director in a public health sphere managing a team of 6; formerly a fundraiser for youth development) but am eager for a closer match to my passion for environmentalism. I have an upcoming move and therefore job hunt when my med school wife matches for residency.\n\nI am an Eagle Scout, have a masters in International Relations, am fluent in English and Chinese, some of my undergrad coursework was environment-related, and I even published an article on environmental impacts of large hydrological dams in 2010. Thank you in advance for any advice!",
    "title": "How possible is it to avoid an entry level position without direct experience in an industry?",
    "subreddit": "careerguidance",
    "timestamp": 1613800213,
    "score": 1,
    "keyword": "chinese director"
  },
  {
    "text": "Gah that American \"math\" team post on the front page really bothered me. I get it, it's a casual joke. Asians tend to dominate math competitions. But more importantly, the sense that even though you're winning a competition for America and are American through and through, you're still a foreigner in your own country.\n\nIt used to drive me insane when people asked me \"where are you really from\". I'd want to reply well started in Alabama, moved to Chicago when I was still young before school, and now I work in New York. I would carry my passports out in airports like a badge of honor so people would know I'm \"american\". \n\nAnd it took me decades to unfurl the toxic defense mechanisms I spent my life throwing up. Growing up, I vehemently rejected Asian culture. I hated my name so I changed it legally. I beat the shit out of my body playing lacrosse at a high level because it was the whitest sport (all conference and even then I was known in the conference as the \"asian kid\" or the \"chinky boy with skills\"). I attended a fucking US military academy for a year instead of a top 5 school initially because I wanted to show the world how American I was. \n\nIt took me until 25 and working in Asia on projects for half the year to finally get it. To finally be in a place where the assumption isn't I'm a math guru or code monkey. Where my managing directors don't assume I'm a work horse and nothing more. Where instead of preparing the deck for sales meetings, I got to actual drive the meetings and lead. But more importantly, as I matured, I understood so much more about myself and why I am the way I am.\n\nI never realized how much growing up in the midwest as one of the only Asians in my school would impact my sense of self. My obsession with fitting in and being \"american\" led me to completely reject so much of what makes me well, me. \n\nThis current movement of Asians standing up for themselves and doing it together makes me so fucking proud. I now realize my history and culture isn't just that of China but it's about the workers brought here to build the railroads. The asian communities that popped up early on that suffered untold racism and abuse. The Chinese exclusion act and the Japanese internment camps are some of the most atrocious decisions by my country. But I'm so fucking proud to be part of that history. To know that the strength to endure untold hardship and sacrifice for the future generations flows through me and is part of my history and culture means everything. So thank you to all the activists and people stronger than me who push the narrative. You guys have made me so proud to be Asian American and my children will love and embrace their culture and heritage in a way I never allowed myself to. So thank you.",
    "title": "Gah that American \"math\" team post on the front page really bothered me.",
    "subreddit": "asianamerican",
    "timestamp": 1621955598,
    "score": 115,
    "keyword": "chinese director"
  },
  {
    "text": "List of Asian leads in North American movies and TV in 2021 Asian and Pacific Islander*\n\nProbably missing some, but these are ones I know of:\n\n**Movies**\n\n* **January 29:** Finding Ohana\n* **February 12:** Minari (limited theatrical release)\n* **March 5:** Boogie\n* **March 5:** Raya and the Last Dragon (animation)\n* **April 26:** Mortal Kombat\n* **May 7:** [The Paper Tigers](https://old.reddit.com/r/asianamerican/comments/mzs5ai/quoc_bao_trans_the_paper_tigers_movie_screening/) (limited theatrical release) - tomorrow!\n* **May 14:**  Army of the Dead\n* **June 11:** Wish Dragon (animation - English dubbed)\n* **July 23:** Snake Eyes: G.I. Joe Origins\n* **September 3:** Shang-Chi and the Legend of the Ten Rings\n* **November 5:** Eternals\n* **December 1:** Fistful of Vengeance (Wu Assassins)\n\n**TV Shows**\n\n* **January 5:** Kim's Convenience (season 5 - final season)\n* **January 15:** Bling Empire\n* **March 26:** Invincible (animation)\n* **March 26:** The Irregulars (recently canceled)\n* **April 7:** Kung Fu (reboot - recently renewed for season 2)\n* **April 14:** Announcement for Warrior season 3 (will return in 2023)\n* **July:** Never Have I Ever (season 2)\n* **TBA:** Cowboy Bebop live action series\n* **TBA:** Ms. Marvel\n* **TBA:** After Yang (by the same director, Kogonada, who made Columbus)\n\n**Honorable mentions**\n\n* \"**The Six**\" documentary: About the untold story of Chinese passengers on the Titanic. Released in China in April. International release date still pending.\n* \"**Far East Deep South**\" is a documentary about Chinese-Americans in the Mississippi Delta (on America ReFramed - currently available on PBS website until June)\n* May 23: **Master of None** season 3. Aziz Ansari won't be the main lead for the new season, but will still write and direct. New season will focus on another POC character, Denise, played by Lena Waithe who is also a writer on the show.\n* **Nomadland** was directed by Chloe Zhao who won several awards for this film including Best Director at the Oscars. She will also direct a Marvel movie, **Eternals**.",
    "title": "List of Asian leads in North American movies and TV in 2021",
    "subreddit": "asianamerican",
    "timestamp": 1620330077,
    "score": 39,
    "keyword": "chinese director"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 35,
    "keyword": "chinese director"
  },
  {
    "text": "In China, a Backlash Against the Chinese-Born Director of ‘Nomadland’",
    "title": "In China, a Backlash Against the Chinese-Born Director of ‘Nomadland’",
    "subreddit": "asianamerican",
    "timestamp": 1615042679,
    "score": 19,
    "keyword": "chinese director"
  }
]