[
  {
    "text": "Can I call myself Chinese? I'm half Chinese and half white. Whenever it's relevant I always refer to myself as \"half Chinese\" because I'm a little worried I'd be judged for calling myself Chinese. I'm not 100% sure if I'm supposed to post this here, but I think this is the best place I can get unbiased and honest judgment. The question has been bugging me for a while. \n\nI'll just note some things that are probably relevant. \n\n- I cannot speak fluent Mandarin Chinese, though I am currently learning it. \n- I've been to China (Xi'an, Beijing, and Shanxi province) 2 times that I remember, and a few times when I was a baby. \n- I grew up in a 60% Asian neighborhood. \n- Some people think I look very Asian, while many others don't realize at all. \n- I've read many books on Chinese history, mostly modern history. \n- I currently live in a mostly white area.\n\nEdit: I want to say, I really appreciate all of the responses. I'm seeing a lot of new perspectives.",
    "title": "Can I call myself Chinese?",
    "subreddit": "asianamerican",
    "timestamp": 1693863241,
    "score": 162,
    "keyword": "chinese judge"
  },
  {
    "text": "Senate confirms first Chinese-American woman to serve as a lifetime judge",
    "title": "Senate confirms first Chinese-American woman to serve as a lifetime judge",
    "subreddit": "asianamerican",
    "timestamp": 1695261654,
    "score": 113,
    "keyword": "chinese judge"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 70,
    "keyword": "chinese judge"
  },
  {
    "text": "I'm middle aged but sometimes, I still feel like I don't belong I'm in my mid-40s and by now, I should have it figured out but I don't. I mean, I think generally I do but I got so triggered today. We're heading to Japan in a couple weeks and I know gratuity is not generally accepted.  There are exceptions though and I was asking about those exceptions on a visiting Japan FB group I'm in.\n\n95% of the comments were of disdain and admonishment.  I was accused of feeling superior to the Japanese, of wanting to change their culture, of not wanting to accept other cultures, of not giving a shit about anybody but myself and how so fucking American I am, which given the context, I translated that to how close-minded I am.\n\nWherever their anger is coming from, I'm not judging but it just got me thinking again about how being Asian and not really feeling like you belong anywhere, something I have struggled with my entire life but really it's been  years since I've even thought about. \n You get married, you have kids, your identity shifts to parenthood and raising children but their comments was a stark reminder: I'm too Asian in America and too American in Asia.  Last time I felt that way was in 1998 when I went on Taiwan Loveboat.\n\nI just needed to vent a little and didn't really have a place to do it.  I'm not teaching my kids anything about our heritage.  They're not learning Chinese and while I justify it to myself that, \"I just don't have the time,\" while partially true, if I'm having a hard time as a full ABC, how will my half AA/1/4 German 1/4 Irish/English kids deal with identity when they are older? \n\nI thought I was so over this identity crisis.  Leave it to some internet strangers into shaming me for not being stingy. My terrible attempt at trying to be funny.",
    "title": "I'm middle aged but sometimes, I still feel like I don't belong",
    "subreddit": "asianamerican",
    "timestamp": 1676952510,
    "score": 32,
    "keyword": "chinese judge"
  },
  {
    "text": "Why the Woke ideology is terrible for both men and women & Why you should follow it anyway Who is the woke ideology designed for? women and LGBT. So of course if you're a woman & LBGT you're going to have an easier time supporting the woke movement and see nothing wrong in it. It's like having a 10 years old seeing a Youtube video \"10 reasons parents suck\" or a parent seeing a Youtube video \"10 reasons children suck\", of course you're going to like it since it's in favor of your group. Or Baby Boomers seeing a video \"10 reasons the younger generation suck\". It's pure validation, so why would you question it?\n\nThere's also pro-woke men in hopes that they can get some women if they are \"in favor of women\" because they can't get otherwise. But fundamentally, I would say on the article \"Top Ten reasons Why You Should Live Woke-Free\" number 1 is that Woke is a cope ideology. It doesn't help you improve your life, only helps you cope. There have been studies that the woke ideology is based on cope and on envy (tearing down what others have). That woke people have the lowest linguistic intelligence on average. That woke people are the least likely to understand the point of view of the other political ideologies (not agree with it, but understand it, as in being able to accurately describe it). All these are Red Flags in my opinion.\n\nIf I were part of an ideology based on cope and on envy, with the lowest linguistic intelligence on average, and the least likely to understand the point of view of the other political ideologies, I would seriously raise some questions whether I'm in the right ideology.\n\nBut you know what? let's do it in a clean format\n\n**Top Ten reasons Why You Should Live Woke-Free**\n\n**1. It's a cope ideology** \n\nLet's say you are fat, you don't like the fact you are fat, people are not attracted to you, you don't move your body as fast as you would like to, generally you live a worse life than your non-fat counterparts.\n\nWhat can you do? you can either:  \na) Work on yourself to lose weight, \"I want to be a hot man\".  \nb) Cope, \"It's perfectly acceptable the way I am and I shouldn't be judged for it\".\n\nWe should not make fun of fat people for being fun. But as always, the woke ideology takes a healthy principle and twists it 180\\*. We should not make fun of fat people for being fun. That doesn't mean we shouldn't say \"being fat is unhealthy, being fat is unattractive\" if asked. But the woke ideology goes even further. \"you are fatphobic if you won't want to date me because I'm fat\" and \"people should not judge me for being fat otherwise they're fatphobic\", \"people should love and accept me for being fat otherwise they're fatphobic\" (to hell with their preferences), \"skinny women promote unrealistic body standards\". (well, they exist, don't they? so how are they 'unrealistic' if they exist?)\n\nThe woke defense usually goes in 3 ways:\n\n1. It's not political. The best argument a woke person does when they make a political claim and someone counters it, it's not a political thing to begin with. \"Nah, it's not a woke thing, it's a human thing!\".\n\n2. It doesn't happen that often. \"Come on, you are exaggerating, this doesn't happen nearly as often as you say it does\". This one may actually be in good fait since they never see that, being woke.\n\n3. Extrapolate with something else not related to the subject. \"Oh yeah, so that means that now we have to make fun of people in the wheel-chair for being disabled?\".\n\nLet's say you're a woman. You listen to all this woke and 100% agree to it. Start to over eat, get fat, and then expect everyone else to love you for who you are, freely. You expect men to give you as much of a chance as they give to skinny good-looking women, etc. That doesn't happen. What do you do? cope even harder and become even more entrenched in the woke ideology, saying it's the men's fault for not being attracted to you for being fatphobic. And becoming men-haters, because you want stuff from men but have nothing to offer in return so you cope. And the skinny feminine woke-men who are pro all this thing are not really your type because you learned from the woke movement that you deserve the best, without doing a thing for it.\n\nAnd fatphobic is a wrong term. Going back to the low linguistic intelligence part. Phobia is a strong, irrational fear. People who are \"fatphobic\" are not afraid of fat women in the same way they are afraid of spiders or snakes for example. There's a completely different emotion altogether. It's actually disgust.\n\nBut not calling the people who won't date fat women for being fat  \"fatphobic\" and instead calling them something more correct like \"fat-fastidium\" has some problems. Because if you admit that the core emotion behind it it disgust and not fear. You have to ask yourself some questions: why is it disgust? we are disgusted by things we find lesser, lacking, not important. So it will open a whole can of worms that will eventually lead the woke person in the direction that it's disgust because they are fat and it's a failure of their own doing. And that is a very uncomfortable thought and the very opposite of woke.\n\nIf I were to summarize the whole ideology I would say \"woke is cope\". When you feel you have no chance in life on your own you turn to woke.\n\nYou're fat? instead of cope and becoming feminist, work on yourself. Your true problem is that you are unambitious, want everything in life to come easy, want to blame someone else for your poor choices, and don't want to be judged for this.\n\nAnd the opposite of woke/cope is responsability, personal responsability.\n\nI used fat & \"fatphobic\" as a particular example. But I goes for everything that is woke. For example promiscuity or \"free sex\".\n\nAgain, woke starts from a healthy principle and twists it 180\\*. We should not treat women like we did in 1950s and they should have equal rights. But equal rights = equal responsabilities. And this is where woke people leave the room. Woke promote promiscuity for women, and people who judge you for being promiscous are bad.\n\nAnd I say do whatever you want, if you want to be promiscous, be promiscous, if you don't want to be promiscous, don't be promiscous. But at least make sure that you know what the consequences are and be aware of the consequences. Just like the fat women, they are lied by the woke movement into thinking it's okay and everything will be fine for them if they do this. It won't.\n\nOf course, there's pro-woke men like \"you do you girl!\" in hopes that if the woman gets more promiscous maybe, just maybe, he'll get some of that p\\*\\*\\*\\*. What's the issue with that? If pro-woke man couldn't get any woman without women being promiscous, the pro-woke man couldn't get any woman with women being promiscous, it's not women, it's him that's the problem. He being a too low standard. Even for promiscous and non-promiscous women.\n\nIf the woman gets more promiscous, she'll get more promiscous with the top 10-20% of men, because there's hardly any man that would say \"no\" to free sex. So why would the woman sleep with someone in the bottom 30-40% when she can have the top 10-20% all day long? it's simply not in her advantage. So she won't do it, and the pro-woke man's conclusion is that he needs to simp even harder and needs to tell her to get more promiscous even harder. The wider her horisont the more likely she is to sleep with him, right? right? right? wrong.\n\nOf course, being anti-woke involves not coping which it means taking the hard truth.\n\nWhy is being a promiscous woman bad? Because men won't want to date you, they will only want to sleep with you. You can twist and turn like the fat woman saying \"fatphobic\" but this is the truth. Are you a wife material or a one night stand material? From men's POV there are women good for having a relationship with them and being their partner, and women good for sleeping with them and that's it.\n\nWoke be like: \"but we don't care about the body count, why should the men care?\". Well, men don't care about your job nearly as much as women care about the man's job, men don't care about the woman's height nearly as much as the women care about the men's height. Complaining that other people don't have the standards that you do is just ridiculous. \n\nSo feel free to be a promiscous woman if you want. But there are consequences:\n\nWhat we see here is a woman frustrated that men leave after they hear of her past.\n\nAgain, it's not \"not being strong enough\", it's disgust. A completetly different emotion. She's not in tune with reality.\n\nBut the most predatory tactic is that woke people tell this to women when they are in their early 20s even 15-20 y.o. and women will grow up thinking that being promiscous is okay and will have no negative consequences. There's no \"men won't want to date you, they will only want to sleep with you\" there in that narrative, there's \"men who judge body count\" bad in that narrative. And as such, being young and impressionable, they take that advice, become promiscous, and end up regretting later in life when the poor decisions come back to them.\n\nhttps://www.reddit.com/r/TrueOffMyChest/\n\nJust search \"body count\" and see who has more to suffer from this. Is there men complaining that \"my gf has high body count and I left?\" or is there women complaining that \"I have high body count and no good man would want me?\".\n\nI'm perfectly fine with women being promiscous or not promiscous if they are perfectly aware of the decision and the consequences. If you assume it, perfectly fine for you. What I have a problem with is when they are being lied into making one of these decisions, that they would not have picked otherwise if they knew the full extent of it, it's pure and plain manipulation, and it comes back to bite those women after their \"glory days\" are done.\n\nSo, to reply to the average woke posting on Twitter: \"where are all the good men gone?\", with the good women.\n\n**2. It's an envy ideology**\n\nEnvy is a really crap emotion. You thought disgust is bad, but at least disgust has the core role of protecting you from disease. Guilt has the role of being self-critical and questioning yourself. Fear has the role of protecting you from life-threatening or negative consequences situations. Every bad emotion as some good part to it, some reason this emotion is actually good in some way.\n\nExcept envy. There is no good reason for envy.\n\nYou can use jealousy as gas. But not envy.\n\n\\- If you are a fat woman jealous that other women are skinner than you, what are you going to do? work out to lose weight so that you become as skinny as them. That's what jealousy does.\n\n\\- If you are a fat woman envious that other women are skinner than you, what are you going to do? tear down those skinny women or the men who validate those skinny women for being \"unfair\".\n\nJealousy is probably the closest thing to envy, but even jealousy has a positive use, you can use it as a gas to get you where you want. Jealousy wants to have that another has.\n\nIf Joe has a cool red car and I:\n\nAm jealous -> I want a cool red car too.\n\nAn envious -> I want to destroy Joe's cool red car.\n\nYou can see in what ways jealous can be beneficial even though the emotion is not positive.\n\nBut for envy, historically the most envious societies had the least economic development. Why? because whenever someone would rise above the norm, they would make sure they'll drag it right down. You can't become rich in a society where whenever you rise up above average, the less rich will ally to tear you down. Because of this you won't have any incentive to get rich. Because of this the society itself will not become rich. So congratulations, you're all equally poor now. Sure, you live misrable, but at least your neighbour isn't doing better than you.\n\nIf you want to create a society predominantly based on envy it would be the Soviet Union. If you want to create one based on disgust it would be India. The soviet revolutionaries in 1917 were like \"kill the rich\" but they didn't kill the rich, they killed the other farmers who were slightly better than them. You can also see envy in how a society treats their merchants, civilizations like Rome, Islam, China went at some point through a phase of poverty through decomercialization through the ruling classes' regulating the merchants out of social power and wealth.\n\nThe merchants have always been the main attraction of envy. Since anyone can become a wealthy shoes saleman, but the nobility was inaccessible to anyone not born in it. This means you're not judged for not becoming an aristocrat, not attracting envy. The jews, indian and chinese were often treated horribly in countries they lived in as a minority because they were better merchants.\n\nJeaousy is when you are a child and you want your friend's toy truck.\n\nEnvy is when you want your friend to lose their toy truck at no gain to yourself, since your friend has happiness that you can't have.\n\nEnvy is a horrible emotion that enables no one. Envy evolved as a hedge against massive inequality, massive inequality is a massive cripple to society, so envy evolved as a group hedge against it. But, overall it does more harm than good, envy is a big force that holds societies back. \n\nFor more info: Envy, A Theory of Social Behavior, Helmut Schoeck.\n\nThis is already long, so I'll try to be short from now on.\n\n**3. Where are the rich, succesful, woke millionaires?**\n\nIf it's such a good ideology, where are the woke millionares? Yeah, celebrities get asked \"are you a feminist?\", \"are you la la la?\". And of course they say \"yes\" because those are the people who pay them. You have to appeal to the left-leaning demograhpic. \n\nYou pointed this out perfectly with: \"You know I’m not a big fan of people for the most part, but even I see the problem with biting the very hand that feeds and nourishes you\".\n\nThey don't care about being woke, they care about keeping their fan base satisfied by appearing woke.\n\nWhich, not practicing what you preach but preaching that you are in support of \\[insert establishment here\\] seems to do wonders for the average person.\n\n**4. Going after the likes of Andrew Tate, Ben Shapiro, Jordan Peterson with basically no accusations**\n\nYou know there's something wrong with the wokes when you hear their arguments.\n\nGlad you said \"without resorting to the name-calling and verbal flatulence and the like which is your norm\" because that's pretty much their norm.\n\nWhen the woke can't defend itself in a healthy debate, you're either: racist, sexist, fatphobic, xenophobic, cancelled.\n\nRacist used to mean something and to be taken seriously. It used to mean someone who discriminates based on race and was a serious issue. But because of the woke overusing this word as an attack dog, \"everything is racist\", racist lost all meaning and it doesn't bat an eye from people anymore. Today, racist simply means not left-wing. Which is terrible for when cases of real racism happens, they may not be taken seriously because people are already used with the 'racism' version of the left.\n\nIt's like the story of the body who cried wolf.\n\nEventually, no one is going to believe you when the real wolf comes.\n\n**5. If you don't like the woke they come after you big. Like the Catholic Church in the 15th century.**\n\nHow can you trust something that's so aggressive as being good?\n\nWhen something is oppressive, it's usually bad. And the people who go out of their way to say \"I'm the good guy\" are not usually the good guys. And my god, the woke people are so proud of being the good guys. They are these champions of justice who stand up to these: racist, sexist, fatphobic, xenophobic, cancelled. On the right.\n\nBut it goes deeper than that.\n\nJordan Peterson is about to lose his public licence, for, and this is the official accusation, a retweet of the Conservative Party of Canada.\n\nBut if you ask the woke people: It's not political, he really was just a bad psychologist.\n\nAnd Andrew Tate, at first I thought Andrew Tate's arrest was for real. That he really did what they say he did. Until the 2 women that he supposedly kidnapped came out on social media with a video saying that they never testified against  Andrew Tate, the police self-reported, they didn't sign anything against Andrew Tate, and they did not agree to be victims in the Andrew Tate's case, in fact they filed a case against the police for putting them as victims in Andrew Tate's case. And to his day there's no official accusation against Andrew Tate, he's preemptively behind bars, for months. Like WTF is that? innocent before proven guilty? this is beyond innocent before proven guilty, this is trying to proven guilty despite no evidence.\n\nhttps://www.youtube.com/shorts/9rpz0Oy0ZLc\n\nThey have more videos like this. Imagine being accused in a case where you victim insists she is not a victim. And the police ignores the victim saying she is not a victim.\n\nBut they, it has nothing to do with the fact they disagree with them. They are bad people for teaching young men bad stuff. They have to be bad men. Otherwise, how could the woke be good by comparison:\n\nThe no.1 defense of the woke for something political is:\n\n1. It's not political. The best argument a woke person does when they make a political claim and someone counters it, it's not a political thing to begin with. \"Nah, it's not a woke thing, it's a human thing!\"\n\nThere is no honor in that. How can you trust an ideology with no honor and no compunction?\n\nI'm no conservative, but at least from the conservatives I know there are certain limits they would just not cross. The woke crossed those limits a long time ago, they are an ideology without compunction, and how can an ideology without compunction be trusted?\n\n**6. The woke hate religion but everything for them is sacred**\n\nI'm an atheist. I agree that nothing is sacred and everything can be questioned.\n\nExcept, not with the woke people. You can't question their beliefs, ideas, otherwise you are \\[BAD MAN\\] and deserve to be canceled.\n\nLike \"I'm offended\", is one of the strongest words of the woke. But what does \"I'm offeneded\" really mean? nothing. It's nothing than a whine, a complain. It says nothing about the reality of the situation at head.\n\nOf course you are offended, that's part of cope. I'd be surprised if you weren't offended in fact and that would have been a good sign. Or if you were willing to be offended.\n\nOf what use is a philosopher who doesn't hurt anybody's feelings? Freedom of speech gives us the right to offend others, whereas freedom of thought gives them the choice as to whether or not to be offended.\n\n\"Those who are determined to be ‘offended’ will discover a provocation somewhere. We cannot possibly adjust enough to please the fanatics, and it is degrading to make the attempt.\" - Christopher Hitchens (he said that long before the woke people were a thing)\n\nAnd let's not forget the classic:\n\nhttps://www.youtube.com/watch?v=VEOHQoh82bs\n\n**7. They won't debate you, they will cancel you.**\n\nThis says everything about the woke mindset.\n\nIf people like Andrew Tate, Ben Shapiro, Jordan Peterson were so wrong, how come the woke can't destroy them in debates, like they destroy the woke people in debates all the time?\n\nWhere is the Andrew Tate, Ben Shapiro, Jordan Peterson of the woke people? there's isn't any. I remember Anita Sarkeesian was big once, but she was the favourite punching bag of the right because how how bad her arguments were.\n\nThe right didn't try to cancel her, didn't attack her character, didn't say \"Antia bad person\", they just made fun about how bad her arguments really were.\n\nAnd his is a healthy line in a healthy world. One that the woke crossed long ago by silencing those that disagree with them. \n\n**8. The woke won, they are the establishments, where are the results?**\n\nCome on, when you post Black Lives Matter & LBGT & Feminism and most major companies as well as news outlets agree with you and share your message. You are not anti-establishment, you are the establishment.\n\nSo you won. Where are the results? there aren't any.\n\nIn fact, the blue states have higher inequality than the red states. What's up with that?\n\n**9. Hypocrisy, they don't apply the same standards to men that they apply to women**\n\nIt's a fundamentally hypocrite movement. Fat men into woke agenda? No.\n\nWhen was the last time you heard a Woke person that a woman is in the wrong for rejecting a man for being fat? Or a woke person saying about man that \"all men are perfect\" or that \"hot men give unrealistic expectations to men\".\n\nNevermind that their ideology is pure cope. But that cope only applies to one direction - women. If you are a man, you don't get the same advantages female woke get.\n\n***But there 1 reason why you should be pro-woke:***\n\n**10. They are the establishment**\n\nYou want a job in Hollywood? be woke, even if you really aren't.\n\nYou want to not have issues at your job? be woke, even if you really aren't.\n\nBecause conservatives aren't willing to cross that line that woke people are.\n\nIt's like a woman attacking a man with a bat tacking advantage of the fact that men are thought not to hit women, this is why being the woke is the more privileged way to be.\n\nBeing woke gives you more social privilege.\n\nAnd at the same time you get to complain about not having privilege. Despite you being the establishment and being able to do something to lift black people out of povery for example, but you don't.\n\nSo yeah, when you put things into balance, I think it's better to sell your soul and be woke.\n\nThe trick is to do it like most Hollywood stars to: don't practice woke principles of cope, but declare you are an absolutely woke person and always in favor of whatever woke people are. They will love you for it, while you get to keep the benefits of not being woke with your personal choices.\n\nI believe \\[INSTER GOOD STUFF HERE, ANYTHING THAT MAKES YOU FEEL COMFORTABLE, SO THAT YOU LIKE ME, BECAUSE I LIKE POPULARITY\\], thank you.\n\n**The problem I have with the woke is that it ruins the life of the people who practice the woke**. But if you are a true-woke believer and have practiced the woke and it works for you, good for you. Maybe it's not an ideology for everybody but it works for some people, like stoicism. I wouldn't feel comfortable with cope and not doing anything to better myself, and blaming the enviroment for my own problems, instead I would try to raise myself up by myself, to get to the top. So if you want to do anything that is bad in the woke, like being overweight or promiscuous or others I haven't touched, as long as you are perfectly aware of the consequences and is truly your choice, go for it. You have my full support if you fully assume it and you know what you're doing. But if you were tricked by the woke ideology that this is the right way to go and there are no consequences and it's the racists, sexist, deplorable, who hate you and fear you, and this is in fact why your life sucks, and your life will be better once you get rid of them. I can only have my sympathy for you.",
    "title": "Why the Woke ideology is terrible for both men and women & Why you should follow it anyway",
    "subreddit": "MensRights",
    "timestamp": 1676325278,
    "score": 0,
    "keyword": "chinese judge"
  }
]