[
  {
    "text": "A group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by Chinese nationalists \nChinese women economists who met Janet Yellen on Beijing trip called traitors and ‘American spy’ online\nA group photograph of the gathering posted to China’s Twitter-like Weibo was used to identify some participants.\n\n\nA group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by online nationalists for betraying their country by interacting with the US official.\n\nWhile the Treasury department skipped identifying attendees from the meeting on Saturday, a group photograph of the gathering posted to China’s Twitter-like Weibo was used to identify some participants. It was not clear who first shared the image online.\n\n\n“There’s no such thing as a free meal,” wrote Shen Yi, a professor in international politics at Fudan University, who has over two million followers on the platform. “They’ll need deliver KPIs in exchange,” he added, using the acronym for key performance indicators, implying the women would have to give something to the US government. \n\nThe criticism mostly targeted two women who posted about their experience on social media: Liu Qian, the Economist Group’s managing director for Greater China, and author Hao Jingfang, who previously worked for the China Development Research Foundation, which is managed by a branch of the State Council.  \n\n\n\nIn a now-deleted exchange, one Weibo user asked Hao, whose award-winning novel Folding Beijing is widely considered to be about income inequality in the capital, why she attended the dinner. Hao replied: “Because Yellen is the friendliest American official, she’s always dedicated to developing friendly China-US relations.”\n\nSeveral users accused Hao of being an “American spy,” while a post that garnered some 600 comments criticized the elite status of the women selected, saying “they have not worked in factories.”\n\nYellen’s exchange with women economists and entrepreneurs telegraphed the importance she places on female representation in elite decision-making. During her four-day trip to Beijing to stabilize ties with America’s biggest rival, the Chinese government exclusively put forward male officials to meet the first woman to run the US Treasury, according to publicly available information. \n\n\n“I see it all the time when I’m almost the only woman in the room,” Yellen told the women. “I’m sure many of you have that same experience at decision-making tables.”\n\nPresident Xi Jinping excluded women from China’s top leadership at last year’s congress for the first time in 25 years. Furthermore, as China struggles with a record low birth rate, women are being encouraged to take on more traditional care-giving roles. \n\nThe backlash against the women echoes attacks waged by online nationalists against foreign female journalists of ethnic Chinese origin working for Western news organizations. \n\n“Attackers routinely disparage their coverage of China and make crude sexual innuendos, including alarming threats of physical violence,” the Foreign Correspondents’ Club of China wrote in a report last year on the issue. \n\n“Women’s participation in the workforce is one of the major drivers of creating inclusive growth,” the Treasury said in a statement after Yellen’s meeting. “Women’s contributions to economics, in particular, are important to help ensure that economic research and policymaking appropriately reflect society’s priorities.”",
    "title": "A group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by Chinese nationalists",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689066373,
    "score": 4,
    "keyword": "chinese director"
  },
  {
    "text": "Resigning During Probation to Rejoin Previous Employer, any advice? Hey folks! I'm reaching out to seek advice on a tricky situation I'm facing in my current role. I joined this company about three months ago under the impression that it would be a purely strategic marketing position with senior responsibilities and decision-making authority. The salary was also a major draw, being 50% more annually than my previous position.  \nHowever, the reality of the role has turned out to be quite different from what was advertised. I'm essentially a one-person team, without any senior mentorship to guide me. Instead, I'm finding myself teaching my expertise to the growth director (which I don't mind for now) because this person has no prior experience in the field.   \nMy current role has also taken on a more sales-oriented nature, requiring me to constantly pitch my strategies to the Chinese team, which manages the European branch like an agency. Due to cultural differences, our work is often overlooked or not requested, and I'm constantly in a selling mode. This was not something I was aware of when I accepted the offer.  \nMy previous company has reached out with a new position. It's in a different team with increased responsibilities, and the new boss is a friend and a great mentor. The reason I left my previous company was for career advancement and salary, as my manager at the time was not supportive of my growth. However, with a new manager and team, I believe this opportunity offers the growth and development I seek.  \nAfter careful consideration, I've decided to accept the new offer, which means resigning from my current position. I plan to politely explain my reasons for leaving, including the lack of a mentor, the sales-oriented nature of the role, and the limited scope of my responsibilities, which more closely resemble a copywriting position. While I'm on probation and my resignation period is zero, I plan to stay 2-3 weeks to complete outstanding tasks. \n\n  \nAny advice on how to conduct this talk? Without my manager and team feel offended because they're a nice team but I don't feel I can grow in this position :(  it is too hard for me to confront this",
    "title": "Resigning During Probation to Rejoin Previous Employer, any advice?",
    "subreddit": "careerguidance",
    "timestamp": 1701112390,
    "score": 1,
    "keyword": "chinese director"
  },
  {
    "text": "I’m jason chu - Asian American rapper heard on American Born Chinese, Joy Ride, Warrior & more. Also a passionate racial justice advocate with Hate Is a Virus. AMA! Hi everyone! My name's jason chu - I'm a rapper & activist based in LA.\n\nFor the last 8+ years, I've been a full-time recording & touring artist, with music on *American Born Chinese*, *Joy Ride*, *Warrior,* *Kung Fu*, and more. My new album [*We Were the Seeds*](https://fanlink.to/weweretheseeds) just came out this past weekend.\n\nAs an activist, I've done work around AANHPI history, interracial solidarity, mental health, and other topics, including tons of educational content on [IG](https://www.instagram.com/jasonchumusic/reels/) and [TikTok](https://tiktok.com/@jasonchumusic). I've been communications director at Hate Is a Virus for the last couple of years, and also worked with the LA Mayor's Office to help shape plans for a new monument to the 1871 Chinatown Massacre.\n\nI'm a Yale graduate, and did an MA in Asian American Theology, a hybrid of Christian liberation theology and Asian American Studies. More of my background is at [jasonchumusic.com/about](https://jasonchumusic.com/about)\n\nAfter a weekend of album release shows, I'm sitting at home working all day - lets chat about being Asian in hip-hop, being a full-time creative, racial justice & mental health, or anything else that comes to mind. AMA <3\n\nProof: [https://www.instagram.com/stories/jasonchumusic/3196213069907490849/](https://www.instagram.com/stories/jasonchumusic/3196213069907490849/)\n\n**Call To Action:** On December 30, 2020, Christian Hall, a Chinese American boy, was killed by PA State Troopers.\n\nPlease sign this petition to help ensure something like this never happens again: [bit.ly/j4chall](https://bit.ly/j4chall)\n\nAnyone who doesn't know about Christian - you can read up [here](https://www.cnn.com/2022/04/01/us/christian-hall-shooting-pennsylvania-lawsuit/index.html) and in [this statement from the family's attorney](https://act.bencrump.com/a/christian-hall) (TW: violence, police brutality, mental health crises)\n\n&#x200B;\n\n**Edit 9/22:** Think I answered most of the questions, thank you all for a great AMA! Honestly, going in i was nervous no one would really want to engage, so it was cool getting to chat with you folks and respond to some really thoughtful questions.\n\nIf you want to reach out, hit [my IG](https://www.instagram.com/jasonchumusic/) \\- and please take a listen to [*We Were the Seeds*](https://hypeddit.com/w8gi7m), out now on all platforms <3",
    "title": "I’m jason chu - Asian American rapper heard on American Born Chinese, Joy Ride, Warrior & more. Also a passionate racial justice advocate with Hate Is a Virus. AMA!",
    "subreddit": "asianamerican",
    "timestamp": 1695237656,
    "score": 265,
    "keyword": "chinese director"
  },
  {
    "text": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S Hello, it's my first time posting something like this but ever since I've started college it seems like there is a cultural group or community out there for everyone except for me. I'm F20 and my mother is Chinese and my father is Mexican. Both are first generation immigrants who met in the states. Everyone I know who is east asian and mixed race usually has one white parent. I don't mean to sound like I am excluding people but I think it's a very different experience to be biracial and nonwhite. I have friends who are east asian and white and they have their struggles but in my area it is not an uncommon mix. \n\nMy physical appearance is very ethnically ambiguous (or so I've been told). I've been mistaken for many ethnicities in my life. I speak some Chinese (still can't read or write though) but I am fluent in Spanish and I am minoring in Spanish literature. I don't know if it's for these reasons that I have always felt like it is difficult to connect with other chinese people and chinese americans that aren't my immediate family. Maybe it's all in my head and I'm not actually being judged on how I look but I've attended mixers for east asian and chinese students at my university and have been mostly ignored. it could just be that i encountered some particularly cliquish people that one time and i'm willing to try again in the future. i always just get this feeling that i'm invading the safe space of people who grew up in similar ways and have similar life experiences. \n\nI feel very far removed from other people my age who are asian american and I don't know how to get in touch with that side of my identity. I engage in Chinese culture pretty regularly. I play mahjong, I can cook Chinese food, and I'm fond of many Chinese film directors. These are things I engage in with my family and I would like to connect more with my peers/broader community. Has anyone else experienced something like this? Are there any other nonwhite biracial people out there who feel the same way?",
    "title": "biracial (chinese and mexican) and feeling disconnected from AAPI community in the U.S",
    "subreddit": "asianamerican",
    "timestamp": 1688998478,
    "score": 69,
    "keyword": "chinese director"
  },
  {
    "text": "'Curse of Quon Gwon' (1916) - First Asian American film https://www.youtube.com/watch?v=o2-sMG3Qlt8\n\n“The Curse of Quon Gwon is the earliest known film directed by an Asian American, and one of the earliest films directed by a woman. The movie features an all-Chinese American cast, including the star, Violet Wong, who was director Marion Wong’s sister-in-law. Most of the film was shot in Oakland, a few miles of where it will be screened in Chinatown on Sunday. Their family came to the U.S. in the 1850s during the Gold Rush Era.”\n\nhttps://caamedia.org/blog/2015/08/04/caam-co-presents-earliest-known-asian-american-film-the-curse-of-quon-gwon/",
    "title": "'Curse of Quon Gwon' (1916) - First Asian American film",
    "subreddit": "asianamerican",
    "timestamp": 1693215067,
    "score": 6,
    "keyword": "chinese director"
  }
]