[
  {
    "text": "Dodged bullets or - How I made it not to end under investigation or worse &#x200B;\n\nRecently  I was speaking with a friend of mine who told me about his first REAL  (meaning well paid and what he studied for) job. He lives in Singapore  and he got an amazing deal as a junior manager in one of the world's  biggest banks. He signed the contract, agreed on the day 1, etc. He was  so happy so he went partying for a weekend in Bali. Monday morning, he's  all dressed up, so proud 20-something going for the first day of his  work. Getting there, since it's in the CBD, he sees a crowd and his  manager drinking shots in a bar nearby. He's a bit confused but doesn't  want to be late for the first day. He comes to the building, enters the  building, and sees everyone getting down and getting out. He stops one  of the guys he knew and he tells him, dude, haven't you heard? We are  down deep shit. everyone is being released. It was 2008. We're not  talking names here but - you are allowed to take a shot.\n\nAnd  that reminded me of two times when something almost similar happened to  me.  I lived in Singapore back then and I was trying to find myself  something better than being a freelance copywriter for $2,000. A  recruiter finds me on LinkedIn and says she has a fantastic opportunity  for me in the marketing department of a huge and already famous startup.  the father was a Chinese billionaire and his son was running a company.  we agree on a crazy deal of salary, and bonuses. I go through 5  different calls, do a task, etc, etc and afterward, they said the last  step is to meet 'the son'. I meet the kid (and I'm saying kid since I  was 30 and he was maybe 20) and he seems generally not interested in  anything that's happening around him except his iPhone. However, the HR  say he was  delighted and that I got the job. We agreed on my first  starting day to be in a week. I get to see the offices (still a bit  empty but all will be done in a week\"). Also a fancy building in the  fancy part of town). I am thrilled of course, we get to celebrate (not  sure we went on Bali but maybe we did, the plane tickets were  ridiculously low pre-covid). Friday night, before the given Monday, I am  reading the newspapers and am reading that the chinese owner (the  father) ended u in prison for some tax stuff, and that the work licence  for his company  in Singapore, UK, Hong Kong and China is off. I try to  call my recruiter No one answers. On Monday I show up, everything is  locked, noone is there.\n\nA third  was maybe the best one and it was my then-husband. We were in Hong Kong  and the company we worked for paid us to be at this seminar of some  \"crypto Tony Robbins\". We come there and there is him and his tiny  Romanian wife. The whole thing looks like we're on some Herbalife or  amway shit, with clapping, yelling and all that nonsense. My husband  lived in US so he liked that and was clapping and cheering all along.  Afterward, we are invited to the vip exclusive dinner blah blah. we meet  the couple and they are thrilled to meet another couple (wait for it)  and are inviting us already to their yacht in Miami and everything. he  is a good looking, his wife looks small and kid of evil-ish but ok, I'm  nodding my head, drinking chamagne and thinking all is bullshit.  However, my hub is thrilled so I go along. We get back to Singapore and  the friend of ours send us link with their faces being charged for  murder of some model with whom they allegedly had threesome with and  they throw her from the building. They were hiding, I think they still  do somewhere in Malaysia. Bullet-dodged :D\n\nWhat about you guys, any stories to tell?",
    "title": "Dodged bullets or - How I made it not to end under investigation or worse",
    "subreddit": "jobs",
    "timestamp": 1694508559,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "It's normal nowadays probationary period is just a joke? Enlighten me, I am the manager from one of department. My owner is a Chinese. Now I received my evaluation. I know in myself I did my job well. But in his evaluation I fail. This is my 2nd company that I experience same. Is chinese just playing with my current employee status. They just fail me even if I did my job well done. I'm so stressed because what will I gonna do now. My family is expecting for me to provide. I'm so sad totally. I'm tired being employed here in Philippines. Business owners just playing around 😭😭😭",
    "title": "It's normal nowadays probationary period is just a joke?",
    "subreddit": "jobs",
    "timestamp": 1700742890,
    "score": 0,
    "keyword": "chinese manager"
  },
  {
    "text": "mom makes comments about body tw: ed \n\ni'm (18f) back home for break and my mom has been making comments about my body (or my past body) or commenting on food that i'm eating\n\n(i'm just listing off stuff i remember off the top of my head)\n\na year or so ago we were talking about chinese traditional dresses and i was like \"my friend wanted to get one\" and my mom essentially said that she'd look good in it bc she was skinnier and people who are bigger (like me ig) wouldn't look as good and should avoid it 9or slim down to wear it)\n\nwe were at costco a week ago and i mentioned that costco now had their mango smoothies in the food courts and my dad asked if i wanted one, to which my mom promptly replied \"are you sure you want to get that; you'll get fat if you drink it\". i hadn't even said whether or not i wanted a smoothie yet. \n\njust earlier today i bent over and my sweatshirt kind of rode up and she made a comment on the fat on my waist. \n\nshe was also talking how my legs were like \"elephant legs\" around a year ago and that i had finally managed to slim them down\n\nsometimes she'll also tell me \"you're young you shouldn't be worrying about weight and just eating whatever you want\" \"when i was your age i ate whatever i wanted\" ???\n\ni don't know what to do anymore. i know i'm not fat by any means; i'm 5'6 and 127 lbs 27 waist i don't get why she had to mention the fat on my waist? am i not supposed to have any fat on my body\n\nfor the past year or so i've been dealing with an eating disorder that's gotten horrifically worse in college and haven't been the best mentally when it comes to my body image. don't wanna get too into the specifica of the ed is this is mainly about my mom 😀☝️\n\nher commenting makes it even worse as i feel even guiltier eating \"junk foods\". i know i shouldn't let what she says get to me but it's kind of hard when you're already having trouble with your body image and there's someone behind you almost fueling your ed.\n\nik that if i ever do let her know that what she's doing is making me feel horrible she'll say \"i'm doing it for your own good\" or something. i'm east asian so i feel like part of this behavior is due to the body standards there\n\nik she's doing what she thinks is best for me; it just sucks when your ed is taking over your life and your mom's here cheering that said ed on. \n\nthe disordered part of me is thinking: this is a great chance for you to lose more weight while the part of me that knows i'm in a self destructive cycle right now is telling me to get it together. feeling like it's easier for these words to get to me since i'm so dissatisfied with myself and my body that i can just convince myself what she's saying is true.\n\ni don't know if this is a rant or a help post; just wanted to take this off my chest as it's been increasingly suffocating",
    "title": "mom makes comments about body",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687761108,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "A group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by Chinese nationalists \nChinese women economists who met Janet Yellen on Beijing trip called traitors and ‘American spy’ online\nA group photograph of the gathering posted to China’s Twitter-like Weibo was used to identify some participants.\n\n\nA group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by online nationalists for betraying their country by interacting with the US official.\n\nWhile the Treasury department skipped identifying attendees from the meeting on Saturday, a group photograph of the gathering posted to China’s Twitter-like Weibo was used to identify some participants. It was not clear who first shared the image online.\n\n\n“There’s no such thing as a free meal,” wrote Shen Yi, a professor in international politics at Fudan University, who has over two million followers on the platform. “They’ll need deliver KPIs in exchange,” he added, using the acronym for key performance indicators, implying the women would have to give something to the US government. \n\nThe criticism mostly targeted two women who posted about their experience on social media: Liu Qian, the Economist Group’s managing director for Greater China, and author Hao Jingfang, who previously worked for the China Development Research Foundation, which is managed by a branch of the State Council.  \n\n\n\nIn a now-deleted exchange, one Weibo user asked Hao, whose award-winning novel Folding Beijing is widely considered to be about income inequality in the capital, why she attended the dinner. Hao replied: “Because Yellen is the friendliest American official, she’s always dedicated to developing friendly China-US relations.”\n\nSeveral users accused Hao of being an “American spy,” while a post that garnered some 600 comments criticized the elite status of the women selected, saying “they have not worked in factories.”\n\nYellen’s exchange with women economists and entrepreneurs telegraphed the importance she places on female representation in elite decision-making. During her four-day trip to Beijing to stabilize ties with America’s biggest rival, the Chinese government exclusively put forward male officials to meet the first woman to run the US Treasury, according to publicly available information. \n\n\n“I see it all the time when I’m almost the only woman in the room,” Yellen told the women. “I’m sure many of you have that same experience at decision-making tables.”\n\nPresident Xi Jinping excluded women from China’s top leadership at last year’s congress for the first time in 25 years. Furthermore, as China struggles with a record low birth rate, women are being encouraged to take on more traditional care-giving roles. \n\nThe backlash against the women echoes attacks waged by online nationalists against foreign female journalists of ethnic Chinese origin working for Western news organizations. \n\n“Attackers routinely disparage their coverage of China and make crude sexual innuendos, including alarming threats of physical violence,” the Foreign Correspondents’ Club of China wrote in a report last year on the issue. \n\n“Women’s participation in the workforce is one of the major drivers of creating inclusive growth,” the Treasury said in a statement after Yellen’s meeting. “Women’s contributions to economics, in particular, are important to help ensure that economic research and policymaking appropriately reflect society’s priorities.”",
    "title": "A group of Chinese female economists and entrepreneurs who dined with Treasury Secretary Janet Yellen have been blasted by Chinese nationalists",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689066373,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "International nursing opportunities in shanghai? Hey guys, apologies if this is not posted in the right place. I’m a newly qualified nurse in the UK, set to start my career in A&E/ER for the NHS. I’m currently visiting shanghai and have been here for 5 weeks and I’ve really fell in love with the place and would really love to live here. Not only because of how much I love it here but the cost of living is much lower and if I manage to get a reasonably paying job I would be able to live an ideal life here IMO. I plan on going home for 1-2 years to gain experience as a nurse and learn as much Chinese as possible if I do plan to live here before I look at moving away but my question would be, as an English speaking nurse what are my chances at getting a job in a hospital in shanghai? And how would I go about this? I know there are international hospitals here but I don’t know if they recruit English speaking foreign nurses. Any advice or names of international hospitals is welcomed!",
    "title": "International nursing opportunities in shanghai?",
    "subreddit": "nursing",
    "timestamp": 1698731297,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Career Advice Hi  \nI'm an ESL teacher living and working in China and I'd like to pick up some qualifications to back my experience but I'm torn between what to go for and would love some advice/input.  \nI've been here teaching for 12 years, originally in a training center but for the last few years in a private school (mostly primary). I've been managing (as much as one can in the chaos that is China) the foreign teachers at both schools I've worked at, including training for new teachers and resource/course creation amd curation.  \nSo in essence I am happy enough with my skills as a teacher and while anything I choose could obviously benefit me in this aspect and improve my teaching, that's not the primary motivation.  Aside from my initial graduate degree which wasn't in education (commerce and French) and the TEFL cert I picked up in a couple of weekends while in the States, I don't have anything to support my experience. This could be an issue if I change schools later within China or return with my family to Ireland later and move in all likelihood out of teaching.  \nTLDR: which one(s) best if I am most interested in using the cert more than experience?  \n1. iPGCE with iQTS but I've read the iPGCE is less useful than before and I wouldn't teach in the UK so don't know if the QTS is worth the effort  \n2. Masters in Education, but there's so much variety I'm a bit lost. Does anybody know of an online Masters in Education and Technology that is worthwhile?  \n3. Masters in Technology which is what I'm interested in but don't know if it's too removed from my field here or would be useful if/when moving back to Ireland.  \nA. HSK chinese level tests - are levels one and two even worth doing and is there anything more recognized in applying for jobs in the west relating to Chinese?  \nB. HSKK speaking level tests - anybody used them and are they difficult to get?  \nC. HSK business English - seems less useful than the straight HSK, yeah?  \nSorry for life story and long post but I'd be really grateful for any advice, input or suggestions especially if you've tried one or more of the options I'm considering.",
    "title": "Career Advice",
    "subreddit": "Teachers",
    "timestamp": 1693735082,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "My manager promoted the other person, but then he told me I had more experience - what would you do? As mentioned in the title, my manager promoted a person from the team for a more senior role.\n\nAbout a month later, my manager told me that \"you actually got more solid experience than the promoted person\".\n\nI was honestly shocked and soul crushed a little bit after I heard my manager saying it to my face.\n\nIf you were in my situaiton, what would you do?\n\nEdit - Thank you for all your thoughts and suggestions. I understand that I have shortcomings, but there are many other aspects (e.g. company culture, business downfall) that made me unwilling to stay any longer. I am actively looking for new opportunity.\n\nEdit 2 - To give more context:\n\n> Other departments have commented the incompetence of the promoted person. At the same time, my manager's competence was also being questioned by others. \n\n> I understand one of the ways to do it is to ask my manager, however he is Chinese and work culture is different to the Western society. It's not as easy to discuss these kinds of things directly. \n\n> There are many moments that I will have to help the promoted person simply he is incompetent to handle it, which I find it bizarre that he can still get the promotion. \n\n> After all, I am not trying to make any excuse as I am nowhere perfect, however there are other factors to consider.",
    "title": "My manager promoted the other person, but then he told me I had more experience - what would you do?",
    "subreddit": "careerguidance",
    "timestamp": 1696131803,
    "score": 21,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I take a job opportunity offered by my current employer to work in Japan? Title says it, but I'm being requested to move to Japan to work at HQ for a few years starting in April 2024.\r  \n\r  \nBackground:\r  \n\r  \nCurrently work in sales and purchasing in the United States with 2 direct reports. Can speak business Japanese, can write Japanese using a keyboard, but can't read Japanese Kanji (Chinese characters) outside of those commonly used in emails.\r  \n\r  \nThey are wanting me to work in Japan to get some more experience so that I can come back and eventually be a higher level manager in the United States. I believe I will just be a regular sales/purchasing guy in Japan with no real direct reports for the duration in Japan.\r  \n\r  \nQuestion:\r  \n\r  \nWhat is the standard Japanese corporate life like in 2023? I know it has seen a lot of change after the pandemic.\r  \n\r  \nWhat would you do in my shoes, or have you ever been in my shoes before?",
    "title": "Should I take a job opportunity offered by my current employer to work in Japan?",
    "subreddit": "careerguidance",
    "timestamp": 1699766013,
    "score": 6,
    "keyword": "chinese manager"
  },
  {
    "text": "23M How to know what to do with my life? Hi. 23 years old from Mexico. \nI had an exchange in Finland at 17 during last year of high school, it was a mind-changing experience.\nI thought I knew what I wanted to do with my life, I wanted to do something important, but during that year I think I spread too thin, I became more analytical, observer and contemplating than actually pursuing something.\nWhen I came back to Mexico I joined communications bachelors out of need and hurry for getting in uni, but I quit after 2 months (it wasn't what I wanted)\nThen I joined English and Chinese lessons, went to the gym VERY COMMITED, then at 19 I joined IR bachelors, but I quit again 2 months after (it was too expensive both tuition and the environment, I didn't want to be a burden for my family)\nThen I got to continue with my language studies and look for a job.\n\nBy January 2020 (still 19) I joined International Trade bachelors, but then covid came, and we went to zoom university. I lasted almost 2 years, but I quit due to covid/lockdown hysteria and discomfort, existential crisis.\nAm I weak for quitting due to covid madness? Millions of people my age continued despite online classes awfulness, but I just couldn't focus and study by being 24/7 in my room.\n\nAfter quitting I got a job at a gym, it lasted short. Then I got side/freelance jobs with English-speaking businesses as customer manager, translator, social media, etc. Then in summer 2022 I got a \"more formal\" job with one of those English-speaking friends/business (I worked 9-5 some days and at office some days) the position was weird, because I basically was helping him build an online business, so I did a bit of everything (again spread too thin) it wasn't a tax/formal/official job.\nBut it lasted 6 months. I got \"fired\" because he changed his mind about the business and wanted to think more about what to do. It was November 2022.\nThen I did nothing, other than worry about my future.\nIt was then in February this year (I finished a data analysis course) when I decided to go to study to Poland (don't ask why Poland) I knew I needed a degree 100%, I needed to do something with my life, I can't just get gigs and side jobs by nice gringos. \nI started to get hope (covid destroyed a lot in my soul)\nI got a job at a gym again and lasted until July (it closed, and I was leaving anyway)\nAnd here I am in Poland (2 weeks ago I arrived) in a not so prestigious university studying economics. This was my dream, to go to Europe, do something with my life, my own choices, etc. But I feel (again) empty and lost.\n\nI feel old and weak and worthless. I'm studying a bachelors when people my age are studying a masters, or already building a career.\n\nMy life is just a collage of random experiences, interesting but worthless and pointless.\n\nHow the F at 23, after 4 universities, 3 countries and one world-changing pandemic I still don't know what I want??!\n\"You're so brave for going to a different country' with different language\" \nSO WHAT? Bravery doesn't pay the bills, or builds career reputation, or social status, it's just an interesting anecdote.\n\nSo what can I do? \nWhy do some people know they want to be engineers or doctors since forever?\nI have no problem with hard work, it's just I'm too old, I can't start from zero a 5/6 year degree in STEM, I can't even financially.\n\nI thought coming to a developed country would makee me happy, give me opportunities, but I feel I'm wasting my life.\n\nHow can I know what to do?\nThank you for reading all this, but you needed to understand my context.\nI'm a \"scientist\" by personality, I'm a very methodic, curious and creative person, I'm passionate about the world, nature, theory, etc.\n\nAm I too old? What can I do? How can I stop feeling like so much crp?\n\nThank you for reading and hope you can give me some advice:)",
    "title": "23M How to know what to do with my life?",
    "subreddit": "careerguidance",
    "timestamp": 1697395338,
    "score": 6,
    "keyword": "chinese manager"
  },
  {
    "text": "Not Passionate About Anything, But Want to Find a Suitable Path. What should I do? Hello Reddit,  \nI'm fed up trying to get a dream job and just want to start a career that generally makes sense with my background. I'm not particularly passionate about any specific field or industry, so I'm open to any and all suggestions.  \n\n\nHere's my full resume:  \n**Education**  \nJohns Hopkins University School of Advanced International Relations (SAIS) Master of Arts in International Relations (MAIR) Concentrations: Security, Strategy, & Statecraft, Asia  \nHarvard University International Security Certificate  \nDickinson College Bachelor of Arts, International Relations  \n\n\n**Publications**   \nDuchaine (2023). Could a 500-year-old treaty hold the key to peace in space? The Space Review. Duchaine (2023). Is China’s rise in space over? Indexing space power for the next space age. The Space Review. Duchaine (2023). Despite the Luna-25 failure, Russia is not a declining space power. The Space Review  \n\n\n**Experience**  \nCenter for Space Governance  \nFellow  \nJune 2023-Present   \nCollecting open source space launch, satellite, and budgetary datasets in excel to create a space power index to analyze the great power system (US, China, Russia, India, Europe, and Japan) for trends Drafting a policy-relevant brief on potential sources of conflict and cooperation between the US and China in the space domain  \n\n\nAmerican Forest and Paper Trade Association  \nInterim Government Coordinator  \nMay 2022-September 2022   \nCoordinated projects schedules, agendas, tasks, and meeting logistics to facilitate collaboration between AF&PA committees Copy-edited briefing papers and other relevant materials for Capitol Hill Organized meeting preparation to facilitate collaboration between AF&PA committees Maintained legislative tracking documents  \n\n\nManheim Central Middle School Special Education   \nParaeducator  \nSeptember 2020-June 2021   \nDelivered behavior management support and recorded behavior data to help special education students function in general education classrooms  \n\n\nMaine Representative Margaret O’Neil   \nResearch Consultant   \nMay 2020-September 2020   \nConducted a literature review and analyzed best conservation policy practices Drafted a policy guide to collaborative natural resources management between the State government and indigenous peoples to support Representative O’Neil’s legislation and committee work  \nOffice of U.S. Special Counsel Washington D.C. Staff Assistant January 2019-May 2019 Screened and verified visitors. Managed office space. Assisted with the complaint filing process.  \n\n\nUS Senator Angus King Policy   \nIntern   \nSeptember 2018-December 2018   \nConducted extensive legislative research and monitored news related to international affairs, science and technology, and the judiciary Drafted official correspondence on behalf of the Senator Conducted Capitol tours for constituents Provided general office management support, including sorting the mail, scanning and sending documents, and purchasing office supplies  \n\n\nCampbell, Campbell, Edwards & Conroy, P.C.   \nPaoli, PA   \nParalegal  \nJune 2018- September 2018   \nServed as lead paralegal for various lemon law cases for the firm.  \n\n\nGarmey & Associates  \nPortland, ME Law Clerk  \nMay 2017- September 2017   \nRead and summarized legal documents. Created a mediation powerpoint presentation. Edited deposition videos for viewing at mediation and trial, helping win over $2 million for our client.  \n\n\n**Community Service and extracurriculars**   \nAPO Service Organization   \nCarlisle, PA President September 2015-December 2018   \nLed a team of 30 to plan the annual fundraiser, bringing in over $400, an organization record Directed a marketing campaign that increased organization membership by 200% Ran weekly meetings, increasing attendance from on average 10 members/week to 40 members/week  \n\n\nDickinson College Model United Nations   \nCarlisle, PA   \nFounder, Vice President   \nFebruary 2017-May 2017   \nFounded the club and grew it from 2 members to 95 members Established the conflict simulation committee and planned 3 conferences in the spring of 2017  \n\n\n**Additional Information**   \nLanguages: Chinese Mandarin: intermediate mid, Japanese: intermediate low, Arabic: beginner",
    "title": "Not Passionate About Anything, But Want to Find a Suitable Path. What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1693406065,
    "score": 5,
    "keyword": "chinese manager"
  },
  {
    "text": "Advice for my first Business Analyst position's Case Interview. Where can I find more info about this? Hi, I will have an interview for a BA position next week. I already passed the 1st interview but my next interview is a Case Interview with a Business Case. I have 2 weeks studying about this but I'm still unsure, any advice for the interview?. Any places where I can practice more or any subreddits that can help?. Where can I find a more professional approach to how I make my mock interview cases?. Any advice is helpful as I just lost my job a month ago and this is one of my first interviews in a while.\n\nContext: I was a Marketing Specialist at a Chinese company but have SQL, R and Project Management skills, I'm a Bc. Business Management. This would be my first BA role. Had the first interview with a Recruitment Specialist (HR but not the Hiring Manager) the Hiring manager will be in charge of the next interview.\n\nEdit: For extra context, I'm from a LATAM country and the job is in a Financial Technology company based in Brazil (not where I'm from)",
    "title": "Advice for my first Business Analyst position's Case Interview. Where can I find more info about this?",
    "subreddit": "careerguidance",
    "timestamp": 1682714550,
    "score": 3,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I try to land a \"big boy job\" or continue going my own way? Hi,\n\nI'm looking for career advice which is specific to my situation. I'm 24 years old (turning 25 in the summer) and I finished my bachelor's degree in Economics and Management last year. It's also crucial to say that I DON'T live in the USA. I live in the Czech republic, which is a country in Central/Eastern Europe. My post might be a bit longer and therefore I'll appreciate any comment.\n\n***So to assess my current situation:***\n\nBasically, I have a really cool job but it's part-time. I work as an assistant to an MP. I've been interested in politics ever since I was like 12, so I'm very much in my element. The job itself isn't especially challenging, it's what you would expect any assistant does – managing the schedule, organizing and responding to e-mails, booking hotels, making sure all the invoices get paid on time etc. If I were to go only off of this, of course I'd be better off somewhere else. BUT it's intereseting for all the other reasons – I have an ID card which gives me access into the houses of the Chamber of Deputies, I get to meet ministers and other influential politicians, other MPs, I also have more credit among the members of our party in the local politics, I get all the political information first-hand and I can somewhat closely follow what's happening in the background. I can also discuss real issues with the MP that I work for and potentially affect what happens in our country. That's why it's interesting and it's also why I've kept this job altough I've had other offers.\n\n***Alright, let's add some numbers into the mix:***\n\n*(I've converted all the numbers into USD so it's easier for you to work with)*\n\nRight now I make  $ 1,015. About a half of that goes to social and health insurance payments and also to my parents, because I live with them. I'm left with about  $ 500 netto each month. It's not bad, but nothing special either. If I'm being honest, I could rent a small flat and live on my own, but I'd have just enough to scrape by. No savings, nothing. And I would possibly have to eat a lot of junk food to make it.\n\nThe median salary is about  $ 1750 brutto, which makes it around  $ 1500 netto. So by doing simple math, we can conclude that the average person has about three times as much money as I do.\n\nI'm now paid about  $ 250 more than I was when I started and it was really hard for me to see all my friends living adult lives, while I'm still stuck in between school and a \"real\" job. Now that I'm paid more, it's easier to accept. I got offered a juinor supply chain manager job in the automotive industry, and it paid the median salary. However, it was 42 hours a week (my current job is approximately 15 hours a week) and it was pretty far from where I live, so I'd be away for about 12 hours every day. I concluded it wasn't worth it and declined the offer.\n\n***Right now I'm getting to the gist of what I actually wanna ask:***\n\nSo I signed up for a master's degree, which takes 2 years to finish and I'll start in October this year. I'll also start attending jewelery school to become a certified jeweler in September. This renders any full-time job impossible. I've also started making YouTube videos (and dw, I'm being honest with myself and know it might not ever pay anything) and have a business idea I'd like to work on. I also actively study Chinese.  \n**My biggest struggle is this:** Am I wasting away the precious first years of my career in which I should be getting a \"real\" job and working on gaining experience in my field (econ)? Is my current plan essentially a bet? Or is it alright that I'm postponing a career to my late twenties, because the potential rewards outweigh the risk?\n\nI'm not opposed to a full-time job, not even a corporate job, but I think these two years could be really interesting and could potentially bring me more than career experience. I just have to accept the fact that I'll be \"becoming an adult\" later, which is tough, because being independent is important for me. I'm looking for other jobs which I could do alongside the assistant job but it's pretty hard to find such openings.\n\n**TL;DR:** I'm 24 and I have a cool part-time job, I also have plans for the next 2 years which could potentially work out well. I don't get to be an adult because I don't have enough money. Should I switch to a real job, become an adult and start gaining career experience instead?",
    "title": "Should I try to land a \"big boy job\" or continue going my own way?",
    "subreddit": "careerguidance",
    "timestamp": 1680685042,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I take a job I'll likely hate that pays 50% more than my current job? Throwaway for anonymity.\n\nTL;DR: this new job is not what I'm interested in, not aligned with my long-term career goal and will involve long hours BUT pays very well. Should I take the offer and just stick it out for a couple years?\n\nI (31yo) am currently an analyst at a global market research agency (pays \\~55k USD pre tax). It's almost the perfect job: I love what I do; smart and fun colleagues; great work-life balance; flexible working & close to home. The only thing lacking is the progression opportunity to a more technical role (data scientist) within the business, which is my long-term career goal and I'm doing a degree on the side for the switch in the future. \n\nThe new job is neither aligned with my career plan nor interesting in any way but pays well (80-85k USD). It's an overseas role (based in my current city) for a Chinese internet giant. The role involves some data analysis, which is my thing, but is more around strategy & operation. The company is notorious for long hours and toxic work environment in China, although I'm not sure if it's the case for overseas offices, the interviewer himself did warn me 'be prepared to work late, it's going be more intense than any local companies'. \n\nThe recruitment process also left me an eerie feeling: the HR asked to friend me on WeChat, after being refused, messaged me on WhatsApp (my mobile number is on my CV) and continued to do so after I  politely stated my preferred way of communication is via email... I'm worried that my boundary will not be respected after I join. To add to it, I'll be reporting to a friend from uni (i.e., my friend will be my manager), which makes me think it's going to be even harder to say no to unreasonable requests. \n\nBut... it pays so damn well! And I'm saving to buy an apartment. \n\nI'm torn if I should take the offer for the pay. Any advice would be appreciated, especially those who have 'stuck it out', what's your thoughts?",
    "title": "Should I take a job I'll likely hate that pays 50% more than my current job?",
    "subreddit": "careerguidance",
    "timestamp": 1676595252,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I have opened my mouth or was this good? Should I have continued and put this guy in his place?\n\nSo this took place in a professional setting just now. My question is if I should have stayed silent or should have put this guy in his place in front of my direct supervisor.\n\nThis is about a Chinese co worker of mine. I am a first year PhD doing research in a lab, he is a second year PhD in the same lab setting. \n\nCurrently we are busy with renewing all safety protocols and flowcharts to confirm with safety regulations. We have meetings on this subject every week 2 times as we are not allowed to work inside the lab until they are finished. This is our main and only focus at the moment so we can all start as soon as possible. \n\nEveryone has been assigned a few flowcharts to produce so they can get accepted as soon as possible by the safety managements. Last meeting my co-worker didn’t show up at all. This meeting today he showed up, however he hadn’t done any work on the flowcharts at all and was completely uninformed.\n\nDuring the meeting at some point he raised an issue about an item we use in our processes. It was something that was mentioned in the previous meeting (the one he didn’t show up to!) and was a non-issue as it was already fixed. My other coworkers are kind and tried to explain it to him, but it took 5 minutes at least basically due to a language barrier. That’s when I stepped in and said that it wouldn’t be an issue and it’s been talked about before. Then he asked if I did a similar process to him and I said not the same but similar. He said rudely oh you don’t know what I’m talking about. \n\nI remained silent cause I didn’t want to lash out in front of my supervisor, but should I have at least put him in his place? It’s frustrating that this guy gets away with this behavior, not doing required work, not showing up and then being rude when he basically repeats a question. I am thinking my (and his) supervisor will also have seen that he was being rude and lashing out is not gonna be beneficial for me. \n\nWhat are your thoughts?",
    "title": "Should I have opened my mouth or was this good?",
    "subreddit": "careerguidance",
    "timestamp": 1694619107,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Are there any career pathways worth considering? When I was young I didn't like studying, like many Asian families, I was forced to go for enrichment classes/tuition in order to brush up on my grades. Only after hanging out with some of my friends in my final secondary school year @16 y/o, I managed to get the second highest grading for my chinese, elementary math and additional math. After which, I took up a local polytechnic diploma in marketing which is equivalent to a associate degree and my grades started to go downhill from there. I never like the course which I took and I was just going thru the motion and eventually graduated with passable grades. \n\nAfter graduation, I was enlisted in a compulsory conscription for 2 years and ever since then I don't know what to do and have no sense of direction in life. 9 mths later after I got discharged from my national service, I was helping out my uncle in his small company as an intern setting up some cloud CRM related software for other small businesses which I eventually got zoned out of as I really didn't like what I was doing.\n\nWork as a bank admin officer handling and processing cheques for SGD 2.1k for about 4 mths before the project ended prematurely and we were forced to resign as they got too much manpower back in 2017. Mixed with a bunch of bad companies during 2018 and found myself working in a container job doing loading and unloading of goods and a few months later I left it as well as there were no future prospects from it and I need to travel 2 hours+ just to go to work every morning. Needless to say I left my toxic friends as well as almost every week we're just partying non stop and it's really a drain to my mental health at that point. \n\nThings turn out to get from bad to worse real quick as I joined an insurance company and sign a 3 year contract with them. The first year we were pulled in by the \"bond money\" that got us interested in signing up in the first place and that gullibility saw us sank even deeper down the rabbit hole. In short, our managers were doing the sales for us and planting cases under our names and earning alot of money from those contract commissions while we were paid a min monthly wage SGD 1.5k so that we can \"buy our time here and expand our clientele base\" aka the usual \"fake it until u make it\". Even though the sales weren't mine, I still need to pay taxes for the \"sales proceeds\" I've made and hence I got into a so called \"contract debt\".\n\nWhen covid started, I quit my insurance job and work as a food delivery cyclist and earn about SGD 1.3-1.4k for about half a year. It doesn't prove to be a feasible job anymore as the economy was slowly opening up and I found myself working my ass off everyday 6 days/week in a never ending f&b job. Not to mention, the management I was working in was toxic as hell and often finding beef with the chefs and even the boss of the company. \n\n5 mths later I join a contract based survey job which turns out to be so heavily sales-ish that the project manager makes Hitler's actions pale in comparison. However, the pay was SGD 3k and it was a huge jump in my salary.\n\n3 mths after the contract ended, I joined this Chinese online tuition company and I got a pay cut of 500 but at least it was a 3/4 day shift rotation/work week and we were allowed to WFH. Likewise, the management were also very bad due to too much gossiping, politics even though we were WFH.\n\n6 mths later, I eventually land myself in my current job that pays SGD 3k, fully WFH and I just have to reply emails. 1 year after my contract ended, I expressed my interest to renew and there's an additional $200. However much as I like the freedom my current job provides, it is literally like a WFH security guard waiting for email to pops up and reply to them. I am contemplating if I should apply to sign up for a scholarship to serve as an direct entry inspector in the police force (inclusive of a min 4-6 years bond) as I found myself developing some sort of interest in studying criminology after working in customer service and also because it is challenging and I get to solve different type of cases everytime. But all I can say is that the chances of getting scholarship is very slim as my grades suck and I don't involve myself in extra curriculum activities in school. \n\nOtherwise, are there any other suggestions that I should try to explore in terms of career pathways? Help appreciated thanks.",
    "title": "Are there any career pathways worth considering?",
    "subreddit": "careerguidance",
    "timestamp": 1687185060,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "URGENT: Would you quit? If ideas discredited, disrespect by boss/their boss, given inconsistent info/blamed, asked who else you’re speaking to, initiatives taken are suppressed, prohibited to speak to other teams who do value them. \n\nHowever, others have given consistently positive feedback, put forward for roles you may be interested in; however, above individual who is dismissive of most of your work, likely to oversee projects in area of interest.\n———-\n\nWould welcome insights, as feel on verge of either 1. Quitting 2. Transferring departments\n\nContext\n\nWork for a large, prestigious organisation. Have been in current role around 8 months\nFeeling disrespected by certain individuals. Given inconsistent information: Boss initially asked for ideas for a new solution, when new to job - shared these at high level in a slide, and was told “how are these relevant”, without being able to talk through. Suggested to explain in more depth but was ignored.\nAsked to contribute to thought leadership, spent hours writing twice, but didn’t hear back for 3 months - then told decided to change topic and work was not used.\n\nTold not to speak to other teams/parts of business; who do value ideas and work Have received consistently positive feedback from other teams/ those within team leading other areas and projects. Was asked to present my own views on market developments (public, non-sensitive information) , in a firm wide group. This led to follow-up actions to collaborate with leaders in other parts of the business, and drive some of these ideas forward - which I enjoyed. \n\nWas told off for this after by 2 more senior individuals in my team, and for speaking to other teams on my own ideas (despite fact they had rejected) - as they claimed they “own” these effectively, even though they had dismissed them earlier, as soon as they realised others are interested. \n\nIn my team, area I am interested in, within my team is led by these 2 more senior individuals who have almost consistently been dismissive of most of my contributions.\nMy current team has several leaders, each responsible for heading different topics and sectors. Have positive rapport with the others, but due to hierarchical nature - to work in areas of personal interest, must be run through above 2 individuals and have their approval it seems.\nHigh degree of politics as organisation is going through likely divide; though official stance is to continue collaborating across teams, have been stifled from doing so. When asked why, told it was “to protect my interests” in case I shared misinformation by accident? Or other teams “take ideas”\nSince the above presentation, have had 10–15 instances of the same leader: \n\na. Publicly picking me out specifically on team calls, for minor things others have also done in the past - E.g. losing connection for ~1 min on video and having to dial in via phone\nb. Has sent emails asking “who else I have spoken with” outside my team; and emails with others cc-ed asking if I have shared anything beyond my team. (Prior to this, had already explained after the presentation that only my own personal ideas they had dismissed were shared, nothing pertaining to my team specifically had been shared externally at all)\n\nc. Has asked for copies of materials for conversations with other teams multiple times - despite already explaining the above. Then sent a. Email that I don’t feel comfortable with the trust deficit, and would be happy to have a call with them and other teams to clear the air, and avoid “Chinese whispers”\n\nd. Despite all the above, last week tried to maintain positive attitude. Out of own initiative, did extra research for a client project led by this leader, and encouraged junior team member to also present to practise their soft skills. When presenting, was criticised to the extent that the junior team member said unprovoked, after call - “sorry X was so mean, felt their comments were harsh”.\n\ne. Given inconsistent information, and when try to manage upwards and challenge constructively in the interest of small project team, when given conflicting information; told to “do as in told” as that’s the “way things work at X firm”.\n\nWhen asking politely on call for clarification (the senior person has to review work, and gave two contradicting pieces of information); they said “you are the manager, i shouldn’t have to tell you; I could just get another manager (to manage you and the junior) if that was the case”.\n\nHowever the reason I clarified was as her senior said I need to have her on board for everything/assumes I don’t work with the team. Though I have in every decision made/ proactively helped them for new areas they knew less about before and vice versa.\n\nNext options\n\nPositives of my role: I genuinely have great collaborative team mates beyond the 2 senior individuals mentioned (I am at Managerial level). However, for areas in my team on the topics I want to focus on, I have to work with them as they “own/lead” these. If proposing new areas for my team, same seems to apply\n\nThere is another member of leadership at same seniority in my team, who has said they will “look out for me”, in terms of finding projects that align with my interests + business needs in future. And if I need guidance on anything. I have a positive rapport and got great feedback doing work with them before. I was also put forward by them and even the person who has dismissed my ideas, for a well-regarded position initially in an area they thought would align with my preference for strategy work. However, because I had asked for some insights on this from people in that role currently/recently, was told “this looks bad and we shouldn’t be doing this”, and it was rescinded.\n\nOption 1: Transfer team\n\n2 fairly senior individuals in the teams who wanted to take my ideas forward, have suggested to make a case to move into their team. This part of the business does have higher remuneration; however, they are not doing much billable work in the areas I am interested in. Pro = they may be receptive to me having a leading position in this, as it’s a new area; Con = most of my projects will likely be in areas of less interest until getting sold work in area of interest which is new for them/ not guaranteed and when\n\nOption 2: continue in current team but change “line manager”. However our projects are all led by different people each time, and in the area I am interested in, the same senior leader I have mixed feelings about / who picks a lot - is likely to be heading\n\nOption 3: look for role outside the company\n\nWould really welcome insights; or if you’ve been through something similar, as it’s quite a tricky situation to navigate",
    "title": "URGENT: Would you quit?",
    "subreddit": "careerguidance",
    "timestamp": 1680443440,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I go work for TikTok in Bay Area? Advices for TikTok design offer!\n\nI have a critical decision to make in terms of my career.\n\nI recently get an offer from TikTok of Senior level designer. I have 4 years experience work in a big US hardware company in design. And the background is fit that team in TikTok. The offer will raise 100% of my current salary and promises fill my green card from day 1.\n\nBut,\nI have lots of concerns:\nFirst, I will be the only designer in team, and will wear multiple hats of product and program manager, researcher, and visual / feature designer’s work content.\nI will have 0 work life balance in my imaginations…\nThe culture in team can be rough. My team is all Chinese engineers (majority male) and my manager would be Tech lead… basically no design manager at all, I will manage myself. \nThe green card process can be slow, and company can be banned… due to political issues.\nI felt like it’s a good opportunity to practice work in a startup format fast pace company. But I also can fail. \n\nCould someone can help me with that? What should I do? Should I accept the offer or should I choose other options, like other big companies or stay in current.\nReally appreciate your advice!",
    "title": "Should I go work for TikTok in Bay Area?",
    "subreddit": "careerguidance",
    "timestamp": 1696114751,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Is the project management right way for me? Or maybe something else? Dear r/careerguidance, I would like to ask for your advice. \r  \n\r  \nI have a degree in Chinese Studies from one of the universities in Beijing. I've been working for my current company - a Chinese energy company - for 7 years now, I started as a translator and as I gained more knowledge about our investment projects, I was promoted to Project Specialist and later Senior Project Specialist. As I progressed, I was able to do more complicated work, ranging from liaising with local governments, preparing official correspondence, holding meetings and monitoring work schedules. As my current job is relatively well paid and I have good relationships with my colleagues, I'd like to continue, but there are two main issues I have to deal with.  \r  \n\r  \nFirstly, the projects we've been doing - all procured by the same state-owned company - are inevitably coming to an end, and the company is looking for new projects, but in a haphazard way and without a clear agenda. The head office has decided to switch our focus to renewable energy, but we've been given no resources or training to deal with the task of developing business in the new market. We just follow the tender websites to see if anything comes up, or are approached by the independent agents/intermediaries who are primarily acting in their own interests. My advice to employ an experienced business development manager was ignored, as was one agent's perfectly reasonable idea to carry out a model project with delayed payment for the local authority, which was very keen to do it. \r  \n\r  \nI took a post-graduate course in project management to boost my CV and get more opportunities to grow within the company, but unfortunately I was never offered a chance because we never get any projects except for those we do for the government, and for those the list of requirements for the PM role is very long. \r  \n\r  \nSecondly, I have gained a lot of experience in my work, but I feel that it is largely non-transferable, as it generally involves dealing with the investment process in a particular state-owned enterprise with its own set of rules and procedures - and explaining that process to my Chinese colleagues and bosses. Energy companies tend to hire specialists with very specific backgrounds - engineers, lawyers, etc., and for any project manager or account manager role, they require previous experience. Chinese companies recruiting in my country, on the other hand, are looking for people who are fluent in Chinese (which I speak) AND have experience in whatever they are doing, be it logistics, automotive, mobile phones, e-commerce, cosmetics and so on. \r  \n\r  \nBecause of the above, I feel that I am in trouble. **I don't know what jobs I can apply for. I am eager to learn new things, but I have no idea what to choose.**",
    "title": "Is the project management right way for me? Or maybe something else?",
    "subreddit": "careerguidance",
    "timestamp": 1699954687,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Is there anything wrong with my resume? I can't seem to land the type of job that I'm interested in. Sorry for taking quite some information off for privacy protection purposes but I'd really like to know your thoughts.\nI'm looking for jobs in \"Key account managing\" or \"customer relationship\" related field but never seem to be able to land any positive feedback. \nAm I on a complete wrong track? How do I improve my background? \n\nMy resume :\nCurrent job (1 year) as customer relationship coordinator \n-Customer relationship management (open order status and management)\n-Pricing analysis\n-Internal flux management\n\nPrevious job (internship+short term contract - 8 months in total) as commercial and marketing assistant- Customer relationship management (Chinese region)\n- Conception of product guidelines- Business relation management with China region clients\n- Business development (prospection) for South East Asia region\n- Business development for new product range\n\nAnother internship as event manager assistant \n- Event planning & management for a worldwide Airline Conference\n- International project coordination\n\nEducation background\nMaster's in communication\nMaster's in marketing and international sales management",
    "title": "Is there anything wrong with my resume? I can't seem to land the type of job that I'm interested in.",
    "subreddit": "careerguidance",
    "timestamp": 1676955819,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Resigning During Probation to Rejoin Previous Employer, any advice? Hey folks! I'm reaching out to seek advice on a tricky situation I'm facing in my current role. I joined this company about three months ago under the impression that it would be a purely strategic marketing position with senior responsibilities and decision-making authority. The salary was also a major draw, being 50% more annually than my previous position.  \nHowever, the reality of the role has turned out to be quite different from what was advertised. I'm essentially a one-person team, without any senior mentorship to guide me. Instead, I'm finding myself teaching my expertise to the growth director (which I don't mind for now) because this person has no prior experience in the field.   \nMy current role has also taken on a more sales-oriented nature, requiring me to constantly pitch my strategies to the Chinese team, which manages the European branch like an agency. Due to cultural differences, our work is often overlooked or not requested, and I'm constantly in a selling mode. This was not something I was aware of when I accepted the offer.  \nMy previous company has reached out with a new position. It's in a different team with increased responsibilities, and the new boss is a friend and a great mentor. The reason I left my previous company was for career advancement and salary, as my manager at the time was not supportive of my growth. However, with a new manager and team, I believe this opportunity offers the growth and development I seek.  \nAfter careful consideration, I've decided to accept the new offer, which means resigning from my current position. I plan to politely explain my reasons for leaving, including the lack of a mentor, the sales-oriented nature of the role, and the limited scope of my responsibilities, which more closely resemble a copywriting position. While I'm on probation and my resignation period is zero, I plan to stay 2-3 weeks to complete outstanding tasks. \n\n  \nAny advice on how to conduct this talk? Without my manager and team feel offended because they're a nice team but I don't feel I can grow in this position :(  it is too hard for me to confront this",
    "title": "Resigning During Probation to Rejoin Previous Employer, any advice?",
    "subreddit": "careerguidance",
    "timestamp": 1701112390,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I take the risk and pivot into another industry? I graduated from Taipei University of Technology in 2016 with a bachelors in electrical engineering and have been working in the consumer electronics industry ever since. I've spent 4 years in Foxconn based in China and now I'm employed in San Jose, California with another Chinese OEM in the lens/camera/ARVR module industry. I have quite an extensive consumer electronics program management experience with a little bit of account managing experience. \n\n&#x200B;\n\nRecently, I feel like I've hit a wall in my career and I've been looking to pivot into other sectors, namely data science or AI related fields. I realize that with my current education and experience, it may be very difficult for me to find a job in that field so one of my options is to go to masters or MBA. I was looking into the UC system since I'm a US citizen and California resident. However, I've encountered a few problems:\n\n1. Grades: My undergrad GPA was probably only around 2.0 -ish for various reasons although I did have some amount of extracurricular activities.\n2. Tuition: Right now I make a humble 100k+ in the bay area but I'm uncertain in taking out a student loan for a career pivot that may or may not pay off in the future. If this master's degree is unable to help me increase my salary, I've probably just spend north of 100k and wasted 2 years of my life. \n\n&#x200B;\n\nAnother option right now, is that since my current job is partially remote with flexible work hours, I could potentially sign up for online courses. My issue here is that, I'm not sure just how useful those certificates are and how well they're recognized. Does anyone have any recommendations?",
    "title": "Should I take the risk and pivot into another industry?",
    "subreddit": "careerguidance",
    "timestamp": 1689221052,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I Quit My Grad Scheme? (UK) Joined a Big 4 Grad scheme September this year, in the tax line of service so I am required to complete the ICAS CA qualification. Currently doing the first level (TC) and got my exam results back, failed 4/7 exams and need to resit in January. Not allowed to push them back to the next exam dates which would be in March as I have no extenuating circumstances.\n\nThe company itself has been great so far, I don't have a problem with the actual work (since I'm an associate all I've really had to do is fill in forms and draft emails, plus I was away on study leave from September - December so I've only done like 3 weeks of actual work). I don't have a problem with colleagues etc I just really don't want to do the qualification. I knew full well that this was part of the grad scheme I jsut didn't realise how tough I would find them. Doing those exams and studying for them is awful, I find everything so boring, I just zone out when I try to study and get distracted by virtually anything but the study materials. I recognise that all of this is my fault, I thought I could just bullshit my way through the qualification till I could move onto what I actually want to do; which realistically has nothing to do with accouting or tax.\n\nIts going to sound childish, but I just followed my mother's advice when I was applying for grad schemes, (she's a retired fund manager), and she told me that tax would be a comfortable job and that it would leave me enough time to do what I actually enjoy. Because she actually had experience in the industry I was much better set for writing CVs and cover letters for companies in the finance industry, compared to the other industries I applied for. She's always pushed me towards accouting jobs because she basically gives them the same status as doctor/lawyer/engineer (she's a typical Chinese tiger mother). \n\nI know for a fact that what I want to do is be an author, but I am also prepared to acknowledge that the chances of me having a successful writing career that I could live comfortably off of is fairly slim, if I could even get published at all. Before I started this scheme I wanted to work as an accountant to support myself; if I became a successful author I would quit, if nothing came of it, nothing would be really lost since I'd have the accouting job to keep myself going. However these last 3 months its been none stop studying and anxiety and I'll admit I've not written in years because my time keeps getting sucked into my studies and by them time I submit the mandatory work I'm too exhausted to sit and actually write what I enjoy.\n\nI suppose my rant is really to ask if I should quit now? My mum has said if I'm not working on a grad scheme she'll kick me out, but I don't know if I'm capable of getting into a different industry since all my work experience indicates that I'd want to be in finance. I feel like I've ruined my life, if I had simply failed to get into a grad scheme she'd be supportive of me trying to get new work, but because leaving means 'losing an amazing opportunity' she won't support me in any way, shape or form. The thing I keep going back to is that its not really the job but the studying and the qualification that I hate. I want to ask to move to an area where I don't have to study and I can just do work; but I feel there's no way for me to ask for that without sounding lazy and stupid. Do I just try and get through the exams and decide from there, even if they make me miserable? I'm so tired of everything and it's only been 3 months, I don't know what's wrong with me. Thanks in advance.",
    "title": "Should I Quit My Grad Scheme? (UK)",
    "subreddit": "Accounting",
    "timestamp": 1703274642,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Looking for Advice on an MBA or other next steps in my career TLDR: Accountant with 6 years exp. working at a small business with little oversight. Have been looking for new work the last year and have gotten close to offers half a dozen times, but all have fallen through because of bad timing or because I'm a close second best for the role. I've noticed more staff accountant jobs (my current role and role I want to go to at a new company) asking for or outright requiring a CPA the last few months. I don't really have the money to continue school and get my CPA right now, but I could stretch if I clean out my emergency savings. I don't feel like my BA has really paid for itself as I make $20 an hour, so I am worried that paying for an MBA is throwing good money after bad and I'd like some opinions on next steps. Other positions I haven't thought of my experience might be a good fit for, etc.\n\n>!I'm 29 and I'm thinking about doing an MBA (the U of Phoenix that supposedly can be done in under a year for $10k). I'm currently working full time as the sole staff accountant in the US for a small retailer. I handle everything short of payroll and financial statement preparations (which are handled by the business owners), which includes all our data entry, AP, inventory accounting/reconciliation, credit card/bank/store cash/payment processor reconciliations, all driving a 10 calendar day close every month. I'm getting more involved in payroll and could see a future where I'm asked to take that on as well. I've worked 95% remote since 2020 (which is largely possible thanks to an electronic invoice filing system that I developed and implemented solo) and currently have no plans to go back to the office, we don't even have office space for me anymore as we downsized during COVID. I love my job, it's a good balance of busy during those first 10 days of the month when bank statements come in and I have to get everything balanced quickly, with more laid back times just focusing on data entry and process refinement the rest of the month (as well as putting out any fires that come up, though I know our business and industry well enough to anticipate many before they become a problem). Also, my boss is Chinese and spends half the year in China focusing on the Chinese side of our business, so I get to work pretty independently, especially for someone so young.!<\n\n>!However, I also only make $20 an hour in LA (southern California LA) after working with this company for 6 years. I started as a temp, working on a data entry backlog. They hired me on officially after a few months and I was at the bottom of a department with 3 full time US accountants (including myself). The only question they had before hiring me was whether my degree was in accounting or just business as they really wanted an accountant, and I do have a BA in Accounting (top 5% of my class for what that's worth) from a Cal-State.  I was learning fast and taking on new responsibilities every few months, then covid hit and things accelerated. One of the accountants above me left the company and I was asked on very short notice to take on a lot of their workload. It was a bumpy few months but ultimately I did it. At this point I was making $18 per hour, I asked for $25, my company gave me $20. I'm willing to admit I did a terrible job with pay negotiations both when I was hired and when I asked for my raise. I'm sure I would be better at those discussions now but that ship has sailed and it isn't going to solve my problem now.!<\n\n>!Early last year, 2022, the other accountant above me left the company and I was asked to take on a lot of their workload. Again, a few bumpy months, but ultimately I did it. The company also restructured at this point fully separating the US and Chinese business divisions. Because of this I lost a lot of benefits. I now provide my own health insurance because I'm type-1 diabetic and none of the plans the new entity offered fit my needs. I also lost paid holidays and any form of PTO.!<\n\n>!So I decided to ask for another raise in April of last year and my boss flatly refused to discuss it. Their offer was to come back to work in the office (which has no office space for me, I would literally be working in a closet) and they would consider adding me to the key employee bonus program for an undisclosed amount and figure out how to set targets someway that weren't tied to sales. I was trying to get $30 an hour, but we never even got to numbers. At that point, I realized I set a bad precedent with my previous negotiations, that I probably would never get what I wanted here, that I didn't get an accounting degree to make $20 an hour with no benefits, and I started looking for new work.!<\n\n>!I was rusty, so I can confidently say I wasn't really competitive for the first 2-3 months of looking for a job just because I had to get used to doing interviews, brush up my resume, figure out what kind of titles/job descriptions were a good fit, etc. Then, I started working with a few recruiting agencies and was consistently getting interviews starting from last August, at least one or two a month. Last October, I got to the final round with a company for a Staff Accountant position and was told to expect an offer within a week (for a hybrid job paying $80k annually, or close to double my current pay). Then they got their q3 financial results and instituted a hiring freeze. Major bummer, but life goes on and it seems like I'm at least a competitive candidate. Managed a few more interviews in December and started getting interviews on my own this January. In February, I got to the final round of interviews for 2 jobs in the same week (one on my own and one with a recruiter), both fully remote and offering $80k+ annual salaries, and unfortunately when it was narrowed down to a final candidate both of them chose the other person.!<\n\n>!I was of course not pleased, but at this point I know I can get a great job that will let me keep a lot of what I love about my current job with a more livable income. March rolls around and I have multiple interviews every week for hybrid or remote positions paying anywhere from $70k to $90k. In one interview, I would have loved to work for the company just because the hiring manager was one of the best mentors I've ever had in 20 minutes on zoom. He says it's going to be up to the company if they hire for this role or not, but he has no doubt I can do the job and if he could make the call he would hire me then and there. He's also surprised I never went after my CPA/MBA, which is part of what planted the idea in my mind. After months of rejections at one stage or another it's nice to hear this. And then they got their q1 results and implemented a hiring freeze.!<\n\n>!After this I'm starting to notice that a lot of the jobs I'm looking at are asking for a CPA (still mostly looking at staff/sr. staff accountant positions mind you, the occasional jr. position or AP role), and some are even requiring it. May comes around and I only have one interview the whole month (for a fully in person role in DTLA, I decide against continuing with this one because I cannot bring myself to go back to DTLA, I did it for a week once as a temp and I would never like to do that again), almost every job is now saying CPA preferred at a minimum. So far in June, one interview for a job I knew I wouldn't be getting about 10 minutes in (they weren't asking me the right questions, I knew their mind was already made up and this was a courtesy more or less).!<\n\n>!Now, I haven't heard from any of the recruiters in months, it feels like jobs are out there still, but have definitely dried up. I'm not opposed to working in person, though I will not do DTLA and a lot of the jobs around here are there. Look at a map and I don't want to be west of the 710 freeway. The commute is 90 minutes+ each way and safety is also a concern in the city center these days.!<\n\n>!What's next? I didn't plan on my career topping out at my first long term job out of college. I could just about squeeze out the Phoenix MBA, but I would be dipping into my retirement/emergency savings to pay for it. I'm nervous to make that move because frankly I don't feel my undergrad has paid for itself. If I had a crystal ball 10 years ago and could see what my degree would cost (around $30k) versus my pay today, I don't think I would have even gone to college, probably would have done trade school and gone into construction like most of my family. I don't want to make the same mistake with an MBA. In fact, I can't AFFORD to make the same mistake with an MBA, if I do this and it doesn't lead me to higher paying work then I will be at least 2-3 years behind where I am now financially.  If I take out loans for this and I don't get higher paying work, I'll be losing money every month.!<\n\n>!I've always liked the managerial/process side of accounting more than the reporting side, and I feel like the CPA tends to focus more on the reporting side, so I'm really unsure if pursuing that is the best fit for me. Also, as I understand it, to even sit for the CPA exam anymore you need an MBA, so there's the cost/reward issue there. Any thoughts/tips on what I might consider next?!<",
    "title": "Looking for Advice on an MBA or other next steps in my career",
    "subreddit": "Accounting",
    "timestamp": 1687197099,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "New(ish) to consulting, is this normal? I work for an innovation consultancy. I joined about 1.5 years ago. We do a lot of strategic thinking and validation of new products (mostly digital), businesses, services, etc. for S&P500/FTSE100 types. Mostly I like the job but it's ruthlessly stressful and I don't know if I should start to think about leaving.\n\nLately I've been working for a client (large retailer) who has been nothing but rude, unorganised, frantic and demonstrating a severe lack of leadership. We're helping them launch a new proposition.\n\n**The project:**\n\nThey have three other consultancies working on the same project and it's a giant game of chinese whispers, posturing, confusion and ineffectiveness. No one is really steering or leading the project client side. As a result, our goal posts change daily and we're expected to pivot on a dime piece. No one can tell us any sort of plan, we get different answers depending on who you talk to and it's just a dumpster fire all around. Stakeholders client side range from psychopathic, to stream of consciousness wafflers, to hyper-rationale binary detail orientated autists, to inept proposition managers who don't have an entrepreneurial bone in their body. Most of them are over worked and rude (miss meetings, scowl, shake heads, infighting, etc.).\n\nThe net effect is that we're really not creating impact and it's kind of annoying. It's just turned into glorified cat herding and the work we're presenting isn't really that interesting or innovative as a result. They blame us for a lot of it too. \n\n**Me:**\n\nI'm 4 months in to the project and have been sick twice. Working until midnight at least once a week. Typically 8am - 8pm every day. So much pressure from all angles for no apparent reason. It's really starting to effect my wellbeing. I have no energy for things outside of work. I'm constantly trying to rest or catch up on sleep. Have flagged this to my boss but it feels like there's little he can do as it's the founder of our agency who is selling the work in and over scoping + under resourcing and expecting us to deliver (something/anything) week in/week out. On a call the other day he basically said if the client wants it (however stupid it the ask is), we'll do it.\n\nOn top of this, I like to think deeply, strategically and creatively and this just feels like there's no time to breathe. I feel like a total ragdoll. I thought consulting was all about working hard to solve great problems, creating impact and being proud of the outputs. I'm not so sure it's for me and wondering if I should find something else like architecture or perhaps an adjacent field like experience design.\n\nTL:DR: I'm getting deluded by consulting and don't know if it's right for me.",
    "title": "New(ish) to consulting, is this normal?",
    "subreddit": "consulting",
    "timestamp": 1679085916,
    "score": 53,
    "keyword": "chinese manager"
  },
  {
    "text": "“No, where are you REALLY from?” Such a common question I get asked at work. I just started this job and I’ve had someone ask me this at least once every week. It was a lot more prevalent when I was in grade school, though. I just don’t understand why non-Asian people (particularly white people) can’t just accept “I’m from here” as an answer. I’m not even lying either, I’ve lived in this godforsaken country for two damn decades! I thought about an alternate reality where Asian customers ask white workers where they’re from and probe if they’re Russian, German, etc. A lot of this is also paired with racial compliments and remarks towards how “ethnic” I look. The same customer who asked me where I was from was like, “I would’ve never guessed you were Chinese! You just look like something/got something going on!” and called me “hun” and “gorgeous” within the span of 15 minutes. 🙄 Apparently my work today got a call from some random asking for the name of the “pretty Asian girl who works here” (I have a few other Asian co-workers). The morning shift manager slammed the phone on his ass according to my closing manager. I’ve been the target of a multitude of racial “compliments” since I was in my mid-teens and thought it would stop since it seems like these types of men don’t want older women their age. There is also a customer who regularly comes here and sends money to people in the Philippines and he recently asked for the phone number of my newly 18yo co-worker. 🤩 God, if you exist, give me patience or send the flood. Lol",
    "title": "“No, where are you REALLY from?”",
    "subreddit": "asianamerican",
    "timestamp": 1698024376,
    "score": 140,
    "keyword": "chinese manager"
  }
]