[
  {
    "text": "Got a job offer. Company has a lot of red flags. I got a job offer for a startup company. Initially thought the company was a good company to work for, then I read the Glassdoor reviews and started to get bad vibes about it. Went through the job interview process anyway just in case none of my other leads work out. Got the job offer a couple of days ago with a very attractive compensation package, BUT I'm extremely worried about the company and the toxicity that previous employees claim it to be. \n\n* 2 .5star review on Glassdoor, virtually every employee telling me to RUN \n* Founder is Chinese and about 90% of employees are Chinese - very little diversity (though this seems to be changing); reviews claiming that the culture is very much like old Chinese warehouse labor \n* Employees seem to be overworked with very little work/life balance almost all reviews are past employees claiming the culture sucks, CEO sucks, leadership sucks \n* One interviewer I spoke with literally answered his phone TWICE during the interview \n\nThe only positive things for me right now is the fact that my manager seems tolerable and the pay good but overall I have a feeling that I'll be pretty miserable working for this company but at the same time I do not want to say no to an offer knowing I've been unemployed for months now. \n\nSeriously considering saying yes to the offer and taking it while I look for a better job. OR, saying no to the offer and continuing my job search - I'm currently interviewing with companies that I actually like (i.e. Uber, Amazon). \n\nAny thoughts/advice?",
    "title": "Got a job offer. Company has a lot of red flags.",
    "subreddit": "jobs",
    "timestamp": 1630734523,
    "score": 2,
    "keyword": "chinese ceo"
  },
  {
    "text": "So, umm, are you guys able to buy components and parts? We are hurting pretty bad.  Even seemingly generic screws and other hardware we are having issues finding these days.  Some electronic components are *months* out when in the past they might have been on the shelf stock items.  We have suppliers who are flat-out - they couldn't expedite things regardless of any extra money we might be willing to pay them.  Its crazy out there.\n\nWhat are you guys seeing?\n\n**EDIT:**  Looks like everyone is on the same misery-train.\n\nI guess that whole idea of industry putting all our eggs in one Chinese-made basket was a really, *really* bad idea, huh??  \n\nI'd like to think that industry will learn a valuable lesson in not outsourcing *all* manufacturing to essentially one location, but I know better than that.  The second supplies and raw materials get back to near normal, they'll be some scumbag CEO and purchasing agent saying \"hey look over there to Chinese, we could save 5 cents by having them make everything again\".",
    "title": "So, umm, are you guys able to buy components and parts?",
    "subreddit": "engineering",
    "timestamp": 1621866483,
    "score": 635,
    "keyword": "chinese ceo"
  },
  {
    "text": "Should I accept the job offer? I got a job offer for a startup company. Initially thought the company was a good company to work for, then I read the Glassdoor reviews and started to get bad vibes about it. Went through the job interview process anyway just in case none of my other leads work out. Got the job offer a couple of days ago with a very attractive compensation package, BUT I'm extremely worried about the company and the toxicity that previous employees claim it to be.\n\n* 2 .5star review on Glassdoor, virtually every employee telling me to RUN\n* Founder is Chinese and about 90% of employees are Chinese - very little diversity (though this seems to be changing); reviews claiming that the culture is very much like old Chinese warehouse labor\n* Employees seem to be overworked with very little work/life balance almost all reviews are past employees claiming the culture sucks, CEO sucks, leadership sucks\n* One interviewer I spoke with literally answered his phone TWICE during the interview\n\nThe only positive things for me right now is the fact that my manager seems tolerable and the pay good but overall I have a feeling that I'll be pretty miserable working for this company but at the same time I do not want to say no to an offer knowing I've been unemployed for months now.\n\nSeriously considering saying yes to the offer and taking it while I look for a better job. OR, saying no to the offer and continuing my job search - I'm currently interviewing with companies that I actually like (i.e. Uber, Amazon).\n\nAny thoughts/advice?",
    "title": "Should I accept the job offer?",
    "subreddit": "careerguidance",
    "timestamp": 1630871262,
    "score": 1,
    "keyword": "chinese ceo"
  },
  {
    "text": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :) Hi All! I'm a 21 years old director based in Toronto, Canada. As hate crimes against Asian Americans are rising at an alarming rate, I felt the urge to create something to shed light on Asians around the world who are hurting due to this violent racial discrimination.\n\nOver the course of the past couple months, I started planning a short film that would serve as a PSA. The film follows an elderly Chinese woman who walks home and finds herself as a victim of a cruel hate crime.\n\nMy goal for this film is encourage meaningful discussions amongst communities, give insight to what it's like to be Asian during the pandemic, and for the film to go viral. The film will be accessible as possible by making it straight to the point with a runtime of 2 minutes- wasting no time at all. Anyone watching it should feel enraged, no matter what race they are. We plan on shooting the film in Early April and releasing it in May- in time for Asian Heritage Month.\n\nDue to the subject matter, we had to make sure that we were careful as to what we portray and how we portray the things on screen. We were able to get people prominent in this movement such as Benny Luo (CEO of NextShark) and artist/activist China Mac to oversee the story and direction of the project as Executive Producers.\n\nIn order to make this film come to life, we need your support. We have decided to crowdfund the project on Kickstarter. **Support doesn't only come in the form of money- Sharing our link on social media, sending it to a friend or even upvoting this post would be helping us tremendously.**\n\nWe only have 30 days to reach our goal, any amount of money raised will be reverted back to the Backers if we do not reach our goal. If anyone would like to support this project please visit the link below for detailed information as well as Backer’s Rewards! [https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa](https://www.kickstarter.com/projects/angewxng/stop-asian-hate-psa)",
    "title": "I'm making a 2 minute short film to raise awareness on Anti-Asian hate crimes executively produced by Benny Luo (CEO of NextShark) and China Mac. We plan to release just in time for Asian Heritage Month in May. Today is the first day of our Kickstarter :)",
    "subreddit": "asianamerican",
    "timestamp": 1616975494,
    "score": 35,
    "keyword": "chinese ceo"
  },
  {
    "text": "Obviously discussing class is essential, but feminists use this as a way to say men have no issues, and IMMEDIATELY STOP DISCUSSING MENS ISSUES, STOP IT, MY FUNDING AND GRAVY TRAIN IS AT RISK Class analysis is essential\\*\\*\n\nHowever,  specifically when it comes to mens issues it is used by feminists as a  distraction tool. For example, a feminist article by a PROFESSOR on a  reputable education publication was so bad it was actually funny (I'll  explain why it was funny in a sec).... she basically says we need to stop seeing  education as a gender issue and measuring girls doing better than boys,  its nothing to do with gender, its class etc. Dont say boys.... which  boys? which girls etc.\n\nWell professor should have know this is bullshit. A rich boy does worse than a  rich girl, a black boy does worse than a black boy, a chinese boy does  worse than a chinese girl, a special needs boy does worse than a special  needs child, a privetly educated boy does worse than same girl..... in  other words, in every single scenario it is a gender issue... gender is the underlying thread.... and as the CEO of the entire university application system said, boys and girls come from the same family, and live in the same neigbourhoods, have same parents, are brothers and sisters etc so if there is a gender gap then of course it is a gender issues not class etc. It is of course class, but it is also a gender issue.\n\nThe  worst example by feminsits is saying for example the forced  consicription of all males in Switzerland and those who cant for MEDICAL  reasons need to pay 3% tax for 10 years is NOT a gender issue, its a  class issues...... that is literally the stupidest thing I have ever  heard in my life.... obviously its a gender issue first then it can be  other things. Or that male circumcision is not a gender issue.... da fuck?\n\nTHis is where  feminsm actually gets misandric.... that above isn't sexism or stupid,  its actual misandry trying to erase male issues due to the hatred of  men. Now I am one that says sexism, misogyny etc are overused and used  where they dont belong, but in this case misandry is the EXACT thing  here.\n\nNow why is it so bad its  funny (going back to professors article)?.... in this SAME article the author was saying not to talk about girls outperforming boys in school etc, she suddenly does the most random segway and IN THAT SAME ARTICLE says the real gender  issue is kids sending dick pics in schools, other harrasment etc and proceeds to  gender the shit out of it only talking about girls.... hey professor  what happened to its not a gender thing? Which girls, which boys etc. why is it only girls now? Are boys not victims of these things?\n\nAlso feminist why dont you apply this to you beleoved gender wage gap? As clearly it isnt a gender issue. Its actually very specific people and groups of people. E.g. parents. And in fact many entire groups of women (not indivuals, but entire groups) of women get paid more than men e.g. in UK part time women get 6% more than men, young women get paid more etc etc..... so why aren't feminists applying this same lens to women issues which by the authors metric shouldnt be gender issues any more? For women EVERYTHING is a gender issue. Air conditioning is gender issue.... yet for men.... literally even the picking of people by male gender and consrciptuing them on a national level.... so imagine twins, one boy and one girl, it only applies to the boy.... IS NOT A GENDER issue according to feminism.\n\nFeminism is not just a hate movement full to the brim with racists, white supremacists, elistists (and before you cry feminists, FEMINSITS themselves say this relentlessly about feminism) misandry and even misogyny ironically...... its just dumb.\n\n\\*\\*And  as I have stated the issue with feminism is that its analysis is  overlym simplisitic. THere are THOUSANDS of reasons behind one simple  thing/what led to that thing e.g. a specific court in London handing  over custody of a child to mother..... yet feminisms one word answer is  patriarchy.",
    "title": "Obviously discussing class is essential, but feminists use this as a way to say men have no issues, and IMMEDIATELY STOP DISCUSSING MENS ISSUES, STOP IT, MY FUNDING AND GRAVY TRAIN IS AT RISK",
    "subreddit": "MensRights",
    "timestamp": 1622978344,
    "score": 53,
    "keyword": "chinese ceo"
  }
]