[
  {
    "text": "Unique Background - Can't find a job that uses my experience I spent almost 7 years living and working in China. While living there, I started out teaching English and moved up to teaching business English to students preparing to attend US universities. I was finally able to land a business job and began working for a Chinese factory. Long story short, the factory grew exponentially and transitioned from a tech factory (mobile phone cases for brands like Incase, Belkin, etc) to a high end fashion leather goods factory (handbags, wallets, and leather accessories for brands like Kate Spade, Tory Burch, Michael Kors, Coach, etc). We had outstanding growth due to the relationships I built and were constantly picking up new brands as people left one brand, transitioned to a new company, and would reach out to continue working with me. At the factory, I wore many hats, but my primary role was client relationship building. I would travel to New York to show case new products, meet with production teams to discuss pricing and production issues, and met with the directors and SVPs to discuss yearly planning and growth opportunities for the factory. I worked for this factory for 4 years. \n\nSince moving back to the US, I cannot for the life of me find a role that requires my skill set and language skills that at the same times pays a livable wage. I’m open to client relationship management roles, product manager roles, etc but the ones I’m finding are all 30-40K. I was making over 80K while living in China where an apartment in a gated community cost less than $400 a month. I’m not asking for the moon in terms of salary, but I’m struggling to find a real job. I’m located outside of Atlanta, GA and not open to relocating outside of GA as we just bought our house. Any and all help would be appreciated and if needed, I’m more than willing to send a copy of my resume for review.",
    "title": "Unique Background - Can't find a job that uses my experience",
    "subreddit": "jobs",
    "timestamp": 1568409712,
    "score": 8,
    "keyword": "chinese director"
  },
  {
    "text": "1st time creating an ICT/Computer curriculum for primary 4-6.... help?! This is my first time jumping into this community, but my school has just promoted me to \"academic director\" of my primary department (it's a foreign language school in China, where the students study two curricula of English and Chinese).. but we have not had an actual ICT/Computer curriculum ever before and I'd like to make one. The problem is... I have no idea where to begin.  \n\n\nThe students are grade 4-6 (elementary/primary, classes of 24-27 students) and we have access to a computer lab and I could potentially get a hold of video cameras as well. We have class once per week, 40\\~45 minutes a class. \n\nUntil now, teachers often treat the ICT class as just an extra one or something to use to maybe type up assignments or do research for other projects because there has never been an established curriculum and the teachers don't know how to teach it well. I'd like to make it into a more serious class that will actually help students.  \n\n\nWhat I'm thinking so far is starting off with basics: \n\n* typing (the chicken pecking/two finger approach doesn't cut it...)\n* basic file management (understanding folders/organization/not naming files ffffffffffffff or something like that, as they do...)\n* internet safety/knowing what NOT to download (our school was plagued by a dumb newfolder.exe virus last year)\n\nThen more specific things:\n\n* How to do basic research on the internet\n* Microsoft Office things\n   * word\n   * powerpoint (not spending 45 minutes on making the first slide beautiful and getting nowhere with your ppt/what colors go together well/not having a million sparkly things on a page)\n   * excel ?\n   * publisher?? (I personally don't know it well but my boss (the one whose position I'm taking) really liked it and used it for a lot)\n* Scratch programming\n\n&#x200B;\n\nThings I'd like to think about but have no idea about:\n\n* video editing/creation\n* ???  \n\n\nI know this is a big ask, but I'm a little lost here. If I can get a good idea of what things to cover, or a good order, or just some suggestions, I think I can scaffold it and build it up through the grade levels... but I'm a little lost.  \nOne of my bosses asked me what software the IT department should install on the computers, as we'll be using a different computer lab next year for my department so I need to figure everything out.  \n\n\nAny help or direction would be sincerely appreciated!!!!",
    "title": "1st time creating an ICT/Computer curriculum for primary 4-6.... help?!",
    "subreddit": "Teachers",
    "timestamp": 1564633924,
    "score": 1,
    "keyword": "chinese director"
  },
  {
    "text": "Pre-Med to Business, does my current career plan make sense and is there anything I should consider that I haven't already considered? Background: \nWas premed, but realized I am way more interested in different aspects of business. Currently looking/working towards a career in project management. Potentially considering working up to a C-suite type position or starting up my own company.\n\nEducation:\nDegree: BS Biology, Conc. Neurobiology\nGPA: 3.72\n\nWork experience:\nPeer Educational Instructor (Bio/Genetics)\nMedical Scribe (ER)\n\nExtracurricular:\nPresident\nSecretary\nVolunteer Coordinator\nWebmaster\n(All positions in an org of 13 officers and membership of 80-110 active members)\n300+ Volunteer Hours\n\nPlan:\n1. Currently Executive Director of a dying student-run nonprofit which basically raises money to support families battling pediatric cancer, AVGs ~30k annually\n2. At the same time, plan on doing a 1 year masters: MS-MOT, master of science in management of technology which is basically project management with technology\n3. Also at the same time, have an almost guaranteed 6mo senior data internship at a charitable foundation where my bosses would let me shadow basically any department I want\n4. Get my CAPM certification after the 1 year masters\n5. Work as a PM for 3 years while getting hours to take the PMP exam\n6. Get PMP certification\n7. Continue working until hitting a wall\n8. Take GMAT and apply to a T20 MBA program (Prob in late 20s to early 30s)\n9. Not quite sure what options to take after MBA, there are many paths to take\n\nConsiderations:\n1. I am willing to move/travel for opportunities\n2. When working, I will be looking to leverage  my results/experience every 6-12 months for increasing responsibility/opportunities\n3. While increasing my skills/experience in numerous departments, I may look to start my own company given that I think of a business idea along the way or maybe after the MBA\n4. All my academic accomplishments were accumulated without much effort since I didn't truly have my heart in it. Was very capable of having a 3.9+ GPA. I spent WAY more of my time with student organizations than on academics\n5. Started learning Mandarin Chinese because I've heard knowing a second language can put you a step up with any global business and China will be the biggest economy\n\nDoes this plan make sense?\nI am open to all feedback and suggestions. Thank you if you have read up to this point!",
    "title": "Pre-Med to Business, does my current career plan make sense and is there anything I should consider that I haven't already considered?",
    "subreddit": "careerguidance",
    "timestamp": 1560642808,
    "score": 1,
    "keyword": "chinese director"
  },
  {
    "text": "Chinese-American director Wayne Wang talks about his latest film focusing on Korean-American family",
    "title": "Chinese-American director Wayne Wang talks about his latest film focusing on Korean-American family",
    "subreddit": "asianamerican",
    "timestamp": 1571054874,
    "score": 27,
    "keyword": "chinese director"
  },
  {
    "text": "Rutgers Releases Comprehensive Report on How Cultural Factors Affect Chinese Americans' Health *Rutgers researchers publish 17 studies on elder abuse, cognitive function, psychological well-being, social relationships, and health behaviors among more than 3,000 Chinese Americans aged 60 and older*\n\nSince 2011, the Population Study of Chinese Elderly in Chicago (PINE), the most extensive epidemiological cohort study of Chinese older adults in the United States, has revealed critical health disparities among the growing Chinese American population. \n\nIn the current issue of the *Journal of the American Geriatrics Society(JAGS)*,[17 new research papers](https://onlinelibrary.wiley.com/toc/15325415/2019/67/S3)from the PINE Study present an unprecedented exploration of cultural factors concerning Chinese Americans' health. The papers also draw data from the Filial Piety Study, a study of the PINE Study participants' adult children. The resulting research provides comprehensive, multigenerational insight into the lives of Chinese Americans.\n\n\"Despite the size and substantial growth of the Chinese American community, quality health data on this vulnerable population remains critically inadequate,\" said [XinQi Dong](http://ihhcpar.rutgers.edu/faculty_staff/xinqi-dong-md-mph/), director of [Rutgers University's Institute for Health, Health Care Policy and Aging Research](http://ihhcpar.rutgers.edu/)and the lead researcher of the PINE and PIETY studies. \"This collection of *JAGS*articles helps provide the context and understanding necessary to improve the health of Asian populations through education, research, advocacy, policy, and sustainable community engagement and promote greater health equity among all minority groups.\"  \n\nFor the PINE Study, researchers looked at more than 3,000 Chinese Americans aged 60 and older to better understand their current experiences, offer solutions for improving the research participation of minority older adults, and reduce health disparities. \n\nThe Filial Piety Study assessed the health and well-being of 548 PINE Study participants' adult children aged 21 and older. The study revealed widespread psychological and social stressors associated with the growing problems of caregiving distress and burden and intergenerational conflict among the Chinese American adult community.\n\n\"While preliminary research indicates marked disparities concerning Chinese Americans' health and well-being, numerous factors prevent quality research from being conducted and disseminated,” said Dong. Barriers to research include a reluctance by Chinese Americans to participate in federally-sponsored activities, linguistic and cultural barriers, a lack of federal funding, and the tendency of federal-level health researchers to aggregate data of diverse Asian groups under the same racial category. \n\nResearchers must also contend with the \"model minority\" myth – the perception that U.S. Asians are generally economically prosperous and healthy, and enjoy active social and familial relationships.\n\nThe articles — organized into the themes of data collection methods, elder abuse, cognitive function, psychological well-being, social relationships, and health behaviors — navigate the many challenges to studying this vulnerable population and address the insufficiency of health and wellness data.\n\nThe first article discusses methods of data collection, detailing how researchers used a custom web application to conduct in-person, native-language surveys of participants. The application not only helped overcome some of the barriers in health disparity research but also improved participation and retention.\n\nFour articles addressing elder abuse examine the risk factors and consequences of violence across the life course. The articles explain the link between elder abuse — psychological abuse, physical abuse, caregiver neglect, and financial exploitation — and\n\npoor physical and mental health, chronic pain, greater use of healthcare services, and increased risk of mortality among older Chinese Americans. \n\nFour articles that investigate cognitive function in the context of immigration, psychological distress, social engagement, and oral health are the first of their kind in the U.S. Chinese population. The articles emphasize the need for further study of this population’s cognitive function later in life.\n\nThree articles explore how the psychological well-being of Chinese older adults relates to physical health over time. The researchers establish a link between depressive symptoms and comorbid health conditions and demonstrate the need for emphasized screening for depression risk factors and the development of intervention strategies to proactively prevent the onset of disability.\n\nThree articles address older Chinese immigrants' social relationships, exploring the impact of family relationships on health and wellness, filial obligations and caregiving burdens, and social engagement. \n\nTwo articles analyze patterns of health behaviors among Chinese older adults to understand potential predictors and consequences of specific health behaviors.\n\n**Key findings**:\n\n* Abuse is prevalent in the Chinese American community, with 11.4% of study respondents reporting child abuse, 6.5% reporting intimate partner violence, and 15.2% reporting elder abuse.\n* Individuals with a history of child abuse were four times likelier to experience intimate partner violence and psychological elder abuse. \n* A history of psychological, intimate partner violence correlates with eight times the risk of re-experiencing psychological abuse as older adults.\n* Intimate partner violence was associated with five to eight times the risk for psychological elder abuse, six to nine times the risk for physical/sexual abuse, and three times the risk for financial exploitation.\n* Individuals with a history of childhood physical/sexual abuse experienced two times the risk of re-experiencing physical/sexual intimate partner violence. Those with a history of physical/sexual intimate partner violence faced nine times higher risks of re-experiencing physical/sexual elder abuse.\n* All subtypes of elder abuse were associated with a substantially increased risk of 1-, 3-, and 4-year mortality.  \n* 41.5% of Asian Americans reported not receiving annual oral health examinations, which links to decreased quality of life, depression, hypertension, poor cognition, and cognitive decline.\n* Approximately 50% and 54% of U.S. Chinese older adults experience various levels of functional disability and depressive symptoms, respectively.\n* Comorbid depression is associated with a six-fold higher likelihood of functional disability, a 70% increase in overall medical costs, and a 2.4-fold increase in mortality than those without depression.\n* More than 84% of Chinese American study participants had one or more chronic medical conditions, and more than 60% had two or more.\n* 25% of older Chinese men are current smokers compared with only 8.8% among the general US population aged 65 and older.\n\n\"A growth rate almost four times higher than that of the overall U.S. older adult population necessitates a thorough understanding of older Chinese Americans' health needs,\" said Dong. This research will help promote healthy aging adequately, prevent health disparities, and inform the development of culturally sensitive healthcare.\"\n\n**About Rutgers Institute for Health, Health Care Policy and Aging Research**  \n[Rutgers Institute for Health, Health Care Policy and Aging Research](http://ihhcpar.rutgers.edu/)advances health and well-being through meaningful, rigorous and impactful research in the critical areas of behavioral health, health services, health disparities, health policy, health economics, pharmacoepidemiology, and aging research. \n\nSince its 1985 founding, the Institute has become nationally renowned for interdisciplinary and translational research. The Institute's 57,000 square foot facilities are home to six members elected to the National Academy of Medicine and 150 members representing over 30 schools, institutes, and units with adjunct members from 29 national and international universities.",
    "title": "Rutgers Releases Comprehensive Report on How Cultural Factors Affect Chinese Americans' Health",
    "subreddit": "asianamerican",
    "timestamp": 1565624304,
    "score": 1,
    "keyword": "chinese director"
  },
  {
    "text": "At the workplace, are Asians only comfortable around other Asians? Just curious. Reason why I ask was because I recently started a new job at a marketing firm and there were several other new employees who started on the same day. One of them happened to be a young Asian female who looked around my age (mid 20's) and pretty much all of the employees in our office are white with a small mix of blacks. On my first and second day, I made the efforts of trying to introduce myself to those who sat around me (although my director already introduced me to some of them) excluding the entire section of people sat 2-3 rows ahead of where I sit.\n\nThe Asian sat at the 3rd row ahead and on Friday, she came all the way to my desk and asked if I was Chinese (I'm Korean btw), saying that 'I am new here too', 'did you grow up here?' blah blah and saying how she was happy to see another 'Asian' in the office (I felt that was weird) can you imagine another race, like a black employee for example, going up to another new face employee who is also black and saying, \"it's good to see another black brother/sister here in the office?\" it's just weird and not right.\n\nI got an automatic assumption that this Asian female employee only feels comfortable around other Asians, she hardly interacts with the employees who sit around here since I can tell from a distance and was quite surprised how she came up all the way up to me out of nowhere and started to introduce herself with a bunch of questions like that. I don't know, is it just an 'Asian' thing? Am I overreacting to this situation or what?",
    "title": "At the workplace, are Asians only comfortable around other Asians?",
    "subreddit": "asianamerican",
    "timestamp": 1556504996,
    "score": 0,
    "keyword": "chinese director"
  }
]