[
  {
    "text": "So need I help writing a 2 week notice that doesn't scream fuck you but still implies they are at fault. TLDR: boss has been short staffing us and hiding a positive covid test of another manager is the last straw.   \n\n\nSo I work a second job at a pretty big book store. Since covid we have been short staffed but it was manageable.  However, recently it was getting to the point all of us that had a full time job as well were expected to pick up almost 30 hrs. extra instead of our standard 18-20. We were lucky if we had 2 days off a week and never a weekend that would be crazy. So they promised us they would hire new people \"soon\". After a month of this promise people started quitting, they were rightfully getting burned out. It's also important to note our main manager does not fully believe in covid. While workers and customers are required to wear masks by corporate he regularly wears his down on his chin and makes it clear he thinks its a Chinese ploy.  He is an anything for money slimy used cars sales man through and through. Me and one other were sticking it through until the new people arrived. However, we have received numerous calls asking where peoples applications are and how they applied weeks ago with no response. So now were pissed that he's ignoring potential hires at this point there is only four of us floor workers. This still isn't the kicker to the gut. We found out yesterday by overhearing in the offices that one of the managers tested positive for covid and has had symptoms for awhile. He last worked Saturday along with all 4 of us. The main manager was talking about how it might be a false and he wasn't worried about it. It was clear how he was talking he wasn't going to tell us workers, so I told the rest. Now I know HIPPA says you can't say who is sick, but they have to tell us if someone tested positive. When a coworker asked the manager straight up, the response was that he couldn't say and that it was up to us to make a decision about our safety but that if anyone asked our sick manager was just a little under the weather. At this point I rushed for a test which thankfully came back negative but the blatant lack of care about how safety was just to much.   \n\n\nSo I want to make sure that those points of safety and working conditions are in the notice that I will forward to HR in case he tries to say he didn't get it or the last day was different. But I know how I write and I will either gloss it over with a standard notice or end up putting to much emotion into it.   \n\n\nAny help would be greatly appreciated.",
    "title": "So need I help writing a 2 week notice that doesn't scream fuck you but still implies they are at fault.",
    "subreddit": "jobs",
    "timestamp": 1612792121,
    "score": 3,
    "keyword": "chinese manager"
  },
  {
    "text": "A colleague-turned supervisor is retaliating and smearing me because I applied to the same promotion. I  am a math and computer science teacher at a small private school.  We  have grades 7-12 and about 120 students.  I've been working here since the Fall of 2018.\n\nI've been active in my department.  I've done a lot of things, successfully, putting in  extra hours at the request of the old and new owners.  I directed the  re-furbishing of our previously unused wet labs, created an AP Calculus  pilot program (all of our students passed despite it not being an  official AP class), created a competitive Math team which has met with success locally, participated in  recruitment drives to get new students, and even sat in on interview panels.  I have had consistently good  reviews from my students and I'm on decent terms with the President of  the Parent-Teacher Association (whose daughter said that I am her  favorite teacher).\n\nThis year, our school came under new management.  Their goal is to re-organize and expand the school.  They want to focus only on high school (9th to 12th only), and expand the enrollment.  Our school is built for about 300 students, but we currently only enroll 120.  One of the things they're doing to prepare for expansion is to hire department leads, as new teachers will have to be hired.  Currently, they only proposed three team leads: STEM, Humanities, and ESL/Foreign Languages, as or school is pretty small.\n\nI  decided to apply for the STEM department lead job.  In theory, it was open to all comers, and I figured I had nothing to lose.  I had done a lot of additional work and gotten excellent reviews from the old managers.  I was also in the process of obtaining alternative certification.\n\nInitially, the departments were allowed to choose their own leads, and initially I had been chosen by ballot.  Two weeks later, the head of HR  sent out an e-mail saying that I would not be promoted, and instead another teacher - let's call her Alice - would be.  I requested a private meeting with the head of  HR (part of the new management) to discuss why.  They claimed there was nothing against me, and that she was promoted because she worked there longer than I did.  That didn't make any sense, since new management fast-tracked one of their own into the Foreign Language lead position.  They also mentioned something about how they believed that I would not be able to execute my position \"fairly\".\n\nLater, I found through investigation of my own that she ran a Twitter campaign to get her friends and family to call in so that she could get the promotion.  She smeared me and the other people in the department as \"participating in anti-blackness and exism\"  (she's Black and Filipina, while I'm a man of Latino/Chinese ancestry).  Me simply because I accepted the promotion, and others for voting for me.  She even asked her friends if they could make fake screenshots of me saying racist things.  I then went to HR with the evidence in hand.  HR told me that they didn't receive any phone calls, and furthermore said that they could do nothing about the tweets because they were made off the clock.  They said they were going with Alice as department lead and that decision was final.\n\nAnyhow, since she got the position, Alice has been very  hostile to me.  She seems to be building a case to let me go at the end of  the year.  For instance, she has been conducting reviews of my classes  and has given me unreasonably low scores (straight 0's or 1's out of 10).  Under previous management, I have never gotten a review averaging less than a 7.  She also changed my teaching load so I'm no longer  teaching Calculus, but I'm teaching 7th grade math (a class which will be eliminated next year, thus making my job redundant).  She's asked me to prepare presentations only to not let me give them in meetings, as well as filed bogus complaints with HR.\n\nShould I start looking for a new job, or should I try to fight this and get my position back?",
    "title": "A colleague-turned supervisor is retaliating and smearing me because I applied to the same promotion.",
    "subreddit": "jobs",
    "timestamp": 1610267562,
    "score": 3,
    "keyword": "chinese manager"
  },
  {
    "text": "Struggling with language barrier, can't connect with team and manager. Keep going or leave? I've (24M) been at my current company for 2.5 months doing marketing for a clean energy company. This is my first time doing marketing but I like my job and absolutely love the company. I studied Marine Biology in uni but not a huge market for it here in Hong Kong.\n\nMy team and manager speaks Chinese and I'm struggling to communicate with them. It's really affecting me, my confidence, and I feel really lonely at work when they're talking amongst themselves, joking around. I've spoken about this with my manager and he's very understanding but also tells me I have to know the language in my position.\n\nI could totally spend time learning it, I know I have the ability...but you only get so much time in a day. I'd rather spend that time learning marketing.\n\nI've also been heavily considering leaving and continuing to learn coding (I was doing a lot of freelance web dev work). I know I have the ability to do this if I devoted 100% of my time to it. If I were to learn any language it'd be code over Chinese, way more scalable and pay is way higher.\n\nWhat would you do if you were in my position? In your experience, if you don't vibe at all with your team and manager, does/can it get better in time?\n\nThanks a lot for your time, any advice is greatly appreciated!",
    "title": "Struggling with language barrier, can't connect with team and manager. Keep going or leave?",
    "subreddit": "jobs",
    "timestamp": 1627181550,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "How can I stop getting rejected by hiring managers?  \n\nOk so what can I do? I pass phone screen with recruiters but hiring managers always reject me. I do not know what I am doing wrong. I dress well and thank them for their time. I am applying for the correct positions and meet requirements. I talk about my passions for learning and helping folks. I always bring past examples to support my answers. I am just so exhausted and sad that I am getting no offers. My friends said it mostly because I am a an ugly Chinese male. They aren't right are they?",
    "title": "How can I stop getting rejected by hiring managers?",
    "subreddit": "jobs",
    "timestamp": 1639063702,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Got a job offer. Company has a lot of red flags. I got a job offer for a startup company. Initially thought the company was a good company to work for, then I read the Glassdoor reviews and started to get bad vibes about it. Went through the job interview process anyway just in case none of my other leads work out. Got the job offer a couple of days ago with a very attractive compensation package, BUT I'm extremely worried about the company and the toxicity that previous employees claim it to be. \n\n* 2 .5star review on Glassdoor, virtually every employee telling me to RUN \n* Founder is Chinese and about 90% of employees are Chinese - very little diversity (though this seems to be changing); reviews claiming that the culture is very much like old Chinese warehouse labor \n* Employees seem to be overworked with very little work/life balance almost all reviews are past employees claiming the culture sucks, CEO sucks, leadership sucks \n* One interviewer I spoke with literally answered his phone TWICE during the interview \n\nThe only positive things for me right now is the fact that my manager seems tolerable and the pay good but overall I have a feeling that I'll be pretty miserable working for this company but at the same time I do not want to say no to an offer knowing I've been unemployed for months now. \n\nSeriously considering saying yes to the offer and taking it while I look for a better job. OR, saying no to the offer and continuing my job search - I'm currently interviewing with companies that I actually like (i.e. Uber, Amazon). \n\nAny thoughts/advice?",
    "title": "Got a job offer. Company has a lot of red flags.",
    "subreddit": "jobs",
    "timestamp": 1630734523,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "I work at a sushi restaurant with a seriously temperamental boss. Considering moving on though I want to stay because of pay I work at a sushi restaurant with a seriously temperamental boss. Considering quitting\n\nI work at a sushi restaurant in a small town, and despite that we are relatively busy. There are only five of us working there as hostesses and waitresses and a lot of us will do both jobs in one shift with two of us working at once. \n\nMy two bosses are Chinese and are brothers. They have owned the restaurant for a little over two years now and have got in fights so often they no longer talk. The one brother is great at english and decent with people (a little to a lot pushy sometimes) but the other brother, the main sushi chef, does not speak English well at all and has the worst temper ever, always fighting with the one cook we have. I have worked there for six months now and have become easily the best employee, partially because I am tied for the oldest (24) but also because I have had restaurant experience before and just in general put in a lot of work cleaning everything and doing extra tasks, I don’t really know why, it’s just part of my personality to do some thing that I see needing to be done. \n\nThe sushi chef has no problem screaming at young girl employees in Chinese. He does know a few phrases like “why are you so stupid” and “if you do that again you’re fired”. He screamed at this high school girl who was an assistant sushi chef (smart as a whip and the best assistant sushi chef we have) and she ended up quitting. Two months later the sushi chef told his brother to contact this girl and get her back. He just can’t control his temper that much. \n\nSo I’ve been there for 6 months, and he has steered clear of me for whatever reason, though recently (within the past few weeks) he has been screaming at me for the smallest and stupidest things. It’s not directly to me, it’s to his brother which is humiliating, and he will use English phrases every now and then and sometimes these screaming sessions go on for a half hour or more. It’s amazing to me how much anger this guy can carry around in order to do that. It makes me feel like garbage at the end of the shift. It also makes me feel like garbage when the manager, who does a decent job of being on my side, comes up to me and tells me to try not to mess up because he gets screamed at. (None of these were even mistakes, like needing to be more specific in the comments of an order etc. Totally crazy for any chef to have an issue with to that extent.)\n\nGoing along and still working, I just think that he is in a mad mood and is doing it to everyone. Today I find out that after I go home, this other server was given a free $17 roll. And I guess it happens all the time for her. She said she’s sick of sushi from all the free sushi she gets. Her cousin also works there and they get a ton apparently, and I knew this also from coming in once when I wasn’t working and seeing a plate of four expensive rolls and them telling me that the chef just brought it over.  To understand how much of a big deal this is, it’s hard to explain without seeing it in action but they will lose their minds over any ounce of waste. He once yelled at a girl for doodling on tickets and using too many napkins, and he tells us not to use that much ice to save a few cents. \n\nThis is ridiculous to me because these two girls make equal mistakes as me if not more, they sit on their phones all the time and don’t clean, and one girl has a bad habit of calling in all the time.  I have no idea why he is so harsh to me and has given them countless free things. And I guess he tells them all the time Good Job and this man has never once talked to me. \n\nI feel so fed up with this and am wondering if anyone has had similar experiences and how they have dealt with them. I am debating whether or not I want to talk to the manager brother, who is very understanding most of the time, but I don’t want it to seem like it’s about the free rolls when really it’s about how I don’t want to deal with his anger anymore, and I’ve not worked at a single place out of many places that I have worked at where bosses will be so ruthless over a small mistake and so obviously and favorite certain employees. \n\nAlso I am wondering if I’m just being a baby, and if this is not even an issue at all. It’s possible that I’m making things out to be worse than they are",
    "title": "I work at a sushi restaurant with a seriously temperamental boss. Considering moving on though I want to stay because of pay",
    "subreddit": "jobs",
    "timestamp": 1610855388,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "It's been 1.5 weeks since the last interview, hr or hiring manager on the status? Hi everyone, thanks for reading this.\nI completed final round of the interviews 1.5 weeks ago. Altogether I had six rounds, the hiring manager was at the third round.overall I had a good feeling about this. During the interview with the hiring manager he ended off by giving me his work email address, told me email him if I've any questions. \n\nBefore I started the fourth interview, hr called me( about 2 weeks ago) to congratulate on my progress and if It all goes well they will make an offer by 3 march. \n\nHowever I would like to know the answer by this week becausemy lease for the apartment is ending on 21st march and the agent is asking if I want to renew it.\nThe pickle is this job is based overseas, so I need  time to clear the furniture, sell my car. What if I renew it for six months and next week hr said they will offer me a job. I don't think they will wait six months as I told them that my notice period is 6 weeks.\nI emailed the hiring manager last week to thank him and wished him a good chinese new year (he's in hong kong), I didn't expect him to reply and apologise for the having so many interviews near the festive season (I suppose he assumed I'm celebrating chinese new year too).\n\nSo should I email hr or hiring manager to tell them about my situation? I'm afraid of jeopardizing my chances. Please help",
    "title": "It's been 1.5 weeks since the last interview, hr or hiring manager on the status?",
    "subreddit": "jobs",
    "timestamp": 1614001014,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Don’t know what direction I should go in So I am just lost in general deciding what my skills can be used for what and what search terms I should use for job searching (looking for full time work)\n\nI am fluent in Mandarin Chinese (I have a BA degree in Chinese) as well as having worked as a event planner for 2.5 yrs at my university (1.5 of them being the leader). I also have experience in digital marketing for a tech company (a full time 4.5 month internship in China). \n\nI have tried looking up project coordinator/management positions, but a lot of them require more professional experience or certain program knowledge like Asana. \n\nFor Chinese, I know there is translation/interpretation, but I wouldn’t want to do just a straight up interpreting thing (best thing would be a mixture of something and interpretation/translation). I have seen some suggestions being like a business liaison, but I’m pretty much starting from scratch. \n\nAny job titles that are recommended based off the skills I have? Or if there is any recruiters or company recommendations (currently looking for employment in Portland, Oregon) I would like to get into maybe the technology/electronics/gaming industry since I’m passionate about video games and cool gadgets. Thanks in advance.",
    "title": "Don’t know what direction I should go in",
    "subreddit": "jobs",
    "timestamp": 1623746222,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Moving back to the US. My spouse is an interpreter. I am an educator, looking to career change. We need help considering where to move to balance cost of living with job availability. Please be constructive in your advice! I'm 32 now, and my spouse is 26. I've been in China for several years. We intended to move last year, but due to Covid, everything is on hold and we are probably going to move next year. My spouse is about to complete her degree in interpretation and translation between Mandarin and English. I have been a teacher for the last few years, but I'm not directly seeking to continue this career and I am particularly interested in working for non-profit organizations or to assist immigrants or recent arrivals to the US. I also am interested in management, as my experience here includes management and training. Some people transition into selling securities, which also interests me, and I'm willing to study for and take any FINRA exam if I know it's a solid choice. I would really like constructive advice on how to go about a career change. As for my spouse, she's Chinese, so I think work for her requiring clearance is out of the question.  \n\n\nIn terms of moving back home, one of the places I've identified as possibly ideal for both of us is Philadelphia. The cost of living is higher than here, but homes in the suburbs are still affordable compared to lots of other places, with houses under 300k. Philadelphia's crime level makes me nervous, but it's a big city with more jobs. What other places can I consider?",
    "title": "Moving back to the US. My spouse is an interpreter. I am an educator, looking to career change. We need help considering where to move to balance cost of living with job availability. Please be constructive in your advice!",
    "subreddit": "jobs",
    "timestamp": 1615950051,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "My Fiancé's brother is a gross manchild Posting here because I really need to vent or I'm going to go crazy!\n\nI've been with my fiancé for 5 1/2 years but we've never spent that much time with her family until this year. Last year during covid her mum was diagnosed with incurable cancer so this year we've been visiting for 1-2 weeks every other month.\n\nI've always known her brother is a manchild and been irritated by him, but recently it's gone to a whole other level.\n\nHe's 32 years old and has always lived at home with his parents. Previously he had a long distance relationship with a woman in Cambodia that seemed to mostly involve him sending vast amounts of money to her. (My fiancé raised the fact this was a massive scam but was told she was \"heartless\" by her mum and dad). When that ended a few years ago (turned out she had a lot of western \"boyfriends\" kinda fair play to her in a way) we hoped he would finally get his shit together and move out.\n\nThat clearly hasn't happened. His parents do pretty much everything for him. I mean EVERYTHING. Bear in mind his dad is 61 and a full time carer for his dying mum. They cook all his meals, they do his laundry (and collect it from the floor of his room), they change his bedsheets, they wash his dishes, they clean the whole house including his (disgusting)bedroom. \n\nBrief rant about the bedroom. I've never been inside but he leaves the door open and you can see his clothes strewn across the floor, white stains on his desk chair and tissues all around. It makes me want to vomit thinking about it.\n\nHe also walks around the house in dirty clothes that don't fit him which means we all have to see his hairy fat belly hanging out. (No fat shaming, I am overweight and working on it. The issue is the lack of social awareness around clothes and hygiene). Despite this he brags about burning thousands of calories at the gym (sure) and is always eating protein bars or shakes.\n\nThe one thing he does is occasionally cook them a fried breakfast on weekends, which of course his mum is expected to clean up. Whenever he does the slightest thing for them he is expected to be heaped with praise.\n\nHe has worked full time in a professional good paying job for years, but what does he offer to his family? About £400 a month. That's for food, lodging and no housework required. To put that into perspective that's less than half just the rent my fiancé and I pay, forget bills and food. \n\nSo what does he do with all that money? Well instead of saving to move out (he literally could have bought a house by now) he spends it all on his car, video games and stupid \"projects\" that never come to anything (like an expensive microphone and video camera for his short lived YouTube channel). \n\nWhen we come back we work really hard to cook, clean and wash to make sure her mum can have a break (her dad can't cook) and to overall support them. We also pay for the shopping and help to pay for some meals out (normally over 50% plus tip). This includes (to my regret) having to cook for her brother who has not once offered to clear the table or help with the dishes.\n\nThis would all be somewhat tolerable if he was actually a half decent human being. But he's also a careless, misogynistic PoS.\n\nWhenever there is something he doesn't like or doesn't want to hear, regardless of how small it is, he will get angry, shout, sulk and slam doors. My fiancé has told me that her mum has said she is frightened of him.\n\nHe is also a massive misogynist. He refers to a female colleague as \"the Rottweiler\" because she has red hair is allegedly ugly (whatever the hell that even means) and \"talks too much\". When discussing my fiancé's relationship with me he compared it to their aunt and grandmother because \"whenever two women get together there is always trouble\" despite the fact my fiancé and I were perfectly happy and relaxed. He also made a joke that \"the Chinese symbol for conflict is two women under one roof\" which i challenged as untrue, sexist and racist. He said \"It is true, I know a lot about this stuff actually\" (it definitely isn't true but w/e). \n\nIn the past (thank gods not around me) he used to threatened to kill, strangle and beat my fiancé. Call her a bitch, \"a little slut\" (for going on a date) and a whore. His go to insults always seem to be gendered.\n\nWhenever challenged or questioned about his behaviour he says he can't help it and we shouldn't judge him because of his aspergers. (Aspergers isn't even a recognised diagnosis here, it's just called ASD but he insists on calling it aspergers as he claims to be \"high functioning\" and to have special \"advantages\" about his intelligence). This is just clearly untrue. \n\nFor one I work with and have worked with people with ASD. They might seem a bit odd sometimes, be a bit blunt or see things in a different way but they are fully capable of being functioning adults who manage their own lives. They can be polite at work, good at their jobs and supportive to their families. \n\nApparently his mum and dad have bought into this as whenever I or my fiancé mentions anything to her dad he says he can't help it.\n\nWhat makes this worse is the family put massive pressure on my fiancé to always be kind, emotionally forgiving and practically supportive. They expect her to do care giving tasks,  they also criticize her for having an \"attitude\" if she ever disagrees or is unhappy with her father. (Her dad is a whole other story).\n\nIt just makes me miserable to have to put up with this manchild when my fiancé and I are spending a lot of time, effort and money to travel and support her family. Plus we see him splurging cash on his boy toys when we are struggling by to get enough money for our wedding (we only want a small ceremony of like 20 people and no formal reception service, but even that is a lot of money to us).\n\nI don't get it at all. The double standard between how their expect her to act and what he gets away with is galling. Especially when her parents seem to love and appreciate him more than they do her, despite her bending over backwards for them.\n\nI honestly wish I never had to come here, but I know it's so important to my fiancé and I will always support her 100%.\n\nAnyway... rant over!\n\nFeel free to share your experiences of idiot brothers or brothers in law.\n\nMuch love xxxx\n\n\nEdit: In case it wasn't clear we are both women.",
    "title": "My Fiancé's brother is a gross manchild",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1628239017,
    "score": 111,
    "keyword": "chinese manager"
  },
  {
    "text": "Feeling bad - how to alert other women of creeps in public spaces Yesterday, I was at a local favorite Chinese restaurant when I saw an adult man videotaping a group of four teenage girls seated near him. We were sitting behind him and my fiancé saw the man quickly tape them on his phone before checking to see if anyone witnessed him doing this. For some context, he was easily in his late forties and the girls were high school age and didn’t seem to notice. \n\nI wasn’t sure what to do - I felt really scared to cause a scene and make it worse for the girls so I alerted the general manager to the situation. I realize now I may have been too timid. We’re quite friendly with the manager as frequent patrons and she went to watch over the table. My fiancé also glared at the man before we left. We were hoping to scare him into leaving them alone. \n\nWhat are some good ways to react to creeps in restaurants or who seem to be subtly trying to film women? Should I have alerted the girls directly? I feel terrible now that I let my fear dictate behavior and want to do my part to improve and help women in public spaces.",
    "title": "Feeling bad - how to alert other women of creeps in public spaces",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1638723231,
    "score": 10,
    "keyword": "chinese manager"
  },
  {
    "text": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender This happened about a year ago, but due to recent events in \"the bible belt\", I remembered it and thought it was worth sharing.\n\nSo I was working for a consultancy company which was doing work all over the place. I didn't have a project for a while so the pressure was on to get me to a client, no matter what or where. One day we get an email from sales that a position had opened up in a place that I never heard of. It turned out to be a small/medium-sized village in bumfuck nowhere with an industrial park that housed a couple of big companies for that region.\n\ninitially, my manager (Chinese) always sends a couple of internal resumes with one or two obvious good matches. She didn't get any replies, followed by the sales rep saying \"this is the bible belt, unfortunately, they are not as progressive as our company. They said they wanted to handle communications with me instead\". That should have been a red flag from the start but since this was an international partner the company didn't care (which was a red flag for me to get out eventually).\n\nThen they asked if they could interview a top 3, where I wasn't part of. My manager pushed for me to be included because all 3 were male. Me and another female colleague, with way more experience, were skipped.\n\nWe start the call and almost immediately we get \"What are Sara(not my real name), Wendy(manager) and Jenny doing in this call!?\" and \"listen, you have to understand that...here in bumfuck nowhere we don't work alongside women. It will impact our working environment\". It was obvious the guy wanted to say that he didn't want to work with women. I stepped in and hijacked the whole thing and start asking them questions about the project, what skills they need, etc to get the conversation back on track. At the end of the call, Jenny almost quit on the spot for not being defended by the sales rep.\n\nThe client was happy with the call and invited me to do an in-person interview (according to the sales rep, which I didn't believe for a second). So I travel to bumfuck nowhere and I feel like I'm traveling to a different country where it would be wise to carry a pocket knife or something.\n\nIt was cold that day so I were a sweater (keep that in mind). I enter the office building, meet the guy we spoke to, he gets another colleague to do the interview with and we enter a meeting room. 30 minutes since I entered the building and I realize I didn't give my name and I start to get very scared. I tell them of my experience and my team. I also sneak in some things about my manager and Jenny and the guy goes \"yeah what is Wendy anyway? Chinese? Japanese? I can't tell those people apart. And Jenny? Why the hell is that young woman working? I don't understand women from where you come from\". I try to play it off that men and women should have equal opportunities in life and he replies \"it's not right, women shouldn't work at that age. They should stay at home and take care of their partner\" and I think to myself \"HOLY SHIT I REALLY AM IN BUMFUCK NOWHERE! IS THIS STILL THE SAME COUNTRY I LIVE IN!?\"\n\nSo then they start glancing over the printed resumes and see that I am actually Sara and it gets super quiet while I'm already thinking about how many people I have to walk past and how many doors are between me and the fresh air. Then the other says \"hmm...so you're one of those transvestite people, are you?\". And I say \"well it's called transgender actually and yes\". What followed was a bombardment of slurs and nasty comments like \"God doesn't approve of that kind of lifestyle, you're a sinner\" to a point where I disconnected myself from reality until it was over. At some point, I came back to reality and said \"well it's obviously not going to work out but thanks for inviting me\". I tried to shake his hand but he gave me the meanest look I've ever seen. When I walked out a group of people went quiet and started laughing when they realized.\n\nI walked out, shaking, and had to sit on a bench for a couple of minutes. It was like all the work I put in my self-esteem and confidence over the years was instantly worthless. Every time someone walked past me I felt scared and judged. I took the first train back and stopped at a train station where I was 100% sure to be comfortable and had some fast food for lunch to comfort myself. I felt so betrayed by my employer that my trust in them never recovered and I eventually left the company.\n\nThe only thing that kept me going was the thought that the world is a big place and that there are many places other than bumfuck nowhere to live my life.\n\nedit: grammar fixes",
    "title": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615114235,
    "score": 0,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #66: SARS-CoV-2/COVID-19 discussion. 12/52021 COVID-19 Megathread #66\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators [by modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\n On December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, at least 652,000 people have lost their lives in a confirmed case of COVID-19 since December 2019. The true number is suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc.) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a rough consensus for critical supportive care has gradually coalesced. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\nThe newest battleground in this seemingly never-ending fight is convincing a skeptical public that vaccination is the only way to make progress towards returning to life as we all knew it before this situation began eighteen months ago. Misinformation is rife within the realm of popular social networks, including reddit. Vaccination rate has stalled across most of the globe after those most motivated to receive it have finally been inoculated. As of this posting, across the globe the current fear is of a new wave of omicron variant cases even as delta variant never fully died down.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n* [Nextstrain](https://nextstrain.org/ncov)\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organizational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n* [Promed](https://promedmail.org/coronavirus/)\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n* [SCCM](https://www.sccm.org/covid19)\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n* [ICU Net](https://covid19-icu.net/)\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals—no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on [r/medicine](https://www.reddit.com/r/medicine/) at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualize their comments.",
    "title": "Megathread #66: SARS-CoV-2/COVID-19 discussion. 12/52021",
    "subreddit": "medicine",
    "timestamp": 1640207450,
    "score": 88,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #63: SARS-CoV-2/COVID-19. Week of 7/26, 2021 # COVID-19 Megathread 63\n\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators by [modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, at least 652,000 people have lost their lives in a confirmed case of COVID-19 since December 2019. The true number is suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n\n* [Nextstrain](https://nextstrain.org/ncov)\n\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organisational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [Promed](https://promedmail.org/coronavirus/)\n\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n\n* [SCCM](https://www.sccm.org/covid19)\n\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n\n* [ICU Net](https://covid19-icu.net/)\n\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals -- no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on r/medicine at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualise their comments.",
    "title": "Megathread #63: SARS-CoV-2/COVID-19. Week of 7/26, 2021",
    "subreddit": "medicine",
    "timestamp": 1627328914,
    "score": 77,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #57: SARS-CoV-2/COVID-19. Month of January 2021. COVID-19 Megathread #56\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators [by modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, an estimated 63 million people have been infected and some 1.5 million people have lost their lives in a confirmed case of COVID-19 since December 2019. The true numbers are suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\nAs of December, several vaccines across the world have received emergency use authorization, and vaccination has begun.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n* [Nextstrain](https://nextstrain.org/ncov)\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organizational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n* [Promed](https://promedmail.org/coronavirus/)\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n* [SCCM](https://www.sccm.org/covid19)\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n* [ICU Net](https://covid19-icu.net/)\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals—no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on [r/medicine](https://www.reddit.com/r/medicine/) at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualize their comments.",
    "title": "Megathread #57: SARS-CoV-2/COVID-19. Month of January 2021.",
    "subreddit": "medicine",
    "timestamp": 1609739750,
    "score": 50,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #64: SARS-CoV-2/COVID-19 discussion. Week of 8/17, 2021 # COVID-19 Megathread 64\n\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators by [modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, at least 652,000 people have lost their lives in a confirmed case of COVID-19 since December 2019. The true number is suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n\n* [Nextstrain](https://nextstrain.org/ncov)\n\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organisational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [Promed](https://promedmail.org/coronavirus/)\n\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n\n* [SCCM](https://www.sccm.org/covid19)\n\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n\n* [ICU Net](https://covid19-icu.net/)\n\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals -- no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on r/medicine at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualise their comments.",
    "title": "Megathread #64: SARS-CoV-2/COVID-19 discussion. Week of 8/17, 2021",
    "subreddit": "medicine",
    "timestamp": 1629220616,
    "score": 49,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #65: SARS-CoV-2/COVID-19 discussion. Week of 9/5, 2021 # COVID-19 Megathread 65\n\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators by [modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, at least 652,000 people have lost their lives in a confirmed case of COVID-19 since December 2019. The true number is suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\nThe newest battleground in this seemingly never-ending fight is convincing a skeptical public that vaccination is the only way to make progress towards returning to life as we all knew it before this situation began eighteen months ago. Misinformation is rife within the realm of popular social networks, including reddit. Vaccination rate has stalled across most of the globe after those most motivated to receive it have finally been inoculated. Although there has been an uptick in number of shots administered since the beginning of this third wave in June, the rate remains insufficient to dampen the current curve of infection.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n\n* [Nextstrain](https://nextstrain.org/ncov)\n\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organisational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [Promed](https://promedmail.org/coronavirus/)\n\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n\n* [SCCM](https://www.sccm.org/covid19)\n\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n\n* [ICU Net](https://covid19-icu.net/)\n\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals -- no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on r/medicine at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualise their comments.",
    "title": "Megathread #65: SARS-CoV-2/COVID-19 discussion. Week of 9/5, 2021",
    "subreddit": "medicine",
    "timestamp": 1630772303,
    "score": 44,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #59: SARS-CoV-2/COVID-19. Month of March 2021. # COVID-19 Megathread 59\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stacked and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, at least 652,000 people have lost their lives in a confirmed case of COVID-19 since December 2019. The true number is suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n\n* [Nextstrain](https://nextstrain.org/ncov)\n\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organisational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [Promed](https://promedmail.org/coronavirus/)\n\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n\n* [SCCM](https://www.sccm.org/covid19)\n\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n\n* [ICU Net](https://covid19-icu.net/)\n\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals -- no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on r/medicine at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualize their comments.",
    "title": "Megathread #59: SARS-CoV-2/COVID-19. Month of March 2021.",
    "subreddit": "medicine",
    "timestamp": 1614577709,
    "score": 44,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #62: SARS-CoV-2/COVID-19. Month of June 2021. # COVID-19 Megathread 62\n\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators by [modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, at least 652,000 people have lost their lives in a confirmed case of COVID-19 since December 2019. The true number is suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n\n* [Nextstrain](https://nextstrain.org/ncov)\n\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organisational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [Promed](https://promedmail.org/coronavirus/)\n\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n\n* [SCCM](https://www.sccm.org/covid19)\n\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n\n* [ICU Net](https://covid19-icu.net/)\n\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals -- no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on r/medicine at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualise their comments.",
    "title": "Megathread #62: SARS-CoV-2/COVID-19. Month of June 2021.",
    "subreddit": "medicine",
    "timestamp": 1622528339,
    "score": 37,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #58: SARS-CoV-2/COVID-19. Month of February 2021. COVID-19 Megathread #58\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators [by modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, an estimated 63 million people have been infected and some 1.5 million people have lost their lives in a confirmed case of COVID-19 since December 2019. The true numbers are suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. In milder disease, remdesivir has been used, although with more mixed evidence. In outpatients, some monoclonal antibodies have shown reduction in subsequent hospitalization. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\nAs of December 2020, several vaccines across the world have received emergency use authorization, and vaccination has begun. Data on effectiveness and safety has been encouraging so far. Several virus variants have appeared around the globe with concern for increased infectious spread and risk that they will render vaccines ineffective before they have even been rolled out widely.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n* [Nextstrain](https://nextstrain.org/ncov)\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organizational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n* [Promed](https://promedmail.org/coronavirus/)\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n* [SCCM](https://www.sccm.org/covid19)\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n* [ICU Net](https://covid19-icu.net/)\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals—no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on [r/medicine](https://www.reddit.com/r/medicine/) at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualize their comments.",
    "title": "Megathread #58: SARS-CoV-2/COVID-19. Month of February 2021.",
    "subreddit": "medicine",
    "timestamp": 1612310398,
    "score": 35,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #60 SARS-CoV-2/COVID-19. Month of April 2021. COVID-19 Megathread #60\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators [by modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. As of April 2021, an estimated 140 million people have been infected and some 3 million people have lost their lives in a confirmed case of COVID-19 since December 2019. The true numbers are suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n* [Nextstrain](https://nextstrain.org/ncov)\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organizational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n* [Promed](https://promedmail.org/coronavirus/)\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n* [SCCM](https://www.sccm.org/covid19)\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n* [ICU Net](https://covid19-icu.net/)\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals—no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on [r/medicine](https://www.reddit.com/r/medicine/) at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualize their comments.",
    "title": "Megathread #60 SARS-CoV-2/COVID-19. Month of April 2021.",
    "subreddit": "medicine",
    "timestamp": 1617596571,
    "score": 32,
    "keyword": "chinese manager"
  },
  {
    "text": "Megathread #61: SARS-CoV-2/COVID-19. Month of May 2021. # COVID-19 Megathread 61\n\n\nThis is a megathread to consolidate discussion about the COVID-19 outbreak. This thread is a place for discussion, personal anecdotes of providing COVID care, brief updates, and professional questions about the epidemiology and management of COVID-19. Reputable sources (not unverified twitter posts!) are still requested to support any new claims about the outbreak.\n\nWe will be hosting a new megathread periodically depending on developments/content. The latest thread will always be stickied and will provide the most up-to-date information. If you just posted something in the previous thread right before it got unstickied and your question wasn't answered/your point wasn't discussed, feel free to repost it in the latest one. If the active COVID megathread isn't stickied, please notify the moderators by [modmail](https://www.reddit.com/message/compose?to=/r/medicine) with a link to the thread.\n\n# Background and summary\n\nOn December 31st 2019, Chinese authorities reported a cluster of atypical pneumonia cases in Wuhan, China. A novel zoonotic virus was suspected and discovered, now named SARS-CoV-2. The syndrome of viral pneumonia caused by this virus -- sometimes associated with abnormal coagulation parameters, anosmia, anorexia, renal failure, and/or gastrointestinal distress -- has been termed COVID-19.\n\nDespite extreme public health interventions at the first epicenter in Hubei province, China, the outbreak has become a global pandemic. Several factors have made for explosive spread of SARS-CoV-2: the human population is immunologically naive, the virus has a long incubation period and can be asymptomatically spread, and is highly infectious, with an rate of transmission significantly higher than epidemic influenza. Unfortunately, COVID-19 has proven deadly as well, with case fatality rate (CFR) estimates ranging between 0.1 to 1% or more. To date, at least 652,000 people have lost their lives in a confirmed case of COVID-19 since December 2019. The true number is suspected to be higher.\n\nThe effect of the pandemic on the healthcare system has been extreme, with cases overwhelming normal operations of hospitals during the initial surge in a number of regions, leading to staff exposure, illness, and in some cases, death. This was exacerbated by worldwide shortages in medical equipment, particularly personal protective equipment (PPE) for healthcare workers; shortages are still present in many parts of the world including the United States. Rationing of healthcare resources has been widely discussed, and in some areas implemented, creating agonizing decisions for doctors and families.\n\nHealthcare organizations have also been starved of usual revenue, and despite an overwhelming demand for healthcare in some specialties and regions, other medical practices are seeing massive drops in income. Furloughs and pay cuts are becoming common across the American medical landscape. Telehealth visits are becoming common, and practices inside the hospital in many regions have completely transformed. In dense cities that have been handling an onslaught of patients for months, many frontline staff (ER, general medicine, ICU, etc) are physically and emotionally fatigued, yet still face a hazardous working environment.\n\nAlthough some regions of the United States, Europe and Asia have been able to control the spread of COVID-19 with combinations of business shutdowns, shelter-in-place/quarantine orders, mandatory mask usage, and social distancing protocols, spread has accelerated in other regions of the United States, Brazil, Russia, and India among other areas. Public health interventions remain controversial in many areas, and particularly in the United States, have become politicized and rejected by many.\n\nMedical science has struggled to keep pace with the spread of the virus. Despite a number of hastily executed clinical trials, few agents have been found to have any clinical effect on COVID-19 outcomes. Dexamethasone has emerged as the only treatment so far with a [demonstrated mortality benefit](https://www.recoverytrial.net/news/low-cost-dexamethasone-reduces-death-by-up-to-one-third-in-hospitalised-patients-with-severe-respiratory-complications-of-covid-19) in patients requiring supplemental oxygen or ventilator support. Misinformation and partial information (such as leaks of interim clinical trial data) are rife. Clinical treatment algorithms have swung wildly based on small case series, anecdotes and conjecture, though a shaky consensus for critical supportive care is starting to emerge. Virologists, immunologists, and others have pivoted their usual research and an impressive number of preprints have been generated. However, enormous questions remain, such as the nature of post-infectious immunity.\n\n# Subreddits:\n\n* [r/medicinememorial - memorial pages for health care workers who died in the global fight against COVID-19](https://www.reddit.com/r/medicinememorial/)\n\n* [r/Coronavirus - general news and discussion about the COVID-19 pandemic](https://www.reddit.com/r/Coronavirus/)\n\n* [r/COVID19 - academic papers and press releases relating to COVID-19](https://www.reddit.com/r/COVID19/)\n\n# Tracking/Maps/Modeling:\n\n* [JHU CSSE](https://gisanddata.maps.arcgis.com/apps/opsdashboard/index.html#/bda7594740fd40299423467b48e9ecf6)\n\n* [Nextstrain](https://nextstrain.org/ncov)\n\n* [Worldometer case tracker](https://www.worldometers.info/coronavirus/)\n\n* [Coronawiki case tracker](https://www.coronawiki.org/)\n\n* [New York Times case tracker and map](https://www.nytimes.com/interactive/2020/us/coronavirus-us-cases.html)\n\n* [BNO News case tracker and map](https://bnonews.com/index.php/2020/04/the-latest-coronavirus-cases/)\n\n* [Wikipedia COVID-19 information](https://en.wikipedia.org/wiki/COVID-19_pandemic)\n\n* [CDC death forecasts](https://www.cdc.gov/coronavirus/2019-ncov/covid-data/forecasting-us.html)\n\n* [IHME projections](https://covid19.healthdata.org/united-states-of-america)\n\n* [University of Texas Modeling Consortium](https://covid-19.tacc.utexas.edu/projections/)\n\n# Resources from Organisational Bodies\n\n* [WHO Daily Sitreps](https://www.who.int/emergencies/diseases/novel-coronavirus-2019/situation-reports)\n\n* [ECDC Latest](https://www.ecdc.europa.eu/en/novel-coronavirus-china)\n\n* [USA CDC Latest](https://www.cdc.gov/coronavirus/2019-ncov/index.html)\n\n* [Promed](https://promedmail.org/coronavirus/)\n\n* [Imperial MRC](https://www.imperial.ac.uk/mrc-global-infectious-disease-analysis/news--wuhan-coronavirus/)\n\n* [CDC Info for health professionals](https://bit.ly/2T80VBd)\n\n* [LSHTM](https://www.lshtm.ac.uk/research/research-action/covid-19)\n\n* [WHO Technical Guidance](https://bit.ly/2vo9DSM)\n\n* [AMA resource center for health professionals](https://bit.ly/395aNkO)\n\n* [ACP Information for Internists](https://bit.ly/2T99Rqc)\n\n* [CDC Pandemic Preparedness Resources](https://bit.ly/2whQmCU)\n\n* [UpToDate COVID-19](https://bit.ly/2Tphyam)\n\n* [EMCrit](https://emcrit.org/ibcc/COVID19/)\n\n* [SCCM](https://www.sccm.org/covid19)\n\n* [RCoA/ICS](https://icmanaesthesiacovid-19.org/)\n\n* [Intensive Blog](https://intensiveblog.com/covid-19/)\n\n* [NICE Guidance](https://www.nice.org.uk/covid-19)\n\n* [ICU Net](https://covid19-icu.net/)\n\n* [EMRAP](https://www.emrap.org/corependium/chapter/rec906m1mD6SRH9np/Novel-Coronavirus-2019-COVID-19?SearchType=%22text%22)\n\n# Reminders\n\nThis subreddit is heavily moderated and comments may be removed without warning. In particular, users are reminded that this subreddit is for medical professionals -- no personal health anecdotes or layperson questions are permitted. Users are reminded that in times of crisis or perceived crisis, laypeople on reddit may be turning to this professional subreddit and similar sources for information. Bad advice, pseudoscience, personal attacks, personal health situations, protected health information, and personal agendas are not permitted. The full subreddit rules can be found at [r/medicine/about/rules](https://reddit.com/r/medicine/about/rules). Please review advice about commenting and posting on r/medicine at [r/medicine/wiki/index](https://reddit.com/r/wiki/index) and [r/medicine/wiki/faq](https://reddit.com/r/medicine/wiki/faq). Though not mandatory, we ask users to please consider setting a subreddit flair on the sidebar before commenting to help contextualise their comments.",
    "title": "Megathread #61: SARS-CoV-2/COVID-19. Month of May 2021.",
    "subreddit": "medicine",
    "timestamp": 1620613376,
    "score": 14,
    "keyword": "chinese manager"
  },
  {
    "text": "When review games work too well... I teach ESL^(1) in SEA^(2). My country has managed the pandemic very well. We still hold classes, though we are currently on break for Lunar New Year. Over the semester we learned about 75 new vocabulary words^(3) and we had a big review bash at the end of the semester.\n\nI decided Bingo would be a great fun way to review! I even had a prize for first place!\n\nHowever, no-one knew what Bingo was, they only knew the song. I asked a national teacher to help translate the rules, then we began.\n\nThe excitement level started at high and quickly rose to frothing mad.\n\nTwo boys almost got into a fight over the word \"Constellation\" because they both needed it and they didn't want to share 1^(st) place^(4).\n\nA little girl had four-in-a-row three different ways. She was crossing her fingers and chanting 3 words like a prayer.\n\nNeptune, Freeze, Cookie...\n\nNeptune, Freeze, Cookie...\n\nThe kid who won forgot English for a moment and was just screaming Chinese at his desk waving the bingo card in the air. Most of the other children around him burst out of their chairs screaming, I couldn't tell who had actually won because everyone was so animated.\n\nAfter I confirmed his winning card I gave him his prize, which he held aloft like Link after opening a treasure chest. His gloating caused ANOTHER wave of angry Chinese shouting from all the children who lost.\n\nThe first place prize that caused all this excitement? A $5 Lego car set.\n\n&#x200B;\n\n1. **E**nglish as a **S**econd **L**anguage.\n2. **S**outh **E**ast **A**sia.\n3. I know that's not a lot, but I only teach this group once a week after school.\n4. Neither of them had won, they were arguing over the *hypothetical* winning.",
    "title": "When review games work too well...",
    "subreddit": "Teachers",
    "timestamp": 1613263455,
    "score": 121,
    "keyword": "chinese manager"
  },
  {
    "text": "I’m self conscious about having tattoo as a teacher I’m a teacher and i had a tattoo on my bicep that I hated. After 10 painful sessions of laser removal, it was still only 50% faded, so i decided that cover up would be a better idea. I could just embrace that mistake, and live happily ever after with the new tattoo that i love. I took months to decide on the cover up. Finally, i chose something that was both good to look at (in my opinion) and also meaningful for life. However what I couldn’t predict is how self conscious I would feel. The cover up is a lot bigger ( its a mountain 🏔 on my inner bicep) with coordinates underneath. I love it, it holds such beautiful meaning to me. But now i am so afraid to show it at work. Will they think im unprofessional for having a tattoo in an obvious place? Will they think im stupid? Will the parents complain? Before this cover up, i used to always wear cardigan and hide my old tattoo cos (a) i hated it (b) it looked weird and faded due to the laser treatments, the skin was scarred. Now the tattoo looks better, but still im so used to hiding it that my brain is not accepting the fact that now i have a more obvious tattoo. I hate feeling this way. I want to own it. I want to rock this tattoo. I want to carry it proudly. But how do i do so when my brain overthinks so much? When i care so much what other teachers think? How do i divert my mind from this overthinking?\n\nEDIT:  i will be working in a internationalised chinese school in hong kong. The students are hong kong chinese. The management consists of chinese people that were educated overseas for their bachelors and masters.",
    "title": "I’m self conscious about having tattoo as a teacher",
    "subreddit": "Teachers",
    "timestamp": 1625834568,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Finished final round of interview 1.5 weeks ago. Email hr or hiring manager to find out the status? Hi everyone, thanks for reading this.\nI completed final round of the interviews 1.5 weeks ago. Altogether I had six rounds, the hiring manager was at the third round.overall I had a good feeling about this. During the interview with the hiring manager he ended off by giving me his work email address, told me email him if I've any questions. \n\nBefore I started the fourth interview, hr called me( about 2 weeks ago) to congratulate on my progress and if It all goes well they will make an offer by 3 march. \n\nHowever I would like to know the answer by this week becausemy lease for the apartment is ending on 21st march and the agent is asking if I want to renew it.\nThe pickle is this job is based overseas, so I need  time to clear the furniture, sell my car. What if I renew it for six months and next week hr said they will offer me a job. I don't think they will wait six months as I told them that my notice period is 6 weeks.\nI emailed the hiring manager last week to thank him and wished him a good chinese new year (he's in hong kong), I didn't expect him to reply and apologise for the having so many interviews near the festive season (I suppose he assumed I'm celebrating chinese new year too).\n\nSo should I email hr or hiring manager to tell them about my situation? I'm afraid of jeopardizing my chances. Please help",
    "title": "Finished final round of interview 1.5 weeks ago. Email hr or hiring manager to find out the status?",
    "subreddit": "careerguidance",
    "timestamp": 1614000704,
    "score": 39,
    "keyword": "chinese manager"
  },
  {
    "text": "4 months pregnant in a toxic working environment, is it a bad time to change jobs? 24 hours to accept/decline job offer Tldr; 4 months pregnant, hating my job, got a new job offer, what do I do? \n\nHello,\nI'm 27yo, 4 months pregnant, low risk pregnancy and over the past year I've been extremely unhappy at my work.\nIt's a good-enough office position at a big company, in a field that i really like.\nEspecially lately they treat me really badly, having managers speaking behind my back to other colleagues. They also demoted my role to sth i don't like anymore and treat me like one of the newbies. They also hired new, incompetent managers and we have now a kindergarten approach to things. As a result I'm every day sad, without a mood to wake up.\nThe pro of this job is great work from home flexibility and an understanding Corp policy toward parents (American tech company). \n\nYesterday i got a job offer from another big (yet a bit new) tech company, more money, better title. The role is nice but definitely not my ideal next career step. The teams seems lovely but that company has a weird reputation about extra working hours and less flexibility (different culture, it's chinese). Though close people told me only good things about it. (note:it was them approaching me for the role) \n\nMy therapist tells me my current job seems toxic and i have a bit of a masochist syndrome and also afraid to take risks.\n\nMy uncle who has a great career and gives good job advice tells me that my current role is high in demand, i should be able to get other offers easily. For now changing jobs is too much burden and i will not be able to give fully myself to a new role. My pregnancy should be my priority, so i should stay where i am until i go on my maternity leave.\n\nWhat is best to do?\nI cant sleep from stress, sadness etc and I'm afraid it will impact the baby. I have until tomorrow to accept the new job offer. \n\nThank you",
    "title": "4 months pregnant in a toxic working environment, is it a bad time to change jobs? 24 hours to accept/decline job offer",
    "subreddit": "careerguidance",
    "timestamp": 1625124350,
    "score": 10,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I quit my unpaid internship? Hi everyone, I am currently doing an unpaid internship at an insurance company. I took the offer because I was desperate at that time for an internship. After few months working, I like the people there, but there are 5 things I really hate about it:\n\n1. I couldn't speak Chinese and they don't have any kind of training for English speaking people. I couldn't even shadow him because all his clients speak Chinese. Very few people speak English well in the company, and I am all alone as there's no other intern (the other one quit). I feel kind of isolated.\n2. There's another fast track manager programme in the company, and my mentor is way more focused on guiding the candidates rather than the intern. I think he doesn't even know what kind of internship programme he would like to run. For example, I ask for him to teach me about sales, how to persuade customer, but he wanted all the manager candidates to be there too. \n3. I agreed on an unpaid internship as I expected to learn about financial management. Turns out all I learn is about insurance and selling it. But what I don't like the most is that the mentor is pushing us to sell the insurance, although he explicitly stated I'm not required to do that as an intern\n4. The incurring cost is way more than I expected. We have to pay for our own exams (there are 5, on average one cost $25, which is quite expensive in my currency), transport, lunch, and he's even pushing us to buy an Ipad in the future (because their system is running on Ipad only)\n5. It's unpaid but I couldn't write anything on my CV. I didn't get much experience and I am already sick and tired of learning for the exams (you need around 30 hours to prepare for each). I was told to be solution-oriented and tell the mentor what I want, but I couldn't think of a reason for developing an internship program for English speaker that will benefit the company too. Why would they spend time and effort training English speakers when 95% of their clients speak Chinese and they can just hire bilinguals instead?\n\nSo I plan to quit, but I don't have another offer right now. But when I'm thinking of spending my summer at that place, I really dread it. Am I wasting my time? Should I quit? My plan is to take courses such as data analysis, programming, or language during the summer if I quit and ends up with nothing. Thank you!\n\nFor background info, I already did another remote unpaid internship in digital marketing, so it's not that I'll have 0 experience if I quit this one.",
    "title": "Should I quit my unpaid internship?",
    "subreddit": "careerguidance",
    "timestamp": 1620120308,
    "score": 5,
    "keyword": "chinese manager"
  },
  {
    "text": "How possible is it to avoid an entry level position without direct experience in an industry? My closest direct experience to my desired environmental career was consulting work for a solar company that acted as a go-between for manufacturers in China and companies in the West, but that only lasted a few months and was back in 2013.\n\nFor the past 6 years I have been working my way up in non-profit development (currently Development Director in a public health sphere managing a team of 6; formerly a fundraiser for youth development) but am eager for a closer match to my passion for environmentalism. I have an upcoming move and therefore job hunt when my med school wife matches for residency.\n\nI am an Eagle Scout, have a masters in International Relations, am fluent in English and Chinese, some of my undergrad coursework was environment-related, and I even published an article on environmental impacts of large hydrological dams in 2010. Thank you in advance for any advice!",
    "title": "How possible is it to avoid an entry level position without direct experience in an industry?",
    "subreddit": "careerguidance",
    "timestamp": 1613800213,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "I'm trying to find the right road that leads me to data science, but How? since I was in college I always wanted to be a data scientist, so I learned python, R, and SQL, and went to look for a junior data scientist role, instead, I've found a data analyst role so I applied and got accepted.\n\nI later found out that here, in my country (Egypt), Data Analysis is not like the online courses I took, not full of programming and statistics, it's a matter of data gathering and excel pivot tables and vlookups, I neglected that and told my manager that I can do better.\n\nI did wonderful tools for the whole team to use with python that involved machine learning and more, it has saved the whole department hours of work in a favor of few minutes. I got flattered a lot because of my work, but my salary is still very low you can't imagine how low it is, although my manager gets more than 10x what I get.\n\nI got an offer from a really big Chinese electronics company for 2.5x my current salary, but when i met the manager he told me that only 40% of my time will be data analysis and that the analysis I'm going to need is not that complicated so I won't need to use any programming at all.\n\nall these roads don't seem to get me anywhere near what I'm trying to get, I can't practice the skills I need to be a data scientist well, I can't find a job that appreciates my efforts and work, i can't find a job to give me a good salary to live with.\n\nwhere should I look for suitable opportunities? is my thinking wrong? everyone in my company gets amazed when they know I have programming experience and say that if they had half of my skills they'd be at a totally different level, so why can't I? what am I missing?",
    "title": "I'm trying to find the right road that leads me to data science, but How?",
    "subreddit": "careerguidance",
    "timestamp": 1611595324,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I accept the job offer? I got a job offer for a startup company. Initially thought the company was a good company to work for, then I read the Glassdoor reviews and started to get bad vibes about it. Went through the job interview process anyway just in case none of my other leads work out. Got the job offer a couple of days ago with a very attractive compensation package, BUT I'm extremely worried about the company and the toxicity that previous employees claim it to be.\n\n* 2 .5star review on Glassdoor, virtually every employee telling me to RUN\n* Founder is Chinese and about 90% of employees are Chinese - very little diversity (though this seems to be changing); reviews claiming that the culture is very much like old Chinese warehouse labor\n* Employees seem to be overworked with very little work/life balance almost all reviews are past employees claiming the culture sucks, CEO sucks, leadership sucks\n* One interviewer I spoke with literally answered his phone TWICE during the interview\n\nThe only positive things for me right now is the fact that my manager seems tolerable and the pay good but overall I have a feeling that I'll be pretty miserable working for this company but at the same time I do not want to say no to an offer knowing I've been unemployed for months now.\n\nSeriously considering saying yes to the offer and taking it while I look for a better job. OR, saying no to the offer and continuing my job search - I'm currently interviewing with companies that I actually like (i.e. Uber, Amazon).\n\nAny thoughts/advice?",
    "title": "Should I accept the job offer?",
    "subreddit": "careerguidance",
    "timestamp": 1630871262,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "I think I am being excluded from meetings. What should I do? I work at a S&P 500 cybersecurity company (name starts with F), and until recently thought I have been doing really well at my job. This is my first job out of college, and as of this week I have worked for 2 years.\n\nI was working on a solo project that a previous team of 11 engineers gave up on after a year of work trying to get it to work. I was told to get it working by March, however after digging I found that a crucial feature was not working properly (the way it was being tested by the previous team carefully avoided this and pulled wool over management's eyes), and the deadline got significantly delayed.\n\nI finally got it working in May, and my manager seemed pleased and impressed. There was some minor tweaking left to be done, but that was expected to take less than a week. The CTO meets with my manager in the meantime, and decides to nix the project entirely at this point.\n\nI am then swapped to another project altogether that uses an entirely different tech stack. I am told to plan out a feature and do research and come up with a good approach to do a problem. I come up with and provide a demo proving it works. My manager says he needs time to understand what I am doing and tells me to keep improving it. 2 weeks later, he tells me to switch gears and start reading through the codebase and understand it. Three weeks later, we still have not moved forward with the feature despite my asking about it.\n\nHe tells me today that the codebase is very complicated and he expects me to take a while to fully understand it. Meanwhile, I notice he is calling the other developers working on this same project one by one into a conference room to meet with another team. I am the only person not invited to the meeting. I understand that I am new to the project, but this feels like a red flag to me.\n\nDespite being headquartered in USA, the company is predominantly composed of Chinese engineers. They have always excluded me from some meetings saying that the fact I do not know Chinese makes the meetings operate slower when I am there. They typically have kept such meetings to management only for this reason, but not today.\n\nI am in a vulnerable position until December for reasons I don't want to get into and can't jump ship without hurting myself badly. Should i still be looking ASAP, or can I wait till December? Getting fired will be even worse for me right now than quitting.",
    "title": "I think I am being excluded from meetings. What should I do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1631165026,
    "score": 30,
    "keyword": "chinese manager"
  },
  {
    "text": "What do I need to learn in order to integrate a whole bunch of data from legacy systems with new, mobile apps? So upfront I'm just a dumb PM who is talking with a friend about working for him where a bunch of old crusty legacy systems need to share data with some emerging modern webapps.\n\nI'm somewhat of a \"technical\" PM in the fact that I have an MSCIS and some experience developing webapps (basics: html, css, js/ts) and am currently leading a small team to migrate some apps from EC2 instances to K8s clusters. \n\nHere's the problem: upper management tends to have no fucking clue what the difference between what Ive done is what they might ask me to do is. (they've already hired C# programmers to go make webapps with typescript and stuff like that) So I figure I need to cram some udemy or edx in.... uhhhh data engineering? enterprise architecture? what the fuck is this shit called? Good news is I don't need to know how to \"do the thing\", but I do need to know how to \"speak the language\" of making old app talk to new app\n\nI looked into a course like this: [https://www.edx.org/course/data-engineering-basics-for-everyone?index=product&queryID=1331452dd94b8a88fe84e5c1d7065b27&position=2](https://www.edx.org/course/data-engineering-basics-for-everyone?index=product&queryID=1331452dd94b8a88fe84e5c1d7065b27&position=2)  \n\n\nbut it had a lot of data sciencey sounding stuff like ETL and python which seem more about big data analytics and predictive modeling rather than taking some companies old shit and making integrating data with new shit. Any pointers because I am well and truly lost here. like...kafka? (or is that too old already?)  \n\n\nI feel like im about to be hired as a chinese language professor because I know how to count to 14 in korean.   \n\n\nCan't really go into details but I do have like a year to get ready while working full time in my current position. TIA.  \n\n\nTLDR: What is \"make many old apps talk to many new apps\" subject called within the cs world so that I can youtube it or find a course about it?",
    "title": "What do I need to learn in order to integrate a whole bunch of data from legacy systems with new, mobile apps?",
    "subreddit": "cscareerquestions",
    "timestamp": 1624166333,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Hello can anyone help me solve this? Mr.  Bernard married Bella, a disabled person due to an accident three years  ago. His only son, Razi is pursuing a degree course at INTI  International College Subang now. Mr. Bernard works as a Senior Engineer  in Hooray Sdn Bhd for more than 20 years. His 2021 employment  remunerations are listed below:\n\n(1) The net monthly salary after 11% employee’s EPF is RM8,900.\n\n(2) Monthly entertainment allowance is RM300. Mr. Bernard spent only RM2,800 to entertain the business customers.\n\n(3) Mr. Bernard hired a maid at RM1,500 per month and he received partial reimbursement from the employer at RM1,200 per month.\n\n(4) During the annual dinner, he received a long term service award pewter at a value of RM11,500.\n\n(5)  The employer acquired a new car worth RM130,000 for Mr. Bernard from  April 2021 onward and provided car fuel benefit from July 2021 onward.\n\n(6)  During February 2021 Chinese New Year, the employer incurred RM5,800  for Mr. Bernard’s family trip to Pulau Langkawi. The employer also  subsidised Mr. Bernard’s trip to Melbourne, Australia at an amount of  RM8,000.\n\n(7) The employer fully paid Mr. Bernard Bernard’s surgery cost, RM25,000 at Sunway Hospital in May 2021.\n\n(8)  Mr. Bernard was transferred from Johore Baru office to Petaling Jaya  office on 1 August 2021. Initially, the employer temporary rented a  hotel room for Mr. Bernard during August 2021 and subsequently rented a  fully furnished condominium at a cost of RM3,500 including RM700 that  related to the household furnishing from 1 September 2021 onward.\n\nAdditional information:\n\n(1) He invested in Glue Singapore Ltd and received a dividend of RM5,400 in 2021.\n\n(2)  He bought a single-story shop at a cost of RM1,100,000 two years ago.  Due to his existing tenant ended the tenancy agreement in October 2020,  he appointed a property agent. The property agent managed to get a new  tenant to rent the property at RM4,500 per month from 1 January 2021  onward. Mr. Bernard incurred the following expenses:\n\n One-month rental as property agent’s remuneration.\n\n Quit rent - RM46 per annum\n\n Maintenance fees – RM320 per moth\n\n Replacement of an air-conditioner at RM2,350\n\n Legal fees on tenancy agreement – RM150\n\n(3)  He invested in a partnership business a few years ago. He has 40%  ownership of the business. The 2021 adjusted loss and capital allowance  for the year of the partnership were RM16,800 and RM3,500 respectively.  Mr. Bernard’s brought forward unutilised business loss and unutilised  capital allowance were RM4,000 and RM2,000 respectively.\n\n(4) Mr. Bernard paid his professional Engineer membership fees at an amount of RM1,459.\n\n(5) He bought a smartphone at cost RM3,800.\n\n(6) Mr. Bernard and his brother are taking care his 80 years old father. Both brothers are claiming parent relief in 2021.\n\n(7) Mr. Bernard contributed RM6,700 zakat in 2021.\n\nRequired:\n\nCompute the Income Tax payable of Mr. Bernard for the year of assessment 2021.",
    "title": "Hello can anyone help me solve this?",
    "subreddit": "Accounting",
    "timestamp": 1638766790,
    "score": 0,
    "keyword": "chinese manager"
  },
  {
    "text": "Gah that American \"math\" team post on the front page really bothered me. I get it, it's a casual joke. Asians tend to dominate math competitions. But more importantly, the sense that even though you're winning a competition for America and are American through and through, you're still a foreigner in your own country.\n\nIt used to drive me insane when people asked me \"where are you really from\". I'd want to reply well started in Alabama, moved to Chicago when I was still young before school, and now I work in New York. I would carry my passports out in airports like a badge of honor so people would know I'm \"american\". \n\nAnd it took me decades to unfurl the toxic defense mechanisms I spent my life throwing up. Growing up, I vehemently rejected Asian culture. I hated my name so I changed it legally. I beat the shit out of my body playing lacrosse at a high level because it was the whitest sport (all conference and even then I was known in the conference as the \"asian kid\" or the \"chinky boy with skills\"). I attended a fucking US military academy for a year instead of a top 5 school initially because I wanted to show the world how American I was. \n\nIt took me until 25 and working in Asia on projects for half the year to finally get it. To finally be in a place where the assumption isn't I'm a math guru or code monkey. Where my managing directors don't assume I'm a work horse and nothing more. Where instead of preparing the deck for sales meetings, I got to actual drive the meetings and lead. But more importantly, as I matured, I understood so much more about myself and why I am the way I am.\n\nI never realized how much growing up in the midwest as one of the only Asians in my school would impact my sense of self. My obsession with fitting in and being \"american\" led me to completely reject so much of what makes me well, me. \n\nThis current movement of Asians standing up for themselves and doing it together makes me so fucking proud. I now realize my history and culture isn't just that of China but it's about the workers brought here to build the railroads. The asian communities that popped up early on that suffered untold racism and abuse. The Chinese exclusion act and the Japanese internment camps are some of the most atrocious decisions by my country. But I'm so fucking proud to be part of that history. To know that the strength to endure untold hardship and sacrifice for the future generations flows through me and is part of my history and culture means everything. So thank you to all the activists and people stronger than me who push the narrative. You guys have made me so proud to be Asian American and my children will love and embrace their culture and heritage in a way I never allowed myself to. So thank you.",
    "title": "Gah that American \"math\" team post on the front page really bothered me.",
    "subreddit": "asianamerican",
    "timestamp": 1621955598,
    "score": 114,
    "keyword": "chinese manager"
  },
  {
    "text": "What Was Your Favorite Childhood Food? Given the large number of negative posts (which is thoroughly understandable given the rise of anti-Asian rhetoric and violence going on in this country), I thought I would try to post something positive.\n\nI'm a 3rd generation ABC (American born Chinese). Although most of my relatives are doctors and attorneys, I became a teacher. I started out as an elementary teacher but after 17 years I burned out and went to culinary school. My father said I was having a mid-life crisis. After graduating and working in the food service industry for a few years, I returned to education as the chef instructor of a high school Culinary Arts program. I have now been teaching Culinary Arts for fourteen years.\n\nAlthough I grew up eating typical American breakfast foods i.e. bacon and eggs, pancakes, French toast, waffles, cereal, and oatmeal; one of my favorite food memories growing up was of my grandmother's sticky rice which we would often have for breakfast whenever we visited my paternal grandparents. Grandmother would steam glutinous rice and mix it with fried onions, crumbled hard boiled eggs, chopped Chinese sausages and other ingredients prior to wrapping it in banana leaves and steaming them.\n\n&#x200B;\n\nhttps://preview.redd.it/om2oe3qj50o61.jpg?width=610&format=pjpg&auto=webp&s=86149a4e55c2e3627c03028b5edfb5254b78dcb7\n\nSince grandmother had very conservative views of gender roles, I wasn't allowed in the kitchen to watch her make these because boys had no place in the kitchen (according to her worldview). Since my sister and my female cousins had no interest in cooking, I'm sorry to say that grandmother's recipe was lost when she passed on.\n\nAlthough I have done my best to replicate her recipe, I've never quite managed to get the taste right.\n\nWhat I have managed to get right is the production of chicken congee, though my family typically called this \"jook\". It'd be hard to mess up a jook since it's nothing more than rice boiled to pieces in what is usually a flavorful broth.\n\n&#x200B;\n\nhttps://preview.redd.it/a06p6sap70o61.jpg?width=258&format=pjpg&auto=webp&s=e149b6db2b1029e48744a9ad0c8a81d1ee0fc1cd\n\nMy father preferred a plain jook with a garnish of green onions. In contrast, my grandmother always had a wide variety of toppings to add. These toppings included pork floss (yuk sung), fried dough, and all sorts of vegetables. I personally liked cracking a raw egg into the bowl and pouring the hot jook over the egg. The heat from the soup would soft cook the egg and the first spoonful would typically break the yolk. When drizzled with some light soy sauce and a touch of sesame seed oil, I thought this dish was heavenly.\n\nWhat are your favorite childhood food memories?",
    "title": "What Was Your Favorite Childhood Food?",
    "subreddit": "asianamerican",
    "timestamp": 1616168495,
    "score": 17,
    "keyword": "chinese manager"
  },
  {
    "text": "The terrible pronunciation of Asian languages on TV. Have anyone noticed how bad actors on TV pronounce Asian languages when they are suppose to be playing a character who's a fluent speaker?\n\n\nWith the amount of Asian immigrants in America, if casting managers actually made an effort, they could've found someone who can speak the language. Sometimes these actors only speak one or two liners, couldn't they at least find someone to teach the actors better pronunciation? \n\nI don't know how it is with other foreign languages, but as a Chinese Canadian I often have trouble understanding the Chinese they are trying to speak. I grew up with Asian Canadians, and while their pronunciation of the Asian language can't be compared to native speakers, they can at least be understood. Even my Caucasian friends can pronounce better Chinese when they are ordering dimsum than the actors on TV. It just irks me because it really doesn't take that much effort to find someone who can speak fluently or teach them to speak better. But I guess Asian representation was never important in mainstream media.",
    "title": "The terrible pronunciation of Asian languages on TV.",
    "subreddit": "asianamerican",
    "timestamp": 1616086914,
    "score": 8,
    "keyword": "chinese manager"
  },
  {
    "text": "Apparently \"Women don't kill men!\" 1. [Woman kills man for refusing to give her beer](https://href.li/?http://www.nbcmiami.com/news/Keys-Woman-Kills-Man-Who-Refused-to-Give-Her-Beer-Cops-164255176.html) \n2. [Woman stabs man for refusing to have sex with her, threatens to cry rape](https://href.li/?http://www.dailymail.co.uk/news/article-2205067/Woman-stabbed-man-refused-sex-threatened-rape-went-hospital-treatment.html) \n3. [Woman rips off man’s testicle because he rejected her, tried to swallow it](https://href.li/?http://news.bbc.co.uk/2/hi/4253849.stm)\n4. [Woman kills man for refusing to marry her](https://href.li/?http://cdnc.ucr.edu/cgi-bin/cdnc?a=d&d=LAH19080719.2.31.14) \n5. [Woman cuts off man’s penis because of argument](https://href.li/?http://www.ibtimes.com/catherine-kieu-sentenced-california-woman-who-cut-husbands-penis-gets-7-years-life-prison-1328289) \n6. [Woman shoots her husband after argument](https://href.li/?http://www.myfoxhouston.com/story/22487331/2013/06/03/woman-charged-in-her-husbands-shooting-death) \n7. [Woman cuts off cheating boyfriend’s penis, flushes it](https://href.li/?http://www.huffingtonpost.com/2012/09/04/julia-munoz-huaman-cut-off-boyfriends-penis-flushed-toilet_n_1854924.html)\n8. [Woman suspects husband of cheating, stabs him to death](https://href.li/?http://www.nydailynews.com/news/crime/fla-woman-stabs-cheating-husband-death-article-1.1386046) \n9. [Woman shoots, kills boyfriend for cheating](https://href.li/?http://www.clickorlando.com/news/Cops-Woman-shot-killed-boyfriend-in-Pine-Hills-over-cheating/16814162) \n10. [Woman stabs boyfriend for cheating in Monopoly board game](https://href.li/?http://www.thesmokinggun.com/buster/assault/new-mexico-monopoly-stabbing-976532) \n11. [Woman shoots, kills man for ending relationship](https://t.umblr.com/redirect?z=http%3A%2F%2Fwww.nytimes.com%2F2006%2F06%2F24%2Fus%2F24brfs-002.html&t=ZGQ3MmYwYmIyOTExMjBkMDlhNDdhODVhNjI2OTgyNDM2NWM3ZDEwNiw3ZTQ5ZjE0OTg5YTg2Mzk5ODUwNzdkYWExZTVkNDhmZWM3MmQ2YWQ5&ts=1619557860) \n12. [Woman sets husband’s genitals on fire for hugging another woman, dies](https://href.li/?http://www.nydailynews.com/news/world/australian-woman-accused-torching-husband-genitals-charged-murder-article-1.420833) \n13. [Woman kills, dismembers husband’s body over argument](https://href.li/?http://www.cnn.com/2012/06/06/world/brazil-dismemberment/) \n14. [Mother kills 18-month old twins to get back at husband she thought was cheating](https://href.li/?http://www.dailymail.co.uk/news/article-2151941/Stacey-Smalls-held-bail-murdering-twins-cheating-husband.html) \n15. [Woman kills husband after he confronts her about affair](https://href.li/?http://www.complex.com/city-guide/2012/04/woman-gets-25-to-life-for-killing-husband-then-hiring-hitman-to-kill-her-lover) \n16. [Woman kills cheating husband with lethal dose of heroin](https://href.li/?http://bc.ctvnews.ca/woman-killed-cheating-husband-with-overdose-of-heroin-1.576435) \n17. [Woman runs over, kills cheating husband](https://href.li/?http://www.click2houston.com/news/Police-Wife-Runs-Over-Cheating-Husband/2871106) \n18. [Obese woman sits on boyfriend, kills him and avoids jail time](https://href.li/?http://www.cbsnews.com/news/woman-kills-boyfriend-by-sitting-on-him-but-mia-landingham-isnt-going-to-jail/) \n19. [Woman kills boyfriend with stiletto shoe](https://href.li/?http://www.nydailynews.com/news/national/tx-woman-found-guilty-killing-boyfriend-stiletto-heel-article-1.1749860)\n20. [Woman murders cheating husband with coffee mug](https://href.li/?http://www.huffingtonpost.com/2013/08/26/wife-kills-husband-coffee-cup_n_3815121.html) \n21. [Woman kills boyfriend for not buying her a gift ](https://href.li/?http://www.theroot.com/articles/culture/2014/05/pregnant_chicago_woman_kills_boyfriend_over_failure_to_buy_gift_1.html)\n22. [Woman kills boyfriend who accused her of cheating](https://href.li/?http://www.ledger-enquirer.com/2014/04/15/3057346/russell-county-sheriffs-office.html) \n23. [Woman stabs and kills boyfriend , Judge: “I hope you die in prison”](https://href.li/?http://www.kmov.com/video/yahoo-video/Judge-to--255634951.html)\n24. [Woman shoots, kills ex-boyfriend, buries him in pile of debris](https://href.li/?http://www.nbc-2.com/story/24230991/lee-county-woman-gets-life-in-prison-for-killing-ex-boyfriend) \n25. [Woman shoots boyfriend in the back of the neck, killing him](https://href.li/?http://www.santafenewmexican.com/news/local_news/police-woman-shot-boyfriend-from-behind/article_6a94a7ad-51cf-5d97-8f7a-5b508206ef82.html) \n26. [Woman shoots boyfriend six times, kills him after argument](https://href.li/?http://www.msnewsnow.com/story/25206075/northeast-jackson-woman-jailed-for-killing-boyfriend) \n27. [Woman stabs, kills boyfriend over mother’s day gift](https://href.li/?http://www.kens5.com/news/151524285.html) \n28. [Woman stabs boyfriend to death, also stabbed her husband to death 7 years prior](https://href.li/?http://www.elpasotimes.com/news/ci_25268807/el-paso-woman-previously-convicted-common-law-husbands)\n29. [Woman pushes way into home, stabs boyfriend to death over argument](https://href.li/?http://napavalleyregister.com/news/local/woman-sentenced-to-seven-years-in-prison-for-killing-boyfriend/article_282b67d7-4a75-592e-b603-eb2c65d71428.html) \n30. [Woman angry at boyfriend takes her anger out on his 4 year-old](https://href.li/?http://kfdm.com/shared/news/top-stories/stories/kfdm_police-woman-kills-boyfriends-4yearold-daughter-fit-anger-4200.shtml?wap=0) \n31. [Woman stabs boyfriend to death, thought he was cheating on her](https://href.li/?http://www.idahostatesman.com/2014/04/22/3148973/nampa-woman-to-serve-at-least.html) \n32. [Woman bludgeons husband to death with hammer to pay back loan](https://href.li/?http://www.emirates247.com/news/woman-kills-hubby-to-repay-loan-from-ex-boyfriend-2014-04-09-1.544858) \n33. [Woman stabs, kills boyfriend during argument](https://href.li/?http://www.mercurynews.com/peninsula/ci_25549887/east-palo-alto-woman-who-killed-boyfriend-steak) \n34. [Woman murders boyfriend for tweeting out his female crush](https://href.li/?http://gossipplug.com/man-killed-by-girlfriend-after-tweeting-his-womancrushwednesday/) \n35. [Woman shoots and kills boyfriend, kills self while out on bail](https://href.li/?http://www.wcti12.com/news/sheriffs-office-suspect-in-boyfriends-murder-found-dead/25518718) \n36. [Woman stabs to death boyfriend over argument about an ex](https://href.li/?http://www.registercitizen.com/general-news/20140219/torrington-woman-accused-of-killing-her-boyfriend-in-jealous-rage-police-say) \n37. [Woman stabs and kills boyfriend for social media posts](https://href.li/?http://timeli.info/item/631340/Huff_Post_Weird_News/Shardonnae_Pruitt__Chicago_Woman__Charged_With_Fatally_Stabbing_Boyfriend) \n38. [Woman shoots boyfriend in the face, fails to make it look like suicide](https://href.li/?http://wnep.com/2014/04/02/woman-admits-shooting-boyfriend-in-the-face-killing-him/) \n39. [Woman kills boyfriend’s puppies during phone argument](https://href.li/?http://www.nbcnewyork.com/news/local/American-Bulldog-Puppies-Killed-Food-Cooler-Linden-New-Jersey-Woman-Arrested-226958931.html)\n40. [Woman shoots boyfriend in the face with rifle during argument](https://href.li/?http://www.saratogian.com/general-news/20120702/victim-was-unarmed-at-the-time-of-fatal-schuylerville-shooting-prosecutors-say) \n41. [Woman pushes boyfriend off fence after argument, killing him](https://href.li/?http://www.10news.com/news/san-diego-woman-who-killed-boyfriend-expected-to-be-sentenced-today-021914) \n42. [Woman attacks boyfriend with large knife, intent to kill ](https://href.li/?http://www.kfvs12.com/story/25630426/m/category/106766/radar-images)\n43. [Woman abused, threatens to kill boyfriend in sleep](https://href.li/?http://helenair.com/news/local/woman-threatens-to-kill-boyfriend/article_33e6d76e-940d-11e3-91e0-0019bb2963f4.html)\n44. [Woman beats, murders boyfriend and puts him in freezer because he wanted to break up with her](https://href.li/?http://nypost.com/2013/08/27/rejected-minn-woman-kills-boyfriend-hides-body-in-freezer/)\n45. [Woman held gun to boyfriend’s head, murders on Christmas](https://href.li/?http://fosters.com/apps/pbcs.dll/article?AID=/20120619/GJNEWS_01/706199916) \n46. [Woman with previous assault charge on another boyfriend stabs and kills different boyfriend ](https://href.li/?http://www.statesman.com/news/news/local/woman-pleads-guilty-to-killing-boyfriend/nW65R/)\n47. [Woman attempts to murder boyfriend with giant breasts ](https://href.li/?http://www.huffingtonpost.co.uk/2012/11/26/franziska-hansen-attempted-murder-boyfriend-smother-dd-breasts_n_2190794.html)\n48. [Woman stabs boyfriend in neck, killing him after argument](https://href.li/?http://www.timesdispatch.com/news/local/crime/woman-gets-years-for-plunging-knife-into-boyfriend-s-neck/article_25c72cb4-3815-11e3-9c76-0019bb30f31a.html) \n49. [Woman chokes and stabs ex-boyfriends cat to death ](https://href.li/?http://calcoastnews.com/2014/01/santa-maria-woman-arrested-killing-ex-boyfriends-cat/)\n50. [Woman starts argument with boyfriend, stabs and kills with umbrella](https://href.li/?http://www.enca.com/south-africa/woman-kills-boyfriend-umbrella) \n51. [Woman kills boyfriend with her car after argument](https://href.li/?http://cjonline.com/news/2012-09-19/woman-accused-using-car-kill-boyfriend) \n52. [Woman shoots, kills boyfriend in his bathroom](https://href.li/?http://www.wsoctv.com/news/news/local/woman-accused-killing-boyfriend-makes-first-court-/nJQSS/) \n53. [Woman shoots, kills boyfriend with illegal handgun ](https://href.li/?http://www.myfoxtampabay.com/story/19634275/2012/09/25/deputies-charge-woman-in-domestic-murder)\n54. [Woman sets her boyfriend on fire, killing him](https://href.li/?http://elitedaily.com/news/world/woman-kills-boyfriend-setting-fire-slept/) \n55. [Woman shoots and kills ex-boyfriend multiple times, kills herself](https://href.li/?http://www.examiner.com/article/edris-msundastood-dickson-murder-suicide)\n56. [Woman shoots boyfriend in the head, found out he was dating other women](https://href.li/?http://www.alaskadispatch.com/article/20131207/anchorage-woman-charged-boyfriends-fatal-shooting) \n57. [Woman stabs and kills boyfriend over finances](https://href.li/?http://www.news-journalonline.com/article/20100813/ARTICLES/308139998) \n58. [Woman stabs and kills boyfriend’s lizard because she thought he was flirting with other women ](https://href.li/?http://www.sfexaminer.com/sanfrancisco/heartsick-san-carlos-woman-kills-boyfriends-pet-lizard-allegedly-threatens-suicide/Content?oid=2179731)\n59. [Woman shoots, kills boyfriend who wanted to end their relationship and urged her to get an abortion ](https://href.li/?http://www.nydailynews.com/archives/news/judge-lets-pull-back-guilty-plea-slaying-article-1.500266)\n60. [Woman attempts to murder husband with poison in her vagina](https://href.li/?http://www.huffingtonpost.co.uk/2013/01/29/vagina-murder-plot-brazilian-man-wife-poisoning-_n_2572836.html?utm_hp_ref=uk)\n61. [Woman stabs boyfriend to death after he slaps daughter](https://href.li/?http://articles.baltimoresun.com/1995-03-07/news/1995066110_1_kogan-gordon-stabbing)\n62. [Woman conspires to have secret lover murder her husband](https://href.li/?http://www.abc.net.au/news/2011-11-28/wife-jailed-for-conspiring-to-kill-husband/3699134)\n63. [Woman stabs, kills boyfriend over argument on Labor Day](https://href.li/?http://www.sltrib.com/sltrib/news/57997809-78/nguyen-child-witnesses-stabbing.html.csp?page=1)\n64. [Woman stabs boyfriend in the chest over argument](https://href.li/?http://www.nydailynews.com/news/crime/woman-won-ochocinco-show-stabbed-boyfriend-police-article-1.1810700) \n65. [Woman stabs boyfriend to death after finding photos of other women on cell phone](https://href.li/?http://www.pjstar.com/x1456178748/Woman-indicted-in-stabbing-death-of-her-boyfriend) \n66. [Woman tortured ex-boyfriend’s dog until it died after argument](https://href.li/?http://www.nbc15.com/news/state/headlines/Woman-accused-of-strangling-boyfriends-dog-232054331.html) \n67. [Woman stabs boyfriend in his chest and through his lung, nearly killing him](https://href.li/?http://www.nydailynews.com/new-york/nyc-crime/woman-convicted-attempted-murder-boyfriend-stabbing-article-1.1524639) \n68. [Woman fatally stabs boyfriend during heated argument](https://href.li/?http://www.boston.com/news/local/massachusetts/articles/2012/09/12/worcester_woman_pleads_guilty_to_killing_boyfriend/) \n69. [Woman kills her boyfriend with blunt force trauma to the head using frying pan](https://href.li/?http://abc30.com/archive/8781340/)\n70. [Woman stabs boyfriend to death for drinking her beer ](https://href.li/?http://articles.chicagotribune.com/2008-08-08/news/0808071113_1_boyfriend-beer-stabbing)\n71. [Woman strangles boyfriend to death during argument](https://href.li/?http://www.latimes.com/wxin-woman-strangled-boyfriend-police-woman-strangled-boyfriend-to-death-during-argument-20111028-column.html) \n72. [Woman stabs boyfriend with serrated knife over argument](https://href.li/?http://articles.philly.com/2003-09-30/news/25458352_1_steak-knife-boardinghouse-norristown-woman) \n73. [Woman shoots, murders boyfriend while she was on house arrest for another murder 11 years prior](https://href.li/?http://www.fox19.com/story/19448302/deputies-woman-kills-boyfriend-on-home-detention-for-murder-read-more-httpwwwwyff4comnewslocal-newsspartanburg-cherokee-newsdeputies-woman-kills) \n74. [Woman stabs, kills boyfriend then texts friend about eating the body ](https://href.li/?http://www.dailytelegraph.com.au/news/nsw/tamie-melehan-stabbed-boyfriend-david-vaughan-and-sent-text-message-that-she-was-going-to-eat-the-body/story-e6freuzi-1225843849086)\n75. [Woman stabs, kills boyfriend over dispute](https://href.li/?http://www.ocregister.com/articles/castillo-341590-foster-time.html) \n76. [Woman shoots boyfriend in the head, suspecting he was cheating](https://href.li/?http://articles.sun-sentinel.com/2013-01-23/news/fl-sunrise-attempted-murder-20130123_1_boyfriend-sunrise-police-report-broward-health-medical-center) \n77. [Woman shoots man in the groin after argument ](https://href.li/?http://www.myfoxal.com/story/19628629/man-sent-to-the-hospital-after-girlfriend-shoots-him-in-the-groin)\n78. [Woman fires handgun into the home of man who denied her a kiss](https://href.li/?http://www.thesmokinggun.com/documents/florida/woman-92-goes-ballistic-after-being-denied-kiss-874093) \n79. [Woman stabs husband to death over cheating fears](https://href.li/?http://nypost.com/2013/10/03/wife-stabs-husband-to-death-over-cheating-fears-police/) \n80. [Woman shoots, kills ex-boyfriend and his new girlfriend](https://href.li/?http://www.nydailynews.com/news/national/woman-kills-new-girlfriend-committing-suicide-cops-article-1.1787967) \n81. [Women kills husband, commits suicide ](https://href.li/?http://www.chron.com/news/houston-texas/houston/article/Woman-kills-husband-then-commits-suicide-5106696.php)\n82. [Woman shoots and kills man over argument](https://href.li/?http://detroit.cbslocal.com/2012/10/15/detroit-woman-charged-with-boyfriends-murder/) \n83. [Woman kills husband with baseball bat for talking back to her](https://href.li/?http://iactafool.com/80-year-old-woman-kills-husband-for-talking-smart/) \n84. [Woman kills husband, confesses to family then shoots herself ](https://href.li/?http://www.click2houston.com/news/hpd-wife-kills-huband-kills-herself-in-relatives-home/23723970)\n85. [Woman stabs boyfriend 31 times after he said ex’s name in his sleep](https://href.li/?http://shanghaiist.com/2013/09/27/woman_stabs_boyfriend_31_times_after_he_says_womans_name_in_sleep.php) \n86. [Woman shoots husband in the head, shoots herself ](https://href.li/?http://www.nola.com/crime/index.ssf/2012/01/metairie_woman_kills_husband_f.html)\n87. [Woman kills boyfriend over argument at house party](https://href.li/?http://www.mercurynews.com/ci_21830489/police-stockton-woman-kills-boyfriend-at-san-jose) \n88. [Woman shoots boyfriend with shotgun for texting another woman](https://href.li/?http://www.goupstate.com/article/20130521/ARTICLES/130529929) \n89. [Woman kills boyfriend because she “smelled sex on him”](https://href.li/?http://www.foxnews.com/us/2012/12/05/pennsylvania-woman-killed-boyfriend-after-smelled-sex-on-him-prosecutor-says/) \n90. [Woman runs over boyfriend, kills him](https://href.li/?http://www.kansas.com/2013/03/26/2733932/woman-sentenced-to-prison-for.html)\n91. [Woman stabs boyfriend in the eye for turning down threesome](https://href.li/?http://gawker.com/florida-woman-stabs-boyfriend-in-the-eye-for-turning-do-1443119495) \n92. [Woman stabs ex-boyfriend for refusing to stop playing the Eagles](https://href.li/?http://gawker.com/woman-stabs-roommate-for-refusing-to-stop-listening-to-1335462841) \n93. [Woman stabs boyfriend, throws out his prosthetic legs so he can’t chase her](https://href.li/?http://www.complex.com/city-guide/2013/03/south-carolina-woman-stabs-boyfriend-throws-out-prosthetic-legs-so-he-cant-chase-her) \n94. [Woman ties up, stabs husband 193 times, jury finds her guilty for suspicion of trying to claim life insurance ](https://href.li/?http://abcnews.go.com/GMA/story?id=127995)\n95. [Woman stabs fiance for refusing to take her to the liquor store](https://href.li/?http://blog.chron.com/hottopics/2014/02/police-florida-woman-stabs-fiance-after-he-rejects-liquor-store-trip/) \n96. [Woman assaults and threatens boyfriend with knife for not cuddling](https://href.li/?http://www.dailymail.co.uk/news/article-2548417/Florida-woman-pulled-knife-boyfriend-refused-CUDDLE-not-face-criminal-charges.html) \n97. [Woman stabs man with ceramic squirrel for not bring home beer](https://href.li/?http://www.lipstickalley.com/showthread.php?p=15644161) \n98. [Woman stabs taxi driver after he refuses to have sex with her](https://href.li/?http://www.dailymail.co.uk/news/article-2600488/Sex-crazed-Angelina-Jolie-lookalike-given-suspended-sentence-forcing-taxi-driver-sex-twice-stabbing-not-manage-time.html) \n99. [Woman stabs ex-boyfriend in his penis after discovering he had a new girlfriend](https://href.li/?http://www.dailymail.co.uk/news/article-1277118/Jilted-lover-stabbed-ex-lover-manhood-drove-home.html)\n100. [Woman stabs boyfriend twice over time he spent in bathroom](https://href.li/?http://www.naplesnews.com/news/2011/may/22/immokalee-woman-stabs-boyfriend-twice-over-his-tim/?partner=popular) \n101. [Woman stabs boyfriend over Facebook post](https://href.li/?http://www.examiner.com/article/texas-woman-stabs-husband-over-something-she-read-on-facebooks-drugs-involved) \n102. [Woman stabs her boyfriend several times because his dog ate her marijuana stash ](https://href.li/?http://www.dailymail.co.uk/news/article-2473153/Shadae-Scott-Model-stabbed-boyfriend-dog-ate-stash-marijuana.html)\n103. [Woman stabs boyfriend for not calling her every two hours](https://href.li/?http://www.dailymail.co.uk/news/article-2505127/Rhiann-Burnie-21-stabbed-boyfriend-ringing-hours.html) \n104. [Woman shoots man five times for rejecting her, kills herself](https://href.li/?http://archive.wltx.com/news/story.aspx?storyid=53403) \n105. [Woman murders ex-boyfriend with liquor laced with poison, was jealous he was engaged to new woman](https://href.li/?http://abcnews.go.com/2020/jealous-woman-20-years-jagermeister-murder/story?id=19546701) \n\n[**Comedian Phil Hartman was murdered by his wife on May 27th 1998**](https://href.li/?http://www.cnn.com/SHOWBIZ/TV/9805/28/hartman/)\n\n[**NFL player Steve McNair was murdered by his girlfriend on July 4th, 2009**](https://href.li/?http://en.wikipedia.org/wiki/Steve_McNair#Death)\n\n[**John Wayne Bobbitt had his penis cut completely off on June 23rd, 1993**](https://href.li/?http://en.wikipedia.org/wiki/John_Bobbitt_(penile_amputee)#Incident)\n\n[**Travis Alexander was murdered by Jodi Arias on June 4th, 2008**](https://href.li/?http://en.wikipedia.org/wiki/Murder_of_Travis_Alexander#Death)\n\n[**Andrew Bagby was murdered by Shirley Jane Turner on November 6th, 2001**](https://href.li/?http://en.wikipedia.org/wiki/Murder_of_Zachary_Turner#Bagby_murder_and_investigation) **(**[**She later murdered their 1 year-old son on August 18th, 2003**](https://href.li/?http://en.wikipedia.org/wiki/Murder_of_Zachary_Turner#The_murder-suicide)**)**\n\n[**Brenda Spencer killed two and injured nine at Cleveland Elementary School on January 29th, 1979**](https://href.li/?http://en.wikipedia.org/wiki/Cleveland_Elementary_School_Shooting_(San_Diego)#Shooting)\n\n[**Laurie Dann killed one boy and injured five others at Hubbard Woods Elementary School on May 20th, 1988**](https://href.li/?http://en.wikipedia.org/wiki/Laurie_Dann#Attacks)\n\n[**Jennifer San Marco killed eight people at Goleta postal facility on January 30th, 2006**](https://href.li/?http://en.wikipedia.org/wiki/Jennifer_San_Marco)\n\n[**Sylvia Seegrist killed three and injured seven during a shooting spree at a Springfield mall on October 30th, 1985**](https://href.li/?http://en.wikipedia.org/wiki/Sylvia_Seegrist)\n\n[**Mary Ann Holder killed five children including her own son in Pleasent Gardens, NC on November 20th, 2011**](https://href.li/?http://murderpedia.org/female.H/h/holder-mary-ann.htm)\n\n[**Jullian Robbins killed one and injured two at Penn State on September 17th, 1997**](https://href.li/?http://en.wikipedia.org/wiki/Hetzel_Union_Building_shooting#1996_Shooting)\n\n[**Heather Smith killed two then committed suicide at Spanaway Junior High School on November 26th, 1985**](https://href.li/?http://www.apnewsarchive.com/1985/Distraught-Over-Losing-Boyfriend-Girl-Kills-Two-Then-Herself/id-075d33aa6600d2e6b30d969ba3edaf0d)\n\n[**Latina Williams killed two others then self at Louisiana Technical College on February 8th, 2008**](https://href.li/?http://en.wikipedia.org/wiki/Louisiana_Technical_College#2008_shooting)\n\n[**Amy Bishop Anderson killed three and wounded three others at the University of Alabama on February 12th, 2010**](https://href.li/?http://en.wikipedia.org/wiki/2010_University_of_Alabama_in_Huntsville_shooting#Shooter)\n\nWhat’s most interesting though is that mainstream media [doesn’t even mention female shooters](https://href.li/?http://www.nydailynews.com/news/national/mass-shootings-central-american-history-article-1.1457514) when they claim to show the history of the crime — but I guess they’re going by high scores. While its true that most shooting sprees are committed by males, it is also true[that most child abuse, neglect, and murders are committed by females](https://href.li/?http://archive.acf.hhs.gov/programs/cb/pubs/cm09/cm09.pdf).\n\nWomen who killed or attempted to kill children in the news, past 30 days (US):\n\n1. [Florida woman shoots, kills her 2 teenage sons](https://href.li/?http://guardianlv.com/2014/05/florida-woman-allegedly-kills-her-teenage-children-because-they-were-really-mean/) \n2. [Mother throws 1 year-old daughter under truck, kills her](https://href.li/?http://hollywoodlife.com/2014/04/30/chinese-woman-throws-baby-under-moving-truck-kills-daughter-hu-chen/) \n3. [California mom stabs her 3 daughters to death. all under 2 years old](https://href.li/?http://www.nydailynews.com/news/crime/3-girls-found-dead-calif-home-mom-arrested-cops-article-1.1800154)\n4. [Mother attempts to kill her 3 teenage children](https://href.li/?http://www.myfoxphilly.com/story/25266213/mother-charged-with-trying-to-kill-her-three-teenagers) \n5. [Mother kills her infant son by stabbing him to death](https://href.li/?http://www.nbcbayarea.com/news/local/Livermore-Woman-Accused-of-Killing-Child-at-Park-256858241.html) \n6. [Woman kills 2 year-old girl, attempts to kill 10 year-old boy](https://href.li/?http://www.cbs12.com/news/top-stories/stories/jupiter-woman-kills-exdomestic-partners2yearold-daughter-attempted-murdersuicide-16264.shtml?wap=0&?hot=1) \n7. [Utah mom murders 6 newborns, keeps them in garage](https://href.li/?http://www.nydailynews.com/news/crime/utah-mom-killed-newborns-couldn-remember-dead-babies-garage-police-article-1.1777762) \n8. [Mother charged with trying to suffocate daughter](https://href.li/?http://chicago.cbslocal.com/2014/04/29/mother-charged-with-trying-to-suffocate-daughter/) \n9. [Woman charged for killing 8-month old baby](https://href.li/?http://www.thenewstribune.com/2014/04/30/3173379/tacoma-woman-charged-in-death.html) \n\nWomen who killed or attempted to kill children in the news between January and April 2014 (US):\n\n1. [Mother drowns both of her sons aged 3 and 6](https://href.li/?http://www.nydailynews.com/news/national/child-left-brain-dead-mom-drowning-attempt-dies-article-1.1747035) \n2. [Mother attempts to drown her 3 children in ocean](https://href.li/?http://www.foxnews.com/us/2014/03/07/kids-rescued-from-ocean-said-mom-tried-to-killed-us-sc-woman-charged-with/) \n3. [Utah mother shoots and kills two teen daughters, then herself](https://href.li/?http://www.nydailynews.com/news/crime/utah-mom-shoots-kills-young-daughters-article-1.1581034) \n4. [Mother suffocates 14 month old son, fails at attempted suicide](https://href.li/?http://fox6now.com/2014/03/11/woman-charged-following-death-of-14-month-old-son/) \n5. [Woman babysitter murders 19 month old boy](https://href.li/?http://www.wfsb.com/story/24589635/parents-of-baby-allegedly-killed-by-babysitter-arrested) \n6. [Mom kills 7 month old daughter, blames Jesus](https://href.li/?http://www.huffingtonpost.com/2014/03/10/stefany-paige-johnson_n_4937447.html) \n7. [Woman operating illegal daycare responsible for 3 month old girl’s death, police find 14 children in her basement](https://href.li/?http://www.huffingtonpost.com/2014/03/11/pamela-wood-baby-death-daycare_n_4943063.html) \n8. [Mom strangles 3 day old baby boy, discarded body in trashcan](https://href.li/?http://www.mysanantonio.com/news/local/article/Mom-said-she-strangled-newborn-watched-him-die-5144862.php) \n9. [Woman suffocates 2 year old girl of fiance, fakes sexual assault by unknown assailant to cover tracks](https://href.li/?http://www.nbcdfw.com/news/local/Plano-Police-Make-Arrest-in-2-Year-Olds-Death-242496231.html) \n10. [Mother charged with killing 2 year-old daughter](https://t.umblr.com/redirect?z=http%3A%2F%2Fwww.nytimes.com%2F2014%2F02%2F06%2Fnyregion%2Fwoman-is-charged-in-killing-of-daughter-2.html%3F_r%3D0&t=YzMwZjRkNDNhMTUxNDcyNTMyZGY5MWE2NGZhYzkyOTQ0MzFmMGE3Yiw3OGQ0NWRkYzJlNzg2NTJjY2ExOGIxODM2NDk0ZWUwNzQ4ODdmNTM1&ts=1619557860) \n11. [Mother of several children with history of violence murdered and buried 2 year-old daughter in shallow grave](https://href.li/?http://www.wesh.com/news/central-florida/seminole-county/sanford-police-arrest-rachel-fryer-for-homicide-in-death-of-buried-toddler-taraji-gordon/24697228) \n12. [Mother stabs and kills her 2 children in exorcism](https://href.li/?http://www.cnn.com/2014/01/19/justice/maryland-exorcism-deaths/) \n13. [Mother kills her teen son and daughter, self](https://href.li/?http://www.cnn.com/2014/01/15/us/florida-mother-double-murder-suicide/) \n14. [Mother confesses to killing 10 year-old son](https://href.li/?http://crimeblog.dallasnews.com/2014/01/frisco-police-take-custody-of-mother-in-connection-with-10-year-olds-death.html/) \n15. [Mother tortures and kills 3 year-old son, burned genitals with lighter](https://href.li/?http://miami.cbslocal.com/2014/01/24/autopsy-released-of-3-year-old-found-dead-in-mothers-home/) \n\nThis is only mid-year and I didn’t even include the reports of mothers killing their children from previous years or other countries.”\n\nWhat the fuck is all this then?",
    "title": "Apparently \"Women don't kill men!\"",
    "subreddit": "MensRights",
    "timestamp": 1619559673,
    "score": 300,
    "keyword": "chinese manager"
  },
  {
    "text": "Government report in the state of NSW, Australia recommends universities be banned from running kangaroo courts for sexual misconduct accusations >Kangaroo courts presiding over sexual assault cases at universities will be axed while tertiary finances will be overseen by the NSW Auditor General under a new plan to fix the state’s struggling university sector.  \n>  \n>A NSW Legislative Education Committee report released on Friday also proposed legislating free speech protections and suggested universities become less dependent on international students.  \n>  \n>Committee Chair Mark Latham said while the state’s universities were federally funded there were laws NSW Parliament could pass to force them to meet community ­expectations.  \n>  \n>“NSW universities must ­respect the presumption of innocence and not create their own ‘Kangaroo Court’ and tribunal processes that circumvent the rules and standards of natural justice established at law by the NSW Parliament,” the report noted.  \n>  \n>University students accused of sexual harassment on campus can face extrajudicial proceedings where a panel comprised of staff and students decide if they are guilty and choose punishments including suspension and expulsion.  \n>  \n>At the University of Technology, the student rule book states: “A University Student Conduct Committee is not bound by the rules of evidence and may inform itself on any matter it thinks fit consistent with (procedural fairness).”  \n>  \n>Today’s report however found those matters were best dealt with by the courts.  \n>  \n>“The Committee considers it is critically important for universities to uphold Australia’s democratic values and follow the processes of the NSW criminal justice system,” it said.  \n>  \n>It also recommended legislating the right to free speech in NSW legislation by creating statutes to protect it.  \n>  \n>Mr Latham said: “In evidence, some inquiry participants spoke of the infringe­ment of freedom of speech on campuses and the use by universities of internal disciplinary systems to make deter­minations on alleged criminal behaviours.”  \n>  \n>Legislating free speech at universities into law has the support of University of NSW Conservative Club president Sam Jacobs, who said across the state university chiefs turned a blind eye to the agg­ression and harassment of conservative voices on campus. “An accurate way to des­cribe how universities operate is that you have organised left wing radicals and they engage in targeted harassment and violate the rights of conservative students and universities fail to punish (students),” he said.  \n>  \n>“There is an obvious and apparent decision to unfairly apply their charter of student conduct and our goal is to pressure the universities to apply it equally so all students can be afforded protections under the charter.”  \n>  \n>The report, which will be presented to the government today, also recommended that the auditor general play a bigger role in overseeing campus finances in a bid to make them less dependent on internat­ional student fees.  \n>  \n>The report said at the University of Sydney and UNSW, Chinese student income accounted for nearly 30 per cent of their overall revenue.  \n>  \n>“Naive reliance on Chinese student income and the goodwill of the current Chinese regime are not likely to end well. Financial diversification and risk management have become imperative for the sound finances and sustainability of our universities,” it said.\n\nArticle behind a paywall:\n\n[https://www.dailytelegraph.com.au/news/nsw/report-recommends-nsw-unis-fix-international-student-sexual-assault-issues/news-story/0c5c8d7bac0c5714070cbe58effea829](https://www.dailytelegraph.com.au/news/nsw/report-recommends-nsw-unis-fix-international-student-sexual-assault-issues/news-story/0c5c8d7bac0c5714070cbe58effea829)",
    "title": "Government report in the state of NSW, Australia recommends universities be banned from running kangaroo courts for sexual misconduct accusations",
    "subreddit": "MensRights",
    "timestamp": 1611408142,
    "score": 52,
    "keyword": "chinese manager"
  }
]