[
  {
    "text": "How to repatriate back to the US? I've been living in China for the past 10 years or so. I have what I believe to be a really solid skill set including an MS in economics, fluent Chinese, military background, lots of business experience among other things. For the right position, and I know they are out there, I would be a really good fit.\n\nI think though that my location is holding me back. I apply for jobs online and don't hear back, in large part I think, because I am halfway around the world.\n\nI don't have many contacts in industries I would like to work in. My support network is also not too close to the locations I think would be best for finding suitable work.\n\nI don't want to move back without having at least gone through some interviews. Nor do I want to leave my wife for an extended period of time and have her responsible for packing up and moving to a foreign (to her) country if I leave first.\n\nHow should I approach this situation? Is there anything I put in the cover letter to ensure HR and hiring managers understand my situation? What else might I try or consider?",
    "title": "How to repatriate back to the US?",
    "subreddit": "jobs",
    "timestamp": 1488517240,
    "score": 7,
    "keyword": "chinese manager"
  },
  {
    "text": "Advice needed for some near-future options for a debt-saddled humanities major I've been doing a lot of search the past month about finance, student loans, and career choices but I'm needing some advice for my situation. \nI posted this in r/personalfinance but outside of one helpful comment didn't get too much out of it. \n\n*Basic Information*   \n22M, just graduated from a private liberal arts college in the Midwest, BA in Religion (Yes, I know. They sold me well on the \"just get a degree doing what interests you\"). $47.4K in student loans (All federal, minimum 10yr monthly = ~$500). No other debt. I have worked for the college's IT Dept. all four years and while not doing much I have done basic installations and data entry for inventory. Outside of that I have helped teach martial arts to kids (ages 4-15) and adults for ~6 years as well as teach general P.E. to friends and relatives (programming, nutrition, form, etc.).\n\n*Next Year*   \nI am moving to Madrid, Spain to teach English from Oct.-June. Pay is enough to live like a student but not really save up anything significant. I have the option to do a renewal after my first year. I am semi-fluent in Spanish right now and am planning on being fully fluent by the end of the first year.\n\n*Future Time*   \nAfter that program my plan is to teach English in China because the benefits are great and COL so low that I can throw $1000-2000 a month towards my student loans while living a fairly middle-class lifestyle. The thing is to completely pay off my loans it would take anywhere from 2-4 years. In that time there is a possibility for me to move up to a middle management position in schools (recruiting/training teachers, making schedules, coordinating between Chinese and foreign teachers) This means that I will essentially be out of the job market for 4-6 years will minimal experience outside of Spanish and/or Mandarin Chinese and some foreign management skills.\n\n*Questions*   \n1. Is it wiser for my career prospects to do 1 or 2 years in Spain and then return to the US to start entering into the workforce?\n2. From everything that I've seen teaching English abroad is seen as a joke by employers for anything more than 2 years postgrad. How would doing that for essentially 2-6 years look to employers? I don't really want to be a guy close to 30 working entry level because I've been \"bumming it\" across the world.\n3. Would it be better to go to Spain, return home and work a real job for a couple years, and then go to Asia to pay off significant chunks of my debt?\n4. I would ideally like to move to a larger city than where I am now (~225,000 pop.). I know first jobs suck but how could I leverage my skills to make, let's say, $45K salary after 2-3 years? I don't have an interest in learning coding/programming.\n\n*Last Part*   \nAny help is appreciated. Really, my only expectations out of my career is to give me a comfortable salary to save for retirement and allow me to live my generally frugal life.\nSorry if I sound like an entitled millennial, I'm not opposed to working hard at all. Just trying to live smarter not harder.",
    "title": "Advice needed for some near-future options for a debt-saddled humanities major",
    "subreddit": "jobs",
    "timestamp": 1499740644,
    "score": 7,
    "keyword": "chinese manager"
  },
  {
    "text": "How can I prevent asking for a job turning into something embarrassing? Hi,\n\n\nI'm 15 and I seek a job because I am really eager to have one. All my friends do paper rounds and they're all taken up in my area so I'm going to ask in two pubs just over the road from me for a job kitchen porting (or perhaps a job that involves my skills in the Chinese and Georgian languages).\n\n\nI'm really worried that I will ask for the manager, he will deny me, and I will have wasted his time. What can I do? Am I even just allowed to walk in, request the manager, and ask if there're any vacancies available?",
    "title": "How can I prevent asking for a job turning into something embarrassing?",
    "subreddit": "jobs",
    "timestamp": 1509378504,
    "score": 7,
    "keyword": "chinese manager"
  },
  {
    "text": "A little bit concerned I know there's nothing you can do but just wanted to share it with you.\n\nI'm living in China since one year ago. One month ago I had an interview with another company based here and I said yes after getting a better offer in all possible ways, career growth, vacations, salary, etc.\n\nI gave my one month notice period to my current company and the days started counting. I'm supposed to start with them next Tuesday.\n\nAt the beginning the HR team of my new company was super friendly, answering my emails really quick and helping me with everything, but these last two weeks things have changed, they are not answering my emails unless I ask the same thing three times, they are being very vague about the visa process and we are running out of time.\n\nThe thing is Chinese visa policies changed, so now I need to do a lot of paperwork in my home country. They are supposed to pay for everything but once I told them the price they haven't answered at all. This was three days ago and I just have one month to do everything.\n\nHopefully, my current company is super nice so they would not cancel my work visa until next month so it can give me more time.\n\nI'm just concerned how quickly the HR team changed completely their behavior towards me, and of course, it started to raise some red flags about the company.\n\nI can't talk with my new manager because I haven't been informed at all who I would answer to or who are going to be my coworkers, so my only contact with my new company is the HR girl who's not answering anymore, and the recruiter who found my profile is on vacations.\n\nI don't even know at what time am I supposed to arrive on Tuesday, who is going to receive me at the office, or what should I do at all.\n\nJust wanted to vent a little bit, I'm concerned. What do you think?\n\n**TL;DR** New company was super friendly and helpful at the beginning, now they are not answering emails and I'm supposed to start on Tuesday. This is raising some red flags.",
    "title": "A little bit concerned",
    "subreddit": "jobs",
    "timestamp": 1500615473,
    "score": 3,
    "keyword": "chinese manager"
  },
  {
    "text": "Received a job offer to teach English in China, how do I negotiate salary? Some background info: Going to teach English in China is one of the things I've been dead set on doing since I've heard about it like a decade ago, so I really do want to try my best to take this offer. However, the offer they made me is a bit low and I'm not sure how to negotiate.  \nI graduated in June of last year and grabbed the first job offer that was thrown my way. It's in the real estate industry and I really don't have an interest in doing this in the long run, but I don't hate it. Overall, I am making a pretty good amount of money for something entry level; however, it has nothing to do with my degree and I myself have no idea what I want to do in the long run. \n\n\n\nThe job will be a contract for a year, and these are the benefits they offer:\n\n* Company sponsored flight to China with transportation from airport to residence   \n* Company sponsored lodging in comfortable and conveniently located apartments for program duration (not including utilities/internet)   \n* TEFL Certification  \n* Free Chinese & Mandarin tutoring through our company partner  \n* Company sponsored coverage with a Chinese healthcare plan  \n* Time off for Chinese national holidays (detailed in contract)  \n* 2 weeks paid vacation and sick leave time besides holiday allowances  \n* Guaranteed year-end raises for qualified individuals renewing their contracts  \n* Airfare coverage for a 2-week home visit between each contract year (1/2 of total airfare for first year, complete coverage for second/each consecutive year)   \nEverything sounds pretty amazing, but I think it is also pretty standard for most of the job offers that have this premise of teaching in China. \n\n\n\nThis is why I haven't accepted the offer yet:   \nThe pay they offered me is really low. It is approximately $1,200.00 USD pretax, monthly. Despite the lower cost of living, I do still have student loans to pay off, and as I am currently making a substantial amount over this, I'm a bit worried as to how much money I'll be able to save. I'm also not to sure what the tax rate is, if someone could send me a helpful link that would be great.  \nI am also talking to a couple of other companies, but they haven't given me offers yet. I'm still in the preliminary stage of the interview process with them, but this company threw an offer my way and I don't know if they'll retract it if I take too long to respond.  \n\nAny advice would be greatly appreciated!\n\n\n\n**Edit:** I should add that I do speak Chinese, I am of Chinese descent. Part of the reason I'm making a good amount in my entry-level position is because I do speak two dialects of Chinese in a very Chinese-centric market and am able to communicate with clients in the absence of my managers. The reason I didn't put this in initially is because the company I am talking to said they prefer the teachers not use Chinese in the classroom and with the parent because they didn't want parents thinking they were pulling teachers from other parts of China.",
    "title": "Received a job offer to teach English in China, how do I negotiate salary?",
    "subreddit": "jobs",
    "timestamp": 1510691153,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Can I Rely On My Current Role / End of Probation Negotiation Methods? (Software Development / UK Based) Hi all,\n\nI am in the UK and work as an iOS developer in a small sized tech business (not a startup).\n\nI took the job as my first software dev job having worked in marketing, the job was offering 25-30k so i said 25k as i wanted the experience and opportunity to get into the industry.\n\nSince then ive found the job to be not exactly what was promised, im the sole iOS developer when i was told id have a team, the CEO/Line manager who hired me hasnt spoken to me since my first day nearly 2 months ago and stays in his office.\n\nThe company isnt really making much money but has chinese money backing it which keeps it afloat, the management are totally incompetent but are paid highly despite doing no work and some are known to do their own companies work on company time...\n\nI work on the codebase for the iOS app alone, no guidance, no checks, totally solo. However I have removed all the crashes, fixed the bugs, rolled out several new features, and am working on a major user requested feature currently which I hope to complete before the end of probation.\n\nMy thoughts are that im not sure the companies intention, would they likely keep me on as im the only dev for iOS? its not a core part of their business (they make other hardware and iOS is the remote for it), further to this if i am offered the role fully, i really wanted to negotiate more money for the risk of working there.\n\nBased on what ive achieved and how i am not part of a team as promised, i was hoping to at least get the 30k allocated to the role when i started, and ideally, push for 34k as i want to be getting 2k a month post tax.\n\nI am 26 and wanted to move out so the salary and job security are important for me to progress my life. However i wasn't sure how to handle negotiation post probation, how can i approach the salary and should i be looking for job prospects elsewhere if they say no? The CEO is asian and the business operates in a pretty asian style.\n\nI can provide any further background needed, ive tried to be thorough, i just want to make sure i approach this correctly to achieve what I want in the best method!\n\nAppreciate time and help on this matter.",
    "title": "Can I Rely On My Current Role / End of Probation Negotiation Methods? (Software Development / UK Based)",
    "subreddit": "jobs",
    "timestamp": 1496073804,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "I finally called a man out on the bus for touching me So I've always been a somewhat shy girl. I live in a big city where buses can get pretty crowded because of either rush hour or just nearby schools getting let out. Cool. I understand crowded buses; we all gotta get where we're going after all. But what I can't understand is why some men feel the need to take advantage of crowds to feel up other people's bodies.\n\nThe first time I was inappropriately touched was in 8th grade.  \n\nIt was a really crowded bus as the middle school I went to was near other schools that happened to get out at the same time. The bus stopped at one of the main bus station so naturally, many people got off and there was a lot of bustling as half the bus fought their way to the door. I thought nothing of it until I felt someone's fingers roughly shove their way into my crotch from behind. By the time I had turned around, the person was lost in the wave of people getting off. I was literally the shyest I have ever been in my life at that time (was voted the shyest girl in the school that year actually) and so I never said anything to anyone.\n\nThe second time was on yet another crowded bus, a couple years into high school. This old Chinese man was holding onto my upper arm from behind which I was using to hold onto a strap above for balance and I thought it was a little weird but just assumed that he had nothing else to hold onto for balance so I shrugged it off as nothing. At least, until his hand reached down and started grasping at my right boob. Luckily, I was with my best friend this time who had gotten a hold of a seat and squeezed me in with her. The man got off at the next stop. We said nothing except for a few comments of disgust.\n\nThe third time, which happened a year later, didn't really involve me being touched sexually but was more creepy than anything. I was boarding a the bus with the same friend and as I stepped on, I could feel a guy pressed up close behind me. I thought this was very strange as the bus wasn't anywhere near crowded enough to justify that and the man kept this up as we got on until my friend and I were standing holding onto straps for support as we chatted. Now at this point the man had backed off a little, just enough that he was still there but not enough for anyone to go wtf at him. My friend and I were talking quietly about something about which stop to get off at, the man swaying with the bus to casually make contact with my back the whole time. Keep in mind this bus is not crowded by any means; my friend and I had chosen to stand because our stop was nearby. As we got off, the man made a remark, breaking into our conversation about something we were discussing. I later complained about this to another friend and halfway into describing the man, she quickly cut me off and finished the description for me. Apparently the man was hanging out near a mall next to a highschool and had been coming up to highschool girls and trying to give them his number. This was a young blond male in his 20s(?).\n\nA couple hours ago, I was riding the bus home from my old highschool where I was visiting a retiring teacher. It was an extremely crowded bus because the same line ran though at least a couple schools and a few stops away from where I was supposed to get off, I gave up my seat for an elderly man and started standing by the rear exit. Not a minute later, I felt fingers stroking my left butt cheek. I thought it was my imagination at first so I shrugged slightly away only to feel the fingers return. I was 100% sure those weren't some stray bag at that point; those were human fingers stroking from my lower to upper butt. \n\nI was done. I'd gained confidence in highschool thanks to mentioned teacher and I was sick and tired of being touched. I've gotten nothing but trouble from guys in college who just can't take a damn hint. I was called a bitch for not giving them a chance (I have a boyfriend) so I did what I felt was right. I called him out on it.\n\nI turned to him, looked the middle age blond man straight in those sky blue eyes of his and said in the loudest voice I could manage, \"Touch my butt one more time and I will report you.\" I knew I had the right man. He met my gaze unblinkingly and slowly nodded. No one seemed to have paid attention or cared. But at that moment, I was relieved.\n\nWhen I got off, I found out that my sister was on the same bus and had squeezed onto the front of the bus. If she had gotten on the back door, my little sister could have been in my position instead. She could have been the one touched instead of me. And I know she wouldn't have said a thing.\n\nI know this isn't a big deal to many people but I had to get it out somewhere. Thank you for reading.\n\nTL;DR Guy kept stroking my butt, I called him out on it, and my little sister could have been his victim instead of me if she had gotten on the back door instead of front.\n\nEdit: Ahh thank you! I honestly only expected a few upvotes and a comment or two perhaps so I was honestly surprised when I came back... And only one nasty PM to boot! Thank you so much! \n\nEdit 2: Holy...thank you for the gold! I had to refresh twice because I couldn't believe my eyes... Thank you!\n\nEdit 3: To those wondering, seeing something like this happen and speaking up to either the culprit or just getting attention to that happening would be amazing. Silence is not golden in this case.",
    "title": "I finally called a man out on the bus for touching me",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1495577927,
    "score": 27539,
    "keyword": "chinese manager"
  },
  {
    "text": "What job should I look for next with 5 years sales experience while I finish my degree? Hey guys, basically I am a college senior but I will need another year and a half to graduate because I have held a full time job my entire university career.\n\nMy background is mainly in bicycles. I have worked at three different bicycle stores in my life and have done everything from box boy, sales associate, assistant manager and there was a brief period of me managing while they found a suitable replacement.\n\nMy other experiences are teaching in camps and centers for children and working as an English teacher in China.\n\nMy strengths are for sure sales and just communicating with people in general. I have been told they like having me around and I bring a positive vibe. I speak fluent Hungarian and am also intermediate level in Chinese. My current major is international business with minors in finance and mandarin.\n\nI was wondering what jobs I should look into and what companies you would recommend I apply for while I finish up university. I could go back to the bike shop but I feel I am not learning anything from that anymore. I have recently spent 6 months in China and will return in December, then I will start a job search for the spring. Any advice is appreciated.\n\nI was looking into being a car salesman because I thought that might play to my strengths and is kinda similar to bikes from what I have been told, but I dont know.\n\nLet me know what you think! Thanks!\n\nEdit: Super weird wording on my part. I currently live in China, and I will move back to New York in December to finish my university. Sorry about that.",
    "title": "What job should I look for next with 5 years sales experience while I finish my degree?",
    "subreddit": "careerguidance",
    "timestamp": 1509707446,
    "score": 3,
    "keyword": "chinese manager"
  },
  {
    "text": "29, How do I transition from China focused sales to a different sector? I'm 29, American, about 4 years work experience.\n\nBachelors in Political Science, Masters in East Asian Studies, both from decent state schools, top 50. Grades were decent, 3.33 undergrad, 3.87 graduate, though they could have been better. Full time work and studies don't go so well together. All my academic studies were geopolitical and financial system focused, with an emphasis on China.\n\nAs part of the bachelor's and master's degrees, I spent 2 academic years in China. Then worked there in the education marketing field for a British company for another 2 years. From this, plus the academics, I speak fluent Mandarin, and have a strong understanding of Chinese culture.\n\nI came back to the US, and used my small savings to start a company. It had initial interest from some investors, which spurred me to really give it some serious thought, but the investments fell through and I poured my savings into it thinking if one investor showed interest, another must be interested as well. Didn't work out that way.\n\nAfter that folded, I spent 6 months or so scraping by and applying for jobs constantly, and fell bassackwards into a position. Initially I thought it was a short term consulting role where the owner of a small manufacturer in the Chicago region wanted me to accompany him as a \"spy\" on a business trip to China with him. Things sort of escalated quickly and I took a full time role as the China regional manager for this smallish company out in the boonies south of Chicago. I told him that this wasn't what I was looking to do longterm from the outset, and agreed to help him reform his businesses China operations. I spent one year doing this, found new dealers, renegotiated the contracts, fired the deadweight, stopped the dirt, redid the Chinese marketing materials, and hired on some long term talent to take over and trained them up.\n\nAfter one year, I shifted over to a part time position, as sort of an on call consultant, in addition to whatever else might be needed, because I was going to go back to school for economics. I did not, sadly, get accepted to the programs I applied for. I applied for \"Ivy League\" level European Universities, because I already have a master's degree, and I don't think it makes a lot of sense to get a second unless it comes with the networking potential of a top tier school. Thus I'm in a pickle. I have a year before the next intake for schools, with no guarantee again that I would even get in. I have rent to pay, and zero interest in continuing in my current job.\n\nI've been doing China, nearly exclusively, for almost 10 years now, and I need to branch out. It's lost it's allure, I don't enjoy it. I want to get into financial consulting, or management consulting or geopolitical analysis, or even journalism, something that is more generalized. I don't have anything against doing something that involves China in some way, but I do not want to do it exclusively anymore. I've been applying for Business Analyst, Financial Consultant, Global Strategy Analyst, Risk Analyst these types of positions, through LinkedIn in the Chicago area for many months now. I haven't had any responses though, can't seem to get through the HR filter. The only interview I had was in October, for an exclusively China focused position in Washington, for $43k a year which I didn't take. I'm not sure where to go from here...",
    "title": "29, How do I transition from China focused sales to a different sector?",
    "subreddit": "careerguidance",
    "timestamp": 1497536182,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "My company is running an incredibly insecure production environment while holding millions of sensitive and personal documents. They will not listen to my consult on securing the system. What can I do? My company is running an incredibly insecure environment on a cloud platform and I have ethical concerns with the data security and how the systems are being (mis)managed. I am a senior plus level developer with complete access. I have brought these issues up with executives and management over the past 2 years, and nothing is being done. A few obvious risks our system contains:\n\n- All logins to the SQL database are stored in plain text. These SQL logins are full sysadmin. We have off shore development teams that know the login information because these logins are in nearly all of our configuration files, of which they have access to as they are able to RDC into the production servers and open them up. In fact, I've caught some of them using the logins in order to circumvent the limited access we have setup for their Windows credentials. The engineering director was aware of this when I caught this happening, and did nothing.\n- All Azure blob/Amazon S3 accounts and keys are stored in plain text. Again, these accounts and keys are stored in configuration files that can be accessed by more eyes than we probably even realize. These storage accounts contain sensitive and personal information/documents. All it takes is for a malicious individual to grab hold of the account and key, and press “Delete.” Active replication/geo-redundancy is not a thing here.\n- Windows Update has not been ran (including security patches) in over a year. I understand patching Windows Updates and ensuring application stability incurs additional resource time, but my company is not taking any efforts to implement proper procedure for patching the servers at a regular interval.\n- Our servers are open to the internet and are being brute forced as we speak. Proper Windows RDC 101 should be to require a VPN to access application servers, especially your SQL database servers. Instead, every single one of our servers is completely open to the internet. Anyone with a login is able to connect from any part of the world without a proper audit trail. This isn't even exclusive to our Windows Servers. We have Linux servers that have remote root login enabled, and is seeing endless failed login attempts. Each day there are roughly 40,000 failed attempts to every one of our servers, primarily from Chinese IPs that are directly linked to known botnets.\n\nMy company is not short of funds to hire proper system administrators, or an expert security consultant that will analyze our system and assist with its flaws, or allocate development time towards securing the system even at these most basic levels. However, they refuse and ignore my (and other's) pleas. They funnel resources into new development of new products that are over a year before being release worthy, all the while these items remain untouched and have been untouched for years.\n\nGiven the sensitivity of our data and the sphere in which we work with, I have great ethical concerns with how they are selling this product (especially considering our contracts have bogus \"security\" clauses that state we have robust \"intrusion detection systems\"). All it would take is for one person to become malicious with the database, storage account, etc., and hundreds of millions of incredibly sensitive/personal records would be leaked or lost.\n\nI have sent yet another plea today to my executives and management, but I am sure it will be met again with apathy. Has anyone faced this type of issue? I do not feel comfortable with how my company is handling system security, and I fear that it is only a matter of time before the system is compromised (assuming it isn't already.)\n\nWhat can I do?",
    "title": "My company is running an incredibly insecure production environment while holding millions of sensitive and personal documents. They will not listen to my consult on securing the system. What can I do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1488244931,
    "score": 233,
    "keyword": "chinese manager"
  },
  {
    "text": "Should I report about racial stereotypes that go too far? Please i need advice? Hello cscareerquestions. Longtime lurker and finally made an account to complain about my possibly shitty situation. I just want readers to keep in mind and tell me in the end if I’m overreacting or am I actually being mistreated. I really want to believe I’m overreacting and I feel like I’m going crazy over this. \n\nTL:DR: I’m currently facing some less innocent stereotype jokes by an employee and I don’t know whether or not I should let it go or not.\n\nSo I work in an IT department that has a software team under a Canadian (Toronto area) company that does research. I am myself a young male Canadian-born Chinese who recently started my career as a software developer. Most of the stereotypes I’ve witnessed upon myself are very innocent and I play along and genuinely laugh. However, I have this one senior lead (who is White and from a commonwealth country other than Canada) and overall he’s a great guy and a great leader. He sometimes likes to use stereotypes a bit too much. A good amount of them time are innocent and I’ll play along or just not respond at all if they’re a bit more on the offensive (ex. Looking at a bunch of resumes and seeing a common last name like ‘Patel’ and saying hey that’s (another employee’s) brother)\n\nHowever, this one thing really got under my skin and prompted me to come here looking for advice. He wanted to know my “real” name and was being very persistent. I politely told him my parents gave me my western name first but it wasn’t enough for him. He even went to get other people to nag me about it who thankfully didn’t want to participate. He proceeded to try hard to annunciate his wife’s (who is also a Canadian born Chinese) and laughed. He’s a pescatarian who loves animals and loves to comment on a lot of the times when I’m eating something with meat and has also made some comments about me being a meat eater and being Asian. I feel like his wife just lets him have free reign on stereotypes but he should know not to have the same amicability to everyone else. That is probably what plays a huge part in his own mind that he can use Chinese stereotypes so frequently. My perception of him now makes me think he likes to make everything about my culture a joke and has somewhat of a superiority complex over i\n\nI really want to keep this job and has great benefits and a great pension and the other people I work with are just splendid. However, my contract ends in August with a chance to go on Full time with the benefits after that. My manager (who is also white) is a great teacher and mentor to me and the only thing he has ever asked me about my background is ‘What is your ethnicity’. My manager and I really get along and he knows I do a good job.\n\n However, I don’t know whether if I should make a complaint about this senior lead to my manager because what if he sees this as a nuisance to deal with a workplace problem that is related to racial sensitivity? The senior lead and manager are close professionally but not sure personally so I don’t know how to approach this. All I can think about is that if I make this complaint, am I going to be looked at as a problem? What if letting me go after my contract is the easier thing to do because I made this complaint? Does this also make me look bad if I’m trying to apply for another job and I say I complained about because of racial discrimination?\n\nSorry for the long post!",
    "title": "Should I report about racial stereotypes that go too far? Please i need advice?",
    "subreddit": "cscareerquestions",
    "timestamp": 1489964345,
    "score": 32,
    "keyword": "chinese manager"
  },
  {
    "text": "As a new grad, how do I deal with learning a proprietary company-made JS framework with no documentation, and bad comments? I just can't seem to figure out the basics of this front-end JS framework that my company made over 10 years ago. It works really well actually (the output on the product looks pretty sleek). However, the code is a mess, there is no documentation. I can't even understand the lifecycle of the components. Javascript can be quite unstructured, and it seems like the guys who wrote this went crazy with this.\n\nThe second youngest guy on the team has been there for 3 years. I'm afraid that when it comes to reviews, I'm gonna REALLY behind compared to others, and it's gonna look bad on me. I ask a lot of questions, but it's funny/sad how questions are passed to more and more senior devs, because it's such a mess/lack of documentation/ idk what else.\n\nI hope this part of the rant is just me being paranoid. But my manager is Chinese, and almost all of the devs on my team are Chinese, and they usually talk among themselves in Chinese. Kinda makes me feel ostracized (esp since I'm a new grad and they're all experienced). I'm afraid that when it comes to reviews, or when someone needs to get shafted, it's gonna be me. \n\n\nHow do I proceed?\n\n\nEdit: I was inaccurate when I said there is no documentation. The documentation is a 2 hour long video with nothing on it but 6-8 slides and no code. And a dude talking about how cool the framework is. fuck that guy.",
    "title": "As a new grad, how do I deal with learning a proprietary company-made JS framework with no documentation, and bad comments?",
    "subreddit": "cscareerquestions",
    "timestamp": 1504487201,
    "score": 15,
    "keyword": "chinese manager"
  },
  {
    "text": "Second job out of college. Turns out I'm not as decent as I thought. Please help. Long story short, I killed it in my first job for 3 years and sailed into my second one about five months ago. I thought that, while I'm not a star programmer, I can get by.\n\n\nThis is a little long, but please at least skim it. Please, please help me.\n\n\nMy first job had a much smaller, less geographically-spread team. We used agile. Our code base was in decent shape. We had unit tests. We had documentation. Apparently this is enough to keep a shitty dev from imploding.\n\n\nMy second job is almost the exact opposite. It's getting out of control.\n\n\nFor example, I literally have no ability to test certain parts of our application. I can't explain why without ruining my anonymity, but it is literally impossible. I have tried everything I can think of. Even though I've told my manager this, I still get tossed problems on these parts of the stack. So I navigate blind. And fall flat on my face.\n\n\nIt doesn't help, either, that they have me all over the place, meaning I'm struggling to get acquainted with the more arcane parts of some of our apps. In particular, they like to throw me into a problem without (a) introducing it to me via a ticket or whatever, (b) explaining what they're trying to accomplish, (c) explaining what's not working, (d) telling me how to reproduce the problem, and (e) giving me time to get oriented. If I ask, they might send me a ticket and a link to an API call. Today was especially heinous, as the app they threw me on is one I've barely touched since I started and they wanted a fix a million years ago.\n\n\nThere are no tests anywhere. Our documentation is a mixture of Chinese and German. We have eight+ code bases, all of them in various states of disrepair. One of them continues to grow, with no one paying any mind to maintenance, and with some controllers you just scroll and scroll and scroll until your eyes glaze over. Then you have to start from the beginning again. Any attempts to clean this up is like shoveling shit against the tide. There are so many broken windows nobody cares anymore.\n\n\nSome of our codebases are so old they're practically legacy. Guess who's stuck completely rewriting one of them? Which would be great if it weren't for everything else I'm dealing with. I have a ton of things due at the end of the month and have barely touched any of them because it's always something. *There is always some kind of interruption, problem, explosion, etc.*\n\n\nThere are no iteration or planning meetings of any kind. Tickets pour in at a breakneck pace, are assigned to developers, and often fall into the abyss unless there's a deadline attached. And even then some tickets just. . . get forgotten.\n\n\nManagement is on the other side of the country. Half my team is about 100 miles north of me. The rest that's here at the office are on front end only and I do back end.\n\n\nWe are required to switch contexts so frequently and so quickly I swear to god I have whiplash. As soon as I get absorbed in *anything*, something else comes up. Trying to block out a couple hours of my time each day for these tasks and ignoring them otherwise does no good--my manager Slacks/emails me, or a coworker comes up to my cubicle.\n\n\nAll of the above puts me in a blind panic. I can work quickly, and I can learn even a crappy codebase, but not like this.\n\n\nThe only \"win\" I've gotten so far is rewriting a snarl of a small project to be more up to date with latest practices and technologies. I had to spend hours of out of work and on weekends to get it done and I'll have to spend *more* to deploy it. The last time I tried to deploy something during work hours, I botched it because people kept interrupting me. No amount of begging or pleading makes it stop.\n\n\nThis isn't an ideal working environment, obviously, but if I was a truly competent developer, I would find a way. I *want* to be a competent developer. I *want* to find a way. It's important to do so because we all know that this isn't even as bad as it gets!\n\n\nWhere in the world do I start to unravel this situation? Do you have any suggestions on how I might manage the chaos better? Changes to my work style that might be helpful? Anything to make this more bearable.",
    "title": "Second job out of college. Turns out I'm not as decent as I thought. Please help.",
    "subreddit": "cscareerquestions",
    "timestamp": 1486076022,
    "score": 5,
    "keyword": "chinese manager"
  },
  {
    "text": "Accounting Management Question Hello Reddit,\n\nI am a current accounting manager at a private firm that does about 150 million in revenue I am pretty young for my position and was told I by the boss that he is not seeing enough engagement with my direct team one of which is Chinese national whom I have a very hard time communicating or getting to do anything because she fears I might replace her with someone else, not really sure how to get this person to co-operate I get blown off with an “I am busy right now” whenever I try to engage. I was also told by my boss that he is thinking about potentially bringing on someone else at a director level to see how I felt about that and I said I was open for anything though this has me worried about my position I’ve only been here 3 months. There is a senior accountant that works with the company for 15 plus years and a lot of the team including myself look to this person for council if we are unsure about anything I can’t really get my team to look to me for leadership when this senior accountant is always the fallback resource. Any suggestions from my fellow accountants on what I should do or should I be concerned? I feel I might be out of a job in a month or two.",
    "title": "Accounting Management Question",
    "subreddit": "Accounting",
    "timestamp": 1504620228,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "LPT- Always, always bring your headphones with you. Even for you old heads like me.\n\nSo I'm sitting here, waiting to get my car done. Normal shit right? Not for me.  I have been seriously suffering from severe depression since '10 so going out and doing normal shit is something I struggle with.  Fun times I tell you.\n\nThis waiting room is like a mini Chinese torture.  CNN, Donald Trump infestation feeds, country music blaring, and a shit ton of white folks. Panic attack incoming. Shit. Can I just get my car and leave? I don't care that I already paid. Fuck the tears are coming. Why didn't I bring my goddamn earphones???\n\nBreathe.  Need to vent. Oh, I cant- been pushing people away for years. Ain't nobody got time for my shit.  Oh! /r/blackladies.  That's right. So I'm here.  No more sniffles. I will breath, vent and relax. I think I can manage now. Breathe.\n\nThank you /r/blackladies. Just for being you.( God, here come the tears again). If you are out there suffering from that bitch called depression, you are not alone sis.  I don't wish this Satan.  \n\nIf you're young and was kind enough to read this far of this random mess, you have hope and put treatment as first priority in your life.  You deserve it.\n\nLove you all.\n\nG",
    "title": "LPT- Always, always bring your headphones with you.",
    "subreddit": "blackladies",
    "timestamp": 1492447292,
    "score": 44,
    "keyword": "chinese manager"
  }
]