[
  {
    "text": "Unique Background - Can't find a job that uses my experience I spent almost 7 years living and working in China. While living there, I started out teaching English and moved up to teaching business English to students preparing to attend US universities. I was finally able to land a business job and began working for a Chinese factory. Long story short, the factory grew exponentially and transitioned from a tech factory (mobile phone cases for brands like Incase, Belkin, etc) to a high end fashion leather goods factory (handbags, wallets, and leather accessories for brands like Kate Spade, Tory Burch, Michael Kors, Coach, etc). We had outstanding growth due to the relationships I built and were constantly picking up new brands as people left one brand, transitioned to a new company, and would reach out to continue working with me. At the factory, I wore many hats, but my primary role was client relationship building. I would travel to New York to show case new products, meet with production teams to discuss pricing and production issues, and met with the directors and SVPs to discuss yearly planning and growth opportunities for the factory. I worked for this factory for 4 years. \n\nSince moving back to the US, I cannot for the life of me find a role that requires my skill set and language skills that at the same times pays a livable wage. I’m open to client relationship management roles, product manager roles, etc but the ones I’m finding are all 30-40K. I was making over 80K while living in China where an apartment in a gated community cost less than $400 a month. I’m not asking for the moon in terms of salary, but I’m struggling to find a real job. I’m located outside of Atlanta, GA and not open to relocating outside of GA as we just bought our house. Any and all help would be appreciated and if needed, I’m more than willing to send a copy of my resume for review.",
    "title": "Unique Background - Can't find a job that uses my experience",
    "subreddit": "jobs",
    "timestamp": 1568409712,
    "score": 8,
    "keyword": "chinese manager"
  },
  {
    "text": "Coworker gets away with doing the bare minimum and we get paid the same, should I quit my job? **Hi everyone this is going to be a long post, but I would really appreciate it if you could give me some insight on the situation.** \n\n&#x200B;\n\nI'm an expat working in China for a privately owned language training center. The institute is co-owned and co-managed by my boss and her business partner. It's a place where students who are kids between the ages of 6-14 come to learn English after school hours. I have been working at the place for 4 years and for the first 2 years I was the only foreign teacher employed. My boss also works as a teacher and has half of the working hours while I was in charge of the other half. The learning center is a very serious educational environment since most of the students are enrolled to prep for their KET & PET. We primarily focus on prepping the students for those tests so the workload can be hectic. \n\nThere is a lot of things that the instructor needs to do, like designing worksheets, preparing class presentations, creating lesson plans, quizzes, etc. I'm responsible for preparing all of these as per my job description. 2 years into my job my boss decided to hire another foreign teacher due to a conflict in my schedule. There were two classes happening at the same time and my boss couldn't teach both since a foreign teacher was required for both. The pricing depends on whether it's a foreign teacher that's responsible for the lesson or whether it's a Chinese one with the foreign classes being more expensive. \n\nIn the beginning, it didn't bother me much although my working hours were cut down and my wage went down but only slightly. I think I lost 8 hours of work per month, but it wasn't something to cry about and having someone else there was needed anyway so it wasn't a big deal. \n\nProblems started happening once my coworker started neglecting some of his duties as a teacher. He would neglect to prep for his lessons or he would do such a poor job at creating worksheets or designing lesson plans. He would occasionally take days off or misses class altogether with a different excuse every time. Most importantly though, he would replace teaching with playing games which isn't what the goal of the institute is. As a result of that, the kids in his classes weren't learning anything that would help them prepare for their tests. They were instead playing and no it's not a bad thing, but when your parents pay a hefty fee to help you prep for an exam then isn't that what you should be getting? \n\n&#x200B;\n\nEventually, my boss decided to switch his classes with mine. Her reasoning is that after an entire year of him teaching them they haven't really progressed much compared to the other students who were in different classes and it resulted in parents complaining and students dropping out, etc.. \n\nHowever, she neglected to mention that she would give him 1/2 of my working hours and since you get paid by the hour that resulted in my salary dropping by 50%. \n\n&#x200B;\n\nDid it phase him? No. He is still missing classes here and there on short notice. He still doesn't really prep anything. My boss preps FOR him, he claims that he's too \"busy\" to do any prepping and if he does he only does the bare minimum. My boss even ASKS me to help her prep for the classes he's meant to have and it just got very annoying. \n\n&#x200B;\n\nMy boss keeps complaining about him but she is too scared to confront him for whatever reason, so she just goes along with it. In the end, I'm stuck doing all the work and we both get paid the same amount!  Which I believe is unfair considering I have been there longer and I actually put in the effort. \n\nSo, the current situation is that my boss ends up teaching the same number of hours she always has, the other 1/2 is split equally between me and my coworker and that resulted in me getting paid less than even when I first started working there. It's a fixed salary, so there is no promotion cause why should there be one? There are also no other benefits such as housing allowance, health insurance, etc and you only get paid for the hours you have. \n\n&#x200B;\n\nI'm on the fence, I don't know if I should leave my job. I don't hate the job itself, I love the work that I do and I take a lot of pride in it. However, I just find it unfair that I have to do everything while my coworker can just show up to class or not depending on his mood, sit in a chair \\*which I'm not allowed to do, I have to stand up for the entire duration of the lesson, and if I do sit occasionally to rest after four hours of standing my boss marches in and tells me to stand up since the parents might think I'm not teaching\"  and eventually we both get paid the same. \n\n&#x200B;\n\nI also don't know why my boss despite complaining about the lack of efficiency in his work didn't just get rid of him earlier but instead gave him more hours. \n\nMy boss tells me she doesn't want me to leave and she wants me to continue working there, but I'm not so sure anything would change since he isn't going to be leaving anytime soon. \n\n&#x200B;\n\nThoughts?",
    "title": "Coworker gets away with doing the bare minimum and we get paid the same, should I quit my job?",
    "subreddit": "jobs",
    "timestamp": 1563277470,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Stuck in the Training phase for eternity I work in Dubai for a Chinese company, right now I am being trained as a business to business sales management position. The company the job because I am a Westerner and can also speak Mandarin. Obviously this sounded like a great opportunity for some first time management experience, my enthusiasm to learn and get started was very high, until I started.\n\nPart of Chinese business culture is to not let outsiders know the methodology of your business until they can be trusted, this sounds reasonable enough until you put it into practice. I had this problem before when working in Beijing, but this new job has left me with absolutely nothing to do. There is no direct training at all, and my boss told me to observe the current Chinese manager. They barely let me do anything, just insist that I study, study, study. But I have learned everything (that they allow me to learn) and spend the majority of my day sitting doing nothing. \n\nIt has been 3 weeks already of answering a phone here and there and then having to ask somebody else to quote the price (they won't let me quote prices even though it is a simple system based on volume of purchase). So I am pretty much rendered useless. It seems ridiculous to me, because the only way to truly learn is to do it yourself, even if that means being supervised.\n\nRight now, I am making 70% reduced salary which isn't too bad for doing literally nothing contributive. However, there is no set deadline for me to start working. My question is has anyone ever else been in this situation? Also, is this a sign to quit and look elsewhere?",
    "title": "Stuck in the Training phase for eternity",
    "subreddit": "jobs",
    "timestamp": 1575879600,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Freshman in highschool, no luck on jobs. I’m 15, in highschool and I literally have no luck on getting a job. Where I live, it’s pretty common for people at 14 to get a job and it not being much of a problem. I tried so hard to get a job last year, and I had absolutely no luck at all. Yet when my sister was my age, she got a job so easily. Just too easily. It’s pretty hard to believe that I try so hard yet she just got a job without trying at all. I’ve tried so many stores, and they all turned me down (basically). My mom helps me with this, and is just too optimistic. We try some restaraunts that I just know I won’t get a job at.\nFor example :\nShe tried to get me a job at a Spanish restaurant. I told her beforehand that they would probably only have Spanish-speaking people to work there, yet she thought otherwise. And Ofcourse, I was right.\nShe also tried to get me a job at a Chinese restaurant. I told her that they wouldn’t higher an american, unless I was a girl and could be a hostess or could do deliveries (but I’m only 15 so that’s not an option), and it turns out I was right. The hostess told me that her and this other girl were the only two Americans working there. She said they rarely hired non-Asians.\nI tried many fast food places, like McDonald’s burgerking, etc. \nMcDonald’s didn’t go so well. The manager flat out ignored me. This is weird because my other friend who dosent try at anything and always gets into trouble at school got it so easily. Turns out the manager that ignored me hired him. \nBurgerking, didn’t work out either. \nTacobell, stores in the mall, Dunkin’ Donuts, pizza places, gas stations, literally everywhere. Even places that my mom were friends with turned me down. \nI know I’m not the only one, that’d be selfish otherwise. It is just very very depressing to be turned down so many times. I try different times throughout the year, the best times too. I don’t think age is the problem,  otherwise it’d also be hard for my sister to get a job because she was even younger than me. It’s just really depressing. I have all of these bad thoughts like \n“What if it’s because of my physical appearance?” “What if my future is this?” Pretty bad, I know.\nI put on the best face, act nice and try my hardest when trying to get a job, while my pessimism just grows stronger afterwards. Literally everything I say before opening the door ends up happening.",
    "title": "Freshman in highschool, no luck on jobs.",
    "subreddit": "jobs",
    "timestamp": 1558735474,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Not heard back from employer - when should I call back? Hello everyone, I'd just like to ask a question about whether or not I should call back following an interview I had recently.\n\nFor context, last week I saw that a chinese restaurant nearby was hiring part time weekend staff, and so I asked the manager about the listing. He took me in for an weirdly extremely brief (as in, barely 4 minutes) interview, where he asked the usual interview questions, do you live nearby, do you have any experience, etc etc. As someone who's still in school, I don't have much experience in working in waiting, and I mentioned that in the interview, to which he replied that they were willing to train me.\n\nFor the most part, I thought that the interview went well, and the manager took my phone number down and said that they would sort out timetabling shifts and get back to me. It's been a week and a bit now, and I still haven't heard anything back from them, and I'd like to know when it would be reasonable for me to go back/give them a call asking for an update without looking desperate lol. Thanks a lot!",
    "title": "Not heard back from employer - when should I call back?",
    "subreddit": "jobs",
    "timestamp": 1550799333,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "How do I know to jump ships for the right reasons? Throwaway account.\n\nMy situation:\n- Single, early-30s [M],Worked in operations, then internal transferred into product development. (Have process engineering degree)\n\n- The manager that I worked for 2.5 years quitted due to senior leadership changes in the company. Of the original eight senior managers, only two are now left.\n\n- Annual performance review score was high (80%+), but pay adjustment this year was at inflation and as far as I can tell same with most of my colleagues. As far as I know, my remuneration package is median/above median for my sector.\n\n- Company outlook is *very* stable, as they have wide diversification, low gearing-ratio. (Without specifics: food company). This means that if the world-wide economy slow-down does happen, the chance of people getting sacked is low. Company is also established and have no history of at-will dismissal.\n\n- I don't foresee opportunity for promotion for at least 2 more years, if that's even on the cards.\n\n\n\nThere is an window to now apply and work for a competitor/company in the same field, either as lateral-transfer or progression of responsibility. However, 2 points stood out:\n\na) market and job advertisement observation suggests that this company lack serious technical experts and they are building their technology and technical team from scratch. Are they desperate and naïve enough to attract the wrong kind of people?\n\nb) Company with serious Chinese capital injection (I am not in the USA) - like over 50% owned by a Chinese SOE.\n\nc) This company in its current state is only about 10 years old.\n\nWhat other questions do I need to be asking myself to decide my move?",
    "title": "How do I know to jump ships for the right reasons?",
    "subreddit": "jobs",
    "timestamp": 1549423513,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Give vague descriptions? Get technically correct reply. Several contracts back, I happened to work for a predominately white company, and the following exchange occurred when my manager tried to gather people from another department I haven't met for a meeting. There are no name tags on our cubicles or desks.\n\n&#x200B;\n\nBoss - could you go down the hall and get \"Sam\" for me? he's the tall white guy.\n\n&#x200B;\n\nI stared at my boss expectantly. He stared back. I continue my confused expression. He waved his hand in a \"go\" gesture.\n\n&#x200B;\n\nI sighed and told him - I'm a small Chinese girl, everybody here is a tall white guy to me.\n\n&#x200B;\n\nBoss laughed out loud, then 2 seconds later realized it's not a joke. After another second it dawned on him, and the horror of his implications showed up on his face.\n\n&#x200B;\n\nBoss - oh, yeah, um, let me call him.\n\n&#x200B;\n\nYes, they all look too similar for him to pick out a distinctive feature to describe to me.",
    "title": "Give vague descriptions? Get technically correct reply.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1557531482,
    "score": 18,
    "keyword": "chinese manager"
  },
  {
    "text": "I Catered Lunch for My Building Administrative Staff Ever since Superintendent Jara (Clark County School District, Nevada) announced the layoffs of all 170 deans and 25 assistant principals, I think a lot of teachers and support staff in the district (myself included) have felt as though we've been on a wild roller coast ride.\n\nToday I learned that in an effort to preserve our dean's job, our building principal with a majority support of the teachers and staff, has opted to create a new AP slot. Even though the (displaced) dean understands that this is a metaphorical long shot since union contracts means that this job has to first be offered to the 25 displaced assistant principals, this would be the only way she could stay at our school since there are no teaching vacancies that she's qualified for.\n\nWhat's really annoying is that after gutting the ability of all secondary schools in the district to manage school safety and to enforce order and good discipline, the HR department won't let my principal post the newly created AP vacancy until July 26th. They've cited \"contract requirements.\" The principal is now trying to get an exception from the superintendent.\n\nIf the job isn't posted until July 26th, there will only be 2 1/2 weeks left until the start of the 2019-2020 school year. This won't give any of the displaced APs much time to apply for the job which I suppose would only benefit our dean. The flip side is that if one of the displaced APs were to take the job, our dean would have a very narrow window to find an alternate teaching job in the greater Vegas area. Since we're at a rural school, she would also not have time to move. Assuming she found a job, she would have to commute a two hour round trip drive.\n\nSince there's nothing I can do regarding our district's budget deficit, as the chef instructor of my school's Culinary Arts program, I made arrangements with the principal to cater a Chinese lunch for the administrative team.  Pictured below, clockwise from top left: orange chicken, stir fried collard greens with broccoli, beef and vegetable egg rolls, Hakka style braised pork.\n\n&#x200B;\n\nhttps://preview.redd.it/etw5gz852u531.jpg?width=1065&format=pjpg&auto=webp&s=d8980b982e2de6a48b00bab3abac1771f2a50e87\n\nNot pictured: Sweet red chili sauce for the egg rolls, one shrimp and pork egg roll that I made for the school secretary since she can't eat cabbage, stir fried shrimp with a Cantonese lobster sauce, and an additional vegetable dish (roasted Brussels sprouts with baby corn and cauliflower) that I made for the dean since she's vegetarian.\n\nAlthough I had offered to make some additional meatless vegan dishes for the dean, she told me that she would be happy with rice and vegetables.\n\nAdmin seemed happy with the meal and hopefully this helped make for a nice ending to their work week.\n\nAlthough the CCEA has reaffirmed its intention to strike after the new school year resumes, I haven't heard when this strike will be or where we'll be picketing. I have ordered a Red for Ed Nevada shirt through Amazon.\n\nThe strike will be too late for our deans and APs. Their last payday will be at the end of July. Our school year doesn't resume until August.\n\nCCSD is currently the 5th largest public school district in the country. We have  300,000 students, 35,000 employees, 336 schools and an annual budget of $5.2 billion. An estimated 60% of all teachers belong to the CCEA, so any strike will cripple the district and will most likely force school closures.",
    "title": "I Catered Lunch for My Building Administrative Staff",
    "subreddit": "Teachers",
    "timestamp": 1561177014,
    "score": 10,
    "keyword": "chinese manager"
  },
  {
    "text": "Shrimp 'Po Boys, Beef with Broccoli, and the Case for CTE Programs &#x200B;\n\nhttps://preview.redd.it/ujamtuf439p31.jpg?width=1920&format=pjpg&auto=webp&s=85a651cae3e8bc49c5388cdf521c66cbab6e4fc1\n\nToday in Culinary Arts, my Culinary III students produced shrimp 'po boy sandwiches. After immersing raw shrimp in batter, they deep fried the crustaceans. The fried shrimp was served on a garlic-butter toasted French roll on a bed of shredded lettuce. The shrimp were topped with a spicy Remoulaude Sauce that was made by mixing mayonnaise with paprika, minced garlic, pickle juice, Creole seasoning, and hot sauce. \n\n&#x200B;\n\nhttps://preview.redd.it/3qwo9bbo39p31.jpg?width=562&format=pjpg&auto=webp&s=89b70d519e7239c951a3ea37d7301cb6d313b830\n\nWhile the Culinary III students worked on their sandwiches, the Culinary II students produced a Chinese inspired beef with broccoli. I say \"Chinese inspired\" because beef with broccoli is actually an American created dish in much the same way that Orange Chicken was also created in the United States. \n\n&#x200B;\n\nhttps://preview.redd.it/xs0pasmx49p31.jpg?width=1920&format=pjpg&auto=webp&s=d9e580abc97baceb3d5f8a93a9484763635ee041\n\nThis is my 13th year on the job as the chef instructor of a Culinary Arts program. As a former elementary teacher, it's also my 30th year in the classroom.\n\nHaving spent 17 years as an elementary teacher, I can honestly say that I prefer being in the kitchen. The kitchen has some huge advantages.  Since most students like to eat, most students are actually motivated to participate. In learning how to read a recipe, how to measure, how to use a knife and so forth, these students are developing vocational skills that could lead to decent paying jobs in the food service industry. Even if some of them have no interest in becoming cooks or chefs, the skills they learn in Culinary Arts can always be applied at home. \n\nWould you believe that in the Clark County School District, we have SIXTY-EIGHT different CTE programs?  In addition to commonly taught CTE programs like Culinary Arts, wood shop, and automotive repair, we have CTE instructors who teach floriculture (the cultivation of flowers), video game design, animation, pastry, hospitality management (hotel service),and other fields. \n\nHaving been an elementary teacher, I understand the importance of imparting a basic education to our students. Having said this, do all children really need to go to college? The average student debt is now $38,390. While this would make perfect sense if college degrees automatically led to good paying jobs, a [new study](https://learningenglish.voanews.com/a/study-suggests-many-college-graduates-are-underemployed/4543268.html) shows that 43% of college graduates take their first jobs in positions that don't actually require a college degree. In contrast to the emphasis in many districts (including my own) on college readiness skills, a study from the [ McKinsey Global Institute](http://www.nbcnews.com/id/47985737/ns/business-forbes_com/t/you-dont-need-college-make-good-money/#.XY7ZHvdlDIU) shows that in 2020 employers around the world will need an estimated 45 million additional mid-level workers whose qualifications will be a high school education and vocational training. Of the 47 million new jobs in the United States that were created last year, 30% didn't require anything more than an associate's degree or a vocational certificate. \n\nWhile menial unskilled labor jobs are on the decline, there is a growing need for skilled labor. Dental hygienists can earn an average of $69,280. An executive chef can make $59,743. Plumbers, electricians, and brick masons can all earn $45,000 or more. \n\nFor those of you who are thinking about becoming teachers and for those of you who are burning out as core academic teachers, you might want to consider becoming a Career and Technical Education instructor. Many states offer alternative certification routes for CTE teachers. I myself used my degree in Culinary Arts and my food service experience to leverage CTE certification in Culinary Arts. Given my work experience, I could most likely have gotten a 2nd endorsement as a business teacher (though I chose not to do this because I prefer Culinary Arts.\n\nAs a side note, I will also mention that as a Culinary Arts teacher, I am earning more than the average executive chef AND I don't have to work the long hours that are common in the food service industry. I think I have the best of both worlds. I get to work with food and I don't have to teach to the test.",
    "title": "Shrimp 'Po Boys, Beef with Broccoli, and the Case for CTE Programs",
    "subreddit": "Teachers",
    "timestamp": 1569644582,
    "score": 6,
    "keyword": "chinese manager"
  },
  {
    "text": "Helping Out a Sick Colleague &#x200B;\n\nhttps://preview.redd.it/vn8dyjsc0ic21.jpg?width=532&format=pjpg&auto=webp&s=c8e5dc321170002a79018c72477fd3230c4a6442\n\n&#x200B;\n\nA few years ago, one of our office staff members transferred to a neighboring elementary school to become that school's office manager. This was basically a promotion thought it added a lot of responsibility. She also switched from a 10 month contract to an 11 month contract.\n\nLast week our principal broke the news that our former colleague had suffered a stroke. Although she recovered quickly, she's partially paralyzed and is out on an extended sick leave partially to have time to recover but also because she'll need time to work with a physical therapist. The good news is that her long term memory has not been affected and she has retained some mobility. She can also speak. \n\nA call went out for teachers at the elementary school and our junior-senior high school to cater meals for her family. I was sorry to hear that she was the sole supporter for a family of four. \n\nI volunteered to bring food in tomorrow for delivery by another colleague on Saturday. I prepared two plastic to-go containers of orange-mango chicken (pictured above) and two additional containers of beef with broccoli (pictured below). I also used a rice cooker to prepare 5 cups of steamed white rice .\n\nI THOUGHT about making a 5th container of Buddha's Delight which is Chinese vegan dish but decided that I might be going overboard. \n\nI hope this person will recover and be able to return to work. I will have to check and see if anyone has started a Go Fund Me campaign on her behalf to offset expenses. \n\nThe staff turnout for providing meals was really impressive. Within an hour of word getting out, every slot for the next two weeks was filled. I've heard that there's even a waiting list for the following two weeks should this catering service be extended. \n\nhttps://preview.redd.it/mq9tfske0ic21.jpg?width=5312&format=pjpg&auto=webp&s=6cf3f4406ddc41c1173c7541018a9e3df68f16e6",
    "title": "Helping Out a Sick Colleague",
    "subreddit": "Teachers",
    "timestamp": 1548391947,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "1st time creating an ICT/Computer curriculum for primary 4-6.... help?! This is my first time jumping into this community, but my school has just promoted me to \"academic director\" of my primary department (it's a foreign language school in China, where the students study two curricula of English and Chinese).. but we have not had an actual ICT/Computer curriculum ever before and I'd like to make one. The problem is... I have no idea where to begin.  \n\n\nThe students are grade 4-6 (elementary/primary, classes of 24-27 students) and we have access to a computer lab and I could potentially get a hold of video cameras as well. We have class once per week, 40\\~45 minutes a class. \n\nUntil now, teachers often treat the ICT class as just an extra one or something to use to maybe type up assignments or do research for other projects because there has never been an established curriculum and the teachers don't know how to teach it well. I'd like to make it into a more serious class that will actually help students.  \n\n\nWhat I'm thinking so far is starting off with basics: \n\n* typing (the chicken pecking/two finger approach doesn't cut it...)\n* basic file management (understanding folders/organization/not naming files ffffffffffffff or something like that, as they do...)\n* internet safety/knowing what NOT to download (our school was plagued by a dumb newfolder.exe virus last year)\n\nThen more specific things:\n\n* How to do basic research on the internet\n* Microsoft Office things\n   * word\n   * powerpoint (not spending 45 minutes on making the first slide beautiful and getting nowhere with your ppt/what colors go together well/not having a million sparkly things on a page)\n   * excel ?\n   * publisher?? (I personally don't know it well but my boss (the one whose position I'm taking) really liked it and used it for a lot)\n* Scratch programming\n\n&#x200B;\n\nThings I'd like to think about but have no idea about:\n\n* video editing/creation\n* ???  \n\n\nI know this is a big ask, but I'm a little lost here. If I can get a good idea of what things to cover, or a good order, or just some suggestions, I think I can scaffold it and build it up through the grade levels... but I'm a little lost.  \nOne of my bosses asked me what software the IT department should install on the computers, as we'll be using a different computer lab next year for my department so I need to figure everything out.  \n\n\nAny help or direction would be sincerely appreciated!!!!",
    "title": "1st time creating an ICT/Computer curriculum for primary 4-6.... help?!",
    "subreddit": "Teachers",
    "timestamp": 1564633924,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Having Worked Remotely and Traveled Long-Term (Three Years), What Actionable Advice Would You Give to Someone That’s Looking to Do the Same Thing? What Specific Job Sites Should They Visit, and What Are Examples of Jobs (Titles) They Could Pursue? Hi everyone!\n\nOne of us is an IT consultant the other is a project manager (PMP) consultant and corporate trainer and we're also long-term travelers. We’ve been each living out of one bag (r/onebag) for nearly three years. In that time we've been fortunate to visit four continents, 26 countries, and \\~80 cities, all while having the pleasure of doing nearly 50 house sits.\n\nThis lifestyle isn’t for everyone, and contrary to what the media or our friends think, we’re not on some perpetual vacation. Life sill happens and responsibilities still need to be met, whether we’re on a beach, a house sit, or an airport lounge.\n\nWith that being said, if we were asked what advice we'd recommend to someone wanting to purse long-term travel and remote work we'd say:\n\nStart with your current employer, do they offer the possibility of you keeping your current job and going remote, can you move to a different role, how about a trial period? If so that’s great, no need to reinvent the wheel!  \n\nBut if not, leverage your current network and continue to learn a skill(s) or build a business **before** resigning and departing. You’re more likely to be chosen to interview (or hired) because you’re recommended by someone on staff vs simply being picked out of a pile of resumes.\n\nBrainstorm all the people you know (your friends, friends of friends, friends of your parents, former colleagues, acquaintances, social network connections, etc.) and how they could be of help (contract work, full time employment, be a reference, help with increasing your knowledge, skills, and work experience, etc.). Set up meetings and connect with them before departing. It's a great opportunity to ask for leads but also to connect before you depart. Not everyone will respond, but be genuinely thankful and pick up the tab for the drink or meal for those who do. You'll find more success when you can find ways to be of help to them, rather than just asking for help.\n\nIn the beginning it seems daunting to get a remote job (and to some extent rightfully so) but the best things we've seen work are either having your own list of clients that over a long period of time you've built trust, respect, loyalty, etc. or work for a company that embraces remote employees (ideally one that has a global footprint).\n\nTry these job boards/sites:\n\n* \\[Power To Fly\\]([https://powertofly.com/jobs/](https://powertofly.com/jobs/))\n* \\[Working Nomads\\]([https://www.workingnomads.co/jobs](https://www.workingnomads.co/jobs))\n* \\[We Work Remotely\\]([https://weworkremotely.com/](https://weworkremotely.com/))\n* \\[Remotely Awesome Jobs\\]([https://www.remotelyawesomejobs.com/](https://www.remotelyawesomejobs.com/))\n* \\[Hacker News Jobs\\]([https://news.ycombinator.com/jobs](https://news.ycombinator.com/jobs))\n* \\[United Nations Development Jobs\\]([http://www.undp.org/content/undp/en/home/jobs.html](http://www.undp.org/content/undp/en/home/jobs.html))\n* \\[Flex Jobs\\]([https://www.flexjobs.com/jobs](https://www.flexjobs.com/jobs))\n* \\[The Training Associates\\]([http://thetrainingassociates.com/client-resources/](http://thetrainingassociates.com/client-resources/))\n* \\[Angel List\\]([https://angel.co/jobs](https://angel.co/jobs))\n* \\[Remote OK\\]([https://remoteok.io/](https://remoteok.io/))\n* \\[Awesome Remote Job (GitHub)\\]([https://github.com/lukasz-madon/awesome-remote-job#job-boards](https://github.com/lukasz-madon/awesome-remote-job#job-boards))\n\nAlso, here are some specific career roles/job titles you can pursue if you're looking at getting into remote work.\n\nKeep in mind that the list below is merely our brainstorm, it’s up to the individual to pursue what they consider to be the most viable and what makes the most sense for them and their personality (strengths, weaknesses, etc):\n\n* IT support (i.e. support desktops and servers for enterprise customers or SOHO’s (small office home office)\n* Copywriting/Content Writing (for example: \\[Text Broker\\]([https://www.textbroker.com](https://www.textbroker.com))\n* Content editor\n* TEFL/ESL (teach English to foreign adults and/or children, for example: \\[VIP Kid\\]([https://www.vipkidteachers.com/](https://www.vipkidteachers.com/)) )\n* Translation (English to Chinese anyone!?)\n* Virtual tutor (English, Math, etc, for example: \\[Take Lessons\\]([https://takelessons.com](https://takelessons.com)) )\n* eCommerce (Drop shipping, Fulfillment by Amazon, etc.)\n* Affiliate marketing\n* Digital/Online marketing (email campaigns, A-B website testing, website heat mapping, pay per click (PPC), etc.)\n* Web and Graphic Design\n* Video editing\n* Coaching\n* Consulting (From medical to IT, to project management and beyond)\n* Digital content creation (photos, audio content/filters, blueprints/schematics, webinars, e-books, etc.)\n* Virtual assistant\n* Captioning/Subtitling videos (for example: \\[Rev\\]([https://rev.com](https://rev.com))\n* Search Engine Evaluator, Internet Analyst, Social Media Evaluator, etc. (Lionbridge, Appen, Leapforce, Raterlabs (US only)\n\nAlso, don't forget to discuss (or at least have answers) how you plan on addressing challenges that may come up while you're dong a job remotely i.e. time zones, internet bandwidth, security (VPN/encryption/SSL certificates), shipping (speed/weight limitations, customs,). \n\nAll the best on your remote job search and safe travels!",
    "title": "Having Worked Remotely and Traveled Long-Term (Three Years), What Actionable Advice Would You Give to Someone That’s Looking to Do the Same Thing? What Specific Job Sites Should They Visit, and What Are Examples of Jobs (Titles) They Could Pursue?",
    "subreddit": "careerguidance",
    "timestamp": 1571766625,
    "score": 6,
    "keyword": "chinese manager"
  },
  {
    "text": "I (27F) want to change into a career in programming or business management. Help? Hi guys!\n\nMy undergrad has nothing to do with either computer science or business. I double majored in English Literature and Modern Language (French-Spanish). In addition to these 3 languages, I also speak fluent Portuguese (my native language) and conversational Chinese (I have been living in China for a few years, as an ESL teacher).\n\nLanguages are what I am the most naturally talented at. As such, I decided that it would be good to pursue them academically. I thought I'd be an ESL teacher in the long run, get a CELTA certification and travel the world.\n\nUnfortunately, I regret this decision now. I've done my fair share of traveling and, let me tell you, exciting as it might be, it is also a bit lonely. Unless you're in a relationship with another ESL teacher who wants to country-hop as much as you do, you'll end up alone in a foreign country whose language you can barely speak. Currently, I am dating a US architect and, eventually, we would like to settle down. I am not looking forward to being a language teacher in the US, where high school shootings are a common occurrence and the salaries a joke.\n\nSO, I want to make a career change into either programming or business management!\n\nMy CV is all related to teaching English as a second language, mostly to children -- minus a short stint in a cruise ship, as a youth staff! I've held middle management jobs within the schools I've worked for, but I am not sure if that would count for something.\n\nThe more time passes, the more anxious I become about going for a career change. How many people do you know that went from kindergarten teacher into business? I think my best option is to enroll in a Master's Program?\n\n&#x200B;\n\nAnyway, I'd like to hear your opinions on how to make this career change happen:\n\n1. Which one of these fields would be best, financially, in the long run?\n2. Is jumping straight into graduate school my best shot?\n3. Is graduate school even the best way to go, if I want to get into programming? Maybe I should learn how to code and get some experience/build a portfolio before even considering school? Start with freeCodeCamp, try for an actual bootcamp afterwards?\n4. Is it doable to aim for such a drastic career move as I am nearing my 30s?\n\n&#x200B;\n\nEDIT: I thought I should add my reasons for wanting to change into one of these career paths.\n\n**Business (in the field of Project Management)**\n\n* An evergreen field, with plenty of opportunities.\n* Better career progression than in many other fields.\n* I have had a taste for it (though minor), by working as a manager in different for profit language institutions.\n\n&#x200B;\n\n**Programming:**\n\n* I've always been very interested in computers/technology.\n* I'm a language-oriented person. Obviously, human languages and computer languages have very little, if anything, in common. But it peaks my interest anyway!\n* Programming could potentially allow for great mobility -- work from home, work while traveling, etc.\n* Programming could potentially allow for creative expression!",
    "title": "I (27F) want to change into a career in programming or business management. Help?",
    "subreddit": "careerguidance",
    "timestamp": 1552291495,
    "score": 5,
    "keyword": "chinese manager"
  },
  {
    "text": "Four months after asking fore more responsabilities, should I go to HR and ask for less due to the unexplainable chaos in my office? So, I'll try to keep it short -even tough this is very emotional for me.   \nTL; DR at the bottom   \n\n\nBack at the start of September, what is now my current employer (a medium sized company) decided to take in-house a very crucial social media project that was previously outsourced, and a brand new team was formed for this specific task -me and four other people. New hires, very heterogeneous team, we all had the same duties. The first contract was until the end of December, but right from the 1st month things started to get a little... weird.   \n\n\nFirst, we are given our laptops but no mouse. Weird, but ok (I just went out during lunch break and bought the five of us some cheap chinese ones). Then, 3rd day on the job, one of us quits in tears -training is a bit demanding, and trainers are very srict. She is replaced by a new hire (let's call her Brittany), and 2 weeks after that another guy gets a better offer and is also replaced with a new hire (let's call her Tracy). In both cases, official training was already over and  we original three hires were left to train the new ones from zero. 3rd week, our project manager leaves the company overnight and without a word, and we are left basically on our own.  \n\n\nThe next month... oh boy, were we in for a ride. First, the other two original hires (let's call them Sue and Amy) were unofficially promoted to supervising duties for the rest of the team; a brief explanation was given that they were chosen due to be \"willing to go the extra mile\", and just like that they were left -unoffically- in charge.  \nNext, the company chooses to switch from a custom-made management system to a famous brand. Both Amy and Sue are left, alone, to learn how the new software works -with no training and no background or skill relating to this task. It was a very stressful situation and the relationhip between the five of us started to sour -Sue becomes aggressively ambitious, shouting and bossing people around; Brittany starts a non-stop lithany of work-related complaints; Tracy is shown to be underqualified and lacking the most basical computer literacy (like sending emails, or copy/pasting from keyboard -wish I was kidding).  \n\n\nThings get progressively worse along the same lines up until December: a new PM is established, but is given brief and fragmentary info about our project and basically depends on us to fill in the blanks whenever a decision is to be made. A lot of small, bad decisions ensue, leaving us possibly even more frustrated during our day-by-day tasks. Sue is constantly snorting, shouting, stealing ideas while throwing her weight around and basically acting as a nevrosis engine; Brittany picks up her vibes, and among the ordinary rants & ravings literally throws a chair against a drywall leaving a small hole; Stacey is constantly depending on others, guilt-tripping for help and being unable to avoid making small but constant mistakes.  \nMe? I plug my earphones and try to lay low, heping Stacey and placating Brittany all the while trying to find a method to this madness; Sue is, according to my collegues, feeling threatened by me (and I can't say I don't see why, with her being way over her head and me 10 years her senior and more experienced) and irrationally defensive in refusing help, refusing to delegate, and generally volounteering for every task no matter the complexity or importance. -screaming her lungs out at me whenever she feels her control slipping over the smallest issue.  \n\n\nSo at the end of December, after the flying chair and a 2-months contract renewal, I decide someone has to do something and request a meeting with my boss and our HR manager. I keep it brief and, hopefully, professional, by making two points: mainly that 1) I can do more and I'm willing to do more; and 2) I don't care why that particular choice was made, the company now has to take responsability for Sue's behavior. For everybody's sake, including hers.  \nMy boss and the HR manager were highly understading and collaborative -but, frankly, quite oblivious to the situation. I politely asked about the hows and whys of some of the more technical (and absurd) decisions, and met a lot of answers along the lines of \"we never thought about that\" and \"we didn't know about that\". HR was also very clear in stating they had taken note of Sue's behavior, and that she had shown herself as \"very junior\", \"unprofessional\", and in need of a lot of polishing.\n\nI left both meetings with a firm \"either you let me do more, or let me do less\" stance, and three days after both HR and PM informed me that my presence was required, along with Sue's, on a work trip of one week.  \n\n\n(The trip was, professionally speaking, a nightmare that saw Sue so concentrated on criticizing, gainsaying, and literally stomping her feet that she forgot the one reason she was on the trip -that is, training our main suppliers for a couple of new things we had coming in the following weeks)  \n\n\n\\*sigh\\* What nest? The last 4 months were ok. I've been granted more and more responsibilities, finally managing a lot of the small, crucial things that nobody else is either prepared  or skilled for. I see and talk regularly with our bosses, and would by all means be treated equally to Sue and Amy -except for our contract. At the end of February all of us five were confirmed for 3 years, and Sue and Amy (which up until now were payed and officially considered as everybody else) were given a promotion and a raise. -even though HR tried not to, but probably caved in due to Sue puting up one of her shows in front of everybody.\n\nSo here's the deal: I'm baffled about what to do now. On one hand, I'm actually doing something challenging and worthy of being on a resumé. On the other hand, I'm getting payed less than S&A while doing something equally important -and just as much S&B, while doing something way more skilled. I get to talk with clients and suppliers, but have absolutely no decisional autonomy and left in the uncomfortable situation of not knowing who I refer to. Sue is in a waning phase, shouting way less but constantly seething -probably frustrated by the visible change in the power dynamic; more often tha not we seem to disagree on how to do things, and I'm the one left to manage the organizational aftermath of her micromanaging and unwillingness to communicate.\n\nThis is starting to get frustrating, and is honestly NOT the way I'm used to work. I have absolutely no faith is our HR evaluational skills, and feel the need to understand exactly where I am and what is expected of me.  \n\n\nTL; DR: Office is in chaos with no clear leadership, I'm the only one handling the technical and organizational stuff (way above my grade), with no raise or promotion in sight and forced to work with ex-collegue-now-petty-\"boss\" for at least 3 years. Should I go to HR and take back my willingness to perform above my grading?",
    "title": "Four months after asking fore more responsabilities, should I go to HR and ask for less due to the unexplainable chaos in my office?",
    "subreddit": "careerguidance",
    "timestamp": 1555888088,
    "score": 3,
    "keyword": "chinese manager"
  },
  {
    "text": "Considering quitting my current job to finish school, should I? This is my first time making my own Reddit post so excuse any sloppiness as I try to follow the rules. Also, sorry for this being long, it was therapeutic to type out.\n\nI am a 21, almost 22, year old female who struggled with a whole host of mental illnesses (which I will not go into details about), but suffice to say, I haven't had the easiest time coping with life. When I was younger, I dreamt of being an animator or novelist. I graduated high school back in 2015 with a gpa of 3.4 and was accepted into each of the six colleges I applied to all while working part time under the table for a local Chinese food restaurant--answering phones, taking orders, packing bags, etc. I started this job when I was a sophomore and stuck with it until I went to college. Yet even when I was away, I would return to aiding the restaurant on holidays and over the summer as according to them I was their best employee.\n\nI went to college in a different state six hours away, living on campus, and majoring in creative writing. Much like my high school life, I did well academically and was on the board of a few clubs. ... Then the depression hit. And it hit hard. Long story short, I dropped out and came back home. For a short while I worked at the restaurant again, but I quit after the environment turned toxic. I tried working with my mother at a wholesale store...and was fired after a few honest mistakes. Now I'm working at a bookstore and despite loving my co-workers and the books, I'm miserable. I love organizing the books, making recommendations, and overall talking with book lovers. However, in the society we live in now, marketing is such a huge pressure. My managers stress to sell \"memberships,\" which apparently I'm good at, (selling over 100 within a couple months of working) yet I can't handle the mental toll these sales take. I'm not a saleswoman. This is not what I want to be doing with my life.\n\nOn the other hand, I've been drawing. I've always loved doing sketches and doodles to relieve stress, but this past January I made some posts online for commission work and have turned my hobby into a side source of income. For example, this past month I made $80-$90 on art. It's not enough to live off of, sure, but it's good money. Good money that I enjoyed making. \n\nSo that's where my question comes in, should I quit my job as a bookseller in order to pursue a degree in art, perhaps use this leverage as a path towards an illustrating career? Maybe I should get a library degree so I can do something similar to what I'm doing now without all the dirty sales aspects? Should I suck it up and learn to enjoy what I'm already doing? Are their more options? Any insight is welcomed.\n\nLittle more financial information: I still live with my parents who don't require me to pay rent, but do require me to have a steady job. The job requirement might waver if I'm in school and doing my current art income as well.\n\nTl;dr I'm a young college dropout who is miserable in my current minimum wage job and pondering ways to improve my life.",
    "title": "Considering quitting my current job to finish school, should I?",
    "subreddit": "careerguidance",
    "timestamp": 1569355110,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Free to pick one of many jobs in the software industry - which one to go for though? \nI'm not expecting anyone to give me a clear answer like \"the perfect job for me\". I would be incredibly grateful though if you could give me general advice.\n\nI'll give you a short introduction to put you into the picture:\n\n**Professional Background**\n\nOfficially I have 5 years experience in Software Development. All of it at the same big global company. 2 out of these years were spent on an apprenticeship (which in my country makes you a qualified professional). 3 years I've been working on SaaS platform. First year as Level 1 supporter and full stack developer. Second year as Level 2-3 support and full stack developer. Third year as application consultant (mostly working as an intermediate with global key-customers/account managers and our development team).\n\nNovember last year I took up a new job in the same departement but in a [data mart](https://en.wikipedia.org/wiki/Data_mart) team as a Test Engineer while starting my part-time studies in [Information Science](https://en.wikipedia.org/wiki/Information_science) (*\"Information science is a field primarily concerned with the analysis, collection, classification, manipulation, storage, retrieval, movement, dissemination, and protection of information\"*, not the same as Computer Science which focuses more on algorithms and data structures to put it bluntly).\n\nThe last 4 months I've finally got the chance to use my frontend skills with HTML/CSS and JS6 to create a web app to check our developer's code with the click of a button. (connected to API).\n\nAll the time I've been worknig in Agile teams which, I guess, is the new standard in the industry.\n\n**Personal Background**\n\nI've been trying to come up with a set of fitting descriptions of my personality. I've made a list of things I do without hesiation in me free time:\n\n- improve myself\n- learn about sci-tech\n- think about problems\n- connect with people (socializing; I've been told I'm a great listener/conversation partner)\n- brainstorm\n- consume sci-fi (especially cyberpunk related stuff)\n- optimize repetitive tasks, create tools or frameworks\n- think and read about reality, psychology and ethics\n- learn about cyber security (DEF CON talks, books like \"The Art of Invisibility\" by Kevin Mitnick)\n\nTo give you some more input, these are the things I've come up with when brainstorming this topic:\n\n* I really like to invent things. I often think about problems and how to solve them (and actually solve them)\n\n* I'm really good with tweaking and optimizing my life. Over a course of 3 years I've gone from mad-workaholic to chill-productive-person by extracting my workload to trello with quarterly changes of workflows/frameworks\n\n* I'm afraid that my ego is holding me back from unleashing my potential. I LOVE science fiction and I always wanted to be a hacker. Growing up I learned that that path isn't really legal and holds big bad consequences, so I basically dropped it\n\n* I study information science and I'm really good with creating classifications and sorting files/data - you could call it a obsession of me\n\n**My situation** is as follows:\n\n- the JS-based web app I've been working on at my new job will be finished and deployed in the next PI (end of September). My boss/PO asked me what I wanted to do after that (implying I could choose from many possiblities)\n- I get requests/invitations from recruiters every day due to my history with Java at my last job (even though I don't really like to program in Java)\n- I've stopped coding at home as I need the time to balance the stress from work with working out, socializing and shutting my brain off by playing video games\n\nI've had a hard time coming up with a plan for my future and I'm not even sure whether I want to stay a Software Developer. \n\nI work in central Europe and with my partner doing their PhD I have some prospect to be moving to another country within the EU, UK or North America. Thus, I want to make sure I pick up skills / credit that are highly-valuable on a global scale (on which [I found some data here](https://futureskills.pearson.com/)). \n\nI understand that most Software Development is outsourced these days (heck, ît's always a bit of a fight getting a programming project assigned to you at work instead of your outsourced colleagues). Thus, I'm partly open to look into more \"Western\" jobs.\n\nI fairly good with learning languages so I thought about picking up Chinese while I'm still studying for the next 3 years. I need a good reason to, though (more than the usual \"it's the English of the future\" argument). Other than that I speak English, French and German.\n\nI feel like I'm at this \"inbetween situation\" with low-payed outsourced colleagues picking up the work I could do and highly-educated (master or PhD level) colleagues getting the high-payed data-related jobs. I basicalyl want to find a nice niche where a normal guy with my background and with a big amount of discipline can fit in. I thought this \"Tester\" thing could be that but right now I feel like either it's not a job well enough defined to market *or* simply not as exciting as [James Bach makes it out to be](https://www.youtube.com/watch?v=ILkT_HV9DVU).\n\nIn regards to my partner's high chances of changing countries in the near future I've been considering to either become independent or find a remote job in the mid-future. Positions that would prepare me for that would also make sense to pick up.\n\nFrom my past jobs I have enjoyed the following activities:\n\n- implementing frontend functionalities\n- troubleshooting bugs all across the stack (from the GUI to APIs to server logs)\n- consulting key customers (listening to their wishes and telling them what's possible to implement)\n- traveling and attending workshops every once in a while\n\nI have been thinking about getting myself certified as a Scrum Master as it kinda fits my personal interests. I'm not sure though whether that's a step up or a deadend.",
    "title": "Free to pick one of many jobs in the software industry - which one to go for though?",
    "subreddit": "careerguidance",
    "timestamp": 1564412294,
    "score": 1,
    "keyword": "chinese manager"
  },
  {
    "text": "Deaf, no connections. Getting frustrated. 10 years experience. Hi. I'm not trying to write my life story here, but I guess some background is warranted. I grew up with hearing aids and gradually lost more and more of my hearing as time went on. Nowadays the hearing aids don't provide me with enough information to follow a conversation as I have severe to profound hearing loss in one ear and I am totally deaf in the other. This has really caused me a lot of problems finding job opportunities as I can't do phone interviews and the jobs I have managed to find have all come from personal contacts, but as I've grown older and been less able to communicate I don't have the same level of personal contacts I used to. A lot of companies tout their diversity program but in my experience, HR is and always has been allergic to those of us who require some level of accomodation in the hiring process. I always thought gaining more experience would be the cure for this, but my resume is mostly treated like nuclear waste. Any advice on how to find people willing to hire a deaf guy? The client who had hired me to design him custom circuit boards for his company is having some business cash flow problems, so I've got to find something before I'm out of money.\n\nI only have a decade of work experience but growing up my hobby was computers and electronics, so I've been programming since I was like 10 years old. I have a degree. I can reverse engineer binaries and electronics. I have designed a sound card, 250W/channel audio amplifier (loud enough even I can hear it), a USB to RS485 PC board, and some RF stuff (I'm into radios). In addition to designing the circuit boards, I dealt with the Chinese assembly plants to populate the boards with components to complete them. I can code web frontend (I hate it, though), backend, x86/arm/avr assembly language, linux device drivers, embedded C, C++, Java, Python, whatever, I have skills. I just need to find someone who wants to hire me for them and doesn't have an HR department ready to light my resume on fire the moment I mention I can't talk on the phone.\n\nThank you in advance and I apologize for the rantiness of this post, the job hunt grind is really grating on me this time around.",
    "title": "Deaf, no connections. Getting frustrated. 10 years experience.",
    "subreddit": "cscareerquestions",
    "timestamp": 1574321173,
    "score": 578,
    "keyword": "chinese manager"
  },
  {
    "text": "[Discussion] Experiences of international tech workers in America & burn out? Humans of New York recently shared [this post](https://www.facebook.com/humansofnewyork/posts/3228575237216554) about an international tech worker that I thought was interesting. He left San Francisco for Vancouver due to the burn out that he experienced as an international worker. Here's the post:\n\n>“I came from India in 2011 to get my Masters, and ended up working for a major tech company in San Francisco. It was a lucrative job, but there was always a looming cloud of uncertainty. Half of the people in my department were international workers-- mostly Indian and Chinese. All of us were on visas, so our future in America depended upon keeping our employment. I don’t think the managers intended to push us harder. But the international workers were more afraid, so we took more abuse. It just became part of the culture. We were given extra work, and the only way to keep up was to kill yourself every day. I just couldn’t do it. Eventually I burned out and moved to Vancouver. Canada was very welcoming. My wife and I have residency already. I’ve started my own business. I have all the clients I need. But most importantly I have a home. And I’m not talking about a brick structure. I mean a place that I’m allowed to be. Because once I had that, all my other problems seemed smaller. I could start thinking long term. Because no matter what happens, at least I know I’ll be here.”\n\nI think I've noticed this in my own experiences as well. I've seen that some teams with a majority of international workers can work very hard but the team as a whole has a terrible work life balance. As a result, members of those teams  tend to get burnt out and leave the team fairly often. I can't tell if management is applying this pressure, or if it is self imposed. I'd love to hear from other tech workers in America about their own experiences regarding this topic, whether you were born in America or came here for a job.\n\nAlso, please keep negativity out of this discussion. We're all just people who work with code that trying to make a life for ourselves.",
    "title": "[Discussion] Experiences of international tech workers in America & burn out?",
    "subreddit": "cscareerquestions",
    "timestamp": 1562692591,
    "score": 36,
    "keyword": "chinese manager"
  },
  {
    "text": "Is it worth for European to join Huawei in Chinese office at present time? I'm from Eastern Europe and have applied for internship in Huawei on position of AI software engineer. I don't have many details as of now but have certain considerations and really need an advice.\n\nFirst of all, it's AI and China seems to be rocketing in this field, and Huawei is one of its top tech companies. On the other hand, they have recently gained some bad reputation and I'm somewhat concerned with this.\n\nI've tried to google feedback about working in Huawei but what I've found was mostly about its offices not in China and the position is open in the Chinese office, most likely in Shenzhen. I've read that Shenzhen is one of the best cities to live in China but here are my two main concerns:\n\n1. still not fully understanding working culture in Huawei in particular and in China in general; read some frightening stories about constant overtiming and lack of communication with managers so wonder whether it also applies for IT industry and for foreigners\n2. have even worse understanding of the social opportunities: I'm a foreigner who doesn't speak Chinese (I don't mind learning it but hey, it will require much time before I know it to least useful extent); I've read that China has quite nationalistic trends nowadays so such terms as \"social isolation\" and \"workplace discrimination\" come to mind - of course, it can be false perception but that's why I'm asking these questions here.\n\nIf you can share your experience or ideas I'll very thankful. Particularly hope that some of you have relocated to China or worked in Huawei. Thanks to everyone in advance.",
    "title": "Is it worth for European to join Huawei in Chinese office at present time?",
    "subreddit": "cscareerquestions",
    "timestamp": 1566393190,
    "score": 9,
    "keyword": "chinese manager"
  },
  {
    "text": "Computer Science vs Software Engineering Degree in China # \n\nHi guys, A little bit about my background, I am 20 years old and now going to take a major in either Computer Science / Software Engineering, i know its a bit late to enroll in but I believe now is the right time to get a degree. I always want to create something new and interested in those product designs and stuffs too. I'm not too sure which one to major in right now since those two are pretty similar. Here are the curriculums:\n\n&#x200B;\n\n**Computer Science:**\n\nIntroduction to Computer Science and Technology, Discrete Mathematics, C++ Programming, Data Structure, Fundamentals of Electronic Technique, Digital Circuit and Digital Logic, Principles of Computer Organization, Principles of Operating System, Principles of Computer Networks, Principles and Applications of Database, Microcomputer Interface Technology, Embedded Systems, The Principle of Compiler, Software Engineering.\n\n**Software Engineering:**\n\nChinese Language, Discrete Mathematics, Data Structure, C++ Programming, Java Programming, Principles of Computer Organization, Principles of Operating System, Principles of Computer Networks, Principles and Applications of Database, Web Application Development, Software Engineering, Human-Computer Interaction, Software Testing and Quality Assurance, Project Management.\n\n&#x200B;\n\nThe degree is going to take 4 years and Im going to take it at a uni that is ranked \\~950 in the world and \\~ 75 in China. (if thats going to matter)\n\n&#x200B;\n\nThanks guys i appreciate all help.",
    "title": "Computer Science vs Software Engineering Degree in China",
    "subreddit": "cscareerquestions",
    "timestamp": 1561103686,
    "score": 2,
    "keyword": "chinese manager"
  },
  {
    "text": "Anyone worked in China, I plan to work there for 6 months, any difficulties adjusting? I will be co-oping with an international company, and they offer you the opportunity to work abroad if you do well during the first co-op with them. I really want to go back to China(I will explain soon) for 6 months, working there as a software engineer intern. Mostly because I haven't been back for over 7 years now and I would love to travel around China during the working period. \n\nI immigrated from China when I was 9 years old, and I can speak/read day to day Chinese characters. I can also type pinying, but I forgot how to write it on paper(mostly). I think I am heavily influenced by the American culture in many ways. \n\nIf you have worked in China before, what was your overall experience with it? Like, the culture of it etc. Also, for the technical parts, I think it will be difficult since I learned everything in English. If you say the word Array in Chinese right now I probably won't know what you are talking about. I guess the question is, how important is it for one to understand the technical languages in Chinese as well? Or as long the manager tells you to do something, you will do it etc. I would just love to have some feedback from anyone who worked in China for sometime as a developer and hear their opinions!\n\nThank you so much and have a good day.",
    "title": "Anyone worked in China, I plan to work there for 6 months, any difficulties adjusting?",
    "subreddit": "cscareerquestions",
    "timestamp": 1548825402,
    "score": 0,
    "keyword": "chinese manager"
  },
  {
    "text": "How to charge as a consultant? Hello everyone,  \n\n\nSo I've read couple of articles on the internet about how consultants charge their services but I was wondering about one particular scenario that i'm going to explain now and you tell me if it is realistic or not or I could formulate a better way of charging my service. I'm not a consultant myself yet, but I will be willing to open my own company in case that is the way of getting more money from this project than just working full time for company I'm going to mention below.   \n\n\nSo I work in Shanghai, China and I was approached by business development manager of one Chinese government owned construction company who was given/won the deal to construct a hospital in my country in Eastern Europe worth $45 mil. They reached out to me given the fact that I'm from that country, I can speak the language, I know the law etc. They would probably need my assistance in lots of things over there. Probably finding some local contractors for small/medium tasks etc (this is just a guess because I still heaven't met with them in person to talk about it). As I said I don't know a lot of details about the work scope or work type but I want to go prepared for the dinner talk with that guy in case he gives me some options regarding the compensation.   \n\n\nI was wondering is it realistic to ask from the % of the full investment ($45 mil) and ask for let's say 0.5% or is there a better model i should go for (hourly based, retainer) or something else...   \n\n\nPlease fill free to write whatever you like, I will update the post once I have more details.   \nYour small help would be appreciated guys",
    "title": "How to charge as a consultant?",
    "subreddit": "consulting",
    "timestamp": 1563862706,
    "score": 6,
    "keyword": "chinese manager"
  },
  {
    "text": "A compilation of evidence debunking feminist historical revisionism. I have made a post somewhat similar to this before but I've since collected a lot more information about these topics and so I believe warrants yet another post.\n\n*Myth #1: Women weren't allowed to work.*\n\nMost documentation from the past heavily implies that people attempted to avoid working as much as possible. Even so, many women did work (mostly because they had no choice but to) and there has never been a law restricting women from working.\n\n\"Though creative research has produced evidence of women working at male-dominated occupations in the eighteenth century and before, there is undoubtedly more documentation out there, in newspapers, diaries, legal proceedings, and prints. What is more compelling is the lack of documentation that women were not allowed to work. Although religious practices and social norms might have restricted certain activities in some parts of the world, there were no laws prohibiting women from working a trade.\"\n\nAt the time, only members of a trade guild (associations of producers that trained craft people, maintained control over production, regulated competition and prices) were allowed to sell their goods or practice their skill within the city. Non-guild members were prohibited from selling competitive products. An aspiring master would have to pass through the career chain from apprentice to journeyman before they could be elected to become a master tradesman. They would then have to produce a sum of money and a masterpiece before they could actually join the guild. If the masterpiece was not accepted by the masters, they were not allowed to join the guild, possibly remaining a journeyman for the rest of their life.\n\nWomen were not barred from any of the trade guilds in Britain at least as far back as the 1400s. Apprentice forms for guildwork had spaces left blank to insert 'he' or 'she', though girls who chose this traditional route to mastery of a trade (which was extremely long and arduous) were usually orphaned and had low prospects for marriage, thus they were going to need to work.\n\nMarried women, though, had the privilege of circumventing the long, onerous, arduous process of trade certification as they could receive the master tradesman status from their husbands and thereby continue his work, even take on apprentices to train (which suggests that the social assumption was that wives would learn enough about their husband's business and trade to be able to at least continue to oversee it after he died). Lots of widows continued to run their husbands' businesses long after their death.\n\nThe Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\n\nA 1770 publication called *The Tradesman's True Guide or a Universal Directory for the Towns of Birmingham, Wolverhampton, Walsal, Dudley and the manufacturing village in the neighborhood of Birmingham* carried exhaustive lists of tradesmen and tradeswomen alphabetically by name and by trade, and there are women listed in every trade from butcher to wire drawer.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nReally, very little I've seen shows that women were maliciously \"kept out\" from trades or professions that they wanted to enter into. It may have been a social norm that most women did not seek out careers as they do now, but looking at the histories of the first women to enter into medicine, law, etc, show that they hardly faced any resistance in doing so.\n\nIn 1847, Elizabeth Blackwell became the first woman to attend medical school in the US and was the first woman on the Medical Register of the General Medical Council. She sent applications for admission to twelve of the most promising institutions in the northern states, and her application was accepted by the medical department of Geneva University. Feminist revisionist history \"explains\" that she was only admitted to the college by the evil men as a joke, but as will be amply demonstrated this is the opposite of what actually happened.\n\nIn fact, the student body sent her a letter to welcome her:\n\n>At a meeting of the entire medical class of Geneva Medical College, held this day, October 20, 1847, the following resolutions were unanimously adopted:–  \n>  \n>Resolved – That one of the radical principles of a Republican Government is the universal education of both sexes; that to every branch of scientific education the door should be open equally to all; that the application of Elizabeth Blackwell to become a member of our class meets our entire approbation; and in extending our unanimous invitation we pledge ourselves that no conduct of ours shall cause her to regret her attendance at this institution.  \n>  \n>2. Resolved – That a copy of these proceedings be signed by the chairman and transmitted to Elizabeth Blackwell.\n\nShe describes this letter as one of her most valued possessions, and in her autobiography she states that the men of the college supported her 100% and beyond.\n\n\"The behaviour of the medical class during the two years that I was with them was admirable. It was that of true Christian gentlemen. I learned later that some of them had been inclined to think my application for admission a hoax, perpetrated at their expense by a rival college. But when the *bona-fide* student actually appeared they gave her a manly welcome, and fulfilled to the letter the promise contained in their invitation.\"\n\nShe also notes that the general public also had a favourable view of a woman entering into medicine.\n\n\"The admission of a woman for the first time to a complete medical education and full equality in the privileges and the responsibilities of the profession produced a widespread effect in America. The public press very generally recorded the event, and expressed a favourable opinion of it. Even in Europe some notice of it was taken, and 'Punch' showed his cordial appreciation by his amusing but friendly verses.\"\n\n[http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III](http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III)\n\nThere are also other examples of women entering into \"male\" fields and encountering little resistance. There's the example of Arabella Mansfield, the first female lawyer in the United States. Although by Iowa law the bar exam was restricted to \"males over 21,\" Arabella Mansfield took the exam in 1869, passing it with high scores. Mansfield challenged the state law excluding her, and the Court ruled that women may not be denied the right to practice law in Iowa, admitting Mansfield to the bar.\n\nOr Ada Lovelace, who was encouraged in her mathematical ability from a young age by her parents and received the best of tutors to increase her ability. She worked with Charles Babbage on his Analytical Machine, though they both \"fell into historical obscurity, and the Analytical Engine was unknown to builders of electro-mechanical and electronic computing machines in the 1930s and 1940s when they began their work, resulting in the need to re-invent many of the architectural innovations Babbage had proposed.\"\n\nOr Amelia Earhart, who was flown \"like a sack of potatoes\" by pilot Wilmer Stultz across the Atlantic in her 1928 transatlantic flight, and immediately became a celebrity, wrote a book about the experience, was used to endorse products, and dubbed 'Lady Lindy'. There is a plaque that marks where the plane landed in Wales. All the fervour over it was solely because she was a woman who crossed the Atlantic regardless of the fact that she didn't do any flying at all in her 1928 flight (She did, however, go on to complete a transatlantic solo flight later on in 1932).\n\n[https://en.m.wikipedia.org/wiki/Amelia\\_Earhart](https://en.m.wikipedia.org/wiki/Amelia_Earhart)\n\nOr, for a very long-ago example of this, Murasaki Shikibu from Japan around the year 1000, who listened at the door while her brother received lessons in Chinese writing and through that learned it herself. She was far from reviled for being a woman who knew Chinese and was commissioned by the Empress to write the Tale of Genji, a classic work of Japanese literature often called the world's first novel.\n\nOh, the o p p r e s s i o n .\n\n*Myth #2: Marriage was an institution created by men to oppress women. Men were disproportionately given privilege and power and women were treated like his property in marriage.*\n\nAgain this is a bastardisation of the past. Feminism has to stop treating men as the enemy and as the source of all women's (and also men's) problems. They need to realise that things weren't always as they are now, and realise that it was not Patriarchy or men that restricted the choices of both genders and forced them into strictly defined roles, but that these roles came about because it was the best way of arranging societies in the past - a past that was much harsher and more unforgiving than it is now. A past in which there was more work to do than there were hours in a day. A past where men spent most of their short lives working like mules to support themselves and their families and women spent most of their short lives incapacitated by childbirth and child-rearing. A past in which we sent children into coal mines that ruined their lungs and into factories which lost them limbs. Things sucked, and the reason it was bearable at all back then was *because* of the gender roles.\n\nMen were not the ones who relegated women to the domestic sphere or kept them dependent on men. Biology did. A woman at that time could not simply strike out on her own and do whatever she wanted. For most of history we had no reliable birth control, no safe abortion, no maternity leave, or social security, and most public sphere work back then involved hard labour. And if you were a woman back then who wanted to be able to have sex, then you would have had to plan your life around the idea that you would be getting pregnant, giving birth, and breastfeeding for most of your adult life - and that would have meant you could not be a reliable enough worker to support even yourself, let alone a child, and it would inherently have made you dependent on other people to help you. Until the last 100 years or so, most women could not have lived a life of children and public sphere work, independent of a man (and not all can today, realistically).\n\nEven with support, most women in poor and middle class families had to work because that was the only way to make enough money to live.\n\nSo in a time when single motherhood was a one-way trip to the gutter, marriage was a practical arrangement. The function of marriage was not to oppress women, but to positively assign paternity inasmuch as possible, and then obligate the men so assigned to their children and the mothers of their children. For life.\n\nThe taboo on sex outside of marriage (which was applied to men no less than women) made it difficult for an unscrupulous man to cheat the system. These rules surrounding marriage also mitigated the problem of paternity uncertainty, which maximised men's willingness to invest in their kids. \"I know these are my kids, so I will work hard to feed and shelter them.\" And the reason why we kept lifelong monogamous marriage for so long is because it increased the resources which would have been available to offspring, providing a healthier environment for children to grow up in.\n\nSo when a man married a woman, he was legally obligated to feed, clothe and shelter her and any children produced in the marriage to the best of his ability. Unlike what feminists seem to think, he could not sell her. He could not return her for his money back. He could not drop her at the local midden heap. He could not destroy her the way he could his actual chattels. He could not trade her for a better one. He could not legally neglect her.\n\nJust to make things crystal clear, here is a summary list of entitlements that women enjoyed in marriage (and after marriage) during the old \"patriarchal\" system of the past.\n\n1. When a woman married, she had to hand over her property to her husband's care (again, NOT because she herself was property, but because he was administrator of the family), but he OWED her not just a living, but the best living he was financially capable of providing for her. A wife was entitled to be maintained by her husband.\n2. Though women did not have the right to enter into contracts in their own name in marriage, women had the privilege of the Law of Agency, giving them the legal right to purchase goods on their husbands' credit as their agent. If the wife racked up debts that the husband couldn't pay, she was immune from liability for the debts she racked up - that liability fell to the husband instead.\n3. Women had the entitlement of being protected from prosecution for any number of crimes if they could prove their husbands were aware of said crimes. In which case, he would be prosecuted in her stead--not just held AS responsible as she was, but held solely responsible for her actions. This allowed married women to displace accountability for a large number of offences onto their husbands. \"She's out of control and does what she wants, regardless of my wishes,\" was not a valid legal defence for those men.\n4. Women were exempt from paying taxes, and there was an entire female underground economy of barter and trade that was not subject to taxation or government interference. Even when married women gained the right to hold property within marriage, it was their husbands who were responsible for the taxes owing on it, and it was their husbands who were held 100% financially liable for providing all necessaries to the family, including the wife, even if she made more money than he did.\n5. After divorce, men were held fully financially responsible under the law for the ex-wife and kids. Divorced women were entitled to be supported by their ex-husbands to a level commensurate with the husband's for potentially the rest of their lives unless she remarried.\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nThat doesn't sound at all like women were treated like property to me.\n\nI'm sorry, but if I have property, I have no legal duty of care toward the actual property I own, nor any obligation to commit to own it until death. I can smash my property on the ground and treat it however I want and it would be my right to do so. Men could not do any of that to the women they were married to. They had obligations towards them to provide for them - even after divorce, and to protect them - even from the consequences of their own actions. Wives had no such obligation towards their husbands - they were entitled to be the ones who were supported. Because the purpose of marriage in the past was not to oppress women and make them the property of men, but to ensure that women and their children could be provided for and protected, and to place the responsibility for that provision and protection on the man even at cost to his own wellbeing, health, and even life. This has been the case since time immemorial.\n\n\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"\n\nEphesians 5.\n\n[https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV](https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV)\n\nIn fact, many of the supposed \"privileges\" men had in marriage in the past were to help them carry out their obligations and to prevent them from becoming wholly onerous.\n\nIf a man had an obligation to be accountable for provision for his wife and children and to maintain family finances, it stood to reason that he also should have the entitlement of having control over any assets of his marriage, including those his wife brought into the marriage, because he was the one who had a responsibility to keep the entire family afloat and to increase their holdings.\n\nIf a man was responsible for the protection of his wife and children to the point where he could be legally required to stand between his wife and the law within numerous contexts, and be punished in her stead (whether she contracted debts he couldn't pay or committed a crime he would have to answer for), it makes sense why he would be considered head of household and why his family would need to obey him as well as abide by the restrictions he placed on them.\n\nIf, upon divorce, a man would be held solely responsible for the maintenance of his wife and child, it makes sense why he would get custody of the child that he was supporting, as well as ownership of assets so he could satisfy that obligation.\n\nWe gave men these rights and privileges because they were the tools that he needed to satisfy his responsibilities. And in that way there was a balance. \"Women \"got less\" because their obligations and accountability were less, their responsibility was less. Men \"got more\" because the buck stopped with them, whether that buck consisted of a sack of coins or his blood.\"\n\n*Myth #3: Men were allowed to beat their wives with impunity.*\n\nIn the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\n*Myth #4: Husbands were owed sex with their wives. Marital rape was not illegal, and marriage as an institution was based around rape of women.*\n\nThe idea at the time was that there could not be such a thing as marital rape because as a married person you are owed sex from your spouse, i.e. conjugal rights. This applied to both men and women. People who believe that conjugal rights \"allowed husbands to rape wives\" and not the other way around haven't actually done any research.\n\nIt was based on the idea that **both parties** had a right to sex in the relationship, and this was exercisable in law by each partner in a marriage.\n\nThe Bible said:\n\n\"*It is* good for a man not to touch a woman. **2** Nevertheless, because of sexual immorality, let each man have his own wife, and let each woman have her own husband. **3** Let the husband render to his wife the affection due her, and likewise also the wife to her husband. **4** The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.* **5** Do not deprive one another except with consent for a time, that you may give yourselves to fasting and prayer; and come together again so that Satan does not tempt you because of your lack of self-control.\"\n\n[https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV](https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV)\n\nDo note the specific passage where it says \"The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.\"*\n\nAnd here's a quote from an article detailing the history of sex and marriage.\n\n\"A hundred years ago or so, if you took the statute books literally, the only people entitled to have sex with each other were people who were legally married. All other sex was against the law. Fornication (sex with unmarried people) was illegal; so was adultery (sex with a married person—but not the person you yourself were married to). Cohabitation—living with someone in a sexual relationship—was against the law, except for people who were legally married. Enforcement was, shall we say, something less than perfect. At times, it was almost nonexistent. And the rules were riddled with exceptions. Sodomy, on the other hand, was quite a serious crime; and the full weight of the law sometimes came down heavily on people who had gay or lesbian sex.\"\n\n\"Married people were not only *entitled* to have sex; they were, in a way, *required* to have sex. Of course, nobody checked on whether John and Mary were having sex every night, or once a week, or once a month, or never. But if either John or Mary did not perform at all, for whatever reason, the frustrated partner had grounds for divorce; or even perhaps an annulment.\n\n[https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking](https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking)\n\nHusbands faced divorce if they were impotent and unable to consummate the marriage, though charges were usually made years after the wedding day. There was a similar charge of frigidity for wives, but it seems that wives charging their husbands for impotency was far more common. Husbands had to show an erection to a court audience and sometimes attempt to perform sex with their wives as well.\n\n[Source 1](http://www.bu.edu/law/journals-archive/bulr/volume89n5/documents/HOFFMAN.pdf) [Source 2](https://www.theparisreview.org/blog/2016/05/18/the-hard-on-on-trial/)\n\nBeing incapable of performing sex for your wife could merit corporal punishment. One medieval husband wrote about his unhappy marriage and his impotence in a book called The Lamentations of Little Matheus.\n\n\"My wife wants it, but I can’t. She petitions for her right. I say no. I just can’t pay.\"\n\n\"Even given his sexual incapacity, Matheolus was subject to corporal punishment:\n\n\"Acting as her own advocate, Petra {Matheolus’s wife} puts forward the law that if a shriveled purse {scrotum} can’t pay because it’s empty, under statute recompense for that injury is corporal punishment.\"\n\n[https://www.purplemotes.net/2015/05/03/matheolus-church-wife/](https://www.purplemotes.net/2015/05/03/matheolus-church-wife/)\n\nSo what does this show? It shows that both parties had an obligation to provide the other partner with sex during the marriage, and could not deprive their spouse of it. If it was an issue, it was not an issue that solely affected women.\n\n*Myth #5: \"Men had the vote and women did not. Women's suffrage was a matter of women as a united group fighting for their rights against the evil men that kept it from them. Suffragettes were champions of equality who got women the vote. Etc, etc.\"*\n\nReally, I'm very tired of hearing this one.\n\nIn Britain, the right to vote was not only restricted by gender, but also by class. Property owners had the vote, the vast majority of men did not. In 1830, just 3% of the population had the right to vote.\n\nDuring this time, there were a few groups who were fighting for the vote to be extended to them, and one of these groups were the Chartists, who were active from 1830 to 1868. They were fighting for broad electoral reforms including:\n\n* a vote for all men (over 21)\n* the secret ballot\n* no property qualification to become an MP\n* payment for MPs\n* electoral districts of equal size\n* annual elections for Parliament.\n\nThey presented three huge demonstrations to Parliament, and their requests were denied every time. The restrictions were relaxed but not abolished. Benjamin Disraeli said when introducing the Second Reform Act of 1867: \"We do not live – and I trust it will never be the fate of this country to live – under a democracy. The propositions which I am going to make tonight certainly have no tendency in that direction.\"\n\nThere were also the suffragists and the suffragettes, who were fighting for the vote to be extended to women. Suffragists emerged in the mid-19th century and believed in peaceful, constitutional campaign methods. In the early 20th century, after the suffragists failed to make significant progress, a new generation of activists emerged. These women became known as the suffragettes, and they were willing to take direct, militant action for the cause.\n\nHowever, a huge amount of women disagreed with women's suffrage. So many women objected to the franchise being imposed on them that in the mere 18 months leading up to a 1910 parliamentary debate on women's suffrage, anti-suffragettes had managed to collect 300,000 signatures from women who objected to the franchise being imposed on them. Meanwhile, in the 16 years leading up to that debate, suffragettes only managed to collect 193,000 signatures of women who wanted the vote.\n\nA segment from the transcript of the debate:\n\n\"Still, for what it is worth, one finds that from 1890–1906 only 193,000 women signed Petitions to this House in favour of female suffrage, and that during the last eighteen months, a period in which a strong anti-suffrage association has been in existence, 300,000 women, some of them eminent women, have signed petitions against it, and to the effect that these proposals shall not be forced upon them.\"\n\nAnd...\n\n\"A rather interesting illustration was furnished by an inquiry which was instituted by \"The Sheffield Independent,\" a newspaper which I think itself is sympathetic with these proposals. This inquiry was addressed to the women householders of Sheffield. Twenty-three thousand papers were sent out, and of the replies 9,000 were in favour of woman suffrage and 14,000 were against it. The representatives of this paper reported that in many cases their emissaries were chased with violence from the houses by the female inhabitants under the impression that they were collecting statistical matter as the emissaries of the suffragist party.\"\n\nIt may be difficult to understand why so many women would reject the vote so vehemently, but this was an era where full citizenship rights like the right to vote were granted only to those with citizenship responsibilities like conscription (and sometimes not even then). In that historical context, the vote was actually viewed not just as a right, but also an obligation. So it was never really about men in power shutting women out of the franchise. It was about government having to decide whether to impose a responsibility on women that women as a whole *clearly did not want.*\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\nRegardless of the lack of support for women's suffrage among women, suffragettes became extremely militant in their activism. In 1903 Emmeline Pankhurst founded the Women's Social and Political Union (WSPU) with her daughters Christabel and Sylvia, and the WSPU carried out a nationwide bombing and arson campaign. Between 1912 and 1915, hundreds of bombs were left on trains, in theatres, post offices, churches, even outside the Bank of England; while arson attacks on timber yards, railway stations and private houses inflicted an untold amount of damage.\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nInstead of being beneficial in supporting the vote for women, it was disastrous. Lloyd George said: \"The action of the militants is ruinous. The feeling amongst the sympathisers of the cause in the House is one of panic. I am frankly not very hopeful of success if these tactics are persisted in.\"\n\nTerrorism aside, Emmeline Pankhurst was also resistant to acquiring the vote for working class men, realising that this would be much tougher than winning the vote for \"respectable\" AKA upper-class women, and underlying the resistance appears to have been her contempt for working-class men. According to Sean Lang in his book on Parliamentary reform: \"The Pankhursts became stridently anti-male, ruthlessly dropping even the most loyal of their male supporters from the WSPU, and claiming, as Christabel did in her 1913 book *The Great Scourge*, that men were “little more than carriers of venereal disease”.\"\n\n[https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/](https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/)\n\nWhen WW1 came around in 1914, suffragettes also threw their support behind the White Feather campaign with the aim of shaming men into enlisting. Those young women went in for the kill, striking men at the very heart of their masculine identities, the bestowing of a feather telling them, \"If you don't go off to be maimed or die, you are no longer a man in the eyes of some brassy chit you've never even met before and will probably never see again.\" And many men went, because a woman's censure - ANY woman's censure - had the power to drive them straight into the teeth of death.\n\nBy mid 1915, it was clear that not enough men were signing up to replace the fatalities on the front line, and the Military Service Act was introduced in January 1916. By March 1916 compulsory conscription for all single men aged 18-41 was in place. In May 1916, the Act was extended to include conscription for married men.\n\n[http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html](http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html)\n\nIt was only at that point that the British government considered extending the vote to all men, as most of the propertyless, working class men that were conscripted into war during WW1 did not have the right to vote, and this was finally starting to be seen as the injustice that it was. In the trenches class divisions were eroded to the extent that class no longer had any real meaning and every man was the equal of each other in terms of sacrifice and service to one's country.\n\nMen got universal suffrage in 1918 with the Representation of the People Act, which enfranchised more than five million men over the age of 21 without regard to property or class. Women of all classes were piggybacked onto the Act, with an age restriction temporarily in place to prevent women from becoming a supermajority voting bloc, given that about 1 million British men had died in the war. Regardless, this brought more than eight million women over 30 into the electorate. And just ten years later, the 1928 Act (the act which gave women electoral equality) gave the vote to women at age 21, which added another five million women to the electorate.\n\n[https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/](https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/)\n\nIntroducing the 1918 Bill, the Home Secretary George Cave said: \"War by all classes of our countrymen has brought us nearer together, has opened men's eyes, and removed misunderstandings on all sides. It has made it, I think, impossible that ever again, at all events in the lifetime of the present generation, there should be a revival of the old class feeling which was responsible for so much, and, among other things, for the exclusion for a period, of so many of our population from the class of electors. I think I need say no more to justify this extension of the franchise.\"\n\nThe Act was achieved not by the suffragettes’ terrorist tactics, but by fighting of men in WW1, when thousands of men from their many different backgrounds came together to fight the common enemy. This finally achieved what the Chartists, the Levellers and the peasants before them had struggled for in terms of eroding barriers of class. Without the sacrifice of men who endured the horror of trench warfare in WW1, class barriers would have persisted and at most the vote would have been extended only to elite, wealthy, propertied women.\n\nIn a later study of attitudes to conscription in 1939, one woman responded: \"In the last war \\[(WW1)\\] I never told one man that he ought to go. I tried to put myself in their place. If I’d been them I wouldn’t have gone. When I saw them going through the streets – all the young men – I used to think that they were being driven like cattle to the slaughter house. And they were, weren’t they? Fodder for the guns.\"\n\nThe common idea that all men had the vote, and that women did not, and that women's suffrage was a fight of women who were united against men working as an oppressive force to keep them down is an affront to these men who died in a literal war that secured universal suffrage for everyone (many of which, in fact, did not have the vote). It also ignores and erases the will and sentiment of many, many, *many* anti-suffragette women who actively rejected the vote and protested vehemently against it being imposed on them.\n\nFurthermore, the view that suffragettes were a valiant, fair-minded, equality-oriented group who got women the vote and whose activism merely amounted to firecrackers in barrels is an affront to any right-thinking person. The real violence and extremism of the suffragettes is barely, if at all, recognised by the general public, and this is partly due to attempts by suffragettes to sanitise their history.\n\n\"Laura E. Nym Mayhall, in her work on the militant suffrage movement, identified the importance of \"a small group of former suffragettes\" in the 1920s and 1930s, who created a highly stylised story of the WSPU and the history of suffrage in England, which emphasised \"women’s martyrdom and passivity\". The group set about compiling the documents, memoirs and memorabilia that now form the basis of the Suffragette Fellowship Collection held by the Museum of London.\"\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nAnd here we are now, in crazy world. According to the dominant narrative, all men always had the vote since the dawn of recorded human history, and they refused to give it to women because penis. The demonstrations of the Chartists, and the dead bodies of these men that were sacrificed to the unpopular idea of male suffrage (and who got votes for women in the process), have gone down the memory hole. The terroristic actions of the suffragettes, engaged in for the benefit of wealthy and privileged women only and for which they were barely punished, are the noblest of acts for the noblest of causes. And of course, the only reason anyone could EVER have opposed them was because of misogyny.\n\nedit: wording\n\nedit 2: Added some extracts from [w1g2's comment](https://www.reddit.com/r/MensRights/comments/edyrf5/a_compilation_of_evidence_debunking_feminist/fbtays6?utm_source=share&utm_medium=web2x).",
    "title": "A compilation of evidence debunking feminist historical revisionism.",
    "subreddit": "MensRights",
    "timestamp": 1576979536,
    "score": 337,
    "keyword": "chinese manager"
  },
  {
    "text": "Let's just conveniently forget that men objectively have less legal rights than women [https://www.cnn.com/2019/03/02/europe/world-bank-gender-equality-report-intl/index.html](https://www.cnn.com/2019/03/02/europe/world-bank-gender-equality-report-intl/index.html)\n\n&#x200B;\n\n&#x200B;\n\nThe world is moving towards legal gender equality -- but it's moving very, very slowly.\n\nOnly six countries currently give women and men equal rights, a major report from the World Bank has found.That's an increase -- from zero -- compared to a decade ago, when the organization started measuring countries by how effectively they guarantee legal and economic equality between the genders.But the rate of progress means that, by CNN calculations, women won't achieve full equality in the areas studied by the World Bank until 2073.Belgium, Denmark, France, Latvia, Luxembourg and Sweden scored full marks of 100 in the bank's \"Women, Business and the Law 2019\" [report.](https://openknowledge.worldbank.org/bitstream/handle/10986/31327/WBL2019.pdf)Of those nations, France saw the biggest improvement over the past decade for implementing a domestic violence law, providing criminal penalties for workplace sexual harassment and introducing paid parental leave.📷[Women could boost the global economy, but outdated laws are holding them back](https://www.cnn.com/2019/01/15/perspectives/women-equality-workforce-economy/index.html)But countries in the Middle East and Sub-Saharan Africa averaged a score of 47.37, meaning the typical nation in those regions gives women under half the legal rights of men in the areas measured by the group.The study aimed to \"develop a better understanding of how women's employment and entrepreneurship are affected by legal discrimination,\" highlighting \"how women must navigate discriminatory laws and regulations at every point in their careers, limiting their equality of opportunity.\" It did not measure social and cultural factors, or how effectively laws were enforced.The criteria analyzed were: going places, starting a job, getting paid, getting married, having children, running a business, managing assets and getting a pension. Those were broken down into questions such as: \"Can a woman travel outside her home in the same way as a man?\" and \"Is there legislation specifically address domestic violence?\"Overall, the global average came in at 74.71 -- an increase of more than four and a half points compared to a decade ago. But the score indicates that in the average nation, women receive just three-quarters of the legal rights that men do.**📷**\n\nPlay Video\n\n**Michelle Obama: 'Lean in' doesn't always work** 01:20The United States scored 83.75, placing it outside the global top 50. The United Kingdom achieved a score of 97.5, Germany measured at 91.88, and Australia scored 96.88.\"If women have equal opportunities to reach their full potential, the world would not only be fairer, it would be more prosperous as well,\" World Bank Group Interim President Kristalina Georgieva said.\"Change is happening, but not fast enough, and 2.7 billion women are still legally barred from having the same choice of jobs as men.\"The study is the latest to stress the economic benefits of guaranteeing legal gender equality.According to [a separate report](https://www.mckinsey.com/featured-insights/employment-and-growth/how-advancing-womens-equality-can-add-12-trillion-to-global-growth.) from the McKinsey Global Institute, released in 2015, closing the gender gap in the workforce could add $28 trillion to the global GDP -- nearly the size of the US and Chinese economies combined.\n\n## Laws still holding women back\n\nThe US performed especially poorly in the \"having children\" category, scoring just 20. The criteria analyzed laws around maternity, paternity and parental leave.\"Policymakers interested in keeping women from dropping out of the labor force after they have children can look at their economy's scores in this indicator as a starting point for reform,\" the report said.Saudi Arabia's overall score of 25.63 was the worst in the world, while Sudan, the UAE, Syria, Qatar and Iran all scored below 35.📷[In high-paying jobs, the wage gap can cost women millions](https://www.cnn.com/2018/12/19/success/high-paying-occupations-wage-gap/index.html)But the report highlighted more positive trends in South Asia, East Asia and Sub-Saharan Africa, the three most-improved regions compared to 10 years ago.The country that improved the most was the Democratic Republic of Congo, which had a score of 42.50 10 years ago but measured 70 in 2017, the final date for the analysis.\"This improvement was based, in part, on reforms allowing married women to register businesses, open bank accounts, sign contracts, get jobs and choose where to live in the same way as men,\" the report said. A legal requirement that wives obey their husbands was also removed in the country.The report also found that \"most top reformers introduced sexual harassment laws or mandated nondiscrimination in access to credit,\" and that \"one-third of the top reforming economies removed job restrictions on night work or on certain job types.\"**📷**\n\nPlay Video\n\n**IMF head Lagarde: Respect women and one another** 04:11\"Gender equality is a critical component of economic growth,\" Georgieva wrote in the report. \"Women are half of the world's population and we have our role to play in creating a more prosperous world. But we won't succeed in playing it if the laws are holding us back.\"\"Many laws and regulations continue to prevent women from entering the workforce or starting a business; discrimination that can have lasting effects on women's economic inclusion and labor force participation,\" she wrote.\"By making the economic case, we encourage governments to guarantee the full and equal participation of women.\"\n\n&#x200B;\n\n&#x200B;\n\nEDIT: its bullshit that gets spewed out like this by major publications that made me an advocate of mens rights in the first place. How can they sit there and claim to want more maternal leave for women, then turn around and say they want to eliminate the \"wage gap\". How would that be possible, unless they want to afford rights to women that men don't have (longer PAID parental leave for women than men), which is exactly what they are advocating against (equality).",
    "title": "Let's just conveniently forget that men objectively have less legal rights than women",
    "subreddit": "MensRights",
    "timestamp": 1576271019,
    "score": 152,
    "keyword": "chinese manager"
  }
]