[
  {
    "text": "My Fiancé's brother is a gross manchild Posting here because I really need to vent or I'm going to go crazy!\n\nI've been with my fiancé for 5 1/2 years but we've never spent that much time with her family until this year. Last year during covid her mum was diagnosed with incurable cancer so this year we've been visiting for 1-2 weeks every other month.\n\nI've always known her brother is a manchild and been irritated by him, but recently it's gone to a whole other level.\n\nHe's 32 years old and has always lived at home with his parents. Previously he had a long distance relationship with a woman in Cambodia that seemed to mostly involve him sending vast amounts of money to her. (My fiancé raised the fact this was a massive scam but was told she was \"heartless\" by her mum and dad). When that ended a few years ago (turned out she had a lot of western \"boyfriends\" kinda fair play to her in a way) we hoped he would finally get his shit together and move out.\n\nThat clearly hasn't happened. His parents do pretty much everything for him. I mean EVERYTHING. Bear in mind his dad is 61 and a full time carer for his dying mum. They cook all his meals, they do his laundry (and collect it from the floor of his room), they change his bedsheets, they wash his dishes, they clean the whole house including his (disgusting)bedroom. \n\nBrief rant about the bedroom. I've never been inside but he leaves the door open and you can see his clothes strewn across the floor, white stains on his desk chair and tissues all around. It makes me want to vomit thinking about it.\n\nHe also walks around the house in dirty clothes that don't fit him which means we all have to see his hairy fat belly hanging out. (No fat shaming, I am overweight and working on it. The issue is the lack of social awareness around clothes and hygiene). Despite this he brags about burning thousands of calories at the gym (sure) and is always eating protein bars or shakes.\n\nThe one thing he does is occasionally cook them a fried breakfast on weekends, which of course his mum is expected to clean up. Whenever he does the slightest thing for them he is expected to be heaped with praise.\n\nHe has worked full time in a professional good paying job for years, but what does he offer to his family? About £400 a month. That's for food, lodging and no housework required. To put that into perspective that's less than half just the rent my fiancé and I pay, forget bills and food. \n\nSo what does he do with all that money? Well instead of saving to move out (he literally could have bought a house by now) he spends it all on his car, video games and stupid \"projects\" that never come to anything (like an expensive microphone and video camera for his short lived YouTube channel). \n\nWhen we come back we work really hard to cook, clean and wash to make sure her mum can have a break (her dad can't cook) and to overall support them. We also pay for the shopping and help to pay for some meals out (normally over 50% plus tip). This includes (to my regret) having to cook for her brother who has not once offered to clear the table or help with the dishes.\n\nThis would all be somewhat tolerable if he was actually a half decent human being. But he's also a careless, misogynistic PoS.\n\nWhenever there is something he doesn't like or doesn't want to hear, regardless of how small it is, he will get angry, shout, sulk and slam doors. My fiancé has told me that her mum has said she is frightened of him.\n\nHe is also a massive misogynist. He refers to a female colleague as \"the Rottweiler\" because she has red hair is allegedly ugly (whatever the hell that even means) and \"talks too much\". When discussing my fiancé's relationship with me he compared it to their aunt and grandmother because \"whenever two women get together there is always trouble\" despite the fact my fiancé and I were perfectly happy and relaxed. He also made a joke that \"the Chinese symbol for conflict is two women under one roof\" which i challenged as untrue, sexist and racist. He said \"It is true, I know a lot about this stuff actually\" (it definitely isn't true but w/e). \n\nIn the past (thank gods not around me) he used to threatened to kill, strangle and beat my fiancé. Call her a bitch, \"a little slut\" (for going on a date) and a whore. His go to insults always seem to be gendered.\n\nWhenever challenged or questioned about his behaviour he says he can't help it and we shouldn't judge him because of his aspergers. (Aspergers isn't even a recognised diagnosis here, it's just called ASD but he insists on calling it aspergers as he claims to be \"high functioning\" and to have special \"advantages\" about his intelligence). This is just clearly untrue. \n\nFor one I work with and have worked with people with ASD. They might seem a bit odd sometimes, be a bit blunt or see things in a different way but they are fully capable of being functioning adults who manage their own lives. They can be polite at work, good at their jobs and supportive to their families. \n\nApparently his mum and dad have bought into this as whenever I or my fiancé mentions anything to her dad he says he can't help it.\n\nWhat makes this worse is the family put massive pressure on my fiancé to always be kind, emotionally forgiving and practically supportive. They expect her to do care giving tasks,  they also criticize her for having an \"attitude\" if she ever disagrees or is unhappy with her father. (Her dad is a whole other story).\n\nIt just makes me miserable to have to put up with this manchild when my fiancé and I are spending a lot of time, effort and money to travel and support her family. Plus we see him splurging cash on his boy toys when we are struggling by to get enough money for our wedding (we only want a small ceremony of like 20 people and no formal reception service, but even that is a lot of money to us).\n\nI don't get it at all. The double standard between how their expect her to act and what he gets away with is galling. Especially when her parents seem to love and appreciate him more than they do her, despite her bending over backwards for them.\n\nI honestly wish I never had to come here, but I know it's so important to my fiancé and I will always support her 100%.\n\nAnyway... rant over!\n\nFeel free to share your experiences of idiot brothers or brothers in law.\n\nMuch love xxxx\n\n\nEdit: In case it wasn't clear we are both women.",
    "title": "My Fiancé's brother is a gross manchild",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1628239017,
    "score": 109,
    "keyword": "chinese judge"
  },
  {
    "text": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender This happened about a year ago, but due to recent events in \"the bible belt\", I remembered it and thought it was worth sharing.\n\nSo I was working for a consultancy company which was doing work all over the place. I didn't have a project for a while so the pressure was on to get me to a client, no matter what or where. One day we get an email from sales that a position had opened up in a place that I never heard of. It turned out to be a small/medium-sized village in bumfuck nowhere with an industrial park that housed a couple of big companies for that region.\n\ninitially, my manager (Chinese) always sends a couple of internal resumes with one or two obvious good matches. She didn't get any replies, followed by the sales rep saying \"this is the bible belt, unfortunately, they are not as progressive as our company. They said they wanted to handle communications with me instead\". That should have been a red flag from the start but since this was an international partner the company didn't care (which was a red flag for me to get out eventually).\n\nThen they asked if they could interview a top 3, where I wasn't part of. My manager pushed for me to be included because all 3 were male. Me and another female colleague, with way more experience, were skipped.\n\nWe start the call and almost immediately we get \"What are Sara(not my real name), Wendy(manager) and Jenny doing in this call!?\" and \"listen, you have to understand that...here in bumfuck nowhere we don't work alongside women. It will impact our working environment\". It was obvious the guy wanted to say that he didn't want to work with women. I stepped in and hijacked the whole thing and start asking them questions about the project, what skills they need, etc to get the conversation back on track. At the end of the call, Jenny almost quit on the spot for not being defended by the sales rep.\n\nThe client was happy with the call and invited me to do an in-person interview (according to the sales rep, which I didn't believe for a second). So I travel to bumfuck nowhere and I feel like I'm traveling to a different country where it would be wise to carry a pocket knife or something.\n\nIt was cold that day so I were a sweater (keep that in mind). I enter the office building, meet the guy we spoke to, he gets another colleague to do the interview with and we enter a meeting room. 30 minutes since I entered the building and I realize I didn't give my name and I start to get very scared. I tell them of my experience and my team. I also sneak in some things about my manager and Jenny and the guy goes \"yeah what is Wendy anyway? Chinese? Japanese? I can't tell those people apart. And Jenny? Why the hell is that young woman working? I don't understand women from where you come from\". I try to play it off that men and women should have equal opportunities in life and he replies \"it's not right, women shouldn't work at that age. They should stay at home and take care of their partner\" and I think to myself \"HOLY SHIT I REALLY AM IN BUMFUCK NOWHERE! IS THIS STILL THE SAME COUNTRY I LIVE IN!?\"\n\nSo then they start glancing over the printed resumes and see that I am actually Sara and it gets super quiet while I'm already thinking about how many people I have to walk past and how many doors are between me and the fresh air. Then the other says \"hmm...so you're one of those transvestite people, are you?\". And I say \"well it's called transgender actually and yes\". What followed was a bombardment of slurs and nasty comments like \"God doesn't approve of that kind of lifestyle, you're a sinner\" to a point where I disconnected myself from reality until it was over. At some point, I came back to reality and said \"well it's obviously not going to work out but thanks for inviting me\". I tried to shake his hand but he gave me the meanest look I've ever seen. When I walked out a group of people went quiet and started laughing when they realized.\n\nI walked out, shaking, and had to sit on a bench for a couple of minutes. It was like all the work I put in my self-esteem and confidence over the years was instantly worthless. Every time someone walked past me I felt scared and judged. I took the first train back and stopped at a train station where I was 100% sure to be comfortable and had some fast food for lunch to comfort myself. I felt so betrayed by my employer that my trust in them never recovered and I eventually left the company.\n\nThe only thing that kept me going was the thought that the world is a big place and that there are many places other than bumfuck nowhere to live my life.\n\nedit: grammar fixes",
    "title": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615114235,
    "score": 0,
    "keyword": "chinese judge"
  },
  {
    "text": "Dear Postgraduate Black Americans studying in the UK: ©️world2021 \n\nDear Postgraduate Black Americans studying in the UK: \n\n**THE BAD**\nYou will be the only one if you're in the arts/humanities at postgraduate level and chose your supervisor for their expertise (as you should) rather than choosing to be in London or Manchester to be surrounded by other black people. \n\n**THE NEUTRAL**\nYou are probably currently residing amongst a lot of Chinese postgrads if you're in halls. They may or may not be open to you. \n\n**THE GOOD**\nThis is an opportunity to get to know a more diverse set group of people than you've (probably) previously mixed with socially. Embrace that. \n\n**THE BRITISH**\nPeople like to think of themselves as tolerant, fair and most definitely not racist. You will judge for yourself the extent to which that's true or not, but that's how people tend to think. You will at times encounter ignorance, especially if absolutely everyone is white, but it's highly unlikely to be the case within a university. Where you do encounter ignorance, most people will be open to discussion in the right setting. They will be horrified to know they've caused unintended offence. (No that doesn't necessarily make it ok.) \n\nNow for some advice. Note, you will almost always be understood regardless of what you say, so some of the later language advice is simply to avoid inadvertently irritating us. \n\n**MEETING & COMMUNICATION WITH OTHER PEOPLE** - THE DOS \n\n+ Be open to everyone. \n\n+ Take people as you find them, not as you expect to find them. \n\n+ Always join your colleagues when invited to the pub. (Until such time as you decide that you definitely, 100% cannot stand them, if that happens) \n\n+ Go to fresher's week. Join clubs and societies around activities that interest you. *This will probably be you best source of friendship.* \n\n+ Visit every museum you can - they're mostly free \n\n+ Take advantage of student discounts, especially for cultural activities like live theatre. Ask the Student Union for more info. \n\n+ Visit other parts of the UK (there will be discounted tours-again you'll find organisers in Fresher's Week). \n\n+ Visit Europe for more than a day's shopping trip. North Africa is also close and relatively inexpensive. \n\n+ Join a religious community if that's important to you. \n\n+ Try to be specific in your use of language. E.g. *I'm from the South*...of...? Texas? The States? Scotland? England? London? Cornwall? \n\n+ Mind your Ps & Qs (🔍) - always, always say thank you. It is not necessary to respond to a thank you. \n\n+ Learn how we use the terms race and especially [ethnicity here](https://www.ethnicity-facts-figures.service.gov.uk/ ) \n\n+ Watch *Question Time* and *Newsnight* on BBC2 or iplayer to get a better understanding of British politics, especially the views of the 'left' and 'right' which you may find surprising as the terms do not correlate with American usage. Or don't. \n\n+ Look for opportunities to contribute - for example, by volunteering as a mentor in a local school. Black arts and humanities academics are rare. Be the change you want to see. Or don't. \n\n**MEETING & COMMUNICATION WITH OTHER PEOPLE** - THE DON’TS \n\n+ Don't take offence to any of the following if it doesn’t apply to you. This has taken a long time to compile, is based on experience of black Americans in British universities, and I'm only trying to help you. \n\n+ Do not generalise and say *Britain/the UK is like x* or *British people are like y* if you've only been to whatever part of it you're in. You'll offend. (See, be specific above) \n\n+ Do not say that you go to school. You go to university or uni. Only children go to school. \n\n+ Do not exclude anyone as a potential friend on the grounds of race, religion or sexuality. \n\n+ Do not assume that mixed-race people identify as black. They may and they may not. \n\n+ Do not assume that others share your religious beliefs, if you have any. Most Brits (Europeans) are irreligious and secular; even most who describe themselves as 'Christian' often merely mean that they were baptised as an infant or that they're white or that they're *not* a Muslim or Hindu. \n\n+ Do not fear: Muslims (potential friends and allies), terrorism (that would just be unpreventable very, very bad luck) or knife crime (no one is looking for you). \n\n**MEETING OTHER BLACK PEOPLE** \n\n+ Join the ACS (Afro-Caribbean society) to meet fellow black students. \n\n+ Go to uni club nights that play your sort of music if that's your thing. (Prob Thursdays if you like Afrobeats, R&B etc. Don't expect it to be majority black though). \n\n+ Use meetup.com to find black locals who want to mingle. Unless you're in the countryside, there probably *are* ethnic minorities where you live but they are not likely to live anywhere near your university. \n\n+ Go to the pub (the repetition is deliberate). Drink alcohol; don't drink alcohol. But whatever you drink, go. \n\nWelcome and enjoy!",
    "title": "Dear Postgraduate Black Americans studying in the UK:",
    "subreddit": "blackladies",
    "timestamp": 1632057579,
    "score": 25,
    "keyword": "chinese judge"
  },
  {
    "text": "Apparently \"Women don't kill men!\" 1. [Woman kills man for refusing to give her beer](https://href.li/?http://www.nbcmiami.com/news/Keys-Woman-Kills-Man-Who-Refused-to-Give-Her-Beer-Cops-164255176.html) \n2. [Woman stabs man for refusing to have sex with her, threatens to cry rape](https://href.li/?http://www.dailymail.co.uk/news/article-2205067/Woman-stabbed-man-refused-sex-threatened-rape-went-hospital-treatment.html) \n3. [Woman rips off man’s testicle because he rejected her, tried to swallow it](https://href.li/?http://news.bbc.co.uk/2/hi/4253849.stm)\n4. [Woman kills man for refusing to marry her](https://href.li/?http://cdnc.ucr.edu/cgi-bin/cdnc?a=d&d=LAH19080719.2.31.14) \n5. [Woman cuts off man’s penis because of argument](https://href.li/?http://www.ibtimes.com/catherine-kieu-sentenced-california-woman-who-cut-husbands-penis-gets-7-years-life-prison-1328289) \n6. [Woman shoots her husband after argument](https://href.li/?http://www.myfoxhouston.com/story/22487331/2013/06/03/woman-charged-in-her-husbands-shooting-death) \n7. [Woman cuts off cheating boyfriend’s penis, flushes it](https://href.li/?http://www.huffingtonpost.com/2012/09/04/julia-munoz-huaman-cut-off-boyfriends-penis-flushed-toilet_n_1854924.html)\n8. [Woman suspects husband of cheating, stabs him to death](https://href.li/?http://www.nydailynews.com/news/crime/fla-woman-stabs-cheating-husband-death-article-1.1386046) \n9. [Woman shoots, kills boyfriend for cheating](https://href.li/?http://www.clickorlando.com/news/Cops-Woman-shot-killed-boyfriend-in-Pine-Hills-over-cheating/16814162) \n10. [Woman stabs boyfriend for cheating in Monopoly board game](https://href.li/?http://www.thesmokinggun.com/buster/assault/new-mexico-monopoly-stabbing-976532) \n11. [Woman shoots, kills man for ending relationship](https://t.umblr.com/redirect?z=http%3A%2F%2Fwww.nytimes.com%2F2006%2F06%2F24%2Fus%2F24brfs-002.html&t=ZGQ3MmYwYmIyOTExMjBkMDlhNDdhODVhNjI2OTgyNDM2NWM3ZDEwNiw3ZTQ5ZjE0OTg5YTg2Mzk5ODUwNzdkYWExZTVkNDhmZWM3MmQ2YWQ5&ts=1619557860) \n12. [Woman sets husband’s genitals on fire for hugging another woman, dies](https://href.li/?http://www.nydailynews.com/news/world/australian-woman-accused-torching-husband-genitals-charged-murder-article-1.420833) \n13. [Woman kills, dismembers husband’s body over argument](https://href.li/?http://www.cnn.com/2012/06/06/world/brazil-dismemberment/) \n14. [Mother kills 18-month old twins to get back at husband she thought was cheating](https://href.li/?http://www.dailymail.co.uk/news/article-2151941/Stacey-Smalls-held-bail-murdering-twins-cheating-husband.html) \n15. [Woman kills husband after he confronts her about affair](https://href.li/?http://www.complex.com/city-guide/2012/04/woman-gets-25-to-life-for-killing-husband-then-hiring-hitman-to-kill-her-lover) \n16. [Woman kills cheating husband with lethal dose of heroin](https://href.li/?http://bc.ctvnews.ca/woman-killed-cheating-husband-with-overdose-of-heroin-1.576435) \n17. [Woman runs over, kills cheating husband](https://href.li/?http://www.click2houston.com/news/Police-Wife-Runs-Over-Cheating-Husband/2871106) \n18. [Obese woman sits on boyfriend, kills him and avoids jail time](https://href.li/?http://www.cbsnews.com/news/woman-kills-boyfriend-by-sitting-on-him-but-mia-landingham-isnt-going-to-jail/) \n19. [Woman kills boyfriend with stiletto shoe](https://href.li/?http://www.nydailynews.com/news/national/tx-woman-found-guilty-killing-boyfriend-stiletto-heel-article-1.1749860)\n20. [Woman murders cheating husband with coffee mug](https://href.li/?http://www.huffingtonpost.com/2013/08/26/wife-kills-husband-coffee-cup_n_3815121.html) \n21. [Woman kills boyfriend for not buying her a gift ](https://href.li/?http://www.theroot.com/articles/culture/2014/05/pregnant_chicago_woman_kills_boyfriend_over_failure_to_buy_gift_1.html)\n22. [Woman kills boyfriend who accused her of cheating](https://href.li/?http://www.ledger-enquirer.com/2014/04/15/3057346/russell-county-sheriffs-office.html) \n23. [Woman stabs and kills boyfriend , Judge: “I hope you die in prison”](https://href.li/?http://www.kmov.com/video/yahoo-video/Judge-to--255634951.html)\n24. [Woman shoots, kills ex-boyfriend, buries him in pile of debris](https://href.li/?http://www.nbc-2.com/story/24230991/lee-county-woman-gets-life-in-prison-for-killing-ex-boyfriend) \n25. [Woman shoots boyfriend in the back of the neck, killing him](https://href.li/?http://www.santafenewmexican.com/news/local_news/police-woman-shot-boyfriend-from-behind/article_6a94a7ad-51cf-5d97-8f7a-5b508206ef82.html) \n26. [Woman shoots boyfriend six times, kills him after argument](https://href.li/?http://www.msnewsnow.com/story/25206075/northeast-jackson-woman-jailed-for-killing-boyfriend) \n27. [Woman stabs, kills boyfriend over mother’s day gift](https://href.li/?http://www.kens5.com/news/151524285.html) \n28. [Woman stabs boyfriend to death, also stabbed her husband to death 7 years prior](https://href.li/?http://www.elpasotimes.com/news/ci_25268807/el-paso-woman-previously-convicted-common-law-husbands)\n29. [Woman pushes way into home, stabs boyfriend to death over argument](https://href.li/?http://napavalleyregister.com/news/local/woman-sentenced-to-seven-years-in-prison-for-killing-boyfriend/article_282b67d7-4a75-592e-b603-eb2c65d71428.html) \n30. [Woman angry at boyfriend takes her anger out on his 4 year-old](https://href.li/?http://kfdm.com/shared/news/top-stories/stories/kfdm_police-woman-kills-boyfriends-4yearold-daughter-fit-anger-4200.shtml?wap=0) \n31. [Woman stabs boyfriend to death, thought he was cheating on her](https://href.li/?http://www.idahostatesman.com/2014/04/22/3148973/nampa-woman-to-serve-at-least.html) \n32. [Woman bludgeons husband to death with hammer to pay back loan](https://href.li/?http://www.emirates247.com/news/woman-kills-hubby-to-repay-loan-from-ex-boyfriend-2014-04-09-1.544858) \n33. [Woman stabs, kills boyfriend during argument](https://href.li/?http://www.mercurynews.com/peninsula/ci_25549887/east-palo-alto-woman-who-killed-boyfriend-steak) \n34. [Woman murders boyfriend for tweeting out his female crush](https://href.li/?http://gossipplug.com/man-killed-by-girlfriend-after-tweeting-his-womancrushwednesday/) \n35. [Woman shoots and kills boyfriend, kills self while out on bail](https://href.li/?http://www.wcti12.com/news/sheriffs-office-suspect-in-boyfriends-murder-found-dead/25518718) \n36. [Woman stabs to death boyfriend over argument about an ex](https://href.li/?http://www.registercitizen.com/general-news/20140219/torrington-woman-accused-of-killing-her-boyfriend-in-jealous-rage-police-say) \n37. [Woman stabs and kills boyfriend for social media posts](https://href.li/?http://timeli.info/item/631340/Huff_Post_Weird_News/Shardonnae_Pruitt__Chicago_Woman__Charged_With_Fatally_Stabbing_Boyfriend) \n38. [Woman shoots boyfriend in the face, fails to make it look like suicide](https://href.li/?http://wnep.com/2014/04/02/woman-admits-shooting-boyfriend-in-the-face-killing-him/) \n39. [Woman kills boyfriend’s puppies during phone argument](https://href.li/?http://www.nbcnewyork.com/news/local/American-Bulldog-Puppies-Killed-Food-Cooler-Linden-New-Jersey-Woman-Arrested-226958931.html)\n40. [Woman shoots boyfriend in the face with rifle during argument](https://href.li/?http://www.saratogian.com/general-news/20120702/victim-was-unarmed-at-the-time-of-fatal-schuylerville-shooting-prosecutors-say) \n41. [Woman pushes boyfriend off fence after argument, killing him](https://href.li/?http://www.10news.com/news/san-diego-woman-who-killed-boyfriend-expected-to-be-sentenced-today-021914) \n42. [Woman attacks boyfriend with large knife, intent to kill ](https://href.li/?http://www.kfvs12.com/story/25630426/m/category/106766/radar-images)\n43. [Woman abused, threatens to kill boyfriend in sleep](https://href.li/?http://helenair.com/news/local/woman-threatens-to-kill-boyfriend/article_33e6d76e-940d-11e3-91e0-0019bb2963f4.html)\n44. [Woman beats, murders boyfriend and puts him in freezer because he wanted to break up with her](https://href.li/?http://nypost.com/2013/08/27/rejected-minn-woman-kills-boyfriend-hides-body-in-freezer/)\n45. [Woman held gun to boyfriend’s head, murders on Christmas](https://href.li/?http://fosters.com/apps/pbcs.dll/article?AID=/20120619/GJNEWS_01/706199916) \n46. [Woman with previous assault charge on another boyfriend stabs and kills different boyfriend ](https://href.li/?http://www.statesman.com/news/news/local/woman-pleads-guilty-to-killing-boyfriend/nW65R/)\n47. [Woman attempts to murder boyfriend with giant breasts ](https://href.li/?http://www.huffingtonpost.co.uk/2012/11/26/franziska-hansen-attempted-murder-boyfriend-smother-dd-breasts_n_2190794.html)\n48. [Woman stabs boyfriend in neck, killing him after argument](https://href.li/?http://www.timesdispatch.com/news/local/crime/woman-gets-years-for-plunging-knife-into-boyfriend-s-neck/article_25c72cb4-3815-11e3-9c76-0019bb30f31a.html) \n49. [Woman chokes and stabs ex-boyfriends cat to death ](https://href.li/?http://calcoastnews.com/2014/01/santa-maria-woman-arrested-killing-ex-boyfriends-cat/)\n50. [Woman starts argument with boyfriend, stabs and kills with umbrella](https://href.li/?http://www.enca.com/south-africa/woman-kills-boyfriend-umbrella) \n51. [Woman kills boyfriend with her car after argument](https://href.li/?http://cjonline.com/news/2012-09-19/woman-accused-using-car-kill-boyfriend) \n52. [Woman shoots, kills boyfriend in his bathroom](https://href.li/?http://www.wsoctv.com/news/news/local/woman-accused-killing-boyfriend-makes-first-court-/nJQSS/) \n53. [Woman shoots, kills boyfriend with illegal handgun ](https://href.li/?http://www.myfoxtampabay.com/story/19634275/2012/09/25/deputies-charge-woman-in-domestic-murder)\n54. [Woman sets her boyfriend on fire, killing him](https://href.li/?http://elitedaily.com/news/world/woman-kills-boyfriend-setting-fire-slept/) \n55. [Woman shoots and kills ex-boyfriend multiple times, kills herself](https://href.li/?http://www.examiner.com/article/edris-msundastood-dickson-murder-suicide)\n56. [Woman shoots boyfriend in the head, found out he was dating other women](https://href.li/?http://www.alaskadispatch.com/article/20131207/anchorage-woman-charged-boyfriends-fatal-shooting) \n57. [Woman stabs and kills boyfriend over finances](https://href.li/?http://www.news-journalonline.com/article/20100813/ARTICLES/308139998) \n58. [Woman stabs and kills boyfriend’s lizard because she thought he was flirting with other women ](https://href.li/?http://www.sfexaminer.com/sanfrancisco/heartsick-san-carlos-woman-kills-boyfriends-pet-lizard-allegedly-threatens-suicide/Content?oid=2179731)\n59. [Woman shoots, kills boyfriend who wanted to end their relationship and urged her to get an abortion ](https://href.li/?http://www.nydailynews.com/archives/news/judge-lets-pull-back-guilty-plea-slaying-article-1.500266)\n60. [Woman attempts to murder husband with poison in her vagina](https://href.li/?http://www.huffingtonpost.co.uk/2013/01/29/vagina-murder-plot-brazilian-man-wife-poisoning-_n_2572836.html?utm_hp_ref=uk)\n61. [Woman stabs boyfriend to death after he slaps daughter](https://href.li/?http://articles.baltimoresun.com/1995-03-07/news/1995066110_1_kogan-gordon-stabbing)\n62. [Woman conspires to have secret lover murder her husband](https://href.li/?http://www.abc.net.au/news/2011-11-28/wife-jailed-for-conspiring-to-kill-husband/3699134)\n63. [Woman stabs, kills boyfriend over argument on Labor Day](https://href.li/?http://www.sltrib.com/sltrib/news/57997809-78/nguyen-child-witnesses-stabbing.html.csp?page=1)\n64. [Woman stabs boyfriend in the chest over argument](https://href.li/?http://www.nydailynews.com/news/crime/woman-won-ochocinco-show-stabbed-boyfriend-police-article-1.1810700) \n65. [Woman stabs boyfriend to death after finding photos of other women on cell phone](https://href.li/?http://www.pjstar.com/x1456178748/Woman-indicted-in-stabbing-death-of-her-boyfriend) \n66. [Woman tortured ex-boyfriend’s dog until it died after argument](https://href.li/?http://www.nbc15.com/news/state/headlines/Woman-accused-of-strangling-boyfriends-dog-232054331.html) \n67. [Woman stabs boyfriend in his chest and through his lung, nearly killing him](https://href.li/?http://www.nydailynews.com/new-york/nyc-crime/woman-convicted-attempted-murder-boyfriend-stabbing-article-1.1524639) \n68. [Woman fatally stabs boyfriend during heated argument](https://href.li/?http://www.boston.com/news/local/massachusetts/articles/2012/09/12/worcester_woman_pleads_guilty_to_killing_boyfriend/) \n69. [Woman kills her boyfriend with blunt force trauma to the head using frying pan](https://href.li/?http://abc30.com/archive/8781340/)\n70. [Woman stabs boyfriend to death for drinking her beer ](https://href.li/?http://articles.chicagotribune.com/2008-08-08/news/0808071113_1_boyfriend-beer-stabbing)\n71. [Woman strangles boyfriend to death during argument](https://href.li/?http://www.latimes.com/wxin-woman-strangled-boyfriend-police-woman-strangled-boyfriend-to-death-during-argument-20111028-column.html) \n72. [Woman stabs boyfriend with serrated knife over argument](https://href.li/?http://articles.philly.com/2003-09-30/news/25458352_1_steak-knife-boardinghouse-norristown-woman) \n73. [Woman shoots, murders boyfriend while she was on house arrest for another murder 11 years prior](https://href.li/?http://www.fox19.com/story/19448302/deputies-woman-kills-boyfriend-on-home-detention-for-murder-read-more-httpwwwwyff4comnewslocal-newsspartanburg-cherokee-newsdeputies-woman-kills) \n74. [Woman stabs, kills boyfriend then texts friend about eating the body ](https://href.li/?http://www.dailytelegraph.com.au/news/nsw/tamie-melehan-stabbed-boyfriend-david-vaughan-and-sent-text-message-that-she-was-going-to-eat-the-body/story-e6freuzi-1225843849086)\n75. [Woman stabs, kills boyfriend over dispute](https://href.li/?http://www.ocregister.com/articles/castillo-341590-foster-time.html) \n76. [Woman shoots boyfriend in the head, suspecting he was cheating](https://href.li/?http://articles.sun-sentinel.com/2013-01-23/news/fl-sunrise-attempted-murder-20130123_1_boyfriend-sunrise-police-report-broward-health-medical-center) \n77. [Woman shoots man in the groin after argument ](https://href.li/?http://www.myfoxal.com/story/19628629/man-sent-to-the-hospital-after-girlfriend-shoots-him-in-the-groin)\n78. [Woman fires handgun into the home of man who denied her a kiss](https://href.li/?http://www.thesmokinggun.com/documents/florida/woman-92-goes-ballistic-after-being-denied-kiss-874093) \n79. [Woman stabs husband to death over cheating fears](https://href.li/?http://nypost.com/2013/10/03/wife-stabs-husband-to-death-over-cheating-fears-police/) \n80. [Woman shoots, kills ex-boyfriend and his new girlfriend](https://href.li/?http://www.nydailynews.com/news/national/woman-kills-new-girlfriend-committing-suicide-cops-article-1.1787967) \n81. [Women kills husband, commits suicide ](https://href.li/?http://www.chron.com/news/houston-texas/houston/article/Woman-kills-husband-then-commits-suicide-5106696.php)\n82. [Woman shoots and kills man over argument](https://href.li/?http://detroit.cbslocal.com/2012/10/15/detroit-woman-charged-with-boyfriends-murder/) \n83. [Woman kills husband with baseball bat for talking back to her](https://href.li/?http://iactafool.com/80-year-old-woman-kills-husband-for-talking-smart/) \n84. [Woman kills husband, confesses to family then shoots herself ](https://href.li/?http://www.click2houston.com/news/hpd-wife-kills-huband-kills-herself-in-relatives-home/23723970)\n85. [Woman stabs boyfriend 31 times after he said ex’s name in his sleep](https://href.li/?http://shanghaiist.com/2013/09/27/woman_stabs_boyfriend_31_times_after_he_says_womans_name_in_sleep.php) \n86. [Woman shoots husband in the head, shoots herself ](https://href.li/?http://www.nola.com/crime/index.ssf/2012/01/metairie_woman_kills_husband_f.html)\n87. [Woman kills boyfriend over argument at house party](https://href.li/?http://www.mercurynews.com/ci_21830489/police-stockton-woman-kills-boyfriend-at-san-jose) \n88. [Woman shoots boyfriend with shotgun for texting another woman](https://href.li/?http://www.goupstate.com/article/20130521/ARTICLES/130529929) \n89. [Woman kills boyfriend because she “smelled sex on him”](https://href.li/?http://www.foxnews.com/us/2012/12/05/pennsylvania-woman-killed-boyfriend-after-smelled-sex-on-him-prosecutor-says/) \n90. [Woman runs over boyfriend, kills him](https://href.li/?http://www.kansas.com/2013/03/26/2733932/woman-sentenced-to-prison-for.html)\n91. [Woman stabs boyfriend in the eye for turning down threesome](https://href.li/?http://gawker.com/florida-woman-stabs-boyfriend-in-the-eye-for-turning-do-1443119495) \n92. [Woman stabs ex-boyfriend for refusing to stop playing the Eagles](https://href.li/?http://gawker.com/woman-stabs-roommate-for-refusing-to-stop-listening-to-1335462841) \n93. [Woman stabs boyfriend, throws out his prosthetic legs so he can’t chase her](https://href.li/?http://www.complex.com/city-guide/2013/03/south-carolina-woman-stabs-boyfriend-throws-out-prosthetic-legs-so-he-cant-chase-her) \n94. [Woman ties up, stabs husband 193 times, jury finds her guilty for suspicion of trying to claim life insurance ](https://href.li/?http://abcnews.go.com/GMA/story?id=127995)\n95. [Woman stabs fiance for refusing to take her to the liquor store](https://href.li/?http://blog.chron.com/hottopics/2014/02/police-florida-woman-stabs-fiance-after-he-rejects-liquor-store-trip/) \n96. [Woman assaults and threatens boyfriend with knife for not cuddling](https://href.li/?http://www.dailymail.co.uk/news/article-2548417/Florida-woman-pulled-knife-boyfriend-refused-CUDDLE-not-face-criminal-charges.html) \n97. [Woman stabs man with ceramic squirrel for not bring home beer](https://href.li/?http://www.lipstickalley.com/showthread.php?p=15644161) \n98. [Woman stabs taxi driver after he refuses to have sex with her](https://href.li/?http://www.dailymail.co.uk/news/article-2600488/Sex-crazed-Angelina-Jolie-lookalike-given-suspended-sentence-forcing-taxi-driver-sex-twice-stabbing-not-manage-time.html) \n99. [Woman stabs ex-boyfriend in his penis after discovering he had a new girlfriend](https://href.li/?http://www.dailymail.co.uk/news/article-1277118/Jilted-lover-stabbed-ex-lover-manhood-drove-home.html)\n100. [Woman stabs boyfriend twice over time he spent in bathroom](https://href.li/?http://www.naplesnews.com/news/2011/may/22/immokalee-woman-stabs-boyfriend-twice-over-his-tim/?partner=popular) \n101. [Woman stabs boyfriend over Facebook post](https://href.li/?http://www.examiner.com/article/texas-woman-stabs-husband-over-something-she-read-on-facebooks-drugs-involved) \n102. [Woman stabs her boyfriend several times because his dog ate her marijuana stash ](https://href.li/?http://www.dailymail.co.uk/news/article-2473153/Shadae-Scott-Model-stabbed-boyfriend-dog-ate-stash-marijuana.html)\n103. [Woman stabs boyfriend for not calling her every two hours](https://href.li/?http://www.dailymail.co.uk/news/article-2505127/Rhiann-Burnie-21-stabbed-boyfriend-ringing-hours.html) \n104. [Woman shoots man five times for rejecting her, kills herself](https://href.li/?http://archive.wltx.com/news/story.aspx?storyid=53403) \n105. [Woman murders ex-boyfriend with liquor laced with poison, was jealous he was engaged to new woman](https://href.li/?http://abcnews.go.com/2020/jealous-woman-20-years-jagermeister-murder/story?id=19546701) \n\n[**Comedian Phil Hartman was murdered by his wife on May 27th 1998**](https://href.li/?http://www.cnn.com/SHOWBIZ/TV/9805/28/hartman/)\n\n[**NFL player Steve McNair was murdered by his girlfriend on July 4th, 2009**](https://href.li/?http://en.wikipedia.org/wiki/Steve_McNair#Death)\n\n[**John Wayne Bobbitt had his penis cut completely off on June 23rd, 1993**](https://href.li/?http://en.wikipedia.org/wiki/John_Bobbitt_(penile_amputee)#Incident)\n\n[**Travis Alexander was murdered by Jodi Arias on June 4th, 2008**](https://href.li/?http://en.wikipedia.org/wiki/Murder_of_Travis_Alexander#Death)\n\n[**Andrew Bagby was murdered by Shirley Jane Turner on November 6th, 2001**](https://href.li/?http://en.wikipedia.org/wiki/Murder_of_Zachary_Turner#Bagby_murder_and_investigation) **(**[**She later murdered their 1 year-old son on August 18th, 2003**](https://href.li/?http://en.wikipedia.org/wiki/Murder_of_Zachary_Turner#The_murder-suicide)**)**\n\n[**Brenda Spencer killed two and injured nine at Cleveland Elementary School on January 29th, 1979**](https://href.li/?http://en.wikipedia.org/wiki/Cleveland_Elementary_School_Shooting_(San_Diego)#Shooting)\n\n[**Laurie Dann killed one boy and injured five others at Hubbard Woods Elementary School on May 20th, 1988**](https://href.li/?http://en.wikipedia.org/wiki/Laurie_Dann#Attacks)\n\n[**Jennifer San Marco killed eight people at Goleta postal facility on January 30th, 2006**](https://href.li/?http://en.wikipedia.org/wiki/Jennifer_San_Marco)\n\n[**Sylvia Seegrist killed three and injured seven during a shooting spree at a Springfield mall on October 30th, 1985**](https://href.li/?http://en.wikipedia.org/wiki/Sylvia_Seegrist)\n\n[**Mary Ann Holder killed five children including her own son in Pleasent Gardens, NC on November 20th, 2011**](https://href.li/?http://murderpedia.org/female.H/h/holder-mary-ann.htm)\n\n[**Jullian Robbins killed one and injured two at Penn State on September 17th, 1997**](https://href.li/?http://en.wikipedia.org/wiki/Hetzel_Union_Building_shooting#1996_Shooting)\n\n[**Heather Smith killed two then committed suicide at Spanaway Junior High School on November 26th, 1985**](https://href.li/?http://www.apnewsarchive.com/1985/Distraught-Over-Losing-Boyfriend-Girl-Kills-Two-Then-Herself/id-075d33aa6600d2e6b30d969ba3edaf0d)\n\n[**Latina Williams killed two others then self at Louisiana Technical College on February 8th, 2008**](https://href.li/?http://en.wikipedia.org/wiki/Louisiana_Technical_College#2008_shooting)\n\n[**Amy Bishop Anderson killed three and wounded three others at the University of Alabama on February 12th, 2010**](https://href.li/?http://en.wikipedia.org/wiki/2010_University_of_Alabama_in_Huntsville_shooting#Shooter)\n\nWhat’s most interesting though is that mainstream media [doesn’t even mention female shooters](https://href.li/?http://www.nydailynews.com/news/national/mass-shootings-central-american-history-article-1.1457514) when they claim to show the history of the crime — but I guess they’re going by high scores. While its true that most shooting sprees are committed by males, it is also true[that most child abuse, neglect, and murders are committed by females](https://href.li/?http://archive.acf.hhs.gov/programs/cb/pubs/cm09/cm09.pdf).\n\nWomen who killed or attempted to kill children in the news, past 30 days (US):\n\n1. [Florida woman shoots, kills her 2 teenage sons](https://href.li/?http://guardianlv.com/2014/05/florida-woman-allegedly-kills-her-teenage-children-because-they-were-really-mean/) \n2. [Mother throws 1 year-old daughter under truck, kills her](https://href.li/?http://hollywoodlife.com/2014/04/30/chinese-woman-throws-baby-under-moving-truck-kills-daughter-hu-chen/) \n3. [California mom stabs her 3 daughters to death. all under 2 years old](https://href.li/?http://www.nydailynews.com/news/crime/3-girls-found-dead-calif-home-mom-arrested-cops-article-1.1800154)\n4. [Mother attempts to kill her 3 teenage children](https://href.li/?http://www.myfoxphilly.com/story/25266213/mother-charged-with-trying-to-kill-her-three-teenagers) \n5. [Mother kills her infant son by stabbing him to death](https://href.li/?http://www.nbcbayarea.com/news/local/Livermore-Woman-Accused-of-Killing-Child-at-Park-256858241.html) \n6. [Woman kills 2 year-old girl, attempts to kill 10 year-old boy](https://href.li/?http://www.cbs12.com/news/top-stories/stories/jupiter-woman-kills-exdomestic-partners2yearold-daughter-attempted-murdersuicide-16264.shtml?wap=0&?hot=1) \n7. [Utah mom murders 6 newborns, keeps them in garage](https://href.li/?http://www.nydailynews.com/news/crime/utah-mom-killed-newborns-couldn-remember-dead-babies-garage-police-article-1.1777762) \n8. [Mother charged with trying to suffocate daughter](https://href.li/?http://chicago.cbslocal.com/2014/04/29/mother-charged-with-trying-to-suffocate-daughter/) \n9. [Woman charged for killing 8-month old baby](https://href.li/?http://www.thenewstribune.com/2014/04/30/3173379/tacoma-woman-charged-in-death.html) \n\nWomen who killed or attempted to kill children in the news between January and April 2014 (US):\n\n1. [Mother drowns both of her sons aged 3 and 6](https://href.li/?http://www.nydailynews.com/news/national/child-left-brain-dead-mom-drowning-attempt-dies-article-1.1747035) \n2. [Mother attempts to drown her 3 children in ocean](https://href.li/?http://www.foxnews.com/us/2014/03/07/kids-rescued-from-ocean-said-mom-tried-to-killed-us-sc-woman-charged-with/) \n3. [Utah mother shoots and kills two teen daughters, then herself](https://href.li/?http://www.nydailynews.com/news/crime/utah-mom-shoots-kills-young-daughters-article-1.1581034) \n4. [Mother suffocates 14 month old son, fails at attempted suicide](https://href.li/?http://fox6now.com/2014/03/11/woman-charged-following-death-of-14-month-old-son/) \n5. [Woman babysitter murders 19 month old boy](https://href.li/?http://www.wfsb.com/story/24589635/parents-of-baby-allegedly-killed-by-babysitter-arrested) \n6. [Mom kills 7 month old daughter, blames Jesus](https://href.li/?http://www.huffingtonpost.com/2014/03/10/stefany-paige-johnson_n_4937447.html) \n7. [Woman operating illegal daycare responsible for 3 month old girl’s death, police find 14 children in her basement](https://href.li/?http://www.huffingtonpost.com/2014/03/11/pamela-wood-baby-death-daycare_n_4943063.html) \n8. [Mom strangles 3 day old baby boy, discarded body in trashcan](https://href.li/?http://www.mysanantonio.com/news/local/article/Mom-said-she-strangled-newborn-watched-him-die-5144862.php) \n9. [Woman suffocates 2 year old girl of fiance, fakes sexual assault by unknown assailant to cover tracks](https://href.li/?http://www.nbcdfw.com/news/local/Plano-Police-Make-Arrest-in-2-Year-Olds-Death-242496231.html) \n10. [Mother charged with killing 2 year-old daughter](https://t.umblr.com/redirect?z=http%3A%2F%2Fwww.nytimes.com%2F2014%2F02%2F06%2Fnyregion%2Fwoman-is-charged-in-killing-of-daughter-2.html%3F_r%3D0&t=YzMwZjRkNDNhMTUxNDcyNTMyZGY5MWE2NGZhYzkyOTQ0MzFmMGE3Yiw3OGQ0NWRkYzJlNzg2NTJjY2ExOGIxODM2NDk0ZWUwNzQ4ODdmNTM1&ts=1619557860) \n11. [Mother of several children with history of violence murdered and buried 2 year-old daughter in shallow grave](https://href.li/?http://www.wesh.com/news/central-florida/seminole-county/sanford-police-arrest-rachel-fryer-for-homicide-in-death-of-buried-toddler-taraji-gordon/24697228) \n12. [Mother stabs and kills her 2 children in exorcism](https://href.li/?http://www.cnn.com/2014/01/19/justice/maryland-exorcism-deaths/) \n13. [Mother kills her teen son and daughter, self](https://href.li/?http://www.cnn.com/2014/01/15/us/florida-mother-double-murder-suicide/) \n14. [Mother confesses to killing 10 year-old son](https://href.li/?http://crimeblog.dallasnews.com/2014/01/frisco-police-take-custody-of-mother-in-connection-with-10-year-olds-death.html/) \n15. [Mother tortures and kills 3 year-old son, burned genitals with lighter](https://href.li/?http://miami.cbslocal.com/2014/01/24/autopsy-released-of-3-year-old-found-dead-in-mothers-home/) \n\nThis is only mid-year and I didn’t even include the reports of mothers killing their children from previous years or other countries.”\n\nWhat the fuck is all this then?",
    "title": "Apparently \"Women don't kill men!\"",
    "subreddit": "MensRights",
    "timestamp": 1619559673,
    "score": 297,
    "keyword": "chinese judge"
  },
  {
    "text": "Mother Gains Full Custody despite the Court Finding that she engaged in significant False Allegations amounting to Family Violence I am posting this just to show that even in Australian Family Court cases where False Allegations were  PROVEN to be false, they still end up with the mother getting full custody.\n\n**See Below:**\n\n[**Wang & Dennison \\[2009\\] FamCA 206**](http://www.familylawexpress.com.au/family-law-decisions/children/child-abuse/allegations-of-child-abuse/wang-dennison-2009-famca-206/)\n\nThis is a case of an Anglo-Australian father and a Chinese-born mother. \n\nAfter separation, the mother and father lived in separate states. They had two children aged 11 and 9. The father had then re-partnered.\n\nIn dispute over 'contact with the children' after separation, the mother made allegations of child sexual abuse against the father. She also made allegations of physical violence by the father against her and the children.\n\nThese allegations were found to be baseless, contrived and pre-meditated by the Court.\n\nThe mother also engaged in behaviour intended to incite hatred in the children against the father. This alienation proceeded to a degree where the children did not want to spend time with the father and had threatened self-harm if forced to do so.\n\nThe Court had concluded that the mother presented as a deceptive and unreliable witness, who was unrelenting in her \"alienating\" behaviour towards the children against the father, equating to significant family violence. \n\n**The Outcome**\n\nHis Honour ordered equal shared parental responsibility, **but that the children live with the mother and spend no time with the father.** However, the Judge ordered a \"post orders program\", as recommended by the supervising family consultant with a view to the girls, being reunited with their father as soon as practicable. (this program subsequently failed: re: Wang & Dennison (No. 2) \\[2009\\] FamCA 1251)  \n \n\n[http://www.familylawexpress.com.au/family-law-decisions/children/child-abuse/allegations-of-child-abuse/wang-dennison-2009-famca-206/](http://www.familylawexpress.com.au/family-law-decisions/children/child-abuse/allegations-of-child-abuse/wang-dennison-2009-famca-206/)",
    "title": "Mother Gains Full Custody despite the Court Finding that she engaged in significant False Allegations amounting to Family Violence",
    "subreddit": "MensRights",
    "timestamp": 1621935547,
    "score": 238,
    "keyword": "chinese judge"
  },
  {
    "text": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari Excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari\n\nhttps://www.amazon.com/Sapiens-Humankind-Yuval-Noah-Harari/dp/0062316095\n\n***\n\n\"Different societies adopt different kinds of imagined hierarchies. Race is very important to modern Americans but was relatively insignificant to medieval Muslims. Caste was a matter of life and death in medieval India, whereas in modern Europe it is practically non-existent. One hierarchy, however, has been of supreme importance in all known human societies: the hierarchy of gender. People everywhere have divided themselves into men and women. And almost everywhere men have got the better deal, at least since the Agricultural Revolution.\n\nSome of the earliest Chinese texts are oracle bones, dating to 1200 BC, used to divine the future. On one was engraved the question: ‘Will Lady Hao’s childbearing be lucky?’ To which was written the reply: ‘If the child is born on a ding day, lucky; if on a geng day, vastly auspicious.’ However, Lady Hao was to give birth on a jiayin day. The text ends with the morose observation: ‘Three weeks and one day later, on jiayin day, the child was born. Not lucky. It was a girl.’4 More than 3,000 years later, when Communist China enacted the ‘one child’ policy, many Chinese families continued to regard the birth of a girl as a misfortune. Parents would occasionally abandon or murder newborn baby girls in order to have another shot at getting a boy.\n\nIn many societies women were simply the property of men, most often their fathers, husbands or brothers. Rape, in many legal systems, falls under property violation – in other words, the victim is not the woman who was raped but the male who owns her. This being the case, the legal remedy was the transfer of ownership – the rapist was required to pay a bride price to the woman’s father or brother, upon which she became the rapist’s property. The Bible decrees that ‘If a man meets a virgin who is not betrothed, and seizes her and lies with her, and they are found, then the man who lay with her shall give to the father of the young woman fifty shekels of silver, and she shall be his wife’ (Deuteronomy 22:28–9). The ancient Hebrews considered this a reasonable arrangement.\n\nRaping a woman who did not belong to any man was not considered a crime at\n\nall, just as picking up a lost coin on a busy street is not considered theft. And if a husband raped his own wife, he had committed no crime. In fact, the idea that a husband could rape his wife was an oxymoron. To be a husband was to have full control of your wife’s sexuality. To say that a husband ‘raped’ his wife was as illogical as saying that a man stole his own wallet. Such thinking was not confined to the ancient Middle East. As of 2006, there were still fty-three countries where a husband could not be prosecuted for the rape of his wife. Even in Germany, rape laws were amended only in 1997 to create a legal category of marital rape.\n\nIs the division into men and women a product of the imagination, like the caste system in India and the racial system in America, or is it a natural division with deep biological roots? And if it is indeed a natural division, are there also biological explanations for the preference given to men over women?\n\nSome of the cultural, legal and political disparities between men and women reject the obvious biological differences between the sexes. Childbearing has always been women’s job, because men don’t have wombs. Yet around this hard universal kernel, every society accumulated layer upon layer of cultural ideas and norms that have little to do with biology. Societies associate a host of attributes with masculinity and femininity that, for the most part, lack a rm biological basis.\n\nFor instance, in democratic Athens of the fifth century BC, an individual possessing a womb had no independent legal status and was forbidden to participate in popular assemblies or to be a judge. With few exceptions, such an individual could not bene t from a good education, nor engage in business or in philosophical discourse. None of Athens’ political leaders, none of its great philosophers, orators, artists or merchants had a womb. Does having a womb make a person un t, biologically, for these professions? The ancient Athenians thought so. Modern Athenians disagree. In present-day Athens, women vote, are elected to public office, make speeches, design everything from jewelry to buildings to software, and go to university. Their wombs do not keep them from doing any of these things as successfully as men do. True, they are still underrepresented in politics and business – only about 12 per cent of the members of Greece’s parliament are women. But there is no legal barrier to their participation in politics, and most modern Greeks think it is quite normal for a woman to serve in public office.\n\nMany modern Greeks also think that an integral part of being a man is being sexually attracted to women only, and having sexual relations exclusively with the opposite sex. They don’t see this as a cultural bias, but rather as a biological reality – relations between two people of the opposite sex are natural, and between two people of the same sex unnatural. In fact, though, Mother Nature does not mind if men are sexually attracted to one another. It’s only human mothers steeped in particular cultures who make a scene if their son has a fling with the boy next door. The mother’s tantrums are not a biological imperative. A significant number of human cultures have viewed homosexual relations as not only legitimate but even socially constructive, ancient Greece being the most notable example. The Iliad does not mention that Thetis had any objection to her son Achilles’ relations with Patroclus. Queen Olympias of Macedon was one of the most temperamental and forceful women of the ancient world, and even had her own husband, King Philip, assassinated. Yet she didn’t have a t when her son, Alexander the Great, brought his lover Hephaestion home for dinner.\n\nHow can we distinguish what is biologically determined from what people merely try to justify through biological myths? A good rule of thumb is ‘Biology enables, Culture forbids.’ Biology is willing to tolerate a very wide spectrum of possibilities. It’s culture that obliges people to realise some possibilities while forbidding others. Biology enables women to have children – some cultures oblige women to realise this possibility. Biology enables men to enjoy sex with one another – some cultures forbid them to realise this possibility.\n\nCulture tends to argue that it forbids only that which is unnatural. But from a biological perspective, nothing is unnatural. Whatever is possible is by definition also natural. A truly unnatural behaviour, one that goes against the laws of nature, simply cannot exist, so it would need no prohibition. No culture has ever bothered to forbid men to photosynthesise, women to run faster than the speed of light, or negatively charged electrons to be attracted to each other.\n\nIn truth, our concepts ‘natural’ and unnatural’ are taken not from biology, but from Christian theology. The theological meaning of ‘natural’ is ‘in accordance with the intentions of the God who created nature’. Christian theologians argued that God created the human body, intending each limb and organ to serve a particular purpose. If we use our limbs and organs for the purpose envisioned by God, then it is a natural activity. To use them differently than God intends is unnatural. But evolution has no purpose. Organs have not evolved with a purpose, and the way they are used is in constant ux. There is not a single organ in the human body that only does the job its prototype did when it first appeared hundreds of millions of years ago. Organs evolve to perform a particular function, but once they exist, they can be adapted for other usages as well. Mouths, for example, appeared because the earliest multicellular organisms needed a way to take nutrients into their bodies. We still use our mouths for that purpose, but we also use them to kiss, speak and, if we are Rambo, to pull the pins out of hand grenades. Are any of these uses unnatural simply because our worm-like ancestors 600 million years ago didn’t do those things with their mouths?\n\nSimilarly, wings didn’t suddenly appear in all their aerodynamic glory. They developed from organs that served another purpose. According to one theory, insect wings evolved millions of years ago from body protrusions on flightless bugs. Bugs with bumps had a larger surface area than those without bumps, and this enabled them to absorb more sunlight and thus stay warmer. In a slow evolutionary process, these solar heaters grew larger. The same structure that was good for maximum sunlight absorption – lots of surface area, little weight – also, by coincidence, gave the insects a bit of a lift when they skipped and jumped. Those with bigger protrusions could skip and jump farther. Some insects started using the things to glide, and from there it was a small step to wings that could actually propel the bug through the air. Next time a mosquito buzzes in your ear, accuse her of unnatural behaviour. If she were well behaved and content with what God gave her, she’d use her wings only as solar panels.\n\nThe same sort of multitasking applies to our sexual organs and behaviour. Sex first evolved for procreation and courtship rituals as a way of sizing up the fitness of a potential mate. But many animals now put both to use for a multitude of social purposes that have little to do with creating little copies of themselves. Chimpanzees, for example, use sex to cement political alliances, establish intimacy and defuse tensions. Is that unnatural?\"",
    "title": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari",
    "subreddit": "Feminism",
    "timestamp": 1627323647,
    "score": 31,
    "keyword": "chinese judge"
  }
]