[
  {
    "text": "Experienced a ton of sexism and racism in South Korea and need to vent You'd think this was a more appropriate post for the country's sub but, having read so many ~~white men~~ people there apologize for racism, I thought the sexism aspect would at least be appropriate here. **TL:DR at the bottom.**\n\nIt's probably my fault for not reading up on the 'bad' aspects of Korean culture, but I don't know many people who look for those things before visiting a country that has a modern-looking society. Being half Asian the racism and sexism I receive from my mother's homeland is minimal and tolerable. At 5'8\" I stand out. My plain features, brown skin and lankiness draw judgement because 'mixies' are meant to be pale and have more Anglo features. My bad. \n\nAnyway, my stay in Hong Kong and Taiwan was dope. So much to see and so much good food to eat! Shopping was cheaper than back home. Nice. The last leg was South Korea, the source of my mother's beloved K-Dramas and my opportunity to see snow for the first time. What I actually experienced was the opposite of dope. \n\nIt started as I got off of the plane. By far I was the tallest woman there. I stood near the exit and three people approached from behind whispering. I turn around to face my friend and the group glances at me with an audible sigh 'oh, negro'. It was a shock to hear someone refer disdainfully, out loud, to a person as negro. I wondered if they were seeing people who had dark skin or were African (American) around. When there was no person with brown skin other than myself close by I jumped to the conclusion that they might be talking about me and judged based on my features - big lips, booty and wide-ish nose. I dismissed it as me imagining things. \n\nThe next day I was in Meyongdong, a big tourist area, near my hotel. We rushed about and it was packed with stylish people and all the cheap makeup and street food we wanted. As I got bored I tuned in to the crowd around me. So, FYI, the locals LOVE to stare and make comments about foreigners in Hangul, and if they really want to speak their mind a descriptor or two in English as you walk by. By the time I made it back to the hotel I'd been called Japanese (called, not asked) and Chinese and Americano (anyone who can speak English) and... ni**er, once. I saw an African family on a train later with such miserable looks on their faces that I wondered if they were getting the same treatment.  \n\nNow sexism and internalized-mysogyny. Going in I knew Korea has impossibly high beauty standards and I was not exempt from judgement; not that I could hide given I was taller than most people as well as having brown skin. I believe women did not like that I was tall and thin as that is a huge ideal and the vast majority are smaller than 5'8\". Two other girlfriends who were with me have typical Asian height and features and were mostly ignored. Men especially didn't like that I was tall. Contrary to reports, Korean men did not appear any taller to me than other Asian men. So while women laughed as I walked by and grabbed their boyfriends to drag them further away, men got aggressive, like intentional shoves in crowds and 'tch-ing' as they would walk past. Old men turned around after seeing me as I approached. If I stood next to them in a crowd they'd move elsewhere. A kid walked by and called me a giant monster as his parents smirked. It was bewildering how frequent and constant this behavior was. Almost everyone I walked past was laughing or giving dirty looks. Even people some distance away. Christ. By the end of my 2nd day I tired of what was happening and concluded this was top of the range sexism and racism. [I Googled this shit and found that I wasn't alone and the issue is swept under the rug.](http://ireport.cnn.com/docs/DOC-1221602) [Open discrimination is not legislated against and foreigners complaints are dismissed](http://www.koreaobserver.com/nearly-all-foreigners-victim-of-discrimination-in-seoul-29001/). Great. Also found out that speaking English when not white invites scorn for being a snob and 'better' than Koreans, which they mocked me for too. Another layer of bullshit to deal with.\n\nOn the 4th day I had enough and stayed in my hotel. It was great tbh, but my travel companions who had typical Asian appearances thought I was crazy. I was fine with watching action movies all day instead of looking at the ground to try in an attempt to hide myself.\n\nBy the 7th day I was willing to face the music and go on the DMZ tour, which was amazing, then I had dinner and it was back to the bullshit. I decided to go out for the remaining couple of days anyway as I had recharged my spirit staying in the hotel and wanted to see what I could, which was a bad decision. I only remembered Gangnam was the capital of superficiality once I saw all the plastic surgery ads in the train station. Walking around there the laughs were louder and the men yelling 'You're a big girl!' was just enough evidence for my friends to start believing me. \n\nBy the end I was emotionally worn down. I was happy my flight was early morning but the abuse from other Korean travelers continued until I got off the plane in Singapore. The biggest irony was sitting in the departure lounge as a Korean woman walked past with a bag that said 'RACISM' with a cross through it. If I weren't so demoralized I would've laughed. \n\n**TL:DR - Beware of rampant, open, sexism and racism in Korea, and by all means do not be brown, tall and female. People defend Korea's nationalist monoculture and say 'you just have to deal with it' but you'd think there'd at least be some tiny courtesy to keep the racist and sexist comments quieter. Even sadder is that it's being taught to children. I don't hate Korea, it's a beautiful country, but I wish their culture did not foster so much ignorance. For *anyone* visiting there you'll need something tougher than thick skin.**",
    "title": "Experienced a ton of sexism and racism in South Korea and need to vent",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1484496487,
    "score": 3,
    "keyword": "chinese judge"
  },
  {
    "text": "Looking for general career advice from people who have worked abroad. What was it like re-entering the job market in the states? How do employers view candidates with overseas experience not related to the job? Worked in China for about 15 months teaching english to children which was really fun, networked a ton, paid off about half of my student loans, now I am in Korea. Just got hired as a University professor outside of Seoul and would really like to take this year to develop a skill such as becoming fluent in either Chinese or Korean. Mainly because I love communicating with people and I think it would be a beneficial skill to bring back to the states once I decide to return. I mainly came to Korea because my moms family is from Korea and I wanted to learn the language, but I find myself busy with school and I think I would learn the language better if I was enrolled at a Uni! So far, living in Korea isn't really what I expected as far as culture and community. Many Koreans are a bit judge mental and I think Korea has less opportunity than China when it comes to learning a language. I did get an offer at a University in China and the offer is still on the table but the pay is much less, but they did say that I can audit Chinese classes and they will provide me with a working visa. Prior to working abroad I have about year experience working at a PR/Marketing firm doing event coordinating. What jobs can I really look for when I want to come back to the states? I wouldn't want to work in the teaching industry in the US.. Do companies see working abroad as a plus for candidates? I am 26 going on 27, have about $10,000 in student loans and think I think if I stay with the Uni job for a year I can pay off all my student loans by the end of September 2017.",
    "title": "Looking for general career advice from people who have worked abroad. What was it like re-entering the job market in the states? How do employers view candidates with overseas experience not related to the job?",
    "subreddit": "careerguidance",
    "timestamp": 1484379513,
    "score": 14,
    "keyword": "chinese judge"
  },
  {
    "text": "Born and raised As-Am but I refuse to be ashamed of who I am. I'm Chinese - and China has been stereotyped as the world's sweatshop, people with weird eyes, dog eaters and other undesirable things. I also grew up an Asian American, who didn't see race until late high school, but before I could fully understand it, I went back home to China. \n\nMy mom used to microwave vegetable buns she bought from Chinatown for my lunch and I used to bring all sorts of Chinese food for lunch. It got to a point where even other Asians in class started blaming me whenever they smelled something funky. I never once assumed that the way I looked or the food I ate was weird because that's who I was, though luckily for me, nobody made a big deal out of it because I grew up in a diverse neighborhood.\n\nBut as I grew older and traveled beyond my racially diverse, lower-middle class coastal American city, I've noticed that I've slowly become the \"other\" in society. I've begun slight changes in the way people approached me, a certain coldness or strangers acting weirdly confident around me because they assumed or knew I wasn't a local.\n\nWell, I now live in China and I'm past the age where anger was my response to the world. I've accepted that this is the way things are, and all I can say is - it's made things a lot easier for me. I'm a Chinese person who speaks great English and that's who I am - no more dwelling on what my cultural identity is or how I should change who I am just so I can fit in with everyone else. I don't have to be sorry for being Chinese abroad or the fact that I speak great English in China, and I do feel sorry for anyone who doesn't agree. What's there to lose? They'll judge you anyway, do as you wish.\n\nEven though I live in China now, I am still a citizen of another country in the anglosphere, and through that I hope to retain my Westernized Asian identity to the best I can. I also hope I can make friends with other non-Asians who settle in China, but only if they show they have a basic respect of the local culture. I also hope that, through charitable organizations, I can support non-Chinese, non-Han minorities who are born and raised here but sadly isolated from the rest of our society. Is it only because of my experience as an Asian American do I understand what it means to be \"other\", and I am better because of it.\n\nI will respect you when I'm in your house, and you will too when you're in mine - but I will make no concessions regarding who I am, and that applies wherever I go. Place your two feet firmly on the ground and make the world move for you. \n\nIt's that simple.",
    "title": "Born and raised As-Am but I refuse to be ashamed of who I am.",
    "subreddit": "asianamerican",
    "timestamp": 1486668786,
    "score": 44,
    "keyword": "chinese judge"
  },
  {
    "text": "Does My Wife's Grandfather Look Chinese? My wife was raised by her grandparents, a Chinese man and a white woman (she's 25% Chinese). However, she was talking to a Chinese lady the other day and when she showed her a picture of her grandfather, the lady said he didn't look 100% Chinese to her. This has completely freaked my wife out. \n\nPersonally, I think he looks pretty Chinese, but as a white guy I'm not a great judge. I was hoping some people from this sub could weigh in.\n\nHere are a couple pics: https://imgur.com/a/5Slne\n\nThanks in advance to anyone that comments! I know this an odd request, but my wife is seriously freaked out by the idea that the man who raised her might not be who she thought he was.",
    "title": "Does My Wife's Grandfather Look Chinese?",
    "subreddit": "asianamerican",
    "timestamp": 1511454703,
    "score": 1,
    "keyword": "chinese judge"
  }
]