[
  {
    "text": "Should I stay or Should I go?  Greetings, \n\nI'm going to try and keep this as vague as possible without straying too far from the point. I am 30 years old originally from the U.S and I moved to a European country to take a job in an industry I truly love. I can say the industry is in communications/marketing. The pay is low, 20,000E per year and I get paid on a monthly basis. \n\n  Ive been here about 10 months and things have gotten downright awful.  Moving to a new country to begin with was very difficult and initially this was the only concern. My paychecks also come from the UK, despite the fact that the company I work for is in Southern Europe, all of my fellow employees are paid from a bank account in that country \"But I doubt I can prove that, or whether it's relevant. \n\n  It started with the language barrier, despite the fact that EVERYONE in the office speaks English, 90% of our customer base speaks English they switched over to their mother tongue. The boss did the same thing, and it got so constant that it's gotten to the point where I just sit at my desk and wait for the day to end. \n\n Ive tried to have it stop, to no avail. Ive asked nicely, \"Guys please can we speak English in the office\" to even calling the companys CEO who has been very clear that only English should be spoken in the office.  The manager of the office seems to particularly dislike me, speaking the native language in my presence all the time, making fun of me for not speaking it and just being generally rude. Hey I get it, I'm in another country and should learn that language, but that takes a lot longer than most people realize and I don't understand why English can't be spoken when we communicate internally with management in English ALL the time, and with our customers. Suffice it to say ive realized it's something I can't change, so now I just tune out.  Boss also likes to take everyone out to lunch, well, everyone except me of course. But that's not it \n\n As an example, I was given the company credit card to purchase some software however the price differential on the software was pretty significant 100, 200, 500, 1000 etc.  So I simply asked the boss, \"which should I buy\"? In his native tongue he said \"How the fuck should I know\" I kind of wanted to ask him the same thing, but oh well. On another occasion I thought he was calling my name, so I turned around and said \"Yes?\" and he said \"I wasn't speaking to you! I was speaking to xxxxx\" in a really nasty way, and of course he was speaking in his native tongue. \n\n This is only one of many situations ive found myself in with him, and at this point I don't feel a part of the \"team\" at all, which is why he said it was so important I didn't work independently, but moved all the way across the ocean to work at THIS location. \n\n  So now let's get into the nitty gritty, because I could probably go on for hours.  I am 30 years old, my job  history is bleak to say the least, but not non-existent.  There are a few things working in my favor, one of those things is that my family owns an entire apartment in a neighboring country, however we aren't wealthy, it's just an investment that's payed off. \n\n Technically I could leave this job and not pay any rent at all if I move to that country. The issue is, I would be without a job and maybe in an even more stressful situation than I am now. I'd also like any advice at all on how to deal with a nasty manager, and coworkers who clearly don't really want me around. \n\n Starting new in that country would be tough, unlike the one I am currently in it's job market is a bit worse and generally few \"English Speakers\" are hired outside of the tourist industry. However life in the country is much less expensive than the one I am currently in. That being said, I have a few ideas for home businesses that could at the very least keep me fed but I do fear that my lack of experience in general could make finding a new job rather difficult. \n\n Any advice would be helpful, and of course as the title suggests should I stay or should I go?",
    "title": "Should I stay or Should I go?",
    "subreddit": "jobs",
    "timestamp": 1511374064,
    "score": 3,
    "keyword": "european ceo"
  },
  {
    "text": "how do i continue after my first job situation? Hi Guys \n\nHere is a story about first “real” job after having finished my university degree within finance and management. \n\nPlease comment and ask some critical questions to help me reflect on the situation I got into. \n\nAlso I would like to know how to sell myself in the future. \n\nMy entry to the company\n\nIn August 2016 I started to work in a larger European diary company and started in the Scandinavian headquarter in Stockholm that is responsible for the product milk. Julius and Romeo hired me as an intern. Julius is the CEO of the business unit and is a very confident man with a MBA from Harvard. In his unit he had Romeo to lead the project department, this for example entails to take ideas and make them market ready. \n\nA year ago, Romeo received the assignment to make one idea market ready and he hired me as an intern so support him in the process. In the beginning of my entry I felt very excited because Romeo enabled me to being an entrepreneur in larger conglomerate. He had an endless backlog of tasks and I received the mandate to solve them solely. By that I mean tasks such as developing a go-2-market strategy, developing product requirements, developing the value proposition and doing pricing. \n\nAlso the supervision was extremely well organized. In the beginning Romeo and I had brief but very frequent talks in order to align. This was very helpful because we both needed to build trust. After a month or two I was so deep in the project that I did not require so much supervision anymore so Romeo trusted me to drive the business development of the product. Through Romeo I received great reputation in the business unit and Julius also started to give me some lightweight tasks that I mastered. \n\nMy internship however was limited to a specific time period. Romeo and I had few good talks about my future, and he hoped that I would continue in the company. \n\nAs such I was not reluctant to stay in the company as I had a great time and enjoyed the both Julius and Romeo as they were excellent boss’s. However I wanted to move to Copenhagen to go back to my friends and girlfriend. \n\nLuckily we had an operational site in Copenhagen, both Julius and Romeo talked with the local director in Copenhagen and they gave me the opportunity to start in Copenhagen.\n\nThe transfer to Copenhagen\n\nIn February 2017 Niklas the local director hired me.  I received the task to continue on the business development of the product that worked on in Stockholm and to work on some corporate development tasks. That meant that I closely with the sales department looked into sales targets and strategic partners. Together with one sales manager we created meetings with top clients and interesting partners for the product. \n\nHaving talked to Romeo, he was very excited. He loved that the Danish operational site created a good outlook for his project. \nFurthermore, I started to work on the corporate development project. I have a finance degree that means I had the theory in place however I looked for some guidance from Niklas to get start this project.  \n\nHowever a few months after I started Niklas started to neglect giving me the guidance and whenever he looked over it I received bad feedback. I checked with other financial analysts in the company and they actually liked my work. Additionally Niklas blocked any further development on the business development of the product even though Romeo and Julius loved the progress. \n\n8 months after I started at the Danish operational site I got fired due to mismatch between me and Niklas. I learned a few days afterwards that Romeo and Niklas hate each other and feels that I have been in the middle of a political battleground.",
    "title": "how do i continue after my first job situation?",
    "subreddit": "careerguidance",
    "timestamp": 1510406644,
    "score": 7,
    "keyword": "european ceo"
  }
]