[
  {
    "text": "What happens to your Data in the Recruitment Process As it has been iterated many times before, we are all sick and tired of the many application platforms where one has to perform the tedious task of feeding all your CV data into various systems. Instead of just uploading a document you are requested to type your name, birthday, address a hundred million times, over and over again.\n\nSharing ones personal information repeatedly doesn’t make it any less objectionable over time, and there is always a moment of hesitation regardless of the job that is offered. \n\nAfter I have been in the process of job hunting myself for a while, I’ve come across something rather peculiar - One day I was phoned by an unknown number. I would usually not respond to those but while job hunting it could always be a future employer. The caller however wanted to sell me some type of financial product. He knew all my personal information, my full name, my date of birth, and - obviously - had my phone number. Something I do never deliberately type into any platform for exactly this reason. The only (open) platforms that would ever access this data are the ones that receive my CV. \n\nSo… What happened here? \n\n### There are legislations in place, depending on which country to send your applications in. \n\nAs a leading example, the European Union has placed strict \\[GDPR\\] rules precisely stating that organisations shall only access, process and retain personal data if it is *lawful* (meaning the data requested actually serves the recruitment process). \n\nFurthermore, data can only be kept for *the shortest amount of time* (and for a maximum of two years from unsuccessful candidates).\n\n[**GDPR Compliance in Recruiting**](https://ec.europa.eu/info/law/law-topic/data-protection/reform/rules-business-and-organisations/principles-gdpr/how-long-can-data-be-kept-and-it-necessary-update-it_en); [**EDPS - GUIDELINES CONCERNING THE PROCESSING OPERATIONS IN THE FIELD OF STAFF RECRUITMENT**](https://edps.europa.eu/sites/default/files/publication/08-10-10_guidelines_staff_recruitment_en.pdf)\n\nAmerica on the other hand does not have centralised data protection laws. There are either federal laws that have to be followed, or companies have to make a deliberate ethical choice to keep your personal data safe, and not to sell it to a third party. Generally, application websites will ask you to confirm to their terms and conditions in order to partake in the candidacy. So choices are limited as to whether you want to share your info or not. \n\n[**U.S. Department of Labour - Internet Applicant Recordkeeping Rule**](https://www.dol.gov/agencies/ofccp/faqs/internet-applicants#Q1GI); [**U.S. Data Protection Laws and Regulations**](https://iclg.com/practice-areas/data-protection-laws-and-regulations/usa); [**Employee Data Protection in the U.S.** ](https://www.lexology.com/library/detail.aspx?g=302f6a2b-fc36-4cb7-964b-a30888250053)\n\n### Now what about other Countries \n\nIn August 2019 a scandal erupted in Japan when it became public knowledge that a recruiting company had sold detailed information about job hunting behaviour of applicants without their consent. The data was sold to over 35 companies who specifically looked into the data to determine candidate fitness based on their browsing choices.\n\nThis has sparked public outrage since these data sets seemed to actively harm applicant’s chances to be hired for a job. After all, it’s still humans that hire with all their personal biases and judgment. \n\n[**Recruit Career sold job applicants' browsing data to dozens of firms without consent**](https://www.japantimes.co.jp/news/2019/08/14/business/corporate-business/toyota-honda-bought-data-based-job-hunters-browsing-activity/)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n### The job Applicant already is a Commercialised Product\n\nA look at the privacy policy statements of how the data is being processed makes it clear that individual data may not be disclosed, but the information is used for statistical measures, demographic range, gender, etc. [**HR- Recruitment Statistics**](https://zety.com/blog/hr-statistics)\n\nBut it goes deeper than that. Having a look at all the job search websites like Monster or Jooble, which not only serve as marketplaces for recruiting but also for criminal activity: This article from 2021 explains how these websites are used by fraudulent groups who pose as hiring companies to collect personal information of individuals for the purpose of identity theft.\n\n[How to Avoid Identity Theft when you are Job Searching](https://www.thebalancecareers.com/how-to-avoid-identity-theft-when-you-are-job-searching-20)[62151](https://www.thebalancecareers.com/how-to-avoid-identity-theft-when-you-are-job-searching-2062151)\n\nThe article describes what steps to take to avoid those risks. But not all of these job portals offer ways to protect oneself. In fact, most show your profile as “incomplete” until you provide your phone number. \n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n### The Verdict your Honour\n\nIn this day and age, data is the most valuable and most consumed commodity. Nobody should be surprised that data is being taken advantage of, if it is not protected properly. This however should not mean for job seekers that they need to be vulnerable to crime and be taken advantage of. \n\nAlthough even before recruiting was (almost solely) taking place on the world wide web, it was common practice between headhunters to share candidate profiles and resumes. This however should not mean that individuals must be exposed to such type of practice. My medical records are not deliberately shared between doctors for the same reason. \n\n[**Recruiters may be selling your resume**](https://www.techrepublic.com/blog/career-management/recruiters-may-be-selling-your-resume/); [**Is it possible that applicant tracking systems are using their users data?**](https://www.quora.com/Is-it-possible-that-applicant-tracking-systems-are-using-their-users-data-Like-selling-resumes-using-it-to-recruit-for-their-clients-under-different-company-names)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n### The Solution\n\nLuckily as of today, it is not necessary to disclose any personal details in your CV, really. Back in the day, when resumes were sent out via mail, it was necessary to inform people how to contact you. Today, you won’t have to provide much more than your name and one or another way to contact you. \n\nThis, however, is something else entirely when you are required to feed your data to an online form on a website. It is for this reason that the regulations and the infringement of data protection laws have to be more stringent. Job applicants - in this regard - are in a vulnerable position and should not be taken advantage of. \n\nFor the applicants: be careful with your data until you are sure the place you applied to is interested. The internet is a great tool for job hunting, this however makes it even more important to protect oneself, regardless of how good the job offer may sound. \n\n[**How to Protect Your Personal Information During a Job Search**](https://www.vault.com/blogs/job-search/how-to-protect-your-personal-information-during-a-job-search); [**Should You Include Your Full Address on a Resume?**](https://www.zipjob.com/blog/include-full-address-resume/); [**What not to Include in your Resume**](https://www.thebalancecareers.com/what-not-to-include-in-your-resume-2063284)",
    "title": "What happens to your Data in the Recruitment Process",
    "subreddit": "jobs",
    "timestamp": 1617106690,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "[USA] What can my wife do to overcome employer restrictions on US-only education credentials. Hi all.\n\nMy wife spent many many years working in sales and business management in Venezuela, and several European-based firms that worked with Venezuela, and she had the equivalent of a Master's degree in business and marketing. She speaks 4 languages and for the past 4 years, she's had trouble finding work because of her immigrant background. \n\nOne of my friends is working as an insurance adjuster and recommended the work to my wife as an opportunity for stability, which she wants more than anything, but without a US degree, she doesn't meet the \"qualifications\" for the job. If we were in a better position financially, she would have gotten another degree by now in order to solve this problem. \n\nMy friend recommends that my wife apply anyway, and doctor her educational background, and allow her work to demonstrate her qualifications. I personally don't have a problem with this because she has the education to do the job just not the credentials. However, I also know that companies are relying more and more on verification services, so I don't want her to risk it.\n\nId like to ask for advice on how to get through this situation. As I mentioned, we can't afford the time or money for her to go out and get a degree for something she's already studied, so we feel like we're in between a rock and a hard place.",
    "title": "[USA] What can my wife do to overcome employer restrictions on US-only education credentials.",
    "subreddit": "jobs",
    "timestamp": 1632445326,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Took a job because I felt like I had no other choice, now thinking of leaving. This is going to be a long story, but I just feel the need to get it all out.\n\nFirst of all, I'm American but based in Europe. I have dual nationality with country A, and live near the border of country B.\n\nTo start, I've worked for a big US corporation since 2017, having a contract and working for their country A entity the whole time. It has always been challenging, and I've gotten the short end of the stick a lot with understaffing and transformation, but it kept me busy and I liked my coworkers.\n\nThroughout my career there I was identified as a \"strong performer\" and was always trying to earn a promotion. Call it bad luck, call it what you want, in three years there were never any opportunities to move up. In March 2020 all the office started working remotely and continues to do so.\n\nLast year in September, the company gave me a special assignment working for country B (which is also the european headquarters). I could continue to work remotely and joined a new team. It was a promotion in duties but not in title, also there was no real raise involved. The expectation was that I would take that role (or something similar) permanently at the end of the assignment. \n\nMeanwhile the pandemic continues. I get used to doing the job from where I'm living in country A. Country B office drags their feet in making me an offer, and whereas I expected to get an offer in December, they don't make one until end of February, after the assignment was already supposed to be over. I told my direct manager in advance that I didn't want to move during the pandemic, and he didn't have a problem with it. The move would put us in another country, and about two hours away from any family. And meanwhile no one is in the office anyway because of the pandemic.\n\nTo my surprise, the offer comes, money is decent, but there is a caveat. I have to move to country B to take the job. They initially wanted within two months, but we negotiated to four months. At first I didn't want to sign it, after years of hard work trying to get the promotion and this being the end result, I just wanted to rage quit. After much discussion with my husband we decided signing it was the best option, as I couldn't really go back to my old role. That was 1 April.\n\nSo now I have signed a contract that says I need to move to country B by essentially September 1 at the latest. Problem is, I can think of nothing I want to do less than moving there. I convinced myself for a while that it would be a fun adventure, but now I just dread the thought. \n\nA few weeks ago, a recruiter I talked to back in 2019 reached out and asked if I was still looking. Thinking about how I wanted to stay in country A, we talked and I am now in the final rounds of interviews for a job that won't require me to move and seems to have a more laid back company culture.\n\nIt may be a small pay cut, but the alternative is that I have to uproot my life, so I think if they make me the offer I might take them up on it.\n\nI just feel/felt so trapped. Now that I'm actually finding a way out though, I feel very guilty about leaving. I just signed this contract and told them I would move. I really like my team, and my direct manager. It was purely an HR decision about the relocation clause, and even the VP of my department couldn't get them to change their minds. So leaving will hurt a lot of people that don't care where I work from.\n\nI just feel guilty. Tell me r/jobs, is leaving the right choice? My husband says that they gave me no other choice and I have to do what's best for me, but I just can't shake the bad feelings. I feel like no matter what I do I'm either going to be majorly unhappy or look really bad to people I value.\n\nIf it were you, would you take the new job, even after just signing a new contract?",
    "title": "Took a job because I felt like I had no other choice, now thinking of leaving.",
    "subreddit": "jobs",
    "timestamp": 1619619378,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Transition to Salesforce eco-system (Ready to start ASAP)  Hi everyone,\n\nI need advice. I'm 7+ years in the non-Salesforce CRM implementation area. I started as a Freelancer and now work as an independent contractor. Last year I knew about Salesforce and started growing in that area. I did a lot of theoretical preparation: go through Trailheads, meet with Trailblazers community, Ohana, and passed 3 SF exams (admin, advanced admin, platform app builder). And already work with my previous non-Salesforce CRM and have a part-time job in a European company (I'm located on the European side of the world, but I already work for the Americas region in their time zones ;).\n\nBut I want to grow with Canadian companies (or maybe the US) and ready to did the best job I can, probably with a lower rate (I understand that I'm still in transition mode, and downgrade is okay).\n\nI'll be ready to start as a Junior (Admin, Consultant (pre-sale), BA, or even Developer roles (this one my weakest one, but I keep learning) from overseas (by mention the Junior role, I do things as a Senior and Lead for some non-Salesforce SMB projects). And, if required, later on, land on-site (but if everything is okay as a Remote position, I'll be happy to continue).\n\nPS: I've created my website [Hire Salesforce DEV](http://hiresalesforcedev.com/)\n\nwhere I explained everything about myself, I finishing my mains projects and will be ready to move.\n\nIf you may connect me with Hiring Manager and see that I may benefit your company with my background, you're welcome. I'll appreciate it!\n\nThx, Vitaly",
    "title": "Transition to Salesforce eco-system (Ready to start ASAP)",
    "subreddit": "jobs",
    "timestamp": 1620219421,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Need help with determination of job title Hi everyone, im 28 y.o guy, recently i received european citizenship, relocated from Russia to Europe and started to look for a job. The past few years i've been working as a sales manager (B2B), at least this is how my position called, in fact, I was doing the following job: communication with current clients and search for new ones (20%), regional shipments, preparation of relevant documentation (50%), work with retailers and international shipments, preparation of relevant documents, full control of all deliveries, work with returns (20%),  the rest of the minor work within the company (10%). So, im looking for the same type of job,  ideally working with existing customer base and incoming requests, maintaining long-term relationships, as well as full support of shipments with the appropriate documentation, no cold calling (minimum amount), what positions/ job titles i should be looking for? I am kinda confused with all those titles, for example: account executive, account manager, account representative, account specialist and so on, for me they all feels the same. Also i recently started to learn front-end development, got familiar with HTML, CSS, JS and ReactJS, really got into it, and would like to learn IT kitchen from the inside, what positions could fit me with my current background, but also with a focus on working as a developer in the future? Maybe some sort of technical support? Would gladly appreciate all the help and advices!",
    "title": "Need help with determination of job title",
    "subreddit": "jobs",
    "timestamp": 1637672936,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "I need help with clearing interviews and searching jobs in Europe I'm an IT Engineer with ~6 Years experience from India. Working for a MNC which pays reasonably low. I've given around 50+ interviews during the course of my career to switch to a new role with better pay package and work on latest frameworks that I aspire of.\n\nTill date I've only managed to get ~10% till final rounds but that didn't lead to conversion into offers. Whereas my friends who are not practical learners but theoretically very strong have managed to get quite a good pay package and great companies to work with. While I don't underestimate their capabilities but at the same time I don't understand what's going wrong in my case.\n\nCompanies here in India ask to much of Theoretical questions and some tweaky programming questions which I somehow fail to answer during the course of interview.\n\n\nI'm looking for suggestions/feedbacks from you guys to help me point to the right direction.\nWill be happy to discuss this over call or share resume for review.\n\nIn addition to that do let me know what's the hiring process looks like for companies across the Europe, what's the chances of referrals in European companies.",
    "title": "I need help with clearing interviews and searching jobs in Europe",
    "subreddit": "jobs",
    "timestamp": 1610640323,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "European people of Reddit who had played Football Manager with a club outside of Europe, which club did you mange? And how did it go?",
    "title": "European people of Reddit who had played Football Manager with a club outside of Europe, which club did you mange? And how did it go?",
    "subreddit": "AskReddit",
    "timestamp": 1626390737,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "The doctors don’t know and I’m still in pain. This is my first post ever, so I hope there aren’t any problems with it. Long post so be prepared. Let’s try.\n\nSome very short background information. I (F25) am European, live in a European county and have free health care. English is not my first language so bear with any spelling or grammatical mistakes. \n\n&#x200B;\n\nThis all started in June 2020. I started experiencing pain when having sex with my boyfriend. At first I thought it might go away, maybe the area was irritated. But after 2 weeks the pain only increased and I couldn’t bear it anymore.\n\nSo I secluded an appointment with my doctor, we talked about the problem and ran some test. I didn’t have any symptoms for any STD’s or STI’s and all the tests came back saying the same. There was nothing. I was told maybe there was some bacterial imbalance and was recommended some vaginal pills. I followed the doctors recommendations but after a month there was no change. I called my doctor and got recommended to the gynaecologist at my city’s hospital. So, this happened in June to July and my hospital appointment was in September. Great…\n\nAt this point sexy time between my boyfriend and me had plummeted. Before we would have sex about three times a week, that was now gone. We did a lot of oral and finger stuff to still feel intimate. But it really affected me that sex now was associated with pain. The end of September arrives and so does my appointment with the gynaecologist. I talked with the gyno abut the problems. There was still no symptoms of anything, only the pain. So, we agreed to just to do all existing tests and whatever you can call it to see if anything has any results. This was a horrible experience. I won’t go into too much detail, but so many different things were inserted inside me. My insides got scrabbed and cut for samples. The doctors where two females who were so nice to me. They told me anything that happened (almost), didn’t do anything without my consent and kept telling me I was doing really well and they knew this was not a pleasant experience. The worst thing is they cut me. They needed some kinda sample, so I got localised sedation with a needle down there. They the cut me, took a sample and I needed stitching! When I got off the table it looked like something from a horror movie. There was so much blood. I needed to wash the blood of my body before putting clothes on. I was told the result would be back in two to three weeks and I would receive a plan on what to do then and a follow-up appointment.\n\nWhen I got out of the hospital and walked home (very slowly) I cried. I cried again when I got home and later again when talking about it with my bf.  To be honest the answers from the gynaecologist didn’t say much. I got some pills to swallow, some pills to shove inside myself and a cream to smear inside myself. My follow up was in November and behold, not much had changed. My boyfriend and I had managed to have some sex, the pain was less but still very present. I was laid down by the gyno again and there was nothing to see or do. I again got subscribed some pills and were told to call them if that didn’t help.\n\nWell. It is January of 2021 and I don’t know what to do. I did everything I was supposed to: There is a problem, you contact the doctor, you work with the professionals, you listing to the specialist. And nothing worked! They have no idea what is wrong. I don’t want to call them. I don’t want to go back. I have had too many things inserted inside of me, I just can’t. Sex should be this amazing thing with my boyfriend, where when he enters me I run out of breath and my eyes rolls back in my head and it's pleasurable. Instead, I have to grind my teeth and count to ten before the pain goes away and I might enjoy it. The mental association between sex and pain is horrible. I want to have sex with my boyfriend, but the thought is always there. “is this going to hurt? this is going to hurt.” \n\nI’m not looking for medical advice, but I just needed to get this out. I needed to share this with someone.",
    "title": "The doctors don’t know and I’m still in pain.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1609673681,
    "score": 27,
    "keyword": "european manager"
  },
  {
    "text": "Physicians/medical professionals with mood disorders - how do you handle the daily grind? Hey everyone, 30-something doctor here finishing residency. \n\nI've been struggling with negative moods for as long as I know, but I've never looked for help, so I have no diagnosis. I've managed somehow, finished med school, worked, and now that I've started going to a psychiatrist I realize I've been on the brink for a long time. I've had worse episodes than this one, but somehow powered through. \n\nI've used regular sabbaticals as my own therapy. Get away from the grind and the changing shifts.\n\nNow my psychiatrist ordered one for me. I've been out of work for a month, and today we'll decide if I should stay longer. While this has been a great help, I feel bad, about not working! I feel bad leaving my colleagues to pick up shifts, I feel bad about my patients. I'm not a necessary worker, my patients like me, my colleagues like me, but in the end the world and the hospital will go on. But I still feel bad. I feel bad, that maybe the career I chose is the wrong one.\n\nI feel anxious now and I hoped to find solace/advice in colleagues here, people who might've gone through similar episodes. Learn about how to cope, what you've done to get better.\n\nMental health among health care professionals is, at least here (western european country), not discussed among us. And while everyone of my colleagues has been supportive through messages I still feel ashamed.\n\nEDIT: How do I flair this post? The only possibility I see is to flair NSFW which this clearly isn't",
    "title": "Physicians/medical professionals with mood disorders - how do you handle the daily grind?",
    "subreddit": "medicine",
    "timestamp": 1629706342,
    "score": 104,
    "keyword": "european manager"
  },
  {
    "text": "Theoretical Question: Do Family Medicine Residencies truly not prepare Physicians for Internal-Medicine Subspecialties the same as IM Residencies despite the extensive/intensive amount of years needed to pursue that fellowship anyways? **Disclaimer** This is in no way shape or form meant to be an attack on Internal Medicine or to create a Midlevel vs Physician or Internal Medicine vs Family Medicine Debate **\n\nBoth are incredibly important members of the healthcare team, whether they're serving as Outpatient PCPs or Inpatient Hospitalists, Family Physicians and General Internal Medicine Physicians complete and learn many of the same sets of skills.\n\nHowever, when FM Physicians are learning Ob and Peds, IM Physicians are focusing more on Intensive-Care and Inpatient management of complex medical problems. \n\nHowever, my theoretical question is: Many FM Physicians today ultimately, despite their varied FM residency training, practice in a manner very similarly to General IM-PCPs. In theory, IM PCPs can go back and complete a fellowship in any of the IM-subspecialties (GI, Cards, Endo, Rheum, ID, etc. etc.) -- These are intensive 3-5 year long fellowships that train physicians to be a subspecialist. \n\nI understand on the surface - That more Inpatient and more Intensive Care time in residency - Will better prepare IM Physicians for Subspecialty Training - But, there are many FM Physicians and many FM Residency programs that are far more Inpatient/Subspecialty based than others. I understand the concern here is therefore lack of uniformity, and therefore no way to determine if one FM Physician or or not will be able to succeed in lets say a Cardiology fellowship. However, what if there was qualifying exams for those interested in Subspecialty training afterwards?\n\nWith the amount of internal medicine and adult medicine family physicians learn, is it truly unreasonable to think that they would be incompetent cardiologists after 3 years of additional intensive learning? What skills would a FM physician be lacking that would make them inadequate diagnostic Cardiologists? Couldn't they just do a few more elective months in the ICU to get more inpatient time and make themselves more adept at this style of medicine before pursuing fellowship? \n\nWhat if they had a deep passion for Cardiology and studied for it outside of their regular requirements and could ace a \"Cardiology Fellowship Application Exam\" if such a thing were to be put in place?\n\nI'm not asking this question because I actually think FM should be able to do subspecialty training. This is more for me to try and really understand if there is actually knowledge gaps that would bar Family Physicians from subspecialty training, or if this is more of a business move more than anything, to regulate the numbers of subspecialists and keeping uniformity with Internal Medicine Residencies -- I guess the question becomes murkier when you add in the fact that Internal Medicine - Primary Care Track Residencies exist and these Physicians, although maybe unethically, are not barred from pursuing subspecialty training despite graduating from a PCP-Focused program, which are more akin to FM residency in terms of devoting more time to the outpatient setting. \n\nI understand the slippery slope here is: \"Well, if FM can go on to do subspecialty, why couldn't EM or other physicians who just \"are passionate for a subspecialty\" - And I would argue that FM due to the chronic nature of the specialty is better equipped, similarly to IM physicians, to deal with all the subspecialty concerns as these are typically more chronic problems that need a lot of follow-up and close monitoring, which EM and other physicians lack in their residency training.\n\nAll in all - I actually am somewhat upset by the fact that IM and FM are two completely different specialties at all. If I were to have designed medical education and residency programs from the ground up, both IM and FM would be combined into a 4-year \"General Medicine\" residency that would prepare all physicians to do Pediatrics, Adult, Gynecology (Less emphasis on OB), as well as anything \nelse the modern day PCP needs to be able to deal with, with the option to do all adult or pediatric subspecialties afterwards. Of course, the trade-off would be instead of 4 years of medical school, it would only be 3 years, for a total of 7 years to be a \"General Practitioner\" capable of inpatient/outpatient management of adult/pediatric chronic disease with the ultimate choice of pursuing a subspecialty, all while tailoring your education through more electives that will allow you to become a pure Pediatrician or Adult Doctor. This would allow our rotations in third year to be more intensive, and less focused on \"What do you want to be when you grow up?\" And more focused on just learning as much as you can to bring that with you into your residency afterwards. You wouldn't need to decide or pursue extra rotations to help pick whether or not you want do FM/IM/Peds, you'd be learning all of it, capable of going in whatever direction you want. I know this would never happen, but, as someone who is having a really tough time deciding between IM and FM, I would love to be more like the European model where I can just do everything.",
    "title": "Theoretical Question: Do Family Medicine Residencies truly not prepare Physicians for Internal-Medicine Subspecialties the same as IM Residencies despite the extensive/intensive amount of years needed to pursue that fellowship anyways?",
    "subreddit": "medicine",
    "timestamp": 1611155188,
    "score": 60,
    "keyword": "european manager"
  },
  {
    "text": "Frustrated I am a lecturer at a high school and I have adult learners. They've all got really significant amount of experience in different area of works mostly labourer, they all are from a different region all together not from UK. (Some european country)\n\nThe main problem is I am a fresh graduate, Age 25 plus no exp of teaching, I somehow landed this job. I never wanted to be a teacher, turns out I can pull this off. \n\nBut the things these people do are really hitting me mentally. \nTheyll chat in their own language, might aswell be making fun of me. \nIt really affects me as a person, I try to keep things on a lighter note but they just try to get on my last nerve. \n\nOfcourse they've got better industry knowledge but They'll just try to tell me everytime that what I am telling is incorrect, which is not.\nI sometimes manage to keep my cool to not have foolish arguments with these foolish people but arghh!  \n\nWhat should I do to keep them in their place.?! I get a feeling of sinking. I am headstrong but I dont how long will I be able to hold this up.",
    "title": "Frustrated",
    "subreddit": "Teachers",
    "timestamp": 1635605711,
    "score": 7,
    "keyword": "european manager"
  },
  {
    "text": "Time for a content switch? Ok so long story. I am in year \"1.5\" since I was a January hire. I have a bachelor's degree in history and  a Master's in C & I. While I was working on my grad certification I was a title 1 reading para in a nearby district and fell in love with reading and literacy. I would like to get my advanced cert in reading and literacy in a few years as well.\n\nI student taught in 7th grade geography because my grad cert was middle social studies. I was then offered a position in a district as a middle school ELA teacher and started January of 2021. I love my school and who I work with but I am totally frustrated by the way ELA is ran. Most of my students can't read on grade level but I still have to plow ahead with the priority standards, not to mention 3 official district exams per semester now. We only have one reading workshop teacher and that class is now broken down by grade level instead of skill need. Most of my students who need the workshop class are not enrolled because we do not have room. \n\nI am considering moving into high school social studies next year. I had originally wanted to teach SS but my job offer ended up being in ELA. I am as passionate about helping kids learn to read as I am about European history. I really am torn. I am nervous to leave my school since I love the environment because there are so much unknowns. I also find middle school kids extremely difficult to manage and highly impulsive. I have no idea if high school would be better or worse. If anyone could share their experiences related to my post I would be grateful for the advice.",
    "title": "Time for a content switch?",
    "subreddit": "Teachers",
    "timestamp": 1634409023,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "What kind of person is my partner's boss? With quotes from yesterdays recent yearly anniversary I am curious to hear what people's takes are on my partners' boss personality. I will try to not bias anyone and will just list a number of sentences & actions he shared with us. Although it is hard not to make it sound ... biased:\n\nArrival: ~ 60 people arrive in two busses. About 30 are people doing internships, getting paid 50% of the minimum wage of our country as is the legal minimum. A large part of the company is run by interns. He greets everyone and says to many \"who are you? Ah, hello nice to meet you\". These interns handle ~20-40 clients each independently.\n\nMusic, food, 3h later... speech:\n\n- may the European union continue to introduce complexity which will help us get rich\n- thank you to X,Y,Z (4 out of the 5 managers, leaving out 1 who just put in his resignation last week but was also present)\n- I always liked making money!\n- I always dreaded the last day of the month because it meant I would have to pay wages. But now I think I learned to think differently about you all and I want to make your safety a key concern for our coming years\n- This chateau (location of event, his latest purchase & part of the companies \"real estate arm\") is the best one yet. Next year we'll have a big pool too\n- Thank you especially to my board (father, daughter, son) for whom the company (board) has decided to give a special bonus payment. *wife hands out red envolopes to three*\n... many more like this, also from his daughter & son\n\nAll these things in front of an audience of ~ 80 ppl, employees & +1's. \n\nI am curious, what kind of person does one have to be to say these things? I have seen excellent leadership in my days, some mediocre ones and some plain stupid characters. But I have not yet seen this. I was utterly speechless to a point that I just didn't know what to make of it.",
    "title": "What kind of person is my partner's boss? With quotes from yesterdays recent yearly anniversary",
    "subreddit": "careerguidance",
    "timestamp": 1632826898,
    "score": 7,
    "keyword": "european manager"
  },
  {
    "text": "Is switching from employee to freelancer a logical move once my/a company becomes desperate for employees? Currently I'm working at one of the multiple small finance departments within a big corporate company. My department consists of 3-4 employees and a manager. The work we do is very specific and takes at least 6 months - 1 year in order to learn. I know the company hires uses Financial interims to fill up gaps/staff loss. (This is also how I came to work here)\n\nIs it realistic to resign and offer myself as a freelancer once someone within my team resigns? This will increase my paycheck significantly!\n\nIs this normal to do? Does someone in here done this before? And what are the pro's and cons\n\n(Btw I am European and graduated recently)",
    "title": "Is switching from employee to freelancer a logical move once my/a company becomes desperate for employees?",
    "subreddit": "careerguidance",
    "timestamp": 1631685555,
    "score": 5,
    "keyword": "european manager"
  },
  {
    "text": "I finally got my first software engineering related job. Hi there, I'm a person who spent the last 5 years in the support role. I hated this job a lot, but it is better than not having a job at all, and my family depends on me. I was an experienced IT solutions architect (not in software engineering) in my home country, and was hired by a big tech international company in Europe for a support position on mid-level grade. I thought that was fine since I don't have European citizenship. \n\nI then quickly realized that they were gonna squeeze all the juice out of me to achieve their business goals and since then I learned programming languages and was engaged in many different projects, I was coding during the nights since my job didn't give any chance to code during normal working hours. \n\nDespite the fact that some of the projects were really important to our company and were having a big impact, my manager didn't allow me to disengage from  my core duties. Even though he admitted the importance of those projects I wasn't promoted to senior level nor did I get a salary increase. This is how I realized that he's bullshiting me and I have no future in this department. \n\nI then tried to apply to internal SWE positions in other departments. It was almost impossible to get the role in my current country since most of the European roles were opened in the UK or in Poland. My hope was to get a relocation and start working at a junior level, it still gives more chances than trying to join another company in the EU without an unrestricted work permit. \n\nHowever all the attempts failed until 3 months ago,  I applied for site reliability engineering position in a different department of my company. All of the sudden, just a few days after a few interviews my manager got me a promotion, I think he realized that I am about to quit. Anyway I got the offer. \n\nThe position offered software engineering duties - actually a lot of job time is coding. My support position helped to get it because it requires systems engineering and troubleshooting skills too. That was a big success and I am pretty happy I finally left the customer support departmentand can start the new journey in the new team which seems to be very nice and supportive.",
    "title": "I finally got my first software engineering related job.",
    "subreddit": "cscareerquestions",
    "timestamp": 1626869867,
    "score": 559,
    "keyword": "european manager"
  },
  {
    "text": "My job application experience at six European companies to getting a job as a non-EU citizen in one month ***PS:*** *Originally posted in cscareerquestions and I was getting a lot of DMs so I thought it might be useful for others in this sub too, assuming it doesn't violate any rules!*\n\n**About Me:** Software Developer with close to six years of experience. Currently working in South East Asia, although this is not my home country so I'm working on a work visa here. Java/Kotlin are the main languages that I work with.\n\n**Motivation:** I decided to switch jobs a couple of months ago because I didn't think that the future of my current company was bright. Bad work life balance, saturation when it came to learning things and the idea of moving to Europe were other reasons why I decided to start my job hunt.\n\nI chose Europe for several personal and professional reasons. But I knew it won't be easy since I was a non-EU ciztien so I had to find a job at a company which not only sponsored my work permit but also met other expectations like salary *(especially since my current salary was quite high for the country I am living in)*, company reputation and the opportunity to learn. Having had a bad experience in the past about which I wrote [here](https://www.reddit.com/r/cscareerquestions/comments/d6xpep/fired_to_hired_with_40_raise_within_10_days_rant/) I was extra cautious.\n\n**Applications:** I started looking for jobs online. I mainly used StackOverflow and Linkedin to find jobs in my domain that were ready to sponser visas and which met my expectations as mentioned above.\n\nIn the end I applied at **10 companies** in 4 European countries namely Germany, Netherlands, Sweden and Spain. Out of these 10 I got positive replies from **6 companies** and rejection from the remaining 4.\n\nInitally I wasn't sure about the kind of response I'd get so I applied to several companies but then I found it hard to arrange and manage interviews for 6 companies at the same time. I'd say I was a bit overwhelmed by the responses.\n\n*One thing to note is that I decided to not apply in any companies that asked Leetcode style questions because I didn't have enough time to be prepare and be confident with DS/Algo.*\n\n**Interviews:** Interviews for all these companies were actually very similar and consisted of the following rounds in different order\n\n1. **HR round:** HR chats with you. They ask about why you want to join this company, why you want to leave, why Europe (or the country in question), expected salary, expected joining date, notice period etc. This is the easiest round. I cleared this round for 5 companies out of the 6 that I interviewed at.I was expecting a rejection from the company that rejected me because during the HR discussion I got the feeling that these guys are probably looking for someone who has worked in a bigger team/company and had more experience with writing testcases, something which I didn't have.\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_***My Advice:*** Research about the company and know your motivations for joining the company. Even though most of these HR chats are not technical but sometime they can surprise you by asking general tech things so be prepared for that. Don't badmouth your current company, colleagues etc. Sometimes they may ask very basic behavioral questions.\n2. **Home assignment:** I personally am quite confident of home assignments. I completed home assignments for 3 out of the remaining 5 companies and all the 3 invited me for the next round. For the remaining 2, I had to decline the interviews after I got the offer from one of the first 3.The length of these home assignments varied. Surprisingly the most popular and well known of these 5 companies *(and the company which I accepted the offer from)* had the shortest assignment. Second company had a longer assignment which I still didn't mind because it was interesting.But the 3rd company's home assignment was too long and too challenging. The HR of that company even mentioned during the 1st round before sending me the assignment that many people don't submit the assignment and so she hopes that I'd do it. Now I can see why. I completed about 80% of the assignment and got the invite for the next round.\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_***My Advice:*** Based on my experience with home assignments in the past and the experiences that others share *(both negative and positive)* I'd say that code quality is the most important thing about these assignments. You should be using industry practices and latest libraries/apis/approaches. For example, if you have to make api calls, you should use a well known and popular library for that and use it the correct way. I've seen a code submission where someone wrote all the boiler plate code for api layer using Httpclient in Java. It is no doubt that such a submission will not succeed. In another case I saw a submission where someone used RxJava in a rather simple app which made the code very difficult to understand. You shouldn't overengineer. Keep it simple, follow industry best and latest practices. This round is easier to clear if the code you write all round the year follows the above constraints because then this round will be like completing a ticket at your current job.\n3. **Tech interview:** I reached the tech round, which was also the final round in all athe 3 companies where I submitted the assignment. Ultimately I decided to turn down 2 of them after I accepted the offer from the third one. The tech interview at this company was one of my best tech interview experiences. The interviewers actually put as much effort into the interview as me. The questions were very relevant to the role and there was a lot to think about after the interview ended.\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_***My Advice:*** This round is mostly about your skills, knowledge and experience. In order to be confident and do good in this round it would help if you know the tech that you work with very well. You will of course prepare for the tech interview a few days before it but what would make the most difference in this round is the work you do all round the year. So knowing the whys and hows of technologies that you work with daily will make this round a lot easier for you.\n4. **Interview with manager/tech lead:** These are behavioral rounds. I gave 3 such interviews in my journey and cleared all of them. My favorite resource for preparation for these rounds is the behravioral interview guide on Leetcode. Other than that you can prepare for it online from several sites.\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_\\_***My Advice:*** Being a good communicator helps. Try to prepare as many questions and scenarios beforehand so that you know what to expect during the interview. Even if you have an answer for the specific question asked, you may find that you may struggle to come up with it during the interview situation, so preparing a lot of questions beforehand helps a LOT.\n\nIn the end I decided to accept an offer from one of these companies. The pay is around 70k Euro (\\~82k USD) before taxes. I don't want to disclose the the company or location but I've narrowed it down to 4 above. The whole process took less than a month.\n\nIf anyone has any questions please feel free to ask and I hope my post helps others.",
    "title": "My job application experience at six European companies to getting a job as a non-EU citizen in one month",
    "subreddit": "cscareerquestions",
    "timestamp": 1629222973,
    "score": 52,
    "keyword": "european manager"
  },
  {
    "text": "Boston career / housing advice See the bottom for a TLDR.\n\nMy background...\n\nI graduated college 7 years ago from an private engineering university with a BS and three internships under my belt.  Since then I've worked at three companies paying 60k, 100k, and 125k/120k respectively.  I've built products from scratch and from others prototypes.  The first two jobs were 50+ hours a week.  I've also helped out, unpaid, at a couple startups.  70% of my experience is front end (React, Angular, ExtJs, Backbone) and the remaining 25% was middle tier (Node, Python, Java), and maybe 5% UX/Design.\n\nMy current position...\n\nI joined my current company two and half years ago for 125k + around 25k perks.  The perks didn't really pan out - 3 years in a row there has been no bonus or raise, 1 month a year pto became 'unlimited', commuter reimbursement and subsidized lunches are no longer due to covid, insurance increased 2k, stock options reset due to their merger, my title changed followed by a pay decreased of 5k due to a paperwork mixup during the merger.\n\nI like the company objective and the people I work with but it sometimes feels like a ship without a captain.  They have plenty of funding and are expanding/hiring but there is a lack of vision for were building and they haven't sold much.  The demands are low and oversight is minimal.  Marching orders are to keep expanding/improving the Angular app which started as a prototype.  My day to day is becoming monotonous and the app is a ticking time bomb of tacked on features and anti patterns insisted upon by a dev who left.  Rewriting would be a lot of thankless work probably done on my own time...  I would love to redesign it before re writing but again I understandably doubt management will pay for this.  Considering finding a new or another job.\n\nCareer outlook...\n\nHow much do you think I can get in the current market?  Are companies still using 'cost of living' and 'is the pay really worth that commute' to justify paying way under market in less urban areas?  I'm making \"a ton\" and I have my own apartment so I don't want to be unappreciative but I need more to \"get ahead\".\n\nI can get a decent pay bump making a lateral move.  The recruiter I spoke with said market rate is around 140k.  More than 125k, especially if they have pto and bonuses.  But it still seems sorta low.  I know people with much less experience hired 4 years ago for more.  It feels like the market is still hot and this guy is just low balling?\n\n140k / 2,000 hours a year is $70 / hour.  Compared to a teacher or nurse (under $40 an hour) this is a ton but compared to a plumber, electrician, or mechanic (over $150 an hour minus taxes and insurance) it's low.\n\nI've considered follow my coworkers lead... stay with my current employer doing the status quo and start contracting or getting another job.  Probably should have done this a year ago tbh.  This would effectively double my pay...  I feel guilty, but i'm not making enough to have a home/kids so perhaps it's okay so long as I complete all obligations?  My farther always worked 2-3 jobs to make ends meet, so in a way, I've just been lazy.  I'm almost 30 and need to start catching up...\n\nIf I quit and take a single new job it would be nice to feel like I'm getting somewhere rather than making a lateral jump to fight inflation...  That begs the question; what is the next step?\n\nFor starters, is it appropriate to call myself \"Senior\" when applying for jobs?  \"Senior Front End Developer\" or \"Senior Software Engineer\"?  I prefer front end but can do middle tier.  I don't want to get stuck as a grunt in the weeds forever.\n\nWhat jobs are an attainable \"step up\"?  I've heard again and again that \"shit flows downhill and the more people under you the higher your perceived value.\"  Yet the recruiter I spoke with said i'm not really qualified and if he could land me a job with management / product owner responsibilities early in a startup I'm only looking at maybe 10k more.  The job wants someone in office and it will be long hours.  If I go from 125k working 30 hours a week to 150k working 60 hours a week my post tax hourly pay is significantly less...  For career experience...  idk.\n\nDo I even want to be in management?  I assume the other alternative is go start my own company (imo I need to own shelter first) or to climb to 'software architect'?  Should I use my saving to go back to school rather than on a house?  Should I stop looking at all the small companies in industry and focus on leet code and FAANG?\n\nHousing outlook...\n\nThe rent is too damn high!  My beyond dilapidated shit hole attic apartment near Boston is $1,700 a month and a 'real apartment' is around $2,300.  I don't want to go back to living with roommates or in a basement.\n\nWhen I was looking for jobs 5 years ago, city jobs paid 2x - 3x more than an hour north where I grew up.  Renting a room for $800 was a no brainer and I never planned to buy in the city.  It's been fun and eye opening and it was an excellent career move.  I love how live and let live it is!  I'm considering forgetting my childish dreams and my hobbies to buy here \"while the market is slowish\".\n\nI still really miss the land where I grew up and always planned to settle down.  Big trees, hills, stone, snow, fertile soil, etc.  Mountain biking, snowboarding, hockey, carpentry, hiking, dirt biking, canoeing, etc are still realistic pastimes there.  While expensive, there are still large parcels for a homestead.\n\nI'm hesitant to move back because of career implications as well as past expensive and stressful harassment by police and neighbors.  If all the jobs are remote forever the no income tax and cheaper homes make it financially appealing...  However, my inclination is that that this \"100% remote forever\" thing won't last and that those home prices are overinflated due to covid.  If we go back to required in office in big cities I'd be looking at a 2 hour commute with traffic.\n\nOn the flip side, if most software engineering is 100% remote, what's to stop are jobs from going overseas?  European devs are as good and half the price.  I would pity the fool who paid a million for a dilapidated triple decker.\n\nEverything has more than doubled or tripled in price since graduation... my fathers advice to get a house asap was spot on...  I'd like to put all of my savings into a house sometime soon so I can build some equity, live somewhere halfway decent, and not have a slumlord dicking me over every time I turn around.  I'm almost thirty and want a home and kids some day.\n\nHousing options as I see it:\n\n\\- accept an offer to sell my ready to build land for 60k.\n\n\\- keep the land and drop a prefab for 125k plus 75k-125k to finish.  So 300k plus finished.\n\n\\- make an offer on 130 acres near my lot listed at $800k and put a small house or trailer.\n\n\\- buy a single family 20 minutes north of Boston (hour or so with traffic) for 400k on a half acre.  probably the smartest option...\n\n\\- buy a small two or three family on a postage stamp bordering the ghetto (under 30 minutes from downtown jobs by bike or rail) for $800k.  \"It will only go up\"\n\n\\- move far away... Burlington VT, Portland ME, Poughkeepsie NY, Denver CO, San Diego CA, Portland OR, Miami FL, etc\n\n&#x200B;\n\nTLDR:\n\n\\- What is market rate for a Senior Software Engineer with React experience in Boston / remote?\n\n\\- Under / Over on if 100% remote with nationally competitive pay will last?\n\n\\- Advice on the next steps in my career?\n\n&#x200B;\n\nThanks for any feedback!",
    "title": "Boston career / housing advice",
    "subreddit": "cscareerquestions",
    "timestamp": 1612735537,
    "score": 5,
    "keyword": "european manager"
  },
  {
    "text": "Product Management VS Solution Architect/Sales Engineer career? About me: European 37 years old with background in science and second study in computer science. Last 10 years mostly working in Project Management for Engineering and Software Implementation and since 3 years in Product Management. I am not looking to go back to Project Management (timelines, ressouces, scope) but more towards customers and business with a technical flair.\n\nProduct is often in HQ in the US while Solution Architect/SE can be remote here in Europe - that is my assumption.\n\nWould I open more opportunities for me here in Europe? What do I need to ask myself regarding these two career tracks? Is there something to could be too late? Anything clues? Thank you",
    "title": "Product Management VS Solution Architect/Sales Engineer career?",
    "subreddit": "cscareerquestions",
    "timestamp": 1624532896,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Trying to figure out a Career Map (EU/Ger) TL;DR: 29, 3-5 YoE, currently finishing bachelors in 2023, prefer frontend/full stack/system design. What would you advise for good work/life balance while also making a decent living.\n\nThe flair might be slightly misleading, I am an experienced dev but am also currently a student again.\n\nAbout my CV:\nI'm 29 and married. Living in Germany.\nI've completed an apprenticeship in IT in 2012 followed by 2 semesters of CompSci / Math and then around 4.5 semesters of Business Information Systems / Business Informatics - no finished degree. During that time I was a part-time student developer at a well known European fin-consultancy, mostly doing Java development and every kind of testing.\nI stopped my studies and work at the firm due to mental health issues unrelated to the field, which are by now managed. In the meantime during therapy I stayed afloat freelancing as a full stack web developer and consultant until 2020, when I finished therapy and decided to finally complete my education.\nCurrently I am in my 3rd semester of a CompSci-aligned bachelors program with a current GPA of approximately 3.8 (German grade 1.3).\nI am currently a working student at a legal tech company doing frontend (react/ts) and devOps.\n\nDue to my mental health related caveats I'd say my effective time as a developer accumulates to about 3-5 YoE.\n\nI'm trying to figure out how to continue at this point while finding a good balance between work/life and earning enough to support a good lifestyle.\nOptimally I'd be able to stay in Germany since my wife is pretty much bound here due to her job, paths that would need me to relocate would need to be able to support us both and 1-2 kids.\nMy target in yearly compensation is 100-200k. Optimally I'd reach that in the next 7 years.\nI am language and technology agnostic.\nOptimally I'd stay in a frontend position but I am also interested in microservices, full stack and system design as well as managerial roles as long as they still involve individual contributing.\n\nCurrently I have two very straightforward guaranteed options after finishing my bachelors and  a few less clear ones:\n- Option 1: After I get my degree, start at my current company in a full position. (Starting at 50-75k TC/year)\n- Option 2: Start a System Architecure masters degree, at the same uni I currently attend, to increase my worth as a developer and continue to work part time as a dev (2 more years of making <25k)\n\nThen there are the other options:\n- Option 3: Grind LC / architecture and design patterns and do the whole \"maximise TC\"-dance (though I'm really unsure if this is even a real possibility in EU/Ger) and try to somehow keep a healthy work/life balance\n- Option 4: Become a consultant - but work/life would go right out the window\n- Option 5: Become a contractor/entrepreneur - again work/life problems\n- Option 6: Startup-hop and go for less compensation in the now but stock/passive income later\n\nConsidering my age and my situation what would you do? Are there options I didn't consider, or things you would prefer doing? I am thankful for any and all advice.",
    "title": "Trying to figure out a Career Map (EU/Ger)",
    "subreddit": "cscareerquestions",
    "timestamp": 1640653972,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "what are some good things about where you work right now (especially if it's not in a company most people would consider working in)? I work in telco as a dev in a small European country . I get to work with a lot of different technology, my team and manager are fantastic, we get a lot of benefits from the company in general but as devs we get learning's platforms, software and tool licenses, free time to work on our own things every week, money to organizme hackathons etc. \nIt's not a company anyone I know thought of going to work for and truth be told our salaries are competitive, but not even close to the highest offered, but my career goals are easy to meet here and I see a lot of people wanting to get into very well known companies and disregarding the rest. \n\nSo, anyone else have any good things to say about where they work?",
    "title": "what are some good things about where you work right now (especially if it's not in a company most people would consider working in)?",
    "subreddit": "cscareerquestions",
    "timestamp": 1634390744,
    "score": 0,
    "keyword": "european manager"
  },
  {
    "text": "Deciding on my first job experience, junior or intern? Hi, I have a background in Economics and I am doing right now a postgraduate in Data Science (a part-time program of 1 academic year). I also emigrated from Latin America to Spain seeking a better life. Now, after some specializations in Coursera and almost finishing my part-time postgraduate, I have right now two offers as a Data Analyst: a junior position in a recently lunch start-up (is an app) and an Intern position in a well-known company that was a start-up but is growing and is present in a lot of European countries.\n\nI would appreciate knowing your perspective on this issue, like what things would you take into account to make the decision. Personally, my main goal is to enter the field of data analytics  (as I came from a finance background) and learn all that I can to develop a career in this field.\n\n&#x200B;\n\nThese are the pros and cons of the two:\n\n1. Salary: the junior position doubles the intern, but I can live easily with the intern offer.\n2. Contract: both are of 6 month.\n3. Responsibilities: the junior position is more involved in product analytics of their app with some finance accounting tasks I will have to do. The intern is about finance analytics with automation and ETL processes.\n4. Softwares: with the junior I will used Google Analytics and Amplitude and with the intern MySQL, Redshift and Python.\n5. Team: in the junior position we will be just two persons, being myself the person where the Data Analysis will rely more because my boss is not in this area. In the intern, the team is of three persons all dedicated to the responsibilities in Data Analysis + a Manager.\n6. Companies: the junior is in a company that is starting, and the intern is in a start-up in the growth phase with a great reputation in the market.\n7. Future: the junior promise a permanent contract in which the finance accounting tasks will disappear and the intern promise a permanent contract (according to glassdoor the compensation will be better in the intern company in this case).\n\nThanks for your comments in advance.",
    "title": "Deciding on my first job experience, junior or intern?",
    "subreddit": "cscareerquestions",
    "timestamp": 1613751048,
    "score": 0,
    "keyword": "european manager"
  },
  {
    "text": "AMA: Small firm -> CPA -> Big 4-> MBA -> Snr Mgr Industry Hi All,\n\nBeen wanting to do this for a while. I frequent this sub a lot on my alt and thought it could be helpful for people. Below is a brief background. Feel free to ask me anything. \n\nStarted off in Canada earning minimum wage out of undergrad (rejected at B4).\n\nPromoted at small firm I was working with doing small business taxes/accounting. Firm paid for US CPA. I invested some money into a new office/ branch in US and managed new location. Left after 1 year because partner was just using me. Earning 36k USD at this point. \n\nMove to mid size firm for 6 months back in Canada. Making 48k USD now. Poached by big 4 pretty quickly. \n\nSpent 1 yr in big 4 as snr analyst doing niche tax work. Earning 64k USD. Great reviews and set to be promoted but I didn't think i was doing any value added work and felt confined to a niche. \n\nI had written my GMAT several years ago and the score was about to expire (700/800). It's a good score so i gave it a shot and applied to European B- schools. Didn't apply US schools cuz visa process is a pain and Canadian schools have very bad ROI. Got into a top school and sunk 110k USD into tuition. \n\nHad a blast at school, great memories. Recruited gaming, big tech, consulting, and random one off companies i thought were interesting. 1 offer each from consulting, big tech, and industry. Chose industry because pay was great, in a location i preferred. Now living in an Asian city, earning 150k USD but the money goes quite far because my expenses are low. Internal reporting role but they hire mba's for leadership pipeline with intent to rotate roles and become general managers. Work life balance is non existent during weekdays but weekends are easier. \n\nAMA!",
    "title": "AMA: Small firm -> CPA -> Big 4-> MBA -> Snr Mgr Industry",
    "subreddit": "Accounting",
    "timestamp": 1616504421,
    "score": 10,
    "keyword": "european manager"
  },
  {
    "text": "What would you do- Can I be a public Company Controller?   \n\nThrow away account, obvious reasons. \n\nTLDR: I took a job as the controller/ entire finance & accounting team in a small private company (Start up) that had no intentions of gong public ever, now, less than 4 months later my boss just told me that management/ the board was now considering going public this year through a SPAC. I have very limited public experience (just one small public company I seniored back when I was in public nearly five years ago.) I love my new job but I don’t even know where to start in making sure we check all of the public company boxes. Also, the entire IPO process.  \n\nHere is the long form (Sorry for the length, venting as much as anything).   \n\nBack in September, I left an Assistant controller position at 100M dollar multinational private equity owned company that I had been with for four years. In late 2018/ early 2019 did a lot with the sale from one PE firm to another (Mostly coordinated the Quality of earnings with the firm performing the Q of E). By the time I left, I was supervising most of the finance team (4 direct reports in the US manager, senior, staff and AR and 2 direct reports in India AP/ AR). I was also doing a lot of financial reporting, including a super complicated cash flow model. Doing most of the coordination with a European finance team, day to day audit contact, over saw and did a lot of our financial statements for the audit including footnotes. The controller was pretty bad and ended up getting relegated to overseeing just AR and AP.  When I left and they brought in a new Controller to replace me even though I was only the assistant controller.  I was exhausted and completely burnt out. I felt like I was always underperforming.  I pretty much thought I never wanted to do accounting again, but it pays the rent. \n\nSo, this summer I decided to look for a controller position given that I was quickly approaching 10 years in accounting (5.5 years in public large regional and a national firm and 4 years in private). I was connected to my new job by a partner I used to work with in public. \n\nI am the only accounting and finance person besides my boss who does some FP&A (though now transitioning to me) and overseas the rest of the ops team, including some client management type stuff.  The company only has about 40 employees and under 10M in large enterprise billings (about 100 invoices for the entire year). Simple automation tools like bill.com and expensify were already set up and integrated by the time I started. The actual bookkeeping is pretty simple. There are only a handful of invoices to generate a month, maybe a dozen or so. It takes a day to get the books closed down and another couple of days to get through the consolidation, B2A and get numbers packaged up. \n\nGiven the amount of time, I had time to do things like implement ASC 606 with just a bit of help from a technical accounting consultant to bless the memo (Which ended up saving the company a lot of money with the consultant). Get out books properly converted to GAAP in advance of the audit (As they had not been), and have started to work on FP&A and stand in as a light sales ops person. Even doing all of this, the stress is like an 1/8 of my last job. For the first time in my 10 years of accounting, I am not teetering on burnout during the month of February. Our Audit starts in April, but I have provided the TB and most of my recs already. The feedback has been overwhelmingly positive. Like, I am performing better that I ever have in my entire career. I like the team. I like the company. I actually like my job. The money is more than I have ever made (Though I think realistically I could make a bit more somewhere else) We will likely be cash flow positive in the next year or so and until then the VC money seems to flow freely. The company is in a great position. \n\nDuring the interview, I was very explicit that I did not have much public company experience. Just one little client I seniored for a couple of busy seasons towards the end of my time in public. I have never prepared 10K. During the interview, the CEO (Who is the founder and owns a majority interested) explained that they did not want to go public and they had some 30 year business plan or maybe a 100 year business plan. They talked a lot of SpaceX because they are investment bankers turned tech bros which I am used to working for at this point and beside for salivating over Musk, I find they are good at running the companies. \n\nToday, during my one on one, my boss brought up the idea that we may go public within the year through a SPAC. I’m not even sure if this logistically possible (Maybe it is, I have literally no idea) and I am not sure anyone at my company had ever actually done an IPO before. I think the radical change is likely due to a very hearty valuation from a comparable company that did their IPO back December or January. Essentially, my boss asked me want I wanted to do in my career. It very much had the undertones of, “We really like you, you do a really good job, we want to keep you, but we both know you do not have the experience to be a public company controller, what else can you do here to be beneficial... how about FPA.” \n\nSo, that leaves me the following options: \n\n1. I could immediately freak out and look for a new job. I really do not want to do this. I like this job, at a minimum, it’s a nice little break in the interim to what comes next.\n\n2. I could stay on and transition to another role in Ops, likely being a manager and doing a lot of coordination. I’m not sure if I really want to step out of accounting after dedicating 10 years  of my life to accounting. Also, it turns out, once I’m not in a pressure cooker, I think I might actually like accounting. \n\n3. I could transition to FP&A which has never had much appeal to me and I forecast like a very conservative accountant. Also, I have little experience in FP&A and am not sure how effective I am here. \n\n4. I could ask to be the controller once we go public and asking about supplementing with a manager with the right experience (That feels like it could wrong so many ways). \n\n5. I could bide my time, stay controller until it is clear I can no longer do the job and then leave once I cash in my options. \n\nWhat would you do, what should I do? What other options. Should I be concerned that there seems to be a pretty monumental shift in both the business plan and the plan to go public? Is there any chance I could try to be the controller of a public company with out monumentally crashing and burning? \n\nLastly, I want to be patient, there is a more than decent chance management will back track and nothing will happen.",
    "title": "What would you do- Can I be a public Company Controller?",
    "subreddit": "Accounting",
    "timestamp": 1613605907,
    "score": 5,
    "keyword": "european manager"
  },
  {
    "text": "Which route to take? (General Accounting or FP&A) CPAs out there or anyone working as an accountant, which path  would you choose?\nI live here in the Philippines and would also like to know how to work with and EU nationality.\n\nOption 1: Senior FP&A role in a MNC (a known industry leader and has an appearance globally), 69% increase in salary, new learnings and function. I will be working purely on forecasting, planning and budgeting. So goodbye month-end closing but hello budget season?\nBosses are Filipinos as well as all colleagues.\n\n☆ Career path goal: transition to FP&A, after 2 to 3 years will be eyeing a manager role specializing in FP&A functions or Finance Manager in MNC.\n\nOption 2: Finance Manager in a medium-sized consulting company based in Europe, 76% increase in salary, same work experience-General Accounting, but with Management reports needed for KPIs. I will be working side-by-side with European counterparts because all transactions of the business are there and I will directly report to senior manager and CEO which is an EU nationality.\n\n☆ Career path goal: apply all my knowledge in General Accounting, Finance Analysis and in 2 to 3 years look for a Finance Manager in MNC or work as Accounting Manager in a medium sized to large companies.\n\n• Which career path would you choose?\n• What is the most in demand and will get a higher compensation in the long run?\n• What is the role that I can get somehow more work-life-balance.\nIs it in FP&A or in Accounting?\n\nI would love to hear your thoughts and advices.",
    "title": "Which route to take? (General Accounting or FP&A)",
    "subreddit": "Accounting",
    "timestamp": 1637465407,
    "score": 6,
    "keyword": "european manager"
  },
  {
    "text": "Job advice from strangers First of all I am not sure, if I have flaired this properly.   \nI would like to start with saying that right now I am at a bit of a crossroad and have no clue on how to tackle and proceed with the situation.   \nI sent out applications to two places, and got positive feedback for both, with somewhat similar offers in terms of compensation packages. So my issue at hand comes from the fact that it might be a career choice. \n\nSo my first offer is close to a sidegrade, or at most a slight upgrade in terms of what I do right now. Senior audit associate in one of the top 6 companies, and the second one is Internal auditor in industry. I should probably mention that I am based in Eastern Europe, and so the Internal auditor role is more so for the entire European region for the company, with me being directly under the Manager of the department. \n\nWith the senior audit associate I will be pretty much doing what I am doing now, and might gain some more insight and different methodology. Whilst the internal auditor role comes with SOX testing, which is something completely new for me, and unfortunately haven't looked too much into it and what it's comprised of. \n\nI am not sure, if I want to pursue a career in CPA, which is why I am finding it hard to make a choice between the two. My thought process right now is that, by taking up the internal auditor offer I will be exposed to new stuff like SOX and networking with people outside my country, but at the same time it might be like a dead end with no further prospects in the future. The senior auditor role has the networking aspect as well, but in the country. \n\nI want to apologize, if my post is a bit hectic, but it has been hectic in my head for the past 24 hours, so I decided to ask here, if anyone can give me any guidance. Thanks in advance.",
    "title": "Job advice from strangers",
    "subreddit": "Accounting",
    "timestamp": 1618918937,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Sales Tax Disclosure at Checkout - Texas - What's required Hello friends,\nI recently started a project manager with a European company that is expanding into the US. Sales Tax has befuddled them, and I'm fairly certain we are doing it wrong. Accounting department is understaffed and I think this easily could have been missed. We produce events (concerts, immersive dining experiences, augmented reality shows, etc.). When you checkout as a customer, the price is stated as one flat rate (e.g. $50) for all our tickets.  I'm fairly certain that you have to disclose what the sales tax is at checkout. The Texas comptroller website is fairly clear, but want to confirm:\n\n\"Am I required to separately state the sales tax amount to my customers?\nYes, you must separately state the sales tax amount you charge to your customer, unless you:\n\nprovide this written statement to the customer: “Texas state and local sales and use tax is included in the sales price;” and\nprominently display a sign stating the above information for your customers to see.\" \n\nCurrently, there is no such disclosure/detail as such in our checkout. What would be the potential ramifications of this if we are screwed?\n\nI don't know much, but I do know a little. And this seems wrong.\n\nThanks,",
    "title": "Sales Tax Disclosure at Checkout - Texas - What's required",
    "subreddit": "Accounting",
    "timestamp": 1627423471,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Digital nomad lawyer post-covid. Doable? Hi /r/lawschool,\n\nI'll graduate this summer from law school in a European country and go on to work for a big law firm here. I have long had a dream that I hope to make come true in the post-covid world, where Zoom and Teams meetings have become commonplace and accepted:\n\nHaving the whole world as my office. \n\nThis means spending approx. two weeks of each month in my \"regular\" office at \"home\" in the law offices. The other two, I spend somewhere else in the world. If I want to go to Italy, I go there, if I want to go to South Africa, I go there, to the UK, and so on. All meetings are conducted on Zoom. The only issue would be time zone differences, so travel to other continents would be a bit difficult, but I'm sure I could manage that as well (say, if I go to Japan, I just work from 3-12 local time. If I go to the US, I work in the late evening and then again in the early mornings, compensating for shorter sleep with a midday nap). \n\nI'll rent out my apartment back home, rent one wherever I go, and ask local law firms if I could have a place in their offices for a week or two (a great way to build relationships with my firm back home), or rent a furnished office myself. \n\nDo you see any difficulties or caveats with this? It would be a dream, and I believe I'd be a much happier and better-performing lawyer, and able to make connections with lawyers and clients worldwide. January in South Africa, Kenya, Brazil, whatever, February in Australia, March in Thailand or Vietnam, April in the U.S, May in Italy, etc.",
    "title": "Digital nomad lawyer post-covid. Doable?",
    "subreddit": "LawSchool",
    "timestamp": 1619958943,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Debunking historical misconceptions used to demonize men: Kings started wars more than queens I think it would be helpful to get the real stories about historical events that are often quoted or talked about and a favorite for certain groups to bring up. Often these events or implications are just stated and never challenged (which is the hoped for reponse to them). Hell, I admit it worked on me for a VERY long time, and I didn't realize that by just taking what they were saying at face value and assuming \"yeah thats probably true\" the goal was already achieved. Well now we have the entire internet of information as tools to push back. All sources cited at bottom. \n\n**Misconception: Kings/Male rulers waged more wars.**\n\n \n**Truth: Between 1480 and 1913, Europe’s queens were 27% MORE likely than its kings to wage war.**\n\nAccording to a National Bureau of Economics working [paper](https://www.nber.org/papers/w23337). Queens like Queen Isabella were also more likely to amass new territory during their reigns, found the paper’s authors, economists Oeindrila Dube and S.P. Harish.\n\nBut why? A lot of it comes down to the queenly management style—and how radically it differed from that of kings.\n\nThe first clue comes from the fact that, of all European sovereigns, married queens were the most bellicose, launching more wars than unmarried queens, and kings of all types. This might be because, thanks to gender norms, women rulers tended to benefit more from marriage alliances than kings. Married queens were likelier than kings to wage war alongside allies, often their spouses’ nations. And queens frequently roped their husbands into helping rule—something that kings hardly ever did with their wives. Nowadays Isabella is less known for her conquests than for having paid Christopher Columbus to sail the oceans, her wars started remain conveniently left out. Dube (a woman) states, “People have this preconceived idea that states that are led by women engage in less conflict,” to Pacific Standard, but her analysis of the data on European queens suggests another story.\n\nHere’s Dube and Harish with more on that:\n\n \"Female reigns may have had higher capacity to carry out war since queens often put their spouses in charge of official state matters. This division of labor would then have freed up time and resources for queens to pursue more aggressive war policies. In contrast, kings typically were less inclined to put their spouses in official positions through which they could aid in managing the polity.\n\nThis asymmetry in spousal division of labor emerged in several realms. Since women didn’t serve as heads of militaries, queens would often appoint their husbands to this role, though kings of course, did not do the same with their wives.. As an example, when Queen Dona Maria II of Portugal married Prince Augustus Francis Anthony in 1836, their marriage contract stated that he would serve as commander in chief of the army.\"\n\n[Source 1](https://www.thecut.com/2016/01/european-queens-waged-more-wars-than-kings.html)\n\n[Source 2](https://qz.com/967895/throughout-history-women-rulers-were-more-likely-to-wage-war-than-men/)",
    "title": "Debunking historical misconceptions used to demonize men: Kings started wars more than queens",
    "subreddit": "MensRights",
    "timestamp": 1625944752,
    "score": 20,
    "keyword": "european manager"
  }
]