[
  {
    "text": "Found a new mineral I want to introduce to my students So, from the title you probably already figured out that I teach earthscience (European school). I recently discovered a new type of crystal that I think will interest my students. However, the way it 'grows' is somewhat unusual.\n\nSo.... How do I best ask my (vice-)principal or departmenthead for permission to buy crystals that grow on dead corpses?\n\nAnd yes, it really exists. It's called vivianite.",
    "title": "Found a new mineral I want to introduce to my students",
    "subreddit": "Teachers",
    "timestamp": 1681666974,
    "score": 22,
    "keyword": "european principal"
  },
  {
    "text": "What are my options for finding a new career (again) in my 30s? I started off as an academic (I have a PhD specializing in Russian/East European History with a side of Middle East). But the job market for that was terrible before COVID and it’s only gotten worse since then. After a couple short term positions, I realized I couldn’t keep forcing my family to move. So I took a job as a high school history teacher. Did well, got promoted to Vice Principal within a year. But I’m miserable (50 hour weeks for crap benefits and \\~70,000 a year). I keep thinking of research positions elsewhere (eg finance) but everything is quantitative (my background is qualitative). The few positions I have found and applied to either haven’t responded or turned me down flat). So I’m turning to Reddit. Does anyone have a sense of what options there are for qualitative researchers where a former academic/educator might have a decent shot? I’m in greater Boston, fwiw",
    "title": "What are my options for finding a new career (again) in my 30s?",
    "subreddit": "careerguidance",
    "timestamp": 1683802582,
    "score": 3,
    "keyword": "european principal"
  },
  {
    "text": "Richard Bilkszto, Kike Ojo-Thompson, pluralism, solipsism, and a culture clash that led to a man's suicide **Warning: Very long post. Extensive discussion about suicide and mental health follows.**\n\n\nFor this essay I am drawing from two sources:\n\n[The National Post: Toronto principal bullied over false charge of racism dies from suicide](https://nationalpost.com/opinion/jamie-sarkonak-toronto-principal-bullied-over-false-charge-of-racism-dies-from-suicide)\n\n[The Star: A Toronto principal’s suicide was wrongly linked to anti-racism training. Here’s what was really said](https://archive.is/RWzEE#selection-5255.212-5255.229)\n\nMany of my arguments below are also inspired by John Ralston Saul's book about Canada, \"A Fair Country.\"\n\n---------\n\nA man in Toronto, Richard Bilkszto, committed suicide on July 13th, 2023, after a mental health crisis set off by events at a diversity, equity and inclusion training session in 2021. He was a school principal who had a long career working in adult education and special ed. The National Post describes him as \"frequently recognized and greeted warmly within the halls of his school.\" He was 60 years old.\n\nI'm writing this because his story and experiences are so similar to my own. These two articles give very different accounts of an interaction that happened over the course of two staff training sessions. The truth, of course, is surely somewhere between the two accounts. There is no such thing as unbiased media sources in the present day, so the best we can do is to compare:\n\nPer The National Post:\n\n*His stellar career took on a sour note after he was bullied in a diversity, equity and inclusion training session for Toronto District School Board (TDSB) administrators in 2021, according to a lawsuit Bilkszto filed in court. His sin, in the eyes of facilitators at the KOJO Institute, was his questioning of their claim that Canada was a more racist place than the United States. Canada wasn’t perfect, he said, but it still offers a lot of good. For the rest of the training session, and throughout a follow-up training session the week after, facilitators repeatedly referred to Bilkszto’s comments as examples of white supremacy. The experience was humiliating — particularly because Bilkszto placed a great emphasis on equality and anti-discrimination during his career.*\n\nPer The Star:\n\n*At issue, based on news reports, were two statements. One, Ojo-Thompson challenging a beloved Canadian myth by stating “Canada is more racist than the United States” and, two, “reacting with vitriol” when the former principal objected as well as “humiliating” him by calling him a “white supremacist” and a “resistor.”\nThe Star obtained a copy of the recording of the two sessions in question from a source who was present at the meetings. Based on it:\nOjo-Thompson never said: “Canada is more racist than the United States.”\nShe never called Bilkszto a “white supremacist and resistor.”\nThe recordings reveal for the first time a fuller picture of the conversation and disagreement that has been cherry-picked, shorn off context and nuance, and presented by those with an agenda to villainize diversity initiatives.*\n\n--------\n\nIn this context, I'd like to say a few things about Canada. I am interested in **equality**, **diversity**, and especially I'd like to speak about **pluralism**. I have been writing about these things lately, from my perspective and my experiences as a white man whom all his grandparents were born here in Canada. I was born in 1989. Canada at its best is a beautifully diverse and loving, welcoming society. At its worst, of course, its history and its present are in so many ways so abhorrent. \n\nI had the good fortune to grow up in a healthy left-wing Church community, where I learned important and deeply Canadian things about how to interact as a group of people. Canadian culture is about sitting in a circle. Things took a turn for the worse, though, and I had a falling out with the Church in a way that has caused me a lot of psychic distress over the years. I recognize what happened to Richard Bilkszto and *people need to understand*. This is clearly a story of two cultures failing to communicate, this is obviously a culture clash, that had tragic consequences.\n\n--------\n\nIt is not recognized widely, but truly Canadian culture has deep roots in the traditions of the Indigenous people who were here when the Europeans first made contact. This is where we get our strange Canadian ability to all function together in such a diverse, multicultural society. We have always been a society of immigrants - around 85% of new arrivals here become citizens, compared to about 40% in the States. Canada also has one of the highest rates of interracial marriage in the world.\n\nCanada also had both the French and the English settling at the same time, so in a way Canada was never a nation-state, it was always a story of different groups of people negotiating their way through the climate. This history was covered over in the late 19th Century with Confederation and a new wave of British colonial influence. We do things so weirdly compared to other places, but we do not know our own history - today we only know the bad parts.\n\nIt is broadly recognized now how the past centuries have led to the present shocking inequality and ongoing injustice for Indigenous peoples. What is overlooked is how over these centuries there were (and continue to be, in many places) also so many positive exchanges and rich cultural development between the settlers and the Native people, an interaction that played out very differently here than in the United States, who have their own history. For a further discussion of this see the book by John Ralston Saul, *A Fair Country*.\n\n-------\n\nI believe that a fundamental Canadian value is that of Pluralism. There is more than one voice. There is more than one valid opinion. There can even be multiple perspectives that seemingly contradict each-other. There are lots of us here, and we're all different. We need to figure out how to all get along. There are so many angles, many different people with different lives, and each of us can contribute by bringing our perspective into the conversation. Pluralism is something that is deeply connected with Equality, in its real sense.\n\nThe historical context here is very different, and Canada cannot be understood simply through comparisons to our southern neighbours. As I like to joke, Canada is not America's hat! The black people in Canada whose families have been here the longest are mostly the descendants of escaped slaves. I can't speak for them, just the history and the context is *very different* and needs to be recognized as such when speaking about the culture and social justice here. Canada, in this obviously idealized image of the country, has a lot to offer to the world.\n\nThe National Post:\n*Michael Teper, a representative of SOS TDSB, described Bilkszto’s philosophy as a classical liberal approach — he believed in providing equal opportunities to all, and offering outreach to underserved communities. He opposed the use of “artificial means to produce an equal outcome” and the use of racial stereotyping in hiring and school admissions. Bilkszto previously appeared on TVO to explain the debate as it was unfolding in Toronto schools.*\n\nI believe that *this* could be what Bilkszto was trying to speak up for, if he highlighted Canadian health care and funding for social programs. It's very difficult to have your life and values be rooted in this Canadian experience because it is not something that is well-represented at all, and we so often get lumped in with our neighbours to the South and painted over with the same brush - a brush that isn't really adequate for their culture either. \n\n--------\n\n**Solipsism and the threat of Authoritarianism**\n\nThe opposite of Pluralism is Solipsism. The Pluralist understands that they are one of many, while a solipsistic viewpoint sees itself as the only valid frame of reference. For a solipsist, everything orbits around them, and they are the ones who are here to direct and teach the rest of us and show the way forward. Solipsism comes with Dogma, Theology, entrenched viewpoints - we've reached a point where feminism in the 21st century needs to be discussed in the context of religious doctrine.\n\nThe person who showed me the article from the Star described the situation as being between people who are progressive and people who are still learning. This makes it sound as if any objection must come from a point of ignorance. It is autocratic, and at its very worse this is a looming threat of Authoritarianism. There are many frames, and all of us can learn from the others, and if we believe truly in equality in this century, this is what needs to happen. Of course, inequality still exists - there is disagreement here on the means, not the ends.\n\n-------\n\nThe Star:\n*In response, Ojo-Thompson leans on her personal experience as a Black woman to say: “I felt more normalized as a Black woman there than I do here. We’re invisibilized from the cultural fabric of this nation. Canada has never reckoned with its anti-Black history,” and, “I lived in the South. And I’m saying this factually without any hiccup. The racism we experience is far worse here than there.”*\n\nShe did not grow up here. She's *welcome* here. Of course this does not invalidate her as a person, or her perspective, it's not a bad thing that she is from elsewhere, just she is bringing her context as a person who grew up in a very different society. She is bringing to the table a comparison between her experiences in the US and Canada, and she is surely completely right that in many ways her time in the South was preferable. That is not at all what I am objecting to here. \n\nShe is only one person. She is one of the voices in the room. I object to the shape of the relationship that she makes with the participants of her workshop, putting herself in the position of authority, like a preacher - and taking full control of the conversation in the room. She clearly knows who her enemies are. A leader should be a facilitator and should create space for something beyond us to form between us. \n\n-------\n\nThe Star:\n*At a subsequent meeting the next week, Ojo-Thompson began by revisiting the concept of resistance that she mentioned even before the interaction with Bilkszto and how resistance upholds white supremacy. “I want to open by going back to the concept of resistance,” which “is going to be the most transformational, because we don’t talk enough about the many, many responses to the work, what they look like.”*\n\n*Soon after she says, “One of the ways that white supremacy is upheld, protected, reproduced, upkept, defended is through resistance.”*\n\n*Then she references the interaction with Bilkszto from the previous week, saying, “who would have thought my luck would show up so well last week that we got perfect evidence of a wonderful example of resistance that you all got to bear witness to. So we’re going to talk about it, because it doesn’t get better than this.”*\n\n*She's quoted as saying: “So we’re here to talk about anti-Black racism, but you in your whiteness think that you can tell me what’s really going on for Black people? Like, is that what you’re doing? Because I think that’s what you’re doing, but I’m not sure. So I’m going to leave you space to tell me what you’re doing right now.”*\n\nLet me be snarky for a moment here: What does she know about making space, really? Does she honestly believe that her behaviour here is making space? He was chastised for the way he attempted to interact. The ability to make space is sacred, and she is being sarcastic to him about it.\n\n**He tried to present himself as an equal to her**, and she repeatedly cast him in a negative light for that. She was the one in the position of authority. And she took it on and started using him as a negative example. \n\nThe Star criticizes him for not asking the right type of questions - not looking up to her from a submissive role, for him not being a diligent pupil:\n*That’s not a help-me-understand question typically posed by workshop participants to trainers. That’s a man saying to a woman, an expert on anti-racism, at the end of a session that is replete with history, data, experience and nuance, that she’s flat-out wrong.*\n\nThis is egregious. He did not say that she was outright wrong, he said that Canada had good things too. Ojo-Thompson is out of line. What is being described here is not Equality, it is one person casting herself as the Authority, the Leader and the Teacher. Furthermore, to claim authority by having science and data on your side is another hallmark of an over-regimented solipsist, who wants control over what is and isn't valid. She needs to learn to be one of many, so that we can all move forward. And, of course this is not to say that inequalities do not exist. Such an objection to the argument I am giving here would be in poor faith. \n\nThe beautiful thing about being Canadian is that I do not need to negate my culture, in order to welcome yours. My culture is not here to be overthrown, it's a beautiful, living, healthy thing. Cultural growth happens best through mutual understanding and exchange - the path forward is revealed in front of us merely if we'll have the conversations. There is still so much work to do, but it has to happen truly as equals.\n\nThis kind of interaction happens all over the world these days, not only in the Canadian context, but it is important to understand how deep of a cultural attack it was on Bilkszto to associate him with white hegemony and to call his words \"resistance.\"\n\n---------\n\nThis man's suicide is consistent with my own experiences being male in our society, and it is spoken about in similar terms in many places where men speak about these things. This is not an isolated case. This is a common pattern in men's experience today: wanting to contribute, not knowing how, trying something, then getting a hostile reaction. He was a special ed teacher, adult education, etc. - was this man autistic? He was surely walking to the beat of a different drum. We'll never know.\n\nWhat I do see though, is that he was trying to make a positive contribution to the community. He was living a generous life, and likely had his own idiosyncratic views of things. This workshop probably brought up a bunch of feelings buried deep inside. That's the male experience today. Self-censorship, self-doubt, and feelings of guilt associated with having your own views, which in turn leads to feelings of alienation, and then it just gets worse and worse and spirals out of control when you try to find help.\n\nIn the article in the Star, they highlight how he didn't speak up until the last 10 minutes of the session. Kind of with a tone that's blaming him for that. You know what I think was happening? I think until then, he was too afraid to speak.\n\nThe article in The Star calls this man's suicide an \"isolated incident.\" I find that shocking.",
    "title": "Richard Bilkszto, Kike Ojo-Thompson, pluralism, solipsism, and a culture clash that led to a man's suicide",
    "subreddit": "MensRights",
    "timestamp": 1690773568,
    "score": 9,
    "keyword": "european principal"
  }
]