[
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 512,
    "keyword": "european principal"
  }
]