[
  {
    "text": "Is there even a way to escape the patriarchy/male gaze/internalised competition? I just finished reading chapter three of \"ways of seeing\" by John Berger (a group of essays written on our perception of different topics). Specifically chapter three breaks down traditional European art (often religious) and it's relation to the male gaze. I've been on the verge of understanding more depths of a woman's beauty, and lack thereof. The identity of what beauty even is and what it represents, why it even matters... Also wondering further into my own experience and struggles within those confines.\n\nIn reference to a renaissance painting where four women are naked and competing for a mans attention: \"But a further element is now added. The element of judgement. Paris awards the apple to the woman he finds most beautiful. Thus Beauty becomes competitive. (Today The Judgement of Paris has become the Beauty Contest.) Those who are not judged beautiful are *not beautiful*. Those who are, are given the prize.\" \n\nI found this gut wrenching as I have always been beautiful enough to compete, but rarely beautiful enough to \"win\". In many personal instances to make it to \"the final two women\" only to not be the woman chosen in the end. I have wondered for years was it because I was not sexual like the many women who \"won\" before me? I was never conservative, but modest. The more I covered, the more I felt controlled by a make belief narrative men have spewed to control young women just like me, it repulsed me. But the same happens when I dress sexually, it feels the men benefit and lick their jowls as if they can taste my skin prematurely. I know I am happiest dressed modestly. But have internalised these experiences.\n\nBut then I think about my marriage. I am a sexual being, a woman who wants to give pleasure and wants to receive pleasure. But I am in a relationship where my husband can only be sexual when he has \\*decided\\* he is sexual. I never thought much of this, as many women (& people) live like this. I, however can become sexual if I try to on most occasions. Recently, I sat in a circle of married women rejoicing in how their husbands can't keep their hands off of them. How beautiful it makes them feel to be equally matched in their libidos. How great it feels to be desired by someone who loves them, and they love in return. How great it is to be pleasured by them. How deep that mutual pleasure is... & I circle about why it cuts me so deep that I don't feel desired by my partner sexually. That my partner does not make me feel good during sex; I make myself feel good in sex. How lonely that feeling is. How I want him to sexualise me the way the men on the street do. The way I degrade myself to feel worthy of some type of affection, but even that is short lived, and my pleasure is only through his eyes.\n\nI could type forever, but wonder, how does a hetero-women escape this? How do I free myself from the confines of these internalised patriarchal views? Without my husband (who loves me dearly and is an equal husband) I feel the most free sexually. I not only feel valid in my own body, but inherently gorgeous in what my body has done and can do (I am a mother). How do I stop competing within myself when I stand in front of him? How do I communicate that he does not make me feel beautiful because he does not desire me, he desires sex. I don't want to make him feel small or that his feelings don't matter.",
    "title": "Is there even a way to escape the patriarchy/male gaze/internalised competition?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1698086679,
    "score": 6,
    "keyword": "european judge"
  },
  {
    "text": "Is this subreddit only for Americans? What exactly is a law school? Hello guys. I have a couple of questions.\n\nFirst of all, I am a Polish law student. I dream of becoming a judge after obtaining my Master's Degree. I wonder, am I not allowed to browse and post here? Is this subreddit only for Americans? All I see are Americans here.\n\nI wonder - we in Europe have a different legal system than in America. As far as I understand, the American law is based upon the rulings of courts. Not the case here. The law is created with bills passed through the the parliament. I wonder, do Americans generally see their system as a superior one?\n\nAlso, I don't want to sound like an idiot, but exactly is a law school? Here, we study law the same way as we study any other course. My university has a Law faculty in the same way as it has a Physics faculty, which is located just 100 metres away. Law is not really a different course than any of the other ones. Why do Americans refer to, \"Law School\" and not just, \"studying Law at a uni\"?\n\nAlso, I wonder about the following - Polish Law graduates have to undergo a three year long practice in order to become a judge, attorney etc. is it the same in America?\n\nEdit: I am sad that people did not like the post, I was just curious.\n\nHere's more info about becoming a lawyer in Poland, in this case it's about attorneys. Look under, \"how to become an attorney\".\n https://kirp.pl/the-profession-of-an-attorney-at-law-in-poland/\n\nPoland, like many European countries, has two levels of PhD holders - the standard PhD holderz (*doktorzy*) and the higher level PhD holders, called *doktorzy habilitowani*. If you are a *doktor habilitowany*, you can become a judge, attorney, bailiff etc. without having to undergo the 3 year long training.",
    "title": "Is this subreddit only for Americans? What exactly is a law school?",
    "subreddit": "LawSchool",
    "timestamp": 1695651016,
    "score": 237,
    "keyword": "european judge"
  },
  {
    "text": "Having too many white friends? Hello, as the title says, I think I have too many white friends. First of all I want to mention, that I live in an European country. There arent many black people here, although we do have some kind of community.\n\nGrowing up I was quite introverted, shy and had social anxiety. I did have black friends and still do, but not as many as I would like. The reason I hanged out with more white friends is that they were slightly more nice. I was bullied a lot around people in my community (especially boys) that I never really got in it. I also got bullied by white kids. \n\nBecause of social anxiety, bullying and being naturally introverted, I usually had like maybe one or two close friends. Now that I am 25 I realize that I have only one ”close” friend who is black, and also other two that I would consider acquaintances. The rest are white girlfriends, about two that I hang out or interact with. \n\nI think I have more white friends for these reasons: I live in an European country that is basically 99% white. Therefore for example in college, the nee people I met where just white. I also feel like the white friends that I have are more emphatic and kind. Some of the black friends that I know from the past have strong opinions about something and are not willing to think about other perspectives. I also feel judged with the past friends about my life choices (what career I want to do, who I want to date, where I live). And in no way that I am saying that white people in general are any better, is just that in my observence I feel like the white friends I have right now are more open. \n\nBecause I have mostly white friends and a few black friends, it sometimes fucks me up. Obvoisluy there are moments where I feel like they dont understand me, but that happens with anyone to be honest. But I constantly struggle with my identity. Sometimes I feel ashemed that I have so many white friends. I even dont want to post anything on social media because of shame. I dont know where the shame comes from. I guess I feel like people will judge me for hanging out with white people. \n\nCan anyone relate?",
    "title": "Having too many white friends?",
    "subreddit": "blackladies",
    "timestamp": 1691824663,
    "score": 0,
    "keyword": "european judge"
  },
  {
    "text": "Woman demands 126 million for 'mental pain' caused by an ex-lover who happens to be the ex-king of Spain. King Juan Carlos of Spain should go down in history for ridding Spain of the dictator Francisco Franci. It is horrific for us Europeans that until the 1970s Spain still used capital punishment. \n\nBut King Juan Carlos brought democracy to Spain and we have seen some of the greatest leaps in human rights occur in Spain in the past decades. \n\nHe is now in his mid 80s and no longer king. A woman who had a love affair with him accused him of harassment. The case was heard very recently in a British court and it was thrown out by a FEMALE judge.\n\nI always wonder in such cases, whether if I were accused of harassing a woman she'd demand millions from me. But she'd know that even thousands would be beyond me so these women seem to pick their victims carefully. \n\n&#x200B;",
    "title": "Woman demands 126 million for 'mental pain' caused by an ex-lover who happens to be the ex-king of Spain.",
    "subreddit": "MensRights",
    "timestamp": 1696974251,
    "score": 222,
    "keyword": "european judge"
  },
  {
    "text": "Debunking the \"Gender Pay Gap\" Copied from the [original post here](https://www.reddit.com/r/TraditionalMuslims/comments/14p3dwq/debunking_the_gender_pay_gap/).\n\nSo I didn't think I needed to debunk this as it's been done a million times before. However, it's come to my attention that apparently some still believe it. So, just to have an easy-to-reference, codified treatise on the issue, I'm writing this piece to utterly decimate this commonly propagated liberal trope.\n\nMainstream media presents [articles like this](https://www.businessinsider.com/gender-wage-pay-gap-charts-2017-3) that claim there is a pay gap between men and women, and that it's on the sole basis of gender. While it is true that men tend to earn more money than women, it is absolutely false that it's due to gender bias in favor of men (if anything, it's actually in favor of women). The problem with the statistics shown is that they only take into account median yearly salaries without accounting for any other confounding variables that may be skewing the data. For example, if I told you that the more people drown the more often ice cream is sold, would you take that to mean that ice cream causes people to drown? No, you'd probably say that it's because of ice cream sales increasing in the summer when it's hot, which is simultaneously when people go swimming more, thereby increasing the likelihood of drownings to happen; this shared commonality (i.e. the heat) is a confounding variable.\n\nFor the so-called \"gender pay gap\", here are the confounding variables:\n\n1. This statistic does not account for what types of jobs are being worked, as **men choose higher-paying jobs**.\n   * [*Source 1.*](https://pubsonline.informs.org/doi/10.1287/orsc.1120.0757) *Demonstrates how women choose different jobs than men because they value and/or prioritize different things than men (e.g. better work-life balance). Because of this, the jobs they prefer tend to be lower-paying.*\n   * [*Source 2.*](https://academic.oup.com/oep/article-abstract/57/3/479/2361925?redirectedFrom=fulltext) *Same as Source 1, but also found that \"job satisfaction of men increases with additional earnings while that of women does not\" (p. 486).*\n   * [*Source 3.*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *Landmark study; displays evidence that men choose higher-paying jobs. The more egalitarian/feminist a country is, the fewer women choose careers in science, technology, engineering, and mathematics (i.e. traditionally male-dominated roles). Giving greater career choice to women increases (apparent) gender disparities within the workforce.*\n   * [*Source 4.*](https://www.jstor.org/stable/2525981) *Cited over 11,600 times. Demonstrated very directly that women choose jobs that are lower-paying, and that women are NOT being paid less to do equal work; and this was in 1973, almost 50 years ago. Please note that any discrimination found thereafter is really just residual unaccounted variability rather than actual discrimination per se, as detailed in the conclusion.*\n   * [*Source 5.*](https://journals.sagepub.com/doi/abs/10.1177/0891243210361475) *So ignoring the ideological bullshit that's indirectly being pushed, it demonstrates clearly that women choose different jobs than men and that it is solely due to their own choice; and that the only time women don't choose traditionally female jobs over male jobs is when they're essentially forced to take the male job.*\n      * *Interestingly enough, this supports the findings of* [*this study here*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *(which was a MASSIVE, catastrophic blow to the \"men and women are equal but female oppression and gender discrimination are the only reason why we aren't\" narrative); the researchers found that the more egalitarian/feministic a society is, the greater the gender differences will be (regarding what people will choose to pursue). In other words, when you give women free choice to pursue whatever they want, they will willfully choose occupations/education/life goals that will only increase the gender gap between men and women.*\n2. The statistic does not account for **different positions within a respective field** (e.g. head/lead developer vs senior developer vs junior developer; they're all developers, but different rankings/positions). We know this because it's not possible to know the relative rankings/positions of people's careers if they don't even know what those careers are in the first place.\n   * [*Source 6.*](https://www.jstor.org/stable/1808858) *Looked at a company from the years 1966 and 1969-1971; found no gender discrimination when accounting for all variables. States that at most, there may be gender discrimination with regards to promotion, but even this is speculative as it is not explained why this may be the case (and truth be told, we already know why this is; I will explain later on). If the concept of a gender wage gap was already being debunked/disproved back then, it definitely doesn't exist now (at least, not in favor of men anyway...).*\n   * [*Source 7.*](https://www.jstor.org/stable/30038574) *Studies a company that was sued for ACTUALLY discriminating against women with regards to promotion, and found that there wasn't any pay differences between men and women who were given the same job/assignment. In other words, even when discriminating against women, they were still being fair about the pay.*\n3. The statistic does not account for **age** (e.g. a young person may make more money than an older person in a physically-taxing field, older people in fields that would require more knowledge/wisdom to handle, etc.).\n   * [*Source 8.*](https://www.nber.org/papers/w26623) *Generally speaking, workers over age 40 are only about half as likely to get a job offer as younger workers if employers know their age*\n4. The statistic does not account for **job tenure** (i.e. how long someone has been working for their respective employer for).\n   * [*Source 9.*](https://journals.sagepub.com/doi/abs/10.1177/0003122413514584) *Shows men in general have greater job tenure than women. It's decreasing overall (particularly for men) but there are various reasons for it, many of which are oftentimes advantageous from a career/monetary standpoint, which men are going to be more receptive towards since men typically prioritize money more than other aspects of a career (see Source 1).*\n   * [*Source 10.*](https://www.jstor.org/stable/1831432) *It's in the title; job tenure typically entails higher wages. In recent times, this has been changing within certain fields (hence why it's been decreasing as shown in Source 8 above), but the point still stands overall.*\n5. **Men work more than women**, which implicates in the previous 2 points with men being able to develop greater job tenure and work experience. More men work full-time than women. Moreover, the term 'full-time\" means anyone working 35 hours or more (with some lowering it to 30 hours or more to further skew the stats in favor of their social agenda); this could mean anywhere from 35 hours to 135 hours per week, and I can tell you right now that the vast majority of people who are working an exorbitantly high number of hours are men, NOT women.\n   * [*Source 11.*](https://www.bls.gov/opub/ted/2015/time-spent-working-by-full-and-part-time-status-gender-and-location-in-2014.htm) *Statistics from the US government. Men simply work more than women, even when comparing men who work full-time to women who work full-time, and men who work part-time to women who work part-time.*\n   * [*Source 12.*](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) *More statistics from the US government for 2019.*\n      * *\"Among full-time workers, those usually working at a job 35 hours or more per week, men are more likely than women to work more than 40 hours per week. In 2019, 25 percent of men who usually work full time worked 41 or more hours per week, compared with 14 percent of women. Women were more likely than men to work 35 to 39 hours per week: 10 percent of women worked such hours in 2019, while 4 percent of men did\" (p. 8).*\n      * *Women were more likely to be working a part-time job than men.*\n      * *\"Women who worked part time made up 23 percent of all female wage and salary workers in 2019. In comparison, 11 percent of men in wage and salary jobs worked part time.\"*\n   * [*Source 13.*](https://www.bls.gov/opub/reports/womens-earnings/2020/pdf/home.pdf) *Even more statistics from the US government for 2020.*\n      * *19.6% of men working full-time worked 41 or more hours per week, compared to only 10.2% of women who were working full-time. This means that men working full-time were nearly twice as likely as women to work 41 hours per work or more (Table 5). This coincides with* [data discussed at the 2019 G20 Summit](https://www.ilo.org/wcmsp5/groups/public/---dgreports/---cabinet/documents/publication/wcms_713376.pdf)*.*\n      * *Men working full-time were also 2.3 times more likely than women to work 60+ hour weeks: 4.3% of men worked 60 hours per week or more compared to only 1.9% of women.*\n      * *Women working full-time were more than twice as likely as men to work shorter workweeks of 35 to 39 hours per week: 7.7% of full-time women worked those hours, compared to only 3.6% of men who did so.*\n      * *Men working 35-39 hours per week earned only 92.4% of what women earned working those same hours ($600 median weekly earnings for men vs. $649 for women). This means there was a 7.6% gender earnings gap in favor of female workers (for that cohort), and this is BEFORE accounting for any confounding variables!!!*\n      * *Women were more likely to be working a part-time job than men.*\n      * *Although not reported by the BLS, it can be estimated using its data that the average workweek for full-time workers (in 2020) was 41.3 hours for women and 42.8 hours for men, meaning the average man employed full-time worked 1.5 more hours per week compared to the average woman. This adds up to men, on average, having worked an additional 78 hours per year compared to the average full-time female worker.*\n      * *Some of the raw earnings gap naturally disappears by simply controlling for some of the variables. For example, women technically earned 82.3% of median male earnings for all workers working 35+ hours per week (i.e. full-time). But for those workers with a 40-hour workweek (more than three-quarters of all full-time female workers), women earned 87.4% of median male earnings, and that's after accounting for just one variable: hours worked.*\n      * *For young, full-time workers aged 16-24, women earned 94.7% of the median earnings of their male counterparts. Once again, controlling for just a single important variable—age—we find that more than two-thirds of the \"gender pay gap\" disappears. There are tons of other factors like these that go unaccounted for when you hear people/the media talk about the gender pay gap. Keep this in mind from now on.*\n   * [*Source 14.*](https://www.bls.gov/opub/mlr/2008/02/art5full.pdf) *Conducted by the US government. Looks at 12 European nations and shows that men work more than women in all of the countries studied, among many other things.*\n   * [*Source 15.*](https://www.bls.gov/news.release/atus.t04.htm) *Government statistics for 2021. Men clearly work more than women.*\n   * [*Source 16.*](https://journals.sagepub.com/doi/abs/10.1177/00197939211045376) *Some people may not think that men work more than women enough to help warrant the pay gap, but this paper explains otherwise (they basically accounted for the jobs being worked and how men and women vary in the number of hours worked within these specific jobs rather than ignoring the types of jobs worked).*\n6. Building off the previous point, **men work more overtime**, and the gender pay gap statistic does not account for overtime pay. And if men are working more hours than women, that means that men are going to make more money from overtime which is higher than your standard base rate.\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *This is one of my favorite studies ever. It's just so well-done and is, in my opinion, the epitome of what research is supposed to look like. It was conducted by Harvard University, and one of the authors is literally a woman (meaning there isn't any bias caused by sexism or misogyny on behalf of the authors). It demonstrates a multitude of things, but as it relates to this specific point, it shows clearly that men work more overtime than women (p. 2–3; Figure A.16, p. 85).*\n7. **Men are more likely to accept overtime, and especially when presented without prior notice** (e.g. if someone had an emergency and couldn't come in, and employees are asked if they can stay, men are more likely to accept it). This means men tend to be more reliable workers overall. It's technically a separate point from the one above because the frequency of accepting overtime is different from actually working it (e.g. someone could work a lot of overtime one week and not work it at all for the next 12 weeks, vs someone who works only a few hours of overtime every week).\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Also shows how men are more likely to accept overtime when it's presented to them and that men in general are especially more likely to accept overtime without prior notice (p. 3; Figure 6, p. 49; Figure A.17, p. 86).*\n8. **Men are less likely to have unexcused absences.**\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Women have more unexcused leave of absences than men (Figure 22, p. 65). This further implicates men as being more reliable workers. What's ironic is that men face harsher penalties/disciplinary measures than women (Figure 21, p. 64), contrary to popular belief.*\n9. The statistic does not account for **work experience** (i.e. how long someone has been working in their respective field).\n   * [*Source 18.*](https://www.jstor.org/stable/2535309) *In general, men have greater work experience than women (courtesy of working more than women); the timing of work experience and overall work matters a lot as well, and since men are simply working more than women, the advantages of this timing will be more apparent in men than women. This study has data directly showing that men have greater actual work experience, potential work experience, and job tenure than women (the last of which relates back to the previous numbered point).*\n10. **Men do not get pregnant and are less likely to leave work for kids** (e.g. paternity leave); pregnancy forces women to stop working, which relates back to points 4, 5, 8, and 9, and men being less likely to leave work for kids also shows more dedication to work.\n      * [*Source 19.*](https://onlinelibrary.wiley.com/doi/full/10.1111/gwao.12506) *The abstract alone states \"mothers with young children have reduced their work hours four to five times more than fathers\". Some of you may say that this therefore nullifies Source 12 as supporting evidence for point 5, but it actually strengthens it because it exemplifies the gender differences that can cause a skew in the gender wage gap myth and highlights the behavioral dimorphism between the sexes. At most, it would only nullify SOME of its generalizability on a year-to-year basis, but even then, it still showcases how statistics can be skewed/misrepresented to provide a false narrative about gender discrimination that doesn't actually exist with regards to pay. Anyway, Source 13 also states similar as well due to the Family Medical Leave Act (FMLA) where women are far more likely to leave work/not come in, but I don't want to be redundant and keep using the same source even though it's a fantastic study.*\n11. **Men are less likely to take sick days.**\n      * [*Source 20.*](https://academic.oup.com/occmed/article/68/5/320/4973626) *Women take more sick leave than men, even after accounting for many variables.*\n      * [*Source 21.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6070205/) *The introduction alone is enough to show that women take more sick leave than men, this is undisputed and has been for decades. This study sought to determine whether there were differences in attitudes towards sick leave based on gender, and whether this contributes to women's absenteeism. They did not find much support for this, indicating that women take more sick leave regardless of societal norms and expectations.*\n      * [*Source 22.*](https://journals.lww.com/joem/Abstract/2015/08000/High_Job_Demands,_Job_Strain,_and_Iso_Strain_Are.5.aspx) *Women take more sick leave due to mental health reasons than men (p. 860), with 90% of \"mental health\" reasons being either stress, mood, and/or anxiety-related.*\n12. **Men are less likely to take vacation days.**\n      * [*Source 23.*](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1019.5400&rep=rep1&type=pdf) *Great study that shows how women take more vacation days than men, while also discussing why it is the case. Has several other findings/key points that showcase male-female dimorphism as it relates to work and the family, and they are very interesting; they essentially prove what is already self-evident with regards to gender roles, despite what mainstream society is trying to push today.*\n13. **Men are more likely to move for a job.**\n      * [*Source 24.*](https://www.demographic-research.org/volumes/vol40/53/40-53.pdf) *Shows conclusively that men are more willing to move for a job. They try to say that single women are just as likely as single men to move for a job after accounting for confounding variables, but that's nonsense because one of the variables was essentially how well they like the job (i.e. \"job characteristics\"), when the location of a job doesn't have an impact on how much the job itself should or should not be liked (and if any of you researchers disagree, you will need to account for the Halo Effect to fully make sure that distance isn't what's making them view those same \"job characteristics\" as distasteful enough for them to not want to move). It's as if they're trying to say that jobs should cater to women by changing how they operate so women will like them better, rather than simply just acknowledge that women do not want to move for work as much as men. In fact, it's not even as if they're saying that, they literally suggest it lmao! It's very gynocentric when you look at it. The reason why they say this is because they do not want to admit that the gender gap is literally caused by women's own personal preferences, because then that would mean that the gender gap is normal, natural, and that women willfully make the choices that cause the gender gap, essentially nullifying any narrative that women are victims of oppression and that the gender differences that exist between men and women are caused by men and women ACTUALLY being different. This last point really irks the ideologues. In addition, it would place accountability over the gender gap on women, and women absolutely cannot handle having accountability.*\n      * [*Source 25.*](https://www.glassdoor.com/research/app/uploads/sites/2/2018/05/GD_ResearchReport_MetroMovers_Draft4-1.pdf) *Literally the same thing as the previous source (including all of the progressive diatribes that I dismantled) but with a massive online job search website.*\n      * [*Source 26.*](https://web.stanford.edu/~niederle/CEN_discrimination.pdf) *This one has some progressivism within it as well, but ignoring that, we find that any discrimination against women isn't due to them on the sole basis of them being women, but rather because of beliefs over how well they would do the job. In fact, it shows that people are MORE likely to favor women as job candidates when a negative belief is ascribed to a woman rather than when it is ascribed without the gender being stated. In other words, gender discrimination isn't gender discrimination at all but rather performance discrimination, which is the definition of a meritocracy (i.e. a system in which people are judged based on their merit/how good they are at their job, rather than characteristics unrelated to said job/merit).*\n14. **Men are more likely to work night shifts.**\n      * [*Source 26.*](https://www.bls.gov/opub/mlr/2021/article/nonstandard-work-schedules-in-29-european-countries-2005-15-differences-by-education-gender-and-parental-status.htm) *Government study looking at data across 29 European nations from 2005-2015. It shows that in every region, save for Scandinavia, men are more likely than women to work hours outside the standard 9-5. This coincides with data from Source 14 and Source 17, which showed similar findings.*\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Shows definitively that men are more likely to work night shifts than women.*\n15. **Men are more likely to work weekends.**\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Also shows that men are more likely to work weekends than women.*\n      * [*Source 28.*](https://www.bls.gov/opub/mlr/2011/07/art1full.pdf) *While also showing that men are more likely to work nonstandard work shifts, it also shows that men are more likely to work weekends as well, which Source 11, Source 14, Source 15, and Source 17 also demonstrated.*\n16. **Men are more likely to work holidays.**\n      * *Yet again, this was already shown by Source 11, Source 14, and Source 15.*\n17. **Men are far more likely to work dangerous jobs** such as oil riggers, underwater welders, etc. These male-dominated jobs pay higher than nurses and hair stylists on the basis of danger, hence why it's separate from the first point.\n      * [*Source 29.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4880472/) *Men are more likely to work dangerous jobs and are simply more willing to accept risks that jobs may have in general. This is represented by the fact that men make up most workplace deaths.*\n         * [*Source 30.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2004_chart11.pdf) *US government data for 2004; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 31.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2006_14.pdf) *US government data for 2006; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 32.*](https://www.bls.gov/iif/oshwc/osh/os/oshs2008_33.pdf) *US government data for 2008; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 33.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0009.pdf) *US government data for 2010; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 34.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0011.pdf) *US government data for 2012; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 35.*](https://www.bls.gov/iif/oshwc/cfoi/cftb0292.pdf) *US government data from 2014; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 36.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi-chart-data-2017.htm) *US government data from 2017; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 37.*](https://www.bls.gov/news.release/pdf/cfoi.pdf) *US government data from 2016-2020; shows that men make up the overwhelming majority (93%, 93%, 92%, 92%, 92% for each consecutive year, respectively) of workplace deaths.*\n         * [*Source 38.*](https://www.ualberta.ca/anesthesiology-pain-medicine/media-library/eliassons-wellness-docs/mens-mental-health/a-roadmap-to-mens-health.pdf) *97% of workplace deaths in Canada between 1993 and 2005 were men.*\n         * [*Source 39.*](https://www.safeworkaustralia.gov.au/sites/default/files/2020-11/Work-related%20traumatic%20injury%20fatalities%20Australia%202019.pdf) *97% of workplace deaths in Australia were men in 2019, with similar trends from 2003-2018 as well. These are the things feminists will never, ever talk about.*\n18. **Men are more interested in jobs that are scalable**; men are more interested in physical things, while women are more interested in jobs that deal with people. The former is scalable, the latter is not; that means Elon Musk is able to service millions of people with Tesla whereas Mrs. Johnson is only able to teach a class of 30 students per year. This point is separate from the first point because scalability relates to potential growth/earning, and based on the laws of chance, you're more likely to find some major hit successes in professions that are scalable rather than unscalable.\n      * [*Source 40.*](https://pubmed.ncbi.nlm.nih.gov/19883140/) *Meta-analysis showing men are interested in things, and that women are interested in people.*\n      * [*Source 41.*](https://www.frontiersin.org/articles/10.3389/fpsyg.2015.00189/full) *Another meta-analysis that supports the previous one above; \"patterns of gender differences in interests and the actual gender composition in STEM fields were explained by the people-orientation and things-orientation of work environments\". Basically, even in male-dominated fields, women are overrepresented in service-based and people-oriented STEM fields such as the health sciences, with the trend being found on a multinational level. This also acts as evidence for the very first point about men choosing higher-paying jobs.*\n         * [*Source 42.*](https://www.bls.gov/cps/cps_aa2018.htm) *Evidence from the US showing this trend with women.*\n         * [*Source 43.*](https://afmc.ca/sites/default/files/pdf/CMES/CMES2018-Complete_EN.pdf) *Evidence from Canada showing this trend with women.*\n         * [*Source 44.*](https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance-2017/doctors-by-age-sex-and-category_health_glance-2017-53-en) *Evidence from OECD countries (38 in total, with another 10 non-OECD countries included throughout in some data).*\n19. **Men are more likely to ask for a raise.**\n      * [*Source 45.*](https://crl.acrl.org/index.php/crl/article/view/16689) *Men are more likely to ask for a raise; the only exception is when women enter managerial positions (i.e. are put in male roles, basically). It also shows that women are basically worse at negotiating than men (\"less successful\" = euphemism for being worse at).*\n      * [*Source 46.*](https://pubsonline.informs.org/doi/abs/10.1287/mnsc.2014.1994) *Women are only as likely as men to ask for a raise when they are explicitly told they can negotiate for one. I can tell you right now that most jobs rarely ever directly tell its employees that they can freely ask for a raise lol.*\n      * [*Source 47.*](https://escholarship.org/content/qt9978v172/qt9978v172.pdf?t=omys3w) *Women are less comfortable engaging in salary negotiations, they're less likely to negotiate salaries overall, and they're not as good at it as men (the researchers don't word this last point this way because it angers feminists, but that's the gist of it). There are many other reasons that they go into as well.*\n20. **Men are typically more aggressive/competitive in their mindset and attitudes regarding work** which helps them climb the corporate ladder more (e.g. you make more off commission in sales because you close more sales due to being more competitive).\n      * [*Source 48.*](https://archive.bio.org/sites/default/files/docs/toolkit/Why%20Men%20Still%20Get%20More%20Promotions%20than%20Women_HBR%20article.pdf) *Upon reading this, you find that women are essentially not as willing to do what it takes to climb the corporate ladder; the report says that therefore the entire civilizational structure should change to favor women, but that's just ridiculous. Why not just admit that women are not as willing to hyperfocus on their careers in the same way as men? Why not just admit that women don't do it because they simply don't want to sacrifice other areas of their life for a career? Why not just finally admit that women are different from men? They can't. And that's a problem for BOTH genders.*\n21. **The top people are always going to be men due to the variability hypothesis.**\n      * [*Source 49.*](https://www.journals.uchicago.edu/doi/abs/10.1086/493921) *Men vary greater than women; when seeing any of the extremes, men are more likely to be represented on both ends. That means the most successful people in the world are going to overwhelmingly be men, and the most unsuccessful dregs of society will also be men. This represents a problem with feminist thinking because they want \"equality\" when it comes to powerful, important, and successful positions in society and say that a lack thereof in these top positions are due to sexism and discrimination (and that therefore all of men and society need to just give women these positions to \"make it fair\"), but they will never talk about the men at the lowest ends of society or talk about equalizing that. I'm not saying they should become homeless criminals and whatnot either (rather they should focus on decreasing the amount of men that are disenfranchised here; but they'll never do that since they would have to admit that men aren't oppressors and would have to actually acknowledge the plights of men), I'm just saying there's a double standard here whereby women want the rights and privileges of both sexes with the responsibilities of neither, all the while blaming men for any (and all) of their own shortcomings and faults.*\n      * [*Source 50.*](https://www.sciencedirect.com/science/article/abs/pii/S0191886913003036) *Men vary more than women yet also tend to be better on average on measures of creativity.*\n      * [*Source 51.*](https://en.wikipedia.org/wiki/Variability_hypothesis#:~:text=The%20variability%20hypothesis%2C%20also%20known,most%20traits%20than%20females%20do.) *For those who still don't get it, here's a Wikipedia article since they tend to describe things fairly simply and succinctly.*\n\nJust to really drive home the point, I quote the official statement of the US Department of Labor after having a massive [study](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) conducted for them:\n\n>**This study leads to the unambiguous conclusion that the differences in the compensation of men and women are the result of a multitude of factors and that the raw wage gap should not be used as the basis to justify corrective action. Indeed, there may be nothing to correct. The differences in raw wages may be almost entirely the result of the individual choices being made by both male and female workers.**\n\nAnd even ignoring the technical research aspects, just think about it like this: If a woman were to do the same job as a man for less pay, only women would get hired because that would be CHEAP LABOR. And for those who don't know, there's a whole sexism argument that claims men get hired more easily than men (which also isn't necessarily true either, but that's a separate discussion).\n\nThere isn't a single statistician who isn't braindead, let alone competent, who takes the statistics presented about the gender pay gap myth at face value when drawing conclusions. It's only after you account for all the variables available can you really begin to extrapolate true causality, and even then it is still weak with these types of statistical analyses anyway since it's virtually impossible to account for every variable that exists *and* have a full consensus for data rather than a statistic that has a much smaller sample size. Plus, when it comes to statistical analyses like this, you're ultimately seeing how things relate to one another (i.e. correlated) rather than seeing how they directly influence/cause something. The only way to truly test for causality is by running actual experiments with strong controls in place (which is nigh on impossible to do in situations like these). If you take a statistics class or two, you'll learn about this stuff more in-depth. Multivariate analyses are pretty much always better than univariate ones (when drawing final conclusions from, anyway), and it's due to reasons like this where society perpetuates the gender pay gap myth as a social dogma.\n\nIf women can do anything men can do (and \"do it better\"), then why are they still supposedly \"oppressed\"? Why are they still the victims? And why do they need government legislation to mandate \"gender equality\" in order to achieve it? If they were really the same as men (i.e. \"equal\") in all these regards, wouldn't perfect equality naturally occur based on merit alone? It doesn't make sense, and it's simply because it's just not true. Men and women aren't the same, and we won't ever be the same. That doesn't mean we shouldn't be treated fairly—equity over equality, always—but this myth needs to die once and for all.\n\n﷽\n\nوَلَا تَتَمَنَّوْا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِّلرِّجَالِ نَصِيبٌ مِّمَّا ٱكْتَسَبُوا۟ ۖ وَلِلنِّسَآءِ نَصِيبٌ مِّمَّا ٱكْتَسَبْنَ ۚ وَسْـَٔلُوا۟ ٱللَّهَ مِن فَضْلِهِۦٓ ۗ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا",
    "title": "Debunking the \"Gender Pay Gap\"",
    "subreddit": "MensRights",
    "timestamp": 1688347611,
    "score": 194,
    "keyword": "european judge"
  },
  {
    "text": "EUROSTAT data disproves the narrative of lazy men and brave women suffering \"second shifts\" I spent couple days digging deep into the Eurostat data to bring you this post.\n\n# The narrative\n\n[Wikipedia's page on Double Burden](https://en.wikipedia.org/wiki/Double_burden) (Part of a series on Feminism) writes:\n\n>\\[...\\] in couples where both partners have paid jobs, women often spend significantly more time than men on household chores and caring work, such as childrearing or caring for sick family members.\n\n&#x200B;\n\n[The Conversation](https://theconversation.com/men-do-see-the-mess-they-just-arent-judged-for-it-the-way-women-are-118728), priding itself by \"Academic rigour, journalistic flair\" writes:\n\n>Naturally, the more time spent on chores, the less a woman has to spend on other activities like sleep, work, and leisure.\n\n(Linking to a study that does not even measure differences between men and women.)\n\n&#x200B;\n\nThe European Institute for Gender Equality wrote in it's [2022 Gender Equality Index report](https://eige.europa.eu/sites/default/files/documents/gender_equality_index_2022_corr.pdf):\n\n>Women’s disproportionate burden of unpaid care work hinders their engagement in paid work.  \n>  \n>\\[...\\]  \n>  \n>Men with disabilities are more engaged in household care than men without disabilities.\n\n# Paid and unpaid work\n\nBefore we continue, let me tell you more about the data I am going to use. Our friend Eurostat runs **Harmonised European time use surveys** (HETUS), which divides human life into hundreds of distinct activities, including sleeping, eating, dishwashing commuting to work etc. ([see HETUS 2008 guidelines \\[1\\] page 159](https://ec.europa.eu/eurostat/ramon/statmanuals/files/KS-RA-08-014-EN.pdf)). The last survey took place back in 2010, which isn't too bad, and the data is available for 17 EU countries plus Turkey. Unfortunately, out of hundreds of distinct activities only 56 high level aggregate categories are publicly available. To get access to the complete \"microdata\" I would have to be a registered research institution.\n\nBut that is not a bad start. Our first step will be the dataset **Time spent in total work (paid and unpaid) by sex** \\[2\\]. Bit annoyingly the labels \"paid work\" and \"unpaid work\" are not among the 56 known categories but the helpful online support staff at Eurostat provided an answer. Paid work is everything in the **100 Employment** category, including travel to work, preparations and even lunch break. The unpaid work is everything in the **200 Household and Family Care** category, including laundry, shopping, food preparation, child care, help to an adult family member, gardening, construction and repair etc. Added to that is **410 Organisational work** (all kinds of volunteering) and **420 Informal help to other household**, which includes for instance **423 Care of own children living in another household**, which is basically fathers spending time with their own children that live with their mother. In any case, the contribution of 410 and 420 to overall unpaid work is very small and somewhat quite similar for both men and women.\n\nTwo more notes: First, people often do more than one thing at a time and there are several ways to capture this, but we will be looking at so called \"time spent in main activity\" variable which always adds up to 24 hours for every day.\n\nSecond, all the numbers are self-reported, full of strange quirks, possibly statistical artefacts - that does not mean they are unreliable, just don't stake you life on them.\n\n# Women do more unpaid work ...\n\nThe first thing to notice is that while there are huge differences between the HETUS countries there is no \"EU average\" - because the HETUS data is for 17 EU countries only. But this makes reasoning about the data difficult. For instance, in **Netherland,** men spend 18 minutes more every day in paid and unpaid work that women (M 5:55 vs F 5:37) - a stark opposite to **Greece** where women work on average 87 minutes longer (M 4:54 vs F 6:21).\n\nWithout the \"microdata\", it does not make much sense to just average the HETUS countries - Germany's population is some 60-times bigger than Estonia's. But because I don't have any other option I am going to do exactly that. Just remember: these are averages for countries, the averages for populations in those countries would be slightly different.\n\nWithout further ado: across 18 European countries, **women do almost twice as much unpaid work as men.**\n\n`Time spent in total work (paid and unpaid work as main activity) by sex`\n\n||*Paid work*|*Unpaid work*|*Total work*|\n|:-|:-|:-|:-|\n|*Men*|3:21:17|2:12:47|5:33:04|\n|*Women*|2:00:47|4:11:43|6:12:30|\n|***Dif***|**1:20:30**|**-1:58:57**|**-0:38:27**|\n\n[https://ec.europa.eu/eurostat/databrowser/bookmark/3f3773fd-bd3a-4d14-83b3-cf70445602da?lang=en](https://ec.europa.eu/eurostat/databrowser/bookmark/3f3773fd-bd3a-4d14-83b3-cf70445602da?lang=en)\n\n# ..but that is not the whole picture\n\nAs expected, men do significantly more paid work. But in total, **women work 38 minutes more than men**. Out of the average 6 hours and 40 minutes of work every day that is a small but not insignificant 10% difference.\n\nWhy do men do more paid work and women do more unpaid work? Could the answer be that husbands go to work while wives take care of children and home? Maybe. And isn't comparing paid and unpaid work something like counting apples and oranges? Certainly.\n\nBut let's look at something else. When after the age of 65 the paid work almost disappears for both men and women, men start to do almost one hour of unpaid work more. Does it mean the total work gap shrinks? No, the opposite happens, women's unpaid work is also up 20 minutes and in the end the total gap almost doubles to an average of 70 minutes more total work for women after 65.\n\n`Time spent in the main activity by sex, 65 years and over`\n\n||*Paid work*|*Unpaid work*|*Total work*|\n|:-|:-|:-|:-|\n|*Men 65+*|0:25:57|3:05:57|3:31:04|\n|*Women 65+*|0:09:40|4:32:03|4:41:43|\n|*Dif 65+*|0:16:17|\\-1:26:07|**-1:09:50**|\n\n[https://ec.europa.eu/eurostat/databrowser/bookmark/9ae399fa-80c1-4b90-aef9-fd9c80f29b7e?lang=en](https://ec.europa.eu/eurostat/databrowser/bookmark/9ae399fa-80c1-4b90-aef9-fd9c80f29b7e?lang=en)\n\nAt this point you have probably guessed the corollary: if the gap after 65+ is twice as big as the total, that means **the gap for employment-age men and women must be smaller than those 38 minutes.** Unfortunately the other age categories can not be simply counted together to get the results for working and and the \"microdata\" is not available to an amateur sociologist like me.\n\nBut there is more. Much more. Eurostat also splits the HATUS data by sex and household composition and this data offers shocking insight that is totally missing form the public discourse: When men and women are left to their own preferences, women choose to do more shopping, more cleaning, more food preparation, more laundry - more unpaid work in general than men. Single men and even single dads choose to spend more time doing paid work compared to single women and single mothers.\n\n`Person less than 45 years old, in another household arrangement with no children younger than 18 years old`\n\n||*Paid work*|*Unpaid work*|*Total work*|\n|:-|:-|:-|:-|\n|*Single men*|4:11:36|1:36:16|5:47:52|\n|*Single women*|3:40:00|2:14:44|5:54:44|\n|***Dif***|**0:31:36**|**-0:38:28**|**-0:06:52**|\n\n[https://ec.europa.eu/eurostat/databrowser/bookmark/8b6bfa4d-c6f9-48ef-9225-11028a9aaaaa?lang=en](https://ec.europa.eu/eurostat/databrowser/bookmark/8b6bfa4d-c6f9-48ef-9225-11028a9aaaaa?lang=en)\n\nNote, \"in another household arrangement\" means the person is not in a couple and not living with their parents. \n\nPossible contribution of taking care of sick or elderly parent or relative living in different household is hidden under the **420 Informal help to other household** category. Single men contribute on average 3 minutes more than single women. \n\nCompared to single men, single women spend on average 5 minutes more **shopping**, 7 minutes more **caring for pets** including walking dogs and 12 minutes more **preparing food**.\n\n&#x200B;\n\n`Single parent with youngest child less than 18 years old`\n\n||*Paid work*|*Unpaid work*|*Total work*|\n|:-|:-|:-|:-|\n|*Single dads*|4:00:44|3:07:00|7:07:44|\n|*Single moms*|3:06:24|4:41:56|7:48:20|\n|***Dif***|**0:54:20**|**-1:34:56**|**-0:40:36**|\n\n[https://ec.europa.eu/eurostat/databrowser/bookmark/30953c88-7690-4156-a30e-b2904b96c761?lang=en](https://ec.europa.eu/eurostat/databrowser/bookmark/30953c88-7690-4156-a30e-b2904b96c761?lang=en)\n\nNote, the situation of single dads and single moms can differ significantly, for instance by the number of children or number of very young children.\n\n# The conclusion\n\nThe HETUS data indicates that **large part of the unpaid-work gap is explained simply by men's and women's personal preferences**. Large part is also explained by men spending more time in paid work, fulfilling their bread winning gender stereotype/role.\n\nBut in order to reach more definitive conclusion we need access to the underlying \"microdata\". We need the left-leaning, woke academia - that we all pay from our taxes - to start doing their jobs and produce truthful and unbiased research, even if it contradicts the ubiquitous anti-male narrative.",
    "title": "EUROSTAT data disproves the narrative of lazy men and brave women suffering \"second shifts\"",
    "subreddit": "MensRights",
    "timestamp": 1680978763,
    "score": 190,
    "keyword": "european judge"
  },
  {
    "text": "OECD's Social Institutions & Gender Index is the ultimate victim index This post was [first published](https://www.reddit.com/r/SystemicSexism/comments/13hm63s/oecds_social_institutions_gender_index_is_the/) on [r/SystemicSexism](https://www.reddit.com/r/SystemicSexism/). Join the sub for a balanced and hate-free discussion about systemic sexism.\n\n\\--------------\n\nLast time we discussed how [UN's Gender Inequality Index does not measure gender inequality](https://www.reddit.com/r/SystemicSexism/comments/10s0w24/uns_gender_inequality_index_does_not_measure/). Today we will take a look at OECD's ultimate victim index.\n\n# Gender is only women\n\nWhen looking at an \"equality\" index, the first thing to ask is **what** the author say the index measures. In the case of the Social Institutions & Gender Index (**SIGI**) it is:\n\n>The Social Institutions and Gender Index (SIGI) measures **discrimination against women** in social institutions across 179 countries.\n\n[https://www.oecd.org/stories/gender/social-norms-and-gender-discrimination/sigi](https://www.oecd.org/stories/gender/social-norms-and-gender-discrimination/sigi)\n\nWe can immediately make two important observations:\n\n1. Despite being named \"Gender Index\" **SIGI only measures one gender - women**. There is nothing inherently wrong with having an index that focuses on a single gander, if you do not pretend otherwise and if you also have an index for the other gender. SIGI fails at both.\n2. While the authors say the index measures **discrimination**, elsewhere they will say it measures **inequality**. Maybe the authors don't understand the difference, maybe they just do not care, but as we will see later the index measures neither. What it actually measures is an arbitrary set of variables whose only criterion for inclusion in the index seems to be the ability to paint women as victims.\n\nThe second question to ask is **how** the index measures what it says it measures - in this case discrimination against women in social institutions. The answer is far from straightforward:\n\n* OECD has something called Gender, Institutions and Development Database (**GID-DB**). Like with SIGI, this \"gender database\" is focused on the female gender. It contains male-related data only when the comparison with female data makes women look sufficiently oppressed.\n* This GID-DB collects some 40 variables from 180 countries, but not all variables are available for all 180 countries.\n* 27 of these GID-DB variables are consistently available for 120 countries. Only these 27 variables are used to calculate the SIGI. Conversely, SIGI is calculated only for those 120 countries.\n* Despite only 27 variables being used to calculate SIGI, all 40 variables are usually presented along the SIGI: on the SIGI website, on \"datasheets\" etc. Very little or no information is given on whether given variable contributes to SIGI or not.\n\nThe actual SIGI is then calculated as follows:\n\n1. 27 variables are aggregated into 16 indicators.\n2. 16 indicators are aggregated into 4 dimensions.\n3. 4 dimensions are aggregated into the SIGI index.\n4. The value of each indicator, dimension and even the SIGI ranges **from 0 to 100**, where 0 means no discrimination and 100 means absolute discrimination.\n\n[See page 15 of this PDF](https://www.oecd-ilibrary.org/docserver/022d5e7b-en.pdf?expires=1683061973&id=id&accname=guest&checksum=22BA6087D874163578322AA15EA09E47).\n\nNow, let's take a closer look at some of these variables and consider what is actually being measured:\n\n# Dimension 1: Discrimination in the Family\n\nI was surprised to see that Germany discriminates against women in the family with a score of  7.8 discrimination points. This is because of child marriage.\n\n&#x200B;\n\n**Variable: Prevalence of girl child marriage**\n\nThis variable measures the prevalence of child marriage among girls (but not among boys). Strangely, the data is for 15-19, meaning 19 years old women are considered children unable to make their own decisions. In Germany's case, the value is 0.3% and the score for this indicator is 0.\n\n&#x200B;\n\n**Variable: Laws on child marriage**\n\nGermany is penalised with 50 discrimination points for laws on child marriage, because according to SIGI, when child marriage laws are the same for women and men, women are discriminated:\n\n>50: Child marriage is illegal for both women and men. However, legal exceptions exist for some groups of women or with the consent of certain persons (e.g. parents, legal guardians or judge).\n\nNow, I don't dismiss this out of hand. In countries where women are legally discriminated and socially oppressed it makes perfect sense that \"equal\" law on child marriage has \"unequal\" consequences. What is more, with the single exception of Guyana child marriage is by far more prevalent among girls than boys, so yes, girls are more affected. But in the case of Germany, where child marriage is practically non existent, the 50 point penalty is out of place.\n\n&#x200B;\n\n**Variable: Laws on household responsibilities**\n\nDenmark is penalised with 75 discrimination points for Laws on household responsibilities. What are these?\n\n>75: Women do not have the same legal rights as men to be either “head of household\"\" or “head of family\"\" or to be legal guardians of their children during marriage or in informal unions.\n\nSo, what legal rights Danish man have that Danish women don't? The SIGI will not provide any details and simply ask you to take their word for it. As we will see, this is the norm whenever SIGI interprets legal norms. But it gets worse. Googling revealed this [datasheet from the 2019 version of SIGI](https://www.genderindex.org/wp-content/uploads/files/datasheets/2019/DK.pdf), where Denmark received \"only\" 50 discrimination points with the following explanation:\n\n>Danish law establishes that spouses shall give one another their support and demands that they jointly safeguard the interests of the family (Denmark, 1992). However, it does not stipulate any provision concerning the head of household. As per the Act of Parental Responsibility, parents have joint custody of their children regardless of their marital status and enjoy equal parental authority (Denmark, 2007).\n\nDoes OECD consider joint parental custody as discrimination against women?\n\n&#x200B;\n\n**Variable: Attitude towards housewives**\n\nSweden is penalised with 42 discrimination points for Attitude towards housewives. This is measured as percentage of population thinking that “**being a housewife is just as fulfilling as working for pay**”. Yes, this is the discrimination that SIGI measures.\n\n&#x200B;\n\n**Variable: Women and men’s share of unpaid care work responsibility**\n\nUnsurprisingly, this variable interprets the fact that women do more unpaid work than men as discrimination, ignoring the fact that single childless women **choose** to do more housework that  single childless men. I have explained why interpreting unpaid work gap as discrimination is a nonsense in [EUROSTAT data disproves the narrative of lazy men and brave women suffering \"second shifts\"](https://www.reddit.com/r/MensRights/comments/12fudwf/eurostat_data_disproves_the_narrative_of_lazy_men/).\n\n&#x200B;\n\n**Variable: Laws on divorce**\n\n**Variable: Laws on inheritance**\n\nGreece is penalised with 50 discrimination points for laws on divorce and 50 discrimination points for laws on inheritance. The [2019 SIGI datasheet](https://www.genderindex.org/wp-content/uploads/files/datasheets/2019/GR.pdf) hints that the problem may be the practice of Sharia law by Greece's Muslim population. However, [the Sharia law was repelled in 2018](https://www.euronews.com/2018/01/10/greece-no-longer-requires-muslims-to-use-sharia-law) after Greece lost to European Court of Human Rights. Why was Greece penalised in 2023? OECD does not provide any answer.\n\n&#x200B;\n\n# Dimension 2: Restricted physical integrity\n\n**Variable: Laws on violence against women**\n\nMost western democracies receive 25 or 50 discrimination points for their laws on honour crimes, intimate partner violence, rape and sexual harassment not being fully comprehensive. But as usual OECD does not provide any specific information on what is problematic with these laws.\n\n&#x200B;\n\n**Variable: Attitude towards domestic violence**\n\nThe USA and Switzerland are penalised with 14 discrimination points, some of the highest score among western democracies. This variable is measured as percentage of **women** aged 15 to 49 years who **\"consider a husband to be justified in hitting or beating his wife under certain circumstances**”. Note that OECD says that women are discriminated not when they are hit or beaten by husband, but when other women think such act may be justified.\n\n&#x200B;\n\n**Variable: Prevalence of intimate-partner violence**\n\nWhile the actual data measures only IPV experienced by women the name of the variable suggests that IPV is automatically only affecting women. In fact, [studies show](https://en.wikipedia.org/wiki/Intimate_partner_violence#By_gender) that up to half of all victims are men and most IPV is mutual, with women possibly initiating more IPV than men. Without taking these factors into consideration, simple prevalence of IPV is not a good measure of anything.\n\n&#x200B;\n\n**Variable: Laws on female genital mutilation**\n\nCountries like Czechia and Poland are penalised with 50 discrimination points for lacking laws that criminalise FGM on narrow grounds even if wider laws exist and FGM practice is non existent. This is the same number of points that Guinea-Bissau received for 52% of women being victims of FGM.\n\n&#x200B;\n\n**Variable: Prevalence of female genital mutilation**\n\nAll types of FGM are without a doubt abhorrent, but not all types of FGM are equal. In fact, most cases of FGM are comparable to, or less harmful than involuntary circumcision of boys. But SIGI bundles all types of FGM together, and of course, does not pay any attention to male circumcision.\n\n&#x200B;\n\n**Variable: Laws on reproductive autonomy**\n\nWhat OECD means by reproductive autonomy is actually only measured by access to legal abortion. While I fully support legal abortion, I likewise support men's rights to paper abortion. But consider this sentence form the authors of SIGI:\n\n>Some variables, such as female genital mutilation or reproductive autonomy, measure absolute levels of women’s deprivation **and do not have a male counterpart**.\n\n&#x200B;\n\n**Variable: Access to family planning**\n\nSpain got 3 times more discrimination points than Iran (13 vs 4) for Access to family planning. This is measured as \"percentage of currently married or in-union women of reproductive age (15-49) who want to cease or delay childbearing but are not using any method of contraception\". That makes me wonder, who is discriminating Spanish women and preventing them from using any contraception?\n\n&#x200B;\n\n# Dimension 3: Restricted access to productive and financial resources\n\n**Variable: Gender gap in ownership of land**\n\nMeasured as share of men and women among the total number of persons who own land. I find this variable very arbitrary, as the absolute majority of men and women do not own any land.\n\n&#x200B;\n\n**Variable: Gender gap in ownership of a house**\n\nThis data is only measured for 3rd world countries. Which is a pity, because for instance in the US, single women buy 70% more houses than single men ([Celebrating the Single Women Home Buyers](https://www.nar.realtor/blogs/economists-outlook/celebrating-the-single-women-home-buyers-for-galentines-day)). Why is this data not available for western democracies?\n\n&#x200B;\n\n**Variable: Laws on workplace rights**\n\nWhile on paper this variable measures \"Whether women and men have the same legal rights and opportunities in the workplace\", when applied by SIGI, it only guards for female disadvantages. Male disadvantages, including lack of paternity leave or gender quotas and regulations discriminating against men are ignored.\n\n&#x200B;\n\n# Dimension 4: Restricted civil liberties\n\n**Variable: Laws on political voice**\n\nDespite having equal political rights for men and women, most democratic countries are penalised with 50 discrimination points for Laws on political voice. How do they discriminate women? By not having \"special measures\" to promote women:\n\n>50: Women and men have the same rights to vote and to hold public and political office in the legislature and executive branches. However, there are no constitutional/legislated quotas or special measures other than quotas \\[...\\] in place to promote women's political participation at the national or local levels.\n\n&#x200B;\n\n**Variable: Women's political representation**\n\nAs usual, lack of women's participation in politics is interpreted as discrimination against women.\n\n&#x200B;\n\n**Variable: Gender gap in safety feeling**\n\nFinland is penalised with 94 discrimination points for \"Share of men and women among the total number of persons who declare not feeling safe walking alone at night in the city or area where they live\". 26% of Finish women and only 2% of men do not feel safe. Despite the fact that by far the most victims of crimes on the streets at night are men. What this variable really says is that women are discriminated when male gender role primes men to accept their disposability.\n\n&#x200B;\n\n**Variable: Gender gap in confidence in the judicial system**\n\nDespite men in the US being twice as likely to be sentenced to jail after conviction than women and receiving on average 63% longer jail sentences for the same crime ([source](https://repository.law.umich.edu/cgi/viewcontent.cgi?article=1164&context=law_econ_current)), men have only slightly lower confidence in the judicial system than women (44% vs 49%). In case of SIGI, men being more affected than women results in 0 discrimination points.\n\n&#x200B;\n\n# Summary\n\nThe OECDs Social Institutions and Gender Index (SIGI) neither measures gender equality nor discrimination against women. It measures our society's obsessive need to present women as victims and only focus on women's issues while doggedly ignoring male issues.\n\nTo quote u/TheTinMenBlog: **Choosing how we measure equality is a privilege on its own.**\n\n&#x200B;\n\n**EDIT**: Thanks for the GOLD, kind stranger!",
    "title": "OECD's Social Institutions & Gender Index is the ultimate victim index",
    "subreddit": "MensRights",
    "timestamp": 1684141398,
    "score": 150,
    "keyword": "european judge"
  },
  {
    "text": "Childless men are actually more stigmatized than childless women, especially in egalitarian countries, study shows You know how feminists think that only childless women can be stigmatized? Well, a lot of evidence shows people actually can stigmatize childless men, perhaps even more. The evidence on which one is more stigmatized could vary in each statistic we look at though:\n\n[As you can see here: in less progressive countries, there's no double standard, but in \\\\\"egalitarian\\\\\" countries, there is a double standard favoring women.](https://preview.redd.it/h2xxr9a1mmfb1.png?width=639&format=png&auto=webp&s=aa2d8c4ea3a3430f6b06ead042cbe5edf57ed41f)\n\n[Men and women were slightly harsher towards childless men in egalitarian countries. They both were equally harsh towards male targets but women were lenient more than men towards childless women, but men still viewed childless women more leniently than childless men.](https://preview.redd.it/d24qe9e8mmfb1.png?width=909&format=png&auto=webp&s=7fdcdc613f51c5532a2181b86709927e1fe95346)\n\nAs you can see here, childlessness is more stigmatized in traditional European countries more, but even there, they have a single standard, and women judge them slightly harsher than men judge them. Apparently though, people think only childless women are stigmatized.\n\n[Source here](http://www.harryganzeboom.nl/Teaching/TEO/Readings/Rijken,%20Merz%20-%202014%20-%20Norms%20on%20Voluntary%20Chlldlessness.pdf?fbclid=IwAR0z9ZtvkFsw6ILzl1Rdin5XWgNDB6pH_GhTjLsDuXdHcCFJezGOP4NjgZE)",
    "title": "Childless men are actually more stigmatized than childless women, especially in egalitarian countries, study shows",
    "subreddit": "MensRights",
    "timestamp": 1690992258,
    "score": 110,
    "keyword": "european judge"
  },
  {
    "text": "Double standards in IFV treatment: once the egg is fertilised, the woman can withdraw her consent to become a parent but the man cannot. And yes, the man will pay child support. English law stipulates that both parties (man and woman) can withdraw consent to continue in a fertility treatment if fertilised egg exists but has not been implanted.\n\nIn 2008, the European Court of Human Rights (ECtHR) confirmed that the English law does not infringe on the human rights of the parent that wishes to continue with the treatment.\n\nHowever, this only means that man has the right to withdraw his consent if the local law allows it. Consider this one sided commentary from the [this legal article](https://academic.oup.com/icon/article/6/2/317/737023):\n\n>\\[...\\] Italian legislation provides that *neither* party may revoke consent to treatment once the egg has been fertilized; in effect, as soon as the embryo comes into being, both gamete donors are committed to its potential future. In theory, a **woman** could be coerced into having the fertilized egg implanted in her against her wishes, subject only to the limited circumstances provided for by abortion law. These provisions have attracted fierce criticism, as undermining choice and elevating the rights of the fetus above those of the **woman**.\n\nAnd while nobody ever coerced an Italian woman to have an egg implanted against her wishes, there are sever examples of Italian men being coerced to become fathers, with all the legal and financial consequences.\n\n[https://www.reddit.com/r/SystemicSexism/comments/15jqj3p/italian\\_men\\_cannot\\_withdraw\\_consent\\_for\\_ivf\\_and/](https://www.reddit.com/r/SystemicSexism/comments/15jqj3p/italian_men_cannot_withdraw_consent_for_ivf_and/)\n\nMen in Austria, and Estonia, Hungary and in Spain seem to be in a very similar situation. And for instance in Germany, the man can withdraw his consent, but he will be legally and financially responsible for the child if the woman, for instance, fakes his signature: \n\n[https://www.reddit.com/r/SystemicSexism/comments/15jq6mu/germany\\_exhusband\\_is\\_ordered\\_to\\_pay\\_child\\_support/](https://www.reddit.com/r/SystemicSexism/comments/15jq6mu/germany_exhusband_is_ordered_to_pay_child_support/)\n\nBut I think the state of Israel wins the hypocrisy contest with this ruling:\n\n>The majority judges in the additional hearing treated the right not to be a parent as a right of less value than the right to be a parent.\n\n[https://www.reddit.com/r/SystemicSexism/comments/15jxtym/in\\_israel\\_womans\\_right\\_to\\_be\\_a\\_parent\\_trumps\\_mans/](https://www.reddit.com/r/SystemicSexism/comments/15jxtym/in_israel_womans_right_to_be_a_parent_trumps_mans/)\n\nMind you, abortion is legal in all above mentioned countries and the man has zero say in whether the women will continue the pregnancy or not. \n\n&#x200B;",
    "title": "Double standards in IFV treatment: once the egg is fertilised, the woman can withdraw her consent to become a parent but the man cannot. And yes, the man will pay child support.",
    "subreddit": "MensRights",
    "timestamp": 1691359900,
    "score": 77,
    "keyword": "european judge"
  },
  {
    "text": "If you thought that US and Canadian family courts were sick wait until you see what EU have setup for you EU has really outdone anything that you could possibly imagine when it comes to divorces and European courts so be careful if you move around and stay in different European countries. Basically, you can be dragged to court for a divorce in another country and fleeced by judges and lawyers and have your life destroyed while they break any of the EU laws that gives them the jurisdiction and it is nothing you can do about it. \n\nThe court will railroad you, take your children away, make you a slave for life and have you to pay for the splendid judge decision despite that you did not ask for his involvement in your family affairs. After Spending some 20-25K USD on these lowlifes I did an Elon (Musk) and said F\\* You and tried to solve this myself by approaching EU courts and have them to set things right. That was a great mistake as these people have as much accountability for their laws as the original local courts. You have it all here:\n\n[https://illusionoflaw.wordpress.com/5-eus-kafka-setup-a-rigged-legal-system/](https://illusionoflaw.wordpress.com/5-eus-kafka-setup-a-rigged-legal-system/)\n\nand if you have time you can read each of the attempts in detail in the writings to these so-called courts. As authorities in all EU countries have to enforce the decisions made by any other EU country the setup is complete and, in the end, I had to leave my children behind and move out of Europe. What a nice little EU system we have setup, Kafka would be proud…..",
    "title": "If you thought that US and Canadian family courts were sick wait until you see what EU have setup for you",
    "subreddit": "MensRights",
    "timestamp": 1701426908,
    "score": 79,
    "keyword": "european judge"
  },
  {
    "text": "Poland violated female judges rights by making them retire earlier than men, rules European court",
    "title": "Poland violated female judges rights by making them retire earlier than men, rules European court",
    "subreddit": "Feminism",
    "timestamp": 1698246370,
    "score": 76,
    "keyword": "european judge"
  }
]