[
  {
    "text": "Dinner with the director - an opportunity to increase my promotion chances? Hey guys!\n\nMy career started rushing in some direction finally and I am facing some things for the first time. I believe I was doing good so far but the next one feels like a boss encounter. \n\nSome background:\nI am a member of a small support team, helping sales team digging out some documents that they need. I know how to do lot of things related to my job and I feel really good organizing stuff around to optimize what I do (i love Factorio) and I like to help people around as much as I can. Some time ago I had a meeting with my supervisor, during which we agreed to utilize my way of being, and also allow me to get some leadership experience by supervising any bigger / bulk projects that would require solving more than a single request. Now, every bulk requests lands first in my teams / mailbox to talk through the details like what exactly is needed from us, what is the deadline etc.. (since I had no prior management experience, this is more like a \"field training\" for me, which does not go with a position change). I have a few successful projects behind me, triggering some good words being spread around our management.\n\nOur company merged with another one, changing lot of things around and, of course, causing some controlled chaos that needs to be dealt with. You guessed it right - it is pumping up the amount of requests sent to the support team I work with, and to the level that might require hiring additional people. Additionally, the workflow will not go down because of a bigger number of customers. I know that thanks to my supervisor that told me about that and also warned about an incoming evaluation that our new owner company is running through all the branches. Since this has not been mentioned officially, this makes me feel kind of important part of the team that is \"included into the inner circle where extra info goes around\".\n\nThe point:\nOur European sales director invited us (our small support team and the sales team) to a dinner in some fancy restaurant. There will be all my direct and indirect supervisors and It all seems like finally coming together: the projects I supervised with a good result, the good words about me that reached them, rising demand for our support team, my resume having bunch of leadership trainings. There will not be a better moment for me to show myself as a good person as a solution to increasing workflow going through our team. \n\nThe boss stage:\nI am going to be in such meeting for the first time and I am worried that I might get overwhelmed and waste the opportunity. What Is good to do / not to do? It is a good chance to show myself but I don't want to appear...perhaps desperate?",
    "title": "Dinner with the director - an opportunity to increase my promotion chances?",
    "subreddit": "jobs",
    "timestamp": 1700725051,
    "score": 4,
    "keyword": "european director"
  },
  {
    "text": "Mechanical engineer, quit my dream job yesterday, got in a verbal fight with my boss, just want an opinion what you would do in that situation Hello everybody,  \n\n\nso three months ago I quit my student job where I had secured position for something what is my perfect job, working with renewable energy, solar panels etc.  \n\n\nWork should have been part time in my domestic country - part time in country 2000 km distanced, in a place not so accessible. Since I was still a student, I was also surprised they gave me a position (found it on linkedin, 66 applicants) because I worked before in auto industry and this was specificaly something related to thermodynamics which I knew but the job was to supervise one big project of one plant which should be done to the end of 2023. Something what I have never done but I told that I want to work here. Salary great, 1750 eur net with bonuses if that project ends well. In total, after one year I would get around 36 000 eur. I could have only dream about that. They even gave me a paid day if I was absent because of exams (3 days but I stayed almost everyday 30 minutes longer to level those hours).  \n\n\nStrange thing (which later ended even stranger) was that the boss has multiple companies assigned on his name but not many of those companies have some websites. They didn't even checked my english (although it is 3.5 out of 5) and I saw that they are in a hurry with all that.  \n\n\nAccepted the job, started to work after two-three weeks and same day I came, new secretary also started to work. First day we went to one event where they were one of main sponsors. From the beginning the story behind the company was a bit strange because they didn't have their own product, they were working with multiple partners. Basically, they had connections for everything.  \n\n\nThey told us they will be in office often but at the end, on average, only secretary and I were in the office (I know that's not too bad but let's avoid what everybody can think of now). They were in the office maybe once a week and every time they are in a hurry and they have maybe 20 minutes in that once a week for us. OK, they answered to the phone but I dodn't have anybody to teach me all those things about huge plant. They just gave me the papers but ok, I'm learned to teach alone although I hate that.  \n\n\nTime was passing and I saw that the project for which I'm assigned for is not even close to finished. I was told it is close to 90 % but honestly it is maybe 30-40 % and we need to be done in 6 months. If we are not done in 6 months, another company which wrote a tender for that project won't get european money for that. EU finance almost 50 % of that. Too less man were assigned for this job at the beginning, they forgot one highly important part when they made an official offer, they have verbal misunderstanding with almost every company they want to order some parts, technical documentation for most of the parts does not exist etc. I was writing project books, preparing some documents, and I got an ''order'' just to copy all the drawings we got from companies from which we buy some technologies and to past those drawings into one sheet which has our informations. So shortly, we are designers and producers. I'm pretty sure that's not how it should be done but ok.  \n\n\nThat project in that country is led by director's younger brother who is not even close educated and experienced to be in charge for this.   \n\n\nAfter some time I got one project to do with solar panels. Firstly I was doing that with younger brother and I found a company which can give us equipment and which can assemble everything because we basically don't do anything for that. I was just finding a company who can actually do this. Younger brother told me that we also have some apartments where those guys can sleep. Main client wanted everything to be done by the end of June. Found a company in few days, agreed everything, younger brother checked everything, everything was fine and we needed to pay 10 % before project for equipment. With that money the company would bring the equippment and they would finish the job exactly on 29.6. Those 10 % were like 2000 euros. Younger brother told me that they can pay it tomorrow, I told that to guys from that company we should have worked and they needed the money day after if we wanted job to be done at the end of that week. Everything seemed right. Day after, older brother (boss) told me we can't pay that, that we will send them a document that we agree to take the equipment. After two days, that job failed because my boss wanted to see them firstly, to have a conversation with them, to talk about other project and they needed money quickly because they had some other jobs arranged for next weeks. Maybe they would tricked us, but they were really cooperative and my boss had planty of time before official offer to arrange a meeting and to see them in person.  \n\n\nSomehow I managed to keep final client with us, found a new company, we had a meeting with that guy, and he told us he needs around 75 % in advance because he doesn't have the equipment on the stock. I was searching for smaller companies because client had one very very cheap offer from somebody else and I was trying to compete against that. We agreed everything, I needed to make a contract, and day after we needed to pay. Boss is caling me at 22:30, 75 % is way to much, we can do 50 %. We all were together at the meeting, we kne the price and now he is complicating again. But ok, I told him why we can't have 50 % and he agreed. That was last Friday. In Saturday, I had a coffee with that new company and they told me my boss told them that in Monday he will come to the location and that we will supervise the beginning of the project. I sent my boss immediately after that (so Saturday morning) a message for him to confirm me that. Sunday 21:30, he tells me that he didn't agreed that that I need to go to location. Ok, he is my boss I will do that.   \n\n\nWe checked the location, everything is great and we are coming back (4 hours by car) and I send my boss a message like can you confirm me the location for the apartments you told me you have so I can transfer that to new company. He sends me a message that apartments were not part of the deal that the guys should find it themselfes. Few minutes after that, car broke down, truck hit us but luckly only side mirror had some damage and I called boss like what is happening, you told me we have those apartments. He tells me we don't, like he told me that only for us to grab more money from final client. And we talked, argued 10 minutes. After that I thinked a bit, send a voice message that I quit, told him that I don't like this anymore, that I don't want to work like that and that in company there is no organisation. He then says me some things and says that I quit immediatelly when small amout of stress occures. Then I was a bit brash and sent a 8 minutes message, told him what everything is not fine in company and also gave some arguments that I work, study, had even 2 surgeries in last two years, try to have a privat life with all that etc. but that I can't allow anybody to tell me that I quit even with small amount of stress and expecially to a guy, my ''boss'' who saw me maybe 4 times. So I quit.  \n\n\nThat secretary wanted to quit a job even before me, probably two weeks passd after she started to complain about everything and really, nothing is organized in that company. I even say I will work to the end of this month. I'm really sorry, I have further plan but I don't know would you guys quit? Some friends are telling me that they would because there is no progress here, only problems, some wouldn't not because of the money but I don't want to work in a company where my boss is changing plans every 5 minutes.  \n\n\nWhat is your opinion?  \n\n\nThanks",
    "title": "Mechanical engineer, quit my dream job yesterday, got in a verbal fight with my boss, just want an opinion what you would do in that situation",
    "subreddit": "jobs",
    "timestamp": 1689180060,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "Museum Italy 🤮🤮🤮 I did volunteer work (civil service) with reimbursement of expenses in a museum in Italy (Turin) called MUFANT, reimbursement of expenses of 444 euros (3.9 euros per hour) given by the European Union for a voluntary service that was in all respects a real work where the main problem was that the two directors (they are engaged) do not want to hire anyone at the museum and delegate everything (ticket office bookshop enveloping secretarial communication first expense report), including the activities of public tenders where, however, the money was pocketed them, I hadn't been in psychiatric therapy for two years, because of them I will go back.",
    "title": "Museum Italy 🤮🤮🤮",
    "subreddit": "jobs",
    "timestamp": 1689269270,
    "score": 0,
    "keyword": "european director"
  },
  {
    "text": "Pregnant- how to tell my (American) boss - need advice Hi ladies, looking for some advice on handling the conversation with my manager about my pregnancy. Ideally from someone who has been in the scenario (on either side!) but any advice gladly taken. \n\nSome background- I am working for a large American company for just under a decade, but I am European and living in Europe and my contract is European. I have one child already - I took maternity leave from Dec 2021 to end July 2022. So I’ve been back at work over a year now. All my performance reviews have been exceeded expectations. \n\nAbout the job- my role is global though my manager and direct report sit in the US. I started as a junior member of the team and I’ve been running the team since end 2019. However, my career growth (read: pay) has been relatively stagnant because I’ve been very unfortunate- I’ve had at least 1 new manager a year and so each new manager I need to prove myself to, and they assume that my tasks are my “job” even though I’ve been steadily expanding my role every year. My job title has not changed since my old manager left and I took on her duties. \n\nAfter returning from maternity I was in the unique situation to be reporting back to a manager that I have previously reported to. I’m still on very good terms with my last manager and asked her opinion on career options/payrise. She said she had recommended it before her move. She advised me to ask about it immediately after returning, phrasing it like I had a lot of time to think on leave and I’m ready for the next step and my title should reflect my actual job. This went surprisingly well and my title was updated in the next month, along with some (seemingly) solid steps to getting to the next level.  \n\nHere’s the problem- I never got a payrise. When I expressed my disappointment with this, I was told it was in progress, they are different processes. A few months later I was told it was paused because annual review process was underway. Then there was a hiring freeze. Long story short this payrise has been dangled for a year with no update. My direct report is now basically outearning me (if you consider take home pay). I don’t begrudge her- I fought for her payrise. \n\nMy worry is the second I tell them I’m pregnant again, any hope of the payrise, and the move to director level disappear. There’s no guarantee that it’ll be the same boss when I return. I’m half thinking I say this outright- that I’m unhappy with the progress made and it’s making me reconsider my position but I cannot come down too strong as I have no intention of leaving right now. I feel like I rushed back from my first maternity leave and it made no difference. It’s making me second guess how long I should take this time. \n\nSorry for the long read, would love your advice!",
    "title": "Pregnant- how to tell my (American) boss - need advice",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1694000630,
    "score": 11,
    "keyword": "european director"
  },
  {
    "text": "General operational management background here (tech, supply chain, manufacturing), mostly experienced in Africa/Asia, now looking for a career back in Europe, what type of jobs would be a fit? Thanks for taking a minute to look at this! I would like some advice on what type of jobs I have a good shot at in a European context (ideally Ireland). I have an operations/general management type background (mini CV below). I would love to work in operations (maybe also project management) or sustainable supply chains; I'm happiest at the spot where I can bring all moving parts together. The feedback I have received so far is: experience not specific enough (for supply chain jobs), no management consulting experience (for business operations jobs), no cash or specific job available (start-ups), and a bit of not hearing back at all. Arguably, I have not cast my net very wide yet. Suggestions on qualifications that may help also welcome!\n\n*Start-up (Wound down), Operations Director/Co-Founder, Ireland, 2.5 years*\n\nSupply chain tech start-up where I managed a tech team of 7 (not as a CTO), onboarded clients, managed investors/partners and reporting to them, daily finance/HR management. Wound down due to: deep tech product with long corporate sales cycles, market targeted too broad, delay in raising follow-on investment.\n\n*Small consultancy, Operations Director, East-Africa, 3 years*\n\nData-driven decision making for governments, agencies and companies. I ran a team of 10 specialists and engineers, including delivering to clients and daily management, productised services leading to start-up above\n\n*Social Enterprise FMCG, Chief Operations Officer, East-Africa, 4 years*\n\nResponsible for production, supply chain and logistics activities across three continents, managed a team of over 150 people, reporting to Supervisory Board. \n\n*UN Agency, Logistics Officer, Asia/Africa, 3 years*\n\nManaged logistics hubs\n\n*Corporate XYZ, Corporate Management Trainee, EU country, 2 years*\n\n*Education: MA, International Relations*",
    "title": "General operational management background here (tech, supply chain, manufacturing), mostly experienced in Africa/Asia, now looking for a career back in Europe, what type of jobs would be a fit?",
    "subreddit": "careerguidance",
    "timestamp": 1673009006,
    "score": 2,
    "keyword": "european director"
  },
  {
    "text": "Given all the responsibilities of my boss but no raise or title. What should I do next? I joined an organisation 3 years ago in a company that has presence in 5 countries across the world with a decent sized funding and revenue top-line. The region I work in is not the headquarters but this region currently is responsible for over 50% of the revenues of the company. \nMy boss and I worked well together until he was let go in January of this year. While he was being let go, I was told that since I was consistently rated high among my peers, I would be taking on his responsibilities and leading the team hereon. I took those responsibilities in stride since I was excited about the role and wanted to do things my way as the role (Head of Marketing) allowed for it. \nSince then, I’ve build multiple profitable marketing channels, streamlined the processes in the team, executed events that were outside my original scope of work and have successfully launched a product in the market with great adoption and retention ratios. \nIn July (6 months after I was given the role) I approached the Directors (both of whom I have worked very closely with and have cordial relationships outside work) about a pay raise and an official transition into the role of Head of Marketing. I was told that I was doing an awesome job but the role needs to be discussed with the other members in the leadership since the company was getting restructured (new business units), so it would take some time. I said okay and gave them a soft deadline of October 2023 to have at least a first level of discussion with me about my place in the company. Come October, no one brought it up. So I approached the Directors and brought it up myself and they said yes, we want you here, we want you to lead the marketing function, but you will have to wait till November end since we are still not sure about how to structure this. They asked me for a number in terms of payscale, and I have given them a range, which they haven’t agreed or disagreed to. I have even told them that if I was not a part of their plans w.r.t heading the team, I was okay if they get someone good and competent to lead it while giving me the much deserved pay raise to the tune of a standard yearly pay raise. So far, I’ve heard nothing from them and I’m kinda sick of reaching out by myself each time. \nSo here are my questions to the community:\n1. Should I bring it up again in November end?\n2. If they push the dates back again, what should be my next course of action?\n3. My notice period is 3 months (since it’s a senior position) and I have emergency funds as well. Shall I take a gamble and quit, hoping they’d retain me for a raise in my current CTC? \n\nNotes: it’s a European company and I am in the SEA market, so budgets are tight, but they don’t seem to have a problem giving raises to my European counterparts. \n\nI am finding it very hard to stay motivated and working for essentially two roles for the salary of one, especially when most of the work is outside my official agreed upon scope since my boss was let go.",
    "title": "Given all the responsibilities of my boss but no raise or title. What should I do next?",
    "subreddit": "careerguidance",
    "timestamp": 1701023309,
    "score": 2,
    "keyword": "european director"
  },
  {
    "text": "Resigning During Probation to Rejoin Previous Employer, any advice? Hey folks! I'm reaching out to seek advice on a tricky situation I'm facing in my current role. I joined this company about three months ago under the impression that it would be a purely strategic marketing position with senior responsibilities and decision-making authority. The salary was also a major draw, being 50% more annually than my previous position.  \nHowever, the reality of the role has turned out to be quite different from what was advertised. I'm essentially a one-person team, without any senior mentorship to guide me. Instead, I'm finding myself teaching my expertise to the growth director (which I don't mind for now) because this person has no prior experience in the field.   \nMy current role has also taken on a more sales-oriented nature, requiring me to constantly pitch my strategies to the Chinese team, which manages the European branch like an agency. Due to cultural differences, our work is often overlooked or not requested, and I'm constantly in a selling mode. This was not something I was aware of when I accepted the offer.  \nMy previous company has reached out with a new position. It's in a different team with increased responsibilities, and the new boss is a friend and a great mentor. The reason I left my previous company was for career advancement and salary, as my manager at the time was not supportive of my growth. However, with a new manager and team, I believe this opportunity offers the growth and development I seek.  \nAfter careful consideration, I've decided to accept the new offer, which means resigning from my current position. I plan to politely explain my reasons for leaving, including the lack of a mentor, the sales-oriented nature of the role, and the limited scope of my responsibilities, which more closely resemble a copywriting position. While I'm on probation and my resignation period is zero, I plan to stay 2-3 weeks to complete outstanding tasks. \n\n  \nAny advice on how to conduct this talk? Without my manager and team feel offended because they're a nice team but I don't feel I can grow in this position :(  it is too hard for me to confront this",
    "title": "Resigning During Probation to Rejoin Previous Employer, any advice?",
    "subreddit": "careerguidance",
    "timestamp": 1701112390,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "I just need to get this out of my chest....? I have been with this company for almost 2 years and its been like a nightmare in some way. Work wise it is impossible to get things done, there are no processes and if there are any they are not being followed and there is nobody (Supervisors, Managers or Directors) encouraging and enforcing them. I think we are lacking a lot of direction and leadership.\n\nOn the other hand, work/life balance is great, flexibility is great, it is not fully remote but still is great and with the bunch of flexibility we have and few hours of actual work a day make it even better.\n\nProfessionaly speaking and career wise is not worth it at all, at least not for me. Being a results oriented person this is not making me any good. I feel I am wasting my time and experience.\n\nThis is a very big global company based in Europe with offices in many countries (I am based in US) \n\nI am in the lower levels as individual contributor for my team but my experience is more than this. I have communicated and pointed several problems directly to my manager and even when she apparenlty cares she does nothing! I feel that all this mess is just a reflection of top management. I feel managers, directors and top leadership feel lost as well and all this shit is just running down to lower levels. I have been struggling a lot to get into my new job/responsibilities, and while my team and manager are very supportive I feel I am not delivering and performing the way I know I can.\n\nI came to this job/company from a US american mindset company with better and more modern structure where I spent 11 years, it was great but it was time for a change. I still miss it but unfortunatelly going back is not an option.\n\nI was not looking for a career change but unfortunately I am not even sure how I ended in something that is not in line with my background. Maybe the money was so good. It was almost a 50% salary increase from my previous job.\n\nI feel I am focusing in many things that can be improved in the company/department but it is not even within my scope or responsibilities of my position and is making me feel irritated, frustrated etc. \n\nBelieve me when I ay I try to take it easy and only do what I am supposed to do, but my nature is to be competitive and go for more and help to improve things, But I get really mad seeing that not even managers are doing anything! honestly so frustrating. Even when I enjoy the European mindset of working I feel I am in a mediocre environment where nothing can be accomplished.\n\nI have shared very specific examples of what can be improved and my manager and people agree but nobody takes action! this is killing me. When I have tried to take action I am being blocked and there is always something.\n\nI talked once with a teammate and he said it was like this in all big companies, I honestly dont think so, and refuse to think that all companies this size are a mess in terms of working smoothly.\n\nI have actively applying for other jobs for at least 1 year, several interviews but no offers at all. This first 3 months of 2023 no interviews at all. I am feeling really desperate.",
    "title": "I just need to get this out of my chest....?",
    "subreddit": "careerguidance",
    "timestamp": 1678215224,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "Common law approach to the duties of company directors? Hey, \n\nI am looking for any sources in order to study differences between Continental and common law approaches to the duties of the directors of the joint stock companies (corporate law)?\n\nUnfortunately as middle European I am not so much familiar with case law to the topic. Would you be that kind and could anyone recommend me some case law regarding  \"duty of care\" and \"duty of loyalty\"? \n\nThanks in advance!",
    "title": "Common law approach to the duties of company directors?",
    "subreddit": "LawSchool",
    "timestamp": 1700779153,
    "score": 2,
    "keyword": "european director"
  }
]