[
  {
    "text": "Police response to reporting a woman crying for help I'm feeling so anxious and angry. I need to get this off my chest, I feel I need to speak out about this issue.\n\nI have just heard a woman crying for help. My  window had been closed, so it was loud enough for me to hear it on the 3rd floor across a wide street. I rushed to my window and tried to locate where it was coming from. I knew it was crucial to have a good idea where the cries come from, and I heard panicked screaming, on top of her lungs, for a good 20 to 30 seconds before I could judge the direction. Large block of flats, all windows closed, so it's hard to be sure when you don't see the actual people. Then I heard a loud smack (like something hitting a window). Strangled cries, a man shouting. I saw some blinds moving and dialled the police hotline. They told me to meet them on the street so I could show them where. They arrived quickly, an elderly very slow moving policeman and seriously disinterested policewoman. I explained what I saw and heard and my thoughts on which flats could be most likely. They went into the building and told me they would call me. A whopping 2 minutes later, they called me, saying they didn't find anything. The residents they talked to all confirmed there was loud shouting, but \"coming from a woman on the street\". I told them that I was absolutely sure there was no one in the street while I heard the cries. I was looking for the source, I had ruled out people because there was no one in the street. And I personally think that sounds more credible than \"probably came from the street but we didn't really pay attention\". I tried to tell them to check one floor above, or knowck on more doors. They deadpan said, \"We don't have enough information so there's nothing we can do.\" And the policecar was already leaving.    \n\n\nNot enough information? Call in someone smoking weed and 5 policecars will go there with sirens. Someone crying for help and suddenly stopping after a crashing noise? In a European country with one of the highest rates of femicides per capita? Taking 2 minutes to check - probably didn't even knock on the apartment doors. Definitely didn't have enough time to go up the stairs. I think they just talked to those who answered on the intercom. Maybe the perpetrator spoke to them, or just didn't answer the bell.   \n\n\nIt's so unfair, and it shows they'd rather sit in their car on break than knock on a a few more doors - maybe saving a life in the process. It's so heartbreaking and just plain wrong.",
    "title": "Police response to reporting a woman crying for help",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1636835337,
    "score": 97,
    "keyword": "european judge"
  },
  {
    "text": "My wife’s friend sent this email to her and their friends to help start a conversation about abortion Let’s talk about abortion. Everyone else is. \nThe lawmakers who made it clear women are a commodity they don’t give a flying fuck about—they have shit to say. The women who live in fear that people with more power than brains get to govern our bodies—well, we’re talking too. \n\nBut the group I’d like to hear from—loudly—are the women who’ve actually fucking been through it. The women on ice cold operating tables in thin paper gowns. The women in depressing, chaotic Planned Parenthood waiting rooms. The women who made the undesirable, unpopular—and in some places—illegal choice. Until we hear more from that key demographic, we’re not getting anywhere very fast. It’s becoming clear that significant change happens faster when people speak up and point a spotlight at something that’s been hidden and taboo for too long: about their sexual assaults, about their diverse sexualities, about their wage discrepancies. About their abortions. \n\nI’ll start. \n\nI had two abortions, in two different Aprils, 10 years apart. The first time I got pregnant by a rich white man who had no desire to commit to me and treated me like trash. The second time I got pregnant by a rich white man who had no desire to commit to me and treated me like trash. I loved both of these men. Our respective babies would have been highly intelligent, creative, arguably attractive and, apparently, rich. Except in both cases, I would have been raising the child completely alone. \n\nTo raise my child alone in April of 2005: I would have dropped out of the grad school program I was working two jobs just to be in, the very same program where I met rich guy #1—a guy who slept through most of his classes, dropped out of coveted internships at famous advertising agencies with no notice, and did a lot of designer drugs with daddy’s bottomless money. I would have given up on a career I was turning out to be pretty fucking good at and moved back to my small, conservative town so my parents could help me sort this mess out. I was so young, scared and desperately in love with this guy that A) I was terrified to tell him I wasn’t on birth control when he came inside me without asking the first time we had sex—and once was all it took. Then B) I waited to tell him about either the pregnancy or the abortion until I thought we were becoming more serious. He found out when the other girl he was sleeping with caught wind of it and thought it would be funny to shame me by telling everyone about something sad and scary I had been through all alone. So hilarious, right? I guess you had to be there. \n\nTo raise my child alone in April of 2015: I would have sacrificed the career I’d scraped and fought to build over the course of a decade, spent $50K in student loans on, and weathered an abortion and a recession for. I’d just moved home from working in a fashionable European city and was settling back into the fashionable American city where I’d started my career. I had a whole damn life waiting back there for me. I was lucky enough to be making a healthy six-figure salary, I had a huge, supportive group of women friends, and, stupidly, I had a furtive sexual and emotional relationship with a close guy friend of many years whom I loved deeply. It might not have been so stupid if he was capable of loving me back. He wouldn’t even pick up the check for dinner the night I told him about the pregnancy and upcoming abortion appointment. We split it. A beautiful metaphor that pisses me off to this day. \n\nWow Lauren, you’re so irresponsible that you had not one but TWO abortions?, is what some people might be thinking. Sometimes what you might call irresponsibility is just shitty fucking luck. After abortion #1, I  found a birth control that worked for me for nearly 8 years, and I took it diligently, swallowing that pill first thing every morning. It was a tiny, daily prayer for control over my own future. Then I moved to Europe and spent the next 2 years bleeding out while trying every French birth control on the market. I was in a committed relationship with an amazing man who was sick of having our sex life sabotaged by these tiny little pills. He begged me to go off birth control and we used condoms religiously from then on. If the condom broke, we marched his French ass and my American ass across the street to the pharmacy for a 12€ morning after pill. Then quelle dommage, we broke up, I moved back to America, and two days later fell backwards into bed with my old friend, rich guy #2. Condoms didn’t suit his lifestyle and the pill that had once worked like a charm for 8 years suddenly turned on me. More bleeding. Suicidal thoughts. Unsustainable. Cue abortion #2. \n\nFor years, I was the only one I knew who’d had an abortion. The silence around the topic was deafening. Occasionally, for fun, I asked friends if they knew anyone who’d had an abortion and they said no. But they did, whether they knew it or not, because they knew me. I had a drunken conversation with my dad over Christmas 2005, wherein I confessed and, in solidarity, he admitted he’d gotten his teenage girlfriend pregnant in the dusty little town where I grew up. There, in the shadow of Texas itself, churches were many, and abortion clinics were few-to-none. Aside from this shocking and illuminating, less-than-festive holiday chat, I felt very alone. And though I was deeply at peace with my decisions—correction: deeply proud of the way I’d stood up for my own fucking future and my own fucking body—there was a shame that comes as a byproduct of feeling very alone. \n\nThen one day, almost offhandedly, the women in my life began to talk to me about their abortions. A colleague abroad. My creative partner at a different big-name agency. A college professor who’s a mentor to me. A boss who’s like a mother to me. A few people I barely fucking knew.\n\nTurns out, I have many friends who have terminated pregnancies. I have friends who have terminated pregnancies for health reasons. I have friends who have terminated pregnancies for timing reasons. For money reasons. For personal reasons that weren’t expressly communicated to me because it wasn’t my goddamn business. I have friends who have terminated pregnancies, then gone on to start a family when both the father and the timing were right. I have friends in loving, healthy partnerships who got pregnant and decided it wasn’t the right thing for them. I have friends who’ve terminated pregnancies that I don’t even know about. And so do you. And while a sum total of zero people owe me information about the hard shit they’ve been through, I do think that every single woman who speaks up gets us closer to the total autonomy of our bodies that every single one of us deserves. \n\nIf we don’t start normalizing this shit, the government will continue to preach their agenda-driven gospel that we are unfit to make decisions about our own bodies. And if we don’t step up and talk about it, we’ll never normalize it. Yes—it’s an incredibly private thing, and it’s an incredibly polarizing thing. And, yes, even a friend who is firmly pro-choice and marches for productive rights and is all up in Instagram with her self righteousness might lowkey judge you when she finds out you’ve actually had an abortion. Maybe some of you friends are judging me even now. That’s usually a reaction borne of society’s pervasive culture of judgment around this topic and that’s completely up to you. That’s the reaction the Texas lawmakers are hoping for, because it keeps everyone silent. But abortion saves lives. It saved mine twice. It gave me the right to live my life, the one I built with my own brain and my own money, as I saw fit—not a life based on a biological misfire by some rich asshole who decided a condom was just not fucking worth it in the long run. \n\nIs it fair that we have to rage and fight in order to be granted the baseline, the bare fucking minimum, of rights for our own bodies? Fuck no. The raging and fighting for civil rights wasn’t fair. The raging and fighting for gay rights wasn’t fair. This is a fucked up world. Still want to bring a child into it? If you do, it's 100% your right and it's 0% of my business.\n\nI love the babies of my friends, and the babies born into my family. I do not, however, want babies of my own. An occasionally unpopular opinion, to be sure. Between rings of birth control, boxes of condoms and two terminations, I’ve spent a LOT of money ensuring that I don’t have any. Sometimes it feels like fighting a losing battle, this trying not to have unwanted children—ask any woman who has tried not one but many different kinds of what turned out to be the wrong birth control and bled for months without stopping (ask me). Ask any woman who has had an IUD go rogue and permanently damage the inside of her body (ask my cousin). Ask any woman whose health insurance refused to cover the exorbitant cost of the aforementioned unreliable methods (ask my friends). Ask any woman for whom added hormones in her bloodstream caused depression, anger, hopelessness, and a feeling of being alien in her own body (ask the next woman you see). Ask any woman who’s had a man argue in defense of skipping the condom for just a little less hassle and a little more pleasure (ask every fucking woman I know). \n\nI have my reasons for not wanting babies. Some of them selfish? Yes, absolutely. I live in the shiny city they base all the movies on and I work hard and make a fuckload of money and I want to spend every single dime of it on myself. Or sometimes I want to spend it being a generous friend, daughter and sister. However, some of my reasons for not wanting babies are things like the planet we’ve trashed, the horrifying rising floodwaters of climate change, the footage of bloody school shootings and the untold horrors just over the horizon we can’t even see coming yet. COVID-19 being a casual example I’ll just toss out. In which case, not wanting to bring a child into a dangerous and dying world can feel like exactly the right move. Whether you have babies or you want babies or you’re quite not sure yet, it’s your fucking business. Full stop. \n\nAbortion is a fucking act of bravery. It’s taking 100% of the physical responsibility for something you were only 50% responsible for. Which is, by the way, what it is to be a woman who’s pregnant, in general—whether she carries the child to term or not. 100% of the physical responsibility for something you were only 50% responsible for. Biology is incredibly light in the logic department. \n\nI refuse to be held hostage by biology. I refuse to let the government or the church tell me they have a plan for my one precious life that’s bigger or smarter than my own. I refuse to stay silent any longer about this thing I did, twice, because it’s my body and my fucking right. I’m angry at the stigma and I’m sick of feeling like the government owns my body and lets me rent it out by the month. My kids would have been amazing and I don’t fucking miss them for a second. Abortion is family planning. Abortion is health care. Abortion is way more common than you think. Every woman has a story—whether it’s the time she was scared shitless she was pregnant and absolutely needed abortion to be an option, whether she was actually pregnant and went through with an abortion, or whether she knew someone else who did. Every woman has some kind of story. Now is a really good time to start telling yours.",
    "title": "My wife’s friend sent this email to her and their friends to help start a conversation about abortion",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1631798430,
    "score": 28,
    "keyword": "european judge"
  },
  {
    "text": "I don't know where to post this but I feel lost and scared. As I get older it gets worse, and being in a dependent situation doesn't help. I'm 36 years old. I left my country 2 years ago and for most of that time I wasnt legally allowed to work. Since november I am, however it is very difficult to find a job.In this european country, people are highly qualified and speak 3 or 4 languages while I only speak 2. I have a degree too but one that is almost useless here, so each day I lose hope. I see the job posts and it'sl like all the offers are for astronauts and I'm just a cleaning lady (no disrespect to cleaning ladies, Im just stablishing the discrepancy between where I am and what employers want).\n\nBut the problem comes from before. I was raised in a strict household and Im shy. I get super nervous for everything, I dont know how to stand for myself. In the last job I had (which lasted 2 months) I was bullied by another woman who would just intimidate me, constantly gaslight me and treated me badly, and ultimately \"won\" (I quit).Sometimes when I speak and people look at me, I blush for no reason other than people looking at me. Im fucking 36 and I blush like a kid. It doesnt even have to be something embarrasing that I said, it's just, I dont know, my brain goes \"hey, look, everybody is looking at us, let's show them some red!\"(btw this doesnt happen because I feel conscious speaking a different language, this happens even in my own mother tonge).\n\nLastly, COVID. As we all know, covid has made things hard job-wise. People have lost their jobs and there are not as many offers out there as before, so only the very best get them, and I dont think I am in that group. In my country, I worked for 5 years in a company in a mid-responsibility position (I hated the job, I felt incompetent in it), but after that, I have only had one other job and I was bullied for not fully speaking the language or just because it was funny for the bully to pick on me and make me feel insecure and work double. Even when I was in my country I had confidence issues but now Im destroyed. I check the job market 3 or 4 times a week and I get easily overwhelmed. I cant even apply to a fucking job (I've applied to like 2 in the last 30 days) because I dont fit in anywhere. An aquaintance of my husband told me to send him my CV to see if he knew someone in my field who could help me and I havent done it honestly because Im terrified to be called for a job that I wont know how to do.Just to be clear: Im not in a difficult situation finnancially speaking, my husband (I married a national here) has a job and can provide for both of us but I feel I, as a person, have dissapeared. All I feel is Im not good enough. I feel inferior, I get nervous just talking to people, I blush constantly, Im incapable of speaking up (even in my marriage, which is not ideal), I have no decision making power as I have no income, and I just want to cry.\n\nI often dream that Im back in college (I graduated ages ago) and I have an exam and I didnt study so there I am panicking because I know nothing and often in my dreams Im copying from this girl (an old classmate who is happily married now and has a managerial position at some company). If not, then I dream about the people who have bullied me, like that bitch at my last job, or a boss I had in my homecountry (he only did this once but I still remember), who humilliated me as a power move in front of a new employee. Or I dream that Im in an office, working, and suddenly I've lost my files and I have to give a presentation and I know nothing and my heart accelerates in real life and I wake up in the middle of the night wanting to cry.\n\nWhen I was 17- 18 years old, I was much more confident that I am now, it's incredible. I remember one time that a friend and I were walking together and a group of our classmates were in the next corner and she wanted to avoid them for no reason and it was me who suggested we aproached and say hi. It was weird to me that someone would avoid people, but now, almost 20 years later, the one who avoids people is me. I'm in a few whatsap groups of ex classmates and I never speak for fear of being judged. If I was walking and saw someone I knew I would cross the street to avoid them, and now that I live in another country I have trouble with speaking with my inlaws. Just asking my MIL to do me a favor is such an energy-consuming task that I need to plan it, prepare for it, breath in and out, etc. I hate being like this. I just want to be normal. A normal woman. A normal person.\n\nPlease, if anyone has any insigh, any advise, let me know.",
    "title": "I don't know where to post this but I feel lost and scared. As I get older it gets worse, and being in a dependent situation doesn't help.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1612279057,
    "score": 2,
    "keyword": "european judge"
  },
  {
    "text": "I wish there wasn’t always better a while ago I searched up “beautiful Africans Quora” and saw questions like “why are East Africans women so beautiful” and “why do East African women look so different?” I was confused bc I didn’t know this was a thing?? Like I knew of colorism and mixed black women (especially when ambiguous looking) commonly being seen as more attractive than darker black women, but East African preference was new to me as someone who has never really lived around East Africans. \n\nI searched up what East Africans looked like and yeah, it made sense. They have the smaller noses, smaller lips, soft wavy hair, etc, all the features not commonly associated with the rest of Africa / slave descendant black Americans (who are primarily from west Africa). \n\nI looked into it and found out that bc of the region’s isolationism throughout the centuries, there is a lot less physical diversity than in other regions of Africa. So that’s why it’s not rare to see a west African or black American w/ a small nose but it is rare to see an East African w/ a big nose. \n\nAnyways i know I shouldn’t have, but I kept  looking and y’all I was so exhausted. There are so many questions on Quora / Reddit about East Africans’ “exotic” look and beauty compared to “regular” black people, like I know I should’ve expected it cus ofc Eurocentric features on dark skin will always be seen as more attractive than Afro centric feature on dark skin, but still it just hurt bc it feels like there’s always another group that’s perceived as better. \n\nRappers like drake talk about East Africans a lot in their music too which is especially frustrating bc it’s like they try to pass it off as black girl appreciation, while only ever praising one specific subset of black people who’a features commonly fit into European beauty standards.\n\nDoes anyone else feel the same way? This isn’t hate towards any East Africans or an attempt to undermine their beauty, it’s obviously not their fault that society is like this, it’s more just a rant about how even within the black community, there’s still a hierarchy based on how Eurocentric ur features are. I just wish beauty wasn’t judged through a white lens \n\n\nEdit: my intent is definitely not to incite drama, it’s just something that’s been hurting me for a while but if it is breaking the rules, I’ll definitely take it down",
    "title": "I wish there wasn’t always better",
    "subreddit": "blackladies",
    "timestamp": 1619202959,
    "score": 26,
    "keyword": "european judge"
  },
  {
    "text": "Dear Postgraduate Black Americans studying in the UK: ©️world2021 \n\nDear Postgraduate Black Americans studying in the UK: \n\n**THE BAD**\nYou will be the only one if you're in the arts/humanities at postgraduate level and chose your supervisor for their expertise (as you should) rather than choosing to be in London or Manchester to be surrounded by other black people. \n\n**THE NEUTRAL**\nYou are probably currently residing amongst a lot of Chinese postgrads if you're in halls. They may or may not be open to you. \n\n**THE GOOD**\nThis is an opportunity to get to know a more diverse set group of people than you've (probably) previously mixed with socially. Embrace that. \n\n**THE BRITISH**\nPeople like to think of themselves as tolerant, fair and most definitely not racist. You will judge for yourself the extent to which that's true or not, but that's how people tend to think. You will at times encounter ignorance, especially if absolutely everyone is white, but it's highly unlikely to be the case within a university. Where you do encounter ignorance, most people will be open to discussion in the right setting. They will be horrified to know they've caused unintended offence. (No that doesn't necessarily make it ok.) \n\nNow for some advice. Note, you will almost always be understood regardless of what you say, so some of the later language advice is simply to avoid inadvertently irritating us. \n\n**MEETING & COMMUNICATION WITH OTHER PEOPLE** - THE DOS \n\n+ Be open to everyone. \n\n+ Take people as you find them, not as you expect to find them. \n\n+ Always join your colleagues when invited to the pub. (Until such time as you decide that you definitely, 100% cannot stand them, if that happens) \n\n+ Go to fresher's week. Join clubs and societies around activities that interest you. *This will probably be you best source of friendship.* \n\n+ Visit every museum you can - they're mostly free \n\n+ Take advantage of student discounts, especially for cultural activities like live theatre. Ask the Student Union for more info. \n\n+ Visit other parts of the UK (there will be discounted tours-again you'll find organisers in Fresher's Week). \n\n+ Visit Europe for more than a day's shopping trip. North Africa is also close and relatively inexpensive. \n\n+ Join a religious community if that's important to you. \n\n+ Try to be specific in your use of language. E.g. *I'm from the South*...of...? Texas? The States? Scotland? England? London? Cornwall? \n\n+ Mind your Ps & Qs (🔍) - always, always say thank you. It is not necessary to respond to a thank you. \n\n+ Learn how we use the terms race and especially [ethnicity here](https://www.ethnicity-facts-figures.service.gov.uk/ ) \n\n+ Watch *Question Time* and *Newsnight* on BBC2 or iplayer to get a better understanding of British politics, especially the views of the 'left' and 'right' which you may find surprising as the terms do not correlate with American usage. Or don't. \n\n+ Look for opportunities to contribute - for example, by volunteering as a mentor in a local school. Black arts and humanities academics are rare. Be the change you want to see. Or don't. \n\n**MEETING & COMMUNICATION WITH OTHER PEOPLE** - THE DON’TS \n\n+ Don't take offence to any of the following if it doesn’t apply to you. This has taken a long time to compile, is based on experience of black Americans in British universities, and I'm only trying to help you. \n\n+ Do not generalise and say *Britain/the UK is like x* or *British people are like y* if you've only been to whatever part of it you're in. You'll offend. (See, be specific above) \n\n+ Do not say that you go to school. You go to university or uni. Only children go to school. \n\n+ Do not exclude anyone as a potential friend on the grounds of race, religion or sexuality. \n\n+ Do not assume that mixed-race people identify as black. They may and they may not. \n\n+ Do not assume that others share your religious beliefs, if you have any. Most Brits (Europeans) are irreligious and secular; even most who describe themselves as 'Christian' often merely mean that they were baptised as an infant or that they're white or that they're *not* a Muslim or Hindu. \n\n+ Do not fear: Muslims (potential friends and allies), terrorism (that would just be unpreventable very, very bad luck) or knife crime (no one is looking for you). \n\n**MEETING OTHER BLACK PEOPLE** \n\n+ Join the ACS (Afro-Caribbean society) to meet fellow black students. \n\n+ Go to uni club nights that play your sort of music if that's your thing. (Prob Thursdays if you like Afrobeats, R&B etc. Don't expect it to be majority black though). \n\n+ Use meetup.com to find black locals who want to mingle. Unless you're in the countryside, there probably *are* ethnic minorities where you live but they are not likely to live anywhere near your university. \n\n+ Go to the pub (the repetition is deliberate). Drink alcohol; don't drink alcohol. But whatever you drink, go. \n\nWelcome and enjoy!",
    "title": "Dear Postgraduate Black Americans studying in the UK:",
    "subreddit": "blackladies",
    "timestamp": 1632057579,
    "score": 24,
    "keyword": "european judge"
  },
  {
    "text": "Study: Women leaders did NOT do better at handling COVID and the reason it was claimed was due to sexism: hyper-focusing on good women, ignoring bad women, hyper focusing on bad men, ignoring good men (the study is generous, women leaders actually did significantly worse) [https://www.dailymail.co.uk/sciencetech/article-9102585/COVID-19-Countries-led-women-NOT-fared-significantly-better-pandemic.html?login#newcomment](https://www.dailymail.co.uk/sciencetech/article-9102585/COVID-19-Countries-led-women-NOT-fared-significantly-better-pandemic.html?login#newcomment)\n\nThe reason this was sexist nonsense is because the original claim (women leaders better handled pandemic which was falsely claimed by a study then cited bu UN, WEF, Times, Guardian, BBC, etc) was:\n\n1. Entirely false to being with\n2. Due to Gamma Bias\n\n# 1) entirely false to being with\n\nSee here, not only did female leaders do worse than male ones, but even higher female majority parliaments did worse:\n\nIn summary:\n\n* The median death per capita rate in female-led countries is 60.3 per million. The median death per capita rate in male-led countries is 17.8 per million (Mann-Whitney U test p-value 0.053).\n* The median death rate per capita in countries with national parliaments with at least 40% women is 59.7 per million. The median death rate per capita in countries with national parliaments with less than 40% women is 17.9 per million (Mann-Whitney U test p-value 0.048).\n\n[https://www.reddit.com/r/theydidthemath/comments/idz5ih/self\\_according\\_to\\_european\\_cdc\\_and\\_oxford/](https://www.reddit.com/r/theydidthemath/comments/idz5ih/self_according_to_european_cdc_and_oxford/)\n\nTo be clear, to me with a brain THAT IS NOT BECAUSE THEY ARE WOMEN... there are countless factors, but it makes it even more hilarious those agenda drive fake researchers tried to say women did better, when they literally did worse. And even if it was due to women as a class, that would still make no difference, as you aways judge individuals, not group identity.\n\nThe study saying otherwise was absurd in its logical gymnastics to try and paint a false picture:\n\n[https://www.reddit.com/r/skeptic/comments/ie5zng/fundamental\\_analysis\\_flaws\\_underlying\\_just\\_about/](https://www.reddit.com/r/skeptic/comments/ie5zng/fundamental_analysis_flaws_underlying_just_about/)\n\n&#x200B;\n\n# 2) The reason: due to Gamma bias:\n\n[https://malepsychology.org.uk/2018/12/04/why-are-there-so-many-disagreements-about-gender-issues-its-usually-down-to-gamma-bias/](https://malepsychology.org.uk/2018/12/04/why-are-there-so-many-disagreements-about-gender-issues-its-usually-down-to-gamma-bias/)\n\nWithin the “celebration” cell, for example, the positive achievements of women are routinely celebrated as a gender issue. Within the same cell in the table, the positive actions and achievements of men are not similarly celebrated or gendered. For example, when a group of boys was recently rescued from dangerous underwater caves in Thailand, it was not reported as a gender issue or as a positive example of masculinity, despite the fact that all the rescuers were male.\n\nIn the “victimhood” cell, domestic violence against women, for example, is highlighted as a gender issue, whereas domestic violence against men is played down or completely ignored, despite the [substantial numbers of male victims](https://link.springer.com/article/10.1007/s12119-013-9194-1). When men make up the majority of victims (e.g. suicide, rough sleeping, deaths at work, addiction), the issues are not highlighted or portrayed as gender issues.\n\nWithin the “privilege” cell, male privileges are magnified in our media and politics as “patriarchy” whereas female privileges (for example relating to children and family life) are played down or ignored as gender issues.\n\nThe overall impact of gamma bias therefore, according to this hypothesis, is that masculinity is made to look significantly worse than it really is whilst simultaneously femininity is made to look significantly better than it really is.\n\nWhat are the implications of the routine magnifying of the worst of men and minimising the worst of women? Well, for a start we might need to reconceptualise the ‘crisis of masculinity’ as a crisis in our attitudes towards men and masculinity.\n\nLet’s make 2019 the year we wake up to the need to explore our conscious and unconscious biases against men. We hope that the concept of gamma bias and the *gender distortion matrix* will help people to think more clearly about gender issues.",
    "title": "Study: Women leaders did NOT do better at handling COVID and the reason it was claimed was due to sexism: hyper-focusing on good women, ignoring bad women, hyper focusing on bad men, ignoring good men (the study is generous, women leaders actually did significantly worse)",
    "subreddit": "MensRights",
    "timestamp": 1609562877,
    "score": 2034,
    "keyword": "european judge"
  },
  {
    "text": "We now have many more female magistrates than men and the way they were chosen is shameful. In my country, it does not take much to become a magistrate. You have to be a lawyer who has been practising in any field for at least 10 years. The minister of justice then nominates whoever he wants to become a magistrate. \n\n1. Any successful lawyer is not going to accept the post of a magistrate because sucessful (good) lawyers make much more money than magistrates. So we are left with the kind of lawyers who never win a case to make into magistrates.\n2. To impress the European Union and the electorate more women are being chosen to show that the government is pro feminism. Now, about 75% of magistrates are women. \n3. These women magistrates are not assigned complex cases like for example money laundering or murder cases. Instead, they are given cases of 'abuse', family matters, 'hate crimes', sexual harassment, etc.\n\nSince most of the people accused of such crimes are men, we start at a disadvantage. You get a woman to judge whether it is you or another woman who is telling the truth.",
    "title": "We now have many more female magistrates than men and the way they were chosen is shameful.",
    "subreddit": "MensRights",
    "timestamp": 1626813067,
    "score": 365,
    "keyword": "european judge"
  }
]