[
  {
    "text": "Is this European Union job a scam or is this normal? I was browsing through LinkedIn and saw this listing for a Deputy Country Director-Trainee for European Institute of Policy Research and Human Rights (EIPRHR). The LinkedIn link to apply redirected to a jobisjob listing which also redirects to a jora listing but never to the application portal itself. At this point I was skeptical but my skillset is highly aligned in policy and international relations so I was interested. I googled EIPRHR and found its website. (It was very dated but not unusual for govt/ngos) At this point, it was also odd to see that the salary range Euro (€ 3550- 6500 / month) was included in the various job listings they offer but still not unusual enough to raise flags.\n\nI did some digging and quickly learned that aside from the usual requirements, you have to (1) take a psychometric and English proficiency screening test which they conduct themselves that costs € 399 as administrative fee then (2) take a paid online course on Advanced Diploma in Leadership and Entrepreneurship (ADLE) which they offer in their EIPRHR Academy tab which costs Euro € 2970 ( from 26th April 2021) Euro € 995 ( Till 25th April 2021). It's also worth mentioning that their fine print states that once you pass this 1 month certificate course, they grant you a 2 month internship and then you automatically get hired for the job I mentioned above.\n\nI've done my quick online check and apart from their kinda low-res logo on their paypal, facebook, and twitter, their online activity seems legit and nothing out of the ordinary. It has glassdoor recommendations too as well as published 6 known linkedin members that work there.\n\nI feel like I have to mention that I'm not from any European country and the job hiring process where I'm from is pretty straightforward and this is the first time I've seen a job require your to pay for a training they offer to be assured a position in their company. I just wanted to know if this is normal or is it an elaborate scam?",
    "title": "Is this European Union job a scam or is this normal?",
    "subreddit": "jobs",
    "timestamp": 1618986332,
    "score": 3,
    "keyword": "european director"
  },
  {
    "text": "Evaluating offer without knowing total shares? I have a question about an offer that I am evaluating at a European startup (valued at over a billion planning on growing 5x over next 4 years).\n\nThe role is director level and it is privately held. The numbers they are giving me for my options are 2000 options with a strike price of 150 euro vesting over 4 years.\n\nI asked them how many shares outstanding or the percentage of the company this would represent but they haven't been able to provide me an answer. Seeing as the strike price is usually equal to the fair market value could I therefore infer the total shares and % of the company this would be? Or do I absolutely need the percentage or the total shares outstanding? For what reason would they hide this information? Thanks reddit :)",
    "title": "Evaluating offer without knowing total shares?",
    "subreddit": "jobs",
    "timestamp": 1622614583,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "25 yo veterinarian with 2 masters and a Helpdedk job. Got other potential job offers. Is staying in helpdesk a bit more a bad idea? Long story short, I am a veterinarian with a masters in ethology/ecophysiology and an other masters in \" integrated management of sanitary risks in the global south\".\n\nI began my very first job this week. \n\nThe position is called \"Application Support Specialist\", it consists on doing desk management tasks for TRACES (an online tool for animal traceability) with the SANTE directorate general at the European Comission.\n\nI have an other potential offer from a lab as an Animal Welfare officer in a lab that belongs to UCB (I get payed a little bit less than in the other position). Job consists on taking care of the animal welfare policy and breeding policy for rats in the lab.\n\nA lot of people have been telling me that starting my career in a desk help position is a big ass mistake, since it wont allow me to evolve and I will be stuck there \"forever\". Following that logic, I should go work for the lab...\n\nIs this really true? Would I fuck up if I decided to stay at my job?",
    "title": "25 yo veterinarian with 2 masters and a Helpdedk job. Got other potential job offers. Is staying in helpdesk a bit more a bad idea?",
    "subreddit": "careerguidance",
    "timestamp": 1639075456,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "Contract Language: ok to give 1 month notice when contract states 2? **Director level role, US: \"at will\" state**.\n\nTLDR: Contract states two months notice, I need to only give one month notice as I have accepted a new job.\n\nContract with the following language:\n\n*You will be employed on an “at-will” basis, pursuant to which your employment may be terminated for any reason, or for no reason at all, as long as the reason for termination is not discriminatory in nature. You will therefore be employed on an indefinite-term basis. In the event that your employment is terminated, whether by you or by COMPANY X, the terminating party will provide the other party with two months’ advance notice.*\n\nThere are no other clauses that state anything about legal notice/action etc. The way this was described to me is because I work for a European company, they wanted to provide staff with potential severance in the US as there are great protections mandated in Europe - they were horrified that staff could be fired on the spot and lose salary and benefits immediately, so this was \"perk\" of having a euro parent office.\n\nI feel very good about managing the \"bad news\" to them I am still giving a full month notice, in a very good time - just finished a huge project this week, my staff are well equipped to \"triage\" if they need to while the org finds a replacement, etc.\n\nI am assuming that I simply notify them on a call - and then send them a resignation letter with my last day on it, nothing complex, but am I overlooking anything here? My expectation is if they want to be huge jerks they can steal my few weeks of accrued vacation, and that is my only liability. However, should I talk to a lawyer first?",
    "title": "Contract Language: ok to give 1 month notice when contract states 2?",
    "subreddit": "careerguidance",
    "timestamp": 1621779472,
    "score": 0,
    "keyword": "european director"
  },
  {
    "text": "In Portugal the quality of the Covid vaccine you get depends on your gender. The vaccination of people under 50 against Covid-19 in Portugal created a massive gender divide in the whole vaccination process. Portugal announced that men in the 18-50 age group [would be getting the J&J (Janssen) vaccine while women would get only Pfizer and Moderna vaccines](https://www.theportugalnews.com/news/2021-06-13/janssen-vaccine-now-recommended-for-men-over-18/60385). Astrazeneca vaccine is not given to that age group regardless of gender.\n\nFor those not acquainted with the different Covid vaccines, Pfizer and Moderna vaccines have a [95%](https://www.janssencovid19vaccine.com/hcp/clinical-data.html) and [94.1%](https://www.janssencovid19vaccine.com/hcp/clinical-data.html) effectiveness respectively and nearly 100% effectiveness at preventing death or serious illness. Janssen vaccine on the other hand has [66% effectiveness in preventing moderate to severe disease.](https://www.npr.org/sections/coronavirus-live-updates/2021/01/29/961887796/johnson-johnson-vaccine-is-66-effective-in-preventing-moderate-to-severe-covid-1) The excuse given for the gender segregation was that most cases of blood clots from Janssen vaccine occurred in women. However the truth is cases were extremely rare on both genders and the European Medicines Agency has recommended it for both genders within that age group. Portugal chose not to follow that recommendation.\n\nIt gets worse, however. Currently [90% of infections](https://www.theportugalnews.com/news/2021-07-07/delta-variant-responsible-for-close-to-90-percent-of-infections-in-the-country/60905) in Portugal come from the Delta variant. While Pfizer and Moderna vaccines (and most two-dose vaccines) have been proven to have [very high efficacy](https://www.businessinsider.com/delta-variant-covid-vaccine-effectiveness-protection-pfizer-moderna-astrazeneca-2021-7) against this variant, Janssen vaccine is thought to have little to no efficacy against it, similar to single shots of the remaining vaccines. This is concerning to the point that in the US [there are already Pfizer/Moderna booster shots being administered](https://www.reuters.com/business/healthcare-pharmaceuticals/booster-may-be-needed-jj-shot-delta-variant-spreads-some-experts-already-taking-2021-06-25/) to people who took the Janssen vaccine due to the Delta variant. Men in Portugal are being given a vaccine that offers little to no protection to the variant we have, and the government is aware of that.\n\nOfficially men in Portugal **can** be given the Janssen vaccine, but there is no official \"men get this, women get that\" rule. However such rule remains in practice in vaccination centers nonetheless.\n\nToday I went to have my vaccine. I asked which one they were giving and of course it was Janssen. I asked whether they could give any of the others as this was the only vaccine I wasn't comfortable in getting.  Staff consulted with each other (all female staff) and afterwards with the nurse and claimed it was impossible, that they only had Janssen vaccine. This is of course a lie since there were plenty of women in my age group getting the vaccine there and currently women in this age group **cannot** be given Janssen vaccine at all unless they volunteer themselves. This means a vaccination centre that is accepting women cannot have the Janssen vaccine exclusively. In other words their response shows a de facto rule that men are given only Janssen vaccine is being enforced.\n\nQuoting the official announcement, ***\"this single-dose vaccine may also be administered to women aged 50 years or below \"who wish to do so, if duly informed, on a basis of weighing the benefits and risks\", provided they express their \"free and informed consent\".*** Once again, \"free and informed consent\" is a right men do not have as is the case in many other matters.\n\nThis comes added to the fact that men are very disproportionately killed by Covid-19, with a current mortality of 2.1% (9.016 deaths among 415.709 infected) compared to women's 1.6% mortality (8.148 deaths among 493.506 infected). It's no surprise that men are considered disposable in Portugal as is usually the rule everywhere else. In fact, when the number of workplace accidents went from 78% male to 69% male the national worker's union (CGTP) presented it as an \"aggravation of the gender inequality in work accidents\" [(Source in Portuguese)](http://www.cgtp.pt/images/images/2016/02/tendenciaacident.pdf), since male lives don't really matter.\n\nBoth the minster of health and the director of DGS (the authority that decides which vaccines are to be used, who they're administered to, etc.) are women.",
    "title": "In Portugal the quality of the Covid vaccine you get depends on your gender.",
    "subreddit": "MensRights",
    "timestamp": 1626109625,
    "score": 1123,
    "keyword": "european director"
  }
]