[
  {
    "text": "What career in IT is suitable for a failed film director? Hi! I'm 25 years old and I want to change my career path. More than exactly change. Start from scratch.\n\nFor a few years I studied to be a film director, it was in the early 2010s, just after graduating from school. At the time, it seemed like something romantic and a great excuse to tell everyone about myself. Not everybody studies to be a film director, but here I am so smart, know literature and art history. Well, okay. After a while, I did some work and realized that this is not exactly what I'm looking for. I liked the process of dramaturgy better than all these market relations. Managing people is not a difficult process for me either, but so much of administrative work kills all interest. Among other things, in my country it is quite difficult to make films. Either you make a boring \"European cinema\" about old people dying of cancer, or you go into the field of cheap advertising for local shops. And if you're lucky. But the subtleties of the market and the world I realized quite late, up to the age of 22 I thought that I could find myself in that very cherished cinematography without money and experience.\n\nBut at the age of 21-22, my views changed a little. I continued to write, for myself, but my buddy advised me to use git to track changes in my work. And it seemed very interesting to me. Since then, I've been working on some lousy work like a copywriter or a store clerk, but at the same time I've installed Linux, started writing simple programs on Python and Bash, and in general I went up.\n\nBesides, I really learned to learn and fell in love with it. I learned several languages at a good level. Including English, which I almost did not learn at school. And I hope it isn't very bad. But now I don't know what to learn.\n\nI want to go to IT because I like it, because I understand something about it, but I don't know how to apply the skills I learned during my directing studies. I tend to think of myself as a creative person, and I probably wouldn't like the job of a programmer, although now I'm writing programs for myself and I like it quite well.\n\nNow I'm thinking about the following plan: to get a job in HelpDesk, from there to rise to the position of a system administrator, and from there to Project Management or something like that.\n\nMaybe there are people here with similar situations? \n\nAnd another thing: maybe there is something I should pay attention to or open something new?\n\nI'm sorry about the clumsy English.",
    "title": "What career in IT is suitable for a failed film director?",
    "subreddit": "careerguidance",
    "timestamp": 1571250325,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "CS Masters Degree holder who badly needs to get back on track CS Masters Degree from a decent University (Top 50ish).   \n\n\n**The Ugly:**   \n\\-I basically jumped directly from my undergrad to grad studies without any industry experience with some naive ideas on what to do.  Basically ended up studying an amalgamation of distributed systems, data intensive systems and data mining.  \n\\-Came from a basic background and a different country so lot of adjusting to do as well. (Basically went straight from a Tier-2 European city to a grad school in US, so a bit of a cultural shock)   \n\n\n\\-My programming skills are average at best. In Grad school I used Java, but as part of my job I have been reduced to small scripting using either python or have turned to go-lang in my personal learnings.   \n\n\n**The Decent:**\n\n\\-Missed closely a few FAANG intern interviews but apart from that had no idea how to network for smaller companies.   \nGave 1-2 on-sites but did not succeed, so finally accepted a contractual position in a telecom giant. Worked my way to a few projects that involved some programming and software engineering (basically requirements gathering, helping devs design and implement systems). Became a tech QA lead in a year and now work with System Engineers, Directors, Solution Architects on designing telecom systems. But still my role and compensation are way below what I have seen here.   \n\n\n\\-Additionally, I am on an immigrant visa, so work authorization are not generally an issue.   \n\n\n**The honest assessment:** \n\n\\-I can sincerely say that I have tried my best to leetcode. But I falter at the very first step of tech screens for one reason or another and at this point i feel that I am too doubtful of my own capabilities to ever become a software engineer.   \n\n\nHeres my plan for the next few months:   \n\n\n\\- Leet Code 10 problems a week   \n\\- Read up and implement on: Designing Data Intensive Applications, Grokking the Sys Design interview, Clean Code,  and Design Patterns  \n\\- LinkedIn reach out to recruiters (This I feel is the most easiest with recruiters willing to test me out for interviews, but I am so bad at them that I have stopped accepting every reach out for the fear of failing again)   \n\n\nI would appreciate any help from the veterans on how to get back on track. I feel my background (Both undergrad and grad in CS) and experience (Systems Engineer, albeit contractual but a good one to boot) are in my favor but the more in linger in a non core CS role, the more appealing I would start looking.   \n\n\nThank you in advance for the help!!",
    "title": "CS Masters Degree holder who badly needs to get back on track",
    "subreddit": "cscareerquestions",
    "timestamp": 1573541829,
    "score": 2,
    "keyword": "european director"
  }
]