[
  {
    "text": "Is my new job a scam? I've recently started a new job as a Program Manager for a European construction equipment company opening a new office in my area (Nashville)\n\n&#x200B;\n\nIs this a real job or am I being scammed?\n\n&#x200B;\n\n**Here are the red flags:**\n\n* Paid one month training where I get daily homework. I haven't been paid yet. The homework assignments seem legit but have some typos.\n* They have asked me to buy iphones  with my credit card that they immediately reimburse with bank account info that they gave me to pay back my credit card charges. After I buy them, they have me mail the phones to an IT firm that sets up the devices. The first address was Hong Kong (they claim a HK office), then New Jersey.  \n* They  asked me to buy first 4 phones, then 6, then another 6. I only bought the first batch, which I was paid for. The last batch is 6, 256g iphones. The extra storage seems suspicious for a company to buy. I doubt companies buy their employees that much storage for a work phone unless there's something I don't know about the job, like lots of videos?\n* They don't appear to have a physical office yet.  They list addresses in PA and TN but they don't appear to be there. They have said they're just signing the lease, etc. \n* Not much online about the company. They had a basic website and now it's an \"under construction\" notice. My contact told me thy are relaunching the site.  \n* The phone number is a google voice number\n* I haven't met anyone in person yet\n\nI keep thinking things are just off due to them being European and just opening a new office.  But why are they having me buy iphones and then mail them? Seems like money laundering or something?\n\n&#x200B;\n\nHas anyone heard of anything like this before? Thanks in advance for any feedback, I'm totally nervous that I'm either a rube or about to mess up an odd but decent job.  Not to mention, I will be forever humiliated if I did homework as part of a scam.  \n\n&#x200B;\n\n&#x200B;",
    "title": "Is my new job a scam?",
    "subreddit": "jobs",
    "timestamp": 1548429096,
    "score": 269,
    "keyword": "european manager"
  },
  {
    "text": "Should I assume I won't get an offer? Hi all,\n\n&#x200B;\n\nI applied to a European company in Asia. The local office is rather small with only 12 people at the moment, and has been busy expanding headcount this year. \n\n&#x200B;\n\nI recently did my 2nd and final round \"meet the teammate\" interview. I think I did overall good, although there were a couple of questions where I mumbled slightly. \n\nTwo potential teammates were interviewing me, with the office head/manager sitting in the side.\n\nHe didn't ask any questions to me in the second round, but when I asked questions to the teammates, he did add onto the teammates' responses in detail.\n\n&#x200B;\n\nI have mixed messages, and not sure if I didn't get the job.\n\n&#x200B;\n\n**Some good signs**\n\n\\- He always replied to my thank-you message; not sure if simply being polite but at least not a bad sign.\n\n\\- When I asked questions during \"do you have any questions\", he responded in detail including \"what kind of task the *office* will be doing at this hour, etc\". He spent decent effort and time responding to my question, which is a good sign \n\n&#x200B;\n\n**Some of bad signs**\n\n\\- He looked at his phone for about 3 minutes during 40 minute interview. To be fair, he was not asking any questions and he may have urgent business to do, but being distracted is not a good sign\n\n\\- When I asked \"What are the next steps\", he said this is the final round and he \"will let \\[me\\] know soon\". When I asked around when I can expect the notice, and he replied \"up to 2 weeks, but let me know if other companies offer me a job so that I can make quick decisions\"\n\n\\- When I asked \"are there any candidates that may start at a similar time\" (since the company is expanding this year), he responded that \"recruitment is an ongoing process where the company hires only if they see a suitable candidate\"\n\n&#x200B;\n\nI don't know the world of recruitment, but as the office manager/head, I believe he has power to make hiring decisions without big bureaucracies. So I am concerned about the longer-than-average timeline, which is 2 weeks. \n\n&#x200B;\n\nI did really like the job, and prepared hard for the interview. \n\nIn your opinion, should I give up on the offer?",
    "title": "Should I assume I won't get an offer?",
    "subreddit": "jobs",
    "timestamp": 1556465389,
    "score": 9,
    "keyword": "european manager"
  },
  {
    "text": "Q&A. Dear HR managers, do you consider a Master's degree or a Graduate Program more valuable when hiring? (both take 2 years) I have to choose between one of the 2 options within a month and I'm having a hard time deciding which would be better for my long term \"employability\". So would you rather hire a manager / employee with a 2-year Master's degree or 2 years of work experience and direct coaching from a large, international, European conglomerate?",
    "title": "Q&A. Dear HR managers, do you consider a Master's degree or a Graduate Program more valuable when hiring? (both take 2 years)",
    "subreddit": "jobs",
    "timestamp": 1547046253,
    "score": 6,
    "keyword": "european manager"
  },
  {
    "text": "Am I eligible for working in luxury business? Where should I start? (Luxury retail, buyer, merchandiser, fashion) Hi guys, \n\nI am recently settled down in the US and trying to figure out what I can do here. \n\nSince I never really worked in the US before, I do not know where to go and where to begin with. \n\nAlso, I currently don’t know anyone who’s in the industry that I used to work for. So, I assume this is the best place to ask in order to gain some information and advice.\n\n&#x200B;\n\nFirst, I guess I have to introduce my self for you to have a better understanding of me and my situation.\n\nI am female, married, and in my early 30’s. I acquired my bachelor and masters degrees from one of the state universities in the US, but as mentioned above, I have never worked in the USA. I started work right after the graduation in my home country, but unlike my major, accounting, I started my career at a department store company and later on, I worked for a few luxury brands, mostly fashion. The total years of my career is in between 5-10yrs. (I won’t discuss the exact amount of years here.) My working positions had been changed overtimes, but they are all somewhat related to each other. And the most recent position that I worked for is a buyer/merchandiser which I really want to continue for my career. \n\n&#x200B;\n\nI now live in one of the popular cities in the states that is not too far from NYC. Speaking of NYC, I am very well aware of that most jobs that are similar to my previous jobs are in NYC, especially for luxury brands. Luckily (I guess?), there are several sports and other fashion related brand headquarters are based in the city that I am living in. But they are not luxury.\n\n&#x200B;\n\nSo, I roughly concluded that I have two choices, for now, one is working as a sales associate for a luxury brand and the other one is working in one of the headquarters that are based in my city. BUT, I don’t know if my anticipations are on point. Although I've been working quite a bit, I don’t expect me to start working as a manager or supervisor. And if I have to, I am willing to start as an entry-level employee. And among two choices, I want to choose the opportunity that will get me to a position that is similar to my previous job, a buyer/merchandiser. YES, I want to end up doing what I did before eventually.\n\nI summarized pros/cons, some details about my situations, and questions regarding two of my plans in the below. It would be really helpful if anyone would give me any advice or related information. \n\n&#x200B;\n\n1. Working as a sales associate (luxury brand):\n\n\\- (+) I feel confident about the luxury industry than other fields. \n\n\\- (+) I think I can gain some good information on the US market and customer behavior\n\n\\- (+) A part-time job is available, so I can start the job with less pressure and commitment.\n\n\\- (-) I don’t have any sales experience. I used to work on the floor when I was working for a department store company. So I, kind of, witnessed everything. And I had to help them whenever it gets really busy and needs some help. But still, no sales experience. \n\n\\- (+) I am bilingual.\n\n\\- (-) My English is not perfect. ( but I believe it will get better over time with some effort :) )\n\n\\- (?) I don’t know if it is the case in the US but back in my home country, there is some sort of invisible boundary between sales & office work. Is it hard to make a transition to office work later on?  Because there is a possibility that I will move to NYC. And I want to make sure working in a boutique is not a negative work experience. \n\n\\- (?) I am also curious about the pay. How much can I make? \n\n&#x200B;\n\n&#x200B;\n\n2. Working in a headquarter (ex. American sports or shoe brand): \n\n\\- (+) I am more comfortable with office work and office environment. \n\n\\- (+ & ?) Maybe I will get pay more?\n\n\\- (+ & ?) Most of the companies are global brand companies and I am bilingual so, maybe, I can have a position that involves with merchandising and global business???\n\n\\- (-) Again, my English is not perfect. ( but I believe it will get better over time with some effort :) )\n\n\\- (?) It seems like there are distinct differences in what employees do for this kind of companies. Because luxury retails are mostly European and involves in importation while sports or shoe companies(available in my city) are a domestic company that involves in manufacturing. Do I get this right? Or no?\n\n\\- (?) I eventually end up in a luxury field. Is it hard to make a transition to the luxury industry?\n\n&#x200B;\n\nThank you so much for reading and your time.",
    "title": "Am I eligible for working in luxury business? Where should I start? (Luxury retail, buyer, merchandiser, fashion)",
    "subreddit": "jobs",
    "timestamp": 1559077665,
    "score": 4,
    "keyword": "european manager"
  },
  {
    "text": "Have I screwed up my career? Hi guys, I am very interested in your thoughts on my career. I am 36 years now.\n\nI have studied industrial engineering and worked for the European Space Industry for 4.5 years in technical procurement and project management. Then I've quit on my own to do a language course in the country of my girlfriend (now ex) and then travel South America in total for 8 months. Afterwards I've had an internal job in one of the big 4 consulting firms for only three months in another city where I still had my own rental apartment that I sublet at that time. After this three months job I moved on to an engineering consulting firm role for 2.5 years, followed by another consulting company for 12 months and then went to Australia to look for a job there. After 3 months of unemployment I found a job that I had for 1.5 years until October last year, due to my dad's surgery and the fact that the visa ended. I am now back in Germany and unemployed for nearly 3.5 months now. I have a few  interviews upcoming so I am kind of optimistic.\n\nThe thing is somehow I have the feeling that it's like a death verdict for companies if people have \"jumped\" from company to company. The industry that I have worked and that is looking for my kind of skills is very conservative and mainly have corporate structures and politics. Although I must admit that the majority of my jobs (4.5 years + 2.5 years + 1.5 years) is not really jumping (in my POV) at least if I compare myself to some other LinkedIn profiles. Anyhow I have some regrets now that I have jumped companies quite a couple times and feel pretty unconfident with it. \n\nTo make it more complicated. My now Australian girlfriend has a job offer from her company in the US and we are asking ourself if it's possible for me to follow her there. That would basically mean I'd need to leave my hopefully soon job again here in Germany to go over and apply in the US only in the case visa will be granted of course.\n\nWhat do you think? How would you handle my current career so far? What would you do if you'd be me?\n\nThanks guys and girls",
    "title": "Have I screwed up my career?",
    "subreddit": "jobs",
    "timestamp": 1549569384,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "I met the love of my life on Reddit. 1 month ago she passed away. This is about my girlfriend Liz. Sorry about the length, but as I hope you understand it is hard for me to leave things unsaid on this. \n\n\nThere are many reasons I want to share this story. Because I hope what she overcame will inspire others. Because of what we went through the final months. But most of all I want to show the world what she meant to me. I am so proud that I got to call her my girlfriend for the short time we had together. Under better circumstances I would have had a lifetime to show my love for her through our relationship and my actions. But with that taken away from me it feels the option left is professing my love as loudly and publicly as possible, so that is what I'll do.\n\n\nShe had an extremely traumatic upbringing, with two schizophrenic parents, with a horribly sick and abusive father who abused her both physically and emotionally. He had singled Liz out to receive the worst treatment as some sort of twisted experiment that went on through her entire upbringing. This impacted her in terrible ways, she didn't leave her house for several years, she never completed high school. She had every reason to make excuses for herself, she was put in a situation nobody should have to overcome.\n\n\nBut despite everything she went through, by sheer force of will and the strength of her character, she managed to get back on her feet. Focusing on her mental and physical health, she went on to become the most hardworking, kind, compassionate and inspiring person I have ever known. In her mid 20s she started pursuing a higher education, and what she managed to accomplish in the little time she was given would be astounding for anyone. When she passed away, she was living out her dream of pursuing a masters degree abroad in Stockholm, that was funded by a scholarship she had been granted due to her exceptional academic and professional performance. \n\n\nWe met from a post on /r/r4r. She was looking for some some European friends before moving. What immediately stood out to me was that we had an unreasonable amount of weird commonalities. She was born in 89. She never got her drivers license. She had a squat rack in her Appartment. She identified as a logical, optimistic, ambivert. She was  diagnosed with ADD. She attempted to learn the piano (mostly unsuccessfully) for about 8 years. She never finished high school but somehow managed to complete a bachelor in computer science when she was 28 with excellent marks.\n\n\nEverything in the paragraph above is true about me as well, and while this is what caught my eye and made me realise I had to reach out, I quickly realised as we started talking that we had a connection that went much deeper than serendipitous commonalities. The way we communicated, the way we think about life, how we approached interacting with others, what we wanted for our future. We are both fiercly independent and happy to be single. I think we were resigned to the very likely possibility that we would never meet anyone who impacted us in such a way that we wanted to share a life together, until we met each other.\n\n\nI would prefer to keep this post focused on the positive. But will explain what happened. Around september last year she became terribly sick. This went on for about 2 month and progressively got worse, and eventually the pain and stress of dealing with this became too much for her. We were never able to get a diagnosis for what we are going through, and while we are still waiting for the final autopsy report, it is possible it will not show anything conclusive.\n\n\nBoth me and her did everything in our power to get help, but we felt like our cries for help mostly fell on deaf ears in the Swedish public health care. The last weekend was especially horrible, where she was first picked up on Thursday by an ambulance and brought to the hospital (sent home) and same again on Friday. The hospital did not treat her well at all. I spent the entire weekend desperately calling/emailing the hospital ward she was in and everything else under the sun trying to get her better treatment, with no success. They refused to give her Nutritional IV or pain killers both which she desperately needed, or to let her see a doctor. I have never felt as powerless in my life. She stayed at this hospital until they finally sent a doctor her way, who just said sometimes we feel things which aren't there and then discharged her.\n\n\nI want to be completely clear that she never wanted to end her life. Anyone who knows her can attest to how she loved being alive. Even in the last few days she seemed very committed to fighting the illness. I can only imagine things built up to a point where the pain got too much, and it seemed like help was never coming, so she couldn't take it anymore. I lived with her for a few weeks taking care of her, but had gone back home to Prague where I live for a doctors appointment. I had a ticket back to Stockholm 2 days later. Had I only gotten a sooner ticket, I know everything would have been different. We were both much stronger together, and I would not have left her again until she was better.\n\n\nMe together with the family plan to report the hospital to the patient protection agency. She believed a big reason why she never got help was because she was alone, a foreigner and a woman. In her last note she hoped that her death could lead to some progress in any of these areas, or better treatment for patients in psychiatric ward, so she hoped we could get media Swedish or otherwise to run a story with this angle. Even towards the end, in so much pain, she still was focused on doing good for others. I'm happy to receive advice here or in PM, but as mentioned I would like to focus on the positive. So I hope people can be inspired by Liz or share their own stories of overcoming adversity, instead of focusing on the horrible things she went through towards the end.\n\nHer reddit accounts were /u/lovelystrange and /u/ezmchill. I'm happy to share this as who she was clearly shines through. So many of her posts are just centred on giving others advice, a compliment, or just anything to make the world a better place. She generally did not like being taken pictures of, but I'm very glad I convinced her to take 1 picture with me in Prague Zoo, which is from first time she visited me: https://imgur.com/a/RfYhOml\n\nFinally I have posted a few other things on reddit relating to this. My commitment to do better to honor her legacy, and I also shared the birthday gift I gave to her, which gives a little peek under the curtain of what I was like in the relationship: https://www.reddit.com/r/dataisbeautiful/comments/af7moj/data_visualisation_of_whatsapp_conversations_i/\n\n\nAnd my commitment to be better: https://www.reddit.com/r/DecidingToBeBetter/comments/af7s3b/i_met_my_girlfriend_the_most_inspiring_person_i/\n\nThank you so much for reading this. \n\nI love you Liz. Goodbye.",
    "title": "I met the love of my life on Reddit. 1 month ago she passed away.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1547301078,
    "score": 551,
    "keyword": "european manager"
  },
  {
    "text": "YSK - about the APP CoPE Paediatric Emergency **I'm not in any way affiliated with the creators.**\n\nI use the original (Danish) version in my daily work, and find it very helpful - just found out that they made a international version, and wanted to share that.\n\n&#x200B;\n\n[Android](https://play.google.com/store/apps/details?id=dk.centic.cope&hl=da)\n\n[iOS](https://itunes.apple.com/no/app/cope-paediatric-emergency/id672878122?mt=8)\n\n&#x200B;\n\n>Copenhagen Paediatric Emergency (CoPE) App is developed with the intent of preparing the clinician in the management of acute life threatening conditions in the paediatric patient population.  \n>  \n>By simply dialing up a weight and age, the corresponding desired guide sheet is displayed by tapping ”OK”.  \n>  \n>CoPE App consists of 31 guide sheets, corresponding to one guide sheet per kilogram bodyweight, ranging from newborn (3 kg) until 10 years of age (33 kg).  \n>  \n>Information on normal physiological values, recommended equipment used during initial A-B-C stabilization, recommended drugs and doses and fluid boli are provided.  \n>  \n>Newborn Life Support and Paediatric Advanced Life Support guidelines from European Resuscitation Council are available for fast reference.  \n>  \n>CoPE is developed by senior consultant paediatric anaesthesiologist Morten Bøttger and senior consultant anaesthesiologist Michael Friis Tvede, Department of Anaesthesia, Centre of Head and Orthopaedics, Rigshospitalet, Copenhagen, Denmark.  \n>  \n>CoPE is an international (English) and updated version of the Danish app Akut Barn",
    "title": "YSK - about the APP CoPE Paediatric Emergency",
    "subreddit": "medicine",
    "timestamp": 1556034482,
    "score": 4,
    "keyword": "european manager"
  },
  {
    "text": "PCV Looking for Ideas and Suggestions Hello everyone, thanks for taking the time to read! Sorry for the wall of text, but I figured I should explain what I'm working with in detail since it's kind of unique.  \n\n\nI am currently serving as a Peace Corps volunteer as an English co-teacher in a small Eastern European country. I work with three host country national teachers. As we come towards the close of our school year we are working hard to make next year even better. So I come to you to see if you can help us with any ideas or techniques with two of our biggest issues. We're really trying to brainstorm things that are innovative and might help our students succeed in class. \n\n&#x200B;\n\n**Cheating** \\- Whoo boy this is a big one. Due to the collectivist nature of the culture here cheating does not have the negative connotation it has to us. It's seen as merely being helpful and a good friend. Imagine any cartoon depiction of cheating - standing up and staring over someone's shoulder, texting answers, moving seats in the middle to sit next to the high performer, throwing balls of paper with notes, writing answers on desks - we have it all. I'm really confused on this because students know that they will almost certainly pass the class - the points are on a ten point scale but I've never seen anyone get below a 5 - so there really shouldn't be a super big incentive to cheat. But it's pretty much inevitable. I've tried to logic it out with the students who are giving away answers (our best students) by explaining that they're really degrading the value of their own good score. I've tried explaining I would rather have someone fail genuinely on their own than get a 10 by cheating. It just doesn't seem to matter. We even had parents call to complain that we don't let the students cheat *enough* in one of our classes. This year I didn't feel super comfortable taking the lead on this since it was my first year, but next year I'd really like to try to nip this in the bud. (Naturally I understand it will be difficult since cheating will continue to be reinforced in every other class). Some brainstorm ideas I've had is a three strikes policy where on the third warning a test is taken away, giving the person giving away the answers a 0 and the receiver a 10, or allowing students to bring in a notecard with notes which they can use during the test, but if there's any talking or cheating the test is taken away immediately. Do you have any great ideas of how to curb cheating or disincentivize it?  \n\n\n**Classroom management** \\- This is an big issue in all classes, but especially with grades 4-6. We have issues with students calling out answers, shouting over the class, students being physical with each other, and generally being disruptive. These issues are made even more difficult because we have a wide range of abilities in each class. Some students attend private tutoring which means they're basically fluent in English, while others are still struggling with basics like letter recognition and sentence construction.  Some of these students are so checked out from class they refuse to bring their books and basically chill for class unless we make copies of the pages for them and work one on one with them. We are attempting to differentiate lessons, but certainly this does not happen for every lesson in each class due to outside constraints. In 4th and 5th grade we attempted a student of the month program and gave students daily points for preparation, participation, homework, and behavior. It went fair in the beginning, but the kids seem to be less interested and point totals are falling (despite individual prizes for student of the month and most improved, as well as a whole class movie day if the class gets 50% of the points possible) - we had one student earn 1 point in all of May. In some classes it's a 45 minute full body exercise, and by the end both my counterpart and I are exhausted and most of the kids have learned next to nothing. 4th grade and the first semester of fifth grade there are NO grades per national rules. There is no real discipline within school other than sending students to a type of resource officer who gives them a lecture and brings them back to class. Administration is unlikely to do anything strong because they do not want to upset the student's parent and have the parent take their business elsewhere. So any classroom management system or strategy will likely have to be a type of positive behavior system.   \n\n\nSo basically, tl;dr: hit me with your best ideas to minimize cheating and behavior issues outside of America and thanks so much",
    "title": "PCV Looking for Ideas and Suggestions",
    "subreddit": "Teachers",
    "timestamp": 1559675025,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Too many interests, too few time...which career path/jobs would suit for a person like me? Hi everyone...I'm not American but European (NOT UK NOR GERMANY), so maybe my job market may be a little different...but I'm interested in every answer!\n\nI posted a very long post last week, but now I tried to make it shorter\n\nI'm a very confused and indecisive person (currently studying business), as I have plenty of things that I'm interested in, but unfortunately I cannot try all of them, and can't decide the one I wanna do...I can only choose one or two...and maybe I won't be actually good to the one I choose\n\nMy TRUE dream is to work in the media/showbiz someway (not as an accountant, payroll or smth like that) inspiring people with communication and information trough movies and The internet...I got some \"messages\" to convey...but I need to find a stable job first and Idk if I could really fit in that super competitive and unstable world\n\n\n\n#Here is something about me\n\nSkills and Cons\n\n\n> • _Observing people and Listening, to people's problems, understanding when something is wrong and what someone thinks quite easily, linking behaviours to experiences and \"environment\"_\n\n\n\n> • _Overthinking and Relying on Data and experiences to make the best choices...I actually like relying on Data and Statistics_\n\n\n\n> • _Planning (also event planning) and finding and elaborate strategies (even business ones) before action\n\n\n\n> • _Curiosity: Asking tons of questions...I like Q&As and surveys_\n\n\n\n> _LOVE Talking and Debating (or be a part of a debate), expecially about social topics (suicide, unemployement, economics, enviornment) and mass media; I would talk for hours_\n\n> • _Sensitive and emphatetic, and I'd like to make people emphatize with all the overlooked and depressed people, or at least, I would like to made them feel not alone_\n\n\n> _• Storyteller at heart, I'd love to tell something trough movies and cartoons, nowdays one expecially, analyzing and how they tell people awesome and relatable stories inspiring (I don't want to draw, but to write)_\n\n\n> • _Creative and Immaginative person_ \n\n> _• Aesthetic sense, as I always try to beautify things and people, trying to find the best and most appealing qualities!_\n\n> _• Using Photography (Including food styling and room design) and Film/Videos, my favourite form of art! I find beauty and the essence of things with them_\n\n> • _Big picture person, Finding the \"hidden connections\" behind things completely unrelated to each other_\n\n\n> _• Open Minded and innovative_\n\n\n> _• Future \"forecasting\", I usualy make lots of predictions that turn out true, after studying and observing situations_\n\n\n> _• Diplomacy: I always try to listen and understand both parts_ \n\n> _• Passion about the things I love and love to do...If I'm doing something I enjoy I could work for it even during the whole night without stopping_\n\n> _• Deep and phylosophical thinking_\n\n~\n\n#Now some that are definitely CONs\n\n\n• Laziness\n\n• Not very good with manual work...I'm VERY clumsy\n\n• I hate routine and \"old fashined\" jobs!\n\n• Squishy and I don't love to get my hands too dirty\n\n• Fragile and anxious. I don't like being around too many people, expecially tough/macho or cynical/careless people; I hate fights\n\n• Giving up and pessimism: I am almost unable to do a things I hate and I tend to get depressed and demotivated really easily when I fail multiple times...I can work on this tho\n\n#Finally\n\n• Caring a lot about my Wealth and money, and about having a job that can pay me well on the long run...so I need a good job where I can use those \"\"skills\"\" I listed above, trying to work on the Cons\n\nOh...also\n\n• Not very good at theoretical Math and at super complex calculations and formulas\n\nI'm good with excercises and analysis, but I don't think I'll enjoy a job where I would use hig level Math everyday...like very HIG level; I like more to write and to combine words with numers than using just letters and numbers\n\n\nSo, as I said I've got many things I like, but I'm currently studying business, but I don't know if I have to change or not; \n\n#Here are some ot the things I considered:\n\n\n》 Computer Science: I love videogames (game design and world building/characters) and Apps...are there other ways I can work in the industry or give my contribute? \n\n\n》 Physics/Astronomy: I love Space I tought about studying physics to understand it more along with understanding how our whole universe works!\n\n》 Biotecgnology/Biochem: expecially for Food/perfume chemistry, I'd love to make one or to understand what's behind them.\n\n》 Management Engineering or Biomedical one...mostly for the money tho, and because it's easier (Management) than other engineerings (In MY country...idk in other ones)\n\n》 Medicine: it really come close to neuroscience, and there are also part of it I'd like to explore, like biology, medical physics, legal medicine, statistic medicine...I know I'm squishy, but at least there, I can work on that\n\n》 Psychology: I think this doesn't need a presentation...I love observing and understanding people\n\n》 Communication/Mass Media: I tought about going to a film school, but my Counry doesn't have them and I'm noy interested in Film STUDIES...going to an international one looks impossible, so with Communication being a wider field \n\n》 Switching to Economics\n\n》 Statistics\n\n》 Design: I love animation, but I don't love to draw thousands of pages, more like: writing a show...but this could teach me something\n\n~\n\nBasing on what the things I told about me, \n\n• Which of theese do you think I should scrap or rely to an hobby? \n\n• Which one do you think suits my being most? \n\n• What job overall I may be more suited for? \n\n• Could I be suited to work in mass media/showbiz given all those informations?\n\nI was Thinking about...\n\n\n#Neuroeconomics/marketing\n\nI love society, statistics data and Psychology...I'd love to use psychology but reach many more people out there....understand, cure them on a bigger picture! But idk about THIS Path\n\nBut maybe there is a path Not involving psychology I could fit in more...psychology is not very lucrative where I live, even with a Master\n\nThe best thing is to learn from people knowing about the \"careers-world\" and how the market works, what I'm not suited for and where I could do an actually good job...that's why I'm asking\n\n\nThanks a lot! (And please, don't be harsh...)",
    "title": "Too many interests, too few time...which career path/jobs would suit for a person like me?",
    "subreddit": "careerguidance",
    "timestamp": 1575728030,
    "score": 10,
    "keyword": "european manager"
  },
  {
    "text": "How do I bounce back from career failure and burnout? This might be a long post but I think just writing it down will be cathartic for me..\n\nI'm a 28 year old who works in supply chain.  My division of my company was bought out by private equity who are spinning it off as a standalone.  Before the sale and even more so after the sale (and me deciding to move along with the new company) I have proven myself as a rising star, steadily getting promoted and given more and more responsibility.\n\nLast year I assisted (assisted, not led) in a major transformational project for Canada.  It was a success and given my track record, I was brought to Europe to completely lead the same project for the entire European business.\n\nI knew compared to Canada, Europe would be immensely more complex, and on top of that, I was to lead the project myself.\n\nIt started off okay.  50 hour work weeks, but I was managing.  I even met and started dating someone over here.  There were even talks about me being invited to stay in Europe on a more permanent basis, which I was extremely interested in.\n\nThen, slowly as the months passed (the total project is supposed to be 5 months leading up to transition date + 1 month of support after), things have gotten worse.  My manager, who is leading the project on a global level has been supportive and encouraged me to delegate more responsibility.  Unfortunately, I did not take this advice, and as we are less than a month from the transition date, it has become apparent that due to my lack of protectiveness, and ability to delegate, instead of doing one or two major tasks well, I have tried to manage dozens of tasks poorly.  I am very worried this project will be a failure.\n\nThis fear coupled with the crazy hours has gotten me to the point where I am reliant on sleeping pills to sleep through the night, and even so I still wake in the night in a cold sweat.  I excuse myself to the bathroom at least twice a day to cry.  I either don't eat because I have no appetite, or when I do, I end up gorging myself to the point I throw up.\n\nMy boss and the rest of my team have seen the writing on the wall and have been trying to be helpful and supportive of me, but it's too late.  I am burnt out.  Last night I got a stomach bug, and instead of saying I will work from home, I literally just shut down.  I texted my boss and told him I wouldn't be coming in today.  It's 9:20pm as I write this, and I haven't left my bed all day except to go to the bathroom.\n\nMy boss called me in the afternoon to be as supportive as he could, and basically took everything off of my plate and told me to rest up and come back recharged next week.  But I think the damage has been done.  I think this project will fail, and even though I can trust my direct team, others will be quick to point out that I was supposed to manage this project, and less than a month before tthe transition, I melted down.\n\nSo on top of being in the middle of an epic burnout, I think I will have tarnished my reputation with my company which had been so stellar before.  I doubt I will be asked to stay here in Europe which add personal pain on top of everything, as I really wanted to stay here for a few years.\n\nWhat can I do?  I know that I will have this as a learning experience, but that's not helping me with the panic attack I'm having now.  Even after I am phsyically and mentally sound again, what can I do to salvage my career?",
    "title": "How do I bounce back from career failure and burnout?",
    "subreddit": "careerguidance",
    "timestamp": 1576010149,
    "score": 10,
    "keyword": "european manager"
  },
  {
    "text": "I am an expat with experiences. Am I eligible for working in luxury business? Where should I start? Hi guys,\n\nI am recently settled down in the US and trying to figure out what I can do here.\n\nSince I never really worked in the US before, I do not know where to go and where to begin with.\n\nAlso, I currently don’t know anyone who’s in the industry that I used to work for. So, I assume this is the best place to ask in order to gain some information and advice.\n\n&#x200B;\n\nFirst, I guess I have to introduce my self for you to have a better understanding of me and my situation.\n\nI am female, married, and in my early 30’s. I acquired my bachelor and masters degrees from one of the state universities in the US, but as mentioned above, I have never worked in the USA. I started work right after the graduation in my home country, but unlike my major, accounting, I started my career at a department store company and later on, I worked for a few luxury brands, mostly fashion. The total years of my career is in between 5-10yrs. (I won’t discuss the exact amount of years here.) My working positions had been changed overtimes, but they are all somewhat related to each other. And the most recent position that I worked for is a buyer/merchandiser which I really want to continue for my career.\n\n&#x200B;\n\nI now live in one of the popular cities in the states that is not too far from NYC. Speaking of NYC, I am very well aware of that most jobs that are similar to my previous jobs are in NYC, especially for luxury brands. Luckily (I guess?), there are several sports and other fashion related brand headquarters are based in the city that I am living in. But they are not luxury.\n\n&#x200B;\n\nSo, I roughly concluded that I have two choices, for now, one is working as a sales associate for a luxury brand and the other one is working in one of the headquarters that are based in my city. BUT, I don’t know if my anticipations are on point. Although I've been working quite a bit, I don’t expect me to start working as a manager or supervisor. And if I have to, I am willing to start as an entry-level employee. And among two choices, I want to choose the opportunity that will get me to a position that is similar to my previous job, a buyer/merchandiser. YES, I want to end up doing what I did before eventually.\n\nI summarized pros/cons, some details about my situations, and questions regarding two of my plans in the below. It would be really helpful if anyone would give me any advice or related information.\n\n&#x200B;\n\n&#x200B;\n\n1. Working as a sales associate (luxury brand):\n\n\\- (+) I feel confident about the luxury industry than other fields.\n\n\\- (+) I think I can gain some good information on the US market and customer behavior\n\n\\- (+) A part-time job is available, so I can start the job with less pressure and commitment.\n\n\\- (-) I don’t have any sales experience. I used to work on the floor when I was working for a department store company. So I, kind of, witnessed everything. And I had to help them whenever it gets really busy and needs some help. But still, no sales experience.\n\n\\- (+) I am bilingual.\n\n\\- (-) My English is not perfect. ( but I believe it will get better over time with some effort :) )\n\n\\- (?) I don’t know if it is the case in the US but back in my home country, there is some sort of invisible boundary between sales & office work. Is it hard to make a transition to office work later on? Because there is a possibility that I will move to NYC. And I want to make sure working in a boutique is not a negative work experience.\n\n\\- (?) I am also curious about the pay. How much can I make?\n\n&#x200B;\n\n&#x200B;\n\n2. Working in a headquarter (ex. American sports or shoe brand):\n\n\\- (+) I am more comfortable with office work and office environment.\n\n\\- (+ & ?) Maybe I will get paid more?\n\n\\- (+ & ?) Most of the companies are global brand companies and I am bilingual so, maybe, I can have a position that involves with merchandising and global business???\n\n\\- (-) Again, my English is not perfect. ( but I believe it will get better over time with some effort :) )\n\n\\- (?) It seems like there are distinct differences in what employees do for this kind of companies. Because luxury retails are mostly European and involves in importation while sports or shoe companies(available in my city) are a domestic company that involves in manufacturing. Do I get this right? Or no?\n\n\\- (?) I eventually end up in a luxury field. Is it hard to make a transition to the luxury industry?\n\n&#x200B;\n\nThank you so much for reading and your time.",
    "title": "I am an expat with experiences. Am I eligible for working in luxury business? Where should I start?",
    "subreddit": "careerguidance",
    "timestamp": 1559089950,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "What are my options as a soon to be Econ graduate? Hi!\n\nI failed out of uni at the very last semester, however, over the last few months things have taken a turn, and after appealing, I was granted another chance at my last and final exam...meaning I should be (hopefully) graduating in a couple of months!!!\n\nI wanted to ask your opinion regarding options after graduating. My course name is Business Economics & IT.\n\nI have a pretty big passion for Finance - is there a specific plan of action for a career in Finance? Would a Masters degree benefit me at all?\n\n&#x200B;\n\nI have some work experience (more than what I'd say the average 22 year old has):\n\nwaiter ---> restaurant manager ---> Project Support Officer ---> Business Support Officer.\n\nFor the past year I have been teaching English, which I believe doesn't add all that much towards attaining a career in Finance. Another hurdle towards this dream of mine is the fact that I am not a US citizen - I am currently based in Brazil, however I am able to work in the EU as I have a European Passport. If it matters, my degree and work experience were attained all in Europe.\n\nAny help and advice would be greatly appreciated.",
    "title": "What are my options as a soon to be Econ graduate?",
    "subreddit": "careerguidance",
    "timestamp": 1573623085,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Any advice on both: transitioning from a large public corporation to a smaller privately owned company and; transitioning from an individual contributor leadership role to a Manager of People leadership role? The corporation I work for presently has a market share of about $14B, while the opco that I specifically work in does roughly $185M annually. The new company I'm considering does $5M annually at the local level - I don't have figures yet for the overall global business, but I imagine it's in the 10's of millions, not hundreds.\n\nAlso, my current position is Product Manager, and I'm responsible for half of the product lines that our opco offers. I have a fairly wide set of responsibilities, a lot of autonomy, and for the most part I am regarded as a leader within the organization: I make decisions regarding pricing, acceptable product margins, and help to resolve day-to-day issues to keep the business running. In my current role, I do not have any direct reports.\n\nThe role I am considering is Operations Manager - I would be responsible for an office of 7 people, including two engineers. This office is the sole American office for a european company. As I mentioned, the US office does roughly $5M in annual revenue. The total number of employees globally is around 150, whereas we have a few thousand at my current company.\n\nSo here's my question: being young (31), do you have any advice for transitioning into this new role? Do you have any advice you wish you had gotten when you made a similar transition yourself? Can you point out any possible blind spots I should be aware of?",
    "title": "Any advice on both: transitioning from a large public corporation to a smaller privately owned company and; transitioning from an individual contributor leadership role to a Manager of People leadership role?",
    "subreddit": "careerguidance",
    "timestamp": 1560970019,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "I'm doing an engineering PhD, that is not really working out. I'm not thinking about quitting, but I'd like to prepare myself for a more business career after it. Some advice? TL;DR Doing a PhD, not working out great. Want to prepare myself for a career in a business side and eventually an MBA. Are there skills or course suggestions I can do to be a more standout candidate?\n\n&#x200B;\n\nWell, I'm a 25M, I'm finishing my second year of PhD (it is 2 to 3 years here) and I'm looking to make the move out of academia as soon as possible.\n\nThings up to now have been a bit messy. I wasn't looking for a PhD to begin with, I finished my masters, in Nanotechnology Engineering after doing my bachelors in Material Science Engineering.\n\nFor my masters internship I was in a research institute and some months before finishing it, my boss (now head of department of the institute) offered me a position. In this country, in Europe, PhD are relatively well paid, and from what I searched, it could be good for me to have the degree, from my research in Germany or other European countries, even for industries it is highly valuated a PhD. I accepted it, arranging with my supervisor that it'd be a very piratical focused PhD, with the development of sensors and not focused on the materials understanding and the theoretical parts.\n\nIt started out fairly well, I continued my internship job and wrote a paper about it.\n\nThen I started working on my main theme, developing a gas sensor, using some thin films. Since then things got a lot more complicated. I use a machine, a prototype developed with the institute and a company, to deposit the material I use. This machine over the last year and half has been working around 2 months. It is very though for me to develop my work with this kind of problems. I'm not responsible for the machine in any way.\n\nMy first CET went fine, i was able to show some response of the sensors and all, but I haven't progressed almost anything since, besides some parallel jobs, that my supervisor indicated me. I also feel that he is always too busy, since he got promoted.\n\nI'll soon have my second CET and while my supervisor tells me he is fine with my work, I doubt the rest of the committee will be, since I have made very little piratical progression and I hate the theoretical work.\n\nWith this in mind of course, I want to move out of academia as soon as possible, my first scenario (best), would be to finish my PhD and along the way gather some skills that will help me land a job in an industry. The alternative will be if I'm not able to continue it, to find a job, here I'm not sure if my 2 years experience as a PhD candidate will help me anything or will really work against me.\n\nI think I'd like to move into a business career, if possible a combination with my engineering background. I'm thinking of doing an MBA afterwards.\n\nThe thing is, my resume is very basic, and I think I won't be a decent candidate. I started my PhD right after my masters and my CV is just that, besides 2 internships for companies while I was in the university (mandatory)\n\n Which skills do you think I can gather, for example I'm thinking about some summer schools in international business or finances, in good universities, can this help me stand out for the future? \n\nI also tried applying to a couple of trainee positions, that I think would be suitable for me, for example in Volkswagen group, where you can go through several departments and they train you to be a future manager, but was never called.",
    "title": "I'm doing an engineering PhD, that is not really working out. I'm not thinking about quitting, but I'd like to prepare myself for a more business career after it. Some advice?",
    "subreddit": "careerguidance",
    "timestamp": 1569842751,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "I have a stable job that I love but got (what I think is) an even better offer. Should I quit? \\[throwaway account\\]\n\n&#x200B;\n\nTL;DR -- I have a stable job that I love, but I got (what I think is) an even better offer with a more challenging environment and more opportunities. Not sure if I want to quit because I'd feel incredibly guilty since my current company has invested a lot in me and I'm to be a father in a few months. On the other hand the offer I was made is very hard to resist.\n\n&#x200B;\n\nHi! I'm in the following situation:\n\n&#x200B;\n\nI am a UX designer at a small software company with great pay, great people, walking distance from home. I'm very appreciated by my managers, they have invested in me and my ideas (got sent to a conferences, they recently purchased an expensive service that will help us improve our products just because I pushed for it).\n\n&#x200B;\n\nI have two issues, however:\n\n&#x200B;\n\n1.  I feel like some of the people that I have to work with daily are sort of inert and unmotivated (to work, to improve their skills, to use more up-to-date tools, etc)\n2.  The company culture is to almost always copy our competitors' products, without risking any original ideas. We sometimes do this to the point where things start to look a little scamy.\n\n\\--\n\nI just got an offer from a large multinational company. The work seems quite interesting, though very different compared to what I do now. The people I might work with there seem to be overall better professionals. They pay just as great, with a lot more benefits. \n\n\\--\n\n&#x200B;\n\nIf I quit my current job, I feel like I'd let some people down, and my managers will be very mad (\"we got you anything you asked for, and now you quit?\" type of situation). Me and my girlfriend are also expecting a baby in a few months, so probably not the best time to rock the boat even a little bit. \n\n&#x200B;\n\nOn the other hand the large company can potentially offer me \\*a lot\\* more in terms of career growth and a much more challenging environment. Also, I live in a European capital and I won't get a lot more opportunities like this one.\n\n&#x200B;\n\nAny thoughts? What should I do?\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
    "title": "I have a stable job that I love but got (what I think is) an even better offer. Should I quit?",
    "subreddit": "careerguidance",
    "timestamp": 1548345657,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "How to deal with managers that make your life hard even if you truly love your job Hello everyone,\n\nI would like to apologize because this is a throwaway account, but i truly need to get something off my chest.\n\nSo I work in the corporate world as an engineer in a rare niche sector of engineering. Natural gas, my job is to not make things go boom by doing some very precise work for gas processing plants.\n\nThis detail is only important because I want to emphasize that this kind of job is hard to find in this area of expertise and that's why it one of a kind and fun and interesting and so on...\n\nThe problem is, corruption, and it is not a joke when they say it is spreading like wildfire.   \n\nBeing an European and working in an EU office, in an American company, top management is obviously American but all bellow the hierarchy are locals and that is a big problem here, I will explain why.\n\nNepotism or hiring an acquaintance is very common and their are very open about this with no shame and no consequences and it seems no one cares as long as results are being produced. My direct manager is a woman my age with less experience in this field which found herself in a position of managing a team, basically overnight, only because she is the sister in-law of the operations manager. She is out of her league in every way, clueless and not even trying to understand anything...everyone around her is just a tool to build her resume and even if anyone says something or does something to point out a mistake she has the full backing of upper management.\n\nI am really at a loss for this, I don't know what to do. She is careful in making any mistake just because she avoids a straight answer, even the emails are carefully written in the sense that everything is a \"suggestion\" or you need to consult this, read that, talk to this person... the decision falls only on the person who she is relaying a half-order. In case it is executed well she takes credit but in case it is not the other person does.\n\nWe're about 20 engineers and 4 of them just quit, could not deal with the bullshit anymore. While others they became indifferent to the work, which is also affecting everyone because it was nice to speak with someone that had the same enthusiasm about problem solving and engineering work as you did. Now they just cant be bothered, it's just a do the work \"yes sir\" or \"consider it done\" attitude with minimum effort and I cant blame them.\n\nDue to circumstances about my living conditions, living in this town with my wife I truly have nowhere else to go unless I switch roles, but a new role would mean a start from 0 and all of years would be for nothing because my applied skills are no match in any other industry of engineering (well, like 90%).\n\nI refuse to believe that I'm powerless in this situation, what can I do? Has anyone dealt with this before before the \"\\*\\*\\* this shit I'm out\" attitude kicked in ?\n\nWonderful job, amazing projects, I feel like I'm making the world greener by learning about implemented new techs in these old polluting factories... I really dont want to call it quits.\n\nLooking forward to any kind of reply.",
    "title": "How to deal with managers that make your life hard even if you truly love your job",
    "subreddit": "cscareerquestions",
    "timestamp": 1557822437,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Is experience with scalability the most important expertise to cultivate for a backend dev? I have applied for Elixir backend developer jobs (in Europe) and now have several options. I'd like to lay out the situation below and I'd appreciate advice on which option to take:\n\n&#x200B;\n\nOne company is a startup-style spinoff fully owned by a listed company in a traditional industry. They offer generous benefits and slightly fewer working hours (and definitely no overtime), but the pay is slightly less. However, they offered me a mid-level position so the pay is still decent IMO. Online reviews about the company are really positive, and the team was nice. However, my biggest concern is that, since they focus on B2B software instead of consumer-facing software, their systems don't get a lot of traffic and don't really have a lot of scalability challenges. I wonder if my future career as a backend dev would be heavily impacted if I don't accumulate enough experience in this area (I'm still in a relatively early stage of my career).\n\n&#x200B;\n\nThe other several options are all consumer-facing startups with huge amounts of traffic to handle. Scalability/availability is definitely a central challenge to them. However, the benefits, work-life balance and stability cannot match those offered by the first company. They also don't necessarily offer much greater monetary rewards, which seems to be usual for European startups.\n\n&#x200B;\n\nI wonder if experience with high scalability/availability systems is the most important aspect for my future career development. Or, maybe if I intend to go towards a managerial/team lead type of role, experience with project management etc. will actually be more important?\n\n&#x200B;\n\nIt seems to me that the methodologies in some startups are not that well-developed yet, and they have a \"just get things done no matter what\" mentality, which might make things become a bit chaotic. They also don't necessarily have clear career progression options.\n\n&#x200B;\n\nI wonder if work-life balance is really that important. Should I choose a more \"difficult\" job when I'm still young, even though I might have to work more? Or is this a dangerous mentality to take (especially when there's not necessarily more monetary reward associated with it)? I've heard a lot of stories about burnouts.\n\n&#x200B;\n\nMy concerns about the first company though are, as stated, that I don't accumulate enough experience with large scale systems, leading me to an awkward and eventually obsolete position as I grow older.",
    "title": "Is experience with scalability the most important expertise to cultivate for a backend dev?",
    "subreddit": "cscareerquestions",
    "timestamp": 1551212594,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Resign or get fired as developer? Hello,\n\n&#x200B;\n\nThis might not be the first time someone asks this... I dont feel my case is special but due the overwhelming situation I thought about to take a second opinion... no better place than the internet to advice you, right?\n\n&#x200B;\n\nMy story...I moved from other country (USA) while I was working for an American IT giant ... came to work to a smaller company that offered me more freedom and I was going to \"touch\" more things than in well structured companies (pipelines, decisions about infrastructure, arquitectures, so on...)\n\n&#x200B;\n\nLong story made short...  I was not able to fit in the team due I wanted to implement some things that according my experience would be better, faster and nicer...  but I never enforced anyone, only propossed. And made the mistake to comment about some spaghetti solutions (made by the senior developers)... \n\n&#x200B;\n\nSolutions like:\n\nif true = false\n\nreturn true;\n\n&#x200B;\n\nEvery time I talk with my manager where he asked how my on boarding was going on... I was surprised due I basically had no on boarding, I thought this might be normal since American companies have different on boarding (with documentation, team meetings and people explaining you how things work) and this company (Im in Europe now) is not like that..\n\n&#x200B;\n\nMy manager is not close of the team, is not present in the slack channel where we discuss and have our \"stand up\" meeting... or planning or anything, basically he gets the feedback from my teammates. (which at that point I didnt know)\n\n&#x200B;\n\nWell, things went from bad to worse and 2 months after start he said will downgrade my salary since I was not what they expected, I ask too much and often require more time (I was the only one making QA at that time) since we dont have QA and few tests ... I was just afraid to release a bug and took my time... people told me is not necessary because after launch to production we can check logs and if something is wrong we can rollback.... (not my way of work). So, i got a smaller paycheck and i continue with my life...\n\n&#x200B;\n\nCame some next projects and all went fine, later again I had to work with a guy (who was my team lead and I didnt know due my terrible onboarding) he asked me to do some library to convert some information and he will save it later in other service... I made it but made extra work than expected (some information was supposed to be avoided, I didnt know, I was new in the project) ... still I think was easy just to ignore the rest...\n\n&#x200B;\n\nThen my manager came with the new that it was terrible and I was on probation time due performance... for 3 weeks.\n\n&#x200B;\n\nI passed those 3 weeks fine and later he said will go on probation for another month  because he believed I had 3 weeks of \"luck\" .\n\n&#x200B;\n\nThe funny thing is that I first I used to received comments like \"this is an overkill\" this is \"a bad practice\" this is \"time consuming\" , \"what is this technology? we dont use it\" ... but on last months those \"overkills\" seems to be the \"best practice\" and those bad practices are \"the good practices\" now...  and of course, my \"team lead\" made it official through a document...\n\n&#x200B;\n\nI am not saying he felt I was going after his position because no, I am not that good in know about the whole company process like him .. actually Im far away, but seems to me this was very ridiculous...\n\n&#x200B;\n\nCame my last one on one with my manager and he said it was clear team don't want me and he will take decision after his holidays (that is in 2 weeks, April 29th... for me is a clear fired signal\n\n&#x200B;\n\nThe good part: I already signed other job to start in June\n\nThe bad part: would be my first time I get fired  while I am used to do a great job and have great performance\n\n&#x200B;\n\nSo, here is the situation, if I quit, I will stay until 15 of May (then take 15 days of paid holidays) and start my new job.\n\n&#x200B;\n\nIf I get fired I get 3 months (and I believe plus holidays) of salary and I stay one month of holidays (or I could even start earlier my other job since they are waiting for me already)\n\n&#x200B;\n\nBut leaving in that way is a big stigma (at least in the USA) and Im not sure how good will look at my C.V. to be fired, plus the references and other possible future problems I can see...\n\n&#x200B;\n\nI know this is my fault but I also feel is not 100%, for that reason I am sometimes planning to get fired just to make the company pay, but in other hand, it feels bad to end up like this...\n\n&#x200B;\n\nWhat would be the best from the IT perspective? from European employers? or for my career?",
    "title": "Resign or get fired as developer?",
    "subreddit": "cscareerquestions",
    "timestamp": 1555313394,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "My superior is leaving, I need help to decide what is the best thing for me to do. Hello reddit users,\n\nI'm 25 years old, I live in an East European country and work as a software developer, I have  two and a half years of experience. I have graduated college last year, the study program was Economic Informatics (I hope I got this right in english).\n\nAt work, I'm part of a two members team, it's basically me and my direct superior. We work for a Western European company, they are some kind of bosses and clients at the same time.\n\nThe other member of the team is my superior, a very smart woman, with 5-6 years of experience. She talks a lot with our clients from the other company. In the last year I think she did more analysis than development for our projects. She gives me every development task if I'm not too busy and if the task is not too hard. I'm more than fine with this even though sometimes I have a lot of work to do.\n\nThe problems begin here, she is leaving in one and a half month for medical reasons. She told me that they (our superiors) will leave me in charge of all our projects and will give me a new employeer to help me (he is currently in training).\n\nMy superior (the one that is leaving) began the \"transfer knowladge\", from her to me, and there is a lot to take in. I don't think I'm good enough to fill her shoes. Our project manager and our IT manager didn't told me anything about this, which I find extremly wierd. My guess is that they do not want to hire a senior, to take her place, or they just can't find one so I'm the only option.\n\nThe part that I'm most affraid of is talking to the clients from the Western company, they speak only their native language (not english) and I can barely understand them. We sometimes talk via mail and in some cases I have to ask my superior to help me with the translation. My superior started to add me in her conferences with them, I only say \"Hi!\" and \"Good bye!\", for the rest of the call I listen and try to understand what are they talking. I feel bad after the calls because I can't understand all they are saying.\n\nOther scarry part is the analysis that my superior does for our clients, as I said, she is very smart and does this things well and quickly. I can't do the things she does for them.\n\nOur superios and client can be very mean and passive-aggresive with the employees if the projects are not going well. I know it happend to other colleagues, I don't want it to happen to me too.\n\nWhat do you think I should do? Should I tell them I'm not capable to take her place? They may fire me for this but maybe they will bring another person to replace her.\n\nShould I start looking for another job? If I do this, what will happen with all our projects when we both leave? I don't really want to leave this job but I feel like it will happen one way or the other.\n\nShould I stay and try to do well in her place, ask for a raise if I can handle the things or wait to get fired and \"bullied\" if not?\n\nI want to add that I'm sometimes depressed and get really sad if the things are not OK at work.\n\nEnglish is not my native language, please excuse my grammar mistakes.\n\nThanks for reading this, any response will be appreciated and I'll try to answer to any comment. Have a wonderfull day!\n\nTL:DR: My superior is leaving soon, she wants me to take her place. I'm not ready to replace her, should I stay and try or start looking for another job?",
    "title": "My superior is leaving, I need help to decide what is the best thing for me to do.",
    "subreddit": "cscareerquestions",
    "timestamp": 1552810799,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Stay to gain experience or leave and hope for better management? After close to 5 years in a big consumer electronics company (european), I have found myself at a dilemma, that might end up with me leaving the company.\n\nThe situation is as follows - there's a few angles to this:\n\n\\- Neither my closest manager (software team lead) nor I are what you call \"people persons\". So the by-weekly 30 minute 1-1 meetings are pretty awkward. It shows at different situations too, but that's the gist. \n\n\\- Upper management is always pushing to get any new product to market waaaay sooner than us - the engineers - estimate it will be even remotely possible. (Release date stays the same while features get cut - or overtime will be necessary)\n\n\\- My colleagues are great and some may be considered good friends. They seem to agree on the hopeless planning from Upper management as mentioned before.\n\n\\- Very recently a new project got started that will introduce an entirely new platform and technology at the company. In a week or so I will be transferred to this project. I have been wanting to work with this platform for a couple of years now. I have even started to look for positions outside the company that works with this platform - with no luck so far. I have no professional experience with it yet, but I'm really eager to get my hands on it. \n\nSo the question is really:\n\nShould I stay and gain experience with this platform and endure the state of project management or should I intensify my search for a position at another company that has this platform established and try my luck with my limited experience?",
    "title": "Stay to gain experience or leave and hope for better management?",
    "subreddit": "cscareerquestions",
    "timestamp": 1573842923,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "How find a job with relocation package as a very young programmer? Hi\n\nLet's start this with a brief description of my background:\n\nI started learning web development when I was 9 and about a year after that I also started working as a freelancer since no one would hire a 10 year old kid for their company. Since I live in a country that doesn't have any rules for legal age of workers, I got my first full-time job as a sole back-end developer at a average startup when I was 13. Back then I was qualified enough to refactor the whole API of an online therapy platform that included a video/voice chat system, transaction management and other related stuff. I was the only server-side developer that they had at that time so I had to take care of everything by myself and also train 2 juniors one for frontend team and one for backend to help me. Then I quit that job when I was 16 and started working remotely for a company in a western European country as a system engineer. I'm still working for that company and my daily tasks include helping maintaining projects like Docker and Kubernetes and etc. I'm not really good in CS because I never went to college and dropped out of high school. I only learned what I needed to get things done in my job. I have good amount of knowledge in infrastructure and backend engineering and have worked on projects from companies like Google.\n\nBut my problem is since I'm 18 rn, no company would hire me and those who don't know my age, think I'm not qualified enough for roles like backend development even the junior positions. But I'm only 18 and I've already managed teams that were made of around 10 engineers who all had bachelor's or master degrees.\n\nAnd the only reason that I started working at that young age was to make some money from doing what I love and spend most of time doing it and also have a chance to get the hell out of my country and start a better life out of here. I can't move to anywhere except some European countries like Netherlands because most of the countries either don't give work permit to people without high education or people from my country (because of issues between our awful government with US and most of the other countries)\n\nI only can move out of my country til the next month and a week so I'm spending most of my time applying for companies and receiving the rejection replies. Can anyone give me any hints so I can find a better way to get my life together, land a job and move out of here? I'm so depressed because of the recent events and the situation in my country is getting worse everyday. I'm super scared that I miss my last chance and be forced to stay here for the rest of my life.\n\n&#x200B;\n\nCC <Mods>: I know that this post might not be that related to this subreddit, so I would be really thankful if you could point me to the right subreddit before closing this post.",
    "title": "How find a job with relocation package as a very young programmer?",
    "subreddit": "cscareerquestions",
    "timestamp": 1576607271,
    "score": 0,
    "keyword": "european manager"
  },
  {
    "text": "I’m super miserable Self indulgent post but here we go:\n\nI’m a 28 yo consultant at a strategy firm, just got back from a long term assignment in Asia and been staffed straight onto another 6 month project in Europe. Just been promoted to Senior Manager (structure mirrors B4)\n\nI’m super miserable:\n\n- not knowing what to do / how to lead the people who are supposed to be working for me\n\n- always fearing that I’m about to be fired (my company has quite a high turnover rate) \n\n- never see my girlfriend (once a month for all of 2019, with 2x2 weeks on top of that) \n\n- zone out constantly at work and find it really hard to be productive. Means lots of late nights and weekends working\n\n- don’t see the next step in my career. I’m applying for MBA programs, but don’t want to do another stint away from my gf and it’s non essential anyway in my job (I’m European). Feel trapped in my job waiting to get found out and fired\n\n- feel super overwhelmed at work in general",
    "title": "I’m super miserable",
    "subreddit": "consulting",
    "timestamp": 1572100838,
    "score": 135,
    "keyword": "european manager"
  },
  {
    "text": "Developing a skill set for the future. Hi all,\n\nJust a quick introduction to provide you with some context before I ask my question. \n\nI have been working abroad for a while now, and for the two last years - as a consultant for two different international organizations. Prior to this I worked several years as a sales account manager for a large tech company. As I am planning to eventually move back to my home country with my family - I want to prepare as good as I can for job opportunities in the consulting sector. I am currently working in South Korea, but I am however from a smaller north European country originally.\n\nMy question is more related to what skill set I should look to develop in order to have a good chance of landing a job within one of the major firms. My current consultant experience has mainly been on databases and software project management. As I see it, my main problem is that I don't really have a academic background in this field (MSc in finance). The other problem I forsee is that I have mainly been working with management of these different projects, not the coding of the solutions - but rather the integration and migration parts. I also plan to take on a MBA at some point, when I have the necessary experience.\n\nI'm open to any suggestions here, technical or general, but please bear in mind that in my home country the job opportunities are somewhat limited compared to large markets and countries.\n\nThanks!",
    "title": "Developing a skill set for the future.",
    "subreddit": "consulting",
    "timestamp": 1549447289,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 511,
    "keyword": "european manager"
  },
  {
    "text": "A compilation of evidence debunking feminist historical revisionism. I have made a post somewhat similar to this before but I've since collected a lot more information about these topics and so I believe warrants yet another post.\n\n*Myth #1: Women weren't allowed to work.*\n\nMost documentation from the past heavily implies that people attempted to avoid working as much as possible. Even so, many women did work (mostly because they had no choice but to) and there has never been a law restricting women from working.\n\n\"Though creative research has produced evidence of women working at male-dominated occupations in the eighteenth century and before, there is undoubtedly more documentation out there, in newspapers, diaries, legal proceedings, and prints. What is more compelling is the lack of documentation that women were not allowed to work. Although religious practices and social norms might have restricted certain activities in some parts of the world, there were no laws prohibiting women from working a trade.\"\n\nAt the time, only members of a trade guild (associations of producers that trained craft people, maintained control over production, regulated competition and prices) were allowed to sell their goods or practice their skill within the city. Non-guild members were prohibited from selling competitive products. An aspiring master would have to pass through the career chain from apprentice to journeyman before they could be elected to become a master tradesman. They would then have to produce a sum of money and a masterpiece before they could actually join the guild. If the masterpiece was not accepted by the masters, they were not allowed to join the guild, possibly remaining a journeyman for the rest of their life.\n\nWomen were not barred from any of the trade guilds in Britain at least as far back as the 1400s. Apprentice forms for guildwork had spaces left blank to insert 'he' or 'she', though girls who chose this traditional route to mastery of a trade (which was extremely long and arduous) were usually orphaned and had low prospects for marriage, thus they were going to need to work.\n\nMarried women, though, had the privilege of circumventing the long, onerous, arduous process of trade certification as they could receive the master tradesman status from their husbands and thereby continue his work, even take on apprentices to train (which suggests that the social assumption was that wives would learn enough about their husband's business and trade to be able to at least continue to oversee it after he died). Lots of widows continued to run their husbands' businesses long after their death.\n\nThe Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\n\nA 1770 publication called *The Tradesman's True Guide or a Universal Directory for the Towns of Birmingham, Wolverhampton, Walsal, Dudley and the manufacturing village in the neighborhood of Birmingham* carried exhaustive lists of tradesmen and tradeswomen alphabetically by name and by trade, and there are women listed in every trade from butcher to wire drawer.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nReally, very little I've seen shows that women were maliciously \"kept out\" from trades or professions that they wanted to enter into. It may have been a social norm that most women did not seek out careers as they do now, but looking at the histories of the first women to enter into medicine, law, etc, show that they hardly faced any resistance in doing so.\n\nIn 1847, Elizabeth Blackwell became the first woman to attend medical school in the US and was the first woman on the Medical Register of the General Medical Council. She sent applications for admission to twelve of the most promising institutions in the northern states, and her application was accepted by the medical department of Geneva University. Feminist revisionist history \"explains\" that she was only admitted to the college by the evil men as a joke, but as will be amply demonstrated this is the opposite of what actually happened.\n\nIn fact, the student body sent her a letter to welcome her:\n\n>At a meeting of the entire medical class of Geneva Medical College, held this day, October 20, 1847, the following resolutions were unanimously adopted:–  \n>  \n>Resolved – That one of the radical principles of a Republican Government is the universal education of both sexes; that to every branch of scientific education the door should be open equally to all; that the application of Elizabeth Blackwell to become a member of our class meets our entire approbation; and in extending our unanimous invitation we pledge ourselves that no conduct of ours shall cause her to regret her attendance at this institution.  \n>  \n>2. Resolved – That a copy of these proceedings be signed by the chairman and transmitted to Elizabeth Blackwell.\n\nShe describes this letter as one of her most valued possessions, and in her autobiography she states that the men of the college supported her 100% and beyond.\n\n\"The behaviour of the medical class during the two years that I was with them was admirable. It was that of true Christian gentlemen. I learned later that some of them had been inclined to think my application for admission a hoax, perpetrated at their expense by a rival college. But when the *bona-fide* student actually appeared they gave her a manly welcome, and fulfilled to the letter the promise contained in their invitation.\"\n\nShe also notes that the general public also had a favourable view of a woman entering into medicine.\n\n\"The admission of a woman for the first time to a complete medical education and full equality in the privileges and the responsibilities of the profession produced a widespread effect in America. The public press very generally recorded the event, and expressed a favourable opinion of it. Even in Europe some notice of it was taken, and 'Punch' showed his cordial appreciation by his amusing but friendly verses.\"\n\n[http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III](http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III)\n\nThere are also other examples of women entering into \"male\" fields and encountering little resistance. There's the example of Arabella Mansfield, the first female lawyer in the United States. Although by Iowa law the bar exam was restricted to \"males over 21,\" Arabella Mansfield took the exam in 1869, passing it with high scores. Mansfield challenged the state law excluding her, and the Court ruled that women may not be denied the right to practice law in Iowa, admitting Mansfield to the bar.\n\nOr Ada Lovelace, who was encouraged in her mathematical ability from a young age by her parents and received the best of tutors to increase her ability. She worked with Charles Babbage on his Analytical Machine, though they both \"fell into historical obscurity, and the Analytical Engine was unknown to builders of electro-mechanical and electronic computing machines in the 1930s and 1940s when they began their work, resulting in the need to re-invent many of the architectural innovations Babbage had proposed.\"\n\nOr Amelia Earhart, who was flown \"like a sack of potatoes\" by pilot Wilmer Stultz across the Atlantic in her 1928 transatlantic flight, and immediately became a celebrity, wrote a book about the experience, was used to endorse products, and dubbed 'Lady Lindy'. There is a plaque that marks where the plane landed in Wales. All the fervour over it was solely because she was a woman who crossed the Atlantic regardless of the fact that she didn't do any flying at all in her 1928 flight (She did, however, go on to complete a transatlantic solo flight later on in 1932).\n\n[https://en.m.wikipedia.org/wiki/Amelia\\_Earhart](https://en.m.wikipedia.org/wiki/Amelia_Earhart)\n\nOr, for a very long-ago example of this, Murasaki Shikibu from Japan around the year 1000, who listened at the door while her brother received lessons in Chinese writing and through that learned it herself. She was far from reviled for being a woman who knew Chinese and was commissioned by the Empress to write the Tale of Genji, a classic work of Japanese literature often called the world's first novel.\n\nOh, the o p p r e s s i o n .\n\n*Myth #2: Marriage was an institution created by men to oppress women. Men were disproportionately given privilege and power and women were treated like his property in marriage.*\n\nAgain this is a bastardisation of the past. Feminism has to stop treating men as the enemy and as the source of all women's (and also men's) problems. They need to realise that things weren't always as they are now, and realise that it was not Patriarchy or men that restricted the choices of both genders and forced them into strictly defined roles, but that these roles came about because it was the best way of arranging societies in the past - a past that was much harsher and more unforgiving than it is now. A past in which there was more work to do than there were hours in a day. A past where men spent most of their short lives working like mules to support themselves and their families and women spent most of their short lives incapacitated by childbirth and child-rearing. A past in which we sent children into coal mines that ruined their lungs and into factories which lost them limbs. Things sucked, and the reason it was bearable at all back then was *because* of the gender roles.\n\nMen were not the ones who relegated women to the domestic sphere or kept them dependent on men. Biology did. A woman at that time could not simply strike out on her own and do whatever she wanted. For most of history we had no reliable birth control, no safe abortion, no maternity leave, or social security, and most public sphere work back then involved hard labour. And if you were a woman back then who wanted to be able to have sex, then you would have had to plan your life around the idea that you would be getting pregnant, giving birth, and breastfeeding for most of your adult life - and that would have meant you could not be a reliable enough worker to support even yourself, let alone a child, and it would inherently have made you dependent on other people to help you. Until the last 100 years or so, most women could not have lived a life of children and public sphere work, independent of a man (and not all can today, realistically).\n\nEven with support, most women in poor and middle class families had to work because that was the only way to make enough money to live.\n\nSo in a time when single motherhood was a one-way trip to the gutter, marriage was a practical arrangement. The function of marriage was not to oppress women, but to positively assign paternity inasmuch as possible, and then obligate the men so assigned to their children and the mothers of their children. For life.\n\nThe taboo on sex outside of marriage (which was applied to men no less than women) made it difficult for an unscrupulous man to cheat the system. These rules surrounding marriage also mitigated the problem of paternity uncertainty, which maximised men's willingness to invest in their kids. \"I know these are my kids, so I will work hard to feed and shelter them.\" And the reason why we kept lifelong monogamous marriage for so long is because it increased the resources which would have been available to offspring, providing a healthier environment for children to grow up in.\n\nSo when a man married a woman, he was legally obligated to feed, clothe and shelter her and any children produced in the marriage to the best of his ability. Unlike what feminists seem to think, he could not sell her. He could not return her for his money back. He could not drop her at the local midden heap. He could not destroy her the way he could his actual chattels. He could not trade her for a better one. He could not legally neglect her.\n\nJust to make things crystal clear, here is a summary list of entitlements that women enjoyed in marriage (and after marriage) during the old \"patriarchal\" system of the past.\n\n1. When a woman married, she had to hand over her property to her husband's care (again, NOT because she herself was property, but because he was administrator of the family), but he OWED her not just a living, but the best living he was financially capable of providing for her. A wife was entitled to be maintained by her husband.\n2. Though women did not have the right to enter into contracts in their own name in marriage, women had the privilege of the Law of Agency, giving them the legal right to purchase goods on their husbands' credit as their agent. If the wife racked up debts that the husband couldn't pay, she was immune from liability for the debts she racked up - that liability fell to the husband instead.\n3. Women had the entitlement of being protected from prosecution for any number of crimes if they could prove their husbands were aware of said crimes. In which case, he would be prosecuted in her stead--not just held AS responsible as she was, but held solely responsible for her actions. This allowed married women to displace accountability for a large number of offences onto their husbands. \"She's out of control and does what she wants, regardless of my wishes,\" was not a valid legal defence for those men.\n4. Women were exempt from paying taxes, and there was an entire female underground economy of barter and trade that was not subject to taxation or government interference. Even when married women gained the right to hold property within marriage, it was their husbands who were responsible for the taxes owing on it, and it was their husbands who were held 100% financially liable for providing all necessaries to the family, including the wife, even if she made more money than he did.\n5. After divorce, men were held fully financially responsible under the law for the ex-wife and kids. Divorced women were entitled to be supported by their ex-husbands to a level commensurate with the husband's for potentially the rest of their lives unless she remarried.\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nThat doesn't sound at all like women were treated like property to me.\n\nI'm sorry, but if I have property, I have no legal duty of care toward the actual property I own, nor any obligation to commit to own it until death. I can smash my property on the ground and treat it however I want and it would be my right to do so. Men could not do any of that to the women they were married to. They had obligations towards them to provide for them - even after divorce, and to protect them - even from the consequences of their own actions. Wives had no such obligation towards their husbands - they were entitled to be the ones who were supported. Because the purpose of marriage in the past was not to oppress women and make them the property of men, but to ensure that women and their children could be provided for and protected, and to place the responsibility for that provision and protection on the man even at cost to his own wellbeing, health, and even life. This has been the case since time immemorial.\n\n\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"\n\nEphesians 5.\n\n[https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV](https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV)\n\nIn fact, many of the supposed \"privileges\" men had in marriage in the past were to help them carry out their obligations and to prevent them from becoming wholly onerous.\n\nIf a man had an obligation to be accountable for provision for his wife and children and to maintain family finances, it stood to reason that he also should have the entitlement of having control over any assets of his marriage, including those his wife brought into the marriage, because he was the one who had a responsibility to keep the entire family afloat and to increase their holdings.\n\nIf a man was responsible for the protection of his wife and children to the point where he could be legally required to stand between his wife and the law within numerous contexts, and be punished in her stead (whether she contracted debts he couldn't pay or committed a crime he would have to answer for), it makes sense why he would be considered head of household and why his family would need to obey him as well as abide by the restrictions he placed on them.\n\nIf, upon divorce, a man would be held solely responsible for the maintenance of his wife and child, it makes sense why he would get custody of the child that he was supporting, as well as ownership of assets so he could satisfy that obligation.\n\nWe gave men these rights and privileges because they were the tools that he needed to satisfy his responsibilities. And in that way there was a balance. \"Women \"got less\" because their obligations and accountability were less, their responsibility was less. Men \"got more\" because the buck stopped with them, whether that buck consisted of a sack of coins or his blood.\"\n\n*Myth #3: Men were allowed to beat their wives with impunity.*\n\nIn the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\n*Myth #4: Husbands were owed sex with their wives. Marital rape was not illegal, and marriage as an institution was based around rape of women.*\n\nThe idea at the time was that there could not be such a thing as marital rape because as a married person you are owed sex from your spouse, i.e. conjugal rights. This applied to both men and women. People who believe that conjugal rights \"allowed husbands to rape wives\" and not the other way around haven't actually done any research.\n\nIt was based on the idea that **both parties** had a right to sex in the relationship, and this was exercisable in law by each partner in a marriage.\n\nThe Bible said:\n\n\"*It is* good for a man not to touch a woman. **2** Nevertheless, because of sexual immorality, let each man have his own wife, and let each woman have her own husband. **3** Let the husband render to his wife the affection due her, and likewise also the wife to her husband. **4** The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.* **5** Do not deprive one another except with consent for a time, that you may give yourselves to fasting and prayer; and come together again so that Satan does not tempt you because of your lack of self-control.\"\n\n[https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV](https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV)\n\nDo note the specific passage where it says \"The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.\"*\n\nAnd here's a quote from an article detailing the history of sex and marriage.\n\n\"A hundred years ago or so, if you took the statute books literally, the only people entitled to have sex with each other were people who were legally married. All other sex was against the law. Fornication (sex with unmarried people) was illegal; so was adultery (sex with a married person—but not the person you yourself were married to). Cohabitation—living with someone in a sexual relationship—was against the law, except for people who were legally married. Enforcement was, shall we say, something less than perfect. At times, it was almost nonexistent. And the rules were riddled with exceptions. Sodomy, on the other hand, was quite a serious crime; and the full weight of the law sometimes came down heavily on people who had gay or lesbian sex.\"\n\n\"Married people were not only *entitled* to have sex; they were, in a way, *required* to have sex. Of course, nobody checked on whether John and Mary were having sex every night, or once a week, or once a month, or never. But if either John or Mary did not perform at all, for whatever reason, the frustrated partner had grounds for divorce; or even perhaps an annulment.\n\n[https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking](https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking)\n\nHusbands faced divorce if they were impotent and unable to consummate the marriage, though charges were usually made years after the wedding day. There was a similar charge of frigidity for wives, but it seems that wives charging their husbands for impotency was far more common. Husbands had to show an erection to a court audience and sometimes attempt to perform sex with their wives as well.\n\n[Source 1](http://www.bu.edu/law/journals-archive/bulr/volume89n5/documents/HOFFMAN.pdf) [Source 2](https://www.theparisreview.org/blog/2016/05/18/the-hard-on-on-trial/)\n\nBeing incapable of performing sex for your wife could merit corporal punishment. One medieval husband wrote about his unhappy marriage and his impotence in a book called The Lamentations of Little Matheus.\n\n\"My wife wants it, but I can’t. She petitions for her right. I say no. I just can’t pay.\"\n\n\"Even given his sexual incapacity, Matheolus was subject to corporal punishment:\n\n\"Acting as her own advocate, Petra {Matheolus’s wife} puts forward the law that if a shriveled purse {scrotum} can’t pay because it’s empty, under statute recompense for that injury is corporal punishment.\"\n\n[https://www.purplemotes.net/2015/05/03/matheolus-church-wife/](https://www.purplemotes.net/2015/05/03/matheolus-church-wife/)\n\nSo what does this show? It shows that both parties had an obligation to provide the other partner with sex during the marriage, and could not deprive their spouse of it. If it was an issue, it was not an issue that solely affected women.\n\n*Myth #5: \"Men had the vote and women did not. Women's suffrage was a matter of women as a united group fighting for their rights against the evil men that kept it from them. Suffragettes were champions of equality who got women the vote. Etc, etc.\"*\n\nReally, I'm very tired of hearing this one.\n\nIn Britain, the right to vote was not only restricted by gender, but also by class. Property owners had the vote, the vast majority of men did not. In 1830, just 3% of the population had the right to vote.\n\nDuring this time, there were a few groups who were fighting for the vote to be extended to them, and one of these groups were the Chartists, who were active from 1830 to 1868. They were fighting for broad electoral reforms including:\n\n* a vote for all men (over 21)\n* the secret ballot\n* no property qualification to become an MP\n* payment for MPs\n* electoral districts of equal size\n* annual elections for Parliament.\n\nThey presented three huge demonstrations to Parliament, and their requests were denied every time. The restrictions were relaxed but not abolished. Benjamin Disraeli said when introducing the Second Reform Act of 1867: \"We do not live – and I trust it will never be the fate of this country to live – under a democracy. The propositions which I am going to make tonight certainly have no tendency in that direction.\"\n\nThere were also the suffragists and the suffragettes, who were fighting for the vote to be extended to women. Suffragists emerged in the mid-19th century and believed in peaceful, constitutional campaign methods. In the early 20th century, after the suffragists failed to make significant progress, a new generation of activists emerged. These women became known as the suffragettes, and they were willing to take direct, militant action for the cause.\n\nHowever, a huge amount of women disagreed with women's suffrage. So many women objected to the franchise being imposed on them that in the mere 18 months leading up to a 1910 parliamentary debate on women's suffrage, anti-suffragettes had managed to collect 300,000 signatures from women who objected to the franchise being imposed on them. Meanwhile, in the 16 years leading up to that debate, suffragettes only managed to collect 193,000 signatures of women who wanted the vote.\n\nA segment from the transcript of the debate:\n\n\"Still, for what it is worth, one finds that from 1890–1906 only 193,000 women signed Petitions to this House in favour of female suffrage, and that during the last eighteen months, a period in which a strong anti-suffrage association has been in existence, 300,000 women, some of them eminent women, have signed petitions against it, and to the effect that these proposals shall not be forced upon them.\"\n\nAnd...\n\n\"A rather interesting illustration was furnished by an inquiry which was instituted by \"The Sheffield Independent,\" a newspaper which I think itself is sympathetic with these proposals. This inquiry was addressed to the women householders of Sheffield. Twenty-three thousand papers were sent out, and of the replies 9,000 were in favour of woman suffrage and 14,000 were against it. The representatives of this paper reported that in many cases their emissaries were chased with violence from the houses by the female inhabitants under the impression that they were collecting statistical matter as the emissaries of the suffragist party.\"\n\nIt may be difficult to understand why so many women would reject the vote so vehemently, but this was an era where full citizenship rights like the right to vote were granted only to those with citizenship responsibilities like conscription (and sometimes not even then). In that historical context, the vote was actually viewed not just as a right, but also an obligation. So it was never really about men in power shutting women out of the franchise. It was about government having to decide whether to impose a responsibility on women that women as a whole *clearly did not want.*\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\nRegardless of the lack of support for women's suffrage among women, suffragettes became extremely militant in their activism. In 1903 Emmeline Pankhurst founded the Women's Social and Political Union (WSPU) with her daughters Christabel and Sylvia, and the WSPU carried out a nationwide bombing and arson campaign. Between 1912 and 1915, hundreds of bombs were left on trains, in theatres, post offices, churches, even outside the Bank of England; while arson attacks on timber yards, railway stations and private houses inflicted an untold amount of damage.\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nInstead of being beneficial in supporting the vote for women, it was disastrous. Lloyd George said: \"The action of the militants is ruinous. The feeling amongst the sympathisers of the cause in the House is one of panic. I am frankly not very hopeful of success if these tactics are persisted in.\"\n\nTerrorism aside, Emmeline Pankhurst was also resistant to acquiring the vote for working class men, realising that this would be much tougher than winning the vote for \"respectable\" AKA upper-class women, and underlying the resistance appears to have been her contempt for working-class men. According to Sean Lang in his book on Parliamentary reform: \"The Pankhursts became stridently anti-male, ruthlessly dropping even the most loyal of their male supporters from the WSPU, and claiming, as Christabel did in her 1913 book *The Great Scourge*, that men were “little more than carriers of venereal disease”.\"\n\n[https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/](https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/)\n\nWhen WW1 came around in 1914, suffragettes also threw their support behind the White Feather campaign with the aim of shaming men into enlisting. Those young women went in for the kill, striking men at the very heart of their masculine identities, the bestowing of a feather telling them, \"If you don't go off to be maimed or die, you are no longer a man in the eyes of some brassy chit you've never even met before and will probably never see again.\" And many men went, because a woman's censure - ANY woman's censure - had the power to drive them straight into the teeth of death.\n\nBy mid 1915, it was clear that not enough men were signing up to replace the fatalities on the front line, and the Military Service Act was introduced in January 1916. By March 1916 compulsory conscription for all single men aged 18-41 was in place. In May 1916, the Act was extended to include conscription for married men.\n\n[http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html](http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html)\n\nIt was only at that point that the British government considered extending the vote to all men, as most of the propertyless, working class men that were conscripted into war during WW1 did not have the right to vote, and this was finally starting to be seen as the injustice that it was. In the trenches class divisions were eroded to the extent that class no longer had any real meaning and every man was the equal of each other in terms of sacrifice and service to one's country.\n\nMen got universal suffrage in 1918 with the Representation of the People Act, which enfranchised more than five million men over the age of 21 without regard to property or class. Women of all classes were piggybacked onto the Act, with an age restriction temporarily in place to prevent women from becoming a supermajority voting bloc, given that about 1 million British men had died in the war. Regardless, this brought more than eight million women over 30 into the electorate. And just ten years later, the 1928 Act (the act which gave women electoral equality) gave the vote to women at age 21, which added another five million women to the electorate.\n\n[https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/](https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/)\n\nIntroducing the 1918 Bill, the Home Secretary George Cave said: \"War by all classes of our countrymen has brought us nearer together, has opened men's eyes, and removed misunderstandings on all sides. It has made it, I think, impossible that ever again, at all events in the lifetime of the present generation, there should be a revival of the old class feeling which was responsible for so much, and, among other things, for the exclusion for a period, of so many of our population from the class of electors. I think I need say no more to justify this extension of the franchise.\"\n\nThe Act was achieved not by the suffragettes’ terrorist tactics, but by fighting of men in WW1, when thousands of men from their many different backgrounds came together to fight the common enemy. This finally achieved what the Chartists, the Levellers and the peasants before them had struggled for in terms of eroding barriers of class. Without the sacrifice of men who endured the horror of trench warfare in WW1, class barriers would have persisted and at most the vote would have been extended only to elite, wealthy, propertied women.\n\nIn a later study of attitudes to conscription in 1939, one woman responded: \"In the last war \\[(WW1)\\] I never told one man that he ought to go. I tried to put myself in their place. If I’d been them I wouldn’t have gone. When I saw them going through the streets – all the young men – I used to think that they were being driven like cattle to the slaughter house. And they were, weren’t they? Fodder for the guns.\"\n\nThe common idea that all men had the vote, and that women did not, and that women's suffrage was a fight of women who were united against men working as an oppressive force to keep them down is an affront to these men who died in a literal war that secured universal suffrage for everyone (many of which, in fact, did not have the vote). It also ignores and erases the will and sentiment of many, many, *many* anti-suffragette women who actively rejected the vote and protested vehemently against it being imposed on them.\n\nFurthermore, the view that suffragettes were a valiant, fair-minded, equality-oriented group who got women the vote and whose activism merely amounted to firecrackers in barrels is an affront to any right-thinking person. The real violence and extremism of the suffragettes is barely, if at all, recognised by the general public, and this is partly due to attempts by suffragettes to sanitise their history.\n\n\"Laura E. Nym Mayhall, in her work on the militant suffrage movement, identified the importance of \"a small group of former suffragettes\" in the 1920s and 1930s, who created a highly stylised story of the WSPU and the history of suffrage in England, which emphasised \"women’s martyrdom and passivity\". The group set about compiling the documents, memoirs and memorabilia that now form the basis of the Suffragette Fellowship Collection held by the Museum of London.\"\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nAnd here we are now, in crazy world. According to the dominant narrative, all men always had the vote since the dawn of recorded human history, and they refused to give it to women because penis. The demonstrations of the Chartists, and the dead bodies of these men that were sacrificed to the unpopular idea of male suffrage (and who got votes for women in the process), have gone down the memory hole. The terroristic actions of the suffragettes, engaged in for the benefit of wealthy and privileged women only and for which they were barely punished, are the noblest of acts for the noblest of causes. And of course, the only reason anyone could EVER have opposed them was because of misogyny.\n\nedit: wording\n\nedit 2: Added some extracts from [w1g2's comment](https://www.reddit.com/r/MensRights/comments/edyrf5/a_compilation_of_evidence_debunking_feminist/fbtays6?utm_source=share&utm_medium=web2x).",
    "title": "A compilation of evidence debunking feminist historical revisionism.",
    "subreddit": "MensRights",
    "timestamp": 1576979536,
    "score": 341,
    "keyword": "european manager"
  }
]