[
  {
    "text": "Negotiate Relocation I am a 25(f) working as a financial analyst at a forbes 50 company.  I al working there for 1.5 years.  9 months an intern and at my current role later on.  I am putting my best and working over 60 hours per week for the last year which had as a result to get a raise of 15% when I closed 6 months at the role. However, the reason that I am so commited is that I want my next role to be in the European central offices instead of moving to another local market.  I really want to move to that city as my fiance also lives and works there.  I communicated this decision to my manager and he was negative to this decision.  He even suggested to date someone from work to optimize my career prospects. After this discussion and the fact that I communicated my determination for my decision our relationship changed and we do not have lunches together.  He avoids to talk to me on a personal level as he used to and he is stricter when it comes to work.  After this behavioural change I do not feel that the relocation discussion is possible and if I should push more or not. How can I discuss the matter without hurting our interpersonal relationship?",
    "title": "Negotiate Relocation",
    "subreddit": "jobs",
    "timestamp": 1513460730,
    "score": 10,
    "keyword": "european manager"
  },
  {
    "text": "Working at a Start Up for 3 Months - Need to find a new job (info inside), how to address this in CV? Hi, \n\nApologies on the length.\n\n**My background:**\nI'm based in Europe. I left a large IT corporation in May to find a new job (boss was verbally abusive, not a good company to work for, very well known American brand). Frustratingly I fell quite sick, my father was also hospitalised and both made finding a job quickly a challenge. Three months later I interviewed for an ambitious company for a Head of Sales role.\n\n**Job Desc:**\nThe company is European in origin. \nResponsibilities: develop sales/BD processes, GTM/strategy, evaluate IT solutions for Sales/after sales (CRM/Service), acquire customers directly until we can hire a team, find and acquire partners\n\n**The last two months:**\nSo I joined that start up company as Head of Sales alongside two founders and things have been going well - lots of learning on the job, hit the ground running, start building a pipeline (they had a very healthy inflow of high quality leads - which surprised me).\n\nHowever due to financial problems (in short, an unexpected customer attrited this month: this was not related to me at all or even a problem with us (something that no one could solve, despite wanting to). It essentially equalled the value of new business in two months) will be let go by the end of the month if things do not improve. The founders stressed none of this is my fault, that the working relationship and work ethic is exactly what they were looking for, but they simply cannot afford to keep me unless the company (not me) manages to recoup the losses. \n\n**Next four weeks:**\nMy mindset is simply find a new job, evaluate it if I get an offer versus the situation in this company at that time. I will weight an external offer higher as I'm not keen on a company that does not give me stability. \n\nHowever before I apply, I need to get my CV and Cover Letter in order and right now I'm sitting here gazing stupidly at my computer with the most pathetic 'writers block'.\n\n**My Questions:**\n\nProblem in one line: I have a gap on my CV and a short term employment with a \"senior\" title\n  \nHow do I address the following in my CV?  \n- It's only 3 months, this will look as if I have been let go (solution: address in Cover Letter?) or am jumping ship\n- I haven't completed many of my advertised responsibilities. I can't even exaggerate here. I'm struggling to put anything in this section\n- My title - it's very senior, the caveat is it was at a start up which makes it more understandable. If I lasted 6 months, 12 months or two years this would be no issue. My question here is: I will be applying back to standard corporate roles - but with a \"senior\" title and short length on my CV - this looks comical. Should I \"downgrade\" to a very generic \"Sales\" or something similar?\n- If I \"downgrade\" my title, it's still 2-3 months at a start up with little to show, and \"just another sales title\". \n\n-My girlfriend is pushing for me to \"extend\" the start date back to when I left my previous company (fill the gap of 3 months), which would allow for \"wiggle room\" in describing what I did (exaggerated or not). I'm not keen on lying, even if they don't manage to find out, but I'm struggling to think of anything else here because despite the truth being OK, it's more difficult to explain and even justify. \n\nPeople don't want to listen to a complex story, simple as. An exaggerated story of being Head of Sales at a start up for 6 months (not 2-3) that had funding issues is easier to explain than \"I left to find something new, fell sick, found a job as Head of Sales, there were funding issues\" - it sounds like I bounced from job to job or was fired from two despite being true. \n\nAny advice for how to address this in a CV or a Cover Letter would be appreciated.",
    "title": "Working at a Start Up for 3 Months - Need to find a new job (info inside), how to address this in CV?",
    "subreddit": "jobs",
    "timestamp": 1509476402,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "How to find a job in the US as a European? Hi reddit!\n\nI'm a European who wants to move to the US, but I have trouble finding a job. Maybe someone can give me a pointer how/where to look.\n\nI have a PhD in computer science with various publications, several years of experience in software development (various programming languages and areas), as well as in project management (including certifications like PMP). I'm haunted by headhunters here, but I want to leave Europe as soon as possible.\n\nHowever, I don't have a visa, nor am I a US citizen. I'm always told I \"just have to apply\" and that I'm super qualified, but most job ads either specifically state no visa sponsorship, or I never get any response.\n\nSo is there a special website or forum or anything where I could look for any employers willing to sponsor visas? Or is there just no way for me?\n\nAnd yes, I'm participating in the GC lottery, but no luck so far :(\n\nThanks!",
    "title": "How to find a job in the US as a European?",
    "subreddit": "jobs",
    "timestamp": 1490655040,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Should I stay or Should I go?  Greetings, \n\nI'm going to try and keep this as vague as possible without straying too far from the point. I am 30 years old originally from the U.S and I moved to a European country to take a job in an industry I truly love. I can say the industry is in communications/marketing. The pay is low, 20,000E per year and I get paid on a monthly basis. \n\n  Ive been here about 10 months and things have gotten downright awful.  Moving to a new country to begin with was very difficult and initially this was the only concern. My paychecks also come from the UK, despite the fact that the company I work for is in Southern Europe, all of my fellow employees are paid from a bank account in that country \"But I doubt I can prove that, or whether it's relevant. \n\n  It started with the language barrier, despite the fact that EVERYONE in the office speaks English, 90% of our customer base speaks English they switched over to their mother tongue. The boss did the same thing, and it got so constant that it's gotten to the point where I just sit at my desk and wait for the day to end. \n\n Ive tried to have it stop, to no avail. Ive asked nicely, \"Guys please can we speak English in the office\" to even calling the companys CEO who has been very clear that only English should be spoken in the office.  The manager of the office seems to particularly dislike me, speaking the native language in my presence all the time, making fun of me for not speaking it and just being generally rude. Hey I get it, I'm in another country and should learn that language, but that takes a lot longer than most people realize and I don't understand why English can't be spoken when we communicate internally with management in English ALL the time, and with our customers. Suffice it to say ive realized it's something I can't change, so now I just tune out.  Boss also likes to take everyone out to lunch, well, everyone except me of course. But that's not it \n\n As an example, I was given the company credit card to purchase some software however the price differential on the software was pretty significant 100, 200, 500, 1000 etc.  So I simply asked the boss, \"which should I buy\"? In his native tongue he said \"How the fuck should I know\" I kind of wanted to ask him the same thing, but oh well. On another occasion I thought he was calling my name, so I turned around and said \"Yes?\" and he said \"I wasn't speaking to you! I was speaking to xxxxx\" in a really nasty way, and of course he was speaking in his native tongue. \n\n This is only one of many situations ive found myself in with him, and at this point I don't feel a part of the \"team\" at all, which is why he said it was so important I didn't work independently, but moved all the way across the ocean to work at THIS location. \n\n  So now let's get into the nitty gritty, because I could probably go on for hours.  I am 30 years old, my job  history is bleak to say the least, but not non-existent.  There are a few things working in my favor, one of those things is that my family owns an entire apartment in a neighboring country, however we aren't wealthy, it's just an investment that's payed off. \n\n Technically I could leave this job and not pay any rent at all if I move to that country. The issue is, I would be without a job and maybe in an even more stressful situation than I am now. I'd also like any advice at all on how to deal with a nasty manager, and coworkers who clearly don't really want me around. \n\n Starting new in that country would be tough, unlike the one I am currently in it's job market is a bit worse and generally few \"English Speakers\" are hired outside of the tourist industry. However life in the country is much less expensive than the one I am currently in. That being said, I have a few ideas for home businesses that could at the very least keep me fed but I do fear that my lack of experience in general could make finding a new job rather difficult. \n\n Any advice would be helpful, and of course as the title suggests should I stay or should I go?",
    "title": "Should I stay or Should I go?",
    "subreddit": "jobs",
    "timestamp": 1511374064,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Cover letter advice on a pretty unique situation Hi I would appreciate any advice on this issue as I'm not experienced enough in the job market  and this is a pretty unique situation I got into\nVery long post, long but true story\n\nI completed my PhD and some months after applied for a great job in another European country (I'm from a southern European country) and was offered the job to start 2.5 months after (which is standard at that company)\n\nA few months before that interview I started dating a girl and things evolved quickly and we fell in love, which during the months between the interview and the date I had to go grew even more and we knew we want to be together. But there was a big issue, she was an ilegal immigrant in my country (she came with her father and overstayed). This means that she was unable to go with me. She could go back to her country and come meet me after 3 months (which would make her legal in her return) but she would be unable to work during the entire period I would be working there which could be many years.\n\nThe second option, which was what we took, involved trying to make her legal in my country by entering in a stable union (like a marriage) which would allow her to then be legal and work when we went together. The manager (would be boss) was very generous and allowed me to delay the start of the job for 4 months later to attempt to solve the situation this way. We tried to do it and were unable to make it work due to the stable union not being recognized due to her being ilegal (even though our lawyers said it should be), and the same when we tried to marry. So she went back to her country and came back a bit over 3 months after. \n\nThe day of my departure came and I had everything ready to go. On the morning of the flight my documents were stolen so I was unable to travel and since it was during the vacations period the bureaucratic procedures in my country work very slowly so my entry was delayed, first for 2 weeks and then the human resources told me it was for a month for their own internal procedures. \n\nBack to the girlfriend situation. She had gone to her country and after a few weeks we found out she was pregnant. We decided to keep the pregnancy as she would have a lot of difficulty having a kid later on as she has PCOS. She came back to my country 2 days before my departure date and, it could be from the stress of changing countries, she had a miscarriage. It affected her brutally due to the high probability of not being able to have kids later on, she went out of her mind and made up her mind that she would be unable to feel ok if we went due to what happened as she would be deeply depressed and be very isolated due to my job involving many hours out of home. \n\nGoing alone would mean she could not stay in my country either and wait until she felt better, as she came with a visa to marry and the marriage process would take long. If I went she would have to go with me against her will or go back to her country. At the time the situation was such that I had to decide between breaking the relationship, or staying.\n\nWith all the drama and my family pressure (they never wanted me to go) I panicked and sent an email explaining briefly the situation saying I couldnt go at the time and couldnt ask for another delay as it was a third one and it didnt feel right to ask for that reason (huge mistake, should have asked of course but was not thinking clearly). A few days later I sent an email asking for a delay of 2 months to try to solve the situation. I received a reply a week after saying the job was cancelled. After around a week I sent an email to the manager apologising again and explaining the situation with a bit more detail because I felt it was the least I could do.\n\nNow after around 3 months they opened a job slot that is very similar to what I had applied. I want it, a lot, and I'm a good fit for it. What I fear is that (understandably) they view me as unprofessional, that Im not trustworthy and that they doubt my commitment. I understand that, as the whole story is very complicated and the fact is that I gave my word that I would go (despite no contract being signed), and 3 times on the date that I was supposed to go I had to ask for a delay. I feel ashamed of that and I have always been a man of word, but the situation involving my family affected me too much emotionally that I didnt think clearly. I have learned my lesson now, at great cost due to the opportunities missed.\n\nWhat could I do to try to restore my credibility and make them believe I'm commited?\n\nAt the time of the interview I was asked about my commitment and I gave my word that if they offered me the job I would go. I kept my word up to the point of the family issues. Between the time of the interview and the first starting date I was called for interviews for two jobs at a great international organization that offered even better pay and was at a better location, and for another job in switzerland that offered even better pay. I refused on the spot to keep my word. After a few months I was offered a teaching job in my city and refused for the same reason. Now I'm unemployed and with a high probability of remaining so as the job market for phds is seasonal, most job are to start in September next year.\n\nI will apply for the position, but I'm not sure on the following:\nShould I mention any of this even briefly in the cover letter?\nShould I try to show them I keep my word and this was an exception because it impacted my personal life tremendously? Should I contact the manager (would be boss) directly and mention any of this? For example by mentioning I refused the other job interviews\n\nTL DR: got a great job offer a year ago, for 3 times had to ask for delay (months) in the starting work date for family reasons (and one time for documents stolen) and the job was cancelled. Now a similar job opened and I want to apply. What could I do to try to restore my credibility and make them believe I'm commited? In terms of the cover letter and potentially contacting the manager (would be boss) directly",
    "title": "Cover letter advice on a pretty unique situation",
    "subreddit": "jobs",
    "timestamp": 1512352558,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "How relevant is overseas experience? Does overseas experience play any significant role when job seeking? \n\nIm 25 years old European with two years of experience back home and over a year overseas. I also have three-year trade school diploma. Im interested to travel plus work more, but if this experience does not add anything to my resume I might look for a local job.\n\nI was told from early age that these sort of details matter in the future, thou those people never worked as a hiring manager.",
    "title": "How relevant is overseas experience?",
    "subreddit": "jobs",
    "timestamp": 1494403283,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "help an 18 year old student looking for an online part time job ? real life part time jobs don't pay that well from where i am from sooo i was looking for an online one , i read through a few posts on askreddit but i didnt find a link to anywhere. Gotta keep in mind that i am not european nor am i american. Im from Tunisia (North Africa)\nI am very found of computers , i love technology and i aspire to be an online security manager in the future :). I speak Arabic , English and French and a tiny bit of German ( in that order of fluency ) My typing speed is at 80 WPM( which i can deffinetly improve if the job includes typing )\nI dont think this is your typical post on PF but it is related to my personal finance and would really appreciate if you guys have any input ( as always , keep in mind i am not in the US or EU , i looked into alot of job and most of them require you to be American )\n\nthanks in advance fellas ! :)",
    "title": "help an 18 year old student looking for an online part time job ?",
    "subreddit": "jobs",
    "timestamp": 1511106077,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "A feminist rollercoaster It's just about today at work. I have three kids and I work at an urgent pharmacy thats open alongside the urgent doctors at night, from 6-11. Great, dont miss out on the kids much because of work and get to really help with people.\n\nNice, apart from at least one man a day mistaking compassionate and competent care with personal admiration of their manly being and come at me with - what they feel flirty, what I feel derogatory comments.\n\n-May I help you in anything else?\n\n- Not in a medical sense, no.\n\nor\n\n-If you don't remember what medicine you have at home, we're here until 11, you can give us a call.\n\n- Huh, that's the best way to get you number, hey?\n\n\nLike what the flying fuck?\n\n\nOkay.\n\nSo I am attractive woman (with you know, having been shot in the ass in the morning with antibiotics for a PID that I got infected with while being scanned for infertility after I lost my baby last year and still debating if I should be at hospital with this pain) and if that's what they chose to see instead of a health professional, I make them pay, and god help me, I sell each man with a remark like this at least one OTC product. \n\n\nBut then an elderly gentlemen comes in, and after handing in his script, he jovially asks me (clearly savouring the social situation):\n\n- And where are YOU from? (I blend in until I speak, I have an accent).\n\n- I was born in this Eastern European country, but, you know... I am living here.\n\n- For how long have you been here?\n\n- For a decade.\n\n- And you still have an accent? - wtf?! but I just laugh, I had been looking for someone to teach me to speak \"locally\" for exactly 10 years too.\n\n- Yeah, I know, terrible, I don't seem to be able to loose it.\n\n- Ah, and when you go home, they will think you speak fancy! - I started gaping here. There is no counting in how many ways this is wrong.\n\n- Well, this is home for me now, I am not going back.\n\n- Ah right, the scenery is surely... ammm... nicer\n\n- Yes, and the people.\n\n\nGuy goes and sits down to wait. My kind and up-front collegue says:\n\n-Pumada, do you think men ask you more often where you are from than women?\n\n- Generally no, but here, now that you say it, yes.\n\n- I just think they do. Men are fascinated with you. - I blush badly and I rarely do, I have Aspergers - I don't mean it in any bad way, it's just that you are different... That's not what I mean, I mean...\n\n- You mean my accent?\n\n- Yeah.\n\nI explain to her how I feel about casual racism, how I am not comfortable with the culture I accidently was born into, how I feel the question \"where are you from\" excludes me from where I really belong and how I feel upset about not being asked about my feelings before assumptions are made about my identity based on where I was friggin BORN. How the fuck could I have done anything about it? I left as soon as I could. Anyway I didn't swear at work obviously.\n\nI also said how I'd hate my accent and casual racism etc. be degraded to be just a thing between men and women. Right, convo over, time's up, guy's getting his medicine. I never compromise the quality of advice I give on personal feelings so I explain his medicines and he feels comfortable - as he should, that's how I am a professional, my baggage doesn't belong to customers.\n\nThen he says goodby to a professional who just made sure he and his wife are safe with their medicines, who has a masters in pharmacology, has published in neurological research, who registered her diploma in another language and another culture and has been offering exceptional healthcare and management for the past 15 years, he says goodby as he feels best:\n\n- Night-night, kiwi girl.",
    "title": "A feminist rollercoaster",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1501675422,
    "score": 0,
    "keyword": "european manager"
  },
  {
    "text": "Data behind ACLS guidelines for medicines From time to time (but certainly no less than weekly, with the last one being [this one](https://www.reddit.com/r/medicine/comments/6hi5ya/not_medical_advice_1mg_epinephrine_ivp_during/?ref=share&ref_source=link)) threads pop up where the ACLS guidelines come into play. Sometimes because someone didn't follow them, sometimes because someone claimed they were followed the wrong way.\n\nWe rarely discuss why we have the guidelines we have, and never if this constitutes the standard of care, if it is evidence based guidelines or if it is a list of what some people think you should do.\n\nThe latter is true, and it is actually based on animal studies during the 60ies, namely [Redding JS, Pearson JW. *Resuscitation from asphyxia.* JAMA. 1962 Oct 20;182:283-6.](https://www.ncbi.nlm.nih.gov/pubmed/13973494/) and [Redding JS, Pearson JW. *Resuscitation from ventricular fibrillation. Drug therapy.* JAMA. 1968 Jan 22;203(4):255-60.](https://www.ncbi.nlm.nih.gov/pubmed/5694097/) where the second one found\n\n> Resuscitation [of dogs] was more successful when epinephrine was used than when no drug therapy or sodium bicarbonate were used. \n\n**Vasopressors**\n\nThe ACLS algorithm since at least 2009 have included adrenaline/epinephrine 1mg every 3-5 minutes. This is based on a single randomized study ([Jacobs IG, Finn JC, Jelinek GA, Oxer HF, Thompson PL. *Effect of adrenaline on survival in out-of-hospital cardiac arrest: A randomised double-blind placebo-controlled trial.* Resuscitation. 2011 Sep;82(9):1138-43. ](https://www.ncbi.nlm.nih.gov/pubmed/?term=21745533) which is best summarized by their own conclusion\n\n> Patients receiving adrenaline during cardiac arrest had no statistically significant improvement in the primary outcome of survival to hospital discharge although there was a significantly improved likelihood of achieving ROSC.\n\nROSC isn't the end result of CPR, survivability is. The same conclusion is shown in other retrospective studies as well, e.g. [Hagihara A, Hasegawa M, Abe T, Nagata T, Wakata Y, Miyazaki S. *Prehospital epinephrine use and survival among patients with out-of-hospital cardiac arrest*. JAMA. 2012 Mar 21;307(11):1161-8](https://www.ncbi.nlm.nih.gov/pubmed/?term=22436956) which concludes that while more patient in the epinephrine/adrenaline group achieved ROSC they were equally likely (actually slightly less likely) to be discharged.\n\nAnother study found that among patients who are at a hospital when they fall into cardiac arrest early ephinehrine/adrenaline push (as within 2 min of the first defibrillation which is against the guidelines that says after defibrillation nr 2) is associated with a worse outcome, per [Andersen LW, Kurth T, Chase M, Berg KM, Cocchi MN, Callaway C, Donnino MW; American Heart Association’s Get With The Guidelines-Resuscitation Investigators. *Early administration of epinephrine (adrenaline) in patients with cardiac arrest with initial shockable rhythm in hospital: propensity score matched analysis.* BMJ. 2016 Apr 6;353:i1577.](https://www.ncbi.nlm.nih.gov/pubmed/?term=27053638)  \nIt is a short article, well worth a read (and it is open access), but here is an excerpt\n> In conclusion, we found that early administration of epinephrine after the first defibrillation (that is, contrary to guidelines) was common (>50%) in patients who experience cardiac arrest in hospital with a shockable rhythm. Moreover, the provision of epinephrine at this time point was associated with a decreased chance of good outcome, including decreased in hospital survival.\n\n**The AHA guidelines**\n\nThe ACLS guidelines are heavily based on the [AHA guidelines](https://www.ncbi.nlm.nih.gov/pubmed/20956224/).  They say\n> It is **reasonable to consider** administering a 1 mg dose of IV/IO epinephrine every 3 to 5 minutes during adult cardiac arrest.\n\nReasonable to consider is the wording used. Think about that for a minute. \n\nI would also like to add that high doses of epinephrine/adrenaline is associated with a worse outcome. If that is because the patient is in cardiac arrest for longer, or because the people doing it are less experienced and doesn't follow protocol is hard for me to say. \n\n**Amiodarone**\n\nThere are 2 studies (ALIVE and ARREST). Neither was powered to really detect what we are interested in (survivability). \n\nThe first of these two, [Dorian P, Cass D, Schwartz B, Cooper R, Gelaznikas R, Barr A. *Amiodarone as compared with lidocaine for shock-resistant ventricular fibrillation.* N Engl J Med. 2002 Mar 21;346(12):884-90.](https://www.ncbi.nlm.nih.gov/pubmed/?term=11907287) found that more patients who got amiodarone was admitted to the hospital, but failed to show (due to how it was constructed) that they were discharged more often. The second trial ([Kudenchuk PJ, Cobb LA, Copass MK, Cummins RO, Doherty AM, Fahrenbruch CE, Hallstrom AP, Murray WA, Olsufka M, Walsh T. *Amiodarone for resuscitation after out-of-hospital cardiac arrest due to ventricular fibrillation.* N Engl J Med. 1999 Sep 16;341(12):871-8.](https://www.ncbi.nlm.nih.gov/pubmed/?term=10486418) showed the same, but didn't focus on survival to hospital discharge.\n\nTherefor the evidence is lacking. And again from the AHA  \n> Amiodarone may be considered for VF or pulseless VT unresponsive to CPR, defibrillation, and a vasopressor therapy (Class IIb, LOE B). An initial dose of 300 mg IV/IO can be followed by 1 dose of 150 mg IV/IO.\n\n**Edit 1.** /u/transmogrification pointed me towards another study, more recent then the above, [Kudenchuk PJ et al. *Amiodarone, Lidocaine, or Placebo in Out-of-Hospital Cardiac Arrest*. N Engl J Med. 2016 May 5;374(18):1711-22.](https://www.ncbi.nlm.nih.gov/pubmed/?term=27043165). This study concludes that\n\n> neither amiodarone nor lidocaine resulted in a significantly higher rate of survival or favorable neurologic outcome than the rate with placebo among patients with out-of-hospital cardiac arrest due to initial shock-refractory ventricular fibrillation or pulseless ventricular tachycardia.\n\nbut also\n\n> Finally, the point estimates of the survival rates in the placebo group and the amiodarone group differed less than anticipated when the trial was designed, which suggests that the trial may have been underpowered.\n\nSo there still may be a difference, but you would need 9000 study participants to find it with a 90% certainty. If it did have an effect of ca 3% that would be 1800 lives per year it could save, but the data as is doesn't support an effect larger than 3%.\n\n**Fibrinolysis**\n\nA lot of cardiac arrests are due to PE or AMI, and it would there go to reason that treating the clots would have an effect on survival. The problem is that when you give tPA you don't actually know why the patient went into cardiac arrest, and there hasn't been shown any benefit (a bit better effect on survival to ICU admission has been found), see [Böttiger BW, Arntz HR, Chamberlain DA, Bluhmki E, Belmans A, Danays T, Carli PA, Adgey JA, Bode C, Wenzel V; TROICA Trial Investigators; European Resuscitation Council Study Group. *Thrombolysis during resuscitation for out-of-hospital cardiac arrest.* N Engl J Med. 2008 Dec 18;359(25):2651-62](https://www.ncbi.nlm.nih.gov/pubmed/?term=19092151) and [Böttiger BW, Bode C, Kern S, Gries A, Gust R, Glätzer R, Bauer H, Motsch J, Martin E. *Efficacy and safety of thrombolytic therapy after initially unsuccessful cardiopulmonary resuscitation: a prospective clinical trial.* Lancet. 2001 May 19;357(9268):1583-5.](https://www.ncbi.nlm.nih.gov/pubmed/?term=11377646).\n\nIf we could select the right patients that may change, and with an increased amount of ultrasound used by ICU docs and even used during CPR we may be at a point where it is worth redoing such a study at a hospital (my own point of view).\n\n**Edit 2** As pointed out by the PEAPETT study [Sharifi M, Berger J, Beeston P, Bay C, Vajo Z, Javadpoor S; “PEAPETT” investigators. *Pulseless electrical activity in pulmonary embolism treated with thrombolysis (from the \"PEAPETT\" study).* Am J Emerg Med. 2016 Oct;34(10):1963-1967](https://www.ncbi.nlm.nih.gov/pubmed/27422214) and /u/macreadyrj there have been newer studies then the ones cited above. However PEAPETT included 23 patients where 16 had a previous diagnosis of PE by CT pulmonary angiography, which isn't the case for a random cardiac arrest and 3 were diagnosed with PE by ultrasound criteria. I would thus interpret the study more as a safety study than anything else, since it also didn't show any significant bleedings. \n\n**Sodium bicarb**\n\nThe AHA states\n> There are few data to support therapy with buffers during cardiac arrest. There is no evidence that bicarbonate improves the likelihood of defibrillation or survival rates in animals with VF cardiac arrest. A wide variety of adverse effects have been linked to administration of bicarbonate during cardiac arrest. Bicarbonate may compromise CPP by reducing systemic vascular resistance.\n\nAnd the study this is based at least partly on [Vukmir RB, Katz L; Sodium Bicarbonate Study Group. *Sodium bicarbonate improves outcome in prolonged prehospital cardiac arrest*. Am J Emerg Med. 2006 Mar;24(2):156-61.](https://www.ncbi.nlm.nih.gov/pubmed/?term=16490643) which despite the name states\n> **The empirical early administration of sodium bicarbonate (1 mEq/kg) has no effect on the overall outcome in prehospital cardiac arrest.** However, a trend toward improvement in prolonged (>15 minutes) arrest outcome was noted.\n\nIt should be said that there are specific circumstances were bicarb has it's use, but routinely using it simply hasn't been shown effective as stated by the AHA\n> In some special resuscitation situations, such as preexisting metabolic acidosis, hyperkalemia, or tricyclic antidepressant overdose, bicarbonate can be beneficial\n\n**Edit 3. Endotracheal Intubation** \n\nPer the AHA\n> However, intubation attempts by unskilled providers can produce complications, such as trauma to the oropharynx, interruption of compressions and ventilations for unacceptably long periods, and hypoxemia from prolonged intubation attempts or failure to recognize tube misplacement or displacement. It is now clear that the incidence of complications is unacceptably high when intubation is performed by inexperienced providers or monitoring of tube placement is inadequate.\n\nThere aren't any high quality studies and only a few retrospective studies, one of them saying that early intubation has a trend toward better survival at 24hrs; [Wong ML, Carey S, Mader TJ, Wang HE; American Heart Association National Registry of Cardiopulmonary Resuscitation Investigators. *Time to invasive airway placement and resuscitation outcomes after inhospital cardiopulmonary arrest*. Resuscitation. 2010 Feb;81(2):182-6.](https://www.ncbi.nlm.nih.gov/pubmed/20022157) and one study of poorly trained EMS on intubation of children failed to find an effect (and remember we think that ventilation is more important in children than in adults) [Gausche M, Lewis RJ. *Out-of-hospital endotracheal intubation of children*. JAMA. 2000 Jun 7;283(21):2790-2](https://www.ncbi.nlm.nih.gov/pubmed/10838643).\n\nA more recent study in Japan [Hasegawa K, Hiraide A, Chang Y, Brown DF. *Association of prehospital advanced airway management with neurologic outcome and survival in patients with out-of-hospital cardiac arrest*. JAMA. 2013 Jan 16;309(3):257-66](https://www.ncbi.nlm.nih.gov/pubmed/23321764) found that\n> Among adult patients with OHCA [out of hospital cardiac arrest], any type of advanced airway management was independently associated with decreased odds of neurologically favorable survival compared with conventional bag-valve-mask ventilation.\n\nYou also have another study, [Kajino K, Iwami T, Kitamura T, Daya M, Ong ME, Nishiuchi T, Hayashi Y, Sakai T, Shimazu T, Hiraide A, Kishi M, Yamayoshi S. *Comparison of supraglottic airway versus endotracheal intubation for the pre-hospital treatment of out-of-hospital cardiac arrest*. Crit Care. 2011;15(5):R236.](https://www.ncbi.nlm.nih.gov/pubmed/21985431) which found two things. A supraglottic airway is equally effective to endotracheal intubation, but having a person certified to do endotracheal intubation was associated with a better outcome regardless of wether they did or didn't. Early placement of an advanced airway was associated with a better outcome.\n\n**Edit 4**\nThanks to dr /u/CytokineShitStorm for pointing me to this study, [Andersen LW, Granfeldt A, Callaway CW, Bradley SM, Soar J, Nolan JP, Kurth T, Donnino MW; American Heart Association’s Get With The Guidelines–Resuscitation Investigators. *Association Between Tracheal Intubation During Adult In-Hospital Cardiac Arrest and Survival*. JAMA. 2017 Feb 7;317(5):494-506.](https://www.ncbi.nlm.nih.gov/pubmed/28118660) which is a 2017 observational study on cardiac arrest in the hospital setting which found\n>Although differences existed in prespecified subgroup analyses, intubation was not associated with improved outcomes in any subgroup. [...] Among adult patients with in-hospital cardiac arrest, initiation of tracheal intubation within any given minute during the first 15 minutes of resuscitation, compared with no intubation during that minute, was associated with decreased survival to hospital discharge.\n\nand thus it doesn't support intubating patients even at a hospital setting. As the guidelines stand intubation may still be the way to go, and by intubating the patient you may free up valuable resources. I always have an ICU/OR/anesthesia nurse present who can maintain any advanced airway or ventilate the patient if necessary so for me it wouldn't tie up any more hands to not intubate the patient. \n\n**Summary**\nHigh quality CPR and defibrillate as soon as possible. The rest is mostly guesses.",
    "title": "Data behind ACLS guidelines for medicines",
    "subreddit": "medicine",
    "timestamp": 1497702505,
    "score": 307,
    "keyword": "european manager"
  },
  {
    "text": "[M27]My second year of teaching has been an absolute nightmare. close to giving up. Hello, fresh European teacher here. This might be a wall of text, but would appreciate any input. After i finished my education i went to work at a school close to my hometown. Although my class was not the easiest, especially one kid was out of control a lot of times, i really felt like i did a good job my first year. My colleagues were amazing, the working enviroment was great, and i really cared for my pupils by the end of the year. Unfortunately my position was only temporarily, so i started looking for jobs elsewhere. After getting some enouraging advice from a friend living in a city, i got a job offer from there and decided to take it. So i packed my stuff and went to a city quite far from where i grew up. I was excited.\n\nI teach a 7th grade in a primary school, on a team with a teacher-student and an assistant. I noticed very early on that something is just \"off\" about this school. Terrible structure, lack of resources, awful leadership and a split working-enviroment. But worst of all is my class. I have \"only\" 19 students, but of these students, six of them are a complete nightmare. They are all potentially aggressive, ADD, learning problems, lacks respect, and pretty much requires someone to look after them most of the time to be able to get anything done.\n\nThe teacher-student i'm working with, is often gone for a week or even several weeks in a row, and the assistant also frequently. Add to this, the teacher-student is the most obnoxious person i've ever worked with, and it's pretty much impossible to get to an agreement with her. She acts as if she owns the school, takes control, very rarely look prepared for her lessons, and she doesn't do any planning when she goes away, meaning more work for me. I was never told this was going to be my working situation when i accepted the position. When one of them or both of them are away, the administration doesn't replace them. I am left alone, with these kids that are pretty much just doing whatever they want.\n\nTo describe a typical lesson: Sometimes i have to use 10-15 mins just to get the class quiet and focused. These six students i have mentioned, pretty much think they can do whatever they want. They walk out of the classroom, roam the hallways, disturb the lesson by being loud/not raising their hands. Some days they are more of a handful than others. For example, if some of them have a particulary uneasy day, they could lock doors if i go out of the classroom, erase stuff from the whiteboard, put chairs in front of the door and just go around the school doing naughty stuff. So you can probably imagine having to deal with these particular students, and still at the same time manage 13 others. The behavior of these students also infect on some of the \"good kids\", which results in them being more uneasy as well. At the moment, i feel completely helpless and i look like a bloody idiot trying to teach this class. I get no respect, and very little support from my administration.\n\nSo you're probably wondering if i have just been letting them do whatever they want without trying anything. We've had several meetings with their parents and external organizing, but i feel like what is being discussed is always what WE can do better, or that WE are not doing a good enough job with these kids etc. I have literally handed them stuff on a silver platter, going head over heals to plan the lessons so that they can be taken care of, but they just DO NOT CARE AT ALL.\n\nA few months ago i contacted my union representative (not sure this is what you call it) and just told everything about my concerns and frustration. She has been amazing support and the case has been a high priority. I've had meetings with my boss, discussing things etc, but things are just not happening. I am starting to become completely miserable at work, and every day is about surviving, not learning. In my opinion, some of these kids shouldn't even be allowed to participate in my lessons, they act like they are at home. I have already applied for a transfer next year, or i might just move from the city. I still have to last out this year though, and it's going to be a nightmare. Any advice on what i should do? I have decided to meet with my boss to tell her i'm putting my foot down, and that this can't continue.\n\nThere is a lot between the lines here that i can tell more about if it's necessary. I just thought i wouldn't completely drown you in text.",
    "title": "[M27]My second year of teaching has been an absolute nightmare. close to giving up.",
    "subreddit": "Teachers",
    "timestamp": 1489844125,
    "score": 50,
    "keyword": "european manager"
  },
  {
    "text": "how do i continue after my first job situation? Hi Guys \n\nHere is a story about first “real” job after having finished my university degree within finance and management. \n\nPlease comment and ask some critical questions to help me reflect on the situation I got into. \n\nAlso I would like to know how to sell myself in the future. \n\nMy entry to the company\n\nIn August 2016 I started to work in a larger European diary company and started in the Scandinavian headquarter in Stockholm that is responsible for the product milk. Julius and Romeo hired me as an intern. Julius is the CEO of the business unit and is a very confident man with a MBA from Harvard. In his unit he had Romeo to lead the project department, this for example entails to take ideas and make them market ready. \n\nA year ago, Romeo received the assignment to make one idea market ready and he hired me as an intern so support him in the process. In the beginning of my entry I felt very excited because Romeo enabled me to being an entrepreneur in larger conglomerate. He had an endless backlog of tasks and I received the mandate to solve them solely. By that I mean tasks such as developing a go-2-market strategy, developing product requirements, developing the value proposition and doing pricing. \n\nAlso the supervision was extremely well organized. In the beginning Romeo and I had brief but very frequent talks in order to align. This was very helpful because we both needed to build trust. After a month or two I was so deep in the project that I did not require so much supervision anymore so Romeo trusted me to drive the business development of the product. Through Romeo I received great reputation in the business unit and Julius also started to give me some lightweight tasks that I mastered. \n\nMy internship however was limited to a specific time period. Romeo and I had few good talks about my future, and he hoped that I would continue in the company. \n\nAs such I was not reluctant to stay in the company as I had a great time and enjoyed the both Julius and Romeo as they were excellent boss’s. However I wanted to move to Copenhagen to go back to my friends and girlfriend. \n\nLuckily we had an operational site in Copenhagen, both Julius and Romeo talked with the local director in Copenhagen and they gave me the opportunity to start in Copenhagen.\n\nThe transfer to Copenhagen\n\nIn February 2017 Niklas the local director hired me.  I received the task to continue on the business development of the product that worked on in Stockholm and to work on some corporate development tasks. That meant that I closely with the sales department looked into sales targets and strategic partners. Together with one sales manager we created meetings with top clients and interesting partners for the product. \n\nHaving talked to Romeo, he was very excited. He loved that the Danish operational site created a good outlook for his project. \nFurthermore, I started to work on the corporate development project. I have a finance degree that means I had the theory in place however I looked for some guidance from Niklas to get start this project.  \n\nHowever a few months after I started Niklas started to neglect giving me the guidance and whenever he looked over it I received bad feedback. I checked with other financial analysts in the company and they actually liked my work. Additionally Niklas blocked any further development on the business development of the product even though Romeo and Julius loved the progress. \n\n8 months after I started at the Danish operational site I got fired due to mismatch between me and Niklas. I learned a few days afterwards that Romeo and Niklas hate each other and feels that I have been in the middle of a political battleground.",
    "title": "how do i continue after my first job situation?",
    "subreddit": "careerguidance",
    "timestamp": 1510406644,
    "score": 7,
    "keyword": "european manager"
  },
  {
    "text": "Hello! Looking for career advice! What path would you recommend? Hello!\n\n&nbsp;\n\nI have a degree in Electronics and Communication Engineering, and 3 years and 2 months of experience in QA Software Testing. I really liked the job I did - test products that the company periodically came up with for sale, Coffee Beans, Travel and Living, I liked the products more than the actual job of testing (websites, backend entries, product flow), and I enjoyed \"client\" communications (I worked in an offshore establishment) and within the team, as compared to the technical task at hand. Especially the few \"product\" meetings that we attended, which put the developer to sleep, but I totally enjoyed sitting there, understanding the nitty-gritties that went into product development.\n\n&nbsp;\n\nSo I was wondering if there was some path I could take into Product development? I am currently on a sabbatical, took time off work last April to sort some personal stuff, and to think about where to go. I'm ready to come back into action, and was wondering what would be the right direction to approach this.\n\n&nbsp;\n\nShould I take a degree in Product Management? I couldn't find many on Quora apart from MBAs which a lot of people didn't recommend, quoting experience as a better candidate. I don't live in North America, or Europe (Preferred locations, I live in Asia), and I think higher education is the best way into these countries. I'm fine with any European or North American country, though I would love it if it were in America, or Scotland (LOVE the countryside!)\n\n&nbsp;\n\nI'm also open to any other recommendations that you may have with respect to career paths, I'm pretty much open to anything. I don't have a \"this is how it is supposed to be\", as long as I enjoy the task at hand - solving problems, guiding a product through to completion, communicating with the team, having a good time!, I'm okay with pretty much anything, as long as it has growth and stability, from personal responsibilities point of view. I'm not particular about \"fast\" or \"slow\" paced jobs, any pace would do, as long as it was engaging, fun, and gave me enough to take care of my responsibilities and peace. Any other responsibilities that went with the job, like late night calls, sudden product disruptions, long weeks leading up to a release, and working from home on Holidays, are totally okay!\n\n&nbsp;\n\nMy profile summary is as below, what would you recommend I do? There are opportunities in my country to pick up where I left off, but the competition is stiff, and I am not keen to pick up with the same role, which is why I'm asking about the degrees/programmes, also I can afford to pay for them, plus I'm 27 and would love to get started right away with a move, but it looks like in order to do this, I will need either time (and luck, in my country, to approach this from a professional point of view), or a degree in the country of interest.\n\n&nbsp;\n\nWhat would be some good degrees/programmes to pursue? Does the University matter? What certifications should I also consider? What are the opportunities in these areas (North America, Scotland, and Europe), like? Are there some other paths you would recommend to Product Management?\n\n&nbsp;\n\nProfile Summary (Most Recent, first):\n&nbsp;\n\n* 3+ Years of Total IT Industry experience as Software Tester in Agile/Scrum\n&nbsp;\n\n* 1+ Years of Marketing/Client Communications in a Startup\n&nbsp;\n\n* 6 Months of Marketing Internship in an Educational Institution\n\n&nbsp;\n\nFeel free to ask for any additional details, will be ready to share!\n\n&nbsp;\n\nMany thanks!",
    "title": "Hello! Looking for career advice! What path would you recommend?",
    "subreddit": "careerguidance",
    "timestamp": 1506089024,
    "score": 9,
    "keyword": "european manager"
  },
  {
    "text": "29, How do I transition from China focused sales to a different sector? I'm 29, American, about 4 years work experience.\n\nBachelors in Political Science, Masters in East Asian Studies, both from decent state schools, top 50. Grades were decent, 3.33 undergrad, 3.87 graduate, though they could have been better. Full time work and studies don't go so well together. All my academic studies were geopolitical and financial system focused, with an emphasis on China.\n\nAs part of the bachelor's and master's degrees, I spent 2 academic years in China. Then worked there in the education marketing field for a British company for another 2 years. From this, plus the academics, I speak fluent Mandarin, and have a strong understanding of Chinese culture.\n\nI came back to the US, and used my small savings to start a company. It had initial interest from some investors, which spurred me to really give it some serious thought, but the investments fell through and I poured my savings into it thinking if one investor showed interest, another must be interested as well. Didn't work out that way.\n\nAfter that folded, I spent 6 months or so scraping by and applying for jobs constantly, and fell bassackwards into a position. Initially I thought it was a short term consulting role where the owner of a small manufacturer in the Chicago region wanted me to accompany him as a \"spy\" on a business trip to China with him. Things sort of escalated quickly and I took a full time role as the China regional manager for this smallish company out in the boonies south of Chicago. I told him that this wasn't what I was looking to do longterm from the outset, and agreed to help him reform his businesses China operations. I spent one year doing this, found new dealers, renegotiated the contracts, fired the deadweight, stopped the dirt, redid the Chinese marketing materials, and hired on some long term talent to take over and trained them up.\n\nAfter one year, I shifted over to a part time position, as sort of an on call consultant, in addition to whatever else might be needed, because I was going to go back to school for economics. I did not, sadly, get accepted to the programs I applied for. I applied for \"Ivy League\" level European Universities, because I already have a master's degree, and I don't think it makes a lot of sense to get a second unless it comes with the networking potential of a top tier school. Thus I'm in a pickle. I have a year before the next intake for schools, with no guarantee again that I would even get in. I have rent to pay, and zero interest in continuing in my current job.\n\nI've been doing China, nearly exclusively, for almost 10 years now, and I need to branch out. It's lost it's allure, I don't enjoy it. I want to get into financial consulting, or management consulting or geopolitical analysis, or even journalism, something that is more generalized. I don't have anything against doing something that involves China in some way, but I do not want to do it exclusively anymore. I've been applying for Business Analyst, Financial Consultant, Global Strategy Analyst, Risk Analyst these types of positions, through LinkedIn in the Chicago area for many months now. I haven't had any responses though, can't seem to get through the HR filter. The only interview I had was in October, for an exclusively China focused position in Washington, for $43k a year which I didn't take. I'm not sure where to go from here...",
    "title": "29, How do I transition from China focused sales to a different sector?",
    "subreddit": "careerguidance",
    "timestamp": 1497536182,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Changed Jobs, got something different than promised, hate the commute, got better riskier offer (+/- 8 working days in new job) - sweat it out or take the risk? My current situation.\n- renovating the house\n- 2 young children\n- a wife that is away quite a lot (General practitioner)\n\nI (passionately) worked as a lead developer in national radio for 6 years now.\nAt the radio I had all the flexibility I needed.\nI have lost the passion for developing a little and am trying to focus more on becoming a product owner (business side). So I got all these certificates (project manager / certified PO / ...). \n - personal note - \nI think developers don't have much work when older than 45.\nI also think that fits my personality very well (ex sports coach and youth movement animator ...).\n - end personal note - \n\nSo I left the lead dev job 1 month ago and joined the European Commission (to become a PO, but they promised me a position and changed it the day before I started) .\n\nThis thing is very impractical for me at the moment\n- at the EC I need to work longer hours\n- the commute is longer (Brussels Center is a traffic nightmare)\n- I am not in a position I want to be in\nI have the feeling this is not the right place for me.\n\nHowever\n- I love the international atmosphere\n- the team consists of very smart people which I can relate to a lot\n- They work on a very important product and I have technical expertise in\n- There is a lot of possibility to improve and I think I can help there\n\nShould I Sweat it out (doing not much at the time, but not very good ad this).\nThings might improve, try to make it work.\nOr should I change now (am a bit scared to lose the opportunity to come to EC again).\nI I exit there is two apparent options\n- first there is a water chance that I could be PO in the radio in an exciting project where the people want me (and I know exactly what is expected an to be done).  \n- I have another alternative (starting/leading an AI project) with more risk, more insecurities and similar pay. \n\nAny advice is more than welcome.\nWhat would you do?",
    "title": "Changed Jobs, got something different than promised, hate the commute, got better riskier offer (+/- 8 working days in new job) - sweat it out or take the risk?",
    "subreddit": "careerguidance",
    "timestamp": 1503564231,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "From Aerospace to CS: embedded or simulation? Hi there, I'm at a cross road and gathering infos to help me decide my next move and maybe transition into CS. I would really appreciate your feedback. Thanks! \n\n**Background**\n\n* European, 29 (M)\n* Aerospace engineer (MSc.), speak fluently 4 major EU languages (so this is not a limitation for going to another country).\n* Currently unemployed: Worked as a project engineer for a couple years in a toxic department (there was mobbing to colleagues and other unpleasant stuff from our boss) and the tasks I was doing where actually totally different and shitty than what they promised and what I signed up for, which put me into a career-hole without learning/getting experience that was relevant to my goals. This, objectively speaking, I think could have derailed my career. I left and worked for a start-up a bit more than half a year and then launched my drone start-up, which was looking good but after 1y later is failing due to a couple major reasons and decided on pulling the plug. \n* Been looking for a job for the last couple months without luck. No calls, directly dumping my application. It seems the EU market is not yet recovered from the crisis (or that they don't like me having tried the start-up environment and think I'll quit \"soon\" to a start-up again?) and the US may have Aerospace jobs but I can't work there due to ITAR (visa) requirements not being US citizen. \n\nSo I'm seriously considering getting more into CS and looking at embedded or simulation SW engineering (most of the offered jobs I see are for SW). However, in the past 2 years I've been doing more business/management roles in the start-up world and my hard skills are too rusty to get a job now (which I really need in 1-2 months tops).\n\nIn addition, my last SW engineer role was a 1y internship work (I did the same as the fully-paid employed guy next to me) in an important EU firm doing SW simulation in R&D, but haven't really programmed in the last 5 years now.  \n\nI am trying to get a project manager job now since my current skill-set is best suited for that, and would like to pick up more SW skills & experience and transition into IT project management.\n\n\n**Questions to you**\n\n* How does the embedded market look like now? and the simulation (flight simulation, physical modelling, etc)? How did you get there? (interested in US but also specially in EU)\n* Those that are project/product managers in IT, is it worth getting into? what path did you follow?\n* Any tips & tricks on a strategy for getting a job would be appreciated. \n\n\nPD: just noticed another recent post about embedded. Is something up with it?\n\nEDIT: formatting and content.",
    "title": "From Aerospace to CS: embedded or simulation?",
    "subreddit": "cscareerquestions",
    "timestamp": 1490351439,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Should I stay or should I go? Hey guys,\n\nkind of in a weird situation right now and I figured out I could ask for some input from more experienced developers. Throwaway for obvious reasons.\n\nSo, I live on canada and I graduated as a CS major from a fairly average university a couple of months ago and I managed to get a job as soon as I got out for a european consulting firm that also has offices in canada. When I got hired, the original plan was to work on a small website using new technologies (mostly .Net 4.6/Angular4 stuff, I have been doing web dev for a couple of years but never got the chance to really use newer stuff) in their canadian offices under a senior dev supervision for a slightly under-average salary (around 50k CAD) then moving to their european offices (located somewhere in france) at the end of the summer and starting to work as a consultant for 40k-ish euros a year, which is very decent for a junior dev in that area, and also includes great benefits such as 6 weeks paid time-off.\n\nNow, since I started working here, the senior developer that I mentionned earlier has been giving me extremely positive feedback, and jokingly asked me at least 3 or 4 times if I was really sure that I wanted to move. Well lo and behold, one of the local managers asked me to come meet them in their office this afternoon and told me that based on the senior's recommendation as well as their own observation, the company was willing to offer me an intermediate position on the senior's team here in Canada. Their initial offer for this position is 85k salary (which is extremely high for someone in my position), 5 weeks paid time-off, paid common transportation card, paid training, and the team also has to go to Paris every once in a while, so I would probably get the chance to travel as well. In all honesty, my plan really was to move out of Canada for a few years while it's still super easy, travel around Europe for a while, then come back and figure out where to go from there, but I feel like turning down an offer like that would be kind of foolish on my part. Has anyone ever been in a similar situation before? I am really confused right now and would really appreciate some input.\n\nThanks!",
    "title": "Should I stay or should I go?",
    "subreddit": "cscareerquestions",
    "timestamp": 1499299203,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Midwest (USA) to Europe (Paris) -- internship application questions throwaway account because my other other one is already too dedicated to other subreddits. \n\nI am currently a 3rd year computer science student in the midwest region of the US. I have had 1 year experience in project management (internship january 2016 - december 2016) and what is about to be 1 year experience in web software development (internship january 2017- december 2017). I recently saw a posting for an internship position in Paris.\n\nMy question is, should I create a \"european\" style resume? do they expect something different from what is considered the [standard resume](https://www.careercup.com/resume) in the united states? Do European recruiters/hiring managers like to see cover letters? \n\nIf it changes anything I am fluent in both english and spanish, and have intermediate to advanced competency in French (speak and read, writing is hard but can be done). \n\nBest, and thanks in advance.\n\nEdit: any opinions on if it's harder to get a job in europe because of being out of country would be cool, too.",
    "title": "Midwest (USA) to Europe (Paris) -- internship application questions",
    "subreddit": "cscareerquestions",
    "timestamp": 1506610159,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Anwered all technical questions, but I was not motivated enough? I was going through the hiring process for an internship for a very big european software company (not big 4). I passed the online test and the on site assesment. A week later I had an interview with two lead dev managers. They asked me questions about my past internship the project I have worked on and than countinued with like an open ended discussion of algos and DS (sorting, hash tables, basic graph algos) Than I was given a very simple whiteboard task that I did in 10 minutes. I am sure I answered all of the algo questions correctly, the only one I could not answer was how quicksort works(just slipped off my mind :p).  \n\n Yesterday I got a call from a recruiter and they told that I did very well on the tehnical tasks and tests but I did not seem motivated enough which did not make a good impression(???) so I am rejected... This came as a schock for me, because this sub taught me as long as I ace the tech questions I will be good.",
    "title": "Anwered all technical questions, but I was not motivated enough?",
    "subreddit": "cscareerquestions",
    "timestamp": 1500727983,
    "score": 0,
    "keyword": "european manager"
  },
  {
    "text": "Considering a career in IT Audit, good idea ? Hey everyone !\n\nI’m currently finishing up my studies (Bachelor/Master of commerce, general management at a target European school) and I’m kinda lost… \nI wanted to get some advice from you regarding the profession of IT Auditor at a big4.\nI think I’ve pretty much read all the topics on IT audit on reddit, very informative, but I still don’t know if it’s for me. \nAt first I had always aimed at financial audit or TS/TAS and M&A but now I know that I hate accounting, and I tend to get dizzy looking at DCF models on excel and complex financial statements…\nI understand that the appeal for IT audit is less hours (although not always verified, guess it’s gonna depend on your manager/industry/clients/team/office) and slightly better pay, the downside being less diverse exit opportunities.\n\n But I still can’t get what you do day to day, I realize that for many it’s all about control testing and screenshots but does it actually get better over the years ? Is there any room for project management, or anything interesting? I’ve read a lot of topics where people seem to advise to not get into this field, but I mean a lot of entry level jobs will essentially consist of grunt work, even in consulting and especially in financial audit. Do you actually find something meaningful or something that you enjoy being an IT auditor or do you just go along cursing the day you chose this career ?\nAnother reason I’m considering this career is because I know there is a high demand for IT auditor and I want to move to Canada (currently in France), I know it will be much harder if I choose to go with financial audit or even consulting (probably too much competition)\n\nI could go for consulting, but I feel the field is so vast it’s even harder to get a clear picture of what I would be doing, and in consulting you never really know what you’re in for, so basically it will all depend on what kind of mission you’ll be staffed on, and that will affect the rest of your career as well as your exit opps (so less control in consulting, correct me if I’m wrong) \n\nThanks for reading me ! I’m open to all feedbacks 😊",
    "title": "Considering a career in IT Audit, good idea ?",
    "subreddit": "Accounting",
    "timestamp": 1507758803,
    "score": 9,
    "keyword": "european manager"
  },
  {
    "text": "How to Bounce Back from a Rocky Start So, to keep it brief: I started a few months ago at an up-and-coming European firm in its country of origin, with a decent amount of work experience but no real consulting experience.\n\nFirst few weeks, don't get any training or anything like that; it's a young firm so isuch things haven't been quite formalised yet, so - OK. \n\nWe get a mission, 2 weeks since my start date. We are two junior consultants + our sectorial team's partner at 20% + an independent consultant who's worked with our partner at 70% as manager (but doesn't really *supervise* the way a senior consultant or in-house manager might. I have the \"project manager\" role; I have some experience with it, but not in the same context.\n\nMere days after kick-off, our partner goes mysteriously on sick leave (without getting into details, there's some firm politics). So we're a bit aimless at the start. Eventually, another partner is brought in and rights the ship. But unfortunately, many mistakes were made before and after, quite a few made by me through inexperience and hesitating (I'll own up to that). \n\nAlso, as the replacement partner never failed to remind me, my skill in the local language was somewhat lacking. Full disclosure - I am bilingual, but said local language is decidedly my second language, though I'm far from incompetent in it. Some mistakes here and there, and it seemed clear to me that Replacement Partner didn't have the patience to help me out or cover for some of the mistakes I may have made. His tone when I asked for clarifications on his requests made his impatience quite apparent (to me anyway).\n\nMy colleague, for her part, was of the opinion that putting two junior consultants on a mission of that nature (and importance) didn't seem such a wise idea, but our staffing situation made things complicated.\n\nAnyway, I get replaced. \n\nIt sucks - I'm really bummed about it. It's embarrassing (for me), and not a great way to start my career at this firm. In fact, I'm sure such a rough start could have meant they let me go before my trial period is over BUT so far I'm set to be put on another mission (with, of course, higher scrutiny and the expectation I step up).\n\n**So, what do I do, considering the limited training opportunities available and risk that I end up without a dedicated senior resource to guide me and help out (at least at the beginning)?**\n\nFeel free to ask for details on mistakes I made : globally, it was not doing project management right : not keeping up the rhythm and making sure actions were followed up on correctly or promptly. I can't be sure I'll get a similar role in future, of course, but it's good to know I guess...",
    "title": "How to Bounce Back from a Rocky Start",
    "subreddit": "consulting",
    "timestamp": 1512511950,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Thinking out loud Hey guys, \n\nI lurk the sub every once in a while and haven't come across an answer to this question, so I was wondering if you all had any ideas. Apologies if this breaks any rules. I understand the life of a consultant is a grind and very time consuming, so this may be a bit of a different scope than this sub normally handles. \n\nBut as someone about to graduate college, with work experience at one of the largest asset management firms in America and at a European foreign relations think tank/political advising & communications firm, I think I have a pretty decent grip on things like business processes, PR, macro and legislative impact. Some friends are also interested in this with their backgrounds being in accounting and law.\n\nI will be returning to work at that asset manager full time, but I was hoping to do some consulting independently as a secondary source of income. I know, I know, its a huge time drain/takes a lot of energy. Even more of a concern, why wouldn't people just go to a full time firm that can commit teams of people to their problems. \n\nI am not planning on this being any type of primary business venture, just some supplementary income. I would focus on small business clients obviously, but we have been struggling to identify either industries or how to identify specific companies who could benefit from our services. \n\nAny ideas on how to bootstrap a consulting business? Tips?\n\nThanks guys. Again, apologies if this is not exactly within the scope of the sub",
    "title": "Thinking out loud",
    "subreddit": "consulting",
    "timestamp": 1486579453,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "\"Feminism: A Very Short Introduction\", by Margaret Walters - The religious roots of feminism Excerpt from \"Feminism: A Very Short Introduction\", by Margaret Walters \n\n[Amazon link](https://www.amazon.com/Feminism-Short-Introduction-Margaret-Walters/dp/019280510X)\n\n\n***\n\nSome of the first European women to speak out for themselves, and for their sex, did so within a religious framework, and in religious terms. It is perhaps not always easy, in our secular society, to bring them back to life: to recognize fully their courage, or to understand the implications, or the extent, of their challenge to the status quo.\n\nFor centuries, and all over Europe, there were families who disposed of ‘unnecessary’ or unmarriageable daughters by shutting them away in convents. For some, this must have felt like life imprisonment; but for others, conventual quiet seems to have facilitated genuine fulfilment: it allowed some women to develop a talent for organization, and some were able to read and think, and discover their own distinctive voices. Hildegard of Bingen, who was born at the end of the 11th century and became a nun, and later the abbess, of a small Rhineland convent, has long been known as a remarkable and impressive writer; recently, her great musical talent has been rediscovered and celebrated. But she was sometimes plagued with doubts about her ‘unfeminine’ activities, and wrote to one of the leading churchmen of the time, Bernard of Clairvaux, asking if she – an uneducated woman – should continue with her writing and with composing. He encouraged her, and within a few years she was known and honoured all over Europe. When she was 60 years old, she embarked upon preaching tours all through the German empire, even though at that time only priests were allowed to preach.\n\nLike other medieval women, when seeking to imagine the almost unimaginable, and to communicate her understanding of God’s love, she turned to womanly, and specifically maternal, experience, and wrote of the ‘motherhood’ of God. ‘God showed me his grace again’, she writes, ‘as . . . when a mother offers her weeping child milk.’ Some religious women imagine, with maternal tenderness, the infant Jesus. A Flemish Beguine meditates on what the mother of God must have felt:\n\n>for three or more days [she] held Him close to her so that He nestled between her breasts like a baby . . . sometimes she kissed him as though he were a little child and sometimes she held Him on her lap as if He were a gentle lamb.\n\n‘Just because I am a woman, must I therefore believe that I must not tell you about the goodness of God . . . ?’ asked the Englishwoman Julian of Norwich in the early 15th century. She marveled that ‘he who was her Maker chose to be born of the creature that is made’. Moreover, she argued:\n\n>our Saviour is our true mother in whom we are eternally born and by whom we shall always be enclosed . . . We are redeemed by the motherhood of mercy and grace . . . to the nature of motherhood belong tender love, wisdom and knowledge, and it is good, for although the birth of our body is only low, humble and modest compared with the birth of our soul, yet it is he who does it in the beings by women it was done.\n\nWhereas other women had made the analogy briefly, Julian of Norwich goes on to spell out the comparison very directly. Christ is like\n\n>the kind, loving mother who knows and recognizes the need of her child, and carefully watches over it. The mother can give her child milk to suck, but our dear mother Jesus can feed us with himself, and he does so most generously and most tenderly . . .\n\nMargery Kempe, a contemporary of Julian’s who travelled from her Essex home to visit her, produced an account of her own life – probably dictated to a scribe – that has been described as the first autobiography in English. Her life story reveals, only too clearly, why her self-preoccupation and her melodramatic acting out of her own miseries infuriated so many people who came into contact with her. But her story is also, unexpectedly, a deeply touching one; and more than that, it is impressive simply because she insists on taking herself and her experiences seriously. Margery came up against the painful and terrible aspect of the motherhood that had inspired the celibate Julian. She was miserably ill all through her first pregnancy, and after a prolonged and very painful birth, was left exhausted and depressed: ‘what with the labour she had in childbirthing and the sicknesse going before, she despaired of her life’. At times, she came near to killing herself. She was comforted, she recalls, by a vision of Christ, in the form of a handsome young man sitting at her bedside; he informed her that ‘you may boldly, when you are in bed, take me to you as your wedded husband’. But it was only years later, and after 14 pregnancies, that Margery finally managed to negotiate a deal with her demanding mortal husband: if he stopped insisting on sex, she would pay off his debts, and forgo her strict Friday fast to eat and drink with him. He agreed, though with a hint of sarcasm that echoes nastily across the centuries: ‘May your body be as freely available to God as it has been to me.’\n\nWith remarkable energy and determination, Margery then set out across Europe on a pilgrimage, and though her constant weeping and wailing so infuriated her fellow pilgrims that they abandoned her en route, her courage – and obsessive determination – enabled her to reach Jerusalem, and eventually to get as far as Constantinople.\n\nBy the late 16th century, increasing numbers of women were beginning to argue their case more consistently and more aggressively, though still within a religious framework. The Reformation enabled more women to receive an education. In\n\n1589, in what one historian has called ‘the earliest piece of English feminist polemic’, Jane Anger took up a challenging position by insisting that Eve was superior to Adam: a second, and hence improved, model. Whereas Adam was fashioned from ‘dross and filthy clay’, God made Eve from Adam’s flesh, ‘that she might be purer than he’, which ‘doth evidently show how far we women are more excellent than men . . . From woman sprang man’s salvation. A woman was the first that believed, and a woman likewise the first that repented of sin.’ Anger then descends crossly, and comically, to everyday domestic life. It is women, she reminds us, who make sure that men are fed, clothed, and cleaned: ‘without our care they lie in their beds as dogs in litter, and go like lousy mackerel swimming in the heat of summer’.\n\nBut any woman wanting to defend her sex had to tackle powerfully negative scriptural images of women: Delilah was treacherous, Jezebel murderous, while Eve was directly responsible for the Fall of the human race: ‘the woman tempted him and he did eat’. Saint Paul was regularly invoked against any woman who spoke out, or asked awkward questions about the Church’s attitude to women: ‘Let your women keep silence in the churches, for it is not permitted to them to speak’, he instructed the Corinthians. And again, in the epistle to Timothy, ‘if they will learn anything let them ask their husbands at home: for it is shame for women to speak in the church’.\n\nGradually, a few women found the confidence to defy these scriptural prohibitions. Some offered dissenting interpretations of Genesis, arguing that Adam was, after all, as much to blame for the Fall as Eve. So, in 1611, Aemilia Lanyer reminded her readers that Christ\n\n>was begotten of a woman, born of a woman, nourished of a woman, obedient to a woman . . . he healed women, pardoned women, comforted women . . . after his resurrection, appeared first to a woman.\n\nAnd Rachel Speght sardonically remarked in 1617:\n\n>If Adam had not approved that deed which Eve had done, and been willing to tread the steps which she had gone, he being her head would have reproved her, have made the commandment a bit to restrain him from breaking his master’s position.\n\nOthers insisted that God had signalled his forgiveness by making Mary, a descendant of Eve, the mother of Christ.\n\nIn the course of the troubled 17th century, particularly among the sects, the many and various small groups that rejected the established Church in favour of purer forms of worship, women found more freedom. Some, at least, felt inspired to preach or to prophesy. Modern historians have pointed out the important role of women among the religious separatists who fled persecution in late Elizabethan England by emigrating to America or to Holland, as well as their activity as preachers. Women were active, too, among the small dissenting groups that managed to survive underground in England, until, during the Civil War and\n\nInterregnum, they emerged dramatically and vocally. Keith Thomas lists some of these independent congregations: Brownists, Independents, Baptists, Millenarians, Familists, Quakers, Seekers, Ranters. Whatever their theological differences, they all believed the necessity for spiritual regeneration in every individual. The experiencing of what Quakers called the ‘Inner Light’ was more important than external observance – and that light knows no sexual distinction. As one contemporary writer claimed, ‘one faithful man, yea, or woman either, may as truly and effectually loose and bind, both in heaven and earth, as all the ministers in the world’.\n\nVarious independent congregations had, for some time, been allowing women to debate publicly and to vote on matters of  Church business; by the 1640s some, particularly among the Quakers, were going further. In 1659, the Quaker Fox argued that ‘Christ is in the male as in the female, who redeems from under the Law . . . Christ in the male and female, who are in the spirit of God, are not under the Law.’\n\n‘Might not the spirit of Christ, that is begotten of God in the female as well as the male . . . speak?’ asked Katherine Evans and Sarah Chevers. Increasingly often, women felt moved, divinely inspired, to speak in meetings and even at service, though they were often greeted with bitter opposition. They were criticized for being ‘puffed up with pride’ and ‘vainglorious arrogance’, and even worse, for ‘usurping authority over men’. In 1646, for example, John Vicars complained bitterly about ‘bold impudent housewives . . . without all womanly modesty who take upon them . . . to prate . . . most directly contrary to the apostle’s inhibition’.\n\nJohn Bunyan was totally opposed to this active participation by women, arguing that Satan, inevitably, tempts the weaker Eve, rather than Adam: ‘the man was made the head in worship, and the keeper of the garden of God’. He referred to women as ‘that simple and weak sex’. Citing the first epistle to the Corinthians, he argued that women are ‘not the image and glory of God as the men are. They are placed beneath.’ He disapproved of separate women’s meetings, which did nothing but encourage ‘unruliness’. ‘I do not believe they [women] should minister to God in prayer before the whole church,’ he insisted, adding sarcastically, ‘for then I should be a Ranter or a Quaker.’ In any public gathering, ‘her part is to hold her tongue, to learn in silence’\n\nEven in the 1670s, that courageous Quaker Margaret Fell still felt the need to defend women’s independence of conscience, and their right to play an active part in worship. In a tract called Women’s Speaking Justified, she argued emphatically: ‘Those that speak against . . . the spirit of the Lord speaking in a woman, simply by reason of her sex . . . speak against Christ and his Church, and are of the Seed of the Serpent.’\n\nThe prophet Joel was sometimes cited as an answer to Saint Paul’s prohibition spirit upon all flesh:\n\n> . . . and your sons and your daughters shall prophesy, your old men shall dream dreams, your young men shall see visions: And also upon the servants and upon the handmaids in those days will I pour out my spirit. And I will shew wonders in the heavens and in the earth, blood and fire, and pillars of smoke.\n\nJoel’s ecstatic vision seemed, to many, particularly relevant during the great upheavals caused by the Civil War and the Interregnum; there was a widespread feeling that apocalypse was, indeed, imminent. The sect who styled themselves Fifth Monarchists, for example, believed that the world’s four great secular empires – Babylon, Persia, Greece, and Rome – having passed away, the fifth – Christ’s Kingdom and the rule of the saints – was close at hand. In this feverish and volatile climate, prophets, many with revolutionary ideas, flourished.\n\nIn this area, a woman’s supposed passivity, her receptivity to outside influence, could, ironically, be claimed as an advantage: she might prove more receptive, more open, to becoming a channel for the voice of God. The Belgian prophet Antonia Bourigue, who was widely read in England, produced a disconcerting and double-edged justification: ‘they ought to let God speak by a woman, if it be His Pleasure, since he spoke in former times to a Prophet by a Beast’.\n\nBut the line between prophetic inspiration and lunacy, between possession by God and by the devil, was a narrow one. In 17th-century England, women were still being tried for witchcraft. Moreover, female prophets could easily be dismissed as merely crazy. Lady Eleanor Davis, for example, had been claiming divine inspiration for years; early one morning in 1625, she heard ‘a Voice from Heaven, speaking as through a trumpet these words, There is nineteen years and a half to the Judgement Day’. She went on to publish tracts that were interpreted as predicting, amongst other things, the death of Charles I. Her husband burned her books; and she was often the butt of jokes. An anagram of her name – Dame Eleanor Davis: Never so mad a ladie – was gleefully circulated. But her visionary fervour put her at real risk; even her rank could not protect her from charges of treachery. In 1633, after being charged before the High Commission that ‘she took upon her (which much unbeseemed her sex) not only to interpret the Scriptures . . . but also to be a prophetess’, she was fined and imprisoned in Bedlam. But she came into her own during the Interregnum, when many of her prophecies seemed to have been realized. She went on to publish at least 37 tracts between 1641 and her death 11 years later.\n\nAnother prophetess, Anna Trapnel, experienced some kind of revelation at a Baptist church in London. By 1652, she had joined the Fifth Monarchists, and in 1654, she accompanied a male preacher to Whitehall, where she fell into a trance that lasted for 12 days. Crowds gathered to hear her prophecies – and her harsh criticisms of Oliver Cromwell and his government – which were recorded in Strange and Wonderful News from Whitehall and The Cry of a Stone. She insisted – in verse – that God’s message was addressed to women as well as men:\n\n>John though wilt not offended beThat handmaids here should sing, That they should meddle to declare The matters of the King . . . .\n\nThe authorities labelled her as mad, but still brought her to trial. ‘The report was that I would discover myself to be a witch when I came before the justices, by having never a word to answer for myself’, she said. But her sheer volubility defeated the court, and she continued, undeterred, with her prophecies. Cromwell’s government undoubtedly took this kind of prediction seriously; several times, he and his council were interrupted by, and seriously listened to, prophets, several of whom were women.\n\nThe appeal to divine inspiration was probably of limited value as a means of female emancipation; the feminism of the future would depend less on the assertion of women’s spiritual equality and more on natural rights, and a denial that there is any intellectual difference between the sexes.\n\nBut there were political implications to this outburst of religious fervour. In the 16th century, the Anabaptists had recognized women as equal to men, and allowed them to pray and speak in meetings. Women from the congregations who styled themselves Levellers seem to have been particularly active on a larger stage, and showed considerable political shrewdness. The sect encouraged women’s activity, believing in the equality of all ‘made in the image of God’. In the 1640s and early 1650s, when many of their husbands were in prison, Leveller women repeatedly turned up en masse at\n\nWestminster – staging what sounds very like contemporary ‘demonstrations’ – to demand freedom for their husbands, but also to complain bitterly about their own, consequent hardships. They were usually treated harshly, and rebuked for meddling in things beyond their understanding. The crowds of women who petitioned for peace in 1642 and 1643 were dismissed contemptuously as ‘Whores, Bawds, Oyster women, Kitchen maids’. Three hundred women, who presented another petition to the House of Lords, were rejected out of hand by the Duke of Lennox. ‘Away with these women,’ he exclaimed, adding, with a jeer, ‘we were best have a Parliament of women.’ In May 1649 yet another petition for the release of the Leveller prisoners was turned away sarcastically: ‘It was not for women to Petition, they might stay at home and wash the dishes.’ To which the women, unabashed, retorted, ‘we have scarcely any dishes left us to wash’.\n\nLater in that year, they tried again. As many as ten thousand women signed yet another petition, asking:\n\n>We cannot but wonder and grieve that we should appear so despicable in your eyes as to be thought unworthy to petition to represent our grievances to this honourable House. Have we not an equal interest with the men of this nation in those liberties and securities contained in the Petition of Right, and other good laws of the land? Are any of our lives, limbs, liberties or goods to be taken from us, no more than from men, but by due process of law . . .\n\nA thousand women carried it to the House with sea-green ribbons pinned to their breasts. Once again, they were dismissed scornfully.\n\nBut among the Quakers, particularly, women found the chance to develop their skills as administrators. Regular women’s meetings were set up alongside the men’s meetings in the 1650s; and though, from the beginning, women seem to have concentrated on traditionally feminine areas, such as welfare and moral problems, they had the chance to develop their own, very effective organization, which in fact handled considerable sums of money. However, historians have suggested that there was a gradual reduction in the scope of their concerns; by the 1680s, they were confining themselves to ‘womanly’ matters. In these later years, they concentrated on ‘such things as are proper to us, as the poor more especially and the destitute amongst us’. These included helping young men to find apprenticeships or work, and instructing younger women ‘to all wholesome things’, which included looking after their husbands, children, and homes, and always behaving in a manner that was ‘discreet, chaste, and sober’.\n\n***\n\nImage from the chapter: http://i.imgur.com/16cTngI.png\n\n*\"The scene is viewed with a hint of satire – though is it directed at the earnest speaker or at the inattentive audience? One is actually sleeping, others demonstrate disapproval.\"*",
    "title": "\"Feminism: A Very Short Introduction\", by Margaret Walters - The religious roots of feminism",
    "subreddit": "Feminism",
    "timestamp": 1504330039,
    "score": 4,
    "keyword": "european manager"
  }
]