[
  {
    "text": "How should I respond to an interview appointment scheduled only 15 MINUTES prior? I apologise for the English in advance since it is not my mother tongue.  \n\n\nI'm currently a freelance worker based in Asia, and I wanted to share a recent experience I had while exploring job opportunities abroad. I came across a European company that caught my interest, but there were a few red flags that popped up during our email exchange.\n\nAfter expressing my interest via email, their hiring manager responded, mentioning that they were intrigued but unsure about the hiring process for someone from a different part of the world. I replied respectfully, acknowledging their concerns.\n\nA few days later, the founder of the company reached out to me, expressing genuine interest and suggesting a chat on the same day or the following day, which happened to be a weekend. This caught me off guard since I had a lot of ongoing freelance projects to handle, and I wasn't available that day. I responded, letting them know I could chat the day after. The founder replied saying it was okay but unsure if they would be available the next day (even though they suggested the date options). In my response, I mentioned that I had a pretty flexible schedule on weekdays too for an interview.\n\nThen, out of the blue, the founder emailed me one day later, saying they would be available in the next 15 minutes and provided a Zoom meeting link. This made me wonder if it was my fault for mentioning my flexible schedule or if this was a normal practice that I should get used to. This really makes me not interested in their company anymore since the nature of my work is quite dependent on scheduling and organising and this whole situation just seems like a big red flag.\n\nI'd love to hear your thoughts and experiences. Has anyone else encountered situations like this during job interviews? How do you navigate such unexpected scheduling changes while maintaining your professionalism?",
    "title": "How should I respond to an interview appointment scheduled only 15 MINUTES prior?",
    "subreddit": "jobs",
    "timestamp": 1692619552,
    "score": 28,
    "keyword": "european manager"
  },
  {
    "text": "Dinner with the director - an opportunity to increase my promotion chances? Hey guys!\n\nMy career started rushing in some direction finally and I am facing some things for the first time. I believe I was doing good so far but the next one feels like a boss encounter. \n\nSome background:\nI am a member of a small support team, helping sales team digging out some documents that they need. I know how to do lot of things related to my job and I feel really good organizing stuff around to optimize what I do (i love Factorio) and I like to help people around as much as I can. Some time ago I had a meeting with my supervisor, during which we agreed to utilize my way of being, and also allow me to get some leadership experience by supervising any bigger / bulk projects that would require solving more than a single request. Now, every bulk requests lands first in my teams / mailbox to talk through the details like what exactly is needed from us, what is the deadline etc.. (since I had no prior management experience, this is more like a \"field training\" for me, which does not go with a position change). I have a few successful projects behind me, triggering some good words being spread around our management.\n\nOur company merged with another one, changing lot of things around and, of course, causing some controlled chaos that needs to be dealt with. You guessed it right - it is pumping up the amount of requests sent to the support team I work with, and to the level that might require hiring additional people. Additionally, the workflow will not go down because of a bigger number of customers. I know that thanks to my supervisor that told me about that and also warned about an incoming evaluation that our new owner company is running through all the branches. Since this has not been mentioned officially, this makes me feel kind of important part of the team that is \"included into the inner circle where extra info goes around\".\n\nThe point:\nOur European sales director invited us (our small support team and the sales team) to a dinner in some fancy restaurant. There will be all my direct and indirect supervisors and It all seems like finally coming together: the projects I supervised with a good result, the good words about me that reached them, rising demand for our support team, my resume having bunch of leadership trainings. There will not be a better moment for me to show myself as a good person as a solution to increasing workflow going through our team. \n\nThe boss stage:\nI am going to be in such meeting for the first time and I am worried that I might get overwhelmed and waste the opportunity. What Is good to do / not to do? It is a good chance to show myself but I don't want to appear...perhaps desperate?",
    "title": "Dinner with the director - an opportunity to increase my promotion chances?",
    "subreddit": "jobs",
    "timestamp": 1700725051,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Extend my probation for no reason? Watch me take a better offer. This is a fresh story. The year 2022, I leave a low paying tech consultant role for a 35% pay hike and a better job title of DevOps engineer.\n\nI join a team where the team lead is the MD of the firm. He made it clear pretty soon that he would not be making me or my teammate (who had been working there for 1 year at that point) a team lead. Which is fine by me, since I took this job up for the pay hike. Now my new pay is just above the average salary in the field, not a great pay but a decent one.\n\nMD used a be a developer himself, so he understands tech jargon. He’s also impressed with all my new initiatives for implementing Security in our cloud services. I enjoyed working at this firm for the first 2 months.\n\nThen there is a restructure. Now 75% of my work time is billed to a project where my MD (team lead) is not working. This project is for a huge European client and is run by a PO/PM. This PO/PM is not a technical guy and stresses on following the rules of “scrum”. \nScrum should be a way for clear communication, easing up the workload on the team, but it ends up creating more stress for me.\n\nI continue working as I used to, taking initiative, coming up with creative solutions to problems and just working on my tasks in the project, any way I see fit. This doesn’t fly with the PO/PM. He likes to maintain his control and make sure everyone knows he runs the project. Even though he doesn’t know anything techie, he feels he is perfectly capable of controlling a bunch of Developers, DevOps and QA Engineers. Maybe because his project management training instilled these beliefs in him.\n\nSo I continue working like this for 4 more months. Now I have completed 6 months at the firm. Till that point, I used to ask the MD for performance feedback, and he used to tell me the same thing. He used to tell me that he’s happy with my performance and even the team for the other project is happy with my performance. Fast forward to now, when it’s time to convert my probation to a full-time permanent contract, the PO/PM joins this meeting and creates a huge list of things that he feels I need to improve before my contract can be upgraded.\n\nAll the complaints that the PO/PM had were related to following the scrum rules, like not informing him before taking on a task, working on tasks which are not in the sprint, attitude adjustment etc. You get the point. So there was no reason like lack of technical aptitude for the job, it was behavioural and general reasons. This could always be fixed with a simple and honest feedback, but he felt it was important to extend my probation for another 3 months to see if my behaviour improves.\n\nDuring my hiring I had negotiated a deal where my salary would increase by a further 5% (remember 35% increase from my previous salary + 5% increase after probation). Now I was pissed, because I won’t get my 5% increase and my probation gets extended, that means I can be fired anytime.\n\nSo I polish up my resume and login to LinkedIn. I apply to hundreds of firms looking for remote DevOps Engineers. Also, I start asking for a much greater salary. So compared to my probation salary, my future salary would be 20-25% more.\n\nThe whole process of finding a new job, attending interviews, technical tests, negotiating a high salary takes a month.\n\nMeanwhile, at my job, I figure out that switching off my brain and just doing what the PO/PM wants, makes him very happy. He starts giving me positive feedback. Within a month he is impressed enough to redo the whole meeting with me and my MD. During the meeting he lists all the negative points he had against me a month back and how I have taken it off the list now by showing intent and good behaviour. I could feel the unease he was under while praising me. When I was asked for my opinion, I maintain that I have never had any problems with the team and I haven’t changed my working style as much as the PO/PM is thinking. I just stopped doing anything over and beyond.\nAfter that there was no logical reason to extend my probation or fire me. So after initially extending my probation for 3 months, they offered me the upgraded contract with 5% increase within a month. But I didn’t sign this contract, which sent some shockwaves among the HR and senior managers.\n\nRemember how I was floating my resume in the market looking for a better job and salary? That worked, around the same time when my new contract was offered. I got another contract for a Senior DevOps engineer with a focus on security initiatives (remember how I was doing that over and beyond?). My salary went up by 20% and I was assured that as the team grows I would be made a team lead too (which my MD clearly stated would not happen with my current firm).\n\nI signed the contract with the other company and put in my notice. Since officially I was still on probation, my notice period is only 1 month. Take out 14.5 days of vacation from that and you get my last working day.",
    "title": "Extend my probation for no reason? Watch me take a better offer.",
    "subreddit": "jobs",
    "timestamp": 1688057292,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Mechanical engineer, quit my dream job yesterday, got in a verbal fight with my boss, just want an opinion what you would do in that situation Hello everybody,  \n\n\nso three months ago I quit my student job where I had secured position for something what is my perfect job, working with renewable energy, solar panels etc.  \n\n\nWork should have been part time in my domestic country - part time in country 2000 km distanced, in a place not so accessible. Since I was still a student, I was also surprised they gave me a position (found it on linkedin, 66 applicants) because I worked before in auto industry and this was specificaly something related to thermodynamics which I knew but the job was to supervise one big project of one plant which should be done to the end of 2023. Something what I have never done but I told that I want to work here. Salary great, 1750 eur net with bonuses if that project ends well. In total, after one year I would get around 36 000 eur. I could have only dream about that. They even gave me a paid day if I was absent because of exams (3 days but I stayed almost everyday 30 minutes longer to level those hours).  \n\n\nStrange thing (which later ended even stranger) was that the boss has multiple companies assigned on his name but not many of those companies have some websites. They didn't even checked my english (although it is 3.5 out of 5) and I saw that they are in a hurry with all that.  \n\n\nAccepted the job, started to work after two-three weeks and same day I came, new secretary also started to work. First day we went to one event where they were one of main sponsors. From the beginning the story behind the company was a bit strange because they didn't have their own product, they were working with multiple partners. Basically, they had connections for everything.  \n\n\nThey told us they will be in office often but at the end, on average, only secretary and I were in the office (I know that's not too bad but let's avoid what everybody can think of now). They were in the office maybe once a week and every time they are in a hurry and they have maybe 20 minutes in that once a week for us. OK, they answered to the phone but I dodn't have anybody to teach me all those things about huge plant. They just gave me the papers but ok, I'm learned to teach alone although I hate that.  \n\n\nTime was passing and I saw that the project for which I'm assigned for is not even close to finished. I was told it is close to 90 % but honestly it is maybe 30-40 % and we need to be done in 6 months. If we are not done in 6 months, another company which wrote a tender for that project won't get european money for that. EU finance almost 50 % of that. Too less man were assigned for this job at the beginning, they forgot one highly important part when they made an official offer, they have verbal misunderstanding with almost every company they want to order some parts, technical documentation for most of the parts does not exist etc. I was writing project books, preparing some documents, and I got an ''order'' just to copy all the drawings we got from companies from which we buy some technologies and to past those drawings into one sheet which has our informations. So shortly, we are designers and producers. I'm pretty sure that's not how it should be done but ok.  \n\n\nThat project in that country is led by director's younger brother who is not even close educated and experienced to be in charge for this.   \n\n\nAfter some time I got one project to do with solar panels. Firstly I was doing that with younger brother and I found a company which can give us equipment and which can assemble everything because we basically don't do anything for that. I was just finding a company who can actually do this. Younger brother told me that we also have some apartments where those guys can sleep. Main client wanted everything to be done by the end of June. Found a company in few days, agreed everything, younger brother checked everything, everything was fine and we needed to pay 10 % before project for equipment. With that money the company would bring the equippment and they would finish the job exactly on 29.6. Those 10 % were like 2000 euros. Younger brother told me that they can pay it tomorrow, I told that to guys from that company we should have worked and they needed the money day after if we wanted job to be done at the end of that week. Everything seemed right. Day after, older brother (boss) told me we can't pay that, that we will send them a document that we agree to take the equipment. After two days, that job failed because my boss wanted to see them firstly, to have a conversation with them, to talk about other project and they needed money quickly because they had some other jobs arranged for next weeks. Maybe they would tricked us, but they were really cooperative and my boss had planty of time before official offer to arrange a meeting and to see them in person.  \n\n\nSomehow I managed to keep final client with us, found a new company, we had a meeting with that guy, and he told us he needs around 75 % in advance because he doesn't have the equipment on the stock. I was searching for smaller companies because client had one very very cheap offer from somebody else and I was trying to compete against that. We agreed everything, I needed to make a contract, and day after we needed to pay. Boss is caling me at 22:30, 75 % is way to much, we can do 50 %. We all were together at the meeting, we kne the price and now he is complicating again. But ok, I told him why we can't have 50 % and he agreed. That was last Friday. In Saturday, I had a coffee with that new company and they told me my boss told them that in Monday he will come to the location and that we will supervise the beginning of the project. I sent my boss immediately after that (so Saturday morning) a message for him to confirm me that. Sunday 21:30, he tells me that he didn't agreed that that I need to go to location. Ok, he is my boss I will do that.   \n\n\nWe checked the location, everything is great and we are coming back (4 hours by car) and I send my boss a message like can you confirm me the location for the apartments you told me you have so I can transfer that to new company. He sends me a message that apartments were not part of the deal that the guys should find it themselfes. Few minutes after that, car broke down, truck hit us but luckly only side mirror had some damage and I called boss like what is happening, you told me we have those apartments. He tells me we don't, like he told me that only for us to grab more money from final client. And we talked, argued 10 minutes. After that I thinked a bit, send a voice message that I quit, told him that I don't like this anymore, that I don't want to work like that and that in company there is no organisation. He then says me some things and says that I quit immediatelly when small amout of stress occures. Then I was a bit brash and sent a 8 minutes message, told him what everything is not fine in company and also gave some arguments that I work, study, had even 2 surgeries in last two years, try to have a privat life with all that etc. but that I can't allow anybody to tell me that I quit even with small amount of stress and expecially to a guy, my ''boss'' who saw me maybe 4 times. So I quit.  \n\n\nThat secretary wanted to quit a job even before me, probably two weeks passd after she started to complain about everything and really, nothing is organized in that company. I even say I will work to the end of this month. I'm really sorry, I have further plan but I don't know would you guys quit? Some friends are telling me that they would because there is no progress here, only problems, some wouldn't not because of the money but I don't want to work in a company where my boss is changing plans every 5 minutes.  \n\n\nWhat is your opinion?  \n\n\nThanks",
    "title": "Mechanical engineer, quit my dream job yesterday, got in a verbal fight with my boss, just want an opinion what you would do in that situation",
    "subreddit": "jobs",
    "timestamp": 1689180060,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Waiting for written offer, getting questionnaire emails I interviewed for a job with a large European Conglomerate that basically everyone has heard of (position is in US) and received a verbal offer from the Regional Manager yesterday (Thursday) afternoon. They mentioned a written offer letter would be coming from HR, but because they are pushing to get me more money, that it could take a bit, and to wait to put in my two weeks with my current employer. Today (Friday) I received two emails from their TA department, one a questionnaire on the interview process to this point, and the other a sort of “strength finder”. \n\nShould I be concerned they are trying to use these to evaluate that want to really offer me the position? Should I ignore them or at the least wait to fill them out until I receive my firm offer? Position is a Highly technical position.",
    "title": "Waiting for written offer, getting questionnaire emails",
    "subreddit": "jobs",
    "timestamp": 1689993865,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "How do people seek new career opportunities minimizing their exposure? The answer seems obvious, meaning just do this like all people do. But what if a professional or a manager has a pretty much secured job (still willing to change the company/industry) and they want to reduce their exposure as much as possible while seeking next job opportunity?\n\nAs the regional job market spefics or legal/system may matter, let it be the European Union.\n\nP.S. Feel free to call out paranoia :) Yet personal stories will be much appreciated.",
    "title": "How do people seek new career opportunities minimizing their exposure?",
    "subreddit": "jobs",
    "timestamp": 1687802776,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "I am looking for specific job-searching hacks Dear Everyone,  \n\n\nPlease let me tell a quick story from my recent job-searching journey:  \n\n\nA Swiss travel company was looking for someone (Swiss) who represents their company and its products across the APAC market. The APAC hub is in Taiwan.  The role is Market Manager APAC.  \n\n\nNow, it's a little vague but my 1st objective here is to ask you all if you've got experience in searching for roles back home and these companies are looking specifically for folks who represent their corporation in the APAC region? Maybe you've already got this kind of role, could you please share as well?  \nAnd 2nd, if you're specifically Swiss or European, could you please share more details such as where to search or any recommendations that you could think of.  \n\n\nThank you all and have a wonderful day!",
    "title": "I am looking for specific job-searching hacks",
    "subreddit": "jobs",
    "timestamp": 1691550504,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "New Position vs Cushy Current Position I know this may have been asked before, in multiple ways / threads...but I have a feeling mine may be different. I know only I can make the decision, but any advice would help.\n\n    TL;DR - \n    This new role could be interesting, and push me out of my comfort zone. Large learning opportunity, currently a pay raise, and keeping an apparent flexibly work life balance...with trust in what I can do (which current company struggles to show me). \n    The few cons of the unknown hold me back, as well as the ease of my current company and potential for more growth is keeping me lingering here...and not knowing how this might affect my personal life outside of work. But, then again, I can always walk away and find a more aligned position if it comes to it? More details below...\n\n**New Position:**\n\n* 26% raise over current Total Comp\n* Flexible work location and time variance (no set schedule, hybrid eventual remote..)\n   * Easier commute when in office (40 min vs 1 hr)\n* Interesting and impactful product\n* Start Up atmosphere (4 employee US, \\~60 employee global)\n* 3 - 5 year runaway plan for funding, and track record of success globally\n* Work with U.S. - CEO directly, who seems calm, level headed, European management style\n* They want my skillset and attitude.\n* Startup allows me to focus in on business as well as engineering (my vocation). I'm interested in business...\n\n**Cons:**\n\n* Current company has me inline for promotion (unclear on % raise though...). More responsibilities too, outside of engineering scope. But it's there.\n* Reliable current schedule, easy to build a routine from, and know when days remote are.\n   * I also have projects and Real Estate outside of work, that also needs some time. So now I won't have a consistent remote schedule (but still possible..)\n* Unknown risk and traction for this product in the US market **vs** my current cushy job.\n* Only engineer on US soil for the company (but, same with current team n manager...but closer to engineers)\n* Unknown if I will develop certain technical engineering skills vs other important skills that I will develop (hurts chances when applying online or via some recruiters)\n   * Note: Current job, I ***need*** to search out and find my own ways to develop these said skills since my manager is not an engineer, nor is my team. \n* I enjoy my current company, and some people ... but I don't particularly enjoy being in the office at certain times, since the people don't align with me and I'm forced with them.",
    "title": "New Position vs Cushy Current Position",
    "subreddit": "jobs",
    "timestamp": 1696265144,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Growing in a non-growing company. Should I jump ship? Dear all,\n\nLet me hear your thoughts on this tough possible next move in my career. I’m 3 years into my career doing very well in a midsized pharmaceutical company. I have been part of a management traineeship hence worked in various functions and built solid knowledge of the entire value chain and good connections (including in senior management). Next. I’m going to do an exciting maternity cover in a new role as business manager of an important region with high possibility to continue the role later. But… the company is not on a growth trajectory which will likely not change in the future. Now, I’m interviewing for an Analyst role in a reputable life-science VC fund in another European capital. It’s obviously a step down and I will loose 3 years of building a good reputation but new is always exciting and VC could present great opportunities later. What do you advise I do?\n\nThanks!!",
    "title": "Growing in a non-growing company. Should I jump ship?",
    "subreddit": "jobs",
    "timestamp": 1691685846,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Pregnant- how to tell my (American) boss - need advice Hi ladies, looking for some advice on handling the conversation with my manager about my pregnancy. Ideally from someone who has been in the scenario (on either side!) but any advice gladly taken. \n\nSome background- I am working for a large American company for just under a decade, but I am European and living in Europe and my contract is European. I have one child already - I took maternity leave from Dec 2021 to end July 2022. So I’ve been back at work over a year now. All my performance reviews have been exceeded expectations. \n\nAbout the job- my role is global though my manager and direct report sit in the US. I started as a junior member of the team and I’ve been running the team since end 2019. However, my career growth (read: pay) has been relatively stagnant because I’ve been very unfortunate- I’ve had at least 1 new manager a year and so each new manager I need to prove myself to, and they assume that my tasks are my “job” even though I’ve been steadily expanding my role every year. My job title has not changed since my old manager left and I took on her duties. \n\nAfter returning from maternity I was in the unique situation to be reporting back to a manager that I have previously reported to. I’m still on very good terms with my last manager and asked her opinion on career options/payrise. She said she had recommended it before her move. She advised me to ask about it immediately after returning, phrasing it like I had a lot of time to think on leave and I’m ready for the next step and my title should reflect my actual job. This went surprisingly well and my title was updated in the next month, along with some (seemingly) solid steps to getting to the next level.  \n\nHere’s the problem- I never got a payrise. When I expressed my disappointment with this, I was told it was in progress, they are different processes. A few months later I was told it was paused because annual review process was underway. Then there was a hiring freeze. Long story short this payrise has been dangled for a year with no update. My direct report is now basically outearning me (if you consider take home pay). I don’t begrudge her- I fought for her payrise. \n\nMy worry is the second I tell them I’m pregnant again, any hope of the payrise, and the move to director level disappear. There’s no guarantee that it’ll be the same boss when I return. I’m half thinking I say this outright- that I’m unhappy with the progress made and it’s making me reconsider my position but I cannot come down too strong as I have no intention of leaving right now. I feel like I rushed back from my first maternity leave and it made no difference. It’s making me second guess how long I should take this time. \n\nSorry for the long read, would love your advice!",
    "title": "Pregnant- how to tell my (American) boss - need advice",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1694000630,
    "score": 12,
    "keyword": "european manager"
  },
  {
    "text": "How Do I Switch from Finance to Product Management? Hi everyone! I am currently considering the transition to the career in product space. I have a master's degree in Management and Business Administration from a renowned European business school as well as previous degrees in international finance/investments. Overall I have around 3 years of professional experience -  1.5 years in corporate finance (EY, Deloitte) and a bit less than 2 years in venture capital. I am 25 years old and live in Netherlands.\r  \n\r  \nThe reasons why I am thinking about this transition now are the following:\r  \nI recently moved to Netherlands and feel like tech scene is one of the most dynamic, growing and well-paying options here\r  \nVery strong interest in tech fueled by my experience in venture capital\r  \nI am looking for a better work-life balance than in fields I worked in/qualified the best to work in (venture capital, consulting, investment banking etc.)\r  \n\r  \nMy questions are the following:\r  \n\r  \nWhat positions should I look at? (business analyst, product analyst..? product manager/owner is definitely too senior for me)\r  \nWhat is the best way to start the career in tech (job search, picking the role/company etc., do an internship first?)\r  \nWhat should I learn to increase my chances of getting the job given that I do not have any tech-related hardskills? (e. g. SQL)\r  \nHow does this career transition sound to you overall? Does it make sense?\r  \n\r  \nAny insights are appreciated! Thank you very much in advance.",
    "title": "How Do I Switch from Finance to Product Management?",
    "subreddit": "careerguidance",
    "timestamp": 1698589586,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "What would you do in my position? Recent grad in Political Science & Media w/ International experience I graduated with a Bachelors in Political Science & a Minor in Media Studies at UIUC last december. I did an internship summer 2022 at a tech incubator as a Communications Manager in Vilnius, Lithuania & wrote a journalistic article after interviewing the Prime Minister. I have been applying to any positions on Linkedin that match my past experience/skills on my resume and Ive had no luck so far. What am I doing wrong? Do i need to go in-person and just sit in waiting rooms of companies I would like to work at at this point? \n\nI am becoming increasingly tempted to just take advantage of my dual citizenship and get a Master's or something in Europe, but I am also worried about the possible lack of value of a European International Business or something like the DeepTech entrepreneurship program In Vilnius. \n\nWhat would you do in my position? I want a multiple pronged course of action that will get me something in government, media, tech, and anything innovation related. \n\nI appreciate any and all thoughts & responses :)",
    "title": "What would you do in my position? Recent grad in Political Science & Media w/ International experience",
    "subreddit": "careerguidance",
    "timestamp": 1687711091,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Was laid off, now starting a new job - any advise? 3 months ago I was laid off. I finally found my (current) dream job and I wish to start my new job tomorrow on a clean slate. Let’s say I’m super grateful and excited about this opportunity. \n\nThe reason I was given for being laid off was that I wasn’t a good fit. Although minimised, the opinions of my ex-managers are still there and I don’t want them to impact me on this new start. \n\nSo any advise on what I should focus on in the coming months to put my best foot forward. Any advise is appreciated but if you have anything specific related to communication, that would be appreciated! \n\nIf it matters : third country national in a European country and the field is IP law. \n\nTIA!",
    "title": "Was laid off, now starting a new job - any advise?",
    "subreddit": "careerguidance",
    "timestamp": 1684669694,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "I'm an expat who has just moved back to the US and is now looking for a job. How do I explain to potential employers why I'm currently unemployed? My master's degree and my whole subsequent professional career has been in Europe. I recently decided to move back to the US (so my kids could be close to their grandparents). I concluded my last job last month, and then came to the US, and I'm job hunting now.\n\nSo on my resume, I listed my past jobs and what European cities they were in. I also put my current US address, near my contact info. But some hiring managers apparently get confused by this, and wonder if I was just living in the US the whole time and working remotely for those companies, and then got fired or something, being why I'm currently unemployed. So how do I clarify this on new applications? Should it be in my cover letter or what? How would I word that?",
    "title": "I'm an expat who has just moved back to the US and is now looking for a job. How do I explain to potential employers why I'm currently unemployed?",
    "subreddit": "careerguidance",
    "timestamp": 1686171772,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "[USA, though hoping to move to the EU ASAP] In reading my profile (neurodivergent, well-educated, well-traveled, idealistic--and tons more detailed inside), can you suggest any great-fit jobs/careers with higher earning potential $75k+ that might be in my blindspot? tl;dr--\n\nI can sort of see the different pieces of my self, but struggle to see the big picture. Sometimes people look at me and say \"it's so obvious, you should be doing X, Y, or Z\" but for me, I just feel sort of disjointed and unsure of what direction to head in.\n\nI am an interpreter and I imagine there are very few jobs that are a better fit (though I am confident there are at least some). The hours worked vs. pay is a great fit and I love working with languages. It is hard to leave the field, because not a ton of jobs pay $80k for ≤35 hours of work/week. But I miss bringing my own thoughts and ideas to the table. I miss sharing my perspectives and working toward a solution I help come up with. (Interpreters are more like neutral middlemen than active participants.) I also wish I had some revenue sources that weren't based on 1-on-1 interactions (think more passive or hands-off income vs. only having income based on minutes/hours billed).\n\n\\----------\n\n**Here's a ton of information about me, do you have any career paths that jump out at you as things I might be good at or would be a good match for me, my happiness, and the lifestyle I hope to live? Generally, I'd like to:**\n\n* earn a lot of money\n* not sell my soul to the devil (e.g., foreclose on poor people's homes so executives can get more yachts)\n* travel & interact with foreign cultures\n* work with people more than things\n* have no two days be the same\n* work to live (not live to work)\n* help people solve problems\n\n\\----------\n\nBackground:\n\n* **Age:** 35\n* **Undergraduate degrees:** Anthropology (US), interpreting (US)\n* **Graduate degrees:** Entrepreneurial Innovation (EU), MBA (US)\n* **Years of professional experience:** 10-12\n* **Current career:** Full time interpreter (previously in-person, now 100% online)\n* **Current location:** USA\n* **Current income:** \\~$80,000 ($45 - $85/hr.)\n* **Desired career:** Here for advice about this\n* **Desired location:** The European Union\n* **Desired income:** \\>$75k\n\n\\-----------------\n\nOther considerations:\n\n* **I have ADHD.**\n   * That means I naturally resist structure, despite thriving when I have it. Internal motivation is a weakness, but I do great with external motivation. Micromanagement is not something I handle well and I really struggle with very hierarchical organizations (I believe the CEO and the janitor should be treated equally and really hate sucking up to people just because they're higher up on the ladder.)\n   * Generally, ADHD brains are best motivated by:\n      * interest *(once the interest is gone, my system goes offline),*\n      * novelty *(better at starting projects than finishing them)*,\n      * challenge *(tell me I can't do something and I'll want to do it more)*,\n      * urgency *(I procrastinate, but once the time pressure clicks I can be unstoppable)*,\n      * and passion (I won't shut up when you hit on a topic I am passionate about).\n* **I am very money-motivated...**\n   * I grew up in poverty, so it's important for me to have a secure and comfortable life economically. To date, I have preferred my hourly work to salary work.\n* **...but not at the expense of my humanity.**\n   * I think I would probably do well in an environment with a clear social impact--be that a mission-based organization helping making positive change in the lives of disadvantaged people or something in the tourism industry that makes tourists feel the wonder and magic of a place they're visiting for the first time. I just likely won't thrive in an environment that is focused on sucking money out of the poor, fanboying over an expensive gadget just because it's popular, or joining an oil conglomerate.\n* **I/I'm (strengths):**\n   * an avid traveler (and quite savvy at planning my way around the world)\n   * a pretty good writer\n   * a pretty decent problem solver (I can get a lot done with a laptop, my phone, and a pad of paper)\n   * funny, sociable, friendly\n   * kind-hearted\n   * a good communicator\n   * pretty smart, or so I am told\n   * an out-of-the-box thinker sometimes\n   * sometimes comfortable doing things my way\n   * great at languages\n   * do better at short-term projects/assignments (vs. long-term planning)\n   * perform well under pressure\n   * usually pretty good in an emergency situation\n   * prefer the spirit of the law to the letter of the law\n   * I like a good perk: Unlimited or high PTO, professional development resources, etc.\n   * Variety is the spice of life\n   * I am not at all artistic, but am creative in different ways\n* **I/I'm (weaknesses):**\n   * chronically late (see ADHD)\n   * struggle with procrastination (thought time running out is a fairly reliable motivator for me)\n   * struggle with prioritization\n   * sleep horribly (but also maybe more used to functioning on little sleep than most)\n   * am not a morning person\n   * I am naturally a \"helper\" and it can be hard to accept when people don't want help (especially when the solution seems so obvious to me).\n   * struggle to follow rules I find inane or not well justified (though I will of course follow the law)\n   * Struggle to operate without knowing the why (You say, \"Jump.\" I say, \"Happy to do so, but could you explain why I am jumping?\") A \"no\" without a clear \"why\" is the worst.\n   * Better working 2nd shift (10a - 2p start time) than I am 1st shift (6a - 10a start time).\n   * Avoid formal dress when possible\n   * Easily bored and exhausted by monotony\n   * \"That's not possible\" and \"That's just how it's always been done\" are among my least favorite sentences.\n   * Struggle to put corporate needs over the needs of the worker, common person. (In management, I think I have always tended to side with the worker over the demands from on high -- which probably made me a decent manager for folks at my level or below, but terrible for people looking down on me from up the chain.\n   * Sometimes struggle to focus on the longer-term strategy (vs. immediate action)\n* **Careers I think would be a terrible for me:**\n   * \\- Wait! Maybe you could jot down a few ideas first, before ruining your first impressions with the things I have included on this list. >!Accountant, architect, fulfillment center worker, software engineer (I imagine?), data entry, filing clerk, auto mechanic, seamstress/tailor, military/armed forces, lawyer (I think the helping folks part would be amazing, but that the formality and time management would be a mess.)!<\n* **Careers that might be a better fit for me:**\n   * Wait! Maybe you could give me a few ideas first, before ruining your first impressions by revealing what I have written? After you make a note, please let me know if I also listed it here or not. >!Interpreter, social worker, teacher/professor, flight attendant, speaker, journalist (though deadlines are tough), newscaster, tour guide, paramedic, actor, accessibility or DEI consultant, comedian, busker, entrepreneur/social entrepreneur, 911 operator, patient advocate, teaching language classes to immigrants. People have said I should get into UX, but I don't really know what that means/am unfamiliar with the field.!<\n\nWhat do you think? What comes to mind? I appreciate any advice or insights you might have for me. Thanks!",
    "title": "[USA, though hoping to move to the EU ASAP] In reading my profile (neurodivergent, well-educated, well-traveled, idealistic--and tons more detailed inside), can you suggest any great-fit jobs/careers with higher earning potential $75k+ that might be in my blindspot?",
    "subreddit": "careerguidance",
    "timestamp": 1698707095,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "MsC, MBA or CFA to scale up my professional finance career? Hi everyone,\n\nI would like the expertise of some people here as I further pursue my career in finance. I am 29 years old, based in France, and currently work as a fund manager for a top European asset management firm. Previously, I graduated from engineering school and began working in financial auditing shortly after for 2 years.\n\nNow, I am really considering an Msc or MBA to enhance my engineering degree as I would really like to have a more international profile and ideally, move to the Private Equity industry. However, I have noticed that there are some limits to starting a new degree:\n\n\\- My company are unable to finance this and so I would need to take out a loan.\n\n\\- Classes will have to be taken on a part time basis (evenings and weekends) due to current work commitments.\n\n\\- I am also considering a CFA as well but I've heard that it is not now what it used to be.\n\nWith the above in mind, does anyone know of any Msc or MBA\\`s in the financial industry that is part time in Paris or distance learning (which can then be based anywhere) that can help skyrocket my career in finance?\n\nMany thanks for your help.",
    "title": "MsC, MBA or CFA to scale up my professional finance career?",
    "subreddit": "careerguidance",
    "timestamp": 1687247178,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "General operational management background here (tech, supply chain, manufacturing), mostly experienced in Africa/Asia, now looking for a career back in Europe, what type of jobs would be a fit? Thanks for taking a minute to look at this! I would like some advice on what type of jobs I have a good shot at in a European context (ideally Ireland). I have an operations/general management type background (mini CV below). I would love to work in operations (maybe also project management) or sustainable supply chains; I'm happiest at the spot where I can bring all moving parts together. The feedback I have received so far is: experience not specific enough (for supply chain jobs), no management consulting experience (for business operations jobs), no cash or specific job available (start-ups), and a bit of not hearing back at all. Arguably, I have not cast my net very wide yet. Suggestions on qualifications that may help also welcome!\n\n*Start-up (Wound down), Operations Director/Co-Founder, Ireland, 2.5 years*\n\nSupply chain tech start-up where I managed a tech team of 7 (not as a CTO), onboarded clients, managed investors/partners and reporting to them, daily finance/HR management. Wound down due to: deep tech product with long corporate sales cycles, market targeted too broad, delay in raising follow-on investment.\n\n*Small consultancy, Operations Director, East-Africa, 3 years*\n\nData-driven decision making for governments, agencies and companies. I ran a team of 10 specialists and engineers, including delivering to clients and daily management, productised services leading to start-up above\n\n*Social Enterprise FMCG, Chief Operations Officer, East-Africa, 4 years*\n\nResponsible for production, supply chain and logistics activities across three continents, managed a team of over 150 people, reporting to Supervisory Board. \n\n*UN Agency, Logistics Officer, Asia/Africa, 3 years*\n\nManaged logistics hubs\n\n*Corporate XYZ, Corporate Management Trainee, EU country, 2 years*\n\n*Education: MA, International Relations*",
    "title": "General operational management background here (tech, supply chain, manufacturing), mostly experienced in Africa/Asia, now looking for a career back in Europe, what type of jobs would be a fit?",
    "subreddit": "careerguidance",
    "timestamp": 1673009006,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Any advice to become an Export Manager? Hi, I'll get straight to the point.\n\nI am 22, I am currently studying economics in Italy and I am going to graduate in March 2024. After that I want to look for a job in Export Management. For now I speak English (C1 I think), Italian and Romanian (both mothertongue) and Spanish (A2/B1). In the past I worked as an Operations Agent for a big corporation in logistics. Here is how I thought the causal chain to reach my goal:\n\n\\-In the first semester I will be in an Erasmus Exchange in Greece. I want to use this as an opportunity to become more proficient in English, also in Spanish if I meet some international students to speak it with (if not I will probably start to learn another language). I have plenty of time so I will also start to learn the basics of Sales and International Marketing.\n\n\\-After graduation I will look for a job as an Export Area Manager on Linkedin etc...For the first job I am prepared to move in another country (even if I find my entry level job in Latin America or something like that). If I can I will probably enrol in a private master in Export Management. If I will not find what I look for I will try to participate in Erasmus+ Traineeship and in other European projects to enrich my CV while still sending applications everyday for jobs on LinkedIn\n\nWhat do you think about it? Is it realistic?",
    "title": "Any advice to become an Export Manager?",
    "subreddit": "careerguidance",
    "timestamp": 1686251163,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "What would you recommend me? What is your advice? Hello! I (27F) am looking for advice regarding next steps in my career. Right now, I live comfortably in an Eastern European country in the EU, making around 3k euro net/month, investing in ETFs and stocks. I started working at 22 in the IT field (more specifically RPA, which is a nieche and it does not seem to have a bright future). I have experience only with 1 technology, since 2 years of my career I've spent as a department manager. That was not a fulfilling direction, hence I became an individual contributor again very recently (in october). \n\nRegarding my job, it is not very fulfilling, but I think it is kind of easy money regarding the cognitive capacity needed to perform it. I would like to explore new options regarding my career, more fulfilling for me. I am passionate about health and sports, but it does not seem so financially rewarding as a career in IT, hence I would like to keep my job while pursuing other options. I have a BSc in Mathematics, but did not proceed with a Masters since I was not sure what I want to do and I wanted as soon as possible to not depend on my parents financially anymore.\n\nWhat I know for sure is that I want to move to another country maximum next year, with a warm climate and open-minded people. In 10-15-max 20 years, I would also like to become financially independent at least at basic needs level. \n\nI am exploring  the possibility of going back to school in a field such as sports psychology, nutrition, sports or data science. I would also like a career in which movement is required, since I have back problems right now and I don't see myself working at a desk 8h/day for the rest of my life. What would you recommend me to do? Any advice is appreciated. Thanks!\n\n&#x200B;",
    "title": "What would you recommend me? What is your advice?",
    "subreddit": "careerguidance",
    "timestamp": 1699893072,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Industrial Phd for Materials Science Engineer in Sweden ? I hope you're all doing well! I wanted to reach out to this community for some career advice.\r  \n\r  \nI'm an Indian national with permanent residency in Sweden. I've been working as a maintenance and support engineer in Sweden for the past two years, with some experience in R&D work, and previously worked as an operator for two years in the same company. I hold a Masters in Materials Science and Nanotechnology.\r  \n\r  \nCurrently, I'm working in the PVD industry in Sweden, but I'm interested in exploring opportunities in the field of space. I'm considering pursuing an industrial PhD in this field, preferably in the Netherlands or another European country where engineers are valued.\r  \n\r  \nHowever, I'm not sure what career path I should take to achieve this goal. I'm looking for a role that allows me to use both my management and hands-on skills. I'm not interested in teaching or academia, but I do want to work directly in the field.\r  \n\r  \nIf any of you have any advice or suggestions, I would love to hear them. I'm open to exploring different opportunities and am willing to relocate for the right position.\r  \n\r  \nThank you for taking the time to read this. I appreciate any insights or advice you can offer!",
    "title": "Industrial Phd for Materials Science Engineer in Sweden ?",
    "subreddit": "careerguidance",
    "timestamp": 1683895333,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Am I crazy? Please give me your perspective I suspect that I'm getting screwed over and I'm having a tough time discombobulating my thoughts. Looking for some perspective.\n\nI work in a dual role: data analytics (ETL and dashboards) + business process performance management (KPIs, performance management frameworks, campaigning etc etc)\n\nKey details: I work remotely and I'm very under challenged on the things I can influence (takes me very little time) and my job has basically no expectations placed on it (both good and bad)\n\nI'm not paid badly (140k USD in an expensive European country) but for the specific industry feels light (but it's difficult to find data on it due to living in a small European country with limited competition)\n\nMy job title is that of a manager, but when I check the HR system my role is a supply chain specialist (a \"lower\" role imo). Looking at the job grade definitions, the tasks and the accountability for my role exceeds my current job grade, even if I spend almost no time working on the things that I do. Of course I have spoken to my boss about this with the right level of tact, but I was given a very generic response about delivering things that it's not possible for me to deliver (ie dead end)\n\nI'm finding myself constantly torn between pushing for a higher job grade/new job elsewhere and chilling out in what is a very good work life balance.\n\nI realized that this might be a dream for some people but after a few years of being under challenged I start to worry about my long-term potential and happiness.\n\nI'm finding myself falling into a pit of career depression by being under challenged for a few years and feeling like there's no progression or being faced with the choice of working in banking or consulting which represents a serious step backwards in terms of work-life balance at the potential of higher pay.\n\nAm I buying into late stage capitalist ideals by wanting more and more in a situation that others would kill for or am I being passive and lazy\n\nPlease give me your impressions and thoughts",
    "title": "Am I crazy? Please give me your perspective",
    "subreddit": "careerguidance",
    "timestamp": 1695546643,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Dev looks like a shit job? Can someone give me some tips? Hey all, So I am a SDET/QA automation engineer. I work for a European government.\n\n (I originally posted this on r/ExperiencedDevs but was advised to post this here instead, so here I am).\n\nBefore this job, I worked at startups and small profitable established companes. I've been around the block.\n\nAt every place I've worked, the developers mostly carry out the instructions of business-side staff (business analysts/product managers etc). They had to do what they were told and their time was accounted for on an agile board (usually Jira). It seemed like factory work.\n\nWhereas on the testing side we mostly created new tools when we felt we needed to, and aside from sometimes doing a bit of manual testing (and often the automation/sdet staff didn't really have to do that very much) we did what we wanted.\n\nWe were free to explore and innovate - far more than the devs were.I quite like writing code and doing technical stuff, and devs tend to do more complicated technical work, so a part of me wants to move to dev.\n\nBut then I look at all the bullshit devs seem to have deal with it, and that puts me off.Where is the fun in changing the appearance of widgets or changing the code of an API endpoint as some product manager/business analyst waits on you and passive-aggressively holds you accountable for the amount of time you take to do your work?\n\nIs it me, or is SDET/QA Automation a better job than dev?\n\nAlso, is DevOps/SRE better than dev? It appears to be the case that devops/SRE are further removed from what the customer sees and experiences, so there will be less bullshit to deal with from the business side. Thoughts?",
    "title": "Dev looks like a shit job? Can someone give me some tips?",
    "subreddit": "cscareerquestions",
    "timestamp": 1695238866,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Feeling directionless and unneeded at work after reorg. I work in the US for a global biotech company based in Europe. The company acquired the US site about 3 years ago, and at first there were minimal changes. Our team had been working as the company's data team, and we helped build data pipelines and products as well as support cloud projects such as HPC. We were generalists, but we had a number of ongoing projects throughout the company. I was number two in the group, and I did a mix of product management and architecting.\n\nHowever, recently things have changed. At first, I thought things were changing for the better, but over the past few months I'm starting to question whether they've changed for the worse. The European side of the company created a new line function for all data projects in the company and reorged my existing team into it. They split my role (now I'm technically just an architect) and gave our team a product owner based out of Europe. This sounds good in theory, but I believe that I'm an architect in name alone, in reality I'm an engineering manager, and all architectural decisions are solved in Europe without my input.\n\nThe nail in the coffin for me is that they don't refer to our team as a data team anymore, they refer to us as an enablement team, the idea being that we enable the business to build data products on the data platform they've developed. They're trying to push the company into a data mesh architecture prematurely here. *OK, I can role with the punches and try to succeed here...* but... now they have us supporting a very messy legacy project migration (practically doomed to fail from the start) that few people care about, while another team *from the business* in Europe is supporting a greenfield data project that the business is super engaged with. It seems like we aren't a data team or a enablement team, and my product owner is just as confused as I am...\n\nI'm just demotivated now. I feel like Twitter; we had a system that worked, we were making people happy, and we felt productive at our jobs, then someone came in and messed everything up and now no one wants anything to do with us. Ideally, I want to stay with the company, but I'm not sure how to turn the situation around and find purpose and meaning in my work again.",
    "title": "Feeling directionless and unneeded at work after reorg.",
    "subreddit": "cscareerquestions",
    "timestamp": 1689610843,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Lower title, higher pay offer I've been offered 80k at a new company for a SWE 2 position. My current role pays 65k and I am a senior/SWE 3.\n\nBefore both are called out as low, I am European so these salaries where I live specifically are mostly acceptable. (65k at SWE 3 is a bit low though, even here)\n\nMy dilemma is that I am confident my current company will match it, since I've been talking to someone who's leaving as well and they've tried to match his, desperately. At the same time, even if they match it, I'll be effectively doing more work but for the same pay where I could be in a lower position, but at the same, new higher pay. The way I see it as well, is I have more opportunity to move up again at this new company, for example to SWE 3 again. Moving up at my current company beyond SWE 3 will not be easy.\n\nIs this really a no brainer to just move to the new company, with a lower title but higher (or same if my company matches) pay?\n\nTo be clear, I've no real quarrels with my current company. It really is primarily about money. I actually love my current team and manager and I've worked here for 2.5 years without issue. New company seems good too, and had great reviews overall on Glassdoor.\n\nI am barely in my mid twenties if that helps.\n\nI've been reading a lot of opinions online about this, but can't really find similar situations so thought I'd reach out in case anyone here has been in any similar situations.",
    "title": "Lower title, higher pay offer",
    "subreddit": "cscareerquestions",
    "timestamp": 1693464193,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "Overwhelmed with job options. What do I do? I am finishing my master's degree in Software Engineering very soon but now I don't know what to look for and I am reaching out for help here to get some tips.\n\nI generally just love coding and I have a lot of side projects. Some very dumb and some mildly useful across a variety of fields (web apps, bash scripts, ML models, browser extensions, homelab, ctf's, blablabla). The problem is that I don't know what I want to work in. I don't know what to look for. I have job offers in sre, backend, mobile, frontend, etc. . Some paying 20k others 30k (European country btw, don't get mad), some from F500, some from startups. I am overwhelmed with options and I can't decide.\n\nI did an intership in mobile in a very chill startup, great environment, great manager, great team and I have offers there, but they are on the lower end of the salary spectrum. I'm not sure if the trade-off is worth it as well.\n\nAny tips (and tricks) are greatly appreciated",
    "title": "Overwhelmed with job options. What do I do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1684011322,
    "score": 0,
    "keyword": "european manager"
  },
  {
    "text": "AR/AP is boring, I do not want to get stuck in it for the rest of my life, I want a career change. Do you have any idea how? I think the title sums it up. \n\n I am a graduate of International and European Economic Studies from a Greek University and I am currently doing a masters degree in Economic and Business Studies. I am working for a year now as a junior accountant in a medium size firm (rough 5M revenues) in a two-man team together with the CFO. \n\nI like the accounting stuff that I do ( i.e. AR and AP journal entries, credit control, invoicing, etc.) but it is BORING. AI also can do a better job on that than I do, is not well paid nor do I see a future in it.  I want to analyze numbers and advise on financial decisions, not enter my CEO's daily five guys receipt on AP as \" other business expenses\" on Quickbooks :)\n\nHow has anyone of you managed to escape that stuff? Is accounting as boring as this? What tasks do you do when you become more senior? Should I try my luck and try to find a job in FP&A?",
    "title": "AR/AP is boring, I do not want to get stuck in it for the rest of my life, I want a career change. Do you have any idea how?",
    "subreddit": "Accounting",
    "timestamp": 1688022910,
    "score": 24,
    "keyword": "european manager"
  },
  {
    "text": "My next move causing a headache. I qualified in 2021 and am just stagnated in my current practice. \nI've been casually looking for a job but recently one of the Big4 reached out via LinkedIn for a job that is similar to what I do now but is incorporating more people management too. It wouldn't be client facing so not audit or consulting. More compliance type things. \n\nI've never seen myself in Big4 so was wondering if the overtime horror stories are actually real. \n\nCurrently during busy periods I'd do 15 overtime hours per week. Would that be in line with what's expected? \n\nWork Life balance is important to me and considering the salary being offered is similar to what I'm currently on, I wouldn't want it diluted more than it currently is.\n\nLooking particularly at European experiences but would value input from my US friends too!",
    "title": "My next move causing a headache.",
    "subreddit": "Accounting",
    "timestamp": 1674218832,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Is it unusual for Mangeres and Senior Managers in Big4 in Europe to recive an equity stake? In Croatia, when you sign a manager contract they give you equity in a holding company which redistributes the profit making 30% of the staff like shareholders. It is done to avoid pension and health tax but i wonder if any other European countries have the same system?\nThank you!",
    "title": "Is it unusual for Mangeres and Senior Managers in Big4 in Europe to recive an equity stake?",
    "subreddit": "Accounting",
    "timestamp": 1696737090,
    "score": 2,
    "keyword": "european manager"
  },
  {
    "text": "Advice on beginning accounting career. I am graduating this December in accounting with 150 credits to pursue my CPA. I currently have an offer to work for a tax consulting company which I like very much. They are flexible with work locations, the pay is good, and the work life balance is better than B4…. But, I also got an interview for a B4 firm in another state for international tax and feel confident in my interview skills.\n\nWorking abroad has always been a goal of mine and I know that international rotation programs are possible at B4 firms at senior or manager levels. At the tax consulting firm, I am not sure of that (although they do have a few European offices). I understand that working in international tax does not mean being able to travel internationally but working at a B4 firm seems like the best chance I’d get.\n\nI want to choose the best option that will open the most amount of opportunities in the future. Is B4 worth the grind I hear so much about? Is international tax a good specialization to move into? I understand the choice is ultimately up to what I think will be best for me but any advice or insight is appreciated.",
    "title": "Advice on beginning accounting career.",
    "subreddit": "Accounting",
    "timestamp": 1690480198,
    "score": 1,
    "keyword": "european manager"
  },
  {
    "text": "What should be my next career step? I'm a business major (Oct '21). I was debating whether to go into accounting/finance, marketing or HR.\n\nI went into industry as an AP intern. \n\nI loved the role, it can be monotonous, but going in I couldn't imagine how many problems I would face and how many new process implementations I would experience.\n\nIn summer '22 I got a staff role in AP (I had an external offer for general accounting but turned it down).\n\nIn autumn I applied internally for a senior position but was not accepted. At that time I signed up to start my ACCA (European CPA). \n\nIt's been almost a year (I had a positive year-end review with a 10% raise) and I'm thinking about how I can progress to a more advanced role within the company.\n\nDo you think I should apply for a staff role in general accounting, a senior accountant role or a managerial role (managing around 10 people)?",
    "title": "What should be my next career step?",
    "subreddit": "Accounting",
    "timestamp": 1688322843,
    "score": 0,
    "keyword": "european manager"
  },
  {
    "text": "What is the point of in-office hybrid work Moved from industry to consulting almost a year ago, expecting in person time with clients or at least project teams\n\nWe are in-office focused, but I've found myself spending most of my days in booths on calls and not getting any of the in-person interaction related to work processes and products which I'd expecting when moving into the role\n\n (managers in different timezones and zero in-person client time over almost a year)\n\nMy colleagues are nice, but for the hours and the pay I feel \"work family\" socialising is the only real benefit of the job (took a slight cut to move into consulting with the expectation of growth opportunities)\n\nIs this is kind of hybrid set up common across consultancies? Or is it just for smaller ones?\n\nWorking in a boutique in a major European city, focused mainly on clients with a global footprint",
    "title": "What is the point of in-office hybrid work",
    "subreddit": "consulting",
    "timestamp": 1700695279,
    "score": 109,
    "keyword": "european manager"
  },
  {
    "text": "Women in consulting and Motherhood A question for all the wonderful consultant cum moms out here..how did you manage career after motherhood.I am currently pregnant and my manager informed that I am being considered for promotion(Manager) in the next year...but I would probably be on maternity leave...I didn't disclose my pregnancy yet..but in general I was wondering how long did it take to get back to career, how did you manage travel in early motherhood and what can be the probable challenges to expect.\nFyi I am based in the European market.",
    "title": "Women in consulting and Motherhood",
    "subreddit": "consulting",
    "timestamp": 1694710255,
    "score": 20,
    "keyword": "european manager"
  },
  {
    "text": "Strategic Partnerships? Need advice Hey Consulting homies, just wanted to soundboard something with you all.\n\nSo I’m a consultant with the following background\n- 3 years in Industry\n- 1 Year at Big4 in Ops Advisory\n- 2 Years at Strategy Boutique\n\nI was recently laid off and have been interviewing for a variety of roles to find my next step. I had one pop up which was way off my radar, but it seems to be a good opportunity in the partnerships space, but I don’t know anything about it honestly. A bit of background on the firm and role:\n\n- Category: European Tech firm\n- Size: medium ~250 employees, series B funding\n- Title: Senior Manager, GSI & Strategic Partnerships \n- Comp: it’s pretty solid at about £80K/year base\n\nI have a final round scheduled with them, so it’s not mine yet. However, I wanted to get a sense of what partnerships entail for those who have exited into this area. Can anyone give me line of sight into:\n\n- what does your day to day look like?\n- what do you find you use most from your consulting toolkit?\n- what kind of growth are you looking at for your partnership role moving forward? Where do you see yourself going next?\n- what do you wish you knew before going into partnerships?\n- anything else?\n\nOf course I’m laid off, so any job is a good job, and this one could potentially be great. But I would love to understand more about it from any ex consultants turned strategic partners to really understand what I’m getting into.\n\n\nThanks!",
    "title": "Strategic Partnerships? Need advice",
    "subreddit": "consulting",
    "timestamp": 1700598675,
    "score": 6,
    "keyword": "european manager"
  },
  {
    "text": "Looking to get some insight into my situation. I’m currently Software Engineer for last year and half. Currently working as DS and Frontend developer on two different Space and Avionics projects. \n\nI’ve been trying to get into Consulting for last 6 months, got denied by 2 firms that are MBB in last round; quoting the reason : “ You are still a bit green, try to get experience from lower tier firm and try again in 12 months”. Keep in mind one of those firms approached me when my team and I competed in European Case Study competition and landed 2nd place in it.\n\nI’ve recently landed a offer from tier 2 firm but if I accept it, I’ll be taking a pay-cut compared to my Software Engineer job.\n\nLooking for some help on what should I do.\n\nMy end goal is to venture into Consulting for 3 years, land MBB job stay there for 2-3 years and then switch back to IT sector as Product Manager, Scrum Master ( I’m 25, so want to get to that point before 30 and seams that Consulting might be the easiest way to get that kind of job early in career).",
    "title": "Looking to get some insight into my situation.",
    "subreddit": "consulting",
    "timestamp": 1673627841,
    "score": 4,
    "keyword": "european manager"
  },
  {
    "text": "Told not to bill at under hourly increments Hi,\n\nFor context, european tech consultancy with around 1000 employees. All my projects are sold with a scope and a budget (--estimate hours). I could be on anything from 1 to 4 projects at the same time. Very few projects are sold at a % FTE.\n\nNow, i have been submitting my time sheets at minimum 30 minutes for sanity, but have strict guidelines from my department to keep it to the hour. I then end up burning through hours and having to explain to the client why things are costing so much (or just eating the hours). Manager isnt on the client facing side after the project is sold and sometimes the projects aren't big enough to warrant own PM (think 200 hours) so this falls to deaf hears (or standard answer to estimate more hours in the scope of work???).\n\nIs this normal in consulting? Ethical bit aside, and i do find it hard to put aside, how does my company adequately scope projects when timesheets and actual work does not correlate? And how do yours firms handle these kinds of things?",
    "title": "Told not to bill at under hourly increments",
    "subreddit": "consulting",
    "timestamp": 1687960407,
    "score": 3,
    "keyword": "european manager"
  },
  {
    "text": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed. A feminist from the 1940s named Mary Beard wrote a book called *Woman as a Force in History*. It critiques the myth that women were historically treated as subordinate to men and they were restricted from contributing to society or having basic human rights. Her book only includes just a portion of what women contributed to in society, and she says there's so much more. She has no idea how it got erased from history, but critiques the idea that women were historically oppressed compared to men.\n\n**Women did have an education in medieval times.**\n\nFeminists like to think that women were denied an education historically because people hated them and wanted them to suffer, but that's false. In fact, in medieval times, women were being educated all the time, and were as literate as men. G. G. Coulton, the life-long student of mediaeval history, gives a cautious answer: “Though very few women arrived at anything like the university stage in education, it seems probable that more of them could read and write than the men,” especially in the upper classes “at the period when romances of adventure were offered in profusion.” Interestingly, going to university was less common back then.\n\nThis [chapter](https://www.marxists.org/archive/beard/woman-force/ch11.htm) from her book elaborates on all the education women had back long ago in medieval Europe. It was very normal for them to have an education. Italian and German women especially had the most education of the Middle Ages. You can see that women had education and high literacy rates, and were more literate than men. They succeeded a lot in education. Maybe there were some societies that normalized education for boys, but that's because in those societies, education taught discipline, not facts, and people believed girls were more well-behaved than boys and thus didn't need it. Moreover, corporal punishment was used on boys much more, and boys were subjected to forced labor. This was meant for build character and discipline in children. Women weren't educated because it was believed they were less prone to bad behavior and didn't need to be educated. There was only a small overlap between education becoming useful for learning things, and women not being allowed to be educated. Later on, corporal punishment and forced labor declined in schools. It was actually seen as unmanly for boys to be willing to learn.\n\nEven in the later 19th century, girls performed better than boys in elementary schools and outnumbered them, and even in the early 1900s, when high school became more common, girls went to high school more often. Girls even had free education whereas boys in high school had to have their parents pay a fee. You can read more about this from the book *The Privileged Sex*.\n\n**Women did build society and contribute to the social and economic realm of society.**\n\nIn [Chapter 10](https://www.marxists.org/archive/beard/woman-force/ch10.htm), Beard wrote:\n\n>AFTER the dissolution of the Roman Empire, nearly all the economic activities connected with the production of food, clothing, and shelter were carried on in rural villages and their outlying fields everywhere in Western Europe. Whether the village was a free community or property belonging to the estate of a great feudal lord or lady, it was largely self-sufficing; its inhabitants supplied nearly all their needs for the maintenance of life. Furthermore, the industries of households and fields were not like the modern “heavy industries.” Women could handle nearly all of them alone or with some aid from men.  \n>  \n>Thus there was no sharp division of labor as a rule. Men and women worked together for the most part. If the major responsibilities for spinning, weaving, and cooking were women’s tasks, if wood-cutting and ditching were generally men’s tasks, men and women commonly worked side by side in the fields and to a considerable extent in all the processes of transforming raw materials into commodities for use. Whether the toilers on the land were bond or free, men and women labored under similar conditions and enjoyed similar liberties of choice such as they were. Though women gave birth to the children, both parents had the services of children to help them in their work. In the records of mediaeval rural life that are available in our age, no specially onerous burdens are found to have been laid on women as women by men as men. On the contrary the records show a sharing of the toilsome tasks on about the same terms.\n\nWomen were also, even in the Indian and Middle Eastern regions, just as involved in gilds as men. Beard writes:\n\n>While in some of the records the details are lacking, Smith’s *English* Gilds contains accounts of the structure, membership, functions, and proceedings of about eighty-five gilds. In at least seventy-two of them women were members on an equal basis with men. That is surely a large proportion. In some of the other gilds a slight qualification was placed on widows; they were accepted if their husbands had been gild men. Lest the idea of sheer generosity or friendship for the deceased be adjudged the reason for admitting widows to gilds, let it be remembered that, in innumerable cases, widows carried on the craft in which their husbands had been active, being directly familiar with it as a household industry at which they had themselves labored or in connection with which they had borne responsibilities for training and directing apprentices.\n\nWomen were not in a segregated gild, and mixed gilds were common. Some men didn't approve of women in some gilds, but it wasn't due to hatred of women, but because they believed women weren't strong enough for things like bread-kneading and bread-baking. Nonetheless, these men didn't get the monopoly they looked for:\n\n>But a French Parlement refused to prohibit the customary baking by women and declined to back up the men’s opposition to the women. A French parliamentary decree even accorded some gild women rights frequently denied to English widows; it ruled that a widow could retain her membership in a gild even if she took as her second husband a man who did not work in her craft.\n\nWomen also were involved in all kinds of parts of society:\n\n>Just as women took part and carried full loads of work in agriculture, domestic industries, and trading, just as they participated in the activities of craft, trade, and social gilds or corporations, so they shared and expressed themselves in all the forms of social life in town and country. In everything human their qualities and force were expressed – from religious and secular festivities, sports, games, and riots to the **discussion of religious and moral questions and the management of charitable undertakings**. In castles and cottages, in fields and in gild halls, on village greens and in churchyards, in towns and on city streets, in taverns and at market fairs they sought release from the rigors of earning a livelihood, from burdens of domesticity, or responsibilities belonging to the status of their class, whatever it was.\n\nWhen knights even had tournaments to display prowess, it was often done to impress female spectators. **Women's cheers brought outlets in arguments over public, private or religious matters, and in disputes about property, trade, marriage arrangements, family problems, tastes, habits and good or bad manners**. In fact, in medieval times, women were very fierce in many cases, and they would steal husbands' money and run with monks, get in violent fights with women in arguments, smash knights with swords, drinking and singing in taverns, etc. One woman even bloodied a priest's nose after he tried to rape her. When the priest ordered to her to become a pilgrim to Rome, Thomas of Cantimpre laughed and advised to the woman that if a priest sexually assaults or inappropriately pursues her:\n\n>then thou smite him sore with thy clenched fist, even to the striking out, if possible, of his eye; and in this matter thou shalt spare no order of men, for it is as lawful for thee to strike in defense of thy chastity as to fight for thy life.\n\nIn medieval times, women were seen as sinful or wicked, resorting to magic, or the originators of sin, and in need to obey priests or obedient to their husbands, but men were seen as brutal or vulgar, and he had to love his wife, help her support the family and never harm her, and charivaris were done against him or even family intervention if he abused his wife. This was all a reaction to the aggression women engaged in then that people thought women would never do and that only men would do (and feminists reinforce this gender role by portraying all violent women as victims):\n\n>Also, repeated again and again and again in mediaeval documents was the idea that women had been better, if not ideal, “in the good old days,” but were now given to luxury, assertiveness, display, love of worldly goods and pleasures. Hence it would appear that the newest clichés are not so new after all.\n\nMen fought at wars more than women and committed crime more, but women who had power waged wars. Women assembled soldiers. Women fought side by side with men. Women were guilty of many cruelties, and women aided and approved the worst. Women conformed to no type, and they weren't \"tame\" in a \"man's world\". \n\n**Women had a lot of power in marriage and family that men had.**\n\nAccording to the same chapter, Beard wrote:\n\n>Beyond all question the weight of documentary evidence is against any simple conclusion that men handed women around like chattels; that boys were free to make their own choices of mates, while girls were helpless creatures at the disposition of men. After the rise of the centralized state, no one, male or female, was actually “free,” save perhaps the king or queen as highest lord, and even members of royal families had to be on guard against actions likely to stir up revolt among underlings. As a matter of fact, fathers and mothers of the middle and lower classes, as well as lords and ladies, took part in arranging the marriages of both boys and girls under the almost universal rule of “convenience.” The boy apparently had no more choice than the girl. There are records indicating that boys and girls sometimes made vigorous protests without avail; other records show that their protests were effective. But the general rule of marriage for convenience long prevailed.  \n>  \n>Whether fathers or mothers , men or women, usually dominated in the making of matches is a matter buried in the silence of unrecorded history, but there is abundant proof that women were active in the business and were no less circumspect or ruthless than men at the business. Women looked about for marriageable boys and girls to be convenient mates for girls and boys in their own families. Maidens were inclined to be shrewd and insistent – that is, “practical” – in marrying men with property, when they had any chance of selection, as they often did. Mothers were zealous in procuring for their daughters men who had property and in making sure that the property was good, and carefully guarded by proper legal titles. In other words, the marriage of convenience was no one-sided affair in which fathers and sons “had their own way” with the women concerned in it.\n\nAnd women still owned property. It's a myth they couldn't historically. They always were allowed to even back in antiquity. \n\n**Women were involved in warfare and building antiquity.**\n\n[According to chapter 12](https://www.marxists.org/archive/beard/woman-force/ch12.htm), German writer Sir Galahad described the ways of aggressive women long ago. Proof of armed women was found in European ancient ruins, proving that Amazons, the Greek female warriors, were real. Some people think early human years were peaceful, but fights broke out and disrupted it, and women were active in these conflicts in every way men were:\n\n>Where they had power as rulers or in ruling families they often instigated and proclaimed wars and even marshaled their troops as they went into battle. They incited men to ferocity at the fighting fronts. They accompanied men on marauding expeditions. They fought in the ranks. They took up arms to defend their homes. They nursed men on battle fronts or kept households going while men were at battle, and they looked after the wounded on their return to civilian life.  \n>  \n>There was not a type of war in which women did not participate. They were among the primitive hordes which went on looting expeditions against their neighbors or stood fast on their own ground in defense of their lives, herds, and fields. Old Roman records testify to the savagery of women in the Cimbrian tribes that swept down from the north into Rome. Among the Cimbrians, priestesses took charge of war captives. Standing on ladders which they carried with them to battle, they cut off the heads of prisoners, caught the blood in pots, and gave it to their men to drink, in the belief that it would double their strength.\n\nAncient women also initiated or inspired military efforts to subjugate others. Alexander the Great's militant Epirote mother, \"a priestess to whom his father, Philip, had been attracted when he saw her as a maiden prancing to or from a temple with a snake, a god symbol, held high in her arms, and attended by a procession of other maidens\", drove Alexander to become the master of the world. In most of Europe in antiquity and even during Arabia when Islam spread and people declared war against the Muslims, women fought at war. Even Muhammad had his female warriors who teamed up with him.\n\n**Women did influence politics, economics and social change historically.**\n\nFeminists argue women were forbidden from politics. Not exactly. While people were serving in the government were men in many societies, it's because they believed those who fought for our country were the ones allowed to form the government, but not all societies only sent women to war. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), in almost all countries, originally, neither men nor women could vote, and they usually granted suffrage to both concurrently. In some countries, they originally granted it men, then later women. In the US and UK, men originally could only vote if they owned property, and only 3% of British men and 6% of American men did (women were never property). In 1828 during the presidential election, the vast majority of states gave all men the right to vote, but it wasn't in all states until universal white male suffrage was given to men in North Carolina in 1856. Later on, women were given the right to vote more and more. It was simply because men served in the military in the US back then, not because women were considered inferior.\n\nNonetheless, women DID influence politics historically. Not voting didn't stop this, [and many women were originally against the right to vote](https://www.societyforhistoryeducation.org/pdfs/M15_Miller.pdf) because they worried it'd take away their soft power in influencing politics. In fact, many men supported their right to vote for equality, and while people who supported women's suffrage thought it was unfair they couldn't vote, people who opposed it worried that women had more power influencing politics than men because the government responded to women's needs more while men just cast in a vote that only wins if it's the majority opinion. Susan B. Anthony said women's suffrage laws \"probably never would have passed if it had been up to women to vote on them,\" and that men were actually more progressive about women’s suffrage than women were (1902). This [thread](https://www.reddit.com/r/MensRights/comments/15ac3xy/women_did_influence_politics_before_suffrage_and/) of mine elaborates on how women influenced politics easily before voting.\n\nContrary to what feminists think, laws weren't created based strictly on the opinions of men. Only 1% of men worked for the government, and they usually made laws based on what they thought was best for the land or its people, but not for men. Totalitarian leaders might be all about themselves, but certainly not men either. Women's opinions mattered a lot to men. [In fact](https://presidentlincoln.illinois.gov/Blog/Posts/141/Abraham-Lincoln/2021/8/Lincolns-avoided-duel/blog-post/), [Abraham Lincoln](https://www.battlefields.org/learn/articles/abraham-lincolns-duel) even used female pen names pretending to be a woman to attack political rivals, including James Shields.\n\nAlongside speaking against recent policy decisions made by Shields, Lincoln implied that his opponent was weird and unpopular with women.\n\n>*\"His very features, in the ecstatic agony of his soul, spoke audibly and distinctly – 'Dear girls, it is distressing, but I cannot marry you all. Too well I know how much you suffer; but do, do remember, it is not my fault that I am so handsome and so interesting.’”* \\-- Rebecca (Abraham Lincoln)\n\nLincoln's wife also wrote several letters against Shield under a female penname. Lincoln apparently consulted with her about his letters to make them sound like a woman wrote them. What does this mean? Women were seen as pure and moral compared to men, so their voices mattered a lot in politics, and because they couldn't vote, they were seen as fair and reasonable. **This is why women often opposed the right to vote, because they worried it would prevent them from being influential in politics.** If the 1800s were so patriarchal, why would he have used a female penname to pretend that a man was unpopular with women to destroy that man's career?\n\n[Moreover](https://daily.jstor.org/women-against-womens-suffrage/), Catharine Beecher, an advocate for women’s education and economic advancement, argued that women were most effective when they united to press their fathers, brothers, and husbands for reforms in terms that rose above intense partisan politics. Using anecdotal evidence, she pointed to her sister, Harriet Beecher Stowe, whose [*Uncle Tom’s Cabin*](https://daily.jstor.org/frederick-douglass-feud-over-uncle-toms-cabin/) had contributed to anti-slavery sentiment in the country, selling quickly before the Civil War and humanizing enslaved black people. It changed American's views of enslavement at the time, especially in the North. Another example was the women’s clubs that fought for pure food laws, [compulsory schooling](https://daily.jstor.org/why-would-parents-oppose-compulsory-education/), and other reforms that were easily framed in terms of maternal care.\n\n[Women influenced politics in many other ways, too](https://americanhistory.si.edu/blog/5-ways-women-influenced-politics-they-got-vote). In the 1800s, men and women flirted at political rallies and met their potential spouse. Politically-charged women charmed men into supporting certain political views, especially first-time male voters. In his new book *The Virgin Vote*, Smithsonian political history curator Jon Grinspan explains that women even \"turned down marriage proposals specifically because of a young man's political affiliations.\" These actions pressured husbands and suitors to vote in favor of a woman's views.\n\nCarry Nation, a female leader in the Temperance movement, used to use hatchets to smash saloons. Churches and theaters paid her to against alcohol. In the Victorian era, if a man smashed alcohols, he'd be stabbed, but men were chivalrous towards women and refused to harm her. Many people laughed at her, but respected her integrity for her beliefs anyway. Carry's radical approach helped launch the Temperance movement into mainstream American politics.\n\nEven in medieval times, women teamed up with Prophet Muhammad to fight off aggressors against Muslims and helped spread the message of Islam. Women in medieval Europe brought discussions and disputes about moral, societal, or religious issues.\n\nWhen wars happened over the centuries, wars of conquest, defense, crusades, or self-defense did not exclude women. As long as the Eastern Empire lasted, women were involved in situations that led to war. As the empire declined and feudal wars happened for imperialism, women in aristocracies and royal families inspired and initiated wars, and sometimes used their own weapons. They built the state of Western worlds which turned local conflicts into global wars, assisted by women. For centuries in the West and East, imperial power only was ostensibly (but not exactly so) bestowed to men who were head of a family. In reality, official or not, his power was shared by women. Imperial power was often exercised by one or more women. Even in Ancient Rome, the state had lots of power among its women. Beard cited:\n\n>Among such studies of ancient Rome are the 1,124 pages of the old work by J. R. de Serviez, *Roman Empresses ... Wives of the Twelve Caesars,* first published in the eighteenth century – an age of despotism in Europe; and G. Ferrero’s *Women of the Caesars,* published in 1911 when the power of European family clans was rapidly dissolving.\n\nOther wars/conflicts, like the Renaissance, the restoration of the Bourbons, War of the Spanish Succession, War of the Austrian Succession. As medieval Europe was developing, in rural families, men and women worked together almost consistently, and the woman kept the family and its land and house economy going while husbands went to war in England. In royal and aristocratic families in England, women used force in the state of affairs and in the management of the economy helping the monarchy. It wasn't until the the 18th century in England during revolutions destroying the royal/aristocratic families founded on wealth did women and their families in these groups lose power and the parliament and government became solely men. As time went by men, men were the ones serving in military, and they decided men thus would be the ones allowed in the government, but women had soft power in influencing politics as mentioned earlier, which is why people worried giving them the right to vote would get rid of that subtle power. This change happened especially in the French Revolution. In the 1800s, more and more women suffragists were appearing, but men also struggled with the right to vote beside the low minority who had property and thus qualified. In the most progressive societies, women received the right to vote before men's universal suffrage appeared in other societies. Before this point, there were women were highly involved in royal/aristocratic power over influencing politics and society. \n\n[Up until a couple centuries ago](https://www.cracked.com/article_20186_6-ridiculous-myths-about-middle-ages-everyone-believes.html), Europe was agricultural. In medieval Europe, if a father was owning a shop or tavern, his daughters were the ones helping. If her dad became unable to, she sometimes took over the business herself if he was now unable to, which didn't really happen until later in modern times. Women also generally ran taverns in medieval Europe, and [women in England ran the entire beer industry back then](https://books.google.com/books?id=c6MQJ-pdbwAC&lpg=PP1&pg=PA3#v=onepage&q&f=false). Women who didn't run taverns or grow crops often joined convents, and when education was rare at the time, it gave these women access to education. Thus, nuns could read or write in an era where the most powerful kings couldn't. [If women could eventually rule of a house of nuns, they could reach position of power very similar to a male lord, or even slightly higher, seeing as how they technically reported directly to the King of Kings and whatnot](https://web.archive.org/web/20100215224014/http://www.bl.uk/learning/histcitizen/medieval/women2/medievalwomen.html). Sometimes, in monasteries, the abbess had seniority over monks. Outside monastic walls, women could wield political power, especially as queens and regents who exercised royal authority when their husband or underage son was unavailable. A number of powerful queens can be noted in English history, of whom one of the most remarkable was Queen Isabella (1295-1358), who (in collaboration with her lover, Sir Robert Mortimer) ended the rule of her husband, Edward II (1284-1327).\n\n[Even in the Middle East](https://anthrosource.onlinelibrary.wiley.com/doi/pdf/10.1525/ae.1974.1.3.02a00100), women DO influence politics and society. They do it from private positions, and exercise influence over men, by being mediators in natal or affinal groups in marriage alliances, wielders of authority in the domestic sphere, educating their children, or controlling products or property. Women form kinship groups, act as \"data brokers\", mediating social relations in family and society. Women also notify men in their household about what happens in other homes and in extended family. Women also, despite being segregated by sex at times, join with other women in forming solidarity groups and spreading social influence. It helps cause political influence and raises her social status. Women also can influence men's behavior by spreading rumors or gossip, writing mock songs, and spreading social influence to boost or ruin his reputation, especially in social and political issues. Women there might not be in the government, but men rarely make it in the government, and women have so much widely ignored soft power in influencing society and politics, but feminists don't realize in some countries where dictatorships occur, they won't always get what they want, but some of the women's opinions there ARE socially conservative. Women there do influence how people think there and eventually these countries will lose their social norms if people figure their way around their countries' domineering government.\n\nWe have laws pandering to women, including battered women's shelters, campaigns and organizations for women's health, laws against violence against women, etc, but while these politicians are men, they don't make these laws for men. People have always responded to women's soft power historically and politicians' success depended on his support from women more than from men. Men weren't always able to vote historically, but when men served in the military more, they were given the right to vote, but women were still granted soft power that made more changes than mere marks on ballots that only won if a majority. That's why suffragists were originally a minority, but still managed to spread enough influence to become a majority.\n\n**Women were not excluded from history from men, but by feminists.**\n\nIn Chapter 12, Mary Beard wrote:\n\n>Certainly the original sources, which scholars use for the study of men in long and universal history, often mention and even recount stories or give elaborate data of many kinds about women. For example, Herodotus, whom historians of the modern age have called “the father of history,” deliberately included women in his history. Tacitus, the Roman, also observed and commented on the women of his time. Indeed ancient writers in various societies often thought it necessary to consider women and among their works are to be found statements respecting women’s force of character, learning, physical energy, military and political power, and creative intelligence – statements made by the contemporaries of such women.\n\nSo obviously, writers and historians didn't exclude women and even wanted them included. Mary Beard wrote in her book that the idea that women were men's subordinates and were forbidden from contributing to society is one of the biggest myths told in history. Feminists have erased the fact that 40% of slave owners in the US were white women and that women had soft power or even before the 1700s, had royal and aristocratic power, and promoted myths that women were property, were expected to be asexual beings even in marriage, were allowed to be beaten/raped by their husband, or were violently hated. Feminists probably originally removed women's contributions to society from history. Then decades later, feminists wanted to educate society about women's contributions to society they claimed were erased by men because they are clueless about what the first wave feminists did.",
    "title": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed.",
    "subreddit": "MensRights",
    "timestamp": 1700510201,
    "score": 124,
    "keyword": "european manager"
  },
  {
    "text": "Systemic Sexism: Council of Europe selectively focuses only on sexism affecting women, backs it up with misleading or outright false claims and sexist sources This post was first published on r/SystemicSexism, sub dedicated to rational and fact-based discussion about systemic sexism.\n\n\\----------------------------------\n\nCouncil of Europe: [https://human-rights-channel.coe.int/stop-sexism-quiz-en.html](https://web.archive.org/web/20230114111544/https://human-rights-channel.coe.int/stop-sexism-quiz-en.html)\n\n## 1/\n\n## What is the idea behind sexism?\n\n* **Men should not flirt with women**\n* **Some people are considered inferior because of their sex**\n\nSexism is any act, gesture, image, expression or behaviour based upon the idea that a person or a group of persons is inferior because of their sex.\n\n* **Some people are sexier than others**\n\n## 2/\n\n## Who is affected by sexism and sexist behaviour?\n\n* **Women and girls disproportionately**\n\nSexism impacts women disproportionately in all areas of life. When they accumulate over time, sexist incidents weigh on women and girls’ freedom and opportunities. Men and boys can also be victims of sexism, especially when they challenge what “a real man” must be. The harmful impact of sexism can be worse for some women and men due to their ethnicity, age, disability, social origin, religion, gender identity, sexual orientation or other factors.\n\n* **Only sad, lonely feminists**\n* **Just girls in mini skirts**\n\nFACT: In France, from 2016 to 2017, 89% of victims of sexist acts were women and 91% of aggressors were men. [Source](http://www.haut-conseil-egalite.gouv.fr/IMG/pdf/hce_etatdeslieux-sexisme-vf-2.pdf)\n\n## 3/\n\n## Someone tweets “She’s full of shit, but I wouldn’t mind a piece of that” about a woman journalist. This is:\n\n* **Unfortunately, a common part of the life of women journalists**\n\nMany women receive this kind of sexist comment daily. The psychological, emotional, physical impacts of such comments are real and severe. Women who are politicians or journalists, for example, are often discredited through offensive, sexualised comments or remarks about their appearance. This type of comment normalises violence against women and girls.\n\n* **Who cares, it’s only a tweet**\n* **Freedom of speech! let everyone express her/himself!**\n\nFACT: Nearly two thirds of women journalists have experienced online harassment (2018).68% of women members of Parliament have been the target of comments about their physical appearance or based on gender stereotypes. [Source](https://www.iwmf.org/wp-content/uploads/2018/09/Attacks-and-Harassment.pdf)\n\n## 4/\n\n## David is coming home and is starving. He can:\n\n* **Wait for his girlfriend, she knows what he likes to eat**\n* **Consider eating cat food, Tiger will be happy to share**\n* **Open the fridge and start cooking**\n\nEven if 67% of women in Europe are in paid employment, they still carry out most of the housework (Europe Union, 2017). This penalises women in their professional life and leaves them with less time for political involvement or leisure, for example.\n\nFACT: In OECD countries in 2018, women spend almost twice as much time as men in unpaid housework. [Source](https://stats.oecd.org/index.aspx?queryid=54757#)\n\n## 5/\n\n## For their birthdays, Aunt Annie gave a mini vacuum cleaner to her niece and a mini drill to her nephew\n\n* **Perfect, they both need to learn what life is about!**\n* **How great! Her niece just loves the cooking set she received last year!**\n* **Aunt Annie’s views on gender roles are sooooooo last century!**\n\nThe toys children play with have an impact on how they see themselves and the skills they learn. Allowing girls and boys to play with diverse toys is the best way to leave all opportunities open to them.\n\n## 6/\n\n## My colleague John makes a joke about the new trainee’s breasts\n\n* **I burst out laughing. This guy is always sooooo funny!**\n* **“Hey, John, what did you just say??”**\n\nSexist jokes or over-familiar remarks are never “just a joke”. They lead to the acceptance of women as passive or sexual objects. Special tip: if someone makes a sexist joke, answer with total seriousness: “I don’t get it, can you explain what you mean?”\n\n* **How could you miss them? What was she thinking, wearing that sweater?**\n\nFACT: In the United Kingdom, 66% of girls surveyed aged 16 to 18 experienced or witnessed the use of sexist language at school.\n\n## 7/\n\n## Leon and Sarah are having a nice evening together. Leon thinks Sarah will spend the night with him.\n\n* **Look at that dress! She wants it!**\n* **A romantic dinner under the full moon, they’ve already kissed, sex is obviously the next step.**\n\nEach sexual act should be based upon consent. No kiss or skirt can replace a clear \"YES\". More about [consent with a cup of tea](https://www.youtube.com/watch?v=5davRVQB0Lk). Copyright ©2015 Emmeline May and Blue Seat Studios\n\n* **Maybe. But she may not want that. And if she does, she may also change her mind.**\n\n## 8/\n\n## The department manager tells Nadia that she won’t need to go on business trips this year, so that she can “make room for her family life”\n\n* **She is so lucky! What an attentive boss!**\n* **How she handles her private life is none of his business.**\n* **No way! Promotions are known to be linked to successful business trips.**\n\nFACT: Sometimes, approaches that seem to be protective of women at work reflect a very paternalistic attitude. This “benevolent sexism” is neither positive nor anecdotal: it contributes to maintaining dominant relationships and inequalities between women and men.\n\n## 9/\n\n## When women play a football game\n\n* **There’s no point, the bets aren’t as high**\n* **It lasts 90’ minutes and the 22 players try to score goals**\n\nSexism is very present in sport, including when women’s sporting achievements are downplayed. Sport and culture are important areas where positive role models can help create equal opportunities between women and men and counter harmful gender stereotypes.\n\n* **How cute 😜**\n\nFACT: The total prize money for the 2015 Women’s Football World Cup was 1,9% of the 2018 Men’s Football World Cup. A 2011 survey showed that more than 90% of sports-related articles were written by men journalists and more than 85% of the articles focused on sportsmen. [Sources: Forbes (2018), “The Evolution of FIFA World Cup Prize Money”](https://www.forbes.com/sites/niallmccarthy/2018/06/05/%20the-evolution-of-fifa-world-cup-prize-money-infographic/#29dfb11a6ca5%20and%20International%20Sports%20Press%20Survey%202011)\n\n## 10/\n\n## Eva has filed an application to work in the police:\n\n* **No way: police officers need to be strong, run fast and bring suspects under control. This is a man’s job.**\n* **Physical force is only one aspect of the work of police officers, who need to be able to deal with various situations and to work with all sections of the population**\n\nPolice activities are diverse and physical strength (which is also a question of technique and training for both women and men) only matters in a limited number of operational tasks. Intelligence, the mastering of dedicated working methods, analytical and deductive skills, are more important to be a good police officer. Studies have documented the many benefits of gender balance at all levels in law enforcement bodies.\n\n* **Way to go! Women are great at paper work!**\n\n&#x200B;\n\n\\------------------------------------------------\n\n# OP's commentary:\n\n2/\n\n>Sexism impacts women disproportionately  \n>  \n>\\[...\\]  \n>  \n>FACT: In France, from 2016 to 2017, 89% of victims of sexist acts were women and 91% of aggressors were men. [Source](http://www.haut-conseil-egalite.gouv.fr/IMG/pdf/hce_etatdeslieux-sexisme-vf-2.pdf)\n\nThe source does not measure whether women are more affected by sexism than men - it can't because it uses this sexist definition of sexism: \"**According to the High Council for Equality, sexism is an ideology based on the postulate of the inferiority of women compared to men**\" \\[translation by Google\\].\n\n&#x200B;\n\n3/\n\n>FACT: Nearly two thirds of women journalists have experienced online harassment (2018).68% of women members of Parliament have been the target of comments about their physical appearance or based on gender stereotypes. [Source](https://www.iwmf.org/wp-content/uploads/2018/09/Attacks-and-Harassment.pdf)\n\nThe source does not measure whether female journalists experience more harassment than male journalists: \"**The following results refer only to our female respondents, as the purpose of the study is to observe trends among women media workers.**\"\n\n&#x200B;\n\n4/\n\n>Even if 67% of women in Europe are in paid employment, they still carry out most of the housework (Europe Union, 2017). This penalises women in their professional life and leaves them with less time for political involvement or leisure, for example.  \n>  \n>\\[...\\]\n\nFalse. Eurostat data shows that **women spend more time on personal care**, including sleeping, relaxing and leisure than men: [https://ec.europa.eu/eurostat/databrowser/bookmark/420b7a50-f0d7-494e-bc20-4f4a652b1892?lang=en](https://ec.europa.eu/eurostat/databrowser/bookmark/420b7a50-f0d7-494e-bc20-4f4a652b1892?lang=en)\n\n&#x200B;\n\n>FACT: In OECD countries in 2018, women spend almost twice as much time as men in unpaid housework. [Source](https://stats.oecd.org/index.aspx?queryid=54757#)\n\nYet according to the same source the total time spend working is comparable.\n\n&#x200B;\n\n5/\n\n>The toys children play with have an impact on how they see themselves and the skills they learn. Allowing girls and boys to play with diverse toys is the best way to leave all opportunities open to them.\n\nYet the example, like all examples in this quiz, focuses only on girls.\n\n&#x200B;\n\n6/\n\n>FACT: In the United Kingdom, 66% of girls surveyed aged 16 to 18 experienced or witnessed the use of sexist language at school.\n\nIncluding the use of sexist langue by girls targeting boys, right?\n\n&#x200B;\n\n7/\n\n>Each sexual act should be based upon consent. No kiss or skirt can replace a clear \"YES\". More about [consent with a cup of tea](https://www.youtube.com/watch?v=5davRVQB0Lk). Copyright ©2015 Emmeline May and Blue Seat Studios\n\nExcept when women rapes a men in United Kingdom, Ireland, Switzerland, Slovakia or other country with gender specific rape laws.\n\n[https://www.reddit.com/r/MensRights/comments/xk19dk/unequal\\_legal\\_rights\\_male\\_exclusive\\_rape\\_laws/](https://www.reddit.com/r/MensRights/comments/xk19dk/unequal_legal_rights_male_exclusive_rape_laws/)\n\n&#x200B;\n\n8/\n\n>FACT: Sometimes, approaches that seem to be protective of women at work reflect a very paternalistic attitude. This “benevolent sexism” is neither positive nor anecdotal: it contributes to maintaining dominant relationships and inequalities between women and men.\n\nYet benevolent sexism is often codified in European law ([https://en.wikipedia.org/wiki/Retirement\\_age](https://en.wikipedia.org/wiki/Retirement_age), [https://en.wikipedia.org/wiki/Conscription\\_and\\_sexism](https://en.wikipedia.org/wiki/Conscription_and_sexism)) and female privileges are often eagerly defended by those who claim to fight against sexism.\n\n&#x200B;\n\n9/\n\n>FACT: The total prize money for the 2015 Women’s Football World Cup was 1,9% of the 2018 Men’s Football World Cup. A 2011 survey showed that more than 90% of sports-related articles were written by men journalists and more than 85% of the articles focused on sportsmen. [Sources: Forbes (2018), “The Evolution of FIFA World Cup Prize Money”](https://www.forbes.com/sites/niallmccarthy/2018/06/05/%20the-evolution-of-fifa-world-cup-prize-money-infographic/#29dfb11a6ca5%20and%20International%20Sports%20Press%20Survey%202011)\n\nMen are more interested in football - and in sports in general - both as spectators and as participants. False equality that ignores the player's performance and the economics of professional sport is in itself a form of sexism - especially when the equal outcome criterion is selectively abandoned in areas where women earn more than men, like supermodels. [https://en.wikipedia.org/wiki/Gender\\_pay\\_gap\\_in\\_sports#Economic\\_return](https://en.wikipedia.org/wiki/Gender_pay_gap_in_sports#Economic_return)\n\n&#x200B;\n\n10/\n\n>Police activities are diverse and physical strength (which is also a question of technique and training for both women and men) only matters in a limited number of operational tasks. Intelligence, the mastering of dedicated working methods, analytical and deductive skills, are more important to be a good police officer. Studies have documented the many benefits of gender balance at all levels in law enforcement bodies.\n\nWhile this is certainly true, if we require that operational tasks where physical strength matters be fulfilled predominantly by male officers then we put males in disproportional danger. Some 23,000 officers were assaulted in 2015 in UK alone ([https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment\\_data/file/445667/police-officers-assaulted-mar15.pdf](https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/445667/police-officers-assaulted-mar15.pdf)), and while I was unable to find any statistics that reports police injuries by gender (is this on purpose?), the number of **work related deaths** in the broad category of \"Public administration and defence; compulsory social security; education; human health and social work activities\" is **0,03 per 100,000 female** employees and **0,12 per 100,000 male** employees. ([https://www.hse.gov.uk/statistics/tables/ridagegen.xlsx](https://www.hse.gov.uk/statistics/tables/ridagegen.xlsx))\n\n&#x200B;\n\nPS: I am looking for a French speaker to help me verify some information in the Haut Conseil Egalite source. Thanks in advance.",
    "title": "Systemic Sexism: Council of Europe selectively focuses only on sexism affecting women, backs it up with misleading or outright false claims and sexist sources",
    "subreddit": "MensRights",
    "timestamp": 1673710562,
    "score": 77,
    "keyword": "european manager"
  }
]