[
  {
    "text": "New Position vs Cushy Current Position I know this may have been asked before, in multiple ways / threads...but I have a feeling mine may be different. I know only I can make the decision, but any advice would help.\n\n    TL;DR - \n    This new role could be interesting, and push me out of my comfort zone. Large learning opportunity, currently a pay raise, and keeping an apparent flexibly work life balance...with trust in what I can do (which current company struggles to show me). \n    The few cons of the unknown hold me back, as well as the ease of my current company and potential for more growth is keeping me lingering here...and not knowing how this might affect my personal life outside of work. But, then again, I can always walk away and find a more aligned position if it comes to it? More details below...\n\n**New Position:**\n\n* 26% raise over current Total Comp\n* Flexible work location and time variance (no set schedule, hybrid eventual remote..)\n   * Easier commute when in office (40 min vs 1 hr)\n* Interesting and impactful product\n* Start Up atmosphere (4 employee US, \\~60 employee global)\n* 3 - 5 year runaway plan for funding, and track record of success globally\n* Work with U.S. - CEO directly, who seems calm, level headed, European management style\n* They want my skillset and attitude.\n* Startup allows me to focus in on business as well as engineering (my vocation). I'm interested in business...\n\n**Cons:**\n\n* Current company has me inline for promotion (unclear on % raise though...). More responsibilities too, outside of engineering scope. But it's there.\n* Reliable current schedule, easy to build a routine from, and know when days remote are.\n   * I also have projects and Real Estate outside of work, that also needs some time. So now I won't have a consistent remote schedule (but still possible..)\n* Unknown risk and traction for this product in the US market **vs** my current cushy job.\n* Only engineer on US soil for the company (but, same with current team n manager...but closer to engineers)\n* Unknown if I will develop certain technical engineering skills vs other important skills that I will develop (hurts chances when applying online or via some recruiters)\n   * Note: Current job, I ***need*** to search out and find my own ways to develop these said skills since my manager is not an engineer, nor is my team. \n* I enjoy my current company, and some people ... but I don't particularly enjoy being in the office at certain times, since the people don't align with me and I'm forced with them.",
    "title": "New Position vs Cushy Current Position",
    "subreddit": "jobs",
    "timestamp": 1696265144,
    "score": 1,
    "keyword": "european ceo"
  },
  {
    "text": "One Year Later... a new business owner's journey to being a desirable and fair employer. Hi Folks.\n\nAbout a year ago I started my own business, and I came to this sub to solicit ideas on how to make my business one that treats its employees differently than the average American business.\n\nPrior thread here:  [https://www.reddit.com/r/WorkReform/comments/unt8j9/as\\_a\\_founder\\_at\\_a\\_new\\_company\\_what\\_are\\_some/](https://www.reddit.com/r/WorkReform/comments/unt8j9/as_a_founder_at_a_new_company_what_are_some/)\n\nBackground:\n\nI was fired for no cause from a media production agency last March because the executives at the top didn't value the people on the front lines.  In a company of 44, 10 were let go in one day because the CEO spent more than $330,000 out of the company coffers on paying off his house.\n\nWe found this out because our sales call recording software wasn't partitioned correctly and all executive calls were available to our remaining colleagues, who promptly rifled through them and heard all sorts of great things about how the executive level \"didn't give a fuck\" about removing 25% of the company in one swift blow.\n\nI founded my own agency the next day, and resolved that I would never be so cavalier about other peoples' employment when I ran the show.\n\n&#x200B;\n\nHow it's going:\n\nMy business is pushing towards $400,000 a year in revenue.  Along the way I've worked with incredible contractors, including a friend of mine I've known for 15 years.\n\nThis is now his full time job aside from a few supplemental gigs he takes on every few weeks (Some of our weeks are busier than others).\n\nDue to our success, we've been able to institute a mandatory $30 an hour minimum wage for all folks working with us here.  As we grow over the next few months, the goal is to move that to $35 an hour for all positions.  My personal take home as CEO and founder current remains locked to my team's.  I do take a few small profit distributions ($1-3K per quarter) as an additional perk.\n\n&#x200B;\n\nSo many of you gave incredible advice on benefits last year, and I cannot thank you enough for telling me the amazing ways to share the success of the business with others.\n\nBased on your input, we codified the following core company values to ensure my business was a place that not only helped me but focused on OTHERS as well.  (These were brought to everyone who works with me to workshop them and make sure that they were values that the team could get behind 100%)\n\nThey are: \n\n1. Act with Integrity -  Doing the Right Thing is Always the Right Thing.\n2. Fight It Out - We Defend our Ideas Passionately,  but Not Blindly.  \n3. Prosper Together -  The Company Works for All of Us — Not Just Those in Charge.\n4. Take Measured Risks - Both Data and Heart Gets the Best results\n5. Build Business on Relationships -  Be an Agency Customers Never Want to Leave\n\n&#x200B;\n\nNumber 3 is one that REALLY stuck out with me based on my past experiences and the feedback I got here last year.  Thank you for helping me keep my business success grounded and working for both me and the folks that work with me.\n\nAs soon as it is feasible, we are enacting the following:\n\nMoving contractors who work full time hours into the actual \"employee\" category.\n\nFinding Healthcare, Dental, and Vision coverage for those employees\n\nEnacting a 4 weeks mandatory vacation policy, with tracking to ensure it is taken in ways that benefit both the worker and the business (not just taking a month off whenever)\n\nProfit sharing (I have no idea what this will look like, but quarterly sounds great right now!)\n\nHoliday Season Bonuses\\* (We were able to give our team some wonderful financial gifts this year based on their level of involvement with the company, but I'd prefer this be something more than just a few hundred or a few thousand bucks haphazardly written out)\n\n $1000 Home office conversion stipend\n\n$50/ month Internet use/cell data stipend\n\n&#x200B;\n\nThere are many other perks I've been looking at (mat/pat/adopt leave, cost of living and inflation adjustments and more) and have placed on a 1,3,5,10 year Vision/Traction organizer (VTO) and plan to implement to take care of the team, but that's a little far down the road for what I can see with the resources I have at hand.\n\n&#x200B;\n\nI would like to ask this sub, are there NEW types of compensation, benefits, perks, and other ways to make work better for folks that I've missed?  I'd love to stay current on what I can offer my team down the road that not only helps to value them, but makes my company a place where people want to work.\n\n&#x200B;\n\nAlso, what do you think of the way things have developed so far?\n\nWe've had no capital to work with from day 1 and the company was founded on the last $26 of disposable income in my pocket.  Everything that's happened has been a result of the team's hard work, and I'd like to continue to make sure they are appreciated financially and are fulfilled in what they do every day.\n\n&#x200B;\n\nYour help is tremendously appreciated.  Thank you all for continuing to advocate for sensible reform on work and for helping me make a better workplace for the people who trust me with their employment.\n\n&#x200B;\n\nP.S. European folks, I want to hear from you especially with what works in your countries!",
    "title": "One Year Later... a new business owner's journey to being a desirable and fair employer.",
    "subreddit": "WorkReform",
    "timestamp": 1676422845,
    "score": 157,
    "keyword": "european ceo"
  },
  {
    "text": "[USA, though hoping to move to the EU ASAP] In reading my profile (neurodivergent, well-educated, well-traveled, idealistic--and tons more detailed inside), can you suggest any great-fit jobs/careers with higher earning potential $75k+ that might be in my blindspot? tl;dr--\n\nI can sort of see the different pieces of my self, but struggle to see the big picture. Sometimes people look at me and say \"it's so obvious, you should be doing X, Y, or Z\" but for me, I just feel sort of disjointed and unsure of what direction to head in.\n\nI am an interpreter and I imagine there are very few jobs that are a better fit (though I am confident there are at least some). The hours worked vs. pay is a great fit and I love working with languages. It is hard to leave the field, because not a ton of jobs pay $80k for ≤35 hours of work/week. But I miss bringing my own thoughts and ideas to the table. I miss sharing my perspectives and working toward a solution I help come up with. (Interpreters are more like neutral middlemen than active participants.) I also wish I had some revenue sources that weren't based on 1-on-1 interactions (think more passive or hands-off income vs. only having income based on minutes/hours billed).\n\n\\----------\n\n**Here's a ton of information about me, do you have any career paths that jump out at you as things I might be good at or would be a good match for me, my happiness, and the lifestyle I hope to live? Generally, I'd like to:**\n\n* earn a lot of money\n* not sell my soul to the devil (e.g., foreclose on poor people's homes so executives can get more yachts)\n* travel & interact with foreign cultures\n* work with people more than things\n* have no two days be the same\n* work to live (not live to work)\n* help people solve problems\n\n\\----------\n\nBackground:\n\n* **Age:** 35\n* **Undergraduate degrees:** Anthropology (US), interpreting (US)\n* **Graduate degrees:** Entrepreneurial Innovation (EU), MBA (US)\n* **Years of professional experience:** 10-12\n* **Current career:** Full time interpreter (previously in-person, now 100% online)\n* **Current location:** USA\n* **Current income:** \\~$80,000 ($45 - $85/hr.)\n* **Desired career:** Here for advice about this\n* **Desired location:** The European Union\n* **Desired income:** \\>$75k\n\n\\-----------------\n\nOther considerations:\n\n* **I have ADHD.**\n   * That means I naturally resist structure, despite thriving when I have it. Internal motivation is a weakness, but I do great with external motivation. Micromanagement is not something I handle well and I really struggle with very hierarchical organizations (I believe the CEO and the janitor should be treated equally and really hate sucking up to people just because they're higher up on the ladder.)\n   * Generally, ADHD brains are best motivated by:\n      * interest *(once the interest is gone, my system goes offline),*\n      * novelty *(better at starting projects than finishing them)*,\n      * challenge *(tell me I can't do something and I'll want to do it more)*,\n      * urgency *(I procrastinate, but once the time pressure clicks I can be unstoppable)*,\n      * and passion (I won't shut up when you hit on a topic I am passionate about).\n* **I am very money-motivated...**\n   * I grew up in poverty, so it's important for me to have a secure and comfortable life economically. To date, I have preferred my hourly work to salary work.\n* **...but not at the expense of my humanity.**\n   * I think I would probably do well in an environment with a clear social impact--be that a mission-based organization helping making positive change in the lives of disadvantaged people or something in the tourism industry that makes tourists feel the wonder and magic of a place they're visiting for the first time. I just likely won't thrive in an environment that is focused on sucking money out of the poor, fanboying over an expensive gadget just because it's popular, or joining an oil conglomerate.\n* **I/I'm (strengths):**\n   * an avid traveler (and quite savvy at planning my way around the world)\n   * a pretty good writer\n   * a pretty decent problem solver (I can get a lot done with a laptop, my phone, and a pad of paper)\n   * funny, sociable, friendly\n   * kind-hearted\n   * a good communicator\n   * pretty smart, or so I am told\n   * an out-of-the-box thinker sometimes\n   * sometimes comfortable doing things my way\n   * great at languages\n   * do better at short-term projects/assignments (vs. long-term planning)\n   * perform well under pressure\n   * usually pretty good in an emergency situation\n   * prefer the spirit of the law to the letter of the law\n   * I like a good perk: Unlimited or high PTO, professional development resources, etc.\n   * Variety is the spice of life\n   * I am not at all artistic, but am creative in different ways\n* **I/I'm (weaknesses):**\n   * chronically late (see ADHD)\n   * struggle with procrastination (thought time running out is a fairly reliable motivator for me)\n   * struggle with prioritization\n   * sleep horribly (but also maybe more used to functioning on little sleep than most)\n   * am not a morning person\n   * I am naturally a \"helper\" and it can be hard to accept when people don't want help (especially when the solution seems so obvious to me).\n   * struggle to follow rules I find inane or not well justified (though I will of course follow the law)\n   * Struggle to operate without knowing the why (You say, \"Jump.\" I say, \"Happy to do so, but could you explain why I am jumping?\") A \"no\" without a clear \"why\" is the worst.\n   * Better working 2nd shift (10a - 2p start time) than I am 1st shift (6a - 10a start time).\n   * Avoid formal dress when possible\n   * Easily bored and exhausted by monotony\n   * \"That's not possible\" and \"That's just how it's always been done\" are among my least favorite sentences.\n   * Struggle to put corporate needs over the needs of the worker, common person. (In management, I think I have always tended to side with the worker over the demands from on high -- which probably made me a decent manager for folks at my level or below, but terrible for people looking down on me from up the chain.\n   * Sometimes struggle to focus on the longer-term strategy (vs. immediate action)\n* **Careers I think would be a terrible for me:**\n   * \\- Wait! Maybe you could jot down a few ideas first, before ruining your first impressions with the things I have included on this list. >!Accountant, architect, fulfillment center worker, software engineer (I imagine?), data entry, filing clerk, auto mechanic, seamstress/tailor, military/armed forces, lawyer (I think the helping folks part would be amazing, but that the formality and time management would be a mess.)!<\n* **Careers that might be a better fit for me:**\n   * Wait! Maybe you could give me a few ideas first, before ruining your first impressions by revealing what I have written? After you make a note, please let me know if I also listed it here or not. >!Interpreter, social worker, teacher/professor, flight attendant, speaker, journalist (though deadlines are tough), newscaster, tour guide, paramedic, actor, accessibility or DEI consultant, comedian, busker, entrepreneur/social entrepreneur, 911 operator, patient advocate, teaching language classes to immigrants. People have said I should get into UX, but I don't really know what that means/am unfamiliar with the field.!<\n\nWhat do you think? What comes to mind? I appreciate any advice or insights you might have for me. Thanks!",
    "title": "[USA, though hoping to move to the EU ASAP] In reading my profile (neurodivergent, well-educated, well-traveled, idealistic--and tons more detailed inside), can you suggest any great-fit jobs/careers with higher earning potential $75k+ that might be in my blindspot?",
    "subreddit": "careerguidance",
    "timestamp": 1698707095,
    "score": 2,
    "keyword": "european ceo"
  },
  {
    "text": "Is this a massive red flag? Incredibly Slow Recruitment Process\n\nCompany I applied for is going through major restructuration After getting acquired by a global org. New CEO wants to take the company global (currently European based) and triple its value. They warned me early on that this will be a slow process. But 3 months of interviews and exams later, they went radio silence. At this point, I lost patience. I started calling and messaging daily, and each day they postpone me to the next. I simple wanted feedback so I know where I stand. After 3 weeks of that, they fumble and give me an offer and lengthy apologies. Offer was good, I replied with some clarification questions and asking for a bit more money. Now the delays start again. Clearly they gave some broken processes. Its another week of everyday postponing me to the next. I'm now extremely frustrated and pissed off. I want to refuse their offer, but I really need the job. Maybe this is a major red flag or that this restructuring a multi billion dollars company is a real problem. What do I do?",
    "title": "Is this a massive red flag?",
    "subreddit": "careerguidance",
    "timestamp": 1695245398,
    "score": 1,
    "keyword": "european ceo"
  },
  {
    "text": "AR/AP is boring, I do not want to get stuck in it for the rest of my life, I want a career change. Do you have any idea how? I think the title sums it up. \n\n I am a graduate of International and European Economic Studies from a Greek University and I am currently doing a masters degree in Economic and Business Studies. I am working for a year now as a junior accountant in a medium size firm (rough 5M revenues) in a two-man team together with the CFO. \n\nI like the accounting stuff that I do ( i.e. AR and AP journal entries, credit control, invoicing, etc.) but it is BORING. AI also can do a better job on that than I do, is not well paid nor do I see a future in it.  I want to analyze numbers and advise on financial decisions, not enter my CEO's daily five guys receipt on AP as \" other business expenses\" on Quickbooks :)\n\nHow has anyone of you managed to escape that stuff? Is accounting as boring as this? What tasks do you do when you become more senior? Should I try my luck and try to find a job in FP&A?",
    "title": "AR/AP is boring, I do not want to get stuck in it for the rest of my life, I want a career change. Do you have any idea how?",
    "subreddit": "Accounting",
    "timestamp": 1688022910,
    "score": 24,
    "keyword": "european ceo"
  }
]