[
  {
    "text": "Have you ever outsourced your software development to companies from Eastern Europe? Why and why not? Were you satisfied with the quality? Hello there! I'm a CEO of a [software development company](https://expert-soft.com/) from Belarus. And recently I've been thinking about the fact that not all European or US companies choose to collaborate with Eastern European companies. But after they've tried, they find out that they've got excellent quality and lower rates. So, all in all, they are quite happy they went for it. \n\nWhy do you think some companies avoid outsourcing their software development to companies from Ukraine, Poland, Belarus, Russia. Have you ever worked with any of these countries? Thank you a lot! :)",
    "title": "Have you ever outsourced your software development to companies from Eastern Europe? Why and why not? Were you satisfied with the quality?",
    "subreddit": "cscareerquestions",
    "timestamp": 1639731608,
    "score": 3,
    "keyword": "european ceo"
  },
  {
    "text": "What are my chances of getting an entry level position in public or industry accounting? Hello! I graduated with a degree in Accounting in 2010, and an MBA degree in 2012 with a respectable GPA of 3.50. I was also a member of an honor society. After 2012, I met a woman from Europe and followed her to her country. Unfortunately, the economy was very bad there (50 % amongst younger adults), so I worked in an entirely different field to earn an income. \n\nFast forward to 2018 when the relationship sadly ended. I moved to another European country (most of my family lives there). I’ve supported myself taking odd jobs here and there, but haven’t been able to break into the job market in accounting here. My resume is sadly completely unrelated to accounting, which works against me when looking for a job here, as it would for anyone being out of the game for so long. There’s also a major language barrier (long story). \n\nFast forward to 2021, my friend in the US who owns a small business has offered me a temporary job working in his office (AP/AR accounting using Quickbooks + other duties at the office) until I can find an entry level job in accounting in either industry or public accounting. He wants to pay 40K per year without any benefits. \n\nI am really hesitating, as I am worried that I’ll have a hard time finding an entry level Staff accounting position or something similar, considering the gap in my CV. He lives in one of the largest American cities. \n\nI read an article on LinkedIn by a CEO, recommending that those who have been out of the game for several years may propose to potential employers a contract type of employment, in which they wouldn’t have to hire me immediately before feeling assured that I am reliable and a good fit for their business. What other paths do you recommend to get a good entry level job in accounting in the US? How difficult would it be? \n\nHas your firm/company hired anyone in a similar boat to mine, or would a situation like mine be entirely frowned upon? \n\nI am 3 accounting courses away from being able to sit for the CPA exam, but realistically this would be a medium term goal if absolutely necessary, as many states require accounting related employment for 1 year in order to be certified. \n\nI have two solid CPA references from my studies. \n\nThanks for your feedback. I really appreciate it. I feel very anxious over my situation but really want to change it.",
    "title": "What are my chances of getting an entry level position in public or industry accounting?",
    "subreddit": "Accounting",
    "timestamp": 1634493826,
    "score": 10,
    "keyword": "european ceo"
  },
  {
    "text": "What would you do- Can I be a public Company Controller?   \n\nThrow away account, obvious reasons. \n\nTLDR: I took a job as the controller/ entire finance & accounting team in a small private company (Start up) that had no intentions of gong public ever, now, less than 4 months later my boss just told me that management/ the board was now considering going public this year through a SPAC. I have very limited public experience (just one small public company I seniored back when I was in public nearly five years ago.) I love my new job but I don’t even know where to start in making sure we check all of the public company boxes. Also, the entire IPO process.  \n\nHere is the long form (Sorry for the length, venting as much as anything).   \n\nBack in September, I left an Assistant controller position at 100M dollar multinational private equity owned company that I had been with for four years. In late 2018/ early 2019 did a lot with the sale from one PE firm to another (Mostly coordinated the Quality of earnings with the firm performing the Q of E). By the time I left, I was supervising most of the finance team (4 direct reports in the US manager, senior, staff and AR and 2 direct reports in India AP/ AR). I was also doing a lot of financial reporting, including a super complicated cash flow model. Doing most of the coordination with a European finance team, day to day audit contact, over saw and did a lot of our financial statements for the audit including footnotes. The controller was pretty bad and ended up getting relegated to overseeing just AR and AP.  When I left and they brought in a new Controller to replace me even though I was only the assistant controller.  I was exhausted and completely burnt out. I felt like I was always underperforming.  I pretty much thought I never wanted to do accounting again, but it pays the rent. \n\nSo, this summer I decided to look for a controller position given that I was quickly approaching 10 years in accounting (5.5 years in public large regional and a national firm and 4 years in private). I was connected to my new job by a partner I used to work with in public. \n\nI am the only accounting and finance person besides my boss who does some FP&A (though now transitioning to me) and overseas the rest of the ops team, including some client management type stuff.  The company only has about 40 employees and under 10M in large enterprise billings (about 100 invoices for the entire year). Simple automation tools like bill.com and expensify were already set up and integrated by the time I started. The actual bookkeeping is pretty simple. There are only a handful of invoices to generate a month, maybe a dozen or so. It takes a day to get the books closed down and another couple of days to get through the consolidation, B2A and get numbers packaged up. \n\nGiven the amount of time, I had time to do things like implement ASC 606 with just a bit of help from a technical accounting consultant to bless the memo (Which ended up saving the company a lot of money with the consultant). Get out books properly converted to GAAP in advance of the audit (As they had not been), and have started to work on FP&A and stand in as a light sales ops person. Even doing all of this, the stress is like an 1/8 of my last job. For the first time in my 10 years of accounting, I am not teetering on burnout during the month of February. Our Audit starts in April, but I have provided the TB and most of my recs already. The feedback has been overwhelmingly positive. Like, I am performing better that I ever have in my entire career. I like the team. I like the company. I actually like my job. The money is more than I have ever made (Though I think realistically I could make a bit more somewhere else) We will likely be cash flow positive in the next year or so and until then the VC money seems to flow freely. The company is in a great position. \n\nDuring the interview, I was very explicit that I did not have much public company experience. Just one little client I seniored for a couple of busy seasons towards the end of my time in public. I have never prepared 10K. During the interview, the CEO (Who is the founder and owns a majority interested) explained that they did not want to go public and they had some 30 year business plan or maybe a 100 year business plan. They talked a lot of SpaceX because they are investment bankers turned tech bros which I am used to working for at this point and beside for salivating over Musk, I find they are good at running the companies. \n\nToday, during my one on one, my boss brought up the idea that we may go public within the year through a SPAC. I’m not even sure if this logistically possible (Maybe it is, I have literally no idea) and I am not sure anyone at my company had ever actually done an IPO before. I think the radical change is likely due to a very hearty valuation from a comparable company that did their IPO back December or January. Essentially, my boss asked me want I wanted to do in my career. It very much had the undertones of, “We really like you, you do a really good job, we want to keep you, but we both know you do not have the experience to be a public company controller, what else can you do here to be beneficial... how about FPA.” \n\nSo, that leaves me the following options: \n\n1. I could immediately freak out and look for a new job. I really do not want to do this. I like this job, at a minimum, it’s a nice little break in the interim to what comes next.\n\n2. I could stay on and transition to another role in Ops, likely being a manager and doing a lot of coordination. I’m not sure if I really want to step out of accounting after dedicating 10 years  of my life to accounting. Also, it turns out, once I’m not in a pressure cooker, I think I might actually like accounting. \n\n3. I could transition to FP&A which has never had much appeal to me and I forecast like a very conservative accountant. Also, I have little experience in FP&A and am not sure how effective I am here. \n\n4. I could ask to be the controller once we go public and asking about supplementing with a manager with the right experience (That feels like it could wrong so many ways). \n\n5. I could bide my time, stay controller until it is clear I can no longer do the job and then leave once I cash in my options. \n\nWhat would you do, what should I do? What other options. Should I be concerned that there seems to be a pretty monumental shift in both the business plan and the plan to go public? Is there any chance I could try to be the controller of a public company with out monumentally crashing and burning? \n\nLastly, I want to be patient, there is a more than decent chance management will back track and nothing will happen.",
    "title": "What would you do- Can I be a public Company Controller?",
    "subreddit": "Accounting",
    "timestamp": 1613605907,
    "score": 5,
    "keyword": "european ceo"
  },
  {
    "text": "Which route to take? (General Accounting or FP&A) CPAs out there or anyone working as an accountant, which path  would you choose?\nI live here in the Philippines and would also like to know how to work with and EU nationality.\n\nOption 1: Senior FP&A role in a MNC (a known industry leader and has an appearance globally), 69% increase in salary, new learnings and function. I will be working purely on forecasting, planning and budgeting. So goodbye month-end closing but hello budget season?\nBosses are Filipinos as well as all colleagues.\n\n☆ Career path goal: transition to FP&A, after 2 to 3 years will be eyeing a manager role specializing in FP&A functions or Finance Manager in MNC.\n\nOption 2: Finance Manager in a medium-sized consulting company based in Europe, 76% increase in salary, same work experience-General Accounting, but with Management reports needed for KPIs. I will be working side-by-side with European counterparts because all transactions of the business are there and I will directly report to senior manager and CEO which is an EU nationality.\n\n☆ Career path goal: apply all my knowledge in General Accounting, Finance Analysis and in 2 to 3 years look for a Finance Manager in MNC or work as Accounting Manager in a medium sized to large companies.\n\n• Which career path would you choose?\n• What is the most in demand and will get a higher compensation in the long run?\n• What is the role that I can get somehow more work-life-balance.\nIs it in FP&A or in Accounting?\n\nI would love to hear your thoughts and advices.",
    "title": "Which route to take? (General Accounting or FP&A)",
    "subreddit": "Accounting",
    "timestamp": 1637465407,
    "score": 5,
    "keyword": "european ceo"
  }
]