[
  {
    "text": "Leaving an up and coming start up ... Am I in the wrong and do I owe them anything? Bit of a long one so I'll TLDR.\n\n&#x200B;\n\n**Basically I'm wondering if owe my current company anything before I leave? I'm worried about my reputation being tarnished. I'm also worried about leaving what could be a very successful company.**\n\n&#x200B;\n\nSo I'm posting this on a throwaway account as I do not want my current employer to know I may be looking to leave their company.\n\n&#x200B;\n\nAnyway, to give you an overview of my situation, I recently emigrated to a new country and was lucky to get hired by a start-up company (four people including myself, two owners and my supervisor) who had opened the previous year and were offering a Premium European product for sale in our city.\n\n&#x200B;\n\nMy skill set is in high demand in the city I've moved to and my employment experience is of particular value to this company as I have experience dealing with their product and the software necessary to sell it. They snatched me up after a trio of interviews and have been training me and paying me ever since.\n\n&#x200B;\n\nAnyway, I've been working with them for the last two years and have had quite a successful run so far.\n\n&#x200B;\n\n1. I've increased my salary from 40k to 55k.\n2. I've developed my knowledge of the product and software to a point where I am now the most knowledgeable in the company.\n3. I've made a couple of trips back to Europe on the company's dime to visit their facilities.\n4. I've also won two awards with them (however there is drama surrounding one of them that I'm not happy about).\n\n&#x200B;\n\nSounds great right? Well it is ... most of the time, but there are a few things that have been bothering me since I first started ...\n\n&#x200B;\n\n1. I'm the only person in our company that is literate with our software system which means that a lot of the responsibility falls on me to produce content for sale to our city and purchase from Europe ... meaning I can often be overworked and expected to stay longer hours in order to produce the necessary content for time sensitive projects. This can also spill over into my days off when the company needs me.\n2. I'm the only native English speak in our company and while the rest of the staff do speak it, I'm often left out of day to day conversations unless I'm specifically involved from the get go. This also applies to our sub-contractor so it can be very annoying to communicate with them at times.\n3. When there is an issue (which there have been a few, I'm still learning the ins and outs of our industry, I'm the only one using our software and I'm often pulled in 10 different ways each day) its not received well. Sometimes its accepted and addressed and we move on, but often it is dragged out, complained about, criticized and hammered until I'm left feeling like crap. According to the owners, it doesnt really matter what the source of the problem is ... I'm the point of contact between us and Europe and therefore it is up to me to identify and fix any problems before they actually arise.\n4. The company is coming up on its three year anniversary and is experiencing some of the typical start-up pains. To put it bluntly, they are not making enough money. Our owner's spent aggressively (and i would argue prematurely) on a new store front and marketing campaigns and is now passing this pressure onto myself and my supervisor.\n5. Finally, I have to mention this ... one of the 'owners' is a total dick and has the biggest ego I've ever come across. I honestly dont know how other people interact with him. I cannot stand him. He treats EVERYBODY including our CEO like they are less than him. He straight up lies to our clientele about our product and services and then expects somebody else to fix it. He treats other people in our industry like they work for him and are not from another company altogether. The thought of working with him, or worse working under him, for the rest of my career is not appealing to me at all.\n\n&#x200B;\n\nI've recently been contacted by a locally owned company who has a similar system to the one I'm using now only its from a North American supplier. They are interested in hiring me for a unique role that sounds more to my liking than the one I am currently in. I've only spoken to them briefly however they have already piqued my interest and I've already arranged to explore this opportunity further.\n\nAssuming it is what I think it is, I may end up moving to this new opportunity. I'm worried about how this will be received by my current employer and am worried about giving myself a bad reputation by jumping ship (our industry is very small in the city I'm in). My reasons are ...\n\n&#x200B;\n\n1. The company has invested time and money into training me for this specific role and I'd essentially be upping and taking that somewhere else.\n2. I'm leaving the company at a critical point and it could end up being one of the final nails in its coffin.\n3. When I negotiated my pay with them, I mentioned that I was interested in building my career with them and that I could see myself with them for a very long time.\n4. I feel guilty about dropping this on them with two weeks notice as I do not think they would be expecting anything like this.\n\n&#x200B;\n\nI guess I'm looking for advice on my current work situation and the possibility of leaving my current employer. Do I owe them anything other than my two weeks notice?\n\n&#x200B;\n\nFor anybody else who stuck it out with a new start-up, how did it pay off? Were you left in a very strong position once the company established itself or were you left high and dry when it failed? I'd be very curious to hear your experience.\n\n&#x200B;\n\nThank you for taking the time to read this I know its a bit of a wall!",
    "title": "Leaving an up and coming start up ... Am I in the wrong and do I owe them anything?",
    "subreddit": "jobs",
    "timestamp": 1552522067,
    "score": 6,
    "keyword": "european ceo"
  },
  {
    "text": "Should growth and acceptance of market rules be at expense of software quality? Please change my view I’m a full stack software engineer (PHP, JS), with over a dozen years of experience. During those years I always tried to wear many hats — project owner, scrum master, team leader; I was involved in ux design, sales, recruitment, employer branding and what have you. I’m everything short of an expert in those fields, but I do feel comfortable in a generalist role. This is important, as I want to understand the other — non-technical — side of the issue. \n\nI joined my current company on the verge of a large restructuring.  The old tech stack and most of the IT were replaced with modern frameworks and a great new team of open minded people — lead by our  visionary CTO. The position had a lot of opportunities, autonomy and purpose. I was a part of a software craftsmanship-like movement.  And in part that was the reason I decided to switch from a team leader role at a recognized european startup, to a senior PHP developer at a digital agency. \n\nSome two years ago two things happened: I was promoted to a team leader of about 10 devs, and the company rebranded after tightening the coop with our european owner. This meant that I began a slow process of reducing my coding to zero (this actually happened this fall) and we began to take on legacy projects from the group. \n\nNot one of them were developed nearly at the level we would be comfortable with. They mostly had stupid rules we didnt understand, bloated architecture, poor choice of franeworks, little to none automation. But we tool them, for various reasons: it was from the group, it was expected from us; we wanted to show our tech skills to gain trust and more autonomy next time; and it was good hourly rate, so so it paid the bills (we were struggling a bit with our domestic clients, wanting to make a name of ourselves). \n\nSo we stepped of the path of craftsmanship. In our opinion anyways, as we believied using the right tool for the job was our professional duty, and maintaning legacy systems had little to do with it. \n\nAs the months went by, we agreed to leave our software stack (Symfony & React) to adapt Drupal and Angular 7, as per our new big client needs. We also switched a lightweight ecommerce solution — sylius — in favour of magento (because its more recognizable, I guess). And while I agree that Angular is a great tech, Drupal is not so much. We would achieve greater results in less time using our previous stack, while keeping the teams morale up. \n\nCurrently another decision is upon us. We have an opportunity to take over a project from some partners — the project is using .NET with some legacy framework (MVC 2.0, so Im told, I dont know the ins and outs), with good ’ol jQuery on the front side. The client is thinking about a rewrite to Drupal in about 18-24 months (or more). The servers are provided by clients’ global hq, where staging deployment is done via FTP, and to make a production release someone needs to file a support ticket (in contrast, all our projects have continuous delivery, blue/green deployments, in-house devops, containerisation, you get the idea). \n\nBut it pays good money. \n\nSo my question is, is there a limit to what we should accept in the tech stack and code quality? Should business trump the technology? Or should we put an end to this madness?\n\nThe tech stack isn’t the number one thing for me — it needs to serve the business. But I also believe there should be a line one shouldnt cross — an area where the tools stop helping you and start to drag you down, and the quality of your professional service degrades. \n\nSome background: \n\n-\tI just began my 5th year at the company, I feel that there is still room to grow for me here. My opinion is taken into consideration at the highest level, so I have every reason to believe I could turn us around from this path. \n-\tThe CTO is torn between the tech and the business sides, leaning toward the business (as I would too, but currently I dont believe in it, so I’d have problems motivating the troops). \n-\tThe CEO is non-technical.\n-\tThe company is about 50 people, half of it in the IT dept.\n-\tWe are taking on projects estimated at about 750-1000 man-days, so it’s not your local coffee shop blogs. \n-\tIf thats not clear, we don’t have our own product, we work for our clients only.\n\nAnd its not just me whining about more shiny toys — the recruitment is hard as it is, without bringing in some legacy stuff to work on, so I’m seriously concerned about keeping / expanding the team in the long run (4 out of 5 job postings look better than ours in regards to tech stack; we cant afford top of the market salaries). \n\nI would like to see past this, and adapt to the market, but my gut feeling tells me we’ve gone to far and need to backtrack. I dont want to quit or stop caring, so either acceptance or change are my ways forward. I’d gladly share more context if this somewhat long post is lacking. :) What do you think? How can I see this as a good thing, an opportunity to learn and adapt? How can I believe in this path so I can honestly motivate my people to keep up the good work, and convince new hires to join?",
    "title": "Should growth and acceptance of market rules be at expense of software quality? Please change my view",
    "subreddit": "cscareerquestions",
    "timestamp": 1552431827,
    "score": 2,
    "keyword": "european ceo"
  }
]