[
  {
    "text": "I'm getting into a soon-to-be startup. I'm worried about several things and I thought that you might be able to help me in figuring out what I should do. Hello r/jobs, \n\n\n\nBefore getting started, I need to point out two things : I am not a native speaker so I apologize in advance for the typos I'm going to make and if you could highlight them it would be very kind of you. The second thing is that I don't know if my partners are on Reddit so I won't be really precise about what we will be working on.\n\n\n\nThat being said, here we go. I[20/M] am a first year european art student and a couple months ago I met a man at a seminar in a prestigious engineering school. We'll call him Tom. Tom is a PhD student, he is about to finish his paper in a few weeks. His thesis, and his work, are related to a new kind of musical instrument. He has been working on it for three years and a half and is now looking into creating a startup. He is currently looking for money and for partners to work with him.\n\nI'm one of the partners he found. But I'm definitely the least experienced one. The others are another PhD student (in a world class engineering school) who will be working on marketing and help in engineering and the last one is a designer/art gallery director.\nHe has also found money. Some big players believe in the projects and wants to finance it up to 200k€. The final product will be sold between 5k and 10k€.\n\n\n\nI have two concerns. First, I have the impression that Tom is overestimating my skills. My task is going to be a lot of programming (I knew what I was getting into though, I know some stuffs in programming but this is clearly next level for me. On a scale from 1 to 10, I would be a 4 or maybe a 5 in programming skills) to design the UX/visual feedback of the instrument. I don't know if I will be able to meet his demands, since the final product needs to look perfectly clean and professional. \n\nThe other concern is about a totally different thing... *Why me ?* I mean, I get along with him very well, we have the same centers of interest (sound, programming and art) but there is an enormous gap between my experience and his. Tom \"hired\" me before even getting to know me. At the end of the seminar I was practically in the team already. At the beginning, I think it was because we could get a scholarship with the partnership our schools have, but it didn't work out very well and as I said, he has found money elsewhere. Today, the both of us have been working on a brainstorming and it was really great. He genuinely seems to be a good guy but I can't stop wondering why he chose me instead of a more experienced guy. \n\nI saw *Jobs* (the movie) the other day, and maybe I'm overreacting but I feel like this could be about money. Since I'm younger and less experienced, would it be a reason to scam me (the word scam sounds a bit strong but I don't know any other word which could do it) ? If you don't know the story, when he got rich, Steve Jobs didn't give any money to a teenager (and others) who was helping them out at the beginning, because he was \"just a kid\". Yes I know, I'm definitely thinking about this too much.\n\n\n\nTo be honest, I find this project really cool and interesting. It could really become the next big thing in the world of music and I'm proud to be a part of this adventure - it might not feel that way when you're reading me, but I'm still down to earth and I know it could fail/end at any time - . But I don't know if I'll meet everybody's expectations and it bothers quite a bit. Should I be careful about something ? Share my thoughts with Tom ? Any opinion or advice will be appreciated.\n\n\n\nTL;DR : I'm a first year student getting into a startup with people a lot more experienced. Don't know what to think about this.\n\nEDIT : A typo, and several phrasings.",
    "title": "I'm getting into a soon-to-be startup. I'm worried about several things and I thought that you might be able to help me in figuring out what I should do.",
    "subreddit": "jobs",
    "timestamp": 1490716813,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "how do i continue after my first job situation? Hi Guys \n\nHere is a story about first “real” job after having finished my university degree within finance and management. \n\nPlease comment and ask some critical questions to help me reflect on the situation I got into. \n\nAlso I would like to know how to sell myself in the future. \n\nMy entry to the company\n\nIn August 2016 I started to work in a larger European diary company and started in the Scandinavian headquarter in Stockholm that is responsible for the product milk. Julius and Romeo hired me as an intern. Julius is the CEO of the business unit and is a very confident man with a MBA from Harvard. In his unit he had Romeo to lead the project department, this for example entails to take ideas and make them market ready. \n\nA year ago, Romeo received the assignment to make one idea market ready and he hired me as an intern so support him in the process. In the beginning of my entry I felt very excited because Romeo enabled me to being an entrepreneur in larger conglomerate. He had an endless backlog of tasks and I received the mandate to solve them solely. By that I mean tasks such as developing a go-2-market strategy, developing product requirements, developing the value proposition and doing pricing. \n\nAlso the supervision was extremely well organized. In the beginning Romeo and I had brief but very frequent talks in order to align. This was very helpful because we both needed to build trust. After a month or two I was so deep in the project that I did not require so much supervision anymore so Romeo trusted me to drive the business development of the product. Through Romeo I received great reputation in the business unit and Julius also started to give me some lightweight tasks that I mastered. \n\nMy internship however was limited to a specific time period. Romeo and I had few good talks about my future, and he hoped that I would continue in the company. \n\nAs such I was not reluctant to stay in the company as I had a great time and enjoyed the both Julius and Romeo as they were excellent boss’s. However I wanted to move to Copenhagen to go back to my friends and girlfriend. \n\nLuckily we had an operational site in Copenhagen, both Julius and Romeo talked with the local director in Copenhagen and they gave me the opportunity to start in Copenhagen.\n\nThe transfer to Copenhagen\n\nIn February 2017 Niklas the local director hired me.  I received the task to continue on the business development of the product that worked on in Stockholm and to work on some corporate development tasks. That meant that I closely with the sales department looked into sales targets and strategic partners. Together with one sales manager we created meetings with top clients and interesting partners for the product. \n\nHaving talked to Romeo, he was very excited. He loved that the Danish operational site created a good outlook for his project. \nFurthermore, I started to work on the corporate development project. I have a finance degree that means I had the theory in place however I looked for some guidance from Niklas to get start this project.  \n\nHowever a few months after I started Niklas started to neglect giving me the guidance and whenever he looked over it I received bad feedback. I checked with other financial analysts in the company and they actually liked my work. Additionally Niklas blocked any further development on the business development of the product even though Romeo and Julius loved the progress. \n\n8 months after I started at the Danish operational site I got fired due to mismatch between me and Niklas. I learned a few days afterwards that Romeo and Niklas hate each other and feels that I have been in the middle of a political battleground.",
    "title": "how do i continue after my first job situation?",
    "subreddit": "careerguidance",
    "timestamp": 1510406644,
    "score": 7,
    "keyword": "european director"
  },
  {
    "text": "Career Advancement Advice: leaving current employer after 2 years? Hello Everyone,\n\nI’m looking for a bit of input, perhaps those with a few more years professional experience can draw from their time in the work force and offer a bit of insight. First some background: ~6 years ago I’d broken into my industry as a sales associate. Having experienced a fair amount of success, advanced in ~3 years time to the manager level at a second employer, where I have been for the last 2+ years.\n\nFast forward to today; I’ve received an offer to join a multinational generic pharmaceutical manufacturer at the Associate Director level, with a fairly substantial bump in pay. \n\nI’m weighing the pros and cons of leaving my current employer, a European based manufacturer, a brilliant group of scientists/engineers/support staff, and joining a new company. In terms of career progression and future earnings potential, I believe this is the right move. Looking ahead, it is likely that I return to school for an MBA, and believe the progression will show well in the application process as well.\n\nI certainly know what I’d like to hear from the group … but I’m open to hearing other opinions, especially any which are dissenting. Implications of moving from one company to another in a relatively short period of time? Am I right to assume this is a symptom of today's job market? Is the clear jump in pay, responsibility and title justification enough? I wonder how far loyalty would take me in my current role.\n\nThanks!\n\n**Personal Info**\n\n* Age: 28 years old\n* Male\n* Single, no dependents \n\n**Employer A (current)**\n\n* Pharmaceutical Drug Substance and Fine Chemical manufacturer headquartered in Europe.\n* Account Manager with responsibilities in North America\n* Base Salary: $85,000/yr\n* Bonus Potential: 15-20%\n* Additional: $5k/yr car allowance, preventative maintenance and insurance paid\n* Work from home office when not on the road. Travel required to Portugal 2x per year, totaling ~4 weeks in Europe, in addition to regional business travel\n* Ceiling in terms of advancement\n\n**Employer B**\n\n* Pharmaceutical Drug Substance, Drug Product and Fine Chemical manufacturer headquartered in India\n* Associate Director, API Sales, with responsibilities in North America\n* Base Salary: $110,000/yr\n* Bonus Potential: 15%\n* Additional: $9k/yr car allowance\n* 100 mile round trip commute\n* Ranked among top three Indian drug manufacturers, with a number of verticals for future advancement \n* Will be responsible for new product selection and higher level of oversight in day-to-day sales operations",
    "title": "Career Advancement Advice: leaving current employer after 2 years?",
    "subreddit": "careerguidance",
    "timestamp": 1487775879,
    "score": 1,
    "keyword": "european director"
  },
  {
    "text": "Conflict of things Hello,\n\nI work at a European Big4 for 2,5 years now fresh out of college. I have worked on several engagements and love the profession. In my current project however, I am facing the following:\n\nOur client has bought our Big4's in-house developed software for a particular purpose. I have worked with similar software in the past from multiple other vendors which are vastly superior. I work directly with a client director with whom we have an excellent working relationship. I find myself in a dilemma: on one hand, as an advisor to my client, i should advise against our own software; on the other, i should be promoting the interests of my firm or at least not harming them?\n\nI feel the right thing to do would be to advise against.\n\nP.S.: In reality, I will not say anything. THis is a hypothetical thought experiment. Thank you.",
    "title": "Conflict of things",
    "subreddit": "consulting",
    "timestamp": 1491045412,
    "score": 19,
    "keyword": "european director"
  },
  {
    "text": "Til that in 2013 archeologists uncovered evidence of an ancient matriarchy in Peru; it was a \"brutal and ritualistic\" society that collapsed into civil war Jordan Peterson has suggested we may be entering a new era of female totalitarianism, which he describes as unique in history.   Apparently there was at least one other example:\n\n[The Mochica](https://www.yahoo.com/news/blogs/geekquinox/unearthed-peruvian-tomb-confirms-women-ruled-over-brutal-160013738.html?ref=gs)\n\n>This find makes it clear that women didn't just run rituals in this area but governed here and were queens of Mochica society,\" said project director Luis Jaime Castillo, according to the Associated Free Press.\n\n>\"It is the eighth priestess to be discovered,\" he added. \"Our excavations have only turned up tombs with women, never men.\"\n\nMen were apparently forced into ritual combat where the losing side was sacrificed.  \n\nThere was a fad in the 70s and 80's started by figures like Riane Einsler (\"The Chalice and the Blade\") suggesting that if women ran society we would live in peaceful utopias.   The ideology is discussed in [\"Sanctifying Misandry\"](http://www.mqup.ca/sanctifying-misandry-products-9780773538733.php) by Paul Nathanson and Katherine Young:\n\n\"To set the stage, the authors discuss two massively popular books - Dan Brown's The Da Vinci Code and Riane Eisler's The Chalice and the Blade - both of which rely on a feminist conspiracy theory of history. They then show how some goddess feminists and their academic supporters have turned what Christians know as the Fall of Man into the fall of men. In the beginning, according to three \"documentary\" films, our ancestors lived in an egalitarian paradise under the aegis of a benevolent great goddess. But men either rebelled or invaded, replacing the goddess with gods and establishing patriarchies that have oppressed women ever since. In the end, however, women will restore the goddess and therefore paradise as well. The book concludes with several case studies of modern goddess religion and its effects on mainstream religion.\"\n\nVariations of this theme can still be seen today in gender studies departments.  In Sweden they are even pushing for a \"feminist foreign policy\" that would stress diplomacy over war.   Apparently these ladies are unaware of the fact that [Queens initiated more wars than Kings](http://nymag.com/scienceofus/2016/01/european-queens-waged-more-wars-than-kings.html).  Or that men evolved [better making up skills](http://www.bbc.com/news/science-environment-36969103).  \n\nAnother feminist myth bites the dust.",
    "title": "Til that in 2013 archeologists uncovered evidence of an ancient matriarchy in Peru; it was a \"brutal and ritualistic\" society that collapsed into civil war",
    "subreddit": "MensRights",
    "timestamp": 1490132683,
    "score": 44,
    "keyword": "european director"
  }
]