[
  {
    "text": "[Rant] I saw disaster from a mile away and no one cared until now. I'm a first year 7th grade teacher, I teach a state history for my state. I love history, it was my major, and I wanted to be a teacher. I grew up with a teacher mother, surrounded myself with positive teacher role models, I knew this is what I should be doing. As a whole I like it a lot, I struggled some, especially in October, but I found a sort of balance and peace, have two amazing friends that are also new teacher who support me. \n\nPlus, I was pretty sure my administration team was a dream team. Except for a couple people, everyone is supportive, positive, cheerful, the principal is a rock star with so much to give and learn from. The APs are kind, effective, and there for you. I really feel like I got a sweet gig.\n\nMy team though, god my team. My team is made up of me, first year, one 2nd year teacher, one 3rd year teacher who spends all day wishing to be in a high school, and one veteran teacher who has 10 years experience but only 3 in our content. The reason she is in our content is because she was forced out of math to history because the district told the old principle at my school (never met her, was hired by the current one) to get her out of math.\n\nWe were basically non-functioning for half a year. I was struggling to teach myself a million things, because no one on my team was helping really - except the coworker who is on his second year but he is honestly still learning too. I was creating lessons the day of because our planning was miserable and not effective. We would meet four times a week and barely be two days ahead. \n\nIt was miserable, and our content specialist, who should be with us for one planning a week and guiding us was no where to be found. Her attention was stretched between 8th grade which is a state testing year, because the team was ALL brand new to the school and two were new teachers, and 6th grade competed with us for her attention because we both had the same planning period. Then if none of that was in the way administration had her in meetings, or she was out for district stuff.\n\nI spent ALL of my first semester begging for more support for my team. Begging for our content leader to be in plannings, going to the principal and telling him issues with the most \"veteran\" member of our team. (A whole rant on its own, but basically has only the obsession to get back into math, in another district, makes casual racists comments in a Title One highly hispanic school on the regular, and is very abrasive and pig headed and refuses to listen). \n\nI begged someone to come observe me for some feedback, I begged for support with my 'bubble' kids who were on the edge of passing. I think I spent more time after school trying to get advice, trying to get someone to come help our barely floating teams planning, TRYING to get something fixed. Planning only got better only because I took over keeping track of who said what and what were planing to do in a google doc and not letting our 'veteran' teacher control the planning by moving it to my room and pulling up a week and making us pound it out and look for resources. We just now have successful plannings half way through the year and I was the one who had to do it (with help of my two co workers to guide me).\n\nWell today we found out we had the lowest scores in the district on our district monitoring tests we have to give twice a semester. Suddenly we are now being observed once a week, have multiple meetings a month, must have someone in planning with us at all times, must stay after school once a week for 'lesson plan flow training', must have special bubble kid tutoring on another day of the week. Must use specially designed warm ups based off of the tests questions they see that we had access too ALL YEAR apparently along with the packets for the kids but NO ONE EVER TOLD ME ABOUT!! I would have been doing those in a heart beat to save myself time creating warm ups!\n\nI am mad, I am mad, and frustrated. Mad that my kids did so poorly and wondering how I failed them, wondering why this happened. I am mad that my team is barely functioning, and that I had to get us on track when I begged for help. Mad that I have been knocking on peoples doors for months asking for feedback, asking to talk to someone, asking for support with exit tickets and warm ups and my content leader never being around. Mad that our content is poorly supported with little resources and little to guide us so we are digging around on our own with ancient artifacts from the 80s and 90s and the internet as our only resources. \n\nI will take this as a lesson, I will soak up every minute of those extra meetings and extra plannings. I will needle every person who walks into the room so that I will never be put in the situation of begging for help but being ignored until the numbers come back and suddenly it matters again.\n\nI find myself disillusioned with the admin team I was proud of. I still think they are solid, but they did not listen to me when I pointed out the boiling pot until it boiled over and that frustrates me. I am so very aware now of how little people think of my content, because there is no state test.",
    "title": "[Rant] I saw disaster from a mile away and no one cared until now.",
    "subreddit": "Teachers",
    "timestamp": 1484267936,
    "score": 75,
    "keyword": "hispanic principal"
  },
  {
    "text": "Not sure how frustrated to be. Is it my inexperience or my strange/terrible situation. As always, long rant warning.\n\n\nAfter two years of teaching elementary as a leave replacement I finally got a tenure track job. It was teaching 7th grade social studies in an urban district. I had only taught suburban before but I knew my skills as a teacher and felt while it would be challenging it was ultimately something I could handle. \n\n\nWhich I am, although barely. There were a lot of things that were kept from me when I was interviewing that have made things more difficult for me as a teacher. And I know despite teaching before, the new age group/subject/population type basically makes me a new teacher so yes, I'm going to struggle. And I feel ridiculous saying I have a good excuse for struggling but I feel like my current situation isn't helping and maybe I have an excuse.\n\n\nI will be moving into a new building that will be beautiful and have all the space, supplies and technology I would ever need. Until then I am sharing a room with another 7th grade teacher who has taught there for years. The room is not small but split in half each \"technical\" room is small. We put up a bunch of file cabinets to create some division but at the end of the day the two classes hear each other all day. Which means no matter what, what I do is being observed by the other teacher and the other class. It's like being in an observation all day, every day and it unnerves me so much. It's one thing to struggle but another thing to struggle and have a constant audience of it.  We were first supposed to move in October, then it was January and I have a feel they are going to push the move-in date later again.\n\n\n-This grade level is the toughest and meanest they had in years and includes a student who was pulled out last year to go in a alternate program for severe behavior issues. They closed to program this year and he was put back into regular ed. He was fine for the first month but then it got bad. He's been cursing, rapping in class, walking around the room, trying to start pretend fights and not listening to any directions.  I'm following procedure on how to handle him (writing up, detention, parent meetings, behavior charts) and have been praised on how I am handling it all and have been told at the end of the day he's choosing not to listen and there is not much else I can do. But when I am dealing with him or any other student not listening, the other class hears and they do hold it against me. One of my difficult students has told me because my 10th period is so bad why should I be so hard on their class for being bad and loud as well. \"You don't do anything with them if they don't listen\". Which believe me I do, but he doesn't see that and it affects how the students see and react to me. I'm also never alone as they other teachers have specials in their classes during prep so they are with my for almost the entire prep/lunch period.\n\n\nWe cannot make drastic changes of the room since we are supposed to move. I didn't have a white board for four weeks. I had a find an old one that was about 4x2 feet and teach with that. I don't have a smart board or projector either. They did have extras but they were given to other teachers in my grade level since they are tested subjects. We are are a 1:1 school but didn't get the actual chromebooks for about four weeks as well. It does help but since I can't display anything I have to upload everything to googleclassroom (which I do love and has helped so much) but I have to rely on the students to not play games or surf the internet. And youtube is blocked so resources I would have normally used cannot be used anymore until we move.\n\n\n-Then three months in they switched what side of the room I taught on. They gave me two days notice. In theory, I'm fine with switching because the other teacher teaches science and needs room to do labs. But this side was half the size of my first side. I can fit five tables, my desk and the chrome book cart but there is so little space otherwise. All of the students are on top of each other and no matter how I change seats they are always close and it's like wherever I place them doesn't matter. I feel like no matter how much I have tried to reinforce procedure despite the switch the switch has affected the students and they have gotten worse.\n\n\n-Teaching procedures in general. I know the importance of it and had all these ideas of what I wanted to do to start the year but with the constant changes in my classroom situation made it impossible to have structure and consistency. I kept having to change to basic procedures of the class as the changes kept happening. \n\n\n-And as an untested subject I don't have any help. The ELA/Math teachers have special education teachers and bilingual teachers push-in as the school is over 90% hispanic and we all have two classes with bilingual students (half of those with speak and understand little to no english) and the bilingual students who speak the best get pulled out of my class halfway through for ESL One of those classes is also considered billingual/sped. . So it's the usual the usual IEP's and 504's as well as students from the self-contained class who are mainstreamed for SS/Science for the social aspect. In theory, I totally get it and normally would just make it work but after all this it all just adds to my frustration.\n\n\nI'm a hard worker and understand that sometimes you have to roll with changes but I can't handle all of these changes anymore. It's constant and I feel like I can't find my footing. It's tough being a new teacher already but adding all these other things has been me an anxious overworked mess who for the first time dreads going to work. I have cried more in this job in front of coworkers/admit than in the past 5 years. The teacher that I share with is now annoyed when I lose control of classes and with her own tough past (long story) has very little sympathy whenever I struggle or have gotten upset.I feel for her because I can't imagine how tough it is to teach with noise like that and have apologized but I was told sorry wasn't good enough anymore. I've been told by her, other teachers and my mentor to just deal with it, not to be upset/cry and by this point I should be making it work. Which I basically am. Almost all of my students are passing (except the lazy ones who are failing everything) and was told by my principal and mentor that if I was doing as bad as I feel I am I would have been called in, replaced or moved. But I still feel so awful and after all these mixed messages I don't know what to feel.\n\n\nAm I making excuses? Whining too much? Or do I have a reason to be frustrated/struggling as much as I feel I am? HELP ME FIGURE THIS OUT.",
    "title": "Not sure how frustrated to be. Is it my inexperience or my strange/terrible situation.",
    "subreddit": "Teachers",
    "timestamp": 1512236091,
    "score": 4,
    "keyword": "hispanic principal"
  },
  {
    "text": "Surprise After Signing Contract I spent yesterday in my new school district (about 40 minutes away from home) after signing my new contract for next school year in the district office then going to my school to observe. I'll be teaching high school history. My new school is title 1 in a rural area. One of the principal's focuses for next year is global experience / diversity, which is why he hired me (I am first year technically but taught abroad). \n\nI was there just for the day, but ate lunch in the staff room (rookie mistake, I know). At lunch, one of the other teachers brought up a student who is Russian and an English language learner--one of the first non-Hispanic ELLs in the school, ever, I presume. The teachers basically talked about how they didn't know how to differentiate for her--OK, not everyone has that training. Then, they proceeded to make fun of her accent and speculating whether her mother was a mail-order bride.\n\nI might be too much of a snowflake, but I'm horrified that I'll be calling these teachers my \"colleagues\" next year. I still haven't cancelled my other interview offers, and would seriously consider a break of contract before the year begins to join another district at this point. Am I overreacting? What are my options?\n\nTLDR... new teacher, visiting school. Other teachers made fun of student and her mother in front of me at lunch.",
    "title": "Surprise After Signing Contract",
    "subreddit": "Teachers",
    "timestamp": 1496318449,
    "score": 5,
    "keyword": "hispanic principal"
  }
]