[
  {
    "text": "Confusing First Day My first day on a new job. Went well up until I had to leave. Before we go there, let me tell you briefly what all happened.\n\n I accidentally got higher than I wanted but I had to wait until I got a trainer so my high eventually died down by time I was training. It was really confusing at first but I managed to get in a great groove. About 3 hours in the power went down so we had to stop taking orders, we just cleaned while we wait which wasn't too long. I had about 20-35 minutes before I could leave. So I'm going through and doing as I was assigned to do. I was caught up on my end but I just had to wait and try not to look dumb or whatever. By time I got about 4 orders left a Hispanic lady pulls up with what seems like her daughter and someone else was in the back who I couldn't see. I ask for someone to make me something and I give her everything but food because someone messed up that side so I had check with manager to make sure. \n\nNow here comes the thrill. While I was waiting the lady was complaining about the drink, so I double checked the order and told her it's right. Then she says it's not right and that she needs more of something, so I tell her no it's right. And she starts complaining in Spanish, to the point I think she either gonna jump through the window and grab me out. (if anyone seen the girl from McDonald's and that happened)  I just stayed away and ignored her finishing the other orders drinks. Then finally my manager and others notice so my manager tells her it's right and I give her the food. Then I finish my last few orders and leave. \n\nWell I actually decided yell out and tell her to go f herself because she called me a stupid bitch, actually think it was stupid white bitch aka she was racist. I had no one talk to me about it so, I'm right to do so? I don't like to let anyone talk me down to begin with and that time my high already was coming down yet I managed my anger issues. I was honestly waiting for her to run me over as I went to my vehicle. But what can you do when you have these customers? I've worked retails and in 2 food businesses now. First job was in the food business, I never had any issue like this. My first experience with a customer like this and what she did wasn't right. Maybe wasn't right for me either but still.",
    "title": "Confusing First Day",
    "subreddit": "jobs",
    "timestamp": 1626138113,
    "score": 0,
    "keyword": "hispanic manager"
  },
  {
    "text": "No sir, just because I'm friendly and jokey at work does NOT mean you can ask for my number So, I work at a grocery store as a cashier. I'm a very friendly type of person, and I will joke with my customers a lot. I honestly adore a lot of my regulars, and they in turn look forward to seeing me. Even though the pay is kind of garbage, I love working at the store. Now, we have a decent Hispanic population in the area, so I've been trying to learn at least a little Spanish.  \n\nToday I was watching over the self checkouts and doing 'coverage' for alcohol sales (USian here, alcohol can only be rung by someone over 21, at least in my area). An older Hispanic man wanted alcohol, so I rang the his purchase for one of our younger cashiers. We joke about my terrible Spanish, and he offers to help me learn. I laugh and say \"Okay!\", because one of my regulars does help me practice Spanish, so it's not weird.\n\nHowever, the same man came through the self checkouts later in the night, with a younger woman and a young child - I assume they were family of some relation. Anyway, the woman is having trouble with scanning an item, and so I help out. The man then asks me why I'm masked (there's no mandate in my area); I tell him it's to protect my parents. That's when he says, \"I want to get to know you; may I have your number?\" Keep in mind, this dude is probably twice my age, and probably thinks I'm younger than I actually am.\n\nI went cold. I managed out something about it being inappropriate, and quickly excused myself and went to my manager. Turns out this same dude once came to the store so drunk he could barely walked, and harrassed another female employee when she refused to get him alcohol. (Legally, we cannot sell alcohol to someone who is intoxicated) He ended up having the cops escort him out of the building.\n\nSo yeah, that fucking happened. Luckily, everyone at my work has my back, and if this creep tries anything he will be shown the door. Still, it turned a pleasant shift into a horrible one.",
    "title": "No sir, just because I'm friendly and jokey at work does NOT mean you can ask for my number",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1627005071,
    "score": 1,
    "keyword": "hispanic manager"
  },
  {
    "text": "The USA's Status Quo Has Got To Go (And How You Can Bring Change) This is a message written to every physician, nurse, aide, tech, and (most importantly), patient.\n\n**TL;DR:** While practicing medicine in the US may equip you with some of the most advanced technologies and treatments available, there are a number of barriers that render these advances inaccessible to many of our patients.  I'm going to try to outline some of these areas of weakness, and close by summarizing steps we can take to fix our system *for our patients.* Change is going to take all of us.\n\n# High Cost But Poor Value: The US Healthcare System Today\n\nOur patients experience insufficient access to care.\n\n[The US spends a much higher percentage of its gross domestic product (GDP) on health care than other wealthy countries](https://www.census.gov/library/publications/2020/demo/p60-271.html).  However, the US performs poorly on many quality measures compared to other countries, including avoidable hospitalizations and deaths.  Why practice medicine, if we can't *get access* to help our patients?\n\n On a per capita basis, the U.S. spends more than double the $3,453 average of all OECD countries.\n\n[https:\\/\\/www.dpeaflcio.org\\/factsheets\\/the-us-health-care-system-an-international-perspective](https://preview.redd.it/wi3ii0hlvle71.png?width=750&format=png&auto=webp&s=28b7b0793319f64994e52338060e34834c3157e9)\n\n[**Health care access, quality, cost, and outcomes vary** between different regions and states within the US.](https://www.medicare.gov/)  For example, [12 states did not expand their Medicaid coverage under the Affordable Care Act of 2010](https://www.medicaid.gov/), creating a coverage gap for people in these states who do not qualify for either Medicaid or subsidies with the purchase of private health insurance. Further, [prices for an identical health care service can vary dramatically by region](https://www.amazon.com/Understanding-Healthcare-Financial-Management-Seventh/dp/1567937063). (Read about this USA Today article on the same care in [different states](https://www.usatoday.com/story/news/nation/2013/12/01/health-exchange-prices/3797039/), as an example). There is [no universal health care coverage](https://www.commonwealthfund.org/international-health-policy-center/system-features/how-does-universal-health-coverage-work), and a [significant number of individuals do not have health insurance](https://aspe.hhs.gov/sites/default/files/private/pdf/265041/trends-in-the-us-uninsured.pdf). This disparity causes [earlier onset of illness, more severe disease, poorer quality of care, and a significantly reduced lifespan in those affected by poor social determinants of health.](https://www.ncbi.nlm.nih.gov/books/NBK425844/)\n\n# [Overall quality of care, by state, 2014-2015](https://www.ahrq.gov/research/findings/nhqrdr/nhqdr16/overview.html)\n\n[ Some states in the Midwest \\(Iowa, Minnesota, Nebraska, North Dakota, and Wisconsin\\) and some in the Northeast \\(Delaware, Maine, Massachusetts, New Hampshire, New Jersey, Pennsylvania, and Rhode Island\\) had the highest overall quality scores. Scores were based on the number of measures that were better, same, or worse than the national average for each measure. Many Southern and Southwestern states \\(Arkansas, Kentucky, Louisiana, Mississippi, New Mexico, Oklahoma, Texas, and West Virginia\\), several Western states \\(Nevada, Oregon, and Wyoming\\), and one Midwestern state \\(Indiana\\) had the lowest overall quality scores.](https://preview.redd.it/cebbev6esle71.png?width=699&format=png&auto=webp&s=6fc8ec5045f8f8874cf462a1083d189f5cc8ce32)\n\n# [Average differences in quality of care for Blacks, Hispanics, and Asians compared with Whites, by state, 2014-2015](https://www.ahrq.gov/research/findings/nhqrdr/nhqdr16/overview.html)\n\n[ Some Western and Midwestern states \\(Idaho, Kansas, North Dakota, South Dakota, Utah, and Wyoming and several Southern states \\(Kentucky, Tennessee, and Virginia\\) had the fewest racial and ethnic disparities overall. Several Northeastern states \\(Massachusetts, New York, and Pennsylvania\\), some Midwestern states \\(Illinois, Indiana, Iowa, Minnesota, Ohio, and Wisconsin\\), one Southern state \\(North Carolina\\), one Southwestern state \\(Texas\\), and one Western state \\(Arizona\\) had the most racial and ethnic disparities overall.](https://preview.redd.it/giujjwfssle71.png?width=700&format=png&auto=webp&s=a6e0b7d0d79caec7788ef9565f9a2681ec2cf139)\n\nAccording to the [US Census Bureau reports](https://www.census.gov/content/dam/Census/library/publications/2020/demo/p60-271.pdf) published in September 2020, 8% (26.1 million) of Americans did not have health insurance during 2019. 92% of Americans had health insurance coverage during 2019 (68% via private insurance, and 34.1% via public insurance). Now, [around 30 million people in the US remain uninsured](https://www.healthcare.gov/glossary/). Many more are underinsured, with [half of US adults reporting having delayed or skipped medical care due to costs.](https://www.healthcare.gov/glossary/)  Why? Well, for example... The average cost of an inpatient admission was [$25,000 in 2018](http://www.ncsl.org/research/health/global-payments-to-health-providers.aspx). Common and essential drugs, such as insulin and epinephrine autoinjectors, can cost hundreds of dollars each. [Drug prices in the U.S. are twice as high as in other countries](https://www.healthline.com/health-news/prescription-drug-prices-in-the-u-s-are-twice-as-high-heres-why). Experts say brand-name drugs are the main driver of higher prices, and note that actual out-of-pocket costs is difficult to gauge. (This is beyond the scope of today's post).\n\n[ In 2015, the U.S. spent $325 billion on retail prescription drugs, equivalent to 1.8&#37; of GDP, or 10&#37; of total national health expenditures. Spending has grown considerably since the 1980s ](https://preview.redd.it/6hvld691tle71.png?width=768&format=png&auto=webp&s=b0da12f78ca2b33d95765e3d8da63099514c09e9)\n\n[The U.S. spends substantially more per capita than other countries. According to the OECD, the U.S. spent $1,112 on retail pharmaceuticals per person in 2014, while the next highest spender was Canada, at $772, followed by Germany at $741 and France at $659. ](https://preview.redd.it/hbb2lhh2tle71.png?width=768&format=png&auto=webp&s=fba1ef0ad5d392620caa5749cd09dcb2adcee6c0)\n\n[Source](https://www.bruegel.org/2017/08/the-issue-of-u-s-prescription-drug-prices/) \n\nPolicymakers aren't going to require changes without pressure from a coordinated movement.  You can use the [social determinants of health](https://www.cdc.gov/socialdeterminants/index.htm) as an example of how our system is failing. These political, cultural, and socioeconomic conditions into which individuals are born and with which they live impact health.  We have found that one's education, the environment, nutrition, wealth distribution, gender, race, and/or access to health care [are not very well addressed in the current system](https://www.healthleadersmedia.com/welcome-ad?toURL=/clinical-care/5-ways-healthcare-organizations-can-address-social-determinants-health). Do you know anyone affected by any of these?\n\n# The US population has a higher chronic disease burden than other 1st world countries, yet spends more money than other countries\n\n[https:\\/\\/mpkb.org\\/home\\/pathogenesis\\/epidemiology](https://preview.redd.it/dvmyxaixule71.png?width=800&format=png&auto=webp&s=1d943fec8695a704a17c6c7bb728e165320cecb0)\n\nHow embarrassing! US politicians, health care administrators, and investors are failing us. Most would argue that a just and equitable health care system benefits a society as a whole.  You can measure that by looking at chronic disease burden. How are we doing? \n\n[28% of US adults report](https://www.census.gov/library/publications/2020/demo/p60-271.html) having been diagnosed with two or more chronic diseases (e.g., hypertension, diabetes) in their life, compared to an average of 18% of adults in other wealthy countries.  [This is a huge red flag about a failing system, but the causes are beyond the scope of today's post (you can read more about them here).](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5876976/)\n\n[https:\\/\\/mpkb.org\\/home\\/pathogenesis\\/epidemiology](https://preview.redd.it/txbpns0evle71.png?width=400&format=png&auto=webp&s=bfa73dd0f49a3f8b08051eac456ad91c5ac19920)\n\nA just and equitable system ensures certain standards of public health that, in turn, [reduce the burden of disease on the entire population.](https://health.usnews.com/health-care/for-better/articles/the-case-for-universal-health-care) (This is [how universal health care pays for itself](https://www.healthcare-now.org/blog/how-single-payer-health-care-pays-for-itself/)). Accordingly, a health care system should strive to provide access and treatment to all population groups regardless of identity and socioeconomic status, while ensuring that underprivileged groups are not ignored.\n\nRecognizing and addressing inequalities due to social health determinants can improve the health of the most vulnerable and at-risk groups. For example, [social justice](https://www.apha.org/what-is-public-health/generation-public-health/our-work/social-justice) in health care is the delivery of high-quality and fair treatment, regardless of an individual's age, race, ethnicity, economic status, disability, or sexual orientation.\n\n# What can be done about all of this?\n\nThe most important step is to learn how our system (and specifically it's failings) are influencing the health of our patients.  We must acknowledge and address our role in changing it.  We need to look at how other countries allocate resources in ways that benefit more people (e.g., set up a budget inclusive of underserved populations). We need to provide training to ensure health care providers are culturally competent and advocate for patient rights.  We also need to create diverse care delivery models.\n\n# It starts with each of us.\n\n**You can** help fix the illogical things the USA is doing in medicine, medical education, and healthcare policy without sacrificing as much as you think. Where to start? Talk to each other. Share your goals, struggles, and challenges. Join together. Drop the poisonous attitudes, the fights, and the competition. Smell the roses. It just takes some common sense, optimism, communication, and compromise. It takes all of us working for our patients.\n\n**Today, I'm hoping to encourage all of you to** seek progress. We need to acknowledge this responsibility before things worsen. Perhaps you're discouraged, isolated, and overworked. You're not alone. We are waiting for others to fix medicine, but it's got to be us.  The status quo has got to go. How will you stand up to it?\n\n[Healthcare workers \\(and our patients\\) need to get more active in politics. ](https://preview.redd.it/c71gv3x4sle71.png?width=506&format=png&auto=webp&s=4f3e7ca0da93541a075af89a3210db36b8ccd43e)",
    "title": "The USA's Status Quo Has Got To Go (And How You Can Bring Change)",
    "subreddit": "medicine",
    "timestamp": 1627762376,
    "score": 136,
    "keyword": "hispanic manager"
  },
  {
    "text": "Tasmanian Devil delivers a breech baby vaginally, and I lived to tell about it. I have to tell you guys this story, cause I can’t even believe it myself.  It's long as fuck.  Cheers.\n\n\n\nFor you in the OB world: tonight my meth-addled patient involuntarily pushed out a frank breech baby under conscious sedation. If none of that makes sense to you, keep reading, dear Redditor: it will.\n\nIn my 16 years as an L&D nurse, this night takes the cake.\n\n\n\nSo, coming on at 7pm it’s a little busy, but we don’t exactly need roller-skates yet…. I get report from Nurse 6th-Shift that there’s a patient coming up from ED. She presented to the ED with abdominal pain two days ago. They took one look at her mental health history (schizophrenia) and apparently decided that everything that came out of her mouth would be lies. She told them she was 37 weeks pregnant. So they did a chest x-ray, and an ultrasound that showed she was 33 weeks pregnant and then discharges her schizophrenic ass to the street.\n\n2 days later, she shows up back in the ED, and in the interim, she’s managed to find enough methamphetamine to blast her into florid mania. My report from 6th-Shift was “well, in the same 3 minutes she told me she is the Queen of Hawaii, an attorney, and that her parents owned the hospital.” Also, that her baby is alive, and that her mania turns into belligerent violence about every 5-7 minutes.\n\n“I told the ED doc that I can’t tell whether she’s in preterm labor or not because she tried to punch me.  I told them she should probably come up to L&amp;amp;amp;D so we can figure it out.” After 2.5 hours of this patient raising holy hell in the ED, they joyfully but slowly bring her up to us.  Excellent call, Nurse 6th-Shift.\n\nSpoiler alert: the patient delivered 2 hours later.\n\nTo my endless delight, the one thing that the ED doc did correctly in this situation was to order 2 mg PO Ativan, and 5mg IM Haldol. Bless his heart, he couldn’t figure out to send her up to L&amp;amp;amp;D for evaluation of her abdominal pain, but he sure as fuck could snow her for us.\n\nGood man.\n\nShe arrives curled up and filthy on a stretcher.  She is somnolent, but cooperative enough that we’re able to herd her onto the labor bed.  Just after the exasperated ED nurse leaves, the patient suddenly becomes very animated. “I gotta PISS!!!!” Writhing in the bed, clutching her belly: she is the very picture of labor. I put a hand on her rock-hard abdomen and my stomach drops to my knees.  At this point, all I know is: she had an ultrasound 2 days ago that put her at 33 weeks. In the 2 minutes since I met her, I am certain: she is going to deliver a preterm baby very soon.   Our one-bed well-baby nursery is woefully unprepared to care for a 33 weeker.\n\n60 seconds later, her contraction ends and she is snoring again (bless that man).  I swallow my moral outrage at checking an unconscious woman’s cervix, and find her to be 4cm dilated.\n\nAnd, fucking breech.\n\n(For those of you outside the OB world: Breech babies are NOT born vaginally. The risk of head entrapment is terrifying: the head is the biggest part of a baby’s body. This can quickly turn into dead baby hanging out of a vagina and that’s not a good look on anyone. So, any baby who is breech is universally born by c-section.)\n\nWhere were we?  Oh yeah: 33 weeks, breech, and psychotic with contractions.\n\nAs I jump up off the bed to start sounding the alarms, I see I now have a handful of meconium.\n\nNot meconium-stained fluid… Frank meconium. From a frank breech baby who is now pooping into its mother’s vagina.\n\nNow the score is up to: meth-induced preterm labor, breech, and meconium. This is the worst hat trick in the OB world. Fuck my life.\n\nSo, we start making plans to ship her out.  We gotta transport this train wreck to a facility that can care for a preterm baby.\n\nI call the community on-call Dr. LaLa to report our hat trick, and after her telling me 8 different ways that we just need to c-section her and ship the baby, I say “well, why don’t you (STOP FUCKING TALKING AND) head in here, and we’ll have some more information when you get here.\n\nIn the background, volume 10: “I GOTTA PISS!!!!” I run back into the room to keep the patient from tearing her IV out as she barrels for the bathroom like a bull with its balls in a pinch. I also discover that she is dribbling copious amounts of undiluted meconium down her legs, has wiped it on the siderail, and has generally made a baby-poo finger painting out of everyone and everything in the room. Pretty sure I have some in my hair.\n\nBy the time Dr. LaLa waltzes in, it is clear to everyone on the unit that not only is this lady not going to stay pregnant long enough to make it to the helicopter, she isn’t going to stay pregnant long enough to make it into surgery. Also, she is almost completely unresponsive in between contractions and definitely cannot consent to surgery. Once Dr. LaLa catches up to speed on the very real mess that we’re all in, she says “Call Dr. Crusty, whatever happens - he can help.”\n\nOh great.   Good old Dr. Crusty. (we’ll get to how he earned that name later.)\n\nDr. Crusty has two states of being:\n\n1. Look up the word “doddering” in the dictionary. His grinning face is the damn centerfold. It would be cute, if he wasn’t a surgeon. He dodders at everything. Walking, dictation, perineal repair, sharp dissection… I’ve seen him lacerate two babies’ faces in c-sections and yet still he is somehow in practice.  The OR techs give him the biggest needles they can find because he can't see the smaller ones.  He has a legit parkinsonian shuffle.  I could go on for days...\n2. His other mode is: \"8 SEMI-CONFLICTING ORDERS AT ONCE! JESUS CHRIST YOU INCOMPETENT NITWITS MOVE FASTER!\" His trauma response is to become consummate prick with snide, passive-aggressive remarks about our nursing skills that everyone just lets slide because he’s delivered most of this rural area’s babies for the last 40 years.  He reminds us, constantly, how much experience he has, and how good he is at doctoring.  That said, he is actually amazing at some stuff, and will accept chickens and lawnmowing in payment for his services, so I am conflicted about talking shit about him.\n\nBack to the scene:\n\nWe rush back to the operating room, and I scoop her onto the OR table between her wild contractions. Every 4 minutes, she becomes the Tasmanian Devil: writhing, howling, and grunting. I half-sprawl my body across hers to keep this tornado of a person from whirling right off onto the floor. Once one particular 60-second storm subsides - my dearest and actual most favorite anesthesiologist Dr. Diamond Rainbow pushes her mystical white light elixir of the gods into Taz’s IV.\n\nWe all felt a warm balm wash over us as the propofol solved quite a few of our problems.\n\nWith the Whirling Dervish asleep, we could turn our attention to more pressing things, like the half a baby butt peeking through this lady’s labia. (It was a girl, BTW. It was labia in labia. Labiaception for a minute.)\n\nI love Dr. Diamond Rainbow with every fiber of my little nurse heart. She somehow waved her magic wand and settled this patient into a sweet peaceful place: somewhere between methamphetamine, Ativan, Haldol, Propofol, Versed, and Fentanyl…a delightful rainbow of medications…  Taz was able to sleep soundly, but keep her reflexes intact.\n\nMaintaining just enough anesthesia for our Tasmanian Queen of Hawaii to protect her airway... meant she also retained the Ferguson Reflex.\n\nFor those of you who’ve never pushed a baby out: you know that feeling you get when you take a satisfying shit, your face contorts a little and your body goes into an animal hrrrrrrrrnnnggggg… and then you eject a pound and half of yesterday’s tacos? Yeah, that’s actually a reflex.  When you have a 5lb 10oz baby far enough down in your pelvis, your body knows just what to do with it.\n\nYeetus.  That.  Fetus.\n\nSo, the patient slept, and every 3 minutes would push quite effectively. I got to watch Dr. Crusty coach Dr. LaLa through a really lovely breech delivery. Out of hundreds of deliveries I’ve attended in 16 years as an L&D nurse - this is the third breech extraction I have ever witnessed.  Hat trick turned Triple Crown.  I felt like I was witnessing history, with that posterior shoulder delivery.\n\nOh yeah, back to Dr. Crusty.\n\nI’m tucked in against the patient’s hip, feeling her belly for contractions with one hand, and searching with the doppler for heart tones with the other, when Dr. Crusty yells out “Puje!!! Puje!!!” Which is Spanish for “push”. Not only is the patient unconscious, she is Hawaiian, not hispanic. I turn to glare at him over the patient’s draped leg, and see through his goggles that he hasn’t wiped last night’s sleep crust off his face. I catch his squinting, yellow-crusted gaze and mumble “she can’t hear you, Dr. Crusty. And she doesn’t speak Spanish.”\n\nAll’s well that ends well - the baby is fine, actually 37 weeks. The patient slept it all off and then ate everything in the fridge. CPS will be in later today to take her baby (also meth+ on Utox) to foster care, but for now she gets to coo and giggle at her cute little daughter. I took her an 8th cup of coffee before I left, with 6 sugars and 4 creamers, just the way she likes it.\n\n\n\nTL,DR: If a pregnant woman tells you she hurts anywhere between her nipples and her knees… it doesn’t matter how batshit insane she is.  Assume she is in labor, until proven otherwise.\n\n\nEdit: well this blew up.  Thanks for all the encouragement, guys.  I’ll keep writing if you keep laughing.  And, for the love, quit paying for fucking Reddit awards.  God bless /u/spez, but that dude doesn’t need your hard-earned money any more than I do.  Go donate $5 to The Bail Project.  If you PM me about it, I’ll send you a book when I’m done with it.",
    "title": "Tasmanian Devil delivers a breech baby vaginally, and I lived to tell about it.",
    "subreddit": "nursing",
    "timestamp": 1634242450,
    "score": 6458,
    "keyword": "hispanic manager"
  },
  {
    "text": "Minority teachers Can you please tell me your experiences in predominantly white districts? As I was doing research for an interview I have coming up, I noticed that there were articles about the effort of this district to hire black teachers as well as some incidences of racism. \n\nThere is a whole movement on FB about it actually. I also saw statistics of there being 1 black administrator and 1 Asian one in the district of about 7 schools. Also there are supposedly 14 black teachers and 350 white teachers. \n\nNow, I do not know how to feel. I would be leaving a predominately black and Hispanic school for this one. The title 1 school I’m at just lacks resources as far as good curriculum guides, students are progressing to grades without the right skill set for whatever reason, old and broken down equipment and classrooms, and I’ve been pretty frustrated with the lack of teacher support as a first year teacher. However, I’ve managed to take it all on and do a pretty good job considering what I was dealt and the lack of support for a new teacher. I mean this may seem small but I constantly get emails referencing things that need to be completed and I have no idea about it and that is frustrating but I guess to be expected?\n\nAnyway, what are your experiences as minority and especially black teachers (I am a black female teacher) in these districts?",
    "title": "Minority teachers",
    "subreddit": "Teachers",
    "timestamp": 1623225560,
    "score": 5,
    "keyword": "hispanic manager"
  },
  {
    "text": "Transformation schools (low test scores) New teacher advice   Hi everyone! I'm entering my second year of teaching in Florida. I had a REALLY tough first year because of COVID and I was in a tough school with kids who had no respect for me or any teacher. They were all struggling with tough home situations and most of the parents were unavailable. The dicipline system was shit and the principal was a toxically masculine manipulater. Every day was hell for me and I'm still healing from the experience. \n\n  I'm trying to stay in teaching because I know it's what I want to do but I'm so scared of signing into a school that will be a repeat of the last. I've interviewed with four 5th grade positions (originally I taught middle school) and I'm excited to start elementary education (if I land a job). A lot of the schools in my area have very poor test scores. They're mostly rated 2/10 on the \"greatschools\" website. It's incredibly depressing to see the systemic racism trickling down into our school systems and it just feels like teachers are left to pick up the pieces of these broken homes catalyzed by our government. \n\n Every school with low test scores have high Hispanic/black populations. Poverty has an effect on the development of the brain (not irreversible but definitely something to be aware of). So these kids have much lower reading levels, problem solving, and higher order thinking skills. The brain is able to be molded and \"flexed\" but not to the standard florida expects of them. The schools keep pushing kids through grade levels even it they failed every class. \n\n  The kids at my last school would purposely do nothing all year and wait for credit recovery to get their passing grade. They didn't want to be taught. No matter how enriching I made the content. If I built a relationship with the student it would immediately crumble when I had to dicipline or put my attention on another student. They all CRAVED that attention and they would fight one another to receive it. Whether it was negative or positive attention. My classes had 25-31 students in a tiny room. \n\n  I was beyond stressed and depressed. I just want to teach but I don't have the skills to manage my classes yet. I know it will be better this year having learned what I did, but they overall problem is still there. The teachers at my last school were all just as stressed and disappointed in the school but they were badasses and could handle their classes without the help of admin. I'm a much softer and introverted person. I would use all the skills and techniques I learned in school which favored talking to each student when they have problems and building relationships. But EVERY student had a problem and when I would focus on one the rest of the class would get out of control. \n\n  Any advice on what I should do next? I tried setting up my own brand on outschool (online teaching) but I haven't gained enough traction to replace a full time job. I could get a part time job during the school year and keep growing my outschool brand? It would be nice to be home with my dog and disabled fiance. Honestly 9-5 jobs wear anyone down....",
    "title": "Transformation schools (low test scores) New teacher advice",
    "subreddit": "Teachers",
    "timestamp": 1627149572,
    "score": 2,
    "keyword": "hispanic manager"
  },
  {
    "text": "Quid pro quo violence I'm teaching at a summer program in a public school have a small, poor, urban, majority Black and Hispanic School. I love the kids and there's just as many as want to learn as don't want to learn, and just as many who are willing to do things if you ask them the right way.\n\nMy problem is how if one kid messes with another kid and even a small way then they need to get back at the original offender. They're also constantly trying to get out of trouble by throwing blame at somebody else. I asked them about this and they all accept that it's just the way of life, that this is what they're taught by their parents.\n\nSo far nobody has been seriously hurt, but people are constantly pushing or slapping or throwing balls of paper at each other. It makes the classroom unmanageable, and I don't know what to do.\n\nAny advice on classroom management and discipline strategies would be appreciated, because I don't trust what my supervising teachers are telling me.",
    "title": "Quid pro quo violence",
    "subreddit": "Teachers",
    "timestamp": 1626973715,
    "score": 1,
    "keyword": "hispanic manager"
  },
  {
    "text": "How to earn and establish more respect in the workplace? I’ve been at my job for about a year now. It’s a global company and my team itself is pretty small— there’s program managers, developers and then there’s me, the marketing person. The team is mixed racially (Hispanic, Indian, a couple of yt men, etc), but it’s all men. I’ve noticed, while battling imposter syndrome already, they tend to treat me like a secretary or like someone they have to “tell” what to do even though I speak for myself. I’ve tried being the friendly one to progeny being labeled the Angry Black Woman, especially when I’ve had to deal with pushback or being steamrolled. This is clearly a Good Ole Boys environment, and sometimes my own manager will overlook me or the disrespect unless I point it out to him.\n\nAnd yes, this is not the best but we’re in a panorama and I want to at least be able to have a couple of years here for my resume and for other goals I’d like to achieve. \n\nAny advice when trying to establish more professional respect? Any good phrases to professionally say “I’m not playing with you” and to deal with being steamrolled in a non passive aggressive way?",
    "title": "How to earn and establish more respect in the workplace?",
    "subreddit": "blackladies",
    "timestamp": 1616511625,
    "score": 25,
    "keyword": "hispanic manager"
  },
  {
    "text": "PSA: CA STRIPCLUB \"LIBRARY,\" EXCLUSIVELY SCAMMING HISPANICS A lot of people don't want to talk about these businesses bc they think most people don't go there or are embarrassed to talk about it.\n\nThe reality is that most people don't specificaly go looking for these businesses but they get lured in by the big blue highway billboard.\n\nThis business has been targeting the community and I feel the need to warn people\n\n\n\nJust want to warn about a Prominent OC business that has scams fit for a movie. Forgive me for my bitterness,and your boy will now explain:\n\nYes, it is a strip club--you say, what's new?? Let me explain. Dated a girl from there and it blew up. Found out shit. Got permanent diseases. ...Found out exactly how stripper plot.....from hearing hours of dressing room convos...accidentally. Consider me schooled.\n\nLadies--even if your man is a holy man,please check his ATM, credit cards, debit, bank statements for a \"Bob Martin Inc\" I'm talking about Library Strip club chain. Ex said it's the culture of high level scams there. they can get away with it since it's next to the highway. Their billboard attracts many clueless guys. It's a tourist trap.\n\nI posted a review on Yelp and it got removed. Yelp thought it was some fake account bc it was a new account. What was I supposed to do?? Post on my regular account for all to see???\n\nGather around children ,and let me forewarn y all about what ACTUALLY goes on in that liar of HELL\n\n--they alledgedly drug guys there depending on circumstances. Bartenders do,not strippers. I was drugged there but though it was good posioning. ex confided that bartenders and waitresses will drug your drink secretly while they make it, u can't even see it Cuz they r slick, to ready you for their stripper friend to hustle you.\n\nWhatever drugs they use clears in a few hours so ur shit out of luck for evidence. Instead of waking up with 20k gone like in the hustlers movie, you only feel barely dizzy and lose 500-1500. After all, they dont want to get caught.\n\nPartially causing all covid cases in Santa ana, anaheim in the Hispanic Community......\n\nMy ex got covid not once,but twice there. (I lost my business during covid and she needed to work...I didn't qualify for PPP coronavirus relief government loans but library Club managed to get them, against federal policy saying strip clubs r barred!!!!)\n\nhttps://www.cnn.com/projects/ppp-business-loans/businesses/bob-martin-inc\n\nLibrary club =bob martin inc.\n\nUnfortunately, Covid has really fucked with the hispanic community in Santa ana and anaheim and part of me thinks it's from Manuel going to the library Club and then eating weekend dinner with Abuela. We all know hispanic families have multiple generations under 1 roof. Just because Daniel the 24 year old isn't sick doesn't mean he can't pass viruses to abuelo!!! Yes, they were open all during covid even when indoor dining was banned. you can get a block of dances from a girl that has rubbed herself over 15 other men in the past few hours. No distancing, it happens in the blocked off room.\n\nEx infmored me girls pass around cough syrup and anti nausea meds in the dressing room to hide covid symptoms.\n\nDont fuck a girl from there. You gonna get sick. I have 2lifelong diseasesfrom my ex. She got it from the managers there. I now have monthly outbreaks and have to take pills that cause diarrhea. Condoms dont protect always.\n\nMind blown over listening to girls dressing room conversations. These ain't your ditzy college student/single mom. These girls actually get off of conning men. These girls were laughing like Mr. Burns from the Simpsons....\n\nSnooped on ex's phone back when I thought she was cheating and found fistfuls of audio recordings. Thought they were recording of her side boy and Sent them to myself. Turns out she was being threatened constantly by other girls in the dressing room for fights a d she wanted to record audio with her phone while she did her hair.\n\nInstead, during that time Her phone captured hours of dressing room conversations between strippers, from a girl specializing in romance-scamming undocumented but monied Hispanics, 4 at a time (and if he found out and got mad she threatened to report him). Her whole family would have dinners with him to fake it. To a stripper meeting a guy at a hotel and having her boyfriend steal your catalytic converter while you think your dick will get wet. Girls rigging cameras to videotape your escorting session and which camera was best...to send to your wife later on if you didn't agree to pay blackmail...having her shady cop boyfriend run your car plates through the police database illegally to figure out where you live and blackmail you....to where is my HIV pill I think I dropped it....that condom broke and the guy didn't even notice it (giggle giggle, from HIV girl to another girl in spanish) Etc etc. Two girls plotting to entertain 1 guy, so each could memorize half of his credit card info....barbacks secretly copying credit card info to use on games months later. Now I speak Spanish and portugese and English, so I'm sure some of these convos were never meant to be heard and understood. Crazy enough, these girls didn't even sound \"ghetto \" you would never think these girls were two faced snakes first meeting them, apparently.\n\nMy relationship blew up when I learned my girl wasn't acting weird and depressed because she was cheating. Got her positive HPV /HSV? results in the mail from her pap, confronted her, she claims she was forced into sexual shit by the managers. Apparently that's the majority of girls there so they won't even know who my ex actually is (hundreds of girls on roster!!)\n\nThere are 3 managers , Kyle Frutiger(somewhat midget, buff),\n\nJeremy Feindel (skinny tall, underbite, fucked up caves in smile, white trailer trash look)\n\nMike Dansse -- never met Mike but hear he is Irish..\n\nNow if you got the dough and the circumstances are too risky, they'll treat you like family. When times are ripe,they are ready to scam you. All the dumb people think it's all fun n games.\n\nJeremy the main manager, is a CONVICTED FELON (see link below for charges). Apparently he fucked over some JERSEY SHORE SNOOKI LOOAKLAIKE girl real bad just for fun, so she launched a class action lawsuit for some dumb non related reason and now my ex is owed some money.\n\nWhy does this matter? The owners will have to come up with an enormous sum of money---meaning the managers will be encouraging the girls to scam MORE GUYS LIKE YOU.\n\nhttps://www.localcrimenews.com/welcome/detail/24735075/jeremy-feindel-arrest.html\n\nThe midget manager, kyle, is a racist, homophobe:\n\nhttps://ibb.co/ZcvnVYY https://ibb.co/wSFgfs0https://ibb.co/sHGTp98 https://ibb.co/3rk9TTphttps://ibb.co/fXzN2Mg https://ibb.co/wMKCfk4https://ibb.co/3rsts6V https://ibb.co/9G0yHB0\n\nSettlement: Www.thelibraryclubsettlement.com\n\nStay safe my homies",
    "title": "PSA: CA STRIPCLUB \"LIBRARY,\" EXCLUSIVELY SCAMMING HISPANICS",
    "subreddit": "Hispanic",
    "timestamp": 1612079610,
    "score": 6,
    "keyword": "hispanic manager"
  }
]