[
  {
    "text": "Should I work for a racist boss? TLDR: My old boss was toxic and racist but wants me to work part time as a contractor. \n\nBackground: I recently quit working for a very toxic company and boss as a project manager for a short time. I enjoyed the projects themselves because I’ve been doing this type of work/projects for several years. My life dream is to eventually be self employed in this type of work and I’ve worked for and with several other good companies and bosses I’m the past. The most recent though, was a very toxic environment. My direct manager was manipulative, and a micro manager. They would often lie or spread false rumors about other employees to create their own narrative and make themselves look good. They were a workaholic themselves and literally spent 24/7 on call to the CEO, and expected the same of me (and all other employees) even though they were being paid a huge amount to be on call (like $400k+) while the rest of us were being paid a normal amount ($50k-$60k). I’ve been working a long time and I’ve had my share of dealing with difficult managers, but this was a new level. The stress was manifesting in my life physically and even though the issues came up early in the job, I couldn’t afford to leave for at least a year. I managed to buck up and have several tough conversations with my manager about my own expectations and boundaries, and for the rest of my time there was able to keep them from trying to control my entire life and keep it professional. They did manage to make my coworkers lives hell, because they were not experienced/brave enough to have the same tough conversations. I tried  advocating for them but it would only go so far when they were not able to stick to their own boundaries. My manager still respected my high quality work and promoted me a couple times to take on higher responsibilities. Towards the end, they asked me to be involved in hiring process to replace one of my lower rolls. I was the 2nd round interviewer after the standard initial HR 1st round, and my manager would be the final interviewer. I interviewed no less than 10 people, all of whom were well qualified and a couple were even over qualified. There were 5 candidates I passed along to my manager who I thought would be the best for the job for several factors (flexible schedule being the main one). 4 of the candidates were black women and 1 was a Hispanic woman. I provided in depth notes on their strengths and offered to help set up the final interviews. Immediately without looking at my notes, my manager asked me to find and send their linked in and social media accounts. I assumed they wanted to check for anything dangerous or inappropriate, since it was a client facing role. So I sent the profiles I could find. Most had linked in and a few had Instagram. I’m sure they had others but from what I saw, all of them had updated and professional looking profiles. The Instagram photos were normal. Within a day, my manager let me know they wanted me to keep interviewing and asked about one of the other candidates who did not make my top 5. (A young white woman, very conventionally attractive and skinny). I let them know she had the least amount of experience and would not be able to stay late ever, which was a requirement. I had to do several more interviews only to eventually have my manager tell me “not to be racist, but they just don’t work hard and always start issues”. I was so in shock I was speechless. I didn’t ask for clarification about “they” but it was a buoys after I questioned why all 8 candidates I had sent were black or Hispanic or even just older. I realized they wanted a young thin white woman. We eventually hired the attractive one who had the least experience and ended up giving my manager some headache because she needed a lot of training and was constantly calling out “sick”. I began job hunting almost immediately and left a few months later. \n\nFast forward to today, I have a new job where I’m doing well and with a healthy working environment. My old boss reached out to ask if I would help on a contract basis with their largest project they have every year. I could charge my higher rate and only work a few hours a week until the project is finished at the end of the year. And it would add to my portfolio. I wouldn’t have to deal with the usual stress since I would be a contractor, not an employee. I just can’t get past the fact they are inherently racist. I feel like I would be selling my soul.",
    "title": "Should I work for a racist boss?",
    "subreddit": "jobs",
    "timestamp": 1694456513,
    "score": 1,
    "keyword": "hispanic ceo"
  },
  {
    "text": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones Historically men have always been the problem-solvers for most of human existence. Men have always been counted onto to be problem-solvers because for the most part because we are hardwired to detect what is wrong with our environment or location. So I feel like when the industrial revolution came about to be, society counted on us to be not only problem-solvers, but also example-setters, the role models, the innovators, in other words, historically men fought tooth to the nail to try to make the world a safer, healthier and more stable place\n\nSo when the Industrial Revolution came to be, this put more pressure on men to be even more ''advancing'' and ponderous on to the grid and infrastructure of society, so we naturally have inclined to depend on men not only for advancing society, but to be the prime example-settlers for people to follow. I think that might be part of why we put so much pressure on men to be established and groomed by a certain age, where as women don't face those very same productivity pressures. I mean sure obviously people will judge a woman if she's being what they call a ''leech'' on the system, but for the most part what I am saying is they don't really get hit with the memo of hustle culture to the same degree men do, no one is going to judge a woman for working at McDonald's more than her being a nurse, but for a man that implies lack of intrinsic worth and respect and a good work ethic.\n\nI noticed this also disturbingly amongst ethnic minority male groups, whether it is the ''trabajador'' culture in the Hispanic community or the ''Be a baller'' mentality in the black community or the Silicone Valley Techie trope in the Indian community, I think those pressures are even more pronounced among men of color, but gonna try to refrain from over-emphasizing, I think you get my point though.\n\nBut this is also mostly used against working-class men, for example no top CEO in a fortune 500 company is gonna be told that their hard work doesn't pay off, even if they ended exploiting the resources along the way.\n\n&#x200B;\n\nI believe this to be a men's rights issue because since the working class consists mostly of men, this keeps the average man in the trenches",
    "title": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones",
    "subreddit": "MensRights",
    "timestamp": 1682608588,
    "score": 18,
    "keyword": "hispanic ceo"
  }
]