[
  {
    "text": "New hospice nurse/rough death today Hi all: Nurse for 17 years, hospice nurse for 3 months. I really do like the job a lot, though there's a learning curve.\n\nMy boss this morning asked me to go do a pronouncement for another nurse's patient. No problem. She said the son of the patient was expecting me.\n\nI got to the apartment (a high rise in subsidized housing) and when I got there the apartment was full of crying hysterical people. And EMS was there.\n\nThe paramedic said to me, \"The family called us because the patient was nonresponsive, and we can't find a DNR in the house.\"\n\n...oh dear.\n\nI asked a family member if there was a DNR, she said \"I don't think so, I'll look.\"\n\nI went into the bedroom, also chock full of people, and the son is standing by the bed. The patient (in his 70s, end stage cancer) is lying there looking quite dead. The son said, \"The nurse gave him morphine a couple of days ago and he was totally normal before, and she insisted he needed morphine for pain, and now he's like this.\"\n\nI did the standard thing: listened for heartbeat for a full minute, no response to sternal rub, pupils were fixed and dilated. \n\n\"I'm sorry, he's gone.\"\n\nThe son absolutely freaked out, throwing himself over his dad's body and sobbing. Everyone in the room (this was a Hispanic family) was crying and yelling in Spanish.\n\nI went back to the main room and no one could find a DNR. I checked the computer chart: no record of a DNR.\n\nWent to the bathroom and called my boss. \"WTF do I do?\"\n\n\"You know that a dose of 5mg of liquid morphine given a couple days ago won't kill the patient,\" she said.\n\n\"I know that but the family clearly doesn't,\" I said.\n\n\"Call one of our medical directors and get a verbal DNR and permission to pronounce,\" she said.\n\nI got the MD on the phone, described what I saw and he gave the verbal order, and I pronounced the death.\n\nI talked to the EMS who said they'd called their supervisor and agreed with my assessment and they wouldn't take the patient to the hospital.\n\nI started filling out the paperwork, called the funeral home (thank God they'd picked one), and all while I'm doing this more and more family were showing up, sobbing and hugging each other. The PCA (who'd worked with the patient for 18 years) asked me to call our chaplain. I left him a message.\n\nThey gave me a little cup of very strong, very sweet coffee.\n\nI stayed as calm as I could, did my charting and all the stuff I had to do, all the while hearing all this family so, so, sad.\n\nLater that day, the chaplain emailed me saying he'd called the son and offered to come over, but the son said he was too upset to see him, and hung up.\n\nWhew. I think I handled this as best as I could, but not a fun way to start my day.\n\nThanks for reading.",
    "title": "New hospice nurse/rough death today",
    "subreddit": "nursing",
    "timestamp": 1683938248,
    "score": 144,
    "keyword": "hispanic director"
  },
  {
    "text": "Why the Department of Defense’s schools are outperforming the competition [https://thehill.com/opinion/education/3719861-why-the-department-of-defenses-schools-are-outperforming-the-competition/](https://thehill.com/opinion/education/3719861-why-the-department-of-defenses-schools-are-outperforming-the-competition/) \n\nIn the first major national assessment of K-12 students since the height of the pandemic, schools dedicated to educating U.S. military-connected children have outperformed most school systems across the nation, despite the impact of the pandemic.  \nJust-released results from the 2022 National Assessment of Educational Progress tests show that fourth- and eighth-grade students attending Department of Defense Education Activity (DoDEA) schools led the nation in scoring on reading and mathematics assessments.  \n“DoDEA students’ average scale scores ranged from 15 to 23 points higher than all corresponding national average scores and held steady or increased while all national average scores decreased,” the Department of Defense said in a statement.  \nDoDEA was the only U.S. state or jurisdiction taking the tests to see a score increase for any grade or subject on the first NAEP test administered since the beginning of the COVID-19 pandemic.  \nThe scores also show progress for Black and Hispanic students in the DoDEA system. DoDEA’s “emphasis on equity in education is reflected in higher scores across their diverse population and achievement gaps that are significantly smaller than the rest of the nation,” said Gilbert Cisneros, undersecretary of defense for personnel and readiness. “I am particularly pleased to see those efforts reflected in Black and Hispanic student groups that are outperforming the nation overall,” he added.  \nThe Department of Defense Education Activity is a federally operated school system that provides pre-kindergarten through grade 12 education for the children of military service members and Department of Defense civilian employees. In 2021, DoDEA operated 160 schools in three regions — U.S. installations in the Americas, Europe and the Pacific.  \nThe success of DoDEA schools is an amazing feat, especially given that military-connected children lead highly disrupted lives. They change schools every two to three years with a parent on active duty. And with a parent (or parents) sometimes deployed doing dangerous work, the children face stressors others do not as they manage schoolwork, home responsibilities and regular transitions in and out of communities.\n\nI wrote earlier this year about the success of DoDEA schools in mitigating the pandemic. The recent NAEP scores underscore that their approach to managing students with highly disrupted K-12 careers can provide insights for weathering something as damaging to student learning as a pandemic.  \nDoDEA Director Thomas Brady told me that a turning point for the school system came in 2016 when they began implementing college- and career-ready standards starting with mathematics. Also, it made a big investment in teacher and leader development that has continued over the last nine years.  \n“Our commitment to student achievement and to teacher training and development all combined for positive development in the classroom,” he said.  \nJeffrey Noel, DoDEA’s chief of educational research, told me that some of the success can be attributed to an overriding philosophy that guides the use of resources. DoDEA schools focus on limiting excessive bureaucracy — a big problem for many school districts — and instead prioritize efforts that can have the most impact on students.  \nOne was a push for in-person instruction. DoDEA schools shifted to remote learning during early 2020 like most other public school districts. But only months later, by the beginning of the school year in September 2020, DoDEA focused on in-person learning with mitigation measures as many school districts were unable to reopen. By March 2021, 99 percent of DoDEA schools were operating in person and 100 percent by this past fall.  \nMilitary-connected kids who attend DoDEA schools are not the typical public school cohort. They have parents with jobs, health care, food and housing; their schools are well-funded and don’t have the same federally imposed requirements. They also operate in a unique system of a shared culture and familiarity between students, parents, teachers, school faculty and base leaders. But they don’t have it easy.   \nDoDEA schools are succeeding — and that merits a closer look for lessons that can help school systems struggling to gain back learning losses.\n\n&#x200B;",
    "title": "Why the Department of Defense’s schools are outperforming the competition",
    "subreddit": "Teachers",
    "timestamp": 1695738253,
    "score": 3,
    "keyword": "hispanic director"
  },
  {
    "text": "Should I Confront Descrimination? Seeking advice before I send my boss an email confronting the descrimination that I experienced when she denied promoting me, late October 2022.\n\nTimeline:\nI started in 2019 as a coordinator, promoted to senior coordinator November 2021, applied for 1 of 5 open analyst positions. Applied and interviewed in September 2022. Was denied promotion then promoted to a new position created \"just for me\" as an associate analyst, plus my duties as Sr. Coordinator (November 2022).\n\nI referred an employee to replace my coordinator position who was hired in April 2022. My trainee (white male) applied at the same time as me for the analyst position and was promoted in September 2022 to the analyst position. There are 2 analyst positions that have yet to be filled. \n\nDescrimination History:\nTrainee was assigned a \"high priority\" state that I assisted on (aka prepare everything and having the director approve before filing) for 2 years. I even trained the previous analyst how to do the job. \n\nI am a Hispanic female. The coordinator/admin positions have been filled with Hispanic and white employees for the past decade (at least) but only the white employees have been promoted to salaried positions. Not one Hispanic employee has ever been promoted to a salaried position in my department, that's 20+ years streak. There is one non-white salaried in the department and they were just hired. \n\nI am coincidentally the only \"analyst\" who is an hourly non-exempt employee; performing the same job as previous salaried analysts. I'm getting paid $20,000 less than my trainee now. They won't even approve overtime for me, I am seriously expected to do two jobs in 40 hours. Instead, I've been instructed to ask my manager to finish any of my tasks left at the end of each day. It's still extra work to delegate those tasks and sometimes they don't get done which then gets blamed on me!\n\nI complete my associates degree in paralegal studies this month, but a college degree is not required per the job description. \n\nMy education and/or race are the only two possible explanations for why I was denied the promotion. When the director met with me via video chat to let me know that I was denied the analyst position and would be promoted to a newly created associate analyst position, she said it was because she and the managers thought I would need too much training. But she is apparently fine with training a new employee who has only 5 months of experience on the hardest job on the team.  Starting to feel like opposite land yet? \n\nI haven't received any negative feedback on my annual review in 2 years. \n\n***********\n\nI want to email pretty much all of what I wrote here, albeit more concisely. \n\nAt the end I want to lay out some acceptable solutions:\nA) Promote me to a \"real\" salaried analyst position and assign me CA. \nB) Promote me to the new salaried operations manager position.\nD) Give me unlimited overtime each week to complete both jobs.\n\nThey will probably fire me under the guise of being 1 minute late clocking in or whatever. But if they do then I will file a complaint all the way to the top. I'm planning to find a new job anyway, just can't leave this month. \n\nI've already spoken with an employment attorney and following their instructions. But this post is mostly to vent, hear about similar experiences, and advice on how to phrase my points listed above.\n\nThanks!",
    "title": "Should I Confront Descrimination?",
    "subreddit": "careerguidance",
    "timestamp": 1673399483,
    "score": 1,
    "keyword": "hispanic director"
  },
  {
    "text": "Shopping while Black I need help. I am being harrassed while shopping at my local grocery store. I have tried everything to get them to stop.  I have reached out to store directors, directors of operations, corporate you name it. It stops and then it escalates again. I live in a predominantly White/Hispanic/Asian area in California.  Its now at the point where I have to address the situation legally.  Any assistance would be greatly appreciated",
    "title": "Shopping while Black",
    "subreddit": "blackladies",
    "timestamp": 1679849089,
    "score": 11,
    "keyword": "hispanic director"
  },
  {
    "text": "Teen girls ‘engulfed’ in violence and trauma, CDC finds There was/has been an increase in domestic violence in general during the COVID pandemic. That fact is somewhat widely known. According to this Washington Post article, there has also been an increase is rape against teen girls and increased depression among teen girls.\n\n\"... Almost  15 percent of teen girls said they were forced to have sex, an increase  of 27 percent over two years and the first increase since the CDC began  tracking it.\n\n'If  you think about every 10 teen girls that you know, at least one and  possibly more has been raped, and that is the highest level we’ve ever seen,' said Kathleen Ethier, director of the CDC’s Division of  Adolescent and School Health, who said the rise of sexual violence  almost certainly contributed to the glaring spike of depressive  symptoms...\n\n... Ethier said it’s important to determine who is perpetrating the  violence, which the survey did not address, and how it can be stopped.\n\n... Lesbian, gay, bisexual and questioning students were significantly more  likely to experience violence than their heterosexual peers. They were  also more likely to be electronically bullied and to report persistent  sadness or hopelessness. \n\n... Black and Hispanic students were more likely than White and Asian students to avoid school because of safety concerns...\"\n\n[https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl\\_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp\\_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87](https://www.washingtonpost.com/education/2023/02/13/teen-girls-violence-trauma-pandemic-cdc/?wpisrc=nl_most&carta-url=https%3A%2F%2Fs2.washingtonpost.com%2Fcar-ln-tr%2F391d5d5%2F63ea72b31b79c61f878f39d4%2F596c03549bbc0f20864f7c03%2F9%2F70%2F63ea72b31b79c61f878f39d4&wp_cu=7eb79133baa2f84a6aebfeffd730e11f%7C0254755971AD1121E050007F01000F87)",
    "title": "Teen girls ‘engulfed’ in violence and trauma, CDC finds",
    "subreddit": "Feminism",
    "timestamp": 1676335624,
    "score": 628,
    "keyword": "hispanic director"
  }
]