[
  {
    "text": "The real reason women are not represented in tech First, I want to clarify I do not agree with the basis that women are not biologically suitable for roles in tech. I am much more inclined to believe it has to do with culture, and a good hard example against women being biologically inferior would be the country of Iran, where women make up the majority of engineers. Now granted, Iran has segregated schools between men and women, and they are under a theocracy, but if your basis was of biological merit, then this would be a good hard example to prove otherwise.\n\nNow, I will say that culture, primarily American culture, plays a huge role. \n\nLet's think back to middle school tech-ed courses, and think of the demographic in play. White/Asian nerdy boys primarily, a few hispanic and black nerds, and once in a while a nerdy girl. \n\nThis demographic holds true throughout high school. I would know, I was a guy who took tech ed courses in middle school/high school between two secondary schools, and this demographic holds true in hackathons, coding conventions, tech conventions, and..... tech jobs!\n\nBut why? Why do women, aside from a minority number, shy away from tech? Because of nerd culture. Yep, I'm just keeping it 100% honest here. Nobody likes nerds, besides other nerds. As someone who graduated from high school in 2015, the same stereotypes from 2-3 decades ago still hold true.\n\nNerds don't have friends to sit with at lunch, they are too autistic to make friends, and ESPECIALLY girlfriends, they are easy to pick on, and on the social hierarchy in high school they are at the very bottom.\n\nSo they fall back on tech, video games, and porn. And now you know why 90% of league players are males, just as the majority of competitive PC gamers are males. Men have a culture to fall back on, women do not. If women try to join this culture, lets say they play league, they will get hit on constantly for being a women. It's not fun, unless your aim is to make money from it by being a titty streamer of course.\n\nCompare this to a country like Iran, where western high school culture is non-existent, girls and boys are separate until 18, and girls are brought into tech collectively, where they can enjoy the subject without being hit on constantly, and without being judged.\n\nThis is not to say we need a theocracy. Hell, I'm agnostic myself. But I am saying that different cultures breed different peoples, and that our current nerd-normal people-jock culture cannot produce an equal outcome for both genders.\n\nUnless of course we mandate the subject, which could change things drastically. \n\nLooking forward to hearing your thoughts.",
    "title": "The real reason women are not represented in tech",
    "subreddit": "Feminism",
    "timestamp": 1502563805,
    "score": 9,
    "keyword": "hispanic judge"
  }
]