[
  {
    "text": "I don't think people have a grasp on how bad it is to be a girl. I'm not saying being a girl is bad, but sometimes I'd rather not be. And I guess this post is to just to vent it out.\n\nI was walking the lady's kids to the bus stop when it hit me. Being a girl sucks. \n\nI've been alive for 18 years and I feel like quitting. So much is expected from us. So many things we're *supposed to do* as a girl.\n\nNot to mention how bad growing up as a girl is. My mother constantly reminded me that there are people who will *FUCKING RAPE YOU* if *YOU* aren't careful.  \"Boys get sexual assaulted too!\" Yes, yes I know. But not to the extent for females. 1 in every 3 or 1 in every 6 girls have been assaulted in some sexual way. As infants, as toddlers, and teens, as grown women.\n\nAnd you know what???\n\nI'm one of those 1 and every 3. I was 7, fucking 7. By who? My own family. \"Don't wear skimpy clothes\", \"stop giving signals\", \"stop acting like a slut\", excuses by men and traitorous women. Trying to *JUSTIFY* why it's mine, your, our fault we were hurt. Wtf is going on?!\n\nThis is the first time I came out about it in a public platform. Why did it take so long? I don't know. That is the problem, we're afraid. I was afraid. But I guess I don't care anymore. I won't stay stuck on it. Those two teens became men with families. They have daughters who they love and cherish. But they know what they did. And I hope they remember it each time they see my face. I hope they remember how disgusting they were. They might've even thought I forgot about it. But I didn't. \n\nI hate my past, but I hate my future even more. All this toxic \"if you're my girlfriend, I *own* you.\" These young teen boys who are feeding and being fed this fantasy that girls are to be kept, to be owned. No. I want to be with you, not *for you*. These poor Asian women who are labeled as submissive house wives and child like. Black women labeled as side girls and hoes. Hispanic women being labeled as aggressive and bitches. No, no, no, no. Wtf is happening?!\n\nDon't even get me started on the Pink Tax. I'm not going to pay $4 more for a pink razor! I don't want want to spend $100 a year for pads and tampons. I don't want your targeted ads. I DONT WANT YOU TO PROFIT OFF MY GENDER!!!\n\nI'm tired of girls judging others girls for not *fixing themselves up.* Some girls wear what they wear because of past experiences. Why don't wear makeup? Because I don't want attention. Throughout highschool, my fellow peers have looked at me like I'm meat on display. I've been catcalled. I've been ass tapped and was told by him \"sorry, I didn't mean to!\" MOTHERFUCKER you're a like a foot taller than me! And you tagged my ass? Do you know how far down you have to go to make that possible? The waist, fine. The shoulder, fine. But my ass?! No, you know what you did. I know what you did. And I wasn't the only one, the week after another boy did the same *accident*. I wish I had the strength and fire she had, she called him out. When the gym teacher asked if she could forgive him, \"fuck no!\" I wish I had that strength.\n\nShit like this is why I wear baggy clothes, so I don't get that attention. So no one will see *what my mama gave me*. Don't judge a girl for looking the way she does. Don't judge her for wearing makeup or lack of. I degrade myself so I won't be treated like meat. When I dress up, it's not for you. It's. For. Me.\n\nI'm going to stop before it gets too long.\n\nIf anyone reads this, thank you. Thank you so much. I can't vent an essay to my friends, but reddit is a little different.\n\nAnyways, sorry for bad formatting and grammar.\n\nThank you,\n\nSam ʕ·ᴥ·ʔ",
    "title": "I don't think people have a grasp on how bad it is to be a girl.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1620135204,
    "score": 854,
    "keyword": "hispanic judge"
  },
  {
    "text": "For all the Texan woman who plan on voting against the abortion bill ( a warning) I warned y'all about this [Texas bill a few months before it went into effect](https://www.reddit.com/r/TwoXChromosomes/comments/nvrbp6/i_had_a_meeting_with_texas_state_legislators_8/) , and I'm here with another warning to every Texas woman who wants to fight this bill by overturning it by getting rid of it's sponsers and kicking em out of office at the ballot box by voting.  \n\nYour right to vote to change this is in as much danger as your chance to obtain an abortion.  \nThey are targeting areas with people likely to vote against the abortion bill.\nThey are putting in restrictions that might strip a lot of y'all from the right to vote.\n\n[I'm an election judge](http://imgur.com/a/Rgnc6uv), (that's my election judge pin )so here's what y'all need to do to not get your voting rights taken away as well: \n\n-Y'all NEED to check your voter registration status more than 6 weeks before every election.  Look up your\" county\"+\"election office\" and it should bring up your website \nShould any issues arise, or they took you off the voting rolls illegally, you should be able to get it taken care of within 2 weeks. 1 month before the election you wish to vote. If it's not taken care of by that deadline, your vote won't be counted. (Harrisvotes.org is the website for Houston /Harris county, Montgomery County is Montgomeryvotes.org,  if this post gets any traction,  I'll list the top 25 most populous county  sites)\n\n-If you move, change your name or want to register to vote: you should be able to obtain a short form Secretary of State voter registration form at many post offices, libraries, Texas Department of Public Safety offices, and Texas Health and Human Services Commission offices throughout the state. If you move within the county, you should be able to still vote at any early voting locations.  The local Democratic and Republican party headquarters are also likely to carry them.\n\n-If you have issues/or think you might have issues with your voter registration and can't verify it, contact a local voter registrar. You can ask your local League of Women Voters,  either the local Democratic or Republican party and ask about any events with a \"VDR\". Last but not least, contact your local election office.  (This can be the most time consuming option)\n\n-If you are denied voter registration by a VDR(Voter Deputy Registrar) because of partisan affiliation or if they try to have voter registration events for anti-choice voters only, that is still illegal. \n\n-They plan on having partisan jerks bothering voters and intimidating them. They are not allowed to film you in a manner that shows how you vote. They are not allowed to bother, harrass or attempt to influence your vote. They should have a nametag with their name, if your rights are violated, you need to mark down their names, go 100ft (there should be markers, they might just be plain white signs(outside the polling location and then call your local county election office report it. Then call the Secretary of State election line. The Democrats should also have a line set up to report violations. \n\n- If you want to help prevent voter harassment, sign up to be a pollwatcher and keep a record of any violations. \n\n-If you are a naturalized citizen(or being honest, have a common Hispanic name), or prior felon you are especially vulnerable.  \n\n\nAlso, try to geta government photo id. They cannot ask you specifically for a driver's license.  \n\nDo not wear any clothing that can be construed as a political messaging in favor of a candidate or measure . It can be up to individual judges discretion, and if you're in an area that voted conservative in the last gubernatorial election- you've got a presiding judge not likely to be friendly. \n\n\nLastly,  if you have issues concerning your voter registration and are having trouble getting in contact with your election office and have tried all the resources I listed, you can contact me (as long as it's at least 6 weeks before election day) and I'll reach out to my contacts to try and get y'all taken care of.\n\nTldr: You need to check your voter registration 6 weeks before elections, because their next move is stripping people of their voters rights.",
    "title": "For all the Texan woman who plan on voting against the abortion bill ( a warning)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630742811,
    "score": 163,
    "keyword": "hispanic judge"
  },
  {
    "text": "I hate people * for the people that will argue about it in the comments you can fxck off. \n\nI’m so angry right now. I have no idea what word is worse than angry, but yeah whatever that word is. So for whatever reason, I couldn’t sleep tonight. Idk why, but I decided to go to Walmart from all places. As I’m shopping I see this trans woman buying her groceries. Normal, right? Normal to me. But I start to feel uneasy for her because I know where I’m at.  1. I’m in a racist ass Hispanic area and she’s not Hispanic. 2. She’s very tall. 3. There’s nothing but old school Christians around me. And maybe I’m biased but they always judge you head to toe.I keep an eye on her and everything goes well, until we get to check out. It’s nothing but non English speaking old ladies. This one lady pulls out her phone to FaceTime her friend and she’s like “omg look at this person”. Then a Walmart employee starts saying “that woman looks so weird”. And I can’t help it. Maybe it’s because I’m a part of the LGBT community. But I put these two ladies in their place. It was just so disgusting to watch. And I have no idea if this woman even knew what was going on, but I’ll be damned if I see an innocent person get shitted on for being their authentic self. Furthermore, fxck Walmart the security and the police saw everything happen and ignored it. It’s 2021 and humanity doesn’t even surprise me anymore. Ignore my language. I’m literally in my car crying because I hate how people are. The lady was just showing like a normal individual not bothering anyone. But no, someone always has to be nasty. I have no one else to rant to, so I came here. If this is in the wrong place, feel free to take it down.",
    "title": "I hate people",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1632539245,
    "score": 49,
    "keyword": "hispanic judge"
  },
  {
    "text": "How to bring up feminism issues in an effective and persuasive way to friends? And how do I (22M) continue to challenge my patriarchal biases? It’s taken me awhile, but recently came to the realization that I am not as progressive and open as I thought I was and I need help because I want to be more open and break my patriarchal biases that have been largely influenced by having grown up in a Catholic hispanic household. \n\nI dated a hardcore feminist for almost a year, and while I appreciate that I learned a lot from her (I am studying history and gender roles are interesting to me so was always was open to listening to her), it was almost all she would talk about to the point that she would try to get into these really intense conversations with people she had never met before (saying things like “men are trash” consistently). I get it. Men are trash, but constantly saying that to your boyfriend when meeting new people? She had previously pointed out that I talked way too much about history and everything bad going on in the world and I recognized she was right and I needed to let loose a bit which I did.\n\nSo how do we talk about these things? Do you think it makes sense to have these tough conversations with people you just met? I think it is counterproductive and we should ease into these conversations but I also don’t know because sometimes that doesn’t work and I just have to cut those people off who are sexist. \n\nWe aren’t dating anymore because we both needed to work on ourselves. The relationship ended poorly because of miscommunication and lack of understanding. I felt betrayed after she broke up with me and it was a huge blow to my self-esteem because it made me feel as if I was not good enough even though I had been trying super hard to change the way I thought and acted through therapy and actively challenging my perceptions/thoughts. While I think I’ve come a long way, I know I still need more time to eliminate any sexist beliefs ingrained in me. \n\nA few things that have helped me recognize and challenge my perceptions:\n\n- I questioned her sexual past and her choice of mates and was able to realize it had nothing to do with her and everything to do with my own insecurities (I had done this with my previous girlfriend and finally realize how fucked up this was). This was difficult for me to accept since in my experience I have enjoyed sex way more with partners that I have known first and developed an emotional connection with rather than a one-night stand.  Recognizing that I have to accept certain things and not judge has been huge coming from the super-judgmental fucked up nature of my Christian upbringing. I prefer to jack off than to have a one-night stand and don’t think that’s a male/female thing but more of a personal thing. Would like to hear more feminist thoughts on this because I am conflicted and don’t know if it’s the right approach. \n\n- I walked my ex through a time when she was sexually assaulted that she had blocked out from her memory subconsciously. This was difficult for me as my first time having sex I was also unconscious and taken advantage of. However, it gave me a huge appreciation for the strength that she had to make it to where she is today. Even if a guy is assaulted, I think the emotional trauma for a female is much greater on average. \n\n- I was an immature asshole who called her a whore a day after we broke up and then told her to go suck some guy’s dick she had been flirting with and touching in front of me. I realize I said these things to hurt her for having hurt me and it was slut-shaming that came from my own insecurities of feeling unworthy. While this was a few months ago already, it still haunts me and I came across article below that made me rethink and assess my behaviors. \n\n- The fact that women can reproduce virtually by themselves with no male presence is also a huge factor I think in challenging the patriarchy. Most men likely feel threatened by this and feel useless so they react (being less emotionally sophisticated) in poor manner and don’t know how to cope with this lack of traditional functionality of the male in society. Do we just tell other guys to fuck off? Issue is that a lot these guys are very good at manipulating girls into being with them even if they treat them like shit. How do we combat this as males? I challenge my friends but if they don’t want to hear it, all I can do is stop talking to them. How does that solve anything?\n\nThis article was interesting but I disagree in the only fear of bigger penises and think it’s more fear that they will go back to other guy. \n\n[Slut Shaming & Male Insecurity](https://medium.com/lilibetovesen/men-love-sluts-how-the-fear-of-bigger-penises-fuels-slut-shaming-f3268f2c197)\n\nTL;DR\nCatholic hispanic background. Challenging my patriarchal biases and exposing them to myself so I am aware. How do you talk about these things with people you just met? Should you? Or should you ease into conversations in social settings? How can I be more feminist as a young male in his twenties? What have females/males alike seen works in changing people’s attitudes toward feminism?",
    "title": "How to bring up feminism issues in an effective and persuasive way to friends? And how do I (22M) continue to challenge my patriarchal biases?",
    "subreddit": "Feminism",
    "timestamp": 1617823596,
    "score": 16,
    "keyword": "hispanic judge"
  }
]