[
  {
    "text": "Telling our own stories, and our short film 'Ella\" Hi there,\n\nMy name is Dan Chen, and I'm a director and cinematographer. You may have seen a post about our film \"Ella\" a few weeks ago, when we had just launched our Kickstarter. I'm happy to announce that we've reached our funding goal, and we're going full steam ahead!\n\nIn recent years, I recall a conversation I had with several other friends who work in film. We came to the conclusion that any American movie with an Asian protagonist would most likely be categorized as an \"Asian\" movie, or a special interest film.\n\n\"What if I wanted to make something like Dazed and Confused, but the main characters just so happen to be Asian American?\"\n\n\"It's still going to be an Asian movie.\"\n\nThe question stayed with me. Maybe I hadn't fully embraced my own race and identity yet. But I didn't want to make a special interest movie. I just wanted to make a movie.\n\nIt took a lot of inspiration to get to making \"Ella.\" Part of it was seeing artistic, successful minority representation in media, with projects like Master of None and Moonlight paving the way. Another factor was my friend Doug Kim, a producer on our short, writing and starring in a pilot we worked on together, which dealt with his real struggles as an Asian American actor in a courageous and comedic way. Finally, I realized that any character driven story needs to take race into consideration, just as it should explore sex, class, age, and other very real factors that affect who we are and who we become.\n\nIn my view, we can't wait for Hollywood to cast Asian Americans in an interesting, complex way, although putting pressure on them can certainly make them reconsider their actions. We need more Asian creators, just as we need more black creators, more Hispanic creators, and most obviously, more women of all kinds in Hollywood. Because these creators will understand the importance and significance of representation.\n\nPlus they'd have experiences and perspectives that we haven't seen yet. That's not just good social justice... that's good entertainment.\n\nSo this short film is my humble contribution (and if all goes well, the first of many contributions). I'd love support, critique, or sharing if you dig the project. We're currently going for our first stretch goal which would afford us the opportunity to hire a great casting director to help us find our second lead, who'd play a fourteen year old Chinese boy who's seeking acceptance in his small Midwestern town.\n\n[Ella, a new coming of age story in the Midwest](https://www.kickstarter.com/projects/dchen/ella-a-new-american-coming-of-age-story-in-the-mid)\n\nI'm glad to be a subscriber to the community, and look forward to sharing more dialogues and upvotes with ya'll.\n\ncheers,\nDan",
    "title": "Telling our own stories, and our short film 'Ella\"",
    "subreddit": "asianamerican",
    "timestamp": 1490220529,
    "score": 22,
    "keyword": "hispanic director"
  }
]