[
  {
    "text": "My principal keeps calling me the wrong name I’m a new teacher, this is my first year at a new school. I’m the only Hispanic/Latino teacher at this school. \n\n\nI’m pretty tan, but I’m half Greek on my dad’s side. So people will ethnically profile me and say my last name in their best *spicy* Spanish pronunciation/accent, and I might awkwardly comment that it’s a Greek last name. I don’t really care about that.\n\n\nIt’s a simple phonetic last name: 6 letters, 3 syllables. Not going to put my name online, but imagine a name like Nikias. It’s a rare last name so I’ll take any plausible pronunciation. I really don’t care.\n\n\nMy principal, however, keeps calling me by the same Hispanic last name. Think Lopez, Gutierrez, Flores, a very common Hispanic last name. The only thing it has in common with my name is the first letter. I’ve corrected her and she just said “sorry, English isn’t my first language. How about I call you Ms. [First Name]?” I said sure, but she never switched. She just keeps calling me the same wrong name. She calls me by the wrong name in front of students and coworkers, which causes confusion. She knows it’s wrong, I can see her pause before every time she says it.\n\n\nIt’s gotten to the point where it really pisses me off. This is the cherry on top of this stressful job. I have no union or rights at this charter school.\n\n\nI’m a very non-confrontational person, so I don’t know how to address this. I’d appreciate any advice.\n\n\nEDIT: I emailed the HR person at my school about it. She talked to my principal. I’m awaiting an apology from my principal through email.\n\n\nThe HR person also came to me and told me it wasn’t a racial thing (I stressed that it felt that way in the email) because the principal messes up the pronunciations of several other teacher’s names in the building. I’m still upset. There’s a difference between messing up pronunciation and calling someone by a completely different name.",
    "title": "My principal keeps calling me the wrong name",
    "subreddit": "Teachers",
    "timestamp": 1633553476,
    "score": 325,
    "keyword": "hispanic principal"
  },
  {
    "text": "Is it wildly inappropriate for a school employee to wear a “back the blue” shirt To me this is just a racist dog whistle. This person made this shirt so it says “school mascot” Backs the Blue. This person is Hispanic and an authority figure on campus. \n\nI’m planning on bringing it up to my principal.",
    "title": "Is it wildly inappropriate for a school employee to wear a “back the blue” shirt",
    "subreddit": "Teachers",
    "timestamp": 1618852964,
    "score": 142,
    "keyword": "hispanic principal"
  },
  {
    "text": "Principal assigned me to dual language... I'm not fluent. Edit: I should also include that I'm a 25F high school math teacher and last year I taught half my sections in algebra 2 and the other half in statistics. \n\nFor context I'm a now second year teacher about to start my second year at the same school in a few weeks. The school that I work at is about 40% Hispanic, with the rest of the population being predominately white. Its also important to mention that I am half Mexican (mestiza) with a Hispanic first and last name. I was never raised speaking Spanish and learned the language only through high school and college in which I've studied about 5 years collectively. \n\nAt the end of the year in May/June, my principal casually dropped the news on me that I would be assigned a section of dual language algebra 2. I had no prior warning of this and my immediate reaction was to say that I wasn't fluent and didn't know how I'd be able to teach the course. My conversational Spanish is enough to get by, but it's no where near the level of a native speaker. His reaction in turn was to kind of dismiss my worries and say that he'll make sure I'm supported to help me teach the class. \n\nOver the last few weeks of school, I desperately ran around and talked to a bunch of people including the union rep and my department head and they all had the same answer which was that he was within his rights to assign me that class, but that it did seem unfair. I also sat down with a 1-1 with him and told him that I did not have the Spanish to support the class, and while he listened and empathized, he ultimately needed me to teach the course because there are no other teachers who could support a dual language class. Also as far as supports that he had loosely promised, I found out that there really wasn't any since there was no dual language curriculum, no guaranteed bilingual EAs, nor any other teacher in the district who has done with course. \n\nI am now 2 weeks out from PD and I have never felt more anxious about teaching. I'm more scared than last year which was not only my first year but also the beginning of \"COVID schooling.\" While my principal did come to an agreement that he would be satisfied which however I handle the class, assuming I do my best to make it a dual language experience, I am terrified of teaching this class. I know my Spanish isn't good enough and it feels even more embarrassing considering that my name and face just scream \"Hispanic\", which is something I've dealt with my whole life.\n\n I'm at a loss with how to move forward and quitting isn't an option right now considering I have nothing else lined up and it's so close to the start. Anyone have any words of wisdom for me or even remotely shared experiences? I don't want this to be the thing that makes me hate my job or hate this school, but everything about this situation is giving me anxiety and making me dread the beginning of school.\n\nEdit 2: Thanks to everyone who was able to chime in and give advice. It means a lot to have the support and sympathy from many fellow educators. I just wanted to add that there seems to be a little bit of confusion on what dual language is in comparison to ESL. While I am unsure about other states/districts, where I'm at, the main difference is that ESL takes speakers of other languages and has the goal of building fluency in English while DL on the other hand is a program that begins at the kindergarten level and has the goal of achieving bilingual fluency in English and the target language. Students who are in DL are not always native speakers and are cohorted from kinder up through 12th grade. They are all usually fluent in English but have varying levels of fluency in the other language. While it's simpler to offer a 50/50 experience in elementary school, at the high school level, this balance is harder, therefore the program relies on immersion since there are usually fewer DL course offerings due to limited staff.",
    "title": "Principal assigned me to dual language... I'm not fluent.",
    "subreddit": "Teachers",
    "timestamp": 1629105036,
    "score": 57,
    "keyword": "hispanic principal"
  },
  {
    "text": "Transformation schools (low test scores) New teacher advice   Hi everyone! I'm entering my second year of teaching in Florida. I had a REALLY tough first year because of COVID and I was in a tough school with kids who had no respect for me or any teacher. They were all struggling with tough home situations and most of the parents were unavailable. The dicipline system was shit and the principal was a toxically masculine manipulater. Every day was hell for me and I'm still healing from the experience. \n\n  I'm trying to stay in teaching because I know it's what I want to do but I'm so scared of signing into a school that will be a repeat of the last. I've interviewed with four 5th grade positions (originally I taught middle school) and I'm excited to start elementary education (if I land a job). A lot of the schools in my area have very poor test scores. They're mostly rated 2/10 on the \"greatschools\" website. It's incredibly depressing to see the systemic racism trickling down into our school systems and it just feels like teachers are left to pick up the pieces of these broken homes catalyzed by our government. \n\n Every school with low test scores have high Hispanic/black populations. Poverty has an effect on the development of the brain (not irreversible but definitely something to be aware of). So these kids have much lower reading levels, problem solving, and higher order thinking skills. The brain is able to be molded and \"flexed\" but not to the standard florida expects of them. The schools keep pushing kids through grade levels even it they failed every class. \n\n  The kids at my last school would purposely do nothing all year and wait for credit recovery to get their passing grade. They didn't want to be taught. No matter how enriching I made the content. If I built a relationship with the student it would immediately crumble when I had to dicipline or put my attention on another student. They all CRAVED that attention and they would fight one another to receive it. Whether it was negative or positive attention. My classes had 25-31 students in a tiny room. \n\n  I was beyond stressed and depressed. I just want to teach but I don't have the skills to manage my classes yet. I know it will be better this year having learned what I did, but they overall problem is still there. The teachers at my last school were all just as stressed and disappointed in the school but they were badasses and could handle their classes without the help of admin. I'm a much softer and introverted person. I would use all the skills and techniques I learned in school which favored talking to each student when they have problems and building relationships. But EVERY student had a problem and when I would focus on one the rest of the class would get out of control. \n\n  Any advice on what I should do next? I tried setting up my own brand on outschool (online teaching) but I haven't gained enough traction to replace a full time job. I could get a part time job during the school year and keep growing my outschool brand? It would be nice to be home with my dog and disabled fiance. Honestly 9-5 jobs wear anyone down....",
    "title": "Transformation schools (low test scores) New teacher advice",
    "subreddit": "Teachers",
    "timestamp": 1627149572,
    "score": 2,
    "keyword": "hispanic principal"
  },
  {
    "text": "Growing as a Black Lady I’m not sure how to write this, but I’m about to move out of my white community that I spent the majority of my life in. I’m just beginning to see that a lot of the trauma I’ve experienced in life is from racist white people and systematic racism, and I’m  done. I think I just need to rant therapeutically.\n\nMy black parents moved to my area in the 1980s to escape the crack epidemic in the city before I was born. They were very “old school” to say the least. They tried to enroll my sisters in the local Catholic school, and the nun interviewing them asked them “Do you live in *insert only poor predominately black community in three counties here*?”\n\nThey weren’t sure what microaggression the nun was insinuating, but it rubbed them the wrong way. Around town one of the neighbors told my parents the local public school was actually the better option academically. So that’s where my sisters were enrolled. My middle sister actually made out decently, but my oldest sister had a hard time. My middle sister was actually crowned *Miss _*insert town here*” and almost went to the state beauty pageant. Never seen before or after in my town. They were both harassed by the school bus driver (who, years later saw the error of his ways and made sure I wasn’t harassed on his route). The school principal and teachers made a point of humiliating my oldest sister. When my sister brought it up to my parents, my parents said “well it’s not like they’re turning the hoses on you. Deal with it.” In their old-school mentality. My oldest sister is still in a cocktail of psych meds today from the abuse she received going through this school, including sexual assault. \n\nMe? Where to begin with me? I was the youngest in my entire grade and the only black child at a new school. The first teacher I ever had in elementary school husband was a reknown bigot in town, and said teacher tried her best to make sure I was held back. She never gave me any attention in class. Funny, to go to the next grade level I had to be tested (the deal my parents worked out with the school). The results came back that although I was the youngest in the grade-level, I was academically a whole year ahead of my classmates with just the equivalent of being at best ignored or regularly bullied each day. The way my parents tell it if it wasn’t for the teacher’s union the administration and Board of Ed would have fired her on the spot.\n\nUp until 8th grade it was pretty uneventful on the social front, I was still emotionally immature, but had a small group of girlfriends. Academically I was still ahead of most of my peers, but each year the bullying by the teachers became more and more intense. Could it be an emotionally younger student is an easier target? Sure, but looking back I think the teachers were looking for low-hanging fruit. Starting in 5th grade, I remember a teacher who liked to bully low-hanging fruit take me aside after another clique tattled on me and said meanly “there’s something wrong with you”. That stuck with me until I started anti-depressants a year ago and was my universal truth. \n\nEnter the guidance counselor. The middle school guidance counselor automatically had me slated as a “bad kid”. I was having a middle school girl fight with one of my girlfriends (truly over something petty). Looking back, I was probably beginning to experience symptoms of childhood depression around age 10 or 11. The middle-school guidance counselor threatened to call the police on me if I upset one of my girlfriends again. She found any excuse to drag me into the principals office (who was a level-headed man, he would just shoo me away within two minutes). 8th grade, there was a switch and my classmates became blatantly racist towards me. No one defended me. We had a new principal 8th grade and he enabled the bullies towards me. Looking back, I was not only depressed, but had begun to exhibit some symptoms of OCD. I had my first panic attack over these bigoted bullies when I was 13. I never told my parents as I was completely shut down and silent at home.\n\nEnter high school, long story short... more of the same. I was not accepted by my white peers, and the few other black kids at the school did not accept me because I was not “black enough”. During these awkward years I was pushed out of the closet as an lgbtq student. So, it truly felt like “we can’t dislike her because she’s black, but we can dislike her for being bisexual”. I was basically the school pariah. Did I mention when the white students came out of the closet they were elevated to popular levels? Some students were openly racist. Once again due to depression I was shut down and nothing was done about it. My OCD, Panic Disorder, and depression was severe in high school. My OCD came up in untraditional ways than cleaning and hand washing; rather I had scrupulosity, limerace, disordered eating, compulsive exercising, sexual OCD, verbally repeating words/sentences, thought cycling, maladaptive daydreaming, and excoriation disorder. Do you want to know what an obsession feels like? Imagine having intrusive, anxiety provoking thoughts on an topic ALWAYS. Sometimes it’s something average about work or school. Sometimes they are grossly inappropriate like socially-unacceptable sexual thoughts. Or anything in-between. Always. When you wake up, when you go to bed, during the SATs and GREs, at your grandma’s funeral. Always! You cannot turn that off. People don’t understand.\n\nWanna know what a compulsion feels like? You know that feeling when your having sex and you’re about to cum? That’s what the build up feels like. When you orgasm, that’s what engaging in the compulsion feels like. So, every time I engaged in religious rituals (my family was Catholic so it was hella easy for this aspect of my OCD to fly under the radar for a while), that I HAD to do or I was damned to hell, this is what it felt like. If I didn’t engage in a religious ritual, it was panic attack inducing.  That’s just ONE aspect of my compulsive nature. As an adult, I stay away from all organized religion. I’m very happy with this decision.\n\nThis was in the early 2000s. Even in my awkward teenage years I was intelligent, I knew something was “wrong”, but when I approached “safe” adults to say something was up I was told I was “looking for attention”. I tried to see my high school guidance counselor, but it became clear that she may have thought she could start an inappropriate relationship with me. She laughed off my concerns and enabled rumors that we were dating. When it got scary, I mustered up the little strength I could and told her to F off and never talk to me again. I was still shut down at home so my parents didn’t know what was going on. They also knew something was “wrong”, but instead of helping me get the help I need, they just screamed at me to “be normal” until a panic attack was induced. My parents would once again say “there’s something wrong with you.”\n\nStarting in college, at a PWI, I finally began healing and I was accepted for who I was. I went to therapy regularly and I truly bloomed.  \nI was still bullied by mean racist girls, but I had a circle of friends who would shut them down because it was the right thing. For the first time, my college had a multi-cultural club, and I had black girlfriends and I began to learn what it meant to be a black lady!\n\n\nThroughout my travels in life, I have consistently been rejected because I was either black or not black enough. I’m an educated woman with a successful career. I’m finally moving out of my racist white county. Is it weird that this is bitter sweet? Its gotten more obviously racist over the years. Trump flags are still up. Blue Lives Matter people are silent over the Jan 6 attacks, but the area is truly beautiful. If things were different I wish I could raise a family there. The cherry on top of everything is when another black family moved into town from a predominantly black area. As a good neighbor I went to say hello, excited to have someone else in town who looked like me. The family was very cold me to with the common look I get from some other black people of “not black enough”. \n\nThere are some very good people in this town. This may sound controversial, but a LOT of town cops and local state troopers made public statements during the BLM protests that “Black Lives Matter” over and over again. They marched with BLM, and were uncomfortable at Blue Lives Matter rallies. The whole community is taking steps to embrace inclusiveness and diversity. They are finally having real conversations. \n\nOne of the few things that came out of COVID-19 is that I started anti-depressants. My “old school” black parents were and still are highly embarrassed I attend therapy sessions, and told me my whole childhood that “only people in crisis go to therapy; only people with something wrong with them go on psych meds”. My life became clear and I found the strength to just leave. I realized how severe my Panic Disorder once when I began to take a PRN med for them every week and a half or so. That didn’t count the panic attacks I had behind a closed door at work or simple panic attacks that didn’t warrant a PRN. Since I was 13, I’ve been averaging 2-3 panic attacks a WEEK. I’m in my 30s... My therapist and my primary collaborated to add an additional medication last month, and for the first time ever the OCD symptoms, which have been notably decreasing since a year ago, (heads up they’ve always gone down little by little since talk therapy) went down significantly in the past month. It was like before I could only walk a mile, and out of nowhere I could run a marathon. I still have work to do in that area, but I count my blessings. \n\nHowever, the bigots are getting louder and louder. If you have guessed where I’m from yet, a local politician recently gutted a local anti-hate bill to only list BLM and Antifa as hard groups (if I understood the controversy correctly). A part of me wants to stay and fight for the town I love, but I think this just may be some sunk-cost fallacy. There are maybe four people in my town who I’m going to keep in touch with. This place is not good for my mental health, which is an ongoing project to heal. The area I’m moving to is far more diverse, mix of black, white, and Hispanic. The community over is predominately Indian, black, and Hispanic. For the first time in a long time, I feel like I fit in in my new community. Where I don’t stand out like a sore thumb just for having more melanin to white people; where I’m not teased for speaking the King’s English to other Black people. I love that feeling.\n\nWhat should I do next? I like what I do at work, but I think it’s time to take the next step in my career... also, I hate being one of the only black people as high up as I am in the company (1st world problems, I know)... I really want to find a company that is more diverse. Should I join the NAACP? Links? Or should I just be me and know I’m exactly where I should be in life?\n\nI don’t know... I’ve never been around a large group of black women in my life (the group of black girlfriends I had, though healthy and fabulous, was small). Have any of you ever experienced any of this? What do you recommend the next steps be as a strong black woman on my life journey?",
    "title": "Growing as a Black Lady",
    "subreddit": "blackladies",
    "timestamp": 1613871236,
    "score": 26,
    "keyword": "hispanic principal"
  }
]