[
  {
    "text": "Should I cut my hair? 27 Male. I've been struggling to find a job lately. I have shoulder length hair, it's kind of frizzy and curly. I don't have a college degree, so most of the jobs I apply for are delivery jobs, production/warehouse, food service. For interviews, I wear nice dress pants, appropriate shirt depending on the job, and I comb my hair and make it look as nice as possible, but I still let it be free and don't do buns.\n\nI've gotten some food service jobs like this without a problem. They just make me wear a hat. Most people who have these jobs are artists/weirdos like me so they understand that.\n\nI didn't get a job packaging chocolates, even though my phone interview went really well, and so did my in person interview. I suspect it was also because it was 99% white women working there (like +20 of them), and because she asked me what my race was when I was leaving (I'm hispanic).\n\nI also blew a barista interview. We only sat down for like 3 minutes. I became self-conscious and quiet and couldn't think of things to say. The reason for this is because it was a tiny coffee shop and there were customers RIGHT next to me.\n\nI also didn't get a job packing joints even though my interview went really well. It's a super simple job, so my self-esteem and wallet are crying.\n\nAfter a lot of failed attempts I'm starting to feel self-conscious about my race, and I suspect that a lot of people are racist but I'm not sure if that's the reason. Maybe it's the hair! Ha. I've only lived in this city for a year by the way. I had no problem getting jobs in Seattle. My accent is barely noticable and I communicate clearly.\n\nMy resume could be better, but I was a lead driver in my last job, in charge of giving orientations, hiring, and supervising. The rest of my resume is from working at Starbucks, and another coffee shop from when I moved. I also include that I am self-employed at the very top, but I'm a struggling web developer (learning) so my only clients are family that are patient with me. Should I take that out? I did have one pizza place that liked that I made money on the side, but unfortunately I had to quit that job because that same manager had a mental breakdown and my training was awful so I quit.\n\nI'm getting brand ambassador / marketing experience lately from working at events 2-3 times a month, so I should add that to my resume too, and maybe I can get a job related to that field.\n\nAnyway, I know it's hard to pinpoint why I can't get a job, and now the hair thing seems irrelevant, but maybe I should cut it. I just really don't want to cut my hair. I'm in love with it.",
    "title": "Should I cut my hair? 27 Male. I've been struggling to find a job lately.",
    "subreddit": "jobs",
    "timestamp": 1498797082,
    "score": 7,
    "keyword": "hispanic manager"
  },
  {
    "text": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this. Background: I work in a city hospital that serves a very impoverished minority population . Our Institution isn't exactly stellar  , so except for Radiology and Surgery most of our residents and staff are FMGs or IMGs.  Me (FMG) and my posse ( Mostly FMGs)were doing our rounds. Being a Sunday , out team was providing cross-coverage and we had a lot of patients to round on. \n\nWe make to the ED to examine a patient who had come in with shortness of breath and  diagnosed with a PE. The patient was a black transgender patient. She had been in the ED for a couple of hours \n\nThe moment I stepped in the room my spidey-sense started tingling. Started off rough enough \" who are you ? why Are you here ? Why are  you rounding so late?.I'm short of breath\" ( while screaming at the top of her lungs).  Ma'am . I had 30 patients. i needed to prioritize , but you have my attention now . \n\nShe explained that she was basically ignored by the nurse ( which was true - was not hooked up to telemetry or SO2 monitoring ).\nI apologized to her and told her I would talk to the nurse and that she should take it up the charge nurse. So far nothing usual. \nThen she went off on a tirade  .\" My mother worked in this hospital ,I also worked in healthcare . Used to come here sometimes until I started getting my care in  *Brand name * Hospital . This hospital was  much better run when we had Real American Doctors, not all these foreign doctors.\" She repeats this stament verbatim again during the course of the encounter. \n\nNow my interns and resident are visibly disturbed. But she goes on . About how her usual hospital is much better.  I then remind her BTW, I'm also foreign ( my phenotypic  ethnicity is ambiguous- on a good day I can pass off for Hispanic/Italian . I was called \" white trash \" once ).\n\nIn order to diffuse the situation , I agree with all her comments. I  put in a few negative comments about my own hospital( I find this works very  well to calm down a an angry patient/family )  This eventually calms her down , and I manage to get a coherent history and physical exam.\n \nBy the end of the encounter I tell her \" Ma'am, I'm sorry you couldn't get a real american doctor today \". She then suddenly becomes apologetic.  \"Oh, I didn't  mean all foreign doctors are bad . Just like the cops you have good ones and bad ones  . You all have been very professional . \"\n\nI shake her hand and the encounter ends.\n\nI don't know how to feel about all this. My training tells me that the outburst was probably a reaction to the stress of being in a hospital and mistreatment by the ED nurse. She did apologize in the end ( cant vouch for the sincerity of it  though ) . She herself belongs to a very marginalized group ( Black M-to-F transgender ) but had no qualms or second thoughts about espousing xenophobic comments.  \n\n Throughout  my training I've been on the receiving end of irate patients .But this encounter left an especially bad taste in my mouth. I guess the fear of \"the others \" is a very primal urge. And all these civilities are just veneers on a underlying tribal  mindset. \n\nAt least I can watch the WWE Summer Slam tonight and get my mind off this .\n\nAnyone else here had similar experiences ? How would you debrief your residents/interns ?",
    "title": "Xenophobic-ish comments from a minority patient . Not sure how to feel about this.",
    "subreddit": "medicine",
    "timestamp": 1503260107,
    "score": 36,
    "keyword": "hispanic manager"
  },
  {
    "text": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office So l worked in an all female workplace. I was marketing and communications manager for a nonprofit with a staff of 11. I did social media, desktop publishing, graphic design, web, light IT, anything to do with marketing. The new black female ceo came in and harassed me about everything she could take issue with like being \"intimidating\" because I'm tall. \n\n\nAfter three years of exemplary performance under the previous ceo they eventually fired me for leaving work 15 minutes early and called it \"job abandonment\" and denied me unemployment and hired a female to replace me. She lasted a few months since she couldn't do the job and they hired another woman I went to school with who was totally incompetent. \n\n\nI tried to get out before the fired me since I knew they were trying to pressure me out. I interviewed for a similar position at the nearby university but they hired one of my boss's middle age Hispanic female colleagues over me and the black female who interviewed me told my boss I interviewed for the spot. The Hispanic female they hired instead of hiring me called me a week later to ask me \"how to do what I do.\" Of course there was no reason for me to teach her how to do a job she should have known how to do to get hired in the first place nor could I teach her in a phone conversation what took me years of work and study to learn. They fired me about a week later. \n\n\nIncidentally I set up my email to forward to the new ceo before I was removed from the system after asking on my way out if they wanted me to do that as we had with other employees who had quit and they said yes then the new ceo called the police because I was \"harassing her\" with thousands of emails...from a company account I was not in control of that was set up to forward under her instructions. Because of my job I handled dozens of accounts for various platforms and software and got probably 100 emails a day, like analytics reports and such. My favorite part was near the end when her Outlook needed to be fixed she left the calender open on the desktop and it said \"make [myname] f up\" for a day that week.  \n\nThen she trashed my name all over town so nobody would hire me. I tried to be a stay at home dad and my wife and I broke up. Haven't seen my kid in 3 years. Thanks for making the workplace more diverse. I used to be a liberal.",
    "title": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office",
    "subreddit": "MensRights",
    "timestamp": 1497839644,
    "score": 72,
    "keyword": "hispanic manager"
  }
]