[
  {
    "text": "There Are Only 23 Black Owned Banks Left in America > Black-Owned Banks Hit Their Peak a Century Ago \n\n> In late 19th and early 20th century, 57 black-owned charter banks entered the system\n\n> Black-owned banks arose and flourished in a period when African-Americans were kept out of other financial institutions, both overtly and through practices that effectively walled off their neighborhoods from other banks.\n\n> The sector hit a peak in the late 19th and early 20th century, a period when 57 black-owned banks and credit unions existed. \n\n> Six CEOs of black-owned banks locked themselves in a New Orleans conference room for more than a day in late 2016. Surrounded by papers, drawing boards and PowerPoints, the group strategized ways to reverse a trend 15 years in the making: the decline of their own banking sector.\n\n> The number of black-owned banks operating in the U.S. has been dropping steadily for the past 15 years and fell to 23 this year, the lowest level in recent history, according to the Federal Deposit Insurance Corp. That has left many African-American communities short of access to capital and traditional financial services, according to some banking experts.\n\n> “We have a crisis among black banks,” said Doyle Mitchell, CEO of Washington-based Industrial Bank. “We met…to save the industry. To save ourselves.”\n\n> The 2008 recession hit the black banking sector especially hard, and if the current rate of closures of about two a year, as well as the industry-wide reluctance or inability to start banks, continues, black-owned banks could disappear entirely within the next eight to 12 years.\n\n> The trend is worrisome to some analysts who argue fewer banks serving low-income, minority groups could expand “financial deserts”—communities with few or no banking institutions—and increase the likelihood that black and Hispanic communities could become susceptible to redlining, a discriminatory practice that excludes poorer minority areas from financial services.\n\n> “These banks are banks that serve relatively poor neighborhoods,” said Russell Kashian, an economics professor who studies black-owned banks. “There are neighborhoods that if…the black-owned bank isn’t there, nobody is there.”\n\n> Most black-owned banks typically have a few branches in one city, although one of the category’s largest players, New Orleans-based Liberty Bank, has a multistate presence. Such banks comprise just a sliver of the overall U.S. financial sector, with collective assets of $5.5 billion, versus $16.3 trillion in the industry overall.\n\n> As a result, some economists question the significance of the sector’s decline. “Size-wise they’ve been small,” said Nicholas Lash, a business professor at Loyola University Chicago who studies minority banking. “So their total impact on black communities can’t be very, very large.”\n\n> Yet those who live in communities that have been served by black-owned banks say the impact there, both practical and psychological, is deeply felt. The most recent example is in Chicago, where Illinois state regulators in January closed Seaway Bank & Trust, determining that its financial health had so deteriorated that pumping in more money couldn’t save it.\n\n> “It was like air coming out of a balloon,” said Bob Fioretti, a former Chicago alderman who was previously involved in raising money to keep Seaway open. “People were deflated. Seaway was a standing icon of the community.”\n\n> Seaway, formerly Chicago’s largest black-owned bank, helped anchor the famed black business community on the city’s South Side.\n\n> Claire Adams, a former board president of a South Side Chicago housing community that was one of the first businesses to use Seaway when it opened in 1965, said she now fears that with fewer small, community banks in her part of the city, payday lenders and check-cashing institutions, which often charge exorbitant rates and fees, would be many African-Americans’ only nearby banking option.\n\n> “The only thing that’s left are these predatory institutions,” Ms. Adams said.\n\n> In some areas of the South Side, Seaway was the first bank some African-Americans had access to, making it a symbol of black enterprise and economic development, patrons say. Many speak of the bank with admiration, often mentioning a program that allowed children to open a bank account with a small amount of money.\n\n> “I [could go to] Chase or something…but I like Seaway,” said Nell Robinson, who has used Seaway for more than two decades. “Seaway was here before Chase. It’s a black bank [and], we have to pull our people up.”\n\n> With such concerns in mind, members of the South Side’s religious community raised more than $100,000 in deposits for Seaway in 2016. But the effort wasn’t enough. Seaway was sold to the State Bank of Texas, then sold again to North Carolina-based Self-Help Credit Union.\n\n> A prolonged period of low interest rates and intense competition, as bigger banks slowly move into underserved areas, have combined to contribute to the black banking sector’s decline, even after the recession’s end. Now a practical concern in Chicago and elsewhere is that, even if bigger institutions step in, they won’t be as accommodating in lending to black-owned businesses.\n\n> A survey of entrepreneurs by the U.S. Census Bureau in 2014 found that 47% of black business owners had gotten the full amount of funding requested from banks, credit unions or other financial institutions, compared with 76% of whites.\n\n> That survey also showed fear of rejection was the top reason cited by black business owners who chose not to seek needed capital at all.\n\n> “When I have an applicant that comes into my bank and comes into XYZ large bank, and they’re on the edges, there are things that I can understand and appreciate about their situation that XYZ large bank won’t, and that makes the difference,” Mr. Mitchell, of Industrial Bank, said.\n\nI feel like we have to do whatever we can to keep these financial institutions alive man. Some of these banks & credit unions have been serving us and our communities since before integration. No way we should let them down now by continuing to take our business to people who don't care about or respect us. \n\nI have an account w/ Industrial Bank here in DC which is black owned in fact it was my very first bank account ever. My parents are the reason for this, and I'm proud to say I still do business with them to this day.",
    "title": "There Are Only 23 Black Owned Banks Left in America",
    "subreddit": "blackladies",
    "timestamp": 1503677750,
    "score": 87,
    "keyword": "hispanic ceo"
  },
  {
    "text": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office So l worked in an all female workplace. I was marketing and communications manager for a nonprofit with a staff of 11. I did social media, desktop publishing, graphic design, web, light IT, anything to do with marketing. The new black female ceo came in and harassed me about everything she could take issue with like being \"intimidating\" because I'm tall. \n\n\nAfter three years of exemplary performance under the previous ceo they eventually fired me for leaving work 15 minutes early and called it \"job abandonment\" and denied me unemployment and hired a female to replace me. She lasted a few months since she couldn't do the job and they hired another woman I went to school with who was totally incompetent. \n\n\nI tried to get out before the fired me since I knew they were trying to pressure me out. I interviewed for a similar position at the nearby university but they hired one of my boss's middle age Hispanic female colleagues over me and the black female who interviewed me told my boss I interviewed for the spot. The Hispanic female they hired instead of hiring me called me a week later to ask me \"how to do what I do.\" Of course there was no reason for me to teach her how to do a job she should have known how to do to get hired in the first place nor could I teach her in a phone conversation what took me years of work and study to learn. They fired me about a week later. \n\n\nIncidentally I set up my email to forward to the new ceo before I was removed from the system after asking on my way out if they wanted me to do that as we had with other employees who had quit and they said yes then the new ceo called the police because I was \"harassing her\" with thousands of emails...from a company account I was not in control of that was set up to forward under her instructions. Because of my job I handled dozens of accounts for various platforms and software and got probably 100 emails a day, like analytics reports and such. My favorite part was near the end when her Outlook needed to be fixed she left the calender open on the desktop and it said \"make [myname] f up\" for a day that week.  \n\nThen she trashed my name all over town so nobody would hire me. I tried to be a stay at home dad and my wife and I broke up. Haven't seen my kid in 3 years. Thanks for making the workplace more diverse. I used to be a liberal.",
    "title": "Just typed this out on another thread thought I would share, my experience being hounded out of an all female office",
    "subreddit": "MensRights",
    "timestamp": 1497839644,
    "score": 71,
    "keyword": "hispanic ceo"
  }
]