[
  {
    "text": "Senate confirms Margaret R. Guzman first Hispanic judge to Massachusetts federal court | 🥂 a good one to start the day, cheers to her an all the people that made it possible 🥂",
    "title": "Senate confirms Margaret R. Guzman first Hispanic judge to Massachusetts federal court | 🥂 a good one to start the day, cheers to her an all the people that made it possible 🥂",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1677754234,
    "score": 81,
    "keyword": "hispanic judge"
  },
  {
    "text": "I don’t feel black enough So, at night, I always find myself overthinking, haha. Right now, I'm reflecting on the fact that I don't have any black friends. Most of my friends have been White or Hispanic. Don't get me wrong, I absolutely love being black and cherish our culture. However, as a 19-year-old from the younger generation, I struggle to connect with other black women, especially those I encountered in school. I remember one particular black girl from high school who seemed to dislike me for no apparent reason. Now that I'm in college, I'm actively trying to make black friends. Unfortunately, it hasn't worked out yet, and I a group of friends, but yet again I’m the only black girl in it. \n\nGrowing up, I lived in the suburbs, and my mom often considered certain things as 'ghetto,' like lace front wigs, specific braids, or even Jordans, etc. She also preferred me to have white friends. I believe this is where the disconnect stems from. But, honestly, I just want to make friends with other black women without being judged for enjoying things that are stereotypically associated with 'typical white girls.' I hope you understand that I'm not coming from a place of ignorance, but rather a genuine desire for connection.",
    "title": "I don’t feel black enough",
    "subreddit": "blackladies",
    "timestamp": 1695456306,
    "score": 107,
    "keyword": "hispanic judge"
  },
  {
    "text": "Connecting Hey Reddit! I am a Hispanic woman who grew up with my black mother and white step father (bio father is Hispanic) but was never allowed to learn about my culture. Now as an adult(barely I’m 20 lol), I feel so lost as to who I am and just wanna learn and be a part of my Hispanic culture. I guess my question is how and where do I start? What kind of events can I attend? Learning new languages is hard for me (I speak English and French) but I’m willing to learn to feel more connected. I listen to Spanish music and one of my favorite musicians is gonna be in my home city in 2 months and I really want to go but I’m worried I’ll be judged for not being fluent enough. Any and all advice is appreciated. I think I just need a little courage.",
    "title": "Connecting",
    "subreddit": "Hispanic",
    "timestamp": 1694830039,
    "score": 0,
    "keyword": "hispanic judge"
  },
  {
    "text": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones Historically men have always been the problem-solvers for most of human existence. Men have always been counted onto to be problem-solvers because for the most part because we are hardwired to detect what is wrong with our environment or location. So I feel like when the industrial revolution came about to be, society counted on us to be not only problem-solvers, but also example-setters, the role models, the innovators, in other words, historically men fought tooth to the nail to try to make the world a safer, healthier and more stable place\n\nSo when the Industrial Revolution came to be, this put more pressure on men to be even more ''advancing'' and ponderous on to the grid and infrastructure of society, so we naturally have inclined to depend on men not only for advancing society, but to be the prime example-settlers for people to follow. I think that might be part of why we put so much pressure on men to be established and groomed by a certain age, where as women don't face those very same productivity pressures. I mean sure obviously people will judge a woman if she's being what they call a ''leech'' on the system, but for the most part what I am saying is they don't really get hit with the memo of hustle culture to the same degree men do, no one is going to judge a woman for working at McDonald's more than her being a nurse, but for a man that implies lack of intrinsic worth and respect and a good work ethic.\n\nI noticed this also disturbingly amongst ethnic minority male groups, whether it is the ''trabajador'' culture in the Hispanic community or the ''Be a baller'' mentality in the black community or the Silicone Valley Techie trope in the Indian community, I think those pressures are even more pronounced among men of color, but gonna try to refrain from over-emphasizing, I think you get my point though.\n\nBut this is also mostly used against working-class men, for example no top CEO in a fortune 500 company is gonna be told that their hard work doesn't pay off, even if they ended exploiting the resources along the way.\n\n&#x200B;\n\nI believe this to be a men's rights issue because since the working class consists mostly of men, this keeps the average man in the trenches",
    "title": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones",
    "subreddit": "MensRights",
    "timestamp": 1682608588,
    "score": 19,
    "keyword": "hispanic judge"
  }
]