[
  {
    "text": "Unsatisfying Update on Bad Sub Last month I had a bad sub. He made fun of a student with ADHD, saying she was stupid and so were her parents. I had suspected he singled her out because she dresses very male (but still goes by female pronouns.) I did get confirmation of that later. (He also apparently told her she was a boy and referred to her as a him.) \n\nStudent wouldn't follow up on it and admin told me they wouldn't without the student's involvement. Whatever. He was signed up for one more sub job with me.\n\nI prepped my kids ahead of time, and thanked my stars he was only getting about 7 students with disabilities throughout the day. (As opposed to 30 on my alternate day schedule.)\n\nHe lost his temper with my biggest class. (I do, all the time. So I get that.) He apparently was reluctant to give anyone the work. (Which is why, for my Gen Ed class, I named a student specifically in charge of materials, telling them where the work was and what it'd be.) For my intervention classes I wrote the assignment on the board. He apparently assumed students read it and knew what they were doing. Fair enough.\n\nExcept.\n\nHe didn't read my sub plans. You know how I know this? Because I put in bold, huge font, that he needed to read them because of some specific things happening that day. He was apparently surprised by the lockdown drill, but handled it well. (I asked a non teacher staff member to check on them during the lockdown drill.) And he gave my student who literally can't read, or write beyond his name, the same assignment as everyone else. The assignment to read 10 pages of a 700l text and answer 10 questions. The kid did his best. (I left an alternative assignment more appropriate for his level.) \n\nAnd he called one of my hispanic students \"El Chapo\" and asked if he had his citizenship papers. \n\nMy kids actually do want to do something about it this time, and it's a good lesson in activism, which is our current unit. \n\nI just emailed the principal and got one student to write down what happened. I'm asking for more from some of my better writers.",
    "title": "Unsatisfying Update on Bad Sub",
    "subreddit": "Teachers",
    "timestamp": 1550177421,
    "score": 78,
    "keyword": "hispanic principal"
  },
  {
    "text": "New Principal Worries and a Rant We have a new principal. This is a regular occurrence at our school. I have very little faith in principals in general - they often cause more problems for teachers than they solve in my experience. \n\nListening to new principal's first speech, three things were very strongly implied:\n\n1) New principal believes that teachers working extra long hours beyond contract time is just how it is because teaching is a calling (one that the principal was called to then moved on to admin, hmm...) \"no excuses\" \"just get it done\" \"teachers lose a lot of family time\"\n\n2) New principal is very religious and says god called them to our school (we are a public school) and they believe this means they will be the one to fix us \n\n3) New principal seems to believe that our issues will be solved with more accountability, \"proof\" \"evidence\" and \"data\" to show we are doing our jobs, and \"cultural awareness training\". \n\nNone of the above makes me more confident that this is going to be a good, or even better year than the last. I do not appreciate being told that teachers \"just know\" we don't get paid for all the hours we work, or that we had better be able to prove we are making the school a better place, or that my professional job is a semi-religious calling, or that we're probably being racist when we write referrals (implied, not explicitly said) because our data shows that in our 60/40 split white/minority school that white kids get less referrals (but still a large amount!). \n\nBe warned - the rest of this is a rant on the last point. \n\nOur school lines are drawn around an affluent neighborhood of mostly white kids, and a large swath of underprivileged neighborhoods of black and hispanic families. The poor white neighborhood in our district is on a line that is split with a neighboring school district, so our white student population is skewed to the well-off families, with two parent households, a stay-at-home parent, a lot of family support, and less behavior issues (I was honestly surprised, given this fact, that our white rate of referrals was as high as reported). I've also worked in a school district that was at least 90% white, mostly poor kids, and they had the same behavior issues, because most of it is a childhood trauma and poverty issue, NOT an issue of teachers wanting to write up the black and brown kids, or ignoring bad behavior of white kids. No teacher likes writing referrals, and everyone I know avoids it at all costs! But at a certain point, you have to remove the kid that is keeping everyone else from learning and causing a disruption, or cursing you out, or flat out refusing to follow a rule (for example, taking a video call in the middle of a class discussion and when told to put up the phone, talking louder, and telling the person on the other end how stupid the teacher is). \n\nIt is not our faculty's fault our school lines are drawn in a way that highlights the racial divides in our city, especially in the data related to behavior issues and grades. There are plenty of poor white kids who are friends with black and hispanic kids, but apparently they don't exist. Today I was told the white and black kids in my school don't associate with each other, despite seeing plenty of evidence with my own eyes to the contrary in my classes. The divide is mostly socioeconomic, and yes, many of the rich white kids aren't friends with the poor kids, many of whom are not white. However, plenty of them are friends with the middle class and wealthier minority students - I see them walking through the halls with linked arms every day! \n\nAll this to say, I don't trust the new principal, and I am concerned the district is going to actually make morale and the school culture worse by the way they are addressing racial issues in our school. It's one thing to remind teachers to be careful that they are not favoring or appearing to favor one racial group over another in discipline, in classroom cultural references, historical references, and to strive for equal representation, etc. It's another to ignore how racism over decades has shaped our community into socioeconomic and racial divides, and blame data that looks bad on teachers being racist.",
    "title": "New Principal Worries and a Rant",
    "subreddit": "Teachers",
    "timestamp": 1565655476,
    "score": 43,
    "keyword": "hispanic principal"
  },
  {
    "text": "This is what supportive admin is like?! At my school we have a high population of Chaldean families. I’m used to high Hispanic and Asian populations but this is a new experience for me. We have a parent support person who is also Chaldean to help with translation and to help us get across what we want to the parents since some parents may speak English, and act like they understand us, but they really don’t. \n\nAnyway, I have a student who is showing signs of just outright defiance. I teach first grade and want to try and nip these ASAP not only for myself but for his future teachers. He’ll argue about things I ask him to do or not do, he’ll argue or question when I do seat checks on the carpet, tell me “but it’s not bad!” Or “but it’s just fake!” When he continuously bothers a kid who has asked him multiple times to stop. He also won’t complete his work unless I’m standing there watching him.... but he’s capable. I’ve tried positive reinforcement, consequences, more brain breaks, etc. You get the idea. We all know those kids. \n\nI had a brief conversation about him with our parent support person yesterday and went to see her during one of my prep times. She called his mom right then and there and flat out told her how unacceptable this is. Not only that, she TOLD HER how she is going to handle this in terms of at home consequences. I know you’re probably thinking that that’s over stepping, but 1) it’s their culture to be this firm and direct, and 2) mom has said in the past that she doesn’t know what to do with him because his older siblings are very different from him and well behaved. Not only that, she also mentioned if he doesn’t get it together, our principal will be calling because she takes this stuff seriously. \n\nI was in shock. At my last school I would’ve had to deal with it alone. It’s a good feeling to feel supported, and not questioned when I say a behavior needs to be dealt with outside of the classroom as well.",
    "title": "This is what supportive admin is like?!",
    "subreddit": "Teachers",
    "timestamp": 1568778192,
    "score": 23,
    "keyword": "hispanic principal"
  },
  {
    "text": "I have a student who has extreme behavior problems and I am not sure if I am doing the best for him. Hi everyone, thanks for reading my post! (It’s really long, I’m sorry!)\n\nI’ve been working with elementary aged kids for about three years and this is my first year as a kindergarten teacher.\n\nI love my class but it’s a very tough class. The principal has even said it’s a class “filled with bad apples.” I came a little late in the year (mid September) and the previous teacher had no established routine. \n\nIt was chaos! But I immediately implemented a lot of routines and rules to shape them up and they are coming along. However, I have one student that comes from a neglected home and missed a whole month of school. This student is easily triggered by transitions and when things don’t go his way. \n\nUnfortunately, I work in a small private school in a Hispanic community. Their approach for discipline is yelling, threatening, and grabbing the children to put them in their place.\n\nI am a firm believer that yelling doesn’t help. It just instills fear and they never respect you. I refuse to do it—and it’s hard not to, I admit, because my students are used to this method and only take things seriously when teachers yell. \n\nBecause all of that, discipline has been a hard process. They are finally understanding that it’s not a screaming match that they will get if they make a mistake, but loss of privileges like markers and free time. \n\nBut again, this student has missed a whole month. My co-workers encourage me to just be tough, but I don’t agree with their way. Here’s what I’ve done so far:\n\n- Explain the schedule every morning to the class so everyone (and especially him) are reminded of all the activities and their time. \n\n- Give my class warnings to when the activity ends. “5 minutes left!” “1 minute!” And it ends with a “30 second” count down where they clean up and sit at their tables. This is a hit or miss with my student. Sometimes, he finishes up, and sometimes he refuses, ESPECIALLY IF IT’S ART. For all my students who don’t listen right away, I say “Can you please put the markers (or other item) away?” And if they refuse, I then say “You can put it away yourself or I can take them from you. Remember, you won’t use them again if I take them from you.” Then I give them five seconds. The five seconds work for all my students except him. This results me in taking it from him and he has a melt down which I’ll talk about more in a second. \n\n-  I give him responsibilities. “Can you pick up all the markers?” This will help him be more inclined to move  on from activity. Sometimes I can’t always do it because he will be doing something wrong like throwing stuff around or getting up from his seat and I don’t want to reward him. Instead, I’ll choose a student who’s modeling good behavior and point it out to the entire class.\n\n- I recognize his efforts every time. I make sure to let everyone know when he’s modeling good behavior, I give him rewards at the end of the week, and etc.\n\n\nI do all of these things in hopes it’ll decrease the chances of his meltdowns. I want to believe that it has but when he does have them, they are very extreme.\n\nHe falls to the floor and kicks everything in sight. Tables, chairs, students, and me. He has grabbed chairs and thrown them at students. He yells at the top of his lungs and just sobs miserably.\n\nThe main two specific triggers is when I tell him to put the markers away or if he doesn’t get a reward when someone else does. For example, on Fridays, if you have achieved outstanding behavior throughout the week (I have a chart), you pick something out of the treasure box. He didn’t reach that point (but he was still in the criteria to get a candy, usually the whole class is) and failed to understand why that was no matter how many times I talked to him about it.\n\nWhen his meltdowns occur, the class is interrupted. I fortunately have an assistant that helps tremendously. His tantrums occur usually towards the end of the day where the kids go to recess and then aftercare. This usually leaves me alone with him.\n\nIf he’s just crying on the floor, I ignore him. I grade papers or continue my class if I’m still with the rest of the class. But if he’s throwing things, I embrace him.\n\nI know that sounds weird. I sit on the floor behind him, pull him towards me, and cross his arms across his chest. I just hug him and hold him there. If I don’t, he flings chairs and sometimes he hurts himself.  \n\nDuring this, he just cries and squirms but ultimately he just gives up and calms down—this can take 10-15 minutes. When he calms down, I finally talk to him. I tell him “it looks like you’re ready. Want to talk? What’s going on?” He rarely answers. If he’s uncooperative, I just ask if he wants to proceed to next activity. He usually nods. And things just resume! Today was the only day that I had to pick up from the floor and carry him to aftercare. He didn’t resist being picked up and actually calmed down when I did. (I picked him up because he wouldn’t get up on his own.)\n\nThere are some things to take in consideration. It’s first week back, he has no routine yet. (But this behavior has been going on since Pre-K.) He is a neglected child. His mom picks him up at 10 PM, drops him off at 6am. He also doesn’t bring lunch and doesn’t eat the school food. He STARVES all day. I’ve considered bringing him snacks. \n\nTeachers of reddit, please help. I know this was a long post but I don’t know if what I’m doing is right. Should I just not touch him at all? Just keep ignoring him and just moves tables and chairs away? I don’t want to send him away to another class, I want to be able to this. Regardless of all of this, we have a great relationship. He gives me a lots of hugs and drawings, and always want to sit next to me during circle time. I think there is still a chance. \n\nThanks everyone!",
    "title": "I have a student who has extreme behavior problems and I am not sure if I am doing the best for him.",
    "subreddit": "Teachers",
    "timestamp": 1570845947,
    "score": 8,
    "keyword": "hispanic principal"
  }
]