[
  {
    "text": "Advice for an Unfulfilled Entry-Level Job Hopper I apologize if this belongs anywhere else. I don't ever post to reddit, but I think I'm at a sort of crisis point and could really use any input. It's a long post, I know, I just have a lot to unpack. \n\n&#x200B;\n\nThis issue is a lot deeper than the title suggests, but I think the title summarizes the core problem well enough. The short of it is: I don't have a formal education, I've worked entry-level positions all my life, and I feel incredibly unfulfilled (and therefor go through cycles of melancholy). I'm afraid to go back to school because the only way I can is through debt. I also must work full time to pay my bills and rent, so I won't have much time to devote to good grades even if I do accept the debt. I know working full time and going to school is possible, but I'm not confident in myself that *I* can do it. And even if I did accept the debt and try my best to get good grades, I don't know what I'd go to school for or if it would even be worth it.\n\n&#x200B;\n\n**Background:**\n\nI (25M) dropped out of college a year and a half in when I was 19. I was convinced my passion at the time - literature, poetry, editing, and creative writing - were dead-end, useless fields to pursue. So, I told the counselors I enjoyed helping people and that I felt relatively confident in social situations. I was put on the Social Worker track, but I felt I didn't have the strength of heart to bear that sort of field. \n\n&#x200B;\n\nMy grandmother passed away shortly before I dropped out, and as I was very close to her I didn't take it very well. There was also a fallout afterward in my family, and a lot of dramatic, awful things pushed me away from them. I was depressed, plain and simple. Soon after that I met someone and moved in with them 3+ hours away from home.\n\n&#x200B;\n\nDuring my time away from home I worked multiple jobs over 5 years. The first was at a deli, as I needed some form of income and it was the easiest job to obtain at the time. The second was in a call center as a tech support agent for a telecommunications company, which was absolutely soul-siphoning. If you didn't make commission, you were a bad agent and treated poorly. My final job away from home was another tech support company, but much nicer and not commission-based, but the company unfortunately closed its branch in my state. Although the pay and the management were good, tech support wasn't exactly fulfilling. After going through an emotionally abusive relationship, getting out of it years later, and finding I would be  the only decent job I ever had, I was ready to move back home and try to start over.\n\n&#x200B;\n\n**Now:**\n\nThe job I got once I moved back home was at a hotel, and I still work here two years later at the front desk. When I moved back, I applied to the community college I had dropped out of before, took out a personal loan from my bank to pay for it, and took two classes - English Lit. 1 and History of Theater. I guess the plan was to just get my associates degree in English at least, so that I had something. I was working part-time, but I have a car and an apartment to pay for, so when I went to full-time my grades declined as well as my health. I wasn't sleeping much until I overslept, and since I couldn't miss work I sometimes missed class and went to work a zombie. \n\n&#x200B;\n\nI like my managers and my co-workers a lot, but that's the most I can say about the job. I don't enjoy hospitality, uniforms, being fake-nice, and listening to people's complaints about problems that are extremely trivial. Worst of all is the pay of minimum wage and the empty hole where I'd like fulfillment to be. I've taken personality tests and \"best field for you\" quizzes, but I'm really at a loss of what I can realistically do with my life. If it helps, I'm supposedly INFP (\"Mediator\") and the last quiz I took was convinced I'd enjoy Environmental Policy, though it seemed rather random to me. I love to read fiction, fantasy, etc. I love playing video games with a lot of lore and fantastical things. I love to help people with English, be it spoken or written (I work with a lot of Hispanic people who enjoy the help and speak a little Spanish myself). I love all kinds of music and would like to learn the violin and piano some day. I *wish* I had the discipline to write and draw as much as I'd like to. I think I'll stop there since this is starting to sound like a dating profile. I just don't know what career is right for me.\n\n&#x200B;\n\nAnyone who has been in this sort of situation before and would like to share, or any advice or truths that could be given, I  would be very, very thankful. I feel at a complete loss.",
    "title": "Advice for an Unfulfilled Entry-Level Job Hopper",
    "subreddit": "jobs",
    "timestamp": 1553527740,
    "score": 43,
    "keyword": "hispanic manager"
  },
  {
    "text": "Feeling a little out of touch with my career path I recently landed my first Software Dev internship at a very large, popular company. I thought it was a dream when I got it! But now that I'm here, I feel like I may not be cut out for it. I am still an upcoming senior in undergrad so I shouldn't be comparing myself to my project managers or even fellow coworkers (who are full-time employees). But, sometimes they'll be (very nicely) explaining concepts to me and I'm just sitting there thinking that I will never be able to be so organically knowledgeable about Software Dev. I guess it's a mix of Imposter Syndrome (even though I studied for an entire month, day and night, for the internship's interviews) because I just don't feel nearly as competent to have an entire company or even my teammates relying on me for anything! I only just got into programming about a year ago so this is all very new but at the same time I feel like I bit off more than I can chew. I also sometimes convince myself that I only got this internship because I was a good-looking young Hispanic woman, not even so much for my talents. Which only brings me down more. \n\nMy dream in life is to be a software engineer for one of the top tech companies but I feel like I'm barely even bright enough to have gotten this internship. How do you deal with having intrusive thoughts of unworthiness within your tech career? Especially among your peers?",
    "title": "Feeling a little out of touch with my career path",
    "subreddit": "cscareerquestions",
    "timestamp": 1560393059,
    "score": 6,
    "keyword": "hispanic manager"
  },
  {
    "text": "Calling your boss \"Boss\"? I recently began working in the accounting department of a car dealership. I've noticed that everyone in the accounting department calls the boss \"Boss\" instead of by his name. How common is this in other institutions? I wonder if it's a matter of culture, as the company is predominantly Hispanic. I feel a bit awkward because I can't help but see the gender-power dynamic (the rest of the accounting department is female, except the boss, and the accounting manager, and I). I haven't noticed what the accounting manager refers to him by, but I think he calls him boss as well. I don't really want to validate or participate in that sort of power-play dynamic in a work environment, so I've just been calling him by his name. Can anyone give me some perspective?",
    "title": "Calling your boss \"Boss\"?",
    "subreddit": "Accounting",
    "timestamp": 1567011407,
    "score": 3,
    "keyword": "hispanic manager"
  },
  {
    "text": "PSA- Check your moles! Unfortunately, many people (including dermatologists) don’t know that black skin does not offer sufficient protection from skin cancer. Melanoma is the most dangerous skin cancer, and while it has an extremely good prognosis when diagnosed early, the chances of survival plummet the longer a cancerous mole goes untreated.\n\n\nWhile black people have a lower risk of skin cancer compared to people with other skin colours, their risk of getting an initial diagnosis of an already advanced melanoma is much higher than for white and hispanic people. On top of that, many medical professionals aren’t adequately educated on how melanoma might present in black people and so might miss it during check-ups: it is often found on the soles of the feet, the palms of the hands or under/near the nails (that’s the type of melanoma Bob Marley had). It also doesn’t help that most references for “melanoma” depict melanoma on pale skin. \n\nI’ve tried to collect relevant information on how to prevent and check for melanoma in this post. I am not a medical professional myself, this information might not be comprehensive, it’s just meant to be a general first look at the topic. Please talk to your GP or dermatologist if you have any concerns.\n\n\n\n**How to prevent skin cancer**\n\n\n-Wear sunscreen: While a higher level of melanin in the skin increases sun protection, it doesn’t come close to the protection sunscreens can offer.\n\n-Stay out of the direct sunlight, especially in the hours between 10-4.\n\n-Wear a hat and cover as much skin as possible with clothing.\n\n-Go to a yearly skin cancer prevention check at a dermatologist’s office.\n\n-**Do not** listen if someone tells you you’re low risk because of your skin colour. If you have a history of skin cancer, make sure to follow your doctor’s orders if they recommend more frequent check-ups.\n\n\n**How to check moles**\n\n\n- Follow the **ABCDE**-rule: A-Asymmetry: asymmetric moles have a higher chance of being skin cancer; B-Border: moles with a fuzzy border have a higher chance of being skin cancer, C-Colour: moles with several different colours have a higher risk of being skin cancer, D-Diameter: moles with a diameter of more than 6mm have a higher risk of being skin cancer; E-Evolving: if a mole changes size, becomes raised, starts bleeding or itching or suddenly develops different colours, it has a higher risk of being skin cancer. Some websites add an F for Funny to the rule: if anything feels strange or different, get it checked out. You know your body best.\n\n-Take pictures! It helps a lot with identifying any changes.\n\n-Make sure to check spots like the inside of your mouth and your genital area and buttcrack. Having a partner check your back makes this a lot easier. \n\n-Self-check every few weeks/months.\n\n\n**What not to do**\n\n\n-Never try DIY-removing a mole. There are people online who seriously recommend cutting it out with scissors or putting vinegar on it. Please don’t do that- 1. It’s incredibly unsafe 2. If a doctor is concerned about a mole, they will send it in to be biopsied. If you destroy the mole, you’re also destroying the chance of getting it analysed.\n\n\n-Don’t ever ignore a mole itching or bleeding. That’s doctor time. \n\n\n\n**These are really good articles talking about melanoma in black women- they have more information**\n\nhttps://www.self.com/story/black-people-melanoma-skin-cancer\n\nAnd  https://www.health.com/melanoma/dark-skin-is-no-protection-from-skin-cancer\n\n\n**Other things you can do**\n\n-Make sure your GP/dermatologist is aware that melanoma can show up differently and in different spots on black skin compared to lighter skin. This is especially important if you live in a country with an overwhelmingly non-black population, where doctors might have even less experience in diagnosing skin cancer in black people.\n\n-Mark the date of your last skin check-up in the calendar so you’re not late on your yearly check-up (I do this and still managed to be three months late -.-)\n\n-Talk to friends and family about melanoma and share articles you think are valuable about it on Facebook or post them in Whatsapp-groups- raising awareness is so important\n\n-If you swim in the sea a lot: there is reef-friendly sunscreen, some sunscreens can unfortunately damage maritime life.\n\n\n\nI hope this helps someone! I’m white and don't want to intrude, so I won’t comment on this post unless I get tagged, so if you want me to reply to your comment, please do so. You can also message me privately if you want to, but as I said, I’m not a doctor and unqualified to help with specific medical issues. If I have missed anything vital or you have any more resources you’d like included in this post, please comment or message me and I’ll edit my post. I am also not an English native speaker, so I’m sometimes a bit wobbly with my terminologies- please call me out if I phrased anything badly.\n\nHope all of you have a nice day!",
    "title": "PSA- Check your moles!",
    "subreddit": "blackladies",
    "timestamp": 1548364003,
    "score": 65,
    "keyword": "hispanic manager"
  },
  {
    "text": "HELP WANTED - Art Project Hey everyone!\nWhile I was in graduate school I began an art project that I never completed. But according to some visiting artists and the faculty it had a lot promise.\nI took minimum wage worker uniforms and talked to a worker about their experiences as a Latinx hourly-wage worker. It started with mine: I had a stop and shop uniform I used to wear and recognized that I would always speak English with other Hispanics in front of white customers. I wrote that story on the uniform with a marker and hung it up. I also collected a shirt from a guy from Trader Joe’s and a CNA from a nursing home.\nOne of the things I was trying to accomplish with the art project was just collecting the experiences of minorities working hourly-wage jobs and combatting any assumption upper management or white Americans make about us: “s/he’s uneducated.” “they’re stealing jobs.” Etc...\nSo I was wondering if anyone in this subreddit has any shirts and stories they’d be interested in sharing? I’d happily pay for shipping!",
    "title": "HELP WANTED - Art Project",
    "subreddit": "Hispanic",
    "timestamp": 1547736575,
    "score": 17,
    "keyword": "hispanic manager"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 128,
    "keyword": "hispanic manager"
  }
]