[
  {
    "text": "Black in a predominantly Hispanic workplace. Disclaimer: I am not shaming the entire group of people.\n\nI live in Miami, FL. I was born in Jamaica and came to America when I was five years old. Went to school here all my childhood life. I’ve been working in the hospital and some insurance carrier over the last 10+ years. I’m very friendly and soft spoken. I don’t know how to stand up for myself because I do not like confrontations, but I’m getting to annoyed by it at this point. The first job I work at was at Jackson hospital, you can really sense how people treat their own and the way they talk to you and how it comes off as discriminatory. Miami is full of Cubans and Venezuelans, overall majority of them are great people, but a lot of the older populations of them are rude and extremely prejudice. I understand Spanish but I do not speak it well. I never told anyone at my job that I understood Spanish, and I also understand French. Throughout my years of working alongside with them I’ve been called many names that were derogatory and disgusting. I’ve been called a monkey, an ESL persons, stupid, etc. A whole bunch of nonsense. Now more recently it’s been an uptick with it now. They scream and shout at me when things don’t go their way. Management doesn’t treat me the same like the other Spanish speaking employees. They get the sweet talk, I get talked down with aggression, they write me up for things that I personally don’t see any wrong doing. I go home cry about it then come the next day. My mom is a Christian lady and all she tells me to do is pray. I make decent pay, that’s why I am still there. Any time they bring cafecito (the cuban coffee) they ask every Hispanic person if they want some, then when they come to me they don’t even ask they just passes me then an hour later will come up to me to tell me that Cuban coffee is in the pantry. I don’t know if im overthinking it but it’s not a friendly environment. I even heard the manager said in Spanish one time that if it was up to her she’ll fire all the black people because it’s not 1960s anymore and we need to find our own environment the whole office burst out laughing then I saw some of the people looking at me but not saying anything. I want to leave the job but I’m afraid the next employer is going to call them and my current job will do everything in their will to not get my hired. I requested so many times to be transferred and my manager declined it. She even converse about why she declined me in Spanish to my other coworkers. What can I do?",
    "title": "Black in a predominantly Hispanic workplace.",
    "subreddit": "jobs",
    "timestamp": 1693756398,
    "score": 527,
    "keyword": "hispanic manager"
  },
  {
    "text": "Pls Don't Discriminate Just Because You Are Having a Bad Day This was my (25F) first time working with this coworker (27F) that has been rehired due to many many convincing behavior and meetings for the last 2 weeks from my one of my general managers (32M). She was fired for a reason because she made at least 2-3 coworkers (19F, 22 M, 21F) cry after making fun of how they serve and talk to customers. This was my first time working with her, because I got hired after she left which was about a month ago. She got re-hired again just yesterday, after she begged one of my 2 managers that she needed the job to be able to pay for her car and rent. She ended up discriminating not ONE but TWO people and telling the other manager, explaining to her in Spanish (because the other manager is Hispanic and fluent) that she had a miscarriage 2 weeks ago and that she didn't need anyone's stress pushing onto hers. Okay, well, I am all about the professional over personal matters, but I'm not once the shift is done..like as in once the closing is happening and there's no customers, I am here for any of my co-workers if something is going on and they just don't have anyone or feel like they are alone, because that is something no one should ever feel, regardless. However, just 30 minutes into our shift, she comes up to me asking me do I speak fluent english because she thinks I have an accent (fyi I am a U.S. citizen, and have been raised in the U.S. since I was 5 after immigrating from my native Asian country), even after I introduced myself to her before I started my shift to her. She started laughing and standing at the bar, ignoring majority of her customers throughout work to which I had to attend to her customers due to her lack of attendance and attention, and when I tried to get her attention (multiple times), she asked me on purpose to speak louder and clearer. This ended up making my managers very disappointed and frustrated even when I didn't complain about it (because they heard it too loud and clear), and she ended up defending herself saying that the two managers are trying to make a fight against her, just because she was given a warning. She ended up saying something racially discriminative to one of my 27 year old managers who is also Asian, but born and raised in America, to the point where the customers had to say something to her because everyone was hearing her crying loud and clear. Are we in the wrong?\n\nTLDR; Co-worker says something discriminative but blames it on her personal issues that made her say such things; ends up crying outloud enough saying she is a victim for the whole restaurant to hear and ends up getting fired.",
    "title": "Pls Don't Discriminate Just Because You Are Having a Bad Day",
    "subreddit": "jobs",
    "timestamp": 1684135822,
    "score": 1,
    "keyword": "hispanic manager"
  },
  {
    "text": "Should I work for a racist boss? TLDR: My old boss was toxic and racist but wants me to work part time as a contractor. \n\nBackground: I recently quit working for a very toxic company and boss as a project manager for a short time. I enjoyed the projects themselves because I’ve been doing this type of work/projects for several years. My life dream is to eventually be self employed in this type of work and I’ve worked for and with several other good companies and bosses I’m the past. The most recent though, was a very toxic environment. My direct manager was manipulative, and a micro manager. They would often lie or spread false rumors about other employees to create their own narrative and make themselves look good. They were a workaholic themselves and literally spent 24/7 on call to the CEO, and expected the same of me (and all other employees) even though they were being paid a huge amount to be on call (like $400k+) while the rest of us were being paid a normal amount ($50k-$60k). I’ve been working a long time and I’ve had my share of dealing with difficult managers, but this was a new level. The stress was manifesting in my life physically and even though the issues came up early in the job, I couldn’t afford to leave for at least a year. I managed to buck up and have several tough conversations with my manager about my own expectations and boundaries, and for the rest of my time there was able to keep them from trying to control my entire life and keep it professional. They did manage to make my coworkers lives hell, because they were not experienced/brave enough to have the same tough conversations. I tried  advocating for them but it would only go so far when they were not able to stick to their own boundaries. My manager still respected my high quality work and promoted me a couple times to take on higher responsibilities. Towards the end, they asked me to be involved in hiring process to replace one of my lower rolls. I was the 2nd round interviewer after the standard initial HR 1st round, and my manager would be the final interviewer. I interviewed no less than 10 people, all of whom were well qualified and a couple were even over qualified. There were 5 candidates I passed along to my manager who I thought would be the best for the job for several factors (flexible schedule being the main one). 4 of the candidates were black women and 1 was a Hispanic woman. I provided in depth notes on their strengths and offered to help set up the final interviews. Immediately without looking at my notes, my manager asked me to find and send their linked in and social media accounts. I assumed they wanted to check for anything dangerous or inappropriate, since it was a client facing role. So I sent the profiles I could find. Most had linked in and a few had Instagram. I’m sure they had others but from what I saw, all of them had updated and professional looking profiles. The Instagram photos were normal. Within a day, my manager let me know they wanted me to keep interviewing and asked about one of the other candidates who did not make my top 5. (A young white woman, very conventionally attractive and skinny). I let them know she had the least amount of experience and would not be able to stay late ever, which was a requirement. I had to do several more interviews only to eventually have my manager tell me “not to be racist, but they just don’t work hard and always start issues”. I was so in shock I was speechless. I didn’t ask for clarification about “they” but it was a buoys after I questioned why all 8 candidates I had sent were black or Hispanic or even just older. I realized they wanted a young thin white woman. We eventually hired the attractive one who had the least experience and ended up giving my manager some headache because she needed a lot of training and was constantly calling out “sick”. I began job hunting almost immediately and left a few months later. \n\nFast forward to today, I have a new job where I’m doing well and with a healthy working environment. My old boss reached out to ask if I would help on a contract basis with their largest project they have every year. I could charge my higher rate and only work a few hours a week until the project is finished at the end of the year. And it would add to my portfolio. I wouldn’t have to deal with the usual stress since I would be a contractor, not an employee. I just can’t get past the fact they are inherently racist. I feel like I would be selling my soul.",
    "title": "Should I work for a racist boss?",
    "subreddit": "jobs",
    "timestamp": 1694456513,
    "score": 1,
    "keyword": "hispanic manager"
  },
  {
    "text": "Should I quit my part time job? I work at Burger King and I've thought about it for awhile if I should quit. It is absolutely exhausting working there. Majority of my coworkers are Hispanic and hardly know any English, which makes my job so stressful. There's tons of miscommunication and sometimes I have shifts where I'm only with them and have no one to help me translate what they're saying to me, or at least help me explain what the customer needs. \nPlus I get hit on a lot by grown ass adults (I'm a minor) and my manager is so disorganized with the schedules. \n\nThis job pays really well however and my coworkers are nice which is why I've been hesitant to quit...",
    "title": "Should I quit my part time job?",
    "subreddit": "jobs",
    "timestamp": 1692248486,
    "score": 0,
    "keyword": "hispanic manager"
  },
  {
    "text": "Race Quotas in Hiring - Legality Question I know it's a tough job market out there right now. I've spoken to a few hiring managers. They all have specific race and gender-based quotas. Specifically, one that I'm hearing often is that (out of hundreds of applicants) the hiring team will select 4 people to interview. In the 4-person pool, there must be a minimum of: 1 woman, 1 black person, and 1 hispanic person. The last spot is open to anyone.\n\nI'm not clear on how the hiring teams learn about the race or gender of the applicants.\n\nThis seems potentially unlawful, but clearly is a widely implemented practice. Was wondering, what is the relevant legal framework here? I'm not looking to pursue legal action, I am interested in what is considered and how exactly race-based decisioning from employers like these became a widespread practice. Thanks!",
    "title": "Race Quotas in Hiring - Legality Question",
    "subreddit": "jobs",
    "timestamp": 1701575584,
    "score": 0,
    "keyword": "hispanic manager"
  },
  {
    "text": "Why lie to me? Some background: I started a new job, yesterday was my first training day. Now, I’m mixed( black and native) so my skin is lightish but I have dark hair. Why the description? Because my new job is mainly made of Hispanics/ Mexican Americans and Latino people. \n\n\n\n\n\nThey started speaking Spanish to me.\nWhen I said I didn’t understand they asked me if I was mixed. I told them I was and they asked why didn’t my one parent teach me Spanish and it clicked for me that they thought I was mixed with their roots. When I told them I wasn’t, they all said they thought I was Dominican. ( I get that a lot but most of the time from older white women who assume I don’t speak English for some reason) \n\n\n\n\nThe assistant manager was training me. His friend kept walking back and forth saying hi( he doesn’t know English well) and I’d say hi to be nice. Well the AM asked for my number for said friend I’ll call J. I said NO immediately and quickly explained that I don’t date, I study with Jehovah witnesses and I’m probably never going to date. As soon as I finished the AM said it’s for a work group chat, basically to cover shifts. \n\n\n\n\nSo naturally I felt (teeny tiny bit) bad for going on my lil tangent and apologized and gave him my number, to which he didn’t believe it was my number and proceeded to call me to check. (Red flag 1)  basically I get home to see he added me on Snapchat. And there is no work group chat. \nHe thought I was pretty and wanted to know if I would go out with him. \n\n\n\n\nI told him no straight up but my problem isn’t with J. I would’ve told him no anyway. It’s the fact that the AM lied to me, and either lied to J or J was secretly in on it cause he thought that if I talked to him it would change my mind. I just hope the AM doesn’t say anything to me cause I’ll call him out ( not rudely tho but definitely setting boundaries.)",
    "title": "Why lie to me?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1683766762,
    "score": 17,
    "keyword": "hispanic manager"
  },
  {
    "text": "With chatGPT in medical news recently, I decided to test it on a case once presented to r/medicine: So I recently saw the article [A boy saw 17 doctors over 3 yeas for chronic pain. ChatGPT found the diagnosis.](https://www.today.com/health/mom-chatgpt-diagnosis-pain-rcna101843) which matched my own experiences - I've had chatGPT identify a rare diagnosis in a patient which I assume was due to its strength of dataset. \n\nI remember however a user called [u/drag99](https://www.reddit.com/u/drag99) who posted some fun cases which I enjoyed working through as an MS4, so thought I would throw [one of them](https://www.reddit.com/r/medicine/comments/jwimjn/interesting_case_presentation_30_something_year/) to chatgpt word for word and see how it did. You can read my full conversation [here](https://chat.openai.com/share/683a24a2-50a5-466c-916d-ac88e8f56034)  but I apologise as I did some quick mental exercises with it first for a different reddit post I was making - just scroll past them if you're only here for the medical stuff.\n\nFor those who can't or don't want to view the above link, I will paste the relevant bits below: (scroll to the end to skip the AI conversation)\n\n\n**Me**: I am a doctor and id like to test you on a recent medical scenario:\n\nI walk into the room as they are wheeling in a minimally responsive 30 something yo Hispanic male who is pale and breathing 45x a minute. His LLS score is positive. The report I got from the nurse that found him was that he was dropped off by some \"friends\" who didn't know his name or any of his medical problems. They said something about there being a lot of blood and then took off.\n\nThe patient is confused, agitated, intermittently responsive, but unable to answer any questions. His shirt is already off, there is a small amount of dried blood on his abdomen, and some more on his jeans.\n\nOutside of obtaining vitals, what is the first couple assessments you should be making in this patient?\n\n**ChatGPT:** Certainly. Based on the scenario, the patient presents with signs of potential trauma and instability. Here's a prioritized approach:\n\n1. **Airway**: With a respiratory rate of 45x a minute, there's a concern for respiratory distress. First, ensure the airway is patent. Assess for any obstructions or injuries that might compromise the airway.\n\n2. **Breathing**: Given his rapid breathing, listen to his lung sounds bilaterally to assess for any signs of pneumothorax, hemothorax, or other pulmonary issues. Check for symmetrical chest rise and fall. Supplemental oxygen might be indicated based on his oxygen saturation and clinical appearance.\n\n3. **Circulation**: Examine for any signs of active bleeding. The dried blood on his abdomen and jeans could indicate potential injuries. Palpate for distended or tender abdomen suggesting internal bleeding. Check pulses, capillary refill, and blood pressure. Start IV access, preferably two large-bore IVs, and consider drawing blood for lab work (including type and crossmatch). \n\n4. **Disability (Neurological Assessment)**: Evaluate his level of consciousness using the Glasgow Coma Scale (GCS). Pupillary response and any focal neurological deficits should be assessed. \n\n5. **Exposure**: Fully expose the patient (while maintaining warmth) to check for any other injuries or signs of trauma. The blood on his jeans might indicate a lower extremity injury.\n\n6. **FAST (Focused Assessment with Sonography for Trauma)**: Given the potential for abdominal trauma indicated by the dried blood, perform a FAST exam to quickly assess for free fluid in the abdomen, which could indicate internal bleeding.\n\nGiven that the patient's LLS score is positive, there's a concern for potential life-threatening injuries. The LLS (Life-threatening Lesions) score is a prehospital tool used to predict the need for a life-saving intervention in trauma patients. \n\nThe patient's condition warrants immediate and thorough evaluation, likely in a trauma bay setting, with appropriate imaging and potential surgical consultation based on the findings.\n\n**Me**: There are a couple answers for this, but the best answer is the ABC's of resuscitation, or airway, breathing, circulation, and importantly, exposing the patient. All we know is that the patient was dropped off, he is pale, looks like shit and likely on the verge of death, and there was reportedly \"a lot of blood\", so we should be considering trauma. His airway was patent as he intermittently screamed, he was severely tachypneic but breath sounds are normal and symmetrical, and he has faint pulses in all extremities w/ an absence of cap refill. We then cut his jeans and underwear off and quickly looked for any wounds including looking at his back and perineum. There was no evidence of any trauma to his body. Of note, his upper abdomen did appear to be distended.\n\nHis initial VS were HR 111, BP 70/33, RR 45, O2 sat 99% on RA, T 35.6C.\n\nWhat are you thinking as the likely diagnosis? What are the initial tests you want to order? And how are you going to immediately treat this patient?\n\n**ChatGPT**: The patient presents with signs of shock (hypotension, tachycardia, altered mental status, cool extremities with poor capillary refill, and tachypnea). Given the absence of external trauma and the distended abdomen, internal bleeding is a major concern.\n\nThe likely diagnosis to consider based on the presentation is **hemorrhagic shock** secondary to an internal bleed, possibly an abdominal aortic aneurysm rupture or another source of intra-abdominal hemorrhage.\n\n**Initial Tests**:\n1. **Complete Blood Count (CBC)**: To assess for anemia and provide a baseline hemoglobin.\n2. **Type and Crossmatch**: For potential blood transfusion.\n3. **Chemistry Panel**: To evaluate renal function, electrolytes, and lactate (a marker for tissue hypoperfusion).\n4. **Coagulation Profile**: PT, PTT, INR to check for any coagulopathy.\n5. **Bedside Ultrasound (FAST exam)**: To evaluate for free fluid in the abdomen.\n6. **CT Scan of the Abdomen/Pelvis**: If the patient's condition allows, to identify the source of the bleeding.\n7. **Arterial Blood Gas (ABG)**: To assess the patient's acid-base status and adequacy of ventilation.\n\n**Immediate Treatment**:\n1. **Fluid Resuscitation**: Start with crystalloids (e.g., normal saline or lactated Ringer's) while preparing for potential blood transfusion.\n2. **Blood Transfusion**: Given the suspected hemorrhagic shock, initiate a massive transfusion protocol with packed red blood cells (PRBCs), fresh frozen plasma (FFP), and platelets as indicated.\n3. **Vasopressors**: If fluids alone don't stabilize the blood pressure, consider starting vasopressors like norepinephrine.\n4. **Warm the Patient**: He's hypothermic, so use warming blankets and administer warmed fluids.\n5. **Surgery Consultation**: If an intra-abdominal source of bleeding is identified or highly suspected, a surgical or interventional radiology consultation is crucial for potential definitive management.\n\nThe priority is to stabilize the patient's hemodynamics, identify the source of the bleed, and address it promptly.\n\n**Me:**: So I knew the diagnosis, immediately, but still wanted to cast a broad net in case I was wrong. I ordered a CBC, BMP, Liver profile, VBG, Type and cross for 8 units, lactic acid, coags, CXR, blood cultures. I also had our charge nurse run down to obtain 4 units of emergency release blood. The nurses caring for the patient immediately placed 2 18g IVs in bilateral arms. The blood that returned from the IV was like nothing I had ever seen before. It had the appearance and consistency of watered down red cool-aid.\n\nI had a nurse call the charge to tell her we are changing the emergency release order to a massive transfusion protocol. I also asked that we not bother with the blood cultures, as this individual was going to need every single RBC possible. I had my medical student do a quick FAST exam to make sure we were not missing a spontaneous splenic rupture. His FAST exam was negative for obvious intra-abdominal free fluid. There was a large amount of fluid in the patients stomach. What is the most likely diagnosis at this point?\n\n**chatGPT**: Given the clinical presentation and the unusual appearance of the blood drawn from the IV (resembling \"watered-down red Kool-Aid\"), the most likely diagnosis to consider is **esophageal variceal bleeding**.\n\nThe following clues support this diagnosis:\n1. The patient's distended abdomen, which could be due to portal hypertension and ascites.\n2. The absence of visible trauma or other sources of massive bleeding.\n3. The \"watered-down\" appearance of the blood, which is characteristic of upper GI bleeding, especially from esophageal varices. Blood from upper GI sources can mix with stomach contents, diluting its consistency.\n4. The large amount of fluid in the stomach on the FAST exam, which could be blood.\n\nEsophageal varices develop in the setting of liver cirrhosis and portal hypertension. When they rupture, they can cause massive, life-threatening upper gastrointestinal bleeding. Immediate management and stabilization are crucial.\n\n**Me:** Great answer. So ignoring the severity of this case how do we typically medically manage undifferentiated acute upper GI bleeds in the ER?\n\n**chatGPT**: Managing acute upper GI bleeds in the emergency department involves a combination of resuscitation, stabilization, and specific interventions to control bleeding. Here's a general approach:\n\n1. **Resuscitation**:\n   - **Airway**: Protect the airway, especially if the patient is vomiting large amounts of blood. Intubation might be necessary in severe cases.\n   - **IV Access**: Secure at least two large-bore IVs for fluid and blood product administration.\n   - **Fluid Resuscitation**: Begin with crystalloid solutions and consider blood transfusion based on the patient's hemodynamic status and hemoglobin level.\n   - **Blood Products**: Initiate a massive transfusion protocol in severe cases. Otherwise, transfuse based on hemoglobin levels and clinical stability.\n\n2. **Specific Medical Interventions**:\n   - **Proton Pump Inhibitors (PPIs)**: Administer a bolus dose (e.g., pantoprazole or omeprazole) followed by a continuous infusion. PPIs reduce gastric acid secretion, stabilizing clot formation on any ulcerated areas.\n   - **Octreotide**: For suspected variceal bleeding, an octreotide infusion can be initiated. Octreotide reduces portal venous pressures, which can help control variceal bleeding.\n   - **Antibiotics**: For patients with suspected variceal bleeding and liver cirrhosis, prophylactic antibiotics can reduce the risk of bacterial infections, which are common in these patients.\n   - **Erythromycin**: A one-time dose can be given before endoscopy to clear stomach contents and improve visualization during the procedure.\n\n3. **Diagnostic**:\n   - **Nasogastric (NG) Tube**: Inserting an NG tube and performing a lavage can help differentiate between upper and lower GI bleeding. Bright red blood or \"coffee grounds\" appearance suggests an upper GI source.\n   - **Lab Work**: Complete blood count (CBC), basic metabolic panel (BMP), coagulation profile, liver function tests, and type and crossmatch.\n   - **Endoscopy**: An emergent or urgent upper GI endoscopy is the gold standard for both diagnosing and treating the source of an upper GI bleed.\n\n4. **Consultations**:\n   - **Gastroenterology**: For endoscopic evaluation and potential intervention.\n   - **Surgery**: If endoscopic management fails or if the patient has other indications for surgical intervention.\n   - **Interventional Radiology**: For potential embolization of bleeding vessels if endoscopic measures fail.\n\n5. **Risk Stratification**: Tools like the Glasgow-Blatchford score or the Rockall score can be used to assess the severity of the bleed and guide management decisions.\n\nPatients with acute upper GI bleeds require close monitoring, frequent reassessments, and often admission to a critical care setting, especially if the bleeding is severe or the patient has multiple comorbidities.\n\n----- *anyway I'll leave it there, this is already too much of a wall of text. But considering the wildly misinformed/inaccurate takes I have seen on chatGPT in this sub, I hope this provides some alternative information to at least think about.*",
    "title": "With chatGPT in medical news recently, I decided to test it on a case once presented to r/medicine:",
    "subreddit": "medicine",
    "timestamp": 1694874272,
    "score": 264,
    "keyword": "hispanic manager"
  },
  {
    "text": "I’ve been a Mother/Baby nurse for 8 months and I feel wrong for being burnt out. TLDR: I’m a new grad nurse on Mother/Baby. I was told I was going to be in L&D at my hiring event, but it was sort of a bait and switch. I’ve been having petty issues with management who recently stopped me from finally transferring to L&D without an actual justification for it. Despite this job being pretty easy, I feel burnt out and severely depressed and am questioning whether I’m really cut out for this.\n\n————-\n\nIt seems burnout is a tale as old as time for this sub, but my job feels so different from other nursing jobs. This is why I feel that I’m at a loss as to how to move forward because I feel like I shouldn’t be burnt out.\n\nI graduated a year ago, moved cities, and have been a nurse on a Mother/Baby unit for 8 months now at a small(ish) public hospital.\n\nThe nonsense started from the very beginning when I was told at my hiring interview that I was being accepted for Labor and Delivery. The original offer letter they gave me there said L&D, and I was so excited because that’s why I went into nursing school in the first place. When they sent me the “official” offer to accept though, it said Mother/Baby. I didn’t think much of it because the way things had been described to me at the interview made it sound like the units were more fluid, like I would be doing both L&D and Postpartum duties. That was my first mistake of making assumptions and not reading carefully enough. But it would’ve been nice if communication had been clear to me in the first place. (I learned later that the people conducting interviews that day got confused as to who was hired for where, so I absolutely think I wasn’t originally supposed to be in MB and they fucked up).\n\nI started working on this unit anyway because pretty much everywhere else in the area refuses to hire new grads, and it really wasn’t that bad at first despite the bait and switch. I got accustomed to my primarily Hispanic patient population (I already spoke a good amount of Spanish and have gotten better at it now), and I’ve learned a lot about OB as a whole. It’s honestly a really easy job with the hardest part being the language barriers. But recently I’ve just started feeling tired of it all. It’s boring, monotonous, and doesn’t really push me to be the nurse I want to and know that I can be. I still want to be in L&D, but I’m also questioning whether I want to be a nurse at all anymore now.\n\nThe biggest issue arose recently because I was actually supposed to be transferred there and restart orientation as an L&D nurse. That transfer was stopped by my CNO two days before it was supposed to happen, and my ADN blindsided me with that information after I had been waiting to be transferred for months. What happened prior was that I had been pulled aside by the CNO after he had observed the huddle at shift change, which I was leading because I was the offgoing charge nurse (I know, I only had six months under my belt). They implemented a new system for doing handoff, and it was still new so I wasn’t really happy about it and didn’t do it very well. Not because I was refusing to, but just because I didn’t understand exactly how he wanted it done. (We’ve all been micromanaged about this thing for months now and it’s really straining the other nurses on the unit too.) When he pulled me aside, he asked me what the problem was, and I essentially told him that I felt that the new process was impractical and ineffective at doing anything to improve patient care and actually impeded patient care, if anything. He didn’t like that, swore at me, and threatened my job (my second big mistake was ever going anywhere to have a conversation with management and especially forgetting to record it: one party consent state). I kind of thought that was the end of it until I wasn’t transferred, and he accused me of “insubordination”. Nothing really happened except for a slap on the wrist because he couldn’t give my direct supervisors an actual example of insubordination or misconduct, but my transfer was stopped and I’m stuck on this unit. Now I plan to quit ASAP regardless because the management here is fucked.\n\nOverall, I don’t know what to make of the future of my career because I’m just so sick and tired of it already. I feel that I shouldn’t be burnt out because my job is genuinely not very difficult, the nurses that I work with are for the most part alright, and I get paid well. But here I am, on the first vacation I’ve had since starting, at home for Christmas with my family, and I’m still miserable. I feel broken down, unable to function, and completely empty.\n\nI already have a history of depression and anxiety, and I’m starting to seriously suspect I may be autistic (which has been further exacerbated by several situations that have happened at work that make me feel extremely socially incompetent). I know I’m not a bad nurse and my patients like me a lot, but I seriously feel like I might jump off a bridge if I have to keep going to work. I don’t know whether things will get better for me as a nurse because when I talk to people about it, they just say that there are the exact same issues in every other hospital. I feel like maybe I’m just not cut out for this at all because of my mental illness and my personality, which apparently comes off to people as defiant and rude without me meaning to be.\n\nIf anyone has any advice, I’d appreciate it a lot. \nI lurk a lot on this sub and it sounds like there are some amazing people here. Happy Holidays to everyone :)",
    "title": "I’ve been a Mother/Baby nurse for 8 months and I feel wrong for being burnt out.",
    "subreddit": "nursing",
    "timestamp": 1703652110,
    "score": 10,
    "keyword": "hispanic manager"
  },
  {
    "text": "Student cussed and yelled at me today after telling them to put the phone away \nI am a ELL instructional specialist/IC and I am helping a teacher with classroom management (not ESL but they still assigned her to me because we're understaffed). I was in her classroom and saw a student on the phone. Our principal has been very strict about the no-phone policy, students are supposed to put their phone in a bin as they walk into the classroom and only take it out at the end of the block. The principal has been reprimanding this teacher because of phone usage in her classroom, and since I am trying to help her and I don't want her to get in trouble, when I saw a student on her phone I told her to either give it to me to put it in the bin, or do so herself, like I always do in this kind of situation. She kept it in her hand so I stood there waiting and hell broke loose...\n\nShe started yelling at me, telling me to leave her alone, she called me a b*tch multiple times, told me to go f*ck myself multiple times. 2 of her friends intervened and doubled down, yelled all kinds of profanities, and also called me a racist (these students were black but so is 80% of the class and the other 20% are Hispanic students, she was just the only one I saw on her phone).\n\nIn the end she put the phone in the bin and I walked away. At the end of class, I talked to her 1:1 explaining that I am trying to help, telling her that the school is strict on the policy (which she already knows) and I don't want the teacher to get in trouble. She was much calmer, she said she understood, and she even smiled. Even so, I am very ashamed to admit that I have been shaking and my heart has been racing since that happened and once the bell rang I hid in the bathroom to cry. I feel so stupid for reacting like this but unfortunately I am autistic and this kind of direct confrontation really takes a toll on me.\n \nEven though I really enjoy my job, I feel like I have no business working in education because I am weak and not assertive enough and I constantly get disrespected and walked over not just by students but colleagues as well. I feel stupid because I think I handled this very poorly but at the same time I don't know what I could have done differently besides minding my own business. I just want to help this teacher because if she doesn't get this under control, she will keep being reprimanded by the principal and might get written up.",
    "title": "Student cussed and yelled at me today after telling them to put the phone away",
    "subreddit": "Teachers",
    "timestamp": 1692890473,
    "score": 1036,
    "keyword": "hispanic manager"
  },
  {
    "text": "Should I take the new job? I hope that this post is allowed. So I am a teacher at an alternate school. I teach all four subjects. The demographic that I teach is mainly black hispanic. I would say about 85% hispanic and 15% black. My students are foster kids, child trafficking victims, drug addicts, parents, etc. even though all my babies have a lot of issues they deal with, I LOVE them and I love being their teacher. They also respect me and tbh I feel like sometimes they look at me like I’m their mom. Well as you could imagine, I live a decent lifestyle. I’m not super rich but with my salary I do ok. I have my own apartment, travel every week, and I’m also in grad school. \nMy co workers and overall the company culture is amazing at my job. When I got surgery and had to take off of work for two weeks, my job paid me the whole time and my students and co workers texted me to make sure I’m ok. My boss is amazing and overall I’m happy where I’m at. (Even though it is a lot of work) \n\nSo I’m currently in grad school. It’s always been my dream to become an art history teacher/ art professor teacher. Or maybe me a manager at an art school. \n\nMy rent is going up and my salary is remaining the same. Last week, I got an offer to work as an art history teacher and the salary is about $30k more. \n\nThis is the salary I would like and it’s in a field that I want to work in. It also aligns with what I’m studying in grad school. Even though I’m NOT struggling with my salary, more money is always nice. \n\nHere’s the problem. I’m SO conflicted at leaving my current school. My co workers and company culture is amazing. I’m genuinely happy here. Also, I KNOW that my job won’t be able to find another teacher as good as me. (I say this humbly). My students trust me and I know that they look up for me. I feel guilty and conflicted for leaving. Im scared that if I leave, they won’t be able to excel at life. \n\nSince I started teaching them, over 60% of my students graduated early and are now in college. This is also the first year where any of the students at the school have decided to go to college. \n\nI’m good at what I do…and I love teaching. \n\nBut anyway, my bf thinks I should take the job. But idk. My heart is telling me no. I’ve been praying about this and I just don’t know…. \n\nAll advice welcome.",
    "title": "Should I take the new job?",
    "subreddit": "Teachers",
    "timestamp": 1690132409,
    "score": 5,
    "keyword": "hispanic manager"
  },
  {
    "text": "Why the Department of Defense’s schools are outperforming the competition [https://thehill.com/opinion/education/3719861-why-the-department-of-defenses-schools-are-outperforming-the-competition/](https://thehill.com/opinion/education/3719861-why-the-department-of-defenses-schools-are-outperforming-the-competition/) \n\nIn the first major national assessment of K-12 students since the height of the pandemic, schools dedicated to educating U.S. military-connected children have outperformed most school systems across the nation, despite the impact of the pandemic.  \nJust-released results from the 2022 National Assessment of Educational Progress tests show that fourth- and eighth-grade students attending Department of Defense Education Activity (DoDEA) schools led the nation in scoring on reading and mathematics assessments.  \n“DoDEA students’ average scale scores ranged from 15 to 23 points higher than all corresponding national average scores and held steady or increased while all national average scores decreased,” the Department of Defense said in a statement.  \nDoDEA was the only U.S. state or jurisdiction taking the tests to see a score increase for any grade or subject on the first NAEP test administered since the beginning of the COVID-19 pandemic.  \nThe scores also show progress for Black and Hispanic students in the DoDEA system. DoDEA’s “emphasis on equity in education is reflected in higher scores across their diverse population and achievement gaps that are significantly smaller than the rest of the nation,” said Gilbert Cisneros, undersecretary of defense for personnel and readiness. “I am particularly pleased to see those efforts reflected in Black and Hispanic student groups that are outperforming the nation overall,” he added.  \nThe Department of Defense Education Activity is a federally operated school system that provides pre-kindergarten through grade 12 education for the children of military service members and Department of Defense civilian employees. In 2021, DoDEA operated 160 schools in three regions — U.S. installations in the Americas, Europe and the Pacific.  \nThe success of DoDEA schools is an amazing feat, especially given that military-connected children lead highly disrupted lives. They change schools every two to three years with a parent on active duty. And with a parent (or parents) sometimes deployed doing dangerous work, the children face stressors others do not as they manage schoolwork, home responsibilities and regular transitions in and out of communities.\n\nI wrote earlier this year about the success of DoDEA schools in mitigating the pandemic. The recent NAEP scores underscore that their approach to managing students with highly disrupted K-12 careers can provide insights for weathering something as damaging to student learning as a pandemic.  \nDoDEA Director Thomas Brady told me that a turning point for the school system came in 2016 when they began implementing college- and career-ready standards starting with mathematics. Also, it made a big investment in teacher and leader development that has continued over the last nine years.  \n“Our commitment to student achievement and to teacher training and development all combined for positive development in the classroom,” he said.  \nJeffrey Noel, DoDEA’s chief of educational research, told me that some of the success can be attributed to an overriding philosophy that guides the use of resources. DoDEA schools focus on limiting excessive bureaucracy — a big problem for many school districts — and instead prioritize efforts that can have the most impact on students.  \nOne was a push for in-person instruction. DoDEA schools shifted to remote learning during early 2020 like most other public school districts. But only months later, by the beginning of the school year in September 2020, DoDEA focused on in-person learning with mitigation measures as many school districts were unable to reopen. By March 2021, 99 percent of DoDEA schools were operating in person and 100 percent by this past fall.  \nMilitary-connected kids who attend DoDEA schools are not the typical public school cohort. They have parents with jobs, health care, food and housing; their schools are well-funded and don’t have the same federally imposed requirements. They also operate in a unique system of a shared culture and familiarity between students, parents, teachers, school faculty and base leaders. But they don’t have it easy.   \nDoDEA schools are succeeding — and that merits a closer look for lessons that can help school systems struggling to gain back learning losses.\n\n&#x200B;",
    "title": "Why the Department of Defense’s schools are outperforming the competition",
    "subreddit": "Teachers",
    "timestamp": 1695738253,
    "score": 5,
    "keyword": "hispanic manager"
  },
  {
    "text": "Is early start times a petty reason to leave an otherwise fantastic school? I'm a first-year teacher and ever since the first day of the Spring semester, every time I wake up I've had thoughts of moving schools, literally every morning.\n\nThis is a school I picked mostly because they were the only school I applied to that accepted me, and I am grateful for the opportunity. I've come to really enjoy being at this school, and it has a lot of positives you couldn't get in many other schools.\n\nThe best parts about the school is:\n\n1. Great admin team who actually sides with teachers before students. The principal himself helped me out of some sticky situations with some students, even listening to my request to split 2 boys away from the same period and into different periods.\n2. Great coworkers who are all pleasant to work with\n3. Fantastic diversity. There is a very healthy mix of white, black, hispanic, and asian students. About a 50/10/20/20 split. No other school in the state has ratios like this school.\n4. Insanely early release. Students leave at 1:45 and teachers are allowed to go home at 2:15.\n\nHowever, I just can't deal with the early start times. Classes start at 7:00 but teachers are obligated to arrive at 6:35. Add in commute time and I have to wake up a little before 6 just to get everything ready and arrive at 6:35.\n\nI've never been a morning person and I don't think I ever will be. I've tried going to sleep at 9 and my body just doesn't go to sleep. Even if I somehow manage, I still wake up tired. I really do love every other aspect about the school but I can't lie to myself; waking up at 6 every morning is mentally killing me.\n\nDo you think leaving schools only because of the start time is a good enough reason? Should I try to tough it out? If this was your predicament, what would you do?",
    "title": "Is early start times a petty reason to leave an otherwise fantastic school?",
    "subreddit": "Teachers",
    "timestamp": 1682865730,
    "score": 0,
    "keyword": "hispanic manager"
  },
  {
    "text": "How to move forward with name discrimination? So, my sister brought to my attention that I'm not getting any call backs based on my name. My first name is Arabic. When you search my first name, you mainly see Arabian and Hispanic people. She suggested that I start using my middle name because it's more euro-centric, and recruiters/hiring managers will assume I'm of french decent. Can I send my résumé with my updated name to recruiters I've already spoken with? Do I tell them the truth? Or, do I just start applying under my middle name and have things like my LinkedIn reflect it?\n\nTIA",
    "title": "How to move forward with name discrimination?",
    "subreddit": "careerguidance",
    "timestamp": 1686607527,
    "score": 4,
    "keyword": "hispanic manager"
  },
  {
    "text": "How do I reject an employer that wants to keep me? I have a few job interviews lined up today to replace the job I currently have.\n\nLast week, after Christmas, I went in on Tuesday. I started having such bad anxiety that I just couldn't go for the rest of the week.\n\nI just told them I was sick with a stomach bug or the flu. But truth is, I just can not morally line up with their thoughts and actions.\n\nBack story:\nThis company has taken way more than it has given.\nIn January, my husband was wanting to leave his current job and get into sales. We have a whole sales department in my company, so I asked my boss if he could bring him on while explicitly telling him, if not, I understand. \n\nI know a lot of companies don't like spouses to work together, so I understood. I figured I'd ask since it's a small family owned business and everyone sort of works with everyone.\n\nAnyways, fast forward to ten months later.\nThey fire my husband.\nAnd for honestly, literally the dumbest thing ever. They really had no other reason to fire him accept for the fact that he is Hispanic.\nEverything they highlighted that he was doing, the entire sales team actively does, or has done. The only difference between him and the others, is he's a person of color.\n\nAnyways, I go to work the next day and they sit me down and surprise surprise, I get a raise.\nI'm not dumb though.\nI know deep down that this is an, \"I'm sorry, please don't leave\" raise.\n\nI'm grateful for it, but I also can't help but think about how I have a whole business degree and am two classes away from completing my second one and only make 46K a year after the raise.\n\nDon't get me wrong, I'm grateful. But I do believe I deserve more. They have manger Bob over here making 56K whole has zero education and then manager Jim making 60K, again with no education.\nI get it, education isn't everything. Experience is. But hey, I have years of admin experience. I was basically acting as an executive assistant for the entire company but only held the job title \"Administrative Assistant I\". When I got my raise I was switched to \"Administrative Specialist\" 🙄.\n\nAnyways, after they randomly fired my husband, I gave them the benefit of the doubt. Tried to move past them putting us in a predicament where we couldn't pay our bills.\nI definitely don't make enough to fully support us on my own, which they know and to top it off, they knew that we had just spent our entire savings and then some on two emergency surgeries our cat had to have.\n\nAnyways, I never moved passed all of that.\nI tried, don't get me wrong, but then the harassment started.\nBob started being just utterly rude to me every chance he got.\nWhich I reported it to Jim who is my actual manager, who then did nothing about it because it kept happening.\nSo then I went to the top, (we'll call him Lucifer, because that's who he reminds me of) and again, nothing changed other than now Lucifer thinks it's okay to do the same on top of now assigning me inappropriate tasks that have nothing to do with my job that overlaps other people's job putting me in uncomfortable predicaments where people feel like I'm stepping on their toes.\n\nWhich isn't fun.\n\nThen, to top it off, we found out that my husband's pay was dramatically lower than it should have been for the ten months he worked there. He was set to make 35K just in salary. I know for a fact he brought in at least 4K in commission.\nThe unemployment folks told us that for the entire 10 months that he worked there, he only made a total of 17K.\nI may not be the best at math, but I'm pretty good. The math just ain't mathing up.\n\nSo I got curious. I looked at my last pay stub and saw that for this year, I only made 36K when I should have made closer to 42K.\nAgain, the math don't math up.\n\nAnyways, I spent the last week looking for new jobs. I have two interviews this morning.\nI have to go in late in order to attend both interviews.\nI don't want to tell them because I know that they will harass the heck out of me because they don't want me to leave.\nThey will throw all sorts of stuff at me.\nA huge raise, possibly a hybrid wfh until I feel comfortable to go back.\n\nWhich, would be great and all, but I just don't trust these people anymore.\nI just can't and would rather just cut ties and call it a day.\nWhat should I do?",
    "title": "How do I reject an employer that wants to keep me?",
    "subreddit": "careerguidance",
    "timestamp": 1672752498,
    "score": 1,
    "keyword": "hispanic manager"
  },
  {
    "text": "Should I Confront Descrimination? Seeking advice before I send my boss an email confronting the descrimination that I experienced when she denied promoting me, late October 2022.\n\nTimeline:\nI started in 2019 as a coordinator, promoted to senior coordinator November 2021, applied for 1 of 5 open analyst positions. Applied and interviewed in September 2022. Was denied promotion then promoted to a new position created \"just for me\" as an associate analyst, plus my duties as Sr. Coordinator (November 2022).\n\nI referred an employee to replace my coordinator position who was hired in April 2022. My trainee (white male) applied at the same time as me for the analyst position and was promoted in September 2022 to the analyst position. There are 2 analyst positions that have yet to be filled. \n\nDescrimination History:\nTrainee was assigned a \"high priority\" state that I assisted on (aka prepare everything and having the director approve before filing) for 2 years. I even trained the previous analyst how to do the job. \n\nI am a Hispanic female. The coordinator/admin positions have been filled with Hispanic and white employees for the past decade (at least) but only the white employees have been promoted to salaried positions. Not one Hispanic employee has ever been promoted to a salaried position in my department, that's 20+ years streak. There is one non-white salaried in the department and they were just hired. \n\nI am coincidentally the only \"analyst\" who is an hourly non-exempt employee; performing the same job as previous salaried analysts. I'm getting paid $20,000 less than my trainee now. They won't even approve overtime for me, I am seriously expected to do two jobs in 40 hours. Instead, I've been instructed to ask my manager to finish any of my tasks left at the end of each day. It's still extra work to delegate those tasks and sometimes they don't get done which then gets blamed on me!\n\nI complete my associates degree in paralegal studies this month, but a college degree is not required per the job description. \n\nMy education and/or race are the only two possible explanations for why I was denied the promotion. When the director met with me via video chat to let me know that I was denied the analyst position and would be promoted to a newly created associate analyst position, she said it was because she and the managers thought I would need too much training. But she is apparently fine with training a new employee who has only 5 months of experience on the hardest job on the team.  Starting to feel like opposite land yet? \n\nI haven't received any negative feedback on my annual review in 2 years. \n\n***********\n\nI want to email pretty much all of what I wrote here, albeit more concisely. \n\nAt the end I want to lay out some acceptable solutions:\nA) Promote me to a \"real\" salaried analyst position and assign me CA. \nB) Promote me to the new salaried operations manager position.\nD) Give me unlimited overtime each week to complete both jobs.\n\nThey will probably fire me under the guise of being 1 minute late clocking in or whatever. But if they do then I will file a complaint all the way to the top. I'm planning to find a new job anyway, just can't leave this month. \n\nI've already spoken with an employment attorney and following their instructions. But this post is mostly to vent, hear about similar experiences, and advice on how to phrase my points listed above.\n\nThanks!",
    "title": "Should I Confront Descrimination?",
    "subreddit": "careerguidance",
    "timestamp": 1673399483,
    "score": 1,
    "keyword": "hispanic manager"
  },
  {
    "text": "Continue towards plumbing license or take construction project management job offer? Hi all,\n\nI realize this is a very personal decision, but I'm sort of new to the trades and figured I'd consult people who have insight into various sides of things.\n\nFor background, I'm 32 and sort of worked as a handyman for about 8 years. I worked for an organization that liked building stuff fast with little care for detail or craftsmanship (two things important to me). I did general property caretaking, removed a lot of poorly done concrete, poured a lot of concrete poorly, welded a lot of metal fences from CNC scrap, a little metal roofing, etc.\n\nI don't feel like I have a ton of construction experience, but over the years I've been a helper for framers, finish carpenters, roofers, welders and plumbers.\n\nI stumbled into plumbing while working for the aforementioned organization as well as on a horse ranch at a later point when there were problems and nobody else was brave or stupid enough to attempt repairs. \n\nI felt like I needed upward mobility and elected to go to a service plumbing trade school (only 100 hrs.) in February of 2022. I finished first in my class and have been with a small company for a little over a year now. I've mostly been learning residential service work, but also do some new construction and remodels. They put me in a van after 7 months. Whether that was a good idea or not is a completely different conversation altogether. \n\nStarting the 2nd year of my apprenticeship, I'm looking for a change due to the work environment and also feel the company doesn't have any standards. For instance:\n\n1) Guys of 6 years don't know how to do basic things like solder.\n\n2) Guys will show up late, leave early and get high at work with no repercussions.\n\n3) We keep flooding expensive houses.\n\n4) I keep getting sent to jobs where I'm in way over my head and I don't think that's fair to the customer or contractor.\n\n5) Guys come to work to hang out with their buddies and my motivations are different. I want to learn and excel, not that I'm against camaraderie or anything.\n\n6) There are no formalities that I wish would be extended, such as meetings (group and 1 on 1), quarterly reviews, pay scales, etc.\n\nI've been looking into doing commercial construction plumbing so that I can learn how to do things right and have my work checked by a journeyman for 2-3 years. I own all the code book material I will need and in my state, you can actually be a licensed plumbing contractor with only two years of experience. I'm more than halfway there.\n\nLast weekend, I was doing some overtime work for a younger contractor fellow that I get on with pretty well. We're both as white bread as they come but have conversed in Spanish a couple times after I discovered he picked some up. He works with a lot of Hispanic subs and I just have a passion for learning the language after spending some time in central America. He essentially offered me a job as a project manager if I ever \"got tired of plumbing\".\n\nIn considering this offer, I'm trying to balance joy with future earning potential. I currently make $21.50 (no benefits), which will only go up as I'm able to offer more value. If I switch to commercial, my pay may go down initially, but I'd learn a lot more. I haven't really discussed the offer with the guy yet, but I can't imagine he'd offer me less that $25-$30/hr. with that position. I'm not fluent in Spanish by any means, but I learned on construction sites in Colombia and desire to learn. I do it on my own time, of course.\n\nI think my main concern in the project manager role, is even if there's higher pay initially, is there less overall earning potential? I'm concerned that if I'm not perfecting a trade, I will lose earning potential. Or is that not the case and is project management a mixture of soft skills and general labor?\n\nI have to admit that I've been looking for ways to earn an income with my Spanish speaking. There aren't a ton of things I enjoy, if I'm frank, yet Spanish is one of them. I like to surprise native speakers and also be of help, whether at the grocery store or a jobsite. \n\nWould it make sense to get my plumbing license and then go into a management role, or is that silly?\n\nI can't say for sure that I enjoy construction. I like it because it's practical. I wasn't very financially literate in my 20's and feel like I'm trying to make up for lost time. It's crazy what it takes to actually be able to afford a house today and not be house poor. I like the idea of building a simple house primarily yourself with skills acquired over the years. Joy can be a tough topic for a lot of people, but I do like creating tangible things that have a very practical function.\n\nI'd be curious if any of you have a little insight into my situation. \n\nThanks and have a great weekend!",
    "title": "Continue towards plumbing license or take construction project management job offer?",
    "subreddit": "careerguidance",
    "timestamp": 1682640312,
    "score": 0,
    "keyword": "hispanic manager"
  },
  {
    "text": "Mentor doesn’t have ANY conversations with me at internship. TLDR:\nHow do I deal with unhelpful mentor?\n\nI am doing a hybrid CS dev internship at a large local non-tech company in FL. Predominantly mid-aged to old white/Hispanic with a fair number of immigrated South Asians/Indians.\n\nSince the very first day, my mentor did not try to have any conversations with me, no 1:1 introduction apart from the Teams meeting my manager set up. She didn’t even try to set up any in-person chat/lunch but in 2nd week we both happened to be working in-person the same day and thus officially met. \nHer uninterested demeanor really put me off by then so that day I only greeted her, asked her 1 or 2 work related questions, said bye and left at the end of the day. I am South Asian international student so I don’t know if she has any stigma against me. Over the next few days, I showed fake interest and learn a bit more about how she got the job and such but that’s it.\n\nIn our daily sync with my 2 other remote contractor mentors, she joins the meeting and just sits there without doing any explanations while the others walk me through - happening for 2 months now!\n\nMy manager and even his boss are super chill and rather impressed with my work ethics and quick working mindset and I want to work on this team cause of them but since she sits right beside me, I don’t want to see her.\n\nMy concern is how she’s gonna evaluate my performance, other 2 mentors seem somewhat satisfied with me.\nHow do I deal with her and do I raise this issue to my manager?",
    "title": "Mentor doesn’t have ANY conversations with me at internship.",
    "subreddit": "cscareerquestions",
    "timestamp": 1690123189,
    "score": 0,
    "keyword": "hispanic manager"
  },
  {
    "text": "Are they being friendly or flirty? I work in a warehouse and there are two Hispanic individual contractors, “shoppers” as my manager calls them, who love to tease me. One of them always calls me chica and mama while the other calls me Señorita. I’ll admit I do sometimes get butterflies in my stomach. Am I overthinking?",
    "title": "Are they being friendly or flirty?",
    "subreddit": "blackladies",
    "timestamp": 1691504789,
    "score": 13,
    "keyword": "hispanic manager"
  },
  {
    "text": "My boss thinks white men are more competent. She's a middle aged white woman too.  I'm a white passing Mexican young woman.\n\nI got my white boyfriend a job working with me in a corporate type office job. The issue is that my boss gives my bf all the opportunities that I feel should be given to me. Mostly because I have not only already performed the work when they needed and made award winning improvements. I proven my competence many times over and had to work way harder than my boyfriend to get half as much. \n\nIt's like my boss has us switched around in her head. Like she thinks all the work I've done was actually done by my boyfriend. Everything I've wanted she's given to him. The position he was promoted to, that I thought I was a shoe in for, has exclusively been held by white men. \n\nI was actually the first Hispanic female in her department to have ever been promoted from hourly to salary. The company has existed since the 80's and she's been in the department for 20 years. And she did everything to prevent my promotion, going so far as to make a position just for me which was the same work plus my previous position for 3/4 of the wages paid.  \n\nShe chooses to have a less productive and competent person do the task because she believes white men are unequivocally more competent. The black men and Hispanic team members have also been passed over on ALL opportunities in favor of less experienced white men. We're the only minorities in the department btw. \n\nAnd she always insists on working with the white men in our department, even going as far as re-writing the job description to work under her instead of the actual managers. It's creepy, but I never disclosed the employee I recommended is also my boyfriend. \n\nI know this job isn't forever, but I just needed to vent. Me & the bf are good, it's not his fault that he benefits from a white patriarchal society while I suffer.",
    "title": "My boss thinks white men are more competent.",
    "subreddit": "Feminism",
    "timestamp": 1689373817,
    "score": 8,
    "keyword": "hispanic manager"
  }
]