[
  {
    "text": "Student cussed and yelled at me today after telling them to put the phone away \nI am a ELL instructional specialist/IC and I am helping a teacher with classroom management (not ESL but they still assigned her to me because we're understaffed). I was in her classroom and saw a student on the phone. Our principal has been very strict about the no-phone policy, students are supposed to put their phone in a bin as they walk into the classroom and only take it out at the end of the block. The principal has been reprimanding this teacher because of phone usage in her classroom, and since I am trying to help her and I don't want her to get in trouble, when I saw a student on her phone I told her to either give it to me to put it in the bin, or do so herself, like I always do in this kind of situation. She kept it in her hand so I stood there waiting and hell broke loose...\n\nShe started yelling at me, telling me to leave her alone, she called me a b*tch multiple times, told me to go f*ck myself multiple times. 2 of her friends intervened and doubled down, yelled all kinds of profanities, and also called me a racist (these students were black but so is 80% of the class and the other 20% are Hispanic students, she was just the only one I saw on her phone).\n\nIn the end she put the phone in the bin and I walked away. At the end of class, I talked to her 1:1 explaining that I am trying to help, telling her that the school is strict on the policy (which she already knows) and I don't want the teacher to get in trouble. She was much calmer, she said she understood, and she even smiled. Even so, I am very ashamed to admit that I have been shaking and my heart has been racing since that happened and once the bell rang I hid in the bathroom to cry. I feel so stupid for reacting like this but unfortunately I am autistic and this kind of direct confrontation really takes a toll on me.\n \nEven though I really enjoy my job, I feel like I have no business working in education because I am weak and not assertive enough and I constantly get disrespected and walked over not just by students but colleagues as well. I feel stupid because I think I handled this very poorly but at the same time I don't know what I could have done differently besides minding my own business. I just want to help this teacher because if she doesn't get this under control, she will keep being reprimanded by the principal and might get written up.",
    "title": "Student cussed and yelled at me today after telling them to put the phone away",
    "subreddit": "Teachers",
    "timestamp": 1692890473,
    "score": 1035,
    "keyword": "hispanic principal"
  },
  {
    "text": "You don’t fit into the community I teach in a predominantly Hispanic and black school in the south. I am a white, female, history teacher. I understand my privileges I have and I know I will never fully understand the true struggles my kids will face, but I love and respect them. \nI have been playing a cat and mouse game with my principal to see if I am being rehired and I finally was able to talk to him today. I have had great observations, never been pulled in to be disciplined, volunteer as much as I can, and try everything to help my students pass. He then shocks me by saying he’s “not planning to rehire me at the moment for a couple reasons.” \n\n1) He needs a teacher who will do more hand holding with the students. I literally do the assignments in class with my students so they don’t have to do homework. All I require of my kids is to participate in the discussion, ask questions, and write down the answers we come up together. \n\n2)The biggest issue: I apparently was accused of a racist incident before spring break. The accusation of what I supposedly said shocked me to the core because this wouldn’t have been a slip of the tongue mistake I made. But a bonefided racist comment which I would never make. This shocked me to my core. I was never told there was an investigation, what I was accused of, and the outcome until this meeting where he’s telling me that he’s worried I would make the school have another news worthy racist incident (we had a huge one at the beginning of the year.) He then said there was no substantiation behind the claim or they found no evidence but still…\n\nBecause of reason 2 he is not rehiring me. He essentially told me to only apply to the primarily white schools in the county and none of the diverse schools. He also said that he’d write me a recommendation letter a good one but not a glowing. \n\nI don’t understand how I can do everything they tell me, use all the crappy district resources, take abuse daily, and have never complained and still I’m not rehired. I’m just trying to wrap my head around this and my anxiety is spiking that not only does someone believe I am possibly racist but this can affect my future career. I just needed to vent, because I’m spiraling thinking of every interaction.",
    "title": "You don’t fit into the community",
    "subreddit": "Teachers",
    "timestamp": 1681351440,
    "score": 23,
    "keyword": "hispanic principal"
  },
  {
    "text": "Can you fix a broken system from the inside? This is my 5th year teaching high school chemistry. \n\nI have 2 classes with no co teacher because none of the students have IEPs, and there are students in there who clearly should have IEPs. But they're labelled gen ed, and I'm told the assessment process would take too long and not be very beneficial to a high school student, so don't bother. So naturally they're struggling HARD and I'm being blamed for being a bad teacher who's kids can't get the simplest of concepts. \n\n&#x200B;\n\nLet me teach you all some chemistry real quick. \n\n>Electron configurations tell you how electrons are configured (or arranged) in an atom. They look like this: 2-8-5 for example.  This means that in this atom, there are 2 electrons in the first shell, 8 electrons in the second shell, and 5 electrons in the third shell.  How many shells are in this atom?  \n>  \n>We learned this in Unit 2 and when it came around in Unit 3 they couldn't tell me. I give the analogy: there are 2 students at this table, 4 students at another table, and 3 students at another table. How many tables are there? Student: IDK. \n\nThis isn't just one student. Many couldn't tell me the number of shells in an atom from an electron configuration.  So we review the next day. And just my luck, I get observed by the principal. \n\nI collected the data to share with him and of the students who showed on the do now that they couldn't count shells, 70% of them got the exit ticket right.  So the intervention was mostly successful, right? Nope, the principal doesn't see it as effective. He's \"shocked that they students are struggling with such a simple concept\" and indicates that it's my fault. \n\nThis is not their first lesson on the topic. I've explained it multiple different ways. some of them are still to this day struggling to count the shells.   It's literally just counting.  2-8-5 has 3 shells.  2-8-18-6 has 4 shells.  2-3 has 2 shells.   You don't even have to know chemistry to answer this, I taught it to a 64 year old who had never taken a chem class in her life in less than a minute.\n\n&#x200B;\n\nI've looked at the statewide data for grades 3-8 and less than half of all students demonstrate proficiency in ELA and Math. The majority of my students are black or hispanic, and for these populations approximately 30% of students demonstrate proficiency in ELA and Math. \n\nThe school system has failed them all their lives and now it's my fault they aren't passing chemistry? This is a class that is considered a college prep course by most schools in the state!\n\nLiterally what can I even do?  Everyone just says, \"we're all facing the same problem,\" but no one wants to work towards fixing the problem. And any time I mention a problem and suggest a solution or explain how I'm trying to fix it, I get reprimanded.  I'm just making excuses for my shitty performance. \n\n&#x200B;\n\nIt's clear if I keep trying to advocate for my students and seek help in finding school-wide solutions, I'm going to be discontinued (I'm up for tenure this year). \n\nPeople are telling me to kiss a$$ and get tenure, then become an admin to make change, but the politics of schools around here aren't such that a single administrator is going to make huge change. And I don't want to be admin anyway, they're part of the same system and have to do their own version of all the meaningless paperwork and excessive tasks that we do. \n\nWhich is why I ask, can you even fix a broken system from the inside?\n\nDo I look for something outside of the education system that works to change it?  Or do I just write it off as too big of a societal problem and move on with my life. Why do I even care so much?  Do I even care?",
    "title": "Can you fix a broken system from the inside?",
    "subreddit": "Teachers",
    "timestamp": 1673125131,
    "score": 7,
    "keyword": "hispanic principal"
  },
  {
    "text": "Suggestions for a week of light intro I will be starting a new position on Monday. After  2 decades with mainly HS freshmen, I moved to a different state. Middle school is going to be a new thing for me (7th and 8th ELD and one 7th ELA). The demographics are very similar to where I taught before, largely Hispanic and low-income, so I am used to that.\n\nThe kids have been rotting away with a sub for a month and the principal said not to worry about doing much academic heavy lifting in the first week. I have a lot of autonomy. \n\nI need suggestions for some light activities that include ways for me to get to know the students and their abilities. I was thinking about doing some typical stuff, 2 truths and a lie, write me a paragraph about themselves (to see who can or can't write without sentence frames or overly structured prompts). A game or two?\n\nThis won't fill up a week, so if you have ideas that aren't just a barrage of ice breakers, please suggest!",
    "title": "Suggestions for a week of light intro",
    "subreddit": "Teachers",
    "timestamp": 1692471757,
    "score": 1,
    "keyword": "hispanic principal"
  },
  {
    "text": "Is early start times a petty reason to leave an otherwise fantastic school? I'm a first-year teacher and ever since the first day of the Spring semester, every time I wake up I've had thoughts of moving schools, literally every morning.\n\nThis is a school I picked mostly because they were the only school I applied to that accepted me, and I am grateful for the opportunity. I've come to really enjoy being at this school, and it has a lot of positives you couldn't get in many other schools.\n\nThe best parts about the school is:\n\n1. Great admin team who actually sides with teachers before students. The principal himself helped me out of some sticky situations with some students, even listening to my request to split 2 boys away from the same period and into different periods.\n2. Great coworkers who are all pleasant to work with\n3. Fantastic diversity. There is a very healthy mix of white, black, hispanic, and asian students. About a 50/10/20/20 split. No other school in the state has ratios like this school.\n4. Insanely early release. Students leave at 1:45 and teachers are allowed to go home at 2:15.\n\nHowever, I just can't deal with the early start times. Classes start at 7:00 but teachers are obligated to arrive at 6:35. Add in commute time and I have to wake up a little before 6 just to get everything ready and arrive at 6:35.\n\nI've never been a morning person and I don't think I ever will be. I've tried going to sleep at 9 and my body just doesn't go to sleep. Even if I somehow manage, I still wake up tired. I really do love every other aspect about the school but I can't lie to myself; waking up at 6 every morning is mentally killing me.\n\nDo you think leaving schools only because of the start time is a good enough reason? Should I try to tough it out? If this was your predicament, what would you do?",
    "title": "Is early start times a petty reason to leave an otherwise fantastic school?",
    "subreddit": "Teachers",
    "timestamp": 1682865730,
    "score": 0,
    "keyword": "hispanic principal"
  },
  {
    "text": "Feeling isolated and exhausted at teaching job where black teachers are the minority I’m currently working at a predominantly white staff school. I’d safe about 7 teachers out of 70 are people of color. The demographic of students is almost evenly spilt between blacks,whites, and Latino students. \n\nI returned to this school after I had a rough experience in a metropolitan area school district . I’m in Georgia btw. I did this because I thought my principal was reasonable and nice ( he was the previous assistant principal when I left the first time and was super kind).  Now I’m regretting coming back . I genuinely think my principal is trying but it’s getting to  me.\n\nOne day last week, one of my students broke down crying telling me that a white boy asked if could call him a n*gger and if his daddy was a slave ? “ I was livid . I told him I heard and felt him but do not ever make them make you feel bad about being black.\n\nI brought this incident up to the assistant principal and he said he “understood”. Never followed up with me. So I went to the principal about this and he told that he had the kid on his “radar” and that the kid was having a “rough time”. I was perplexed at why he was telling me this. He added that the kid could be valedictorian if he wanted to but was just not in a good situation now. But then my principal would jumped back to the fact that he wasn’t condoning his behavior and gave me a long story about how he grew up with black friends and because he was darker skin he was mistaken as Hispanic. \n\nI got more irritated as he continued and essentially let him finish off his point. What causes more pain is that I’m currently in school learning about critical race theory and just how awful American history is in regards to treating Blacks. I need health insurance and a salary but im fearful that if I move districts I’ll have another issue. I just want a space where I feel heard. I’m not sure how to proceed.",
    "title": "Feeling isolated and exhausted at teaching job where black teachers are the minority",
    "subreddit": "blackladies",
    "timestamp": 1674524140,
    "score": 15,
    "keyword": "hispanic principal"
  }
]