[
  {
    "text": "I’m in old school trouble. Pregnant and no idea what to do. Send me some advice!! I’m so deep in the shit if I don’t find a box to stand on soon, it’s going to be over my head and I’ll be swimming. Maybe writing it down and posting anonymously on Reddit will help. \n\n\nHere are my problems in the order of how fucked I am:\n\nProblem 1. I am 25 weeks pregnant and nobody knows, except for everyone I see or talk to or try to walk past a little too close. They all know, because I am the size of a dumper truck. They all say ‘wow you’re getting big’ or ‘your parents must be so excited’. They’re not, because I haven’t been back to Kolkata since April, and they don’t fucking know. \n\n\nProblem 2. When my ultra conservative Indian parents find out I am pregnant, they will immediately:\n\n\n1. Come to England\n\n2. Kill me\n\n3. Find out who the father is (actually, this would be quite useful), if necessary by DNA testing the whole of London \n\n4. Kill him\n\n5. Drag my twitching corpse back to India and force me to marry some fucking annoying Indian guy with awful taste in shirts. \n\n6. Bring up the baby themselves while I finish my degree literally shackled to a desk, to ensure I can’t bring any more great shame on the family. \n\n\nProblem 3. Oh yeah, did I mention. I don’t know who the father is. Ok there’s only two possibilities! Don’t judge me - I’m a student and we have sex sometimes. I just happened to get very lucky twice in one week. And if you’re thinking how irresponsible it was not to take precautions, I fucking did, ok. We used condoms, but we were drunk and I guess something leaked past. Now stop going on about it. I have waddled past both guys around campus a few times, but neither has stopped me to say ‘hi’ or ‘how are you’ or ‘fuck, you’re pregnant, it’s not mine is it?’. They are both blissfully ignorant of their impending fate. \n\n\nProblem 4. Since about week 23 my sex drive has got batshit crazy, but because I look like a waddling Indian whale no guy wants to have sex with me probably because they’re worried if they get too close they’ll fall over my gravitational event horizon and be unable to escape. This is a shame because my tits look amazing, and nobody is getting to admire them. \n\n\nProblem 5. I have zero idea what I’m going to do after the baby is born. I’m a fourth year medical student. I have made absolutely no plans. My medical training so far tells me that in about 15 weeks a baby is going to pop out of my vagina and probably want some attention. What am I doing to do? I haven’t the first idea. Take a year off studying? Give baby for adoption? Sell it on eBay? My rating isn’t that great - I once sold a guy a broken hoover. Could be a problem. \n\n\nI know I know I need to grow up, face reality and get a grip. Here is my plan:\n\n\n1. Find out who the father is. I’m going to have to ask them both to do paternity tests. That’ll be fun. \n\n2. Have sex with him. (Wishful thinking, probably.)\n\n3. Find out whether he wants to be a father. Because loads of undergraduate student guys are just itching to become dads, right? Probably should also warn him that my parents will murder him, definitely, and that he might want to buy a disguise. \n\n4. Tell my parents that despite obviously being a virgin, I have somehow become pregnant. \n\n5. Go into hiding. \n\nI don’t really need advice. I know what I have to do. But somebody send me some solidarity! Everyone assumes I have this impending situation totally under control, whereas in reality I’ve just been pretending it isn’t going to happen! If you’ve been in this boat, send me a PM and we can be friends!!",
    "title": "I’m in old school trouble. Pregnant and no idea what to do. Send me some advice!!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1507186846,
    "score": 203,
    "keyword": "indian judge"
  },
  {
    "text": "In South Dakota, Officials Defied a Federal Judge and Took Indian Kids Away From Their Parents in Rigged Proceedings",
    "title": "In South Dakota, Officials Defied a Federal Judge and Took Indian Kids Away From Their Parents in Rigged Proceedings",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488033561,
    "score": 98,
    "keyword": "indian judge"
  },
  {
    "text": "I was slut shamed as a kid in high school. Sometimes it really bothers me. I need to vent. Well, I am Indian. I am 19 now. When I was 15, I was made to stand up in class, and called a slut in front of everyone by a male teacher just because I was tom-boyish and had way more male friends than female ones. \n\nThat teacher had discussed my “slutiness” with other teachers in the school and they all had the same mentality, so I was looked at by all teacher the same way as Hester Prynne and had an invisible red “S” letter around my neck. They all antagonized me just because of my tom-boyish nature and thought of me as a slut. I was outspoken, they did not like that either. That just added to my shameless slutty nature. \n\nI had no friends. No one at school would even look at me or talk to me. I couldn't ask the teachers for any help. They wouldn't. They wouldn't let me participate in competitions, since I would bring shame to the school with my slutty nature. They'd make me sit in the last bench all by myself. \n\nI was punished way more harshly for meager mistakes than any other kid. I'd have a note written to my parents, or I'd be made to stand in class and listen to the teacher go on and on about character. \n\nMy studies suffered. The last year in the school, in 10th grade, I was sick asf. Missed 7 months. When I came back, I did not get any help from any teacher. I had missed out a lot, and the teachers wouldn't help me with anything. I took supplemental classes and covered up about 200 chapters in 3 months. I gave my exam, i was confident of scoring atleast 75/80 in every subject. \n\nThen the results came. The written paper was external assessment of 80 marks, which was only student dependent. The internal assessment of 20 marks, entirely depended on the teachers. This was a matriculation certificate examination. It had some great value. Turns out, I'd scored about 75 in every subject. Give or take 2 marks. The teachers gave me 5/20 on the internal, on every subject. I ended up with an 83 percent instead of a 95. \n\nI don't even care about the names they called me or how they judged me. I had to cover 200 chapters in 3 months. I cannot begin to tell you how much hardwork and labour it took. And I managed to do well, regardless of my circumstances but they intentionally brought me down with the internal. Even when they knew I needed those marks like crazy. \n\nIt's like they had developed something personal against me for talking to the boys in my class. My hard work didn't matter much in the end. I worked so hard so that I could give the KVPY, a national level science exam for getting a seat in the top research institute in the country. I didn't qualify as my score was below the qualification cut off. \n\nWell done, teachers. \n\nEdit: that kind of behavior on the teachers' part had started when I was 13. It reached it's peak when I was 15. I never realized why the teachers didn't like me even though I was a sincere student and scored well. \n\nThe teacher who called me a slut, used to call my friends into his office and ask them to not talk to me. Since I was a \"bad influence\". If they didn't listen, he'd tell the same to their parents in PTA meetings, and the parents believing a teacher, would make their kids not talk to me. \n\nEdit 2: Thanks for all the supportive comments, Reddit! Really appreciate it.",
    "title": "I was slut shamed as a kid in high school. Sometimes it really bothers me. I need to vent.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1489244170,
    "score": 88,
    "keyword": "indian judge"
  },
  {
    "text": "Indian judge acquits film director of rape after saying 'a feeble no could mean yes'",
    "title": "Indian judge acquits film director of rape after saying 'a feeble no could mean yes'",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1506500299,
    "score": 17,
    "keyword": "indian judge"
  },
  {
    "text": "Help! My father(55m) has thrown me(26f) out of his house. This is going to be so messed up. I apologize in advance. Plz give me some guidance.\n\nMy father is a very strict, controlling, retired military man. He is a narcissist. He has verbally, emotionally and physically abused my mother since they got married, to the point that she is bed-ridden, dying, completely brainwashed and absolutely dependant on him for everything. She is not allowed to have opinions of her own, she gets screamed at mercilessly and even hit at when she was younger. She is a shell, just nothing left inside. Due to her extreme illness, her mind has regressed to a childlike state. \n\nHe has been the same with us. We had a thousand rules in my house. I grew up thinking a father who screamed at you for wearing skinny jeans or finding out your secret stash of shampoo packets or forcing you to eat the dirt you left on the floor was normal. That it was OK that he threatened to shoot my ex boyfriend when he found out I was dating, and no, he wasn't being funny. That having a 5 minute timer to use loo or he would start beating on the door was fine. Talking to any boy was forbidden. Being scolded in public, called a ugly man, mocked for having small breasts. He called me ugly, useless, a whore, dumb, a disappointment, worse than trash, a bad daughter again and again. He forbade me to seek treatment for depression, thought I was just weak. I can go on for hours. He is always right, he can never bend or accept he is wrong, he would rather die even if it's him against the entire world. As a kid, he used to beat me mercilessly for things like me reading Harry Potter books or comics. I got my knuckles crushed with pencils for eating chips. I was always the school topper.\n\nFor context, I am a doctor, I am doing my masters in anaesthesia. I left home years ago for studying. A breath of fresh air. I hated going back to home. Environment of despair and anger and screaming, sad parents. A year ago I fell in love madly with someone who is more or less perfect. Told my parents, my father told me point blank it's boyfriend or my family. He was forcing me to marry a family friend's son within next months. I refused to do so and he threw me out of his house. The reason for his refusal was that my boyfriend isn't a doctor and comes from a well to do family and it would really kill my father and damage his ego to have a richer and more powerful in-laws. He told me he would forever feel like a small man. The end. Hasn't talked with me in 10 months, hasn't let me visit home, won't let my mum talk to me, worse, my mum also hates me now for marrying someone they don't like. \n\nI am on my own. I am in an expensive graduate program. I don't earn much. My father has cut me off legally too. My wonderful boyfriend's family has adopted me, they love me. My boyfriend helps me out financially. Problem? I miss my family. I love my father. I know I have painted a bad picture of him here, but he has sacrificed a lot for me too and has had a hard life. Taking care of my mum is very difficult. I miss my mum. My dad won't let me talk to or meet her. I carry a lot of guilt and shame inside me for abandoning my parents. I live in a very conservative country (India). Most of the people here who know about my relationship judge me for leaving my parents, mostly cuz they don't know the whole story. I keep things mostly to myself, but at times I want to scream out I did all I could. I feel lost. Every step at reconciliation has failed. My father has fought and cut contact with all relatives and friends. There is no one left who can try to advise him, no one he will even listen to.\n\nCouple of months ago, I took a break from my relationship to try to work things out with my parents. I was extremely depressed and dying with guilt. My father told me to commit suicide for all he cares, just not to contact him for funeral charges. So yeah, at this point, if I die, I don't think he will actually care. He has also told my future in laws that I am a horrible, cursed person who will destroy their family. \n\nMy boyfriend hates my father. I don't blame him. We are getting engaged soon. I feel like all bridges have been burnt. I miss my family. They are struggling, getting older, mum is frequently sick. I wish they saw I am happy with this new wonderful family. My parents had such an unhappy marriage, yet they were forcing me to marry a stranger who was creepy and so much older. My father has accepted that my boyfriend is a good man, but he couldn't accept that I found someone I love. In Indian culture, for so many families love marriages are taboo. What do I do? \n\nTl;Dr : I left my home due to falling in love. How do I stop feeling like a terrible daughter and person?",
    "title": "Help! My father(55m) has thrown me(26f) out of his house.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1492870414,
    "score": 2,
    "keyword": "indian judge"
  },
  {
    "text": "Dating question (possibly controversial) Throwaway because I know it's a bad attitude to have and the post may seem inflammatory, but I can't talk about this to my girl friends and I wonder if it's ever happened/currently happens to other black ladies.\n\n\nDo you or did you in the past refuse to date black men as a knee-jerk reaction to them taking us for granted, especially if we're dark skinned? Growing up, I was made fun of, ignored or overlooked by my fellow black classmates and the only boys who had anything nice to say about me were either mixed with a black mom or born of mixed parents themselves or not black at all.\n\n\nIn college, black guys finally seemed interested but only because they had noticed men of other races being interested in me. Some good black male friends of mine acknowledged that this was true, too. I didn't like that at all, it felt like I was only good if I was vetted by other races of men. Deep down, they weren't really attracted to me, they still thought I was inferior for being darkskinned and black (the same rules didn't apply to dark Indian or South East Asian women of course) but thought that surely, I couldn't be this ugly if I was popular with men of \"better\" races (according to them). Combined with seeing everywhere black men worshipping non black women (or playing the \"I have no preference\" card when literally every other race of men prefers their own) in general in the media as well as in my life, I immediately judge any black guy who shows interest in me and know from the beginning I won't date them. I feel like I'm \"sloppy seconds\" and the second a(nother) non-black (or mixed/light skinned) woman comes along, I'm gonna be dumped like hot coffee. It overrides their looks and personality, however pleasing they may be.\n\n\nI also don't want to reinforce their notion that dark black women will always be there and that they can always fall back on us and be welcomed with open arms, no matter how dismissive they've been on us beforehand.\n\n\nNow, I know that it's somewhat unfair to paint all black guys with such a brush. That's why I'm posting. I don't have problems with dating at all otherwise, but I know such thinking is problematic and wonder if other women have been in similar situations.",
    "title": "Dating question (possibly controversial)",
    "subreddit": "blackladies",
    "timestamp": 1492899682,
    "score": 21,
    "keyword": "indian judge"
  },
  {
    "text": "Ontological Commitments, Sex and Gender, by Mari Mikkola Excerpt from \"Feminist Metaphysics - Explorations in the Ontology of Sex, Gender and the Self\", edited by Charlotte Witt.\n\n***\n\n\n**Abstract**\n\n\nThis chapter develops an alternative for (what feminists call) “the sex/gender distinction”. I do so in order to avoid certain problematic implications the distinction underpins. First, the sex/gender distinction paradigmatically holds that some social conditions determine one’s gender (whether one is a woman or a man), and that some biological conditions determine one’s sex (whether one is female or male). Further, sex and gender come apart. Taking gender as socially constructed, this implies that women exist mind-dependently, or due to productive human social activities; thus, it should be possible to do away with them just by altering the social conditions on which gender depends. In addition, some feminists take gender to depend on oppressive social conditions. Changing our social environments, then, would not only unwittingly eradicate women; doing away with women should be feminism’s political goal. I argue that both implications are unacceptable. In response, I argue for a view that is more congenial to ordinary thinking and that doesn’t have the goal of eradicating women.\n\n**Introduction**\n\nThis chapter develops a model, which I will call “the trait/norm covariance model”, as an alternative for understanding the phenomena feminists usually discuss under the rubric of the sex/gender distinction. This well-known distinction gives rise to certain problems that motivate the formulation of my alternative model. Specifically, I have in mind here problems arising from the conventionalist and abolitionist implications that the distinction underpins. First, consider the conventionalist implications: paradigmatically, some social conditions must be met in order for one to count as a woman or a man because gender is (as the slogan goes) socially constructed. One need not satisfy any biological or anatomical conditions; they are relevant only for counting as female or male. On this understanding “woman” and “man” are used as gender terms, “female” and “male” as sex terms.  The implication is that women and men exist mind-dependently or due to productive human social activities: that there are women and men ontologically depends on some social institutions and agents, their beliefs, practices and/or conventions in that women and men could not exist unless the relevant institutions, practices and conventions (with conscious agents upholding them) existed. Women and men are akin to wives, husbands and US senators that also depend on us for their existence.  This being so, it should be possible to do away with women and men while leaving the individuals we call “women” and “men” otherwise intact–we simply alter those social conditions on which gender depends so that individuals no longer count as women and men. Consider a parallel to US senators: their existence depends on certain sociopolitical conventions so that were a political revolution to alter those conventions by abolishing the US Senate, US senators would literally vanish overnight. Those individuals who previously counted as US senators would no longer do so despite being otherwise physically intact (presuming the revolution were a bloodless one). Just as one need not execute US senators in order to eradicate them, the thought is, eradicating women and men does not require physically altering those individuals we think of as women and men. Second, consider the abolitionist implication: in addition to holding a conventionalist view, some feminists take gender to depend ontologically on oppressive social conditions. As a result, changing our social environments would not only unwittingly eradicate women and men: doing away with gender should be feminism’s political goal.  \n\n\nAs I see it, both implications are problematic and ones that many ordinary social agents are unwilling to accept. Ordinarily, women are thought to be human females, men human males. As a result, their existence is not thought to depend on productive human social conventions, practices and institutions so that we could abolish women and men leaving intact females and males simply by altering our social landscapes. Conventionalist implications, then, are unintuitive. Further, ordinary social agents often find the abolitionist implication that “after the revolution” women and men will no longer exist objectionable. Many of my students, along with other feminist philosophers, do not see being a woman or a man as problematic per se. Rather, the problem is how we are viewed and treated as women and men. For ordinary thinking, then, the idea that feminists should aim to do away with women and men harbors undesirable ontological commitments.\n\nThese problems are generated by a clash between the paradigmatic feminist and everyday conceptions of sex and gender. Ordinary thinking does not separate sex and gender in the way many feminists do, thus neither seeing the existence of women and men as mind-dependent nor holding that gender is something to be eradicated. We can avoid this clash in one of two ways: either feminists work hard to modify everyday conceptions of sex and gender so that they are in line with the conventionalist and abolitionist views, or feminists modify their conceptions of sex and gender so that they are closer to everyday thinking. Here I will endorse the latter option and propose a way to conceptualize the phenomena usually discussed under the sex/gender distinction to avoid the unintuitive and undesirable ontological commitments. I will do so by developing what I will call “the trait/norm covariance model” to replace the usual sex/gender distinction. My alternative model will involve redrawing the boundaries of the sets of gender and sex traits and dividing these traits into new sets: descriptive traits (traits of which there is “a fact of the matter”) and evaluative norms (norms that express judgments about descriptive traits). For instance, the paradigmatic gender trait of wearing make-up and the paradigmatic sex trait of having ovaries will both count as descriptive traits (one either has ovaries/regularly wears make-up or not). But, my model also acknowledges the influence of social norms: certain evaluations (like being judged to act, be or appear “feminine”) can be seen to covary with particular descriptive traits, which accounts for why some traits are supposedly appropriate for women and others for men.4\n\n \n\n\n4\nBy way of illustration, I will consider Sally Haslanger’s fascinating and innovative recent account of gender (“Gender and Race”; “Future Genders”; “Social Construction”), which has the conventionalist and abolitionist implications. Next, I will examine what precisely is problematic about these implications in order to motivate my alternative model. I will then outline my trait/norm covariance model, ending with a discussion of how it avoids the problematic ontological commitments considered.\n\n**Haslanger on Gender: An Example**\n\nHaslanger’s account of gender has conventionalist and abolitionist implications: it takes the existence of women and men to be mind-dependent in the sense of depending on human social practices and conventions, and it takes these conventions and practices to be oppressive—for her, since gender is a product of oppressive social forces feminists should aim to eradicate it. These implications are underpinned by a distinction between sex and gender that many feminists have historically endorsed. Paradigmatically: “sex” denotes human females and males depending on some biological features (like chromosomes, sex organs, hormones or other physical features to do with reproduction) whereas “gender” denotes women and men depending on some social factors (like social role, position, behaviour or identity). As is well known, the motivation for drawing the sex/gender distinction was to counter biological determinism that took some (supposedly) biological facts to explain behavioural and psychological differences between women and men. Instead, feminists argued that these differences have social causes. They distinguished biological and social/psychological differences and began using the term “gender” to denote the latter. For instance, Gayle Rubin (who was one of the first feminists to articulate this distinction) used the phrase “sex/gender system” in order to describe “a set of arrangements by which the biological raw material of human sex and procreation is shaped by human, social intervention” (165). For Rubin, although sex differences are fixed, gender differences are the oppressive results of social interventions that dictate how women and men should behave: women are oppressed as women and “by having to be women” (204). For her, gender is the social interpretation of sex and an oppressive one at that. However, women’s oppression is mutable by political and social reform that abolishes gender. As Rubin saw it, feminism should aim to create a “genderless (though not sexless) society, in which one’s sexual anatomy is irrelevant to who one is, what one does, and with whom one makes love” (204).\n\nFor Haslanger, gender is constitutively constructed: in defining it we must make reference to social factors (“Ontology and Social Construction” 98), and, in particular, we must make reference to unequal social positions (“Gender and Race” 37–43). In so doing, Haslanger aims to debunk the ordinary view that gender classification is a matter of anatomy. Commonly, being female is thought to be sufficient for womanhood; Haslanger, on the other hand, takes the conditions for satisfying “woman” to be social rather than biological. Her project involves showing that although the use of the term “woman” is thought to track a group of “individuals defined by a set of physical ... conditions [it] is better understood as capturing a group that occupies a certain ... social position” (“Social Construction” 318). And the social positions that our gendered classification scheme tracks and that make gender ascriptions apt crucially involve reference to subordination and privilege. For Haslanger, societies in general tend to “privilege individuals with male bodies” (“Gender and Race” 38) so that the social positions they subsequently occupy are better than the social positions of those with female bodies. And this generates sexist injustices. For her:\n\n>S is a woman if [by definition] S is systematically subordinated along some dimension (economic, political, legal, social, etc.), and S is “marked” as a target for this treatment by observed or imagined bodily features presumed to be evidence of a female’s biological role in reproduction.\n\n>S is a man if [by definition] S is systematically privileged along some dimension (economic, political, legal, social, etc.), and S is “marked” as a target for this treatment by observed or imagined bodily features presumed to be evidence of a male’s biological role in reproduction (“Future Genders” 6–7).\n\nThese are constitutive of being a woman or a man: what makes calling S a woman apt is not that S is female, but that S is oppressed on sex-marked grounds; what makes calling S a man apt is not that S is male, but that S is privileged on sex-marked grounds.\n\nHaslanger acknowledges that debunking projects like hers sometimes require a “radical change in our thinking” (“Social Construction” 319). After all, her proposal is counterintuitive: privileged females like, arguably, the Queen of England would not count as women on this view. But Haslanger’s project does not aim to capture what ordinary language users intuitively have in mind and her aim is not to illuminate our commonsense understandings of gender terms. Haslanger’s analysis is, in her terms, ameliorative: it aims to elucidate which gender concepts best help feminists achieve their legitimate purposes thereby elucidating those concepts feminists should be using (“Gender and Race” 33).  That is, endorsing her classification scheme is a pragmatic political choice. And (Haslanger holds) feminists should choose her account of gender since it will be helpful in feminist fights against sexist injustices enabling feminists to identify and explain persistent inequalities between women and men in terms of their social positions. Insofar as Haslanger takes being a woman to be a social matter crucially tied to oppression, she holds that “it is part of the project of feminism to bring about a day when there are no more women (though, of course, we should not aim to do away with females!)” (“Gender and Race” 46). Since what it is to be a woman is by definition tied to sexist oppression, gender justice would eradicate women by abolishing those social structures that are responsible for sex-marked oppression. Women and men could not exist, unless sexist oppression existed; that women and men exist is mind-dependent being the result of oppressive human social activities. And feminism’s goal should be to dismantle those social structures responsible for gender and, by extension, women and men.\n\nProblems with the Conventionalist and Abolitionist Implications\n\nEarlier I claimed that ordinary thinking finds the conventionalist and abolitionist implications of accounts like Haslanger’s problematic. I also claimed that these problems are underpinned by a clash between different conceptions of sex and gender. Let’s examine the worries in more detail.\n\nThe Conventionalist View Is Unintuitive\n\nFor Haslanger (among others) gender depends on something social and not on anything biological. This prima facie makes being a woman ontologically on a par with being a US senator, a wife or a landlord. And, it seems, just as one can cease to be a wife by changing one’s social relations (by getting a divorce), one should be able to cease to be a woman by changing those social relations constitutive of womanhood. But a closer examination suggests that being a woman is not ontologically on a par with (say) being a wife. To tease this out, consider the following claims:\n\n(1)\tFor a week last summer, James was a woman.\n\n(2)\tFor a week last summer, James was a US senator.\n\nThese statements take “woman” and “US senator” as social notions. The first takes womanhood to be about easily perceptible gender markers like clothing and appearance (James lived “as a woman” for a week last summer). The second takes James to have been treated in ways that enabled him to count as a US senator for a week (for instance, James was elected to the US Senate, but due to a political scandal lost his position very quickly). Now, consider:\n\n(3)\tAfter seeing John’s body, I realised that John is a woman.\n\n(4)\tAfter seeing John’s body, I realised that John is a US senator.\n\nThese claims are not about social factors. We can understand claim (3) and it makes sense to us, although we are clearly using “woman” as a biological term. However, when we substitute “woman” for “US senator” in (4), the statement no longer makes sense to us. After all, just by looking at one’s body, it’s not possible to know that one is a US senator. That is, when used as a social term, “woman” is on a par with “US senator”. But we can also use “woman” as a biological term, which makes “woman” and “US senator” come apart. The upshot of this is that “woman” is not a purely social term ; for ordinary thinking, then, being a woman is not on a par ontologically with what it is to be a member of some other social kind. And this suggests that it is not obviously true that women and men’s existence is minddependent in that one can cease to be a woman (or a man) just by altering one’s social environment. Because ordinary thinking does not see being a woman as a purely social matter, conventionalist implications (like the implication that we can eradicate women and men via change in our social environments) are hard to accept. The paradigmatic feminist distinction between sex and gender clashes with everyday thinking. Due to this, ordinary thinking doubts the possibility of eradicating gender via social change, because it ties sex and gender together.\n\nA defender of the conventionalist view might hold that claim (3) doesn’t really make sense either, but we are fooled into believing that it does precisely because ordinary thinking ties sex and gender together when it shouldn’t. So, if we thought about womanhood in the right way, we would see that (3) is also senseless. That would leave claim (1) where “woman” is a social notion making it akin to “US senator”. My worries about unintuitive ontological commitments are dispelled prima facie making it possible for one to cease to be a woman just by altering one’s social environment. But this raises some further questions that the defender of the conventionalist view must answer: Precisely what kind of social change would abolish women and men? Which beliefs, social conventions, linguistic practices and relations would have to be altered for one to no longer count as a woman or a man? And which social institutions, relations and structures would have to be dismantled so that women and men were to cease to exist wholesale? These questions cannot be answered in any intuitively obvious introspective manner. In fact, answering them is the stuff of feminist philosophy and a huge point of contention. Admittedly, this contention may be generated by gender being such an incredibly complex phenomenon that discerning the kind of social change that would eradicate it is extremely difficult; we may simply be ignorant of the kind of change needed, but it is possible to eradicate gender via social change. This may be so. But it may also be that feminists cannot agree on what social changes would do away with women and men because doing so just by altering one’s social environment is not possible. Bluntly put, perhaps it is just plain wrong to think that women and men’s existence ontologically depends on some social factors. I am not concluding that it is; I am merely making a strategic point. The issue of, on which social conditions the existence of women and men depends, is so intractable as to be unhelpful. If gender really is such a complex issue that it is hugely difficult (if not impossible) to articulate and agree on what sort of social change would eradicate it, the most useful move would seem to be to give up the quest. Pragmatically, feminists should not try to uncover which social factors are responsible for the existence of women and men, but, instead, should settle for the much less contentious view that human actions significantly shape the way we are as women and men. No feminist (to the best of my knowledge) denies this claim. The concerns I have raised here are not decisive and do not rule out conventionalism about gender altogether. But, as I see it, the less contentious view I have floated here is the one that feminists ought to endorse precisely because of its less contentious commitments. \n\n**The Abolitionist Implication Is Undesirable**\n\nOn views like Haslanger’s, gender is also a product of oppressive social conditions and, thus, something feminists should seek to abolish. But this abolitionist view may not be conducive to feminist interests since for ordinary thinking it harbours undesirable ontological commitments. To tease this out, contrast such abolitionist strategies with a different (what I will call) “re-evaluative” strategy. They both have the same starting point: feminism is about ending oppression that women as women face. But their ways of achieving this goal differ, which alters the strategies’ outcomes. Abolitionist accounts take womanhood to be by definition tied to oppression so that it is not possible to be a woman and not be (in some sense) oppressed. Reevaluative accounts do not take being a woman to be per se oppressive. Instead, they recognise that our social circumstances create environments where women are viewed and treated in ways that disadvantage them, perhaps by associating some traits with women and using this association to justify disadvantageous treatment. Nonetheless, by altering how women are viewed and treated it is possible to be a woman and yet not be oppressed. So, on the former view, gender justice would dismantle unjust social hierarchies thus doing away with women and men; on the latter, it would dismantle such hierarchies while retaining women and men (roughly) in a re-evaluated sense.\n\nThe strategy to follow comes down to a pragmatic political choice. But if ordinary social agents think that eradicating gender is undesirable, it may be strategically wrongheaded to endorse an account of gender that has abolitionist implications. Some anecdotal evidence supports this: my feminism students tell me time and again that they think the abolitionist strategy is aiming to eradicate something that need not be eradicated—the “feminist revolution” need not do away with gender and doing so would result in (at least some) good being unnecessarily lost. Many insist that the ways in which people are treated as woman and men is the problem feminists should focus on—being a woman or a man is not primarily the problem. And many claim to find their gender a source of positive value. After all, it is certainly true that, although one may be discriminated against due to one’s gender, it can still be something one values positively; in a similar sense, one can take pride in one’s racial group membership despite being socially disadvantaged by it. The everyday conception of gender clashes with feminist conceptions like Haslanger’s. As a result, ordinary thinking doubts the viability of eradicating gender because it sees gender as being at least partly a positive social identity rather than being a wholly negative one.\n\nProjects like Haslanger’s do, of course, start by aiming to alter the ways in which we are viewed and treated as women and men. So, in a sense, the abolitionist and re-evaluative routes go hand-in-hand to begin with. But the abolitionist strategy runs into difficulties if many social agents are unwilling to follow it through. Haslanger is asking for a significant shift in people’s self-conceptions and acknowledges that she is asking social agents to understand themselves in ways that are not ordinarily part of their gendered self-understandings (“Gender and Race” 48). In so doing, she is “call[ing] upon us to reject what seemed to be positive social identities” and to refuse to be gendered women and men (“Gender and Race” 48). I agree with Haslanger that a change in our self-understandings is called for; but I wonder if the change that she is calling for is the right kind of change given that ordinary thinking does not see the viability of eradicating gender. Again, my point is strategic: accounts that have abolitionist implications are likely to be extremely demanding. It will take a lot of convincing to make ordinary social agents view their gender as not being even in part a positive social identity and to make them refuse to be gendered women and men, if social agents do not believe to begin with that this is necessary. And, one might wonder, whether scarce feminist resources should be directed at something other than trying to convince social agents to revise their self-understandings in this manner.\n\nFortunately my students always do express a desire to see an end to gendered oppression. And clearly this is what Haslanger also wants, which may suggest that really the parties to the debate are just talking past each other. Everyone wants the same thing: gender justice. Haslanger’s rhetoric just differs from how we ordinarily talk about women and men. Usually, acknowledging this does not dispel my students’ worries; they still find it puzzling that Haslanger doesn’t use gender terms as people ordinarily do and wonder why she is confusing matters with her conception of gender. Of course, Haslanger’s rhetoric has a specific, valuable purpose: to motivate a certain kind of social and political response that undermines sexist oppression. But, given the kinds of worries I have mentioned here, strategically I think that this kind of response can be better motivated by understanding the phenomena feminists discuss under the rubric of sex and gender in a way that does not imply women and men no longer exist “after the revolution”. The worry is that accounts with abolitionist implications probably would not motivate positive social change, if this change requires that social agents must give up something they do not want to give up.\n\n**The Trait/Norm Covariance Model**\n\nThis section develops my trait/norm covariance model as an alternative to the sex/gender distinction. To begin with, it is important to note that, contrary to traditional feminist views, I do not take the term “woman” to be a purely social gender term. Ordinary speakers have, to use Ron Mallon’s terminology, indicative features in mind when they call someone a “woman”:\n\n>there is a distinction between those properties that are indicative of category membership (such as easily perceptible racial [or gender] markers), and those that are central. A property is indicative of category membership if having the property increases the likelihood that one is a member of a category. In the United States wearing a dress is indicative of being a woman ... [But w]earing a dress is neither necessary nor sufficient for being a woman.\n\n(652–3)\n\nIndicative features of womanhood include one’s appearance (clothing, hairstyles, make-up); behavioural patterns; social roles; and anatomical and bodily features (body type, shape, size, amount of body hair and how one “carries” one’s body). These features are conceivably involved in everyday gender ascriptions. Paradigmatically, feminists hold that the indicative features mentioned are not exclusively gender traits in that they include features which are taken to be paradigmatic sex traits (to do with being female or male). But, ordinary language users often deploy “woman” on the basis of anatomical sex features such as body type; “woman” is not a purely gender term for them, but (bluntly put) a mixture of sex and gender. So, ordinarily “woman” denotes individuals who are taken to possess features indicative of womanhood. This does not (and certainly should not) limit the application of “woman” to women-born-female; the term also applies to trans women, individuals “assigned male at birth whose gender presentation may be construed as ‘unambiguously’ female” (Bettcher 46), who call themselves “women”.\n\nMy contention is that feminists should use the term “woman” as ordinarily as possible. And the trait/norm covariance model that I will outline next will be sensitive to these reflections about ordinary language use. The model I am proposing deals roughly with the same phenomena that the sex/gender distinction does. It just understands that phenomena in a different way that is, I submit, more fruitful in being more congenial to everyday thinking. On my view, we redraw the boundaries of the sets of gender traits and sex traits giving up the labels “sex” and “gender” to denote those traits. Instead, the traits are divided into sets of descriptive traits and evaluative norms. The former (in a sense) describe “the way the world is” and include physical and anatomical traits (e.g., chromosomes, ovaries, testes, genitalia, body shape and size), one’s appearance (e.g., one’s clothing, make-up, haircut, amount of body hair), roles (e.g., whether one undertakes caretaking roles, engages in childrearing tasks) and self-conceptions (calling oneself a woman or a man). These are features of which there are “facts of the matter”—it isn’t in any sense mysterious or down to value judgements whether one has ovaries, undertakes childrearing tasks, or calls oneself a woman. (This does not mean that values were not involved in singling out descriptive features, like anatomical traits, or that descriptive features are not socially malleable; but more on this shortly.) Evaluative norms are to do with stereotypical judgements: whether one is judged to be, to appear to be and/or to act in ”feminine”, ”masculine” or “neutral” ways. Evaluative norms attributed reflect value judgements and cultural norms. So, on my and the paradigmatic feminist schemas:\n\n Paradigmatic feministmodel|.. |Trait/normcovariancemodel | ..\n--------------------|----------------------|--------------------------|----------\nSex\t               |Gender                 |Descriptive traits\t   |Evaluative norms\nHaving ovaries\t|Wearing make-up |Having ovaries\t           |Being “feminine”\n\t                |Being “feminine”   |Wearing make-up\t|\n\nWhat does it mean to say that evaluative norms covary with descriptive traits? Just that we take certain traits to be of certain kind. So, the trait/norm covariance relation is constituted by particular descriptive traits being viewed in a particular manner by us. I take “femininity” to mean “associated with women”, “masculinity” to mean “associated with men” and “neutrality” to mean “associated with neither or both”. That is, depending on how we view particular descriptive traits, they either covary with femininity, masculinity or neutrality. And certain trait/norm pairings are currently linked to women, others to men and still others to neither or both. They can be so linked in a global or (more often than not) in a local manner. For instance, being short-sighted is globally neutral: as far as I know, the trait is nowhere associated exclusively with either women or men thereby globally covarying with neutrality. Then again, possession of testes appears to be globally masculine, possession of ovaries globally feminine. Quite often, though, the trait/norm pairings are local differing from one context to the next and depending on social and cultural factors. So, although all cultures have traits that covary with femininity and others that covary with masculinity, the configurations of these trait/norm pairings can differ depending on their location. To illustrate, take long hair. In many UK communities it is no longer strongly associated with women and often covaries with neutrality. However, in UK Asian-Indian communities that do not consider it appropriate for those picked out by “woman” to have short hair, having long hair covaries more strongly with femininity. But, of course, other social and cultural axes affect this covariance relation even within a culture: in many UK Indian Sikh contexts, neither men nor women are expected to cut their hair, which suggests that (in these social contexts) having long hair covaries with neutrality. However, in these contexts, other practices to do with hair covary with femininity and masculinity, like the practice of Sikh men wearing turbans. The trait/norm pairings are interrelated: with those picked out by “man”, the pairing “having long hair/neutrality” is interrelated with “wearing a turban/masculinity”; but for those picked out by “woman” the former pairing is not interrelated with the latter pairing. (For more on Asian social conventions to do with hair, see Hiltebeitel and Miller.) The trait/norm covariance relations can also change over time. Wearing trousers is a good example: until quite recently in many Western Anglo-European contexts, masculinity covaried with it. But, relatively quickly, in many contexts it has become neutral. It is now socially acceptable for someone ordinarily picked out by “woman” to wear trousers. The same social value is no longer attached to this trait. Of course, this all further demonstrates that the ways in which the trait/norm covariance relations pan out are not always straightforward. Since the relations depend on beliefs and conventions that change over time and place, they will usually be manifestations of some local and contextspecific beliefs and conventions. There are many complications not least because of differences in contexts and in what norms social agents project on descriptive traits. Nevertheless, it seems fair to say that sometimes seeing how the relations pan out is not complicated and that sometimes social agents do not differ significantly in their ascriptions of norms.\n\nI have said that certain descriptive traits covary with certain evaluative norms, but what explains this covariance relation? I take the existence of this relation to be a thoroughly mind-dependent matter. If you like, wearing make-up and engaging in child-care (to name two descriptive traits) are not inherently or mind-independently feminine–that femininity covaries with them is something that depends for its existence on social factors and obtains because of us. The classification scheme of feminine, masculine and neutral evaluative norms is a strong pragmatic construction; that is, social factors wholly determine our use of the scheme and the scheme fails to represent accurately any “facts of the matter” (Haslanger, “Ontology and Social Construction” 100). So, the classification scheme does not pick out any mind-independent facts about descriptive traits. That some traits are viewed as feminine, masculine or neutral is a consequence of “human-made” fashions, styles, cultural beliefs, social conventions and linguistic practices, which determine what features are judged to be of what kind. The classification scheme of feminine/masculine/neutral is a mere social construction. Furthermore, this scheme tends to be hierarchal in grading traits; this is evident from the devaluing of many activities and features with which femininity covaries (like the devaluing of caretaking work).\n\nOn my model the claim “Jane is feminine because Jane wears make-up” does not capture any mind-independent fact about the world. Yet, my model also takes wearing make-up to be a descriptive trait of which there is “a fact of the matter”. So, it appears that saying Jane wears make-up does capture something mind-independent about the world. It is worth clarifying the notion of mind-independence here to avoid an air of inconsistency. Consider driving. In the United Kingdom, people drive on the left-hand side of the road; in the United States, they drive on the right. Which convention is the correct or true one? We cannot say because the context-specific conventions that govern driving are mind-dependent: they depend for their existence on productive human social practices and require that certain human-made background conditions are in place. Such conventions are, of course, mutable. The UK government could just decide to alter conventions governing driving. Obviously doing so in practice would be hugely difficult and certainly no easy feat. But the point is that ultimately conventions come down to us—there is no mind-independent fact about which side of the road is the correct side for driving. However, that people drive on the left in the United Kingdom is mind-independent in another sense. When I state “People in the United Kingdom drive on the left” I am stating something that is true mind-independently: the truth of the statement is not (if you like) up for grabs. I cannot just decide that the statement is false and drive on the right. (Or, I could, but probably with quite tragic results.) So, given certain background conditions, it is a mind-independent fact that in the United Kingdom people drive on the left irrespective of the fact that the convention to drive on the left is minddependent.\n\nThe descriptive trait of wearing make-up is akin to the convention of driving on the left: it is mind-dependent in that it is a trait that depends for its existence on particular human-made social conditions (it requires that certain human-made background conditions are in place). The trait is also socially mutable: wearing make-up might, for example, go out of fashion thus prompting people to abandon the practice. Nonetheless, that Jane wears make-up is (in another sense) mind-independent. The truth or falsity of the statement “Jane wears make-up” is not up for grabs: either she does or she doesn’t. This is akin to the claim “People in the United Kingdom drive on the left”: however mind-dependent—due to productive human activities— the respective conventions (to drive on the left and to wear make-up) are, whether the statements “Jane wears make-up” and “People in the United Kingdom drive on the left” are true or false is not open to debate given our current conventions. By contrast, the claim “The convention to drive on the left is better than the convention to drive on the right” is utterly mind-dependent. Whether this statement is thought to be true or false depends on one’s view or opinion, in addition to the convention to drive on the left being a product of human social practices. \n\nNow, although it is a mind-independent feature of reality that Jane wears makeup, that Jane acts in a feminine way because she wears make-up is mind-dependent. It does not capture any mind-independent facts about the world, like some supposed fact that the practice of wearing make-up is inherently feminine. That femininity covaries with wearing make-up is mind-dependent obtaining due to productive human activities—because of us. This further illustrates that the trait/norm covariance relation is not a causal relation in the sense that the former causes the latter.\n\nChildcare activities or the practice of wearing make-up do not cause femininity to covary with them; rather, our beliefs and judgements cause this. To illustrate, think about morality. Standardly moral philosophers agree that the act of giving to charity covaries with moral goodness. But does the act cause moral goodness? This depends on one’s metaethical commitments. For some moral realists, the answer might be yes: the act of giving to charity instantiates a realist (non-natural) moral property of goodness. So, the act of giving to charity literally causes moral goodness to pop up in the world because one’s actions instantiate the property of goodness. For moral constructivists, however, the answer might be no: the act of giving to charity covaries with moral goodness because we project moral goodness onto the act of giving to charity. Roughly, we have constructed a moral world in which giving to charity is considered good. So, the relation between giving to charity and moral goodness is not a causal one in that the former causes the latter. That giving to charity is considered to be morally good is down to us. The same appears to be true of what I have said about descriptive traits and evaluative norms: we have constructed a gendered world in which childcare and wearing make-up are considered to be feminine. That is, we— human social agents—are responsible for these covariance relations. And this being fortunately the case, we can also alter them so that childcare, for instance, no longer covaries with femininity.\n\n[continued below](https://www.reddit.com/r/Feminism/comments/6yp60e/ontological_commitments_sex_and_gender_by_mari/dmp1uid/)",
    "title": "Ontological Commitments, Sex and Gender, by Mari Mikkola",
    "subreddit": "Feminism",
    "timestamp": 1504809523,
    "score": 7,
    "keyword": "indian judge"
  }
]