[
  {
    "text": "Horrendous Job Market? I work as a Program Manager for a academic department at a university. I was put in charge/given the responsibility to hire a student assistant for the department. I was like sweet, this’ll be my first time conducting the hiring process all by myself, this’ll be great experience for me. \n\nI published the job ad on Handshake (many universities use this to hire students) and was like “now we wait”. I wish I was exaggerating, but I had received around 50 applications in the first hour. By the time the job posting expired (roughly a week later) I had received 400 applications. \n\nThis is a part time position (10-15 hours a week) that pays minimum wage ($15 in my state). The thing that shocked me the most was that about 85% of the applicants were graduate students at the university. It boggled my mind that why would grad students with bachelors degrees be applying to a minimum wage job with no benefits (and part time!). Also, almost all of these grad students that applied were South Asian (primarily Indian). \n\nI talked to a co-worker about it and she said that times are hard and people are looking for anything. Just to clarify, this isn’t a “Graduate Assistantship” position (those help pay tuition). I was looking for an undergraduate student for the position so all of the grad student applicants were automatically not gonna make the cut. I felt extremely bad because so many of them had emailed me personally and messaged me on LinkedIn about the job. \n\nThis job market is horrible for everyone, including students. Just wanted to share this to see if anyone else in Higher Education can relate.",
    "title": "Horrendous Job Market?",
    "subreddit": "jobs",
    "timestamp": 1694452182,
    "score": 19,
    "keyword": "indian manager"
  },
  {
    "text": "Please throw some in my current dark situation Hey I am 22(M), automobile engineering graduate from India, who truly see myself becoming financially independent in my 40s. I worked at a company for 1 year since it was emotionally and physically draining and had to work for almost 13-16 hours per day (for my non- indian friends, this is how work-life imbalance In India is ). I resigned my job had some savings, traded and lost my savings( please don't judge, I know the game and as I was improving my emotions in trading the capital was finished, since the money was tooo less). My parents are employed so now I am at my home, doing an online course( which I am not interested in, since I am doing it just to show my parents that I am working on  myself). I really wanna do something on my own, thinking of.doing dropshipping. I am a person who can really work hard and I know it myself. My dear friends,\n1) can somebody give some ideas for some passive income for myself \n2) What is your opinion in going back to bangalore and working as a delivery boy during night and working On a side hustle during daytime \n3)What are some options that I can apply with my degree in management and maybe hospitality field \n4)how is abroad studies now, I am in a dilemma whether to leave since I hear India is the next big thing \n\nCan everybody post an opinion and if somebody is in the same boat or have been In this  boat before, throw some light kings , throw some light",
    "title": "Please throw some in my current dark situation",
    "subreddit": "jobs",
    "timestamp": 1698493043,
    "score": 3,
    "keyword": "indian manager"
  },
  {
    "text": "Discrimination or just overreaction ? I wanted to share my recent job-seeking journey and some of the challenges I've faced. It has been quite a frustrating experience as I've been actively sending out numerous resumes each day without any luck in landing interviews.  I've received many calls from recruiters, all seem to be Indian staffing companies, and unfortunately, my resume hasn't been getting submitted for consideration.\n\nI've made efforts to seek feedback on my applications, but unfortunately, responses have been few and far between. Just yesterday, one recruiter NAIVELY shared with me the disappointing reason behind the lack of progress - his manager preferred to submit resumes from Indian candidates. It was disheartening to realize that I am excluded due to my origins.\n\nTo provide some context, I moved to the United States five years with 10 years of experience in finance and BA. \nI spent the first 2 years here just settling and learning English.\n\nMy most recent position in US was as a Business Analyst within a team that lacked diversity.\nWhile I loved what I was doing, to I often found myself taking on tasks beyond my designated role.\nThe workload was extremely heavy, and I never voiced my complaints since I'm the type to find ways to be efficient. Whenever I successfully managed my workload, my manager would assign me additional tasks. As a result, I ended up working 11-12 hours each day without any breaks.\nWhen I set my status as offline on Teams, I receive a call from my manager inquiring about my current tasks. I had the impression that he wasn’t doing anything but tracking my work and assist to meetings.\n\nAnother challenge arose during meetings, where my colleagues would converse in their native language(they are all from the same country) leaving me feeling isolated and left out. Despite my efforts to communicate my need to understand the discussions, the conversations continued in their language. Their excuse : they forget out of habit. \n\nHowever, the tipping point for my departure came when I was denied a band during my conversion to full time employee .\nI might have been able to accept that band if a more reasonable explanation had been provided. Regrettably, I was informed that they can’t give me a higher band than a colleague who joined around the same time. \nThis was disheartening, especially considering my greater experience, relevant credentials, and broader skill set compared to hers. That was her first experience as a business analyst after years working as a teacher assistant🤔 I was more confused and chocked when I found out that her resume was displaying very different experiences . This is something Ive never encounter in my whole career. \nThis unequal treatment was demoralizing, and it reinforced a sense of discrimination that I had hoped to avoid \n\nI share my experience not only to vent my frustration but also to shed light on the challenges that some of us may face during our careers. Discrimination can come in various forms, and it's disheartening to find it within professional settings. I'm determined to continue my job search and hope to find a workplace that values diversity and recognizes individual contributions fairly.\n\nThank you for taking the time to read this. If anyone has encountered similar challenges or has advice to offer, I would greatly appreciate your insights.",
    "title": "Discrimination or just overreaction ?",
    "subreddit": "jobs",
    "timestamp": 1692972127,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "How to help a colleague/friend who's in a controlling relationship and being bullied at work? I have a colleague at work and we both get along really well. We're both in our 20s and work in a high stress job (healthcare). We've made plans to hang out outside of work but her husband doesn't let her.\n\n&#x200B;\n\nMy friend has recently become the target of bullying at work from some of the managers. I think it has stemmed from multiple long term medical absences and slow progression on workplace goals, but there is no excuse for the behaviour. The sort of things that happen are all minor incidents when taken alone, but in combination betray the overall pattern of bullying. Unfortunately, this form of bullying is really hard to put into words and report.  \n\n\nAt the same time, she is in an arranged marriage with a very controlling (potentially verbally abusive) man. This is well known in the workplace. They are both Indian, but my friend has lived most of her life in the UK (where we live now). Apparently before her husband moved to live with her in the UK she would go to work social events, hang out with co-workers she got on with etc. Normal social stuff. Now she is not allowed to do any of that, her husband uses the excuse that she needs to work on her career progression. When she told me this I offered for her to come around to my house to work on our portfolio's together. She was really keen on this idea, and was really looking forward to it, unfortunately her husband didn't allow it. When she is at home she is expected to do all the housework whilst acting as her families therapist, even whilst physically unable to walk; she has no time to do additional career work on top of this.\n\n&#x200B;\n\nBecause of the pressure from both home and work her self-confidence is in the gutter. It is ironically starting to effect her performance at work even more, which of course makes her doubt herself further. She's a lovely woman, incredibly kind and smart, and as someone who was brought up in an abusive family it breaks my heart.\n\n&#x200B;\n\nI've asked her to keep a discrete notebook for incidents that happen at work so that she can collect evidence of the pattern of bullying, but beyond that I don't want to overstep. I did recently raise an incident myself to a different manager not involved within the bullying as I was present and witnessed it occur. Beyond that I do not want to keep pushing matters and make her feel like she cannot talk to me without me escalating something against her will.  \n\n\nAfter that same incident, I went to give her the heads up that I spoke to the nice & trusted manager about it and re-iterated that it is not okay for anyone to behave the way the initial manager had to her. I also brought up the fact that she had mentioned she'd need to ask her husbands \"permission\" to do something relatively straight forward. I said how she could tell me to back off if she was uncomfortable, but that it is not normal to not have agency over her own life or be able to make her own choices. I acknowledged that obviously there is a cultural background that I have not experienced so will not understand the pressures of, but whilst she is Indian she is also British, and even if she wasn't there is no excuse for someone to be that controlling of her. We had a brief conversation about the situation where she acknowledged that things weren't great for her right now. I re-iterated that the way she was spoken to was not acceptable at work or at home, and she agreed. I told her I wasn't going to push it too deeply, I just wanted to make sure that she knew that it wasn't acceptable anywhere, and that she needs to remember she has done nothing to deserve this treatment. I reminded her I'm always there if she feels like she wants to talk or needs someone to reach out to. She later texted me thanking me again for everything.\n\n&#x200B;\n\nIn all honesty, I really want to just tell this woman to come live with me and my boyfriend & quit this job. She really does hate it at work now. She has panic attacks thinking about coming in to the bullying, and then she doesn't even get respite when she gets home. Unfortunately she is trapped; her husband has said that if she doesn't get her portfolio finished soon/if she quits he will move them both to India. She thinks that if she can get her portfolio finished she will get to stay in the UK, but it sounds like her husband will move them regardless of what she does/doesn't do. We've spoken before about these issues on many different occasions.  \n\n\nI really don't know how to help her further without pushing too hard and making her scared to talk to me. I feel like I have pushed as far as I can without making her uncomfortable or weakening our relationship. She knows that her situation is unacceptable, but I think it has gone on for so long that she's in that mindset of \"it's acceptable because it's me\". I want her to know that I will support her however I can, and I have previously told her she can stop with me and my partner if she ever needs/wants to. All I can think to do now is to keep supporting her as I have been at work and keep reminding her when appropriate that she doesn't deserve this treatment. Other than that I think I will have to wait for her to realise and act on her own, but I'm worried that the consequences of her doing that (culturally and within her family) will prevent her from acting. \n\n&#x200B;\n\nI'm really stumped on how I can help her further without pushing too far and sticking my nose where it isn't wanted. If anyone has any advice it would be greatly appreciated. I may not be able to reply immediately but I will read all the comments. Thank you.",
    "title": "How to help a colleague/friend who's in a controlling relationship and being bullied at work?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1694803055,
    "score": 7,
    "keyword": "indian manager"
  },
  {
    "text": "Please tell me that healthy love is real, share your successful love stories? (sorry for the inevitably super long rant ... I am neurodivergent and allergic to being succinct)\n\nI know that I am relatively inexperienced, I have only ever been in two relationships in my life but both of them were at least somewhat emotionally abusive with narcissistic tendencies. I know that part of this is on me, I was raised by and currently live with my mom who has textbook NPD, I know that I am broken but I try my best to proactively work on my healing, mindfulness, yoga, educating myself on psychology etc.\n\nI have extremely healthy and supportive friendships, although now that I am out of university most of them are long-distance, which is painful. I am proud of myself for that, I know that I am lovable and that people enjoy spending time with me, I owe my friends my life to be honest. But when it comes to romantic love I feel like I can't get it right. I'm also autistic so that complicates things, I feel like it makes me naive and primes me to assume other people just want to give love too and since I see manipulation as a waste of time.. they must too! (wrong!)\n\nMy first boyfriend was such a sweet, thoughtful, and affectionate teenage boy when I fell for him in high school but I stayed with him for nearly 8 years, and I shouldn't have. I wanted to support him because his mother has Huntingtons, his younger sister has been tested and has it as well, and he and his youngest sister both have a 50% chance but haven't gotten the test as far as I know. He was a crypto bro and manipulated me, using my empathy and promising we'd use the money to help his mom, but he lost 2.5 million in 2021, developed a porn addiction, and barely even acknowledged that I existed while we lived at his parent's house, unless he wanted me to get dolled up and go out with him to boost his ego. He wouldn't even make eye conact with me for days sometimes back then. During university I did most of the chores, bought most of the food, paid for internet, he totally used me and then later called me lazy and hard to live with because I felt like his mother and lost sexual attraction to him. He fell into using drugs and alcohol and even started hanging out with gang members so I finally left him. He left me in debilitating debt, living with my abusive mom, and elderly obese aunt who has hallucinations and bathroom issues. I have no job, though I always seem to be interviewing, making it to the second interview, hitting it off with the hiring manager, and STILL not getting the job! So I am a full-time caretaker and do all the domestic duties for them and three pets. I am in the process of interviewing for to be a host on my favourite podcast but even that final step isn't until January, it's been hell trying to find employment, most positions have upwards of 300 applicants even for crappy jobs! So that has been really stressing me out, I was covering maternity leave at my last position and tried to find another job before she came back, but no dice. \n\nMy current boyfriend, who logically I know I should break up with, I've only been with for 7 months and I fell hard for his gentleness, nurturing personality, and how safe and cared for he made me feel. I took 3 months to fully allow myself to fall for him and to be intimate with him for the first time, I thought I was being so cautious, I wanted to do everything right. One thing I am thankful for is that sex with both him and my ex has been very emotionally connected, they both liked to focus on my pleasure, and I always felt safe in the knowledge that any sign of protest would be taken very seriously in a heartbeat and I could say no to anything at any time. I know a lot of women, a sickening number of us, have trauma around sexuality, but I really don't. I literally associate it with being held and adored ... maybe that's another thing making me reluctant to end my current relationship. So many men are addicted to porn and want to do horrible humiliating/violent things but with him, I know I'll be held as much as I need. My life is in shambles right now so I didn't realize how much I needed that, I'm so embarrassed but I am addicted to that tenderness, I know that there are lots of men and women who would be thrilled to have me sit on their lap and stroke my hair and let me fall asleep in their arms, I KNOW that, but I still want him as much as he's hurting me.\n\nThe issue is that he flakes on plans last minute, sometimes only sees me once a week or once every two weeks, and takes hours upon hours to answer my texts... I didn't think I had an anxious attachment type but this relationship has been setting me off soooo badly. Mostly when i get triggered I keep it to myself or try to gently express that i would love to see him more, but recently I did send the ill-advised paragraph texts. He's Indo-Canadian so first it was that the wedding seasons post-covid have been madness and he didn't know he'd need a plus one when invitations went out so with multi-day Indian weddings and work I got put on the back burner a lot in the summer. His job is also very stressful, he's the youngest on his team, and people honestly take advantage of him. He recently got his dream position in the same company so I was hoping things would get better but I have just never felt like the priority, I tried to calmly express this to him but no real change has happened, I feel really lonely and neglected and it hurts a lot. I learned what bread-crumbing is and it describes what I'm feeling to a T. \n\nWhen we are together in person things are super easy and natural and wonderful but often he makes promises he doesn't keep, or pushes back for ages, and the words not matching actions do add to my anxiety. For example, he hyped up this great job with his aunt alllll summer and asked her about helping me get a position but then never followed through, I know it was awkward for him but he hyped it up to me for MONTHS and got me really excited and the job market is so brutal here that I was really invested in it and I wish he never brought it up. Then it was a birthday weekend getaway and a bunch of gifts, which I've seen with blankets thrown over them in his room for months, my birthday was in July... and it's November. I didn't need him to promise me these things to like impress me??? But now I just don't feel like I can trust his word.\n\nRecently, I got mad at him because he texted me saying he would come to see me, but I knew he'd probably be too tired from work and flake last minute so after shaving everything and getting all dolled up I thought I'd feel like even more of a clown when he flaked so I let him off the hook and said if he was too tired he didn't have to come. He then said basically he was too tired, so why promise in the first place??!! UHG! but that we could spend the whole long-weekend cuddling and hanging out ... and then he added \"and having lots of sex\" which set me off because lately I feel like he wants to take me out weekly or bi-weekly to be seen with me in public and then hook up in the back of his big truck, and that makes me feel shitty. I appreciate the fancy dates truly, but what I'm asking for is to just spend more time with him even if we are just in the same room with him working on work stuff and me applying to jobs. But we can't do that because he hasn't even introduced me to his parents, I've met his aunt, his older sister, all his friends, his cousin and I know there are cultural issues but he says he wants to marry me so why is he hiding me from his parents??? My mom is worried it's because I'm white but he has another aunt who is white so I wouldn't be the first in the family! And when another mutual Indo-Canadian friend grilled him about it and how she was worried he was stringing me along because he was afraid his family wouldn't accept me, he said his family wouldn't have an issue with it so???? \n\nI sent him a bit of a rant, but it wasn't aggressive, I was trying to logically explain how I felt and why and what I would appreciate changing in the relationship. He then sent me this fucking Andrew Tate video about how you shouldn't be a simp and if a woman doesn't appreciate your generosity you need to punish her by pulling back your time and attention... Like I'm some misbehaved dog! He had previously sent me an Andrew Tate video and I explained to him the dark context he didn't know about the creep and asked him not to send me any more videos of him because he makes me very uncomfortable, so he sent another one knowing how I would feel! Then when I told him again why I don't like Andrew Tate and that I had previous negative experiences dating men who were fans of his, AS CONTEXT, he said \"I don't appreciate you comparing me to other men, and I don't like being upset on my weekends so I am out with friends.\" then he ignored my texts until the next day while I cried myself to sleep. I even told him that he doesn't need to compare himself to Andrew Tate just because he has money and infamy because he is already 100000x the man Tate will ever be.\n\nI just wanted to love him and be sweet to him, but since the conflict, I haven't seen him in three weeks. He texted me saying he thought it over and wanted to fix things but then this weekend he got Lasik so that didn't happen. And now he hasn't texted me in two days, I know I need to let him come to me but I hate not having a resolution and I do not want to break up with him over text... but the more time goes on the more reluctant I am to even talk things out, I can't endure this pain much longer, I feel so rejected and like I'm a burden to him for wanting a bit more quality time and enough respect to get a text back within a reasonable time frame. That feels super disrespectful, even a \"hey! super busy today but I will text you tonight! Love you!\" IT TAKES 30 SECONDS and it would make me feel so much more valued and loved. Like this is bare minimum stuff! It almost feels like he is self-sabotaging or he's scared because he's never actually been in love like this before. It just feels absurd that a 27-year-old man can't just come by and talk through a conflict in person, I even told him after he avoided me by going out with his friends that we could have had it resolved and been naked and cuddling by 11pm! I don't yell, I don't name call, I am a very easy person to have hard conversations with!\n\nHe also found some TikToks I made in the heat of the moment about the Andrew Tate thing and one of me deleting my wedding pinterest board, but I didn't even know he knew my TikTok and I know it was immature but I needed to express how I felt, he made me delete them... even the previous positive ones I made about him... even though nobody knows any of them are specifically about him. Yes I shouldn't have made them but demanding I take them down felt a bit controlling too tbh. I know this relationship is a bit toxic, I know I'm not as much of a priority as I should be for him, but I can't let go of the hope still because I love him so much. The loneliness and the feeling of being a fool when I get all ready just for him to flake hurts sooooooooo badly though, I can't sustain it much longer. But he thinks it will naturally get better once we live together and now that he has his dream job and hopefully won't be as overwhelmed by work... but I'm scared, I don't want to go from lonely girlfriend who feels neglected to lonely WIFE. I miss how safe I used to feel, I don't want this to just have been a summer romance and a life lesson, but I feel like I'm trying to have a relationship with a super-avoidant ghost! I know my financial situation is horrible but I did tell him that on the third date in detail, so he could run if he wanted to. I honestly don't believe in love like I used to and it's killing me, I tried to be so careful and I got my heart broken again!\n\n**TL;DR - PLEASE if you have a healthy and loving partnership please tell me that it's possible I need to read about some real-life examples right now to give me hope. I know a healthy and stable partnership takes a lot of work but I am so willing to do that work as long as the other person is as well, but right now I feel like I've been fighting alone. I need to read some success stories so badly, so I would really appreciate anyone willing to share. Brag and gush to your heart's content! I want to feel your joy, it will sting a bit but I need hope most of all. <3**\n\n&#x200B;",
    "title": "Please tell me that healthy love is real, share your successful love stories?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1701149462,
    "score": 5,
    "keyword": "indian manager"
  },
  {
    "text": "First talking stage went shit, update to my previous post  \n\n16F's first serious talking stage did not go well. Rookie mistakes were made.\n\nHere's the story. I downloaded this stupid app called Wizz, its like Tinder for teens (i know what you're thinking, yes its as stupid as you may think, and yes all the guys are horny). I was dealing with my fair share of not so interesting guys, maybe 1 or 2 actually in my city, most of them from out of town, wanting nudes though. Then a guy messages me, lets call him A. A hits me up with this cringy ass Cars movie pickup line that I don't understand. I kinda asked him to clarify, he didnt really. Then I asked Snap AI, sent a screenshot to him showing that I asked AI and he said my stupidness was cute. We talked a bit and we exchanged Snapchat. From the start. it was a pretty romantic tone. He came on me kinda hard, and I was slowly falling for him. There were a few things I thought were cute, one that stood out to me is that he grew up in a Indian/Desi enclave (Brampton), so he was familiar with the culture. I liked this A LOT because I never had a guy understand it. He isn't completley conventionally attractive, but he is hot imo. Hes got a kind of smolder naturally, its pretty good. Anyways, we talked for maybe a day or 2 before I realized, it looks like he wants a girlfriend. I knew that I'm not too keen on being in a relationship rn, especially since my parents dont allow it. So I messaged him, and I told him \"Hey, yk I like u and i think ur cool but i feel like im not what you're looking for, so if a girlfriend is what you want maybe you should talk to someone else\". He says \"Ru trying to get rid of me\". I said no, I'm just saying if a girlfriend is what you want then maybe you should find someone else. He said lets try talking romantically. I said sure, why not. We got to know each other a bit, I found out his ex is a lot like me (Brown girl from GTA who likes kpop), etc. I will admit, the way we talked to each other, the fact he called me \"my love\", etc. was a bit too much like we were already dating. I thought about this, and I thought it was weird but I didnt act upon it, because I was falling for him, pretty hard. Soon the topic came to meeting in person. He really wanted to, I was not super keen. But, I agreed anyways. I liked him too much to say no, plus I was really attracted to him, and I havent even had my first kiss. I started realizing, this is the closest I've ever gotten to having a boyfriend. That excited me, I really wanted one. I started to get pretty attached. I've had some heartbreaks before because I got attached, but I feel like this one was the worst, especially since the attraction was mutual. We both liked each other, he would say \" I want u\", and \"I wanna see you\". I reciprocated. Anyways, past few days-ish he started getting a bit distant, and although he was a dry texter in general, he was getting worse. Also, he would not respond for a longggg time to my simple texts of hey how are you. This is probably the main reason he lost interest in me. I was a bit clingy, maybe even acting like a girlfriend. But also the tone was such that one would feel that way. This was my first talking stage too, keep in mind, so I wasnt very sure how this stuff works. Anyways, Pitbull is coming to our city for a music festival, and I really wanted to go. A had bought tickets for all days, so I thought im killing two birds with 1 stone. I struggled, but I managed to get tickets, and find someone I know to go with, and to also cover up for me (I told my parents I was going with her, but I was actually going to be with A). I texted him yesterday, saying hey, i bought the tickets! cant wait to see u in person.\n\nThis mf.\n\n\"Oh idk if I’ll be able to see u tho\"\n\n\"I Wanna be with my friends and I’m scared to meet yours\"\n\n\"Lately honestly I’m not feeling ready for a relationship\"\n\n\"My mental health is fucked\"\n\nhe FUCKING LED ME ON. SO BAD. HE PLAYED ME, HE MADE ME ATTACHED, AND THEN JUST LEFT AND NOW WANTS TO BE FRIENDS? HE SAID HE WANTS TO HAVE KIDS WITH ME, WANTS ME, WANTS TO SEE ME, WANTED TO TALK TO MY PARENTS AND CONVINCE THEM TO LET HIM DATE ME.\n\nWhere did this all come from? Well he said hed been feeling like this for not too long now, and that I should find someone else, but we can still be friends. I cant actually believestill went ahead and talked with this mf after red flags, like him ont really trying to get to know me, him following ig models (most notably a mom breastfeeding her child), etc.\n\nYall. The impact that this has had with me. I didnt sleep last night, I still feel like a numbness in my body, and a hole in my stomach. I thought we could be something, and then he springs this on me. Where was his mental health 2 weeks ago when we started talking? Why would he say he wants a girlfriend to love when hes not ready? He doesnt even want a situationship, so basically he wants no romance with me. I am extremely hurt, and might be my first real heartbreak. Ik im 16, ik what you're thinking. There will be more, even better. I agree, but it hurts a lot. I tried downloading Wizz again but theyre all the same, and I feel like I wont find someone like him. Yes I am desperate for attention I think, because I've felt ugly and unwanted all my life, and heres a guy who does like me, calls me cute, beautfiul, my love, and wants to be with me.\n\nSomeone help me please I don't know what to do.\n\n**tl;dr:** first talking stage went bad, I now feel sad and hurt, and I need guidance.",
    "title": "First talking stage went shit, update to my previous post",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689276510,
    "score": 0,
    "keyword": "indian manager"
  },
  {
    "text": "CMS launches a new model for Primary Care > Today, the Centers for Medicare & Medicaid Services (CMS) announced a new primary care model – the Making Care Primary (MCP) Model – that will be tested under the Center for Medicare and Medicaid Innovation in eight states. Access to high-quality primary care is associated with better health outcomes and equity for people and communities. MCP is an important step in strengthening the primary care infrastructure in the country, especially for safety net and smaller or independent primary care organizations. The model seeks to improve care for patients by expanding and enhancing care management and care coordination, equipping primary care clinicians with tools to form partnerships with health care specialists, and leveraging community-based connections to address patients’ health needs as well as their health-related social needs.\n> \n> The goals of MCP are to 1) ensure patients receive primary care that is integrated, coordinated, person-centered and accountable; 2) create a pathway for primary care organizations and practices – especially small, independent, rural, and safety net organizations – to enter into value-based care arrangements; and 3) to improve the quality of care and health outcomes of patients while reducing program expenditures.\n> \n> The MCP Model will provide participants with additional revenue to build infrastructure, make primary care services more accessible, as well as better coordinate care with specialists. CMS expects this work to lead to downstream savings over time through better preventive care and reducing potentially avoidable costs, such as repeat hospitalizations. MCP will run for 10.5 years, from July 1, 2024, to December 31, 2034. The model will build upon previous primary care models, such as the Comprehensive Primary Care (CPC), CPC+, Primary Care First models, and the Maryland Primary Care Program (MDPCP).\n> \n> CMS will test this advanced primary care model in Colorado, Massachusetts, Minnesota, New Jersey, New Mexico, New York, North Carolina, and Washington. CMS will work with model participants to address priorities specific to their communities, including care management for chronic conditions, behavioral health services, and health care access for rural residents. CMS is working with State Medicaid Agencies in the eight states to engage in full care transformation across public programs, with plans to engage private payers in the coming months. The model’s flexible multi-payer alignment strategy allows CMS to build on existing state innovations and for all patients served by participating primary care clinicians to benefit from improvements in care delivery, financial investments in primary care, and learning tools and supports under the model.\n> \n> “The goal of the Making Care Primary Model is to improve care for people with Medicaid and Medicare,” said CMS Administrator Chiquita Brooks-LaSure. “This model is one more pathway CMS is taking to improve access to care and quality of care, especially to those in rural areas and other underserved populations. This model focuses on improving care management and care coordination, equipping primary care clinicians with tools to form partnerships with health care specialists, and partnering with community-based organizations, which will help the people we serve with better managing their health conditions and reaching their health goals.”\n> \n> Strong relationships with primary care teams are essential for patients’ overall health. Primary care clinicians provide preventive services, help manage chronic conditions, and coordinate care with other clinicians. By investing in care integration and care management capabilities, primary care teams will be better equipped to address chronic disease and lessen the likelihood of emergency department visits and acute care stays, ultimately lowering costs of care. This model will support participants with varying levels of experience with value-based care, including Federally Qualified Health Centers (FQHCs) and physician practices with limited experience in value-based care, as CMS continues to work to reduce disparities in care and drive better patient experience and outcomes.\n> \n> “Ensuring stability, resiliency, and access to primary care will only improve the health care system,” said CMS Deputy Administrator and Center for Medicare and Medicaid Innovation Director Liz Fowler. “The Making Care Primary Model represents an unprecedented investment in our nation’s primary care network and brings us closer to our goal of reaching 100% of Traditional Medicare beneficiaries and the vast majority of Medicaid beneficiaries in accountable care arrangements, including advanced primary care, by 2030.”\n> \n> The model includes a progressive three-track approach based on participants’ experience level with value-based care and alternative payment models. Participants, which include FQHCs, Indian Health Service facilities, and Tribal clinics, among others, in all three tracks will receive enhanced payments, with participants in Track One focusing on building infrastructure to support care transformation. In Tracks Two and Three, the model will include certain advance payments and will offer more opportunities for bonus payments based on participant performance. This approach will support clinicians across the readiness continuum in their transition to value-based care, furthering CMS’s goal to ensure 100% of traditional Medicare beneficiaries are in a care relationship with accountability for quality and total cost of care.\n> \n> Primary care organizations within participating states may apply when the application opens in late summer 2023. The model will launch on July 1, 2024.\n\nIt appears this new initiative will favor “value based care”? Do current providers think this will improve compensation for PCPs and improve care for patients?\n\nhttps://www.cms.gov/newsroom/press-releases/cms-announces-multi-state-initiative-strengthen-primary-care\n\nhttps://innovation.cms.gov/innovation-models/making-care-primary#:~:text=Launching%20July%201%2C%202024%2C%20the,related%20social%20needs%20(HRSNs)%20such",
    "title": "CMS launches a new model for Primary Care",
    "subreddit": "medicine",
    "timestamp": 1686831875,
    "score": 39,
    "keyword": "indian manager"
  },
  {
    "text": "Seeking advice on a problematic manager and HR I work for a smallish startup focused on tech.\n\nI have been here a little over 2 years and, in that time, nearly my entire team has turned over twice.\n\nSince I stuck around, I got promoted. I am now the lead engineer (also the only engineer) and, since my promo, the expectation has been set that, in addition to my existing workload, I am also expected to routinely submit strategic proposals. I wouldn't have a problem with this at all, and would actually love it, if not for the fact that I already have a full time job managing operations and security.\n\nThis has come from my latest and most toxic boss (#4). I have worked in IT for a LONG time (over 20years) and have worked at huge and tiny companies in that time, for every sort of manager you can.\n\nThis manager is what I have come to call a \"Pretendian\". Pretendians are a once rare but more and more common breed. It's basically the male Indian IT worker who was crafty enough to beat out the hoards back home and make it to the US. His primary skill set is using the privileges of his position for subterfuge, manipulation, narrative crafting, and compartmentalized confusion, in support of his ultimate goal of climbing the ladder quickly.\n\nOutside of that, his technical abilities are entirely superficial. It's clear that what he knows is almost entirely theory, based on things he has read, or knowledge of things he was peripherally involved in. So he can tell you what was done, but never why or how. But he's always certain that his way is the only correct way.\n\nOn top of that, he routinely steals credit for ideas. You will go into a 1:1 with him and talk about things you'd like to do, then in broader meetings, he will present the idea in such a way that, if you didn't know better, you would assume it's his idea. He also doesn't ever give public feedback or kudos, so it works well in supporting the narrative that all the good ideas are his.\n\nHe has less than 10 direct reports, some of which are managers, but he end-runs all the managers to give work directly to their direct reports, which often interferes with the managers' ability to lead as well as undermining their authority when the work contradicts their own priorities.\n\nI brought this up with HR and was initially told to talk to him about it. Skeptical but what can I do, I did talk to him. I told him it wasn't appropriate to leave me out of decision making for the environment as I was responsible for ensuring everything works well and that we are following some semblance of a road map, which he fails to provide.\n\nAt this point, he'd gone on a major shopping spree and bought hundreds of thousands of dollars worth of security tools and spent our entire year's budget in 2 months, which left a major gap between our ability to detect security issues and our ability to remediate them. As a result, about 75% of my time is now taken up with security remediation work. Partially because he's on a remediate 100% of the vulnerabilities immediately 100% of the time, no exceptions kick. So, the opportunity to be included had passed for at least a year but probably more. So, what's the harm in saying yes at that point? The result was I got invited to a bunch of procurement related meetings that were meaningless to me without any relevant purchasing decisions to weigh in on.\n\nI am guessing that most of the responses will be along the lines of \"Find a new job\" but that just fucking sucks. Is that really where we are? God I hope not...\n\nThanks for coming to my TED",
    "title": "Seeking advice on a problematic manager and HR",
    "subreddit": "WorkReform",
    "timestamp": 1690492391,
    "score": 4,
    "keyword": "indian manager"
  },
  {
    "text": "Industrial Phd for Materials Science Engineer in Sweden ? I hope you're all doing well! I wanted to reach out to this community for some career advice.\r  \n\r  \nI'm an Indian national with permanent residency in Sweden. I've been working as a maintenance and support engineer in Sweden for the past two years, with some experience in R&D work, and previously worked as an operator for two years in the same company. I hold a Masters in Materials Science and Nanotechnology.\r  \n\r  \nCurrently, I'm working in the PVD industry in Sweden, but I'm interested in exploring opportunities in the field of space. I'm considering pursuing an industrial PhD in this field, preferably in the Netherlands or another European country where engineers are valued.\r  \n\r  \nHowever, I'm not sure what career path I should take to achieve this goal. I'm looking for a role that allows me to use both my management and hands-on skills. I'm not interested in teaching or academia, but I do want to work directly in the field.\r  \n\r  \nIf any of you have any advice or suggestions, I would love to hear them. I'm open to exploring different opportunities and am willing to relocate for the right position.\r  \n\r  \nThank you for taking the time to read this. I appreciate any insights or advice you can offer!",
    "title": "Industrial Phd for Materials Science Engineer in Sweden ?",
    "subreddit": "careerguidance",
    "timestamp": 1683895333,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "Should I apply to oppertunities outside or within my home country first? Currently looking for my next opportunity within the carbon markets sector especially for carbon project developers as an originator, assistant program manager or other related roles. Planning on applying to places in Singapore to try my luck before I apply to places within my home country. Why Singapore? Well given their govts push towards being the financial hub for all things carbon offsets and carbon markets related, I anticipate a huge demand for talent in this sector by various companies and consultancies. Would love any advice on companies I should take a look at during job hunt. Why not apply to everywhere at the same time? Well in India companies usually give a candidate only 2-7 days time to think through their offer over until they move on to the next candidate for any role. Don't want to say yes to Indian offers until I know Singapore isn't an option for me anymore.\nBackground and current role:- 28M with 4 yrs of experience prior to current job in various marketing, social media, content writing roles including a small venture with a few friends in the social media & marketing space. It didn't work out. Currently working as an assistant manager in marketing and communications, although it's mostly a sales based role for a carbon project developer based in India. Involves a lot of travel (domestically) about 25%. This September I complete a year since I pivotted my career from pure social media marketing, SEO and copy/content writing towards a more sustainability based sector and field. Got the job after doing a year long post-graduation diploma in environmental law from the top law school in my home country. Additionally I am also looking to connect with any one from the sector as a mentor/peer of sorts. Any and all sorts of advice is welcome.",
    "title": "Should I apply to oppertunities outside or within my home country first?",
    "subreddit": "careerguidance",
    "timestamp": 1691487445,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "Which job offer do I pick (USA vs UK)? I was fortunate enough to get two great job offers. This is the first time I am applying to roles outside India, and was surprised by the difference in pay between USA and UK.  \nMoving with my wife and 4 year old child (whose well-being is my primary goal)  \n**UK (Cambridge)**   \n£110k cash + £60k stock; joining bonus: £130k;\n\n\\+ safety  \n\\+ better work-life balance   \n\\+ guaranteed path to citizenship  \n\\+ better weather\n\n\\- fewer companies to choose from in the same area  \n\\- houses are unaffordable (will be renting for quite a while)  \n\\- super-high taxes - effective pay is around 60% of actual.\n\n  \n**USA (Austin)**   \n$250k cash+ $150k stock; joining bonus: $200k;\n\n\\+ significantly more cash/stock and lower taxes;   \n\\+ extremely familiar role;   \n\\+ can buy a larger house with a garden/lawn etc.  \n\\+ multiple other companies in the same city\n\n  \n\\- terrible chance of PR/citizenship (Indian + green-card + non-manager => decades of waiting time);   \n\\- work pressure\n\n&#x200B;",
    "title": "Which job offer do I pick (USA vs UK)?",
    "subreddit": "careerguidance",
    "timestamp": 1701375816,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "I'm a fresher with expertise in Cloud and DevOps looking for suggestions and advice for my two problems. What should I do for this? I’m a recent B.Tech CSE graduate doing a full time remote work as a Cloud Engineer. I’m mainly experienced in AWS and DevOps practices. I'm a quick learner and I have been working full time since 4th year of my college. 6 months into my work, I started fully managing the entire project I was put into, which is developing, handling, debugging infrastructure for 4 teams.\r  \n\r  \nI've got lot of appreciations from my colleagues and clients but the problem is that it's hard to put the expertise into resume, mainly because of the lack of numbers in experience and every cloud hirers wants big numbers in experience.\r  \n\r  \nI'm working remotely from India and get paid as per Indian standards (12Lakhs per year) but the company is in Canada. I recently got offered to move to Canada with full visa and ticket sponsorship for a new project, with pay as per Canadian standards. But I enjoy working remotely and time with my family and girlfriend, and would like to stay in India for at least 2 more years, until she graduates.\r  \n\r  \nI also write articles as a freelancer, which pays me $500 per article. But this guy hired me after seeing my projects and articles.\r  \n\r  \nThe first issue I have is that I finish my work tasks very easily most of the sprints, and will be doing some extra Proof of Concepts or articles to pass my time. My company asks me to do less work because I finish my tasks soon and as it is a contract with clients, we need to drag tasks 🙂. So I'm wondering if this is good for someone starting off in his career.\r  \n\r  \nSecondly, companies aren't short listing my resume, even though I think I've showcased what I can, when I'm trying for a job change. My LinkedIn is good, with recommendation from clients, projects, articles and stuff.\r  \n\r  \nWhat do I do for this?",
    "title": "I'm a fresher with expertise in Cloud and DevOps looking for suggestions and advice for my two problems. What should I do for this?",
    "subreddit": "careerguidance",
    "timestamp": 1692628949,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "Which career path should I focus on? Hi everyone,\n\nTL DR: Dropped out of college. Worked three different unrelated positions over last 4 years. Now, don't know which position to focus on. Please help.\n\nFirst, let me give you a bit of context. \n\nI am a 29 year old Indian male. I had done 4 years of college from 2011 to 2015. But, I couldn't complete it. I had some supplementary papers(backlogs) to write up, close to 40(i want to justify it saying that my college was messed up and didn't teach us squat, but i take responsibility for my actions and say that I f**ed up), which i wrote up almost completely over the next 2 years. \n\nBut, i had to drop out around 2018(with only 6 papers left) due to some personal reasons and due to the fact that i got a Software Analyst job in Bangalore, which was really far away and traveling back and forth for exams was proving difficult. Also, I was hearing from all over that a graduate degree was overrated and I had decided that i didn't really need it. \n\nAfter i joined my job as an Associate Software Analyst, i did a really good job with ReactJS(picked it up really quick) for FE development, some ETL tasks, Azure Cloud, etc. \nI worked there for almost 8 months, when my manger who was switching jobs and moving to a startup, asked me to come with him to the new company to form a 2-man tech team there(my role would be full-stack developer), since he saw that i could grasp concept really quick and I was easy to communicate with. I started out in the new company with full-stack development. But, over the years, front end is what I worked on the most and ReactJS it's what I used the most. Even though I did use Golang, NodeJS and Python, it wasn't extensive.\n\nFast forward 4 years, i had been promoted twice, first to the role of Scrum master and then to Product manager. This is was due to many efforts in taking additional responsibility, being accountable, etc. This year, in March, the owner of the company shut it down stating that investment was not coming any time soon and he couldn't afford to run it off of his own money any more.\n\nSo, I have been applying for jobs from April and it's been almost 3 months now, and i have only gotten a few interview calls, too few. I am applying for all 3 positions - Product Manager(almost 2yrs exp), Scrum Master(almost 3yrs exp) and React developer(3 years). \n\nLast day, I was told by one of the recruiters that my career deviation and lack of concentration in one area of competency is what causes my application to not move any further.\n\nCurrently, I am confused about what career trajectory to focus on. Feels like i need to go all in on one, and I was thinking i need to focus on dev, because that's the one I am most interested in.\n\nAlso, I had started a full time online degree for data science and Machine learning in 2021, which I'm still pursuing. I have started experimenting and learning ML and modelling using the practical open source projects, etc, and that's what I want to do for the future. Get experience in practical applications of ML, so that by the time my course is done, I would be able to land a job in the domain.\n\nI'm super confused about what to do. Please help me out. Let me know if you want further info.",
    "title": "Which career path should I focus on?",
    "subreddit": "careerguidance",
    "timestamp": 1687929722,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "Is it possible to do transition from customer experience manager to product manager? I’m an Indian (M29) who’s working as a customer experience manager and I don’t like this job much. I want to do transition into product management so is it possible to do transition PM role. \n\nIf yes, how much time will it take?, how should I start(process)?, which course should I buy?, will I get a good paying job in PM role?\n\nAny help would be appreciated!",
    "title": "Is it possible to do transition from customer experience manager to product manager?",
    "subreddit": "careerguidance",
    "timestamp": 1701967394,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Did it only happen to me? I recently changed countries. Moved from India to Canada. My stars were good as my company gave me an offer to join the Canada team. I was overwhelmed. I came and joined here and my manager was based out of the US. I was in for total culture shock. \n\nMy Indian manager asks me to finish company assigned L&D training outside of working hours?? \n\nWhen in meetings I tell her that I have to build more context in order to contribute better, she says how much more context I need to build? Enough context has been built (mind you this being told to me after there was 0 KT from her to me in a domain which is Martian Language to me)\n\nWhen someone gave some feedback about me to her, instead of sharing it with me, she stopped communicating with me. Radio silence. My day to day tasks started coming from other people who would be in meetings with her.\n\nWhen I confronted her, she says that my super boss (her reporting manager) is a workaholic and if i cant keep up, I should find a different team. \n\nThis is now seriously affecting my mental health.\n\nIs this normal here? Am I overreacting? Or are these red flags?\n\nLooking for some serious advice.",
    "title": "Did it only happen to me?",
    "subreddit": "careerguidance",
    "timestamp": 1677267442,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Career Advice: Should I Stay in Dubai to enjoy the 'Bling Life' or Take a Job Offer from Mercedes R&D in India? Hi everyone,  \n\n\nI am an Indian computer science undergraduate with three years of industrial experience, primarily in Machine Learning. I currently work as a Computer Vision Engineer in Dubai for a German MNC. I build video analytics systems for traffic surveillance, but I feel that the subsidiary I am working for lacks process and is poorly managed. Although I am gaining valuable experience in software engineering and web development, my work is slowly distancing me from my expertise in machine learning. My current salary is 48,600 USD/year (15,000 AED/month + 15,000 Annual Bonus), which is an average salary for software engineers in Dubai.\n\n  \nRecently, I received a job offer as a Senior Computer Vision Engineer from Mercedes Benz R&D India, with an annual salary of 35,000 USD/year (25,000,00 INR/year).\n\n  \nI am torn between staying in Dubai for the \"bling life\" and taking the job offer in India, which could provide better job opportunities in the long run. Additionally, I am also considering the potential benefits of having the Mercedes name tag on my CV for future international job opportunities.  \nI would appreciate any career advice from fellow Redditors to help me make an informed decision.\n\n  \nThank you.",
    "title": "Career Advice: Should I Stay in Dubai to enjoy the 'Bling Life' or Take a Job Offer from Mercedes R&D in India?",
    "subreddit": "careerguidance",
    "timestamp": 1677155700,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Career Path Guidance needed- Salary or Skills? Hello everyone,\n\nI am new here and have been following this sub for few days and its very informative. I require urgent advice on a current situation. \n\nI am talking of the Indian job landscape. I am an engineer with an engineering diploma (12th+3 years). Most companies here consider only degrees inspite of me having 15 years full time education. I could not do a job in my field due to health reasons as it is in adverse terrain and I only discovered my limitations while being in a year long training after my diploma. I had to change my field after that and start fresh. I also started pursuing a degree via distance method and it would be done by this year. I started in an inside sales profile in the insurance field in a popular startup. My starting salary was around INR 16k-17k. After 6 months, I switched to a fintech startup in similiar field in sales and customer service with an INR 10K/month(no pf deduction)  hike. My current company has started layoffs and wants me to go to field sales profile. It has only being two months, I started looking outside as I was not entirely comfortable. My company convinced me to just try it out for a month and see if I like it or else they will release me early if I get an offer.\n\nI got an offer from a leading insurer in relationship manager in sales role. However, the catch is the salary is slightly lower (Around 3k lower after PF deductions). The profile involves corporate partnerships and data analysis. I went through a consulting and they advised not to show my current 3 month experience as companies consider a candidate unstable for such a job duration. So the hike is based on my first salary.\n\nI seek advice that is this offer worth taking up?\n I don't think there is a long term future in customer service profiles( please correct me if I'm wrong). This profile gives me the chance to upskill and get skilled in data analysis for future growth. I know basic excel, so working here might help me as they mentioned they need somebody who can work in excel. Is the paycut worth it for future growth? Most people in my current org say that my current 3 month experience in the org won't be worth it anyway.\n\nWhat should I do? Field sales or go into RM profile?\n\nThank you for reading. Looking for advice as I am very confused.",
    "title": "Career Path Guidance needed- Salary or Skills?",
    "subreddit": "careerguidance",
    "timestamp": 1679717352,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Between two jobs i ever wanted. Now I have opportunity to go for it. What should I do? Hey there reddit folks. Let's me go straight to the topic. I am a BSc Hospitality Studies graduate. I am from India and the hospitality industry here is a tough job. I have been working as a chef from the past 3½ years in a reputed Indian brand. \nHere is the twist!!\nNow I have the opportunity to work for cruise ship as a chef the the Pay as for Indian standards is good Approx $880 (₹72000/-) as a commis Chef but recently I also got an opportunity to go for management training programme that helps you to fast track your career by training you to work as a Assistant Manager within 18months and yes it's in Mumbai-India. \nSo the point is. \n1. I can either work for cruise ship as a chef which will pay me will but I will the down the hierarchy chart. \nOr\n2. I can go for the Management Training Programme which will help me to fast track my growth. But yes pay won't be as good as the cruise ships but I am up the hierarchy and they pay me above average salary. \n\nHow should I approach this situation? \nAny suggestions or opinion is appreciated. \nThank you",
    "title": "Between two jobs i ever wanted. Now I have opportunity to go for it. What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1679018768,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Venting First, I love most of the people I met, I love different cultures, and I have friends from many diverse backgrounds. I have two good friends from India who are really cool guys and one from Pakistan and another from Bangladesh. You can joke with them however you want and they are easy to get along with. But, Indian tech workers are a whole other story.\n\nI have two on my team, 1 is QA and the other is an SWE. Both live and work out of India. These guys never say anything during meetings, drag their feet when given a ticket, and the work they do get done we end up having to go back to fix it because it's buggy as hell. They slow the entire team down. At first, I thought it was a language barrier, English is not my first language either, so I can understand. But, whenever I interact with them or look at their work, they speak and write English just fine. Our entire tech support team is also based out of India and is infamous for getting nothing done.\n\nI worked with a few Indians at my previous company and the story was much of the same. There was one guy who was a senior engineer and he was smart as hell, dude was a machine. But, he was so hard to work with and, for lack of a better term, was a condescending asshole. In another experience, I interviewed with Oracle once and all of my interviewers were Indian. When I got the email I had a bad feeling as soon as I see the list of names. Sure enough, 3 out of the 4 were, for lack of a better term, condescending assholes. But, one of the guys was cool as hell. It's such a dichotomy with these guys.\n\nAnyway, at my current job, I brought the issues up to my manager and he told me that this is not the first time they have had issues with \"overseas\" employees. In the past, they hired \"overseas\" contractors from Cognizant and it was even worse with them. The jest of it is that my company saves a boatload of money on overseas people. On paper this looks great, the company saves money, diversity goes up, and gives poorer nations a leg up in the global economy. But, in my experience, the cultural differences are just too vast.\n\nWhen I asked my friends about this they said it is the \"culture back home\". People are not going to go out of their way for an employer as we do in the west. I can understand if your working some shit job, but this is tech. You are working from home and it is fairly laid back with good pay. Again, I think the work culture differences between India and the West are too distinct. \n\nEnd of rant.",
    "title": "Venting",
    "subreddit": "cscareerquestions",
    "timestamp": 1676632792,
    "score": 9,
    "keyword": "indian manager"
  },
  {
    "text": "Im a fresher with expertise in Cloud and DevOps looking for suggestions and advice for my two problems. \n\nI’m a recent B.Tech CSE graduate doing a full time remote work as a Cloud Engineer. I’m mainly experienced in AWS and DevOps practices.\nI'm a quick learner and I have been working full time since 4th year of my college. \n6 months into my work, I started fully managing the entire project I was put into, which is developing, handling, debugging infrastructure for 4 teams.\n\nI've got lot of appreciations from my colleagues and clients but the problem is that it's hard to put the expertise into resume, mainly because of the lack of numbers in experience and every cloud hirers wants big numbers in experience.\n\nI'm working remotely from India and get paid as per Indian standards (12Lakhs per year) but the company is in Canada.\nI recently got offered to move to Canada with full visa and ticket sponsorship for a new project, with pay as per Canadian standards. But I enjoy working remotely and time with my family and girlfriend, and would like to stay in India for atleast 2 more years, until she graduates.\n\nI also write articles as a freelancer, which pays me $500 per article. But this guy hired me after seeing my projects and articles.\n\nThe first issue I have is that I finish my work tasks very easily most of the sprints, and will be doing some extra Proof of Concepts or articles to pass my time. My company asks me to do less work because I finish my tasks soon and as it is a contract with clients, we need to drag tasks 🙂. So I'm wondering if this is good for someone starting off in his career.\n\nSecondly, companies aren't short listing my resume, even though I think I've showcased what I can, when I'm trying for a job change. My LinkedIn is good, with recommendation from clients, projects, articles and stuff.\n\nWhat do I do for this?",
    "title": "Im a fresher with expertise in Cloud and DevOps looking for suggestions and advice for my two problems.",
    "subreddit": "cscareerquestions",
    "timestamp": 1692628118,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Looking for advice based on prior work experience/skills Hey folks. I'm looking for some professional opinions here. I hope it's ok to ask this here. \n\nIn 2005 I studied 3d animation and got a job in 2006 working on a playstation 3 game. I was good at the work but slower at 3d modeling than the other junior artists. I worked there for a year but it was a pretty toxic work environment and I couldn't handle working 60-80 hours a week for the low salary.\n\nThen in 2007 I started learning how to build websites. But I never really learned to code properly. Here's a little context. I have pretty bad ADHD and get obsessed with things and very hyper focused and that's when I learn the most. But I'm also bipolar and went undiagnosed for a long time.\n\nAt the time I had a buddy who was making 80k doing sort of sketchy stuff with Google adsense where he wrote shitty articles focused on a keyword that sent people to a website full of ads disguised as menu items. It was sort of shady but I thought I could learn enough HTML to try and do something similar without being shady. He was focused on the instant pay day loan industry where they get low income folks trapped in a loan cycle. I thought I could learn it and focus on non shady areas. \n\nAnyway I started learning HTML and soon found joomla. Then google changed their algorithm and all the adsense money dried up but I was more interested in joomla by then anyway. I got a little obsessed with joomla and got a contract to build a site for a shop, then a few more, then in 2008 landed a full time job as web guy. Since I'd worked as a 3d artist I was already fast in photoshop. \n\nI worked for a year then they downsized and I got a new job to build a magento store. I did that for a year and got familiar with magento. Then I invented a product and had to learn CNC routing and laser cutting. My 3d modeling skills came into play. I put my product on a magento store and managed it for years doing upgrades and integrating PayPal, then stripe.\n\nWhen the economy collapsed around 2009 (I think) I got retrenched but kept on as a contractor. I did web sites for other people doing more magento, joomla and WordPress. Around this time odesk was taking off and I found myself competing against Indian computer engineers who wanted $7 usd an hour. I landed a contract with a company that ran magento selling fuel tanks and they did 55 million a year in sales and had a good marketing budget. I outsourced some of the work to an Indian guy I met through odesk but I didn't manage it well due bipolar symptoms and lost the contract. \n\nI tried learning php but one of the ADHD symptoms is a low tolerance for frustration and I couldn't seem to learn it on my own with YouTube or udemy courses. I did other work for a while but kept running my magento site selling the invention. I got into industrial rope access doing NDT and radiography but all the work was in oil refineries and they were shitty places to spend 40+ hrs a week but the money was decent. I did that for about 5 years.\n\nMagento released a new version and it required more ram to run and needed a VPS. I spent some time trying to get Magento 2 to run on an AWS VPS but I couldn't figure out the nginx configs and eventually gave up. \n\nI was also into torrenting and set up an offshore full time seed box with a headless transmission client and an ssh tunnel from my firefox browser and I liked learning how to get it all going.\n\nAround this time my bipolar started getting worse and I got really depressed.\n\nIn 2018 I did a web development boot camp with the hopes of getting back into full time web work. I thought I could learn JavaScript to add to my HTML and CSS skills to do frontend webdev. I was on ADHD meds and those triggered a hypomania episode and it kind of derailed my bootcamp. At the time I was still undiagnosed for bipolar so I didn't understand what was happening to me. I struggled with getting my head around the more abstract side of programming concepts. But I also got a bit obsessed with getting my windows machine to dual boot Linux and get my Linux environment just so for the bootcamp. We had a team project and I managed it and it went well. We used ruby on rails and bootstrap and a material UI theme to build a Web app. I was better at the front end stuff and was also good at managing the team and making sure everyone was doing their part of the project. \n\nAt the end of the bootcamp I applied for a job but my bipolar symptoms got really bad and I fell into a huge depression and got convinced I'd never be able to get a job competing against other people with computer science degrees or folks who were naturally good at coding and math. \n\nThe bootcamp focused a lot on JavaScript and npm and a little jquery.\n\nI wonder if I would have been better off spending that time learning php so I could work as a magento front end developer, since I know alot about magento and there's good paying jobs.\n\nI've never did well at math or at school because of my ADHA and I think I also had some bipolar symptoms early on that made it all worse. \n\nI'm almost 50, pretty broke and have nothing to show for my life so far. I'm feeling really desperate because of my financial situation right now. The bipolar has kind of made my life really emotionally unstable and going undiagnosed for so long didn't help either. \n\nI don't know if I'm intelligent but struggle due bipolar and ADHD, or if I'm just stupid and persistent. I get a bit ocd when trying to learn some things and sometimes it gets me a decent way but then other times I hit a wall of frustration and impatience.\n\nI've been listening to this podcast called darknet dairies and there's lots of stuff about info security jobs and I wonder if that might be a good option for me. \n\nAre there any programmers with ADHD that struggled to learn to code but got over that hurdle?\n\nDoes anyone have ideas about tech related things I could do with a wide range of general skills but not an expert in any of them?\n\nI just wonder if there's a way I can get my experience to work for me in some type of role I haven't actually thought of. I'm ok at setting up mail servers, configuring Apache and htaccess. I've always run xampp on windows or lamp on Linux. \n\nI did a few shopify sites for people but working with folks who aren't making money through e-commerce yet always sucks. They want a high end site for a low end budget and they also aren't really familiar with the pipeline and ask you to redo this or that once they see it. There's a high tendency for scope creep.\n\nIf I learned JavaScript do you think I'd be able to get a job as a front end dev at my age? Do people age out of tech? Is it ridiculous to think I can get back into web stuff at 50? \n\nI'm feeling pretty desperate and feel like maybe I could buy a house if I got a decent paying job. Do people last in the tech sector past 40 or 50? \n\nI hope I can get stable enough on meds to work for another 20 years or so…\n\nAny ideas or suggestions would be welcome. \n\nAlso  I know I'm a fuck up so if you want to tell me that, fyi I already know :-)\n\nI'm Aussie and I live in Australia right now but I also lived in California for 15 years. I could go back to the states for work if I had the opportunity.",
    "title": "Looking for advice based on prior work experience/skills",
    "subreddit": "cscareerquestions",
    "timestamp": 1699607840,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "Mentor doesn’t have ANY conversations with me at internship. TLDR:\nHow do I deal with unhelpful mentor?\n\nI am doing a hybrid CS dev internship at a large local non-tech company in FL. Predominantly mid-aged to old white/Hispanic with a fair number of immigrated South Asians/Indians.\n\nSince the very first day, my mentor did not try to have any conversations with me, no 1:1 introduction apart from the Teams meeting my manager set up. She didn’t even try to set up any in-person chat/lunch but in 2nd week we both happened to be working in-person the same day and thus officially met. \nHer uninterested demeanor really put me off by then so that day I only greeted her, asked her 1 or 2 work related questions, said bye and left at the end of the day. I am South Asian international student so I don’t know if she has any stigma against me. Over the next few days, I showed fake interest and learn a bit more about how she got the job and such but that’s it.\n\nIn our daily sync with my 2 other remote contractor mentors, she joins the meeting and just sits there without doing any explanations while the others walk me through - happening for 2 months now!\n\nMy manager and even his boss are super chill and rather impressed with my work ethics and quick working mindset and I want to work on this team cause of them but since she sits right beside me, I don’t want to see her.\n\nMy concern is how she’s gonna evaluate my performance, other 2 mentors seem somewhat satisfied with me.\nHow do I deal with her and do I raise this issue to my manager?",
    "title": "Mentor doesn’t have ANY conversations with me at internship.",
    "subreddit": "cscareerquestions",
    "timestamp": 1690123189,
    "score": 0,
    "keyword": "indian manager"
  },
  {
    "text": "How do you navigate a toxic workplace? I posted on here before, about how in my first week, A co-worker that found a new job in the company subtly warned me away from this job and to not stop looking for a better one.\n\nEveryone said “maybe he is jealous”, “ignore him he’s bitter”, etc. \n\nWell he was right. \n\nI’ve only been here 3 months but 1/2 of the team either quit/retired/transferred. \n\n - The deadline are super unrealistic. (How do I average 50 tickets daily but you get mad when you assign me 127 tickets and I can’t complete all of them).\n\n - my co-workers are high-key rude and act irritated when I ask any sort of questions. \n\n - I’ve had other IT jobs, but this is the 1st one where I literally don’t want to get out of bed in the morning and get anxious just thinking about work.\n\n - I was hired on as hybrid and the CEO is pushing for full-time in office now\n\nI want to quit so bad but:\n\n - the benefits and pay are great. \n\n - they’ll pay for my masters degree and if I leave within two years I have to pay it all back.\n\n - I had a hard time landing this role in the 1st place.\n\n - if I can last 1 year exactly, I can apply for other roles in the company and pray that it’s not as toxic as my current one.\n\nMy manager is heavily biased to the other team members (they’re Indian and I’m American) and I only see her for our weekly 5-minute chats. Which she bails out on most of the time.\n\nI found a very nice cybersecurity internship (technically in my last semester but school is online) that I would love to apply for, but I have a hard time justifying to myself switching from a permanent position when I have rent and bills to pay, to getting something temporary only for my happiness.\n\nThoughts? I need some advice.",
    "title": "How do you navigate a toxic workplace?",
    "subreddit": "cscareerquestions",
    "timestamp": 1678378707,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Why are accountants, CPAs, and the AICPA so nonchalant about our jobs going to India? Deloitte recently announced that 1/3 of their workforce will be based in India in the next 4 years. PwC and EY already have entire engagements that are wholly staffed by Indians. KPMG stands for Karachi Pune Mumbai Goa at this point.\n\nYou don't have to be an economics genius to know drastically increasing the labor supply with cheap workers from the 3rd world will lower our market price and erode our bargaining power.\n\nAlso we've all seen the quality of work coming out of India, it's pretty awful and a lot of it has to be reworked by overworked by exhausted managers and staff in the US. Everyone on this sub knows this. The partners and directors also know this.\n\nThis trend will seriously damage accounting pay and prestige, and both are already at an all-time low. \n\nI don't understand why the accounting profession isn't doing anything. Look at Hollywood going on strike to prevent screenwriters from being replaced with AI - look at nurses, UPS drivers, government workers etc all going on strike.\n\nWhy are we not doing anything? Or at the very least, saying anything?",
    "title": "Why are accountants, CPAs, and the AICPA so nonchalant about our jobs going to India?",
    "subreddit": "Accounting",
    "timestamp": 1691622089,
    "score": 848,
    "keyword": "indian manager"
  },
  {
    "text": "The accounting profession is uniquely well suited for unionization 4 reasons:\n\n1 - Let's be real, there is little difference between a top performer and a median performer in accounting. Unionization usually ends up hurting top performers in order to lift up median performers - this is why professions like sales or engineering are so hard to unionize, as top performers can perform/add value 1,000x as much as median performers. There's no such worry in accounting - both top and median performers will benefit from collective bargaining.\n\n2 - Accountants are a necessity. Unlike digital marketing, management consulting, graphic designers, etc - no large business can run without staff accountants and accounting managers. If accountants go on strike, the business is in serious trouble.\n\n3 - We are now facing a massive challenge (offshoring jobs to India) that can really only be overcome by unionization and collective bargaining. You can't \"outperform\" your way out of offshoring unless you're very high up in the field, it's going to happen one way or the other - why the fuck would companies pay more to hire you when someone in Mumbai will do the work for 1/20th the cost? Sure, you might be more efficient than the Indian guy, but are you 20x more efficient?\n\n4 - Accountants, generally speaking, are already underpaid and overworked compared to other comparable white-collar professions. Both partners in PA and executives in industry know this very well. Which means we already have quite a lot of room to negotiate once collective bargaining begins - we won't be starting from an unreasonable position.",
    "title": "The accounting profession is uniquely well suited for unionization",
    "subreddit": "Accounting",
    "timestamp": 1692027817,
    "score": 44,
    "keyword": "indian manager"
  },
  {
    "text": "Accounting as a Career? Hi. Im a 16 year old student who is currently working on deciding on my major for college. I have taken an accounting class in school and I find the topic interesting and something I can do for a living. I came here to ask you why you chose this as your career and what I should know going into this field. I have to start my college applications this month and I need some advice.\n\nAlso, what schools would you recommend going to? \n\nHere is a bit about me academically speaking.\n\nGPA: 4.25\nSAT: 1230\nClass Rank: 29/201\n\nAwards: \nNational Honors Society\nNational Spanish Honors Society\nBronze, Silver, Gold Pin\n\nReccomendation Letters:\nAPUSH teacher\nAccounting teacher\n\nExtracurricular\n\nClubs: \nIndian Culture Club - VP\nComputer Club - Member\nChess Club - Member \n\nSports: \nTennis - 4 years\n\nVolunteering:\nInventory management for town (25 Hours)\n\nWork Experience:\nSummer Camp Counselor (June - August 2022)\n\nOther:\nStage Crew (Lighting)",
    "title": "Accounting as a Career?",
    "subreddit": "Accounting",
    "timestamp": 1690814769,
    "score": 3,
    "keyword": "indian manager"
  },
  {
    "text": "Outsourcing Why would any company hire work that can be done in India? My first and only engagement at ey was with an all indian team as an American and i got laid off shortly after. (No surprises here). My senior manager also told me that the person that replaced me as a staff on that engagement was also indian( again no surprises). People that say accounting is safe and stable is inaccurate. Maybe if you work for the govt. But accounting will be outsourced like all white collar jobs that don't require us citizenship to the lowest bidder. Just look at all the LinkedIn profiles of people to us/aus/euro taxes at big 4 from India",
    "title": "Outsourcing",
    "subreddit": "Accounting",
    "timestamp": 1701113284,
    "score": 0,
    "keyword": "indian manager"
  },
  {
    "text": "The Internship Question Background information:\n\nAlright so I am in my 2nd year of law school(I am Indian and unlike the US we do not need to do a bachelor’s degree before law school in certain cases. Like mine. I am doing a five year course which combines a BBA and an LLB degree. The course is divided into 10 semesters with a month long internship in between and we are required to do at least 9 internships. I go to a decently well ranked and well known private law school in the country. To Indians reading this, no it isn’t Jindal.).\n\nOk so the question: \n\nDo I need to “specialise” in terms of my internships? I have already done an internship with an NGO and my state’s Human rights commission. I also managed to get an incredible opportunity to intern in the HR department of a massive tech company for this sem! (I am really hyped about this.). And for next sem I am thinking either a district court or a high court since I do want experience in a court. But then it sort of brought up the question of what do I for the next three years. Ultimately I want to go into the corporate world. Working in company law would be great. Of course I want to work at a law firm but I feel like that would be more valuable at a later point in my education as opposed to right now (we are currently working through criminal law. Another reason why I wanted to put off courts for another sem). Any advice? I know I am overthinking this but I like planning ahead. \n\nP.S: I am really insistent on studying what I need before I seek out an internship opportunity in the field. I know there is no teacher quite like practical experience in this field but having the guarantee that I have gone through all relevant bare acts before walking into the internship just makes me feel confident.",
    "title": "The Internship Question",
    "subreddit": "LawSchool",
    "timestamp": 1702016214,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed. A feminist from the 1940s named Mary Beard wrote a book called *Woman as a Force in History*. It critiques the myth that women were historically treated as subordinate to men and they were restricted from contributing to society or having basic human rights. Her book only includes just a portion of what women contributed to in society, and she says there's so much more. She has no idea how it got erased from history, but critiques the idea that women were historically oppressed compared to men.\n\n**Women did have an education in medieval times.**\n\nFeminists like to think that women were denied an education historically because people hated them and wanted them to suffer, but that's false. In fact, in medieval times, women were being educated all the time, and were as literate as men. G. G. Coulton, the life-long student of mediaeval history, gives a cautious answer: “Though very few women arrived at anything like the university stage in education, it seems probable that more of them could read and write than the men,” especially in the upper classes “at the period when romances of adventure were offered in profusion.” Interestingly, going to university was less common back then.\n\nThis [chapter](https://www.marxists.org/archive/beard/woman-force/ch11.htm) from her book elaborates on all the education women had back long ago in medieval Europe. It was very normal for them to have an education. Italian and German women especially had the most education of the Middle Ages. You can see that women had education and high literacy rates, and were more literate than men. They succeeded a lot in education. Maybe there were some societies that normalized education for boys, but that's because in those societies, education taught discipline, not facts, and people believed girls were more well-behaved than boys and thus didn't need it. Moreover, corporal punishment was used on boys much more, and boys were subjected to forced labor. This was meant for build character and discipline in children. Women weren't educated because it was believed they were less prone to bad behavior and didn't need to be educated. There was only a small overlap between education becoming useful for learning things, and women not being allowed to be educated. Later on, corporal punishment and forced labor declined in schools. It was actually seen as unmanly for boys to be willing to learn.\n\nEven in the later 19th century, girls performed better than boys in elementary schools and outnumbered them, and even in the early 1900s, when high school became more common, girls went to high school more often. Girls even had free education whereas boys in high school had to have their parents pay a fee. You can read more about this from the book *The Privileged Sex*.\n\n**Women did build society and contribute to the social and economic realm of society.**\n\nIn [Chapter 10](https://www.marxists.org/archive/beard/woman-force/ch10.htm), Beard wrote:\n\n>AFTER the dissolution of the Roman Empire, nearly all the economic activities connected with the production of food, clothing, and shelter were carried on in rural villages and their outlying fields everywhere in Western Europe. Whether the village was a free community or property belonging to the estate of a great feudal lord or lady, it was largely self-sufficing; its inhabitants supplied nearly all their needs for the maintenance of life. Furthermore, the industries of households and fields were not like the modern “heavy industries.” Women could handle nearly all of them alone or with some aid from men.  \n>  \n>Thus there was no sharp division of labor as a rule. Men and women worked together for the most part. If the major responsibilities for spinning, weaving, and cooking were women’s tasks, if wood-cutting and ditching were generally men’s tasks, men and women commonly worked side by side in the fields and to a considerable extent in all the processes of transforming raw materials into commodities for use. Whether the toilers on the land were bond or free, men and women labored under similar conditions and enjoyed similar liberties of choice such as they were. Though women gave birth to the children, both parents had the services of children to help them in their work. In the records of mediaeval rural life that are available in our age, no specially onerous burdens are found to have been laid on women as women by men as men. On the contrary the records show a sharing of the toilsome tasks on about the same terms.\n\nWomen were also, even in the Indian and Middle Eastern regions, just as involved in gilds as men. Beard writes:\n\n>While in some of the records the details are lacking, Smith’s *English* Gilds contains accounts of the structure, membership, functions, and proceedings of about eighty-five gilds. In at least seventy-two of them women were members on an equal basis with men. That is surely a large proportion. In some of the other gilds a slight qualification was placed on widows; they were accepted if their husbands had been gild men. Lest the idea of sheer generosity or friendship for the deceased be adjudged the reason for admitting widows to gilds, let it be remembered that, in innumerable cases, widows carried on the craft in which their husbands had been active, being directly familiar with it as a household industry at which they had themselves labored or in connection with which they had borne responsibilities for training and directing apprentices.\n\nWomen were not in a segregated gild, and mixed gilds were common. Some men didn't approve of women in some gilds, but it wasn't due to hatred of women, but because they believed women weren't strong enough for things like bread-kneading and bread-baking. Nonetheless, these men didn't get the monopoly they looked for:\n\n>But a French Parlement refused to prohibit the customary baking by women and declined to back up the men’s opposition to the women. A French parliamentary decree even accorded some gild women rights frequently denied to English widows; it ruled that a widow could retain her membership in a gild even if she took as her second husband a man who did not work in her craft.\n\nWomen also were involved in all kinds of parts of society:\n\n>Just as women took part and carried full loads of work in agriculture, domestic industries, and trading, just as they participated in the activities of craft, trade, and social gilds or corporations, so they shared and expressed themselves in all the forms of social life in town and country. In everything human their qualities and force were expressed – from religious and secular festivities, sports, games, and riots to the **discussion of religious and moral questions and the management of charitable undertakings**. In castles and cottages, in fields and in gild halls, on village greens and in churchyards, in towns and on city streets, in taverns and at market fairs they sought release from the rigors of earning a livelihood, from burdens of domesticity, or responsibilities belonging to the status of their class, whatever it was.\n\nWhen knights even had tournaments to display prowess, it was often done to impress female spectators. **Women's cheers brought outlets in arguments over public, private or religious matters, and in disputes about property, trade, marriage arrangements, family problems, tastes, habits and good or bad manners**. In fact, in medieval times, women were very fierce in many cases, and they would steal husbands' money and run with monks, get in violent fights with women in arguments, smash knights with swords, drinking and singing in taverns, etc. One woman even bloodied a priest's nose after he tried to rape her. When the priest ordered to her to become a pilgrim to Rome, Thomas of Cantimpre laughed and advised to the woman that if a priest sexually assaults or inappropriately pursues her:\n\n>then thou smite him sore with thy clenched fist, even to the striking out, if possible, of his eye; and in this matter thou shalt spare no order of men, for it is as lawful for thee to strike in defense of thy chastity as to fight for thy life.\n\nIn medieval times, women were seen as sinful or wicked, resorting to magic, or the originators of sin, and in need to obey priests or obedient to their husbands, but men were seen as brutal or vulgar, and he had to love his wife, help her support the family and never harm her, and charivaris were done against him or even family intervention if he abused his wife. This was all a reaction to the aggression women engaged in then that people thought women would never do and that only men would do (and feminists reinforce this gender role by portraying all violent women as victims):\n\n>Also, repeated again and again and again in mediaeval documents was the idea that women had been better, if not ideal, “in the good old days,” but were now given to luxury, assertiveness, display, love of worldly goods and pleasures. Hence it would appear that the newest clichés are not so new after all.\n\nMen fought at wars more than women and committed crime more, but women who had power waged wars. Women assembled soldiers. Women fought side by side with men. Women were guilty of many cruelties, and women aided and approved the worst. Women conformed to no type, and they weren't \"tame\" in a \"man's world\". \n\n**Women had a lot of power in marriage and family that men had.**\n\nAccording to the same chapter, Beard wrote:\n\n>Beyond all question the weight of documentary evidence is against any simple conclusion that men handed women around like chattels; that boys were free to make their own choices of mates, while girls were helpless creatures at the disposition of men. After the rise of the centralized state, no one, male or female, was actually “free,” save perhaps the king or queen as highest lord, and even members of royal families had to be on guard against actions likely to stir up revolt among underlings. As a matter of fact, fathers and mothers of the middle and lower classes, as well as lords and ladies, took part in arranging the marriages of both boys and girls under the almost universal rule of “convenience.” The boy apparently had no more choice than the girl. There are records indicating that boys and girls sometimes made vigorous protests without avail; other records show that their protests were effective. But the general rule of marriage for convenience long prevailed.  \n>  \n>Whether fathers or mothers , men or women, usually dominated in the making of matches is a matter buried in the silence of unrecorded history, but there is abundant proof that women were active in the business and were no less circumspect or ruthless than men at the business. Women looked about for marriageable boys and girls to be convenient mates for girls and boys in their own families. Maidens were inclined to be shrewd and insistent – that is, “practical” – in marrying men with property, when they had any chance of selection, as they often did. Mothers were zealous in procuring for their daughters men who had property and in making sure that the property was good, and carefully guarded by proper legal titles. In other words, the marriage of convenience was no one-sided affair in which fathers and sons “had their own way” with the women concerned in it.\n\nAnd women still owned property. It's a myth they couldn't historically. They always were allowed to even back in antiquity. \n\n**Women were involved in warfare and building antiquity.**\n\n[According to chapter 12](https://www.marxists.org/archive/beard/woman-force/ch12.htm), German writer Sir Galahad described the ways of aggressive women long ago. Proof of armed women was found in European ancient ruins, proving that Amazons, the Greek female warriors, were real. Some people think early human years were peaceful, but fights broke out and disrupted it, and women were active in these conflicts in every way men were:\n\n>Where they had power as rulers or in ruling families they often instigated and proclaimed wars and even marshaled their troops as they went into battle. They incited men to ferocity at the fighting fronts. They accompanied men on marauding expeditions. They fought in the ranks. They took up arms to defend their homes. They nursed men on battle fronts or kept households going while men were at battle, and they looked after the wounded on their return to civilian life.  \n>  \n>There was not a type of war in which women did not participate. They were among the primitive hordes which went on looting expeditions against their neighbors or stood fast on their own ground in defense of their lives, herds, and fields. Old Roman records testify to the savagery of women in the Cimbrian tribes that swept down from the north into Rome. Among the Cimbrians, priestesses took charge of war captives. Standing on ladders which they carried with them to battle, they cut off the heads of prisoners, caught the blood in pots, and gave it to their men to drink, in the belief that it would double their strength.\n\nAncient women also initiated or inspired military efforts to subjugate others. Alexander the Great's militant Epirote mother, \"a priestess to whom his father, Philip, had been attracted when he saw her as a maiden prancing to or from a temple with a snake, a god symbol, held high in her arms, and attended by a procession of other maidens\", drove Alexander to become the master of the world. In most of Europe in antiquity and even during Arabia when Islam spread and people declared war against the Muslims, women fought at war. Even Muhammad had his female warriors who teamed up with him.\n\n**Women did influence politics, economics and social change historically.**\n\nFeminists argue women were forbidden from politics. Not exactly. While people were serving in the government were men in many societies, it's because they believed those who fought for our country were the ones allowed to form the government, but not all societies only sent women to war. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), in almost all countries, originally, neither men nor women could vote, and they usually granted suffrage to both concurrently. In some countries, they originally granted it men, then later women. In the US and UK, men originally could only vote if they owned property, and only 3% of British men and 6% of American men did (women were never property). In 1828 during the presidential election, the vast majority of states gave all men the right to vote, but it wasn't in all states until universal white male suffrage was given to men in North Carolina in 1856. Later on, women were given the right to vote more and more. It was simply because men served in the military in the US back then, not because women were considered inferior.\n\nNonetheless, women DID influence politics historically. Not voting didn't stop this, [and many women were originally against the right to vote](https://www.societyforhistoryeducation.org/pdfs/M15_Miller.pdf) because they worried it'd take away their soft power in influencing politics. In fact, many men supported their right to vote for equality, and while people who supported women's suffrage thought it was unfair they couldn't vote, people who opposed it worried that women had more power influencing politics than men because the government responded to women's needs more while men just cast in a vote that only wins if it's the majority opinion. Susan B. Anthony said women's suffrage laws \"probably never would have passed if it had been up to women to vote on them,\" and that men were actually more progressive about women’s suffrage than women were (1902). This [thread](https://www.reddit.com/r/MensRights/comments/15ac3xy/women_did_influence_politics_before_suffrage_and/) of mine elaborates on how women influenced politics easily before voting.\n\nContrary to what feminists think, laws weren't created based strictly on the opinions of men. Only 1% of men worked for the government, and they usually made laws based on what they thought was best for the land or its people, but not for men. Totalitarian leaders might be all about themselves, but certainly not men either. Women's opinions mattered a lot to men. [In fact](https://presidentlincoln.illinois.gov/Blog/Posts/141/Abraham-Lincoln/2021/8/Lincolns-avoided-duel/blog-post/), [Abraham Lincoln](https://www.battlefields.org/learn/articles/abraham-lincolns-duel) even used female pen names pretending to be a woman to attack political rivals, including James Shields.\n\nAlongside speaking against recent policy decisions made by Shields, Lincoln implied that his opponent was weird and unpopular with women.\n\n>*\"His very features, in the ecstatic agony of his soul, spoke audibly and distinctly – 'Dear girls, it is distressing, but I cannot marry you all. Too well I know how much you suffer; but do, do remember, it is not my fault that I am so handsome and so interesting.’”* \\-- Rebecca (Abraham Lincoln)\n\nLincoln's wife also wrote several letters against Shield under a female penname. Lincoln apparently consulted with her about his letters to make them sound like a woman wrote them. What does this mean? Women were seen as pure and moral compared to men, so their voices mattered a lot in politics, and because they couldn't vote, they were seen as fair and reasonable. **This is why women often opposed the right to vote, because they worried it would prevent them from being influential in politics.** If the 1800s were so patriarchal, why would he have used a female penname to pretend that a man was unpopular with women to destroy that man's career?\n\n[Moreover](https://daily.jstor.org/women-against-womens-suffrage/), Catharine Beecher, an advocate for women’s education and economic advancement, argued that women were most effective when they united to press their fathers, brothers, and husbands for reforms in terms that rose above intense partisan politics. Using anecdotal evidence, she pointed to her sister, Harriet Beecher Stowe, whose [*Uncle Tom’s Cabin*](https://daily.jstor.org/frederick-douglass-feud-over-uncle-toms-cabin/) had contributed to anti-slavery sentiment in the country, selling quickly before the Civil War and humanizing enslaved black people. It changed American's views of enslavement at the time, especially in the North. Another example was the women’s clubs that fought for pure food laws, [compulsory schooling](https://daily.jstor.org/why-would-parents-oppose-compulsory-education/), and other reforms that were easily framed in terms of maternal care.\n\n[Women influenced politics in many other ways, too](https://americanhistory.si.edu/blog/5-ways-women-influenced-politics-they-got-vote). In the 1800s, men and women flirted at political rallies and met their potential spouse. Politically-charged women charmed men into supporting certain political views, especially first-time male voters. In his new book *The Virgin Vote*, Smithsonian political history curator Jon Grinspan explains that women even \"turned down marriage proposals specifically because of a young man's political affiliations.\" These actions pressured husbands and suitors to vote in favor of a woman's views.\n\nCarry Nation, a female leader in the Temperance movement, used to use hatchets to smash saloons. Churches and theaters paid her to against alcohol. In the Victorian era, if a man smashed alcohols, he'd be stabbed, but men were chivalrous towards women and refused to harm her. Many people laughed at her, but respected her integrity for her beliefs anyway. Carry's radical approach helped launch the Temperance movement into mainstream American politics.\n\nEven in medieval times, women teamed up with Prophet Muhammad to fight off aggressors against Muslims and helped spread the message of Islam. Women in medieval Europe brought discussions and disputes about moral, societal, or religious issues.\n\nWhen wars happened over the centuries, wars of conquest, defense, crusades, or self-defense did not exclude women. As long as the Eastern Empire lasted, women were involved in situations that led to war. As the empire declined and feudal wars happened for imperialism, women in aristocracies and royal families inspired and initiated wars, and sometimes used their own weapons. They built the state of Western worlds which turned local conflicts into global wars, assisted by women. For centuries in the West and East, imperial power only was ostensibly (but not exactly so) bestowed to men who were head of a family. In reality, official or not, his power was shared by women. Imperial power was often exercised by one or more women. Even in Ancient Rome, the state had lots of power among its women. Beard cited:\n\n>Among such studies of ancient Rome are the 1,124 pages of the old work by J. R. de Serviez, *Roman Empresses ... Wives of the Twelve Caesars,* first published in the eighteenth century – an age of despotism in Europe; and G. Ferrero’s *Women of the Caesars,* published in 1911 when the power of European family clans was rapidly dissolving.\n\nOther wars/conflicts, like the Renaissance, the restoration of the Bourbons, War of the Spanish Succession, War of the Austrian Succession. As medieval Europe was developing, in rural families, men and women worked together almost consistently, and the woman kept the family and its land and house economy going while husbands went to war in England. In royal and aristocratic families in England, women used force in the state of affairs and in the management of the economy helping the monarchy. It wasn't until the the 18th century in England during revolutions destroying the royal/aristocratic families founded on wealth did women and their families in these groups lose power and the parliament and government became solely men. As time went by men, men were the ones serving in military, and they decided men thus would be the ones allowed in the government, but women had soft power in influencing politics as mentioned earlier, which is why people worried giving them the right to vote would get rid of that subtle power. This change happened especially in the French Revolution. In the 1800s, more and more women suffragists were appearing, but men also struggled with the right to vote beside the low minority who had property and thus qualified. In the most progressive societies, women received the right to vote before men's universal suffrage appeared in other societies. Before this point, there were women were highly involved in royal/aristocratic power over influencing politics and society. \n\n[Up until a couple centuries ago](https://www.cracked.com/article_20186_6-ridiculous-myths-about-middle-ages-everyone-believes.html), Europe was agricultural. In medieval Europe, if a father was owning a shop or tavern, his daughters were the ones helping. If her dad became unable to, she sometimes took over the business herself if he was now unable to, which didn't really happen until later in modern times. Women also generally ran taverns in medieval Europe, and [women in England ran the entire beer industry back then](https://books.google.com/books?id=c6MQJ-pdbwAC&lpg=PP1&pg=PA3#v=onepage&q&f=false). Women who didn't run taverns or grow crops often joined convents, and when education was rare at the time, it gave these women access to education. Thus, nuns could read or write in an era where the most powerful kings couldn't. [If women could eventually rule of a house of nuns, they could reach position of power very similar to a male lord, or even slightly higher, seeing as how they technically reported directly to the King of Kings and whatnot](https://web.archive.org/web/20100215224014/http://www.bl.uk/learning/histcitizen/medieval/women2/medievalwomen.html). Sometimes, in monasteries, the abbess had seniority over monks. Outside monastic walls, women could wield political power, especially as queens and regents who exercised royal authority when their husband or underage son was unavailable. A number of powerful queens can be noted in English history, of whom one of the most remarkable was Queen Isabella (1295-1358), who (in collaboration with her lover, Sir Robert Mortimer) ended the rule of her husband, Edward II (1284-1327).\n\n[Even in the Middle East](https://anthrosource.onlinelibrary.wiley.com/doi/pdf/10.1525/ae.1974.1.3.02a00100), women DO influence politics and society. They do it from private positions, and exercise influence over men, by being mediators in natal or affinal groups in marriage alliances, wielders of authority in the domestic sphere, educating their children, or controlling products or property. Women form kinship groups, act as \"data brokers\", mediating social relations in family and society. Women also notify men in their household about what happens in other homes and in extended family. Women also, despite being segregated by sex at times, join with other women in forming solidarity groups and spreading social influence. It helps cause political influence and raises her social status. Women also can influence men's behavior by spreading rumors or gossip, writing mock songs, and spreading social influence to boost or ruin his reputation, especially in social and political issues. Women there might not be in the government, but men rarely make it in the government, and women have so much widely ignored soft power in influencing society and politics, but feminists don't realize in some countries where dictatorships occur, they won't always get what they want, but some of the women's opinions there ARE socially conservative. Women there do influence how people think there and eventually these countries will lose their social norms if people figure their way around their countries' domineering government.\n\nWe have laws pandering to women, including battered women's shelters, campaigns and organizations for women's health, laws against violence against women, etc, but while these politicians are men, they don't make these laws for men. People have always responded to women's soft power historically and politicians' success depended on his support from women more than from men. Men weren't always able to vote historically, but when men served in the military more, they were given the right to vote, but women were still granted soft power that made more changes than mere marks on ballots that only won if a majority. That's why suffragists were originally a minority, but still managed to spread enough influence to become a majority.\n\n**Women were not excluded from history from men, but by feminists.**\n\nIn Chapter 12, Mary Beard wrote:\n\n>Certainly the original sources, which scholars use for the study of men in long and universal history, often mention and even recount stories or give elaborate data of many kinds about women. For example, Herodotus, whom historians of the modern age have called “the father of history,” deliberately included women in his history. Tacitus, the Roman, also observed and commented on the women of his time. Indeed ancient writers in various societies often thought it necessary to consider women and among their works are to be found statements respecting women’s force of character, learning, physical energy, military and political power, and creative intelligence – statements made by the contemporaries of such women.\n\nSo obviously, writers and historians didn't exclude women and even wanted them included. Mary Beard wrote in her book that the idea that women were men's subordinates and were forbidden from contributing to society is one of the biggest myths told in history. Feminists have erased the fact that 40% of slave owners in the US were white women and that women had soft power or even before the 1700s, had royal and aristocratic power, and promoted myths that women were property, were expected to be asexual beings even in marriage, were allowed to be beaten/raped by their husband, or were violently hated. Feminists probably originally removed women's contributions to society from history. Then decades later, feminists wanted to educate society about women's contributions to society they claimed were erased by men because they are clueless about what the first wave feminists did.",
    "title": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed.",
    "subreddit": "MensRights",
    "timestamp": 1700510201,
    "score": 127,
    "keyword": "indian manager"
  }
]