[
  {
    "text": "HELP NEEDED : PLEASE SAVE ME FROM INDIAN RECRUITERS.   \n\nBefore you jump the gun, this is a disclaimer: I am not racist, bigoted or prejudiced.\n\nI am as brown skinned as an Indian (as in from Asia) recruiter. I have lived in North America for 18 years, but now what is happening to me, is making my life, a living hell. I have been managing huge IT projects for many years, and have my resume posted on the major job sites (Dice, CareerBuilder etc.) and on LinkedIn Now why is that? Well, I am in consulting, and in today's day and age, it makes sense to have a \"Plan B\" at all times.\n\nSo what's my problem?\n\nI get 20-30 calls a day from Noida, Gurgaon, Delhi, Chennai and some some obscure places. It's always the same line \"I am calling about an opportunity I have with my direct client...... blah, blah\". Obviously, these are VOIP calls and always have a US number. Now these so called \"Recruiters\" have no idea of what the job entails, just read from a script, and have to meet a quota of \"X\" number of calls and \"X number of emails sent. 99.99 % of these firms are based in India, with a local (NJ/WA/NY) address.\n\nFine, so what? \n\nThese calls are a nuisance. No time in the past has my resume even reached a hiring manager - so what is this resume \"harvesting\"? I believe there is an ulterior motive behind this. Also this is a waste of my precious time. So why do I leave my contact information on the resume - so that I can have internal recruiters of US companies contact me. If I took my phone number off, genuine recruiters of consulting companies and internal HR folks from corporations here, cannot contact me - that would cut me off from good opportunities/\n\n**Two quick questions:**\n\nIs there an easy way out for me to get out of this situation?\n\n&#x200B;\n\n* When a recruiter from India calls about a potential      opportunity from say AT & T, Verizon or CBRE, there is NO local      recruiter that calls. I would imagine that consulting companies and headhunters      would be equally interested in sourcing a candidate and make some $$\n* Does this mean that these so called \"opportunities      are fake and do not exist?.\n\nThanks in advance for your help. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
    "title": "HELP NEEDED : PLEASE SAVE ME FROM INDIAN RECRUITERS.",
    "subreddit": "jobs",
    "timestamp": 1548104323,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "Another recruitment scam? Likely another Indian recruitment scam. I'll post everything in bullet points for readability:\n\n* I receive a connection request on LinkedIn, it includes a message for saying they're hiring for an 'Operational Manager' 11 month contract and asking if I'm interested. This is similar to what I do now, and I am looking for a new job.\n* The profile of the \"recruiter\" is odd, no picture, the company he works for (Radiant Systems) doesn't have a LinkedIn page, and he is sharing a bunch posts from other recruiters with Indian names\n* I ask him for a job description, he emails me one immediately and says that if I'm interested I need to send him an updated CV ASAP. The contract is for a well-known HR tech company.\n* I never gave them my email address, is this public info on LinkedIn?\n* The email is full of grammatical errors and is very unprofessional\n* On LinkedIn messaging, I ask him what the approx salary is, he replies with an above average day rate to which I say I'm happy with\n* He emails me again with the same job description, but the top of the email now includes the day rate and asks me to reply stating that I exclusively authorise Radiant Systems to submit my CV to the client and confirm I have no authorise any other companies to submit my CV for the same position\n* I tell him I'll send through the email and CV tomorrow\n\n&#x200B;\n\nAs dumb as this sounds, I didn't think it was a scam until I showed my partner the email and she pointed it out. I thought a few things were odd, but as I've been job hunting for the past two months without much luck, I think I disregarded the warning signs as it was nice to have a new lead.\n\n&#x200B;\n\nMy questions:\n\n* Is this unequivocally a scam?\n* If so, what is the angle? Do they eventually ask me for money or something, or is it potential identity theft?\n* Has anyone had a similar experience to this?",
    "title": "Another recruitment scam?",
    "subreddit": "jobs",
    "timestamp": 1555629800,
    "score": 4,
    "keyword": "indian manager"
  },
  {
    "text": "Help! Two offers, need to decide today. I'm at a pretty huge crossroads with my career right now, as I've got two similar but slightly different roles to consider. For both roles, consider that I'd like to have the flexibility to move if I could (but it's not a deal breaker).\n\nJob A: 98k. Boutique digital agency in my city, probably one of the leaders in their field. I'd be responsible for consulting on Google Analytics. They're very organized - my interviewer asked me what lunch I wanted and ordered it for me (though they didn't leave me time to eat it, lol), agenda for interviews changed twice but was accurate, and most people there have been there awhile (though they are higher level). Pros: fully paid healthcare premiums, unspecific but existent bonus structure, work downtown (I prefer to an office park), many people in my field know this company, probably a good learning opportunity. Cons: have to come into the office every day (!), tight-knit team and I am a bit of a introvert, pay for own parking, definitely 40 hours on client work plus personal development time.\n\nJob B: 108k. Offshoring/KPO firm, doing basically the same thing plus a lot of tag management. Indian-owned company that is legit but hard to get a good handle on (most Glassdoor ratings are from lower level people in India, though the people I interviewed with had a decent client list). I'd be responsible for an offshore team of 2-3 people, but it's not clear whether I'd need to take a lot of morning/evening calls or whether we'd be able to communicate in writing, or really what the work load would be. Interview was a bit weird to me, only ever talked to people on the phone and the offer was ultimately made by a hiring manager I never talked to but that seems decent on LinkedIn. Pros: **full remote**, more money. Cons: unclear as to what my day to day looks like. Disorganized interview, potential downside of managing remote team, company isn't well known.\n\nI've always wanted a full remote job. My current job takes two hours out of my day with the commute, and while Job A would only be an hour, Job B would let me move anywhere in the nation theoretically (though that would put pressure on me if it the job turned out bad). The extra money is nice too, and it MIGHT be more chill than Job A. But there's a lot of unknowns, and burning the bridge with Job A would kinda suck.\n\nAny input would be appreciated. I have that horrible feeling like I will make the wrong choice regardless.",
    "title": "Help! Two offers, need to decide today.",
    "subreddit": "jobs",
    "timestamp": 1571664145,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "OB/GYN jokes + a first year med student = one hell of a pap smear So this happened about a month ago during an appointment to qualify me for a medical study. This required general questions about my health, and a pap smear... tldr at the bottom\n\nI was leaned back on the table, about to get my pap, legs spread, in the stirrups, y'know the deal. There are 3 other people in the room: the doctor (a very small, older, sweet, Asian man), his med student (young, probably 23ish IF that old Indian girl), and the research nurse (white, late 20s, and I kind of knew her from my very small college; different major so we saw each other in passing but never in classes). The doctor was looking for a smaller speculum and was explaining to his student the difference. He holds up the larger speculum and said \"we would only use a speculum this large on a vagina this small if we dont want her to come back.\" and laughs hysterically for about 15 seconds. Awkward laughter from all parties... it was a good joke but my lady bits are starting to feel the chill of the air and I came in for a pap, not a comedy show. \n\nThen he does the pap, explaining what he was doing the whole time for his med student. He then asked me if I would mind if his student did a digital exam on me so she can get some practice. I said sure before realizing that a digital exam=when they stick their DIGITS AS IN FINGERS in ya and feel your uterus. I still didn't mind but wasn't considering the awkwardness of this when I said yes. \n\nThis poor girl was SO nervous. She managed to stammer out that this would be her first time and she asked him to walk her through it. So he performed the exam first, then she did. While she is doing the exam she's poking around, trying to feel the uterus and y'know when you're trying to listen closely to something or you're trying to grab something that fell between the couch and the wall and you kinda blankly stare in front of you? So she had that look on her face but staring into my eyes. The doctor meanwhile is asking her and I if we feel it and what she thinks the positioning of my uterus is, and some other medical jargon but she just continues staring into my soul. I didn't know if I should break the gaze or if it would make her realize that she was eye fucking me and finger blasting me at the same time, so I just kept awkwardly staring at her. \n\nAfterwards she was really grateful and thanked me a lot and apologized for taking so long. I'm pretty sure I was the first vagina she ever entered. \n\nTL;DR: had a pap where the doctor made speculum jokes and the med student finger fucked me for 7 minutes trying to find my uterus while locking eyes with me.\n\nEdit: these comments are giving me life, please keep telling me all of your awkward pap stories!!\n\nEdit edit: THANK YOU SO MUCH KIND STRANGER FOR THE SILVER!! I'm so glad you all have enjoyed my story!!",
    "title": "OB/GYN jokes + a first year med student = one hell of a pap smear",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549332544,
    "score": 524,
    "keyword": "indian manager"
  },
  {
    "text": "Viable self managed clinic - A question for Indian Doctors Hi everyone, I am a mbbs doctor from India. I am tired of trying to crack neet pg. I don't have resources to invest in a huge hospital. I did my medicine from a good medical college and was doing freelance work as medical officer in a few software companies while studying for neetpg. The exam is crap and has zero use in daily clinical practice and unless you are okay with mindlessly mugging up mcqs, the chances of getting into a decent field is very small.\n\nSo after wasting 4 years, I decided to start a clinic. 100% self managed in a poor area. I didn't do mbbs to get rich, I can live by if I can get bare minimum provided there is some scope for growth. So here are the questions I have right now.\n\n1. Is it possible to manage a clinic solely by yourself? I am thinking to buy medications wholesale from pharma rep and give them to the patient directly(everything included in my consultation fee). Is there an upper limit on the total amount of medications a doctor can have at a time?\n2. I want to charge the patient based on the disease they have upfront on the first visit, which includes the blood tests and medication. Subsequent visits would be free and the patient will just have to pay just for extra medications they receive the next time, or else they can even purchase them outside also as I will be writing generic medications mostly. Would this help decrease financial load on the patient?\n3. Should I keep a tie-up with a lab or invest in my own lab and get a lab technician involved? Diagnostics are unnecessarily costly and I would love to cut the middle men especially for basic investigations. Will this be a viable option since most of my work would be primary care and basic investigations like cbp, platelet count, cue, grbs?\n4. The market is flooded with the RMP scum, the rural medical practitioners who are supposed to work in villages have Monopoly at the primary level even in urban cities. Most of these people survive on fee splitting with bigger hospitals by referring patients to them. They take a percentage of the bill paid by the patient to the bigger hospital. How can I effectively get this money back to the patient without taking my cut or acting like a whistleblower?\n\nPlease let me know if you have any queries or suggestions. I just want to give back to the society for making me a good doctor. I love reading clinical medicine and treating patients. I feel it would be a great injustice to this Noble field if I wasted my time not practicing medicine or become a puppet for the corporate overlords. Please give me your suggestions on this. Thanks.",
    "title": "Viable self managed clinic - A question for Indian Doctors",
    "subreddit": "medicine",
    "timestamp": 1574153723,
    "score": 116,
    "keyword": "indian manager"
  },
  {
    "text": "55% hike in home country (India) or 100% hike in Czech Republic. Which offer should I take, considering that I have a partner who is pregnant? I love my current job. I love the work, my boss and the work culture. I am a product manager at a small-mid sized tech startup in India. I make reasonably decent money (more than enough to live comfortably). Although, I would be considered to be somewhat underpaid for my current role (\\~50k usd).\n\nTwo great offers have recently landed in my lap- one through connections and the other through a very persistent job consultant that kept insisting that I meet her clients.\n\nThe Indian offer is in the same city and comes with a 55% hike (\\~80k usd) - this puts my salary slightly on the higher side of what a person with my designation and responsibilities should make. However, the work is really boring. It's pretty technical, and the domain is somewhat old and being phased out at the moment- but will be around for a decade or two at least.\n\nThe second role is at an online gaming in the Czech Republic and comes with a 100% hike in salary (approx 100k usd). The chances of upward mobility at this company look pretty good too. If I was to accept this offer, it would mean a change of countries with my 6 months pregnant wife (she is in her 4th month right now) and two dogs. We wouldn't have any support system and would be having our first child in a place and culture alien to us. 6 months ago, I would have jumped on to this opportunity without a second thought.\n\nWhat do you think, Reddit?\n\nEdit- My wife plans to take a break from her job for a couple of years.",
    "title": "55% hike in home country (India) or 100% hike in Czech Republic. Which offer should I take, considering that I have a partner who is pregnant?",
    "subreddit": "careerguidance",
    "timestamp": 1561013137,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "How do I return to a CS career after a break of 5 years, I am 34 now? I am lost. I am 34 year old. Single. Indian. I am lost and I just don't have anyone to talk to. I am looking for some critiques.\n\nTill 2013, I was a software developer. I was let go due to restructuring & company politics.\n\nOn 2014 new year eve, I decided to be self-employed. I figured that I will be proportionately compensated for my efforts & less bullshit to deal with. Plus my father has his own business and I am involved in that too since college on a part-time basis. (FYI: I am an Indian. In India, working for family business means, free labour. No Salary. Food & accommodation by mom.) I figured I shall be more involved in the family business, build my own set of clients and grow the business. I also had couple of colleagues who also lost their job along with me, who are setting up their own companies and wanted me to involved as a co-founder. Things were looking well. Many options and I was sure one will click.\n\n&#x200B;\n\nNow in 2019.\n\n* 1st co-founded venture, failed in a year as we didn't get much technically challenging projects & I transitioned into Project management & client relations at a wordpress factory. Plus we could not get paid for most the work we did. My co-founder, managed to get a job immediately.\n* 2nd co-founded venture, it was tough to get projects for a new company & the clients we got has \"cash-flow\" issues.\n* Family business. Not only did I not manage to acquire a new client. Due to market issues & general \"cash-flow\" issues, business is in survival mode. I am not needed full time.\n* Since mid of 2018, I have been actively sending out resumes and till date only managed to get 3 interviews. Earlier I was sending for python or javascript developers & project management. Now I do send for analyst openings also. I am optimistic that things will work out, just give it time.\n* In India, a 30 yr old guy is a warning sign & 35 is radio-active. Parent's problem solving technique is just to create panic, chaos & find someone to blame. They are a major cause of strain for me as I am not sure what to tell them. I know they are just losing it due to peer pressure and very anxious. No clue, how to even respond.\n\n&#x200B;\n\nMy technical skills:\n\nStarted my interest in IT at school with infinite-seeming row & columns of excel, the cool artistic rendering in word art & the sorcery that is mail merge. The wonders of DHTML like trailing mouse just me hooked in programming. Learnt myself SQL & access as a junior in college started coding VBA apps in access. Then learnt .net & java applet in college, preferred .net (I was a MS fanboy). Out of college, worked an year as an analyst making cool power point presentations & graphs from excel. Then got a job as a .net developer.\n\nIn 2013, I was c# .net developer. I developed & maintained social media monitoring systems with many micro-services that pulled data via various apis, did some automated  & manual data enrichment & analysis. Then generated reports. Python cli apps & javascript for frontend were the new tools I was starting to use as I wanted to be more to a open-source stack. Suffering from PTSD due ie, visual studio & win 8.\n\n2014 - 2016, I was more involved in non-technical aspects. Spend my day in skype, slack, whatsapp & outlook.\n\n2017- now, Eloquent JavaScript sparked my interest in coding. Keep playing around with regex. Learning bash, linux and enough vim, to get out of it. Since 2018, I am trying to allocate 1-2 hours daily to code. Since last month, I am doing FreeCodeCamp, not consistent. Battling procrastination. My goal is to develop some visualization (d3.js) using some opendata as a PWAs. My github is blank.\n\nMy question:\n\n“The definition of insanity is doing the same thing over and over again, but expecting different results.” - Albert Einstein\n\nI hear of ageism in the tech and am starting to wonder if the lack of responds to my CV is due to that. I am also aware that my experience in javascript or python is low and that will be effecting the chances. I am starting to doubt my optimism & feeling rather demotivated. I have couple of friends stuck in a chain of part-time gigs for 2-3 years now as they are unable to find a suitable full time job. I know that the market is tough now.  Feels like a recession, but signs keep pointing that this is just the teaser.\n\nI suspect that I am stuck in a loop & need some change, but not sure how radical. Don't have anyone to have an open talk with and just wanted to share any anxieties. Get some response.",
    "title": "How do I return to a CS career after a break of 5 years, I am 34 now? I am lost.",
    "subreddit": "cscareerquestions",
    "timestamp": 1558807425,
    "score": 76,
    "keyword": "indian manager"
  },
  {
    "text": "New Job Overwhelming me I recently started my first post-grad job in industry at a large and well-known networking company. I’m very blessed to have the job, but I’ve been there for 6 months and I don’t feel I’ve made the progress I should have. The whole first three months were nearly completely lost due to me being the first to try a pilot for their training program. \nMy manager/mentor just reorged and I’m currently spread out across three teams. I don’t know what to do with myself, like what my main role is, and I was a new grad with basic programming knowledge and can’t yet contribute completely to their goals, but they don’t seem to have time to incorporate me to show me their daily work because of time crunches so they give me things they don’t have time to do which is fine except that every single day the list of new technologies or interfaces or network topologies or politics grows two-fold and I can’t seem to learn fast enough to keep up! I don’t mean any disrespect but I am the only female on my team and the only non-Indian female on my whole floor/department. I find it hard to understand my coworkers and my new mentor sometimes and my new manager is in a fit because of the reorg. I’m very stressed and don’t know what to do and have deadlines for things that I don’t even know how to do and I’m trying to learn them so fast but we have week long sprints. \n\nI want to stay and be successful here very badly; but I feel like crying and I’ve already asked for too much help. I can’t keep being hand-held when everyone has so much to do. Now my three tiers higher manager wants to know what I’m doing and I honestly can hardly explain myself since my mentor just keeps doing it himself even when I ask him to go over it with me and show me the processes etc.\nAnd unrelated I have no friends because I’m the only female my age in the department and only one of two young people on my team and I just eat a ham sandwich in the basement and read a book.. I’m by myself in a new city hours and hours away from my family to try and be successful in this career and there are so many new things coming at me at once just... phew ok I need to stop typing now that’s enough.\nHelp.",
    "title": "New Job Overwhelming me",
    "subreddit": "cscareerquestions",
    "timestamp": 1549858348,
    "score": 43,
    "keyword": "indian manager"
  },
  {
    "text": "[Discussion] Experiences of international tech workers in America & burn out? Humans of New York recently shared [this post](https://www.facebook.com/humansofnewyork/posts/3228575237216554) about an international tech worker that I thought was interesting. He left San Francisco for Vancouver due to the burn out that he experienced as an international worker. Here's the post:\n\n>“I came from India in 2011 to get my Masters, and ended up working for a major tech company in San Francisco. It was a lucrative job, but there was always a looming cloud of uncertainty. Half of the people in my department were international workers-- mostly Indian and Chinese. All of us were on visas, so our future in America depended upon keeping our employment. I don’t think the managers intended to push us harder. But the international workers were more afraid, so we took more abuse. It just became part of the culture. We were given extra work, and the only way to keep up was to kill yourself every day. I just couldn’t do it. Eventually I burned out and moved to Vancouver. Canada was very welcoming. My wife and I have residency already. I’ve started my own business. I have all the clients I need. But most importantly I have a home. And I’m not talking about a brick structure. I mean a place that I’m allowed to be. Because once I had that, all my other problems seemed smaller. I could start thinking long term. Because no matter what happens, at least I know I’ll be here.”\n\nI think I've noticed this in my own experiences as well. I've seen that some teams with a majority of international workers can work very hard but the team as a whole has a terrible work life balance. As a result, members of those teams  tend to get burnt out and leave the team fairly often. I can't tell if management is applying this pressure, or if it is self imposed. I'd love to hear from other tech workers in America about their own experiences regarding this topic, whether you were born in America or came here for a job.\n\nAlso, please keep negativity out of this discussion. We're all just people who work with code that trying to make a life for ourselves.",
    "title": "[Discussion] Experiences of international tech workers in America & burn out?",
    "subreddit": "cscareerquestions",
    "timestamp": 1562692591,
    "score": 37,
    "keyword": "indian manager"
  },
  {
    "text": "Got Fired again and I think I'm in the wrong field I graduated from a state school with a degree in MIS in 2015. I had worked help desk in college and was tried of troubleshooting other peoples problems so I initially tried to get into more of a business intelligence position after I graduted . I ended up at a fortune 500 company working with Tableau , SQL, and Excel. Unfortunately when I moved across the country to work for this company the apartment I moved into had a gas leak and I got really sick. I ended up resigning a little over a month into the job and spent over a month in the hospital.  I filed to unemployment and searched for months with no luck.\n\n&#x200B;\n\nEventually I accepted a Business Analyst Position at an indian outsourcing firm as a last resort close to a year after I graduated. The company immediately put me on bench after hiring me.  6 months later the company said to take a position across the country working with EPIC  medical billing (electronic health records)  across the country or get laid off. I choose to move across the country to work with epic but hated every moment of it.  I ended up a technical support role again only this time I had to deal with highly complicated regulated industry (healthcare billing) but I also felt like I never really knew what I was doing. I was given the advanced certifications for the medical billing epic implementation but I was not given the introductory certifications or training.\n\n&#x200B;\n\nI hated my job so I started going on udemy in the evenings and weekends after working. I completed several courses including an online data science bootcamp with python , scikit-learn, pandas, numpy as well as several of the deep learning specialization courses on coursera by andrew ng. I found that I truly enjoyed programming now at least compared to working with epic and was tried frantically to get a new job as a data analyst or data scientist. However with my  limited work experience and non quantitative undergraduate degree I had no luck find work. I was told by a recruiter that no would hired me as a programmer if I didn't have programming experience or a cs degree.\n\n&#x200B;\n\nBy about a year in working with epic the client got a new manager and terminated my employment with two weeks of arriving along with another contractor. The 5 other people from my indian outsourcing company who had joined this team had all been fired months ago. I ended up enrolling at a coding bootcamp to learn full stack web development in the aftermath of being let go.\n\n&#x200B;\n\nI learn react , node, html, css, MongoDB over a few months. I was one of the best students in the program and completed the program in the top 20% of all the students enrolled. I accepted a job at a small startup as a quality assurance engineer with protractor , cucumber, and postman. I loved this job and excelled at it. I rarely had to ask for help and got to design all the test plans program automation testing for the team. In my evenings I studied for the AWS solution architect associate certification and passed the test on the first try.  I also completed several udemy courses on terraform, linux, and golang.\n\n&#x200B;\n\n6 months later my luck turned against me again. I moved in with a girl from my church and she ended up not being who she said she was. After I moved in I found out that she was messing with my medication and I ended up in the hospital. The hospital refused to let leave and would not let me use a phone. I was literally locked in the hospital like being in a prison. After two weeks I was finally let out but then I was let go from my job for not showing up.\n\n&#x200B;\n\nI looked for work for about two months until I landed a job at a  biotech startup as a devops engineer. I was really excited because I was going to learn a lot and finally advance my career. I worked about 45 hours a week I thought I was doing okay. I worked with terraform , chef, and lots of aws. But today (about 3 months in) I found out that my contract had been terminated.  My boss offered to be a reference but told me I was too green and needed to be able to troubleshoot better.  I was told I good at architecting software but I was weak at TCP/IP and raw linux command line for troubleshooting.\n\n&#x200B;\n\nI have been wanting to work in tech since I was in elementary school but I'm not sure if I am cut out for it. I struggle at raw troubleshooting and tech support and I'm starting to question if I am smart enough for this field.\n\n&#x200B;\n\nI have a year of experience with EPIC which I hate.\n\nI have four months of experence of full stack javascript but I forgot a lot of react and feel most comfortable with node\n\nI have 6 months of testing experience with protractor, cucumber, Postman , nodejs\n\nand three months of devops experience with centos, aws, terraform, chef, rsyslog, and sumologic.\n\n&#x200B;\n\nI really enjoy pandas, scikit-learn, Tableau, and SQL but there honestly doesn't like there is a lot of these job out there.\n\n&#x200B;\n\n&#x200B;\n\nShould I look into a different field other than programming? Is it possible to get a Data Scientist role with an undergraduate degree in business ? Should I stick to QA/ SDET roles since I felt I was the best at this ?",
    "title": "Got Fired again and I think I'm in the wrong field",
    "subreddit": "cscareerquestions",
    "timestamp": 1558758528,
    "score": 24,
    "keyword": "indian manager"
  },
  {
    "text": "Have I ruined my career? I gradated with my Computer Science degree in May 2017. My first job was at an Indian IT consultancy, I was hired on as a 'software engineer' but put onto supporting 10+ Java applications, almost no coding. I read online that this is a common occurrence at large consultancies.\n\nI waited to get one year experience there and then jumped ship and got a job as a 'software developer' at a Fortune 10 company - I've been put on a project now as a 'development lead' where all I use is Unix and am installing and configuring a COTS application. This feels worse than my first job. I've now learned it's important to meet the team first before accepting a job offer.\n\nI've been at my current job installing this COTS application for eight months now. I recently received C# training. I've talked to my manager and he mentioned that I \"might\" get on a .NET project in April. I have a 1x1 coming up with him on Friday, let's see what he says. But anyway, have I ruined my career not coding for the past two years? I want to jump ship again and try another job but I feel my skills are rusty now. I am skilled now at Unix, configuring networks, and application support but I feel those aren't very marketable skills for someone wanting to get into a software development role.\n\nThank you for taking time to read this.\n\nEdit: the COTS application has no code access.",
    "title": "Have I ruined my career?",
    "subreddit": "cscareerquestions",
    "timestamp": 1553700374,
    "score": 20,
    "keyword": "indian manager"
  },
  {
    "text": "About to quit my first dev job, at a breaking point... I’m currently working as an AI engineer at a mid-sized automotive company developing ADAS solutions. This is my first job out of my master’s with a focus on ML/computer vision from a well-known school.\n\nEarly from the second month since I started, I noticed that something was very wrong. The other team member did not seem to have the proper technical skills and did not take safety into account. There were only a handful of people there. Almost every tech worker here is H1B Indian, company-wide. Everyone except for the manager and I is H1B Indian.\n\nSome of them did not have a degree in CS/ECE/robotics, but hired out of a single MOOC. Some of them did not even know basic CS fundamentals like bit-shifting and how threads work. When I went there, there was not even a proper feedback control. Most of them, including the manger, doesn’t know anything about tracking, kalman filter, etc.\n\nI found it very disappointing that they were not serious about human safety, despite the highly elevated requirements of ADAS or self-driving car products. Whenever I talk to the manager that we should need this kind of technology, he completely ignores me and only listens to his Indian cronies who are basically his yes-men. Still, there is nothing like localization, mapping, or tracking, even though I strongly urged him to include them.\n\nReally, they are completely not interested in developing a robust and safe solution, but only interested in making a dirt-cheap solution on the cheapest board, that doesn’t have enough processing power. And customer safety is definitely not a priority. It nauseates me so much that imagine your mama or your children could be killed from this kind of product. For example, for something like automatic parking, they don’t even have something to track and avoid obstacles like incoming pedestrians or car. They are only interested in making something that seems to work in a very limited situation, to show the demo to potential customers. There are lots and lots of “if-statements” based on ad-hoc methods, instead of scientifically proven methods. Again, I urged him to include these, but I’ve been constantly ignored.\n\nAnd they don’t intend to fix the problem by hiring more qualified engineers with proper domain knowledge. The manager said he would only hire exclusively from India because it’s cheap, and would not hire a U.S. candidate. And while having meetings with the offshore Indian team, I noticed they don’t have the technical skills. All they do is either forking someone else’s repo from Github and playing around with some parameters, or using third, ready-made libraries like OpenCV.\n\nIn appearance, the manger just got a PhD from a no-name school in the neighborhood after I joined. But when I looked at the paper before he published, there were already at least 3 papers with almost the exact same idea. I told him that to be fair, he should cite, compare, and benchmark his result with the other papers on the same dataset. But I was ignored. The code he had was just some small modification from the code he forked from Github written by a student. With his paper and earned degree, he’s been having parties and enjoying promotions after promotions. Surprisingly, the manager himself confessed that he only took a 3 month MOOC about ML/computer vision and didn’t have much knowledge about it. Just so you know, I haven’t showed any disrespect to the other team members and always tried my best to share the knowledge I have and the best suggestion I could think of.\n\nBut one day, I noticed that they (the manager and the rest) were having secret meetings only among themselves and I was completely excluded. And what pissed me off was that they tried to file a patent based on the idea and code that I developed and shared. And this had never been discussed or informed to me. I realized this while looking through the documents in shared drive. Again, the other guy in the name did not even have a proper CS/ECE/robotics degree, did not have a proper coursework in ML, and I’m sure that he had never even heard of the terms before I presented the idea during the weekly meeting. I suggested the idea by reading multiple papers, and the patent was rejected. But it really made me upset that they were doing this under the hood. I just sucked it up because I needed job experience.\n\nContinuing from there, I noticed that the manager seemed to be continuously avoiding me that he’s having meetings after meetings. But I found him several times that he was eating in the cafeteria with other people. And even though I requested a one-on-one meeting several times, he’s constantly not seen. making excuses that he’s having meetings. And I was barely given any work and the access to the test car, while I noticed that the other members were given projects and the access to the car.\n\nA few weeks ago, I requested some simple calibration equipment for the sensors, but he continued to avoid me, making excuses that he’s having meetings. I didn’t ask for anything expensive or fancy. But when I went to a weekly meeting, he said. “Oh WE DECIDED not to do it and do something else.” And that method is low accuracy. Again, they don’t care about the accuracy and safety, they just want to create a cheap, quick-and-dirty method that seems to work. He didn’t even give me a chance to refute and explain why that method is low accuracy, but made excuses that he’s having another meeting, left, and shut the door.\n\nCurrently, I’m helping on developing code for another guy from another team, upon request, because I’ve not been given any another work from this manager for 3 weeks. It’s quite ridiculous and I don’t understand why an Indian guy who doesn’t even know what a Kalman filter is, is working on a Kalman filter tracking while I’m forced to sit idle. I’m especially sick of their disrespect from secret meetings and saying “Oh WE DECIDED to do it the other way.” And not to mention stealing my work and trying to file a patent without my name, and without discussion with me.\n\nThis is not a dream job, and I feel humiliated and guilty that I’m working for an employer who is making unsafe products that could easily kill some people, and is pursuing money over while human safety is not a first priority.\n\nI’m at a breaking point right now, and having lots of burden on my mental health. The company by the way doesn’t compensate well, and I just chose this job based on curiosity and passion for the next-big-thing technology, but I have been constantly disappointed and getting humiliated. Honestly, I regret having sacrificed studying for years working on hard stuffs like ML and computer vision. Nowadays, I’m constantly thinking that I should have just gone to a web dev job or something just right out of bachelors. Anyway, I started to revise the resume and look for another job. But seems like I’m at a breaking point and  can’t take it anymore. I just want to quit immediately, although it’s a common advice not to quit until I get another offer.\n\nSorry for rambling here. But I’m having a lot of stress from this shitty job. And this is my story. Hope you guys don’t have a similar experience like this.",
    "title": "About to quit my first dev job, at a breaking point...",
    "subreddit": "cscareerquestions",
    "timestamp": 1571628299,
    "score": 18,
    "keyword": "indian manager"
  },
  {
    "text": "[Rant] I have encountered more bullshit in my 2 years as a software developer than in my 6 years working simpler jobs Most of the bullshit I experienced happens in the workplace. The interviews for the places I got offers at were actually pretty straightforward. But these places were pretty good at hiding the skeletons in the closet when I interviewed.\n\nI have worked as a cashier, grocery stockperson, taking calls for bill collectors, and as computer lab assistant. None of the worst at these workplaces compares to the insanity I see in my software engineering jobs. Putting out fires, passive-aggressive bosses, disorganized groups, tax evasions, etc. I experience more of that in 2 years of software dev than in my 6 years in other jobs. I'm on my second SWE job. First job stayed for 6 months and this current job about a year and a half now.\n\n**First job**\n\nI was in my final semester of college. I was in a non-CS major and didn't take internships. However I took elective courses in CS and took some of my free time to build some projects and was able to convince the first company I worked for as a SWE to hire me from what I learned in those projects.\n\n This company had recently been acquired by a larger company so they had some growing pains. However, what they didn't tell me was that their current developer was quitting so I was left holding the bag. And wow, what a bag it was. Shitty legacy code mostly built by Indian developers being paid $3000 over a few months work. \n\nTheir whole deal was to manage and post content on a blog for their main magazine publication. But the custom CMS as a piece of crap. They'd be better off starting over from scratch with WordPress. But as the only developer, no time for that. Everything is go-go-go we need this fixed tomorrow or they might fire an editor because his article doesn't look good or some BS like that. Staying up till 7:30 pm was not uncommon there. My supervisor and I would be the only ones left in the building.\n\nAlso, the dev environment. The dev who left must be a saint to deal with it because we were using a CRT monitor on a desk so small that the monitor must be tilted and keyboard placed to one side of the monitor. And there is no local testing. Everything needs to be uploaded to the live server to observe the changes. Again, no time to set up things right because of deadlines.\n\n**Second job**\n\nThe second job was not as hectic as the first but still filled with a degree of shadine that every time I look at the co-founder (which was almost every day) I always catch the slimy image from him. This job is in a much better building with better offices. We walked through some large rooms with cubicles as we walked to the meeting room for an interview. It went well and later I got the offer.\n\nFirst day of work, I asked which cubicle I would work at. He told us, we all work from the meeting room. Weird but okay. Later on I learned that everything wasn't as it seems. He told a bunch of half truths at the interview. He didn't mention that the cubicles are not the same company I work in. He didn't mention his company is actually a \"garage startup\" inside a more established company (the one that owns all the floor space). Replace garage with meeting room that his boss used him to allow for side work. He didn't mention that the senior developer I talked on the speakerphone during the interview is never present in the offices, because *he lives in China*. And it just got worse from there.\n\nHe strings along developers thinking they'll go full-time after the \"contract-to-hire\" contract is finished, but in reality this company wants to hire temps. And write them off as 1099 contractors. They pass the buck of health insurance and payroll taxes onto us. But they set your hours and you use their equipment and facilities to complete the task, you shouldn't be a 1099 contractor. A \"independent contractor\" does not come into the same office day after day for 8 hours.\n\nIf this is what the company is doing, trying to bait desperate workers, I can almost guarantee they are going to be doing other shady shit, and never give you a real job. \n\n*So not only can't they be bothered to hire you in an ethical way, they can't even be bothered to hire you in an unethical but legal way.* About a year in, we all (the devs and designers) caught on eventually and started planning our escape from this job. Turnover rate went up. We had people come and go after three months, and some are still here, but most are planning to leave, including myself.\n\nContrast that to all the non-software jobs I held in the years before. No funny business, no being two-faced at interviews, and none of this white collar fraud business with tax evasion. God I wonder how you put up with this crap, must be why they pay you guys the big bucks. I've started to look for other jobs already and ready to jump out of this stinkhole.",
    "title": "[Rant] I have encountered more bullshit in my 2 years as a software developer than in my 6 years working simpler jobs",
    "subreddit": "cscareerquestions",
    "timestamp": 1561665704,
    "score": 17,
    "keyword": "indian manager"
  },
  {
    "text": "How is it to adjust psychologically when working remote and how does it affect your career? UPDATE: The Company works in a distributed manner, there is no office, All teams and their members work remotely.\n\n&#x200B;\n\nBackground: A soon to graduate student living in India\n\n**(TLDR; < See the list at the end> )**\n\nGood Evening,\n\nI am to graduate this year. All of the three startups that I worked for have offered me a decent enoughrole and compensation for the role of an SDE (High paying from an Indian Perspective) .\n\nMy experience has not been very good emotionally working for Indian Companies. I have been hurt, indignated (To be fair, There were some who have stood up for me against their management) as well as I have noticed an amount of social relegation for my humbler academic pedigree.\n\nRecently I have joined an American organization (I was recommended by someone) where I have been offered a role upfront when I am interning, They pay me more than their competitions in India by a huge margin. The people here are respectful and I feel at home (probably because I felt like I had no team belonging in my last organization which hurt me a lot, I felt like I was a scripting Intern \\[Even when I was an Engineering Intern in my Offer Letter I was assigned as a coder help to a non tech department - A Different Division. One day the manager said I won't be reviewed because I wasn't in Engineering and that broke me because I felt that my time in the Organization didn't matter. I was eventually reviewed but ghosted\\] while other interns had clear mentors, teams and a sense of belonging I worked alone took every decision by myself and all people cared about was IO and none about code quality which I felt weird (rightly so) because at previous internships an Engineering Lead took reviews and monitored me, It feels like a contract in the name of an internship. I felt alone and cordoned in a place full of people. The only people who came up to me were the Engineering Project leads who thought I did a good job and offered me Projects which led me doing additional projects for other departments in hope to get noticed, these are also the people who stood up for me when my Internship was feared to be swept under the rug and I wasn't to be reviewed for my work and a job.\n\nAnd then I joined this American Org as a remote Intern and I feel more comfortable here and I love the people around. I feel respected.\n\nBut I don't know if I could survive working alone and I don't know how is it different than working in an office, I have had a history of mental illness. And I know if I don't maintain human contact for a while I will break down. Most of my friends are college friends. With them gone to different cities I will be alone.\n\n# So as a remote employee I wanted to know:\n\n* **How does it affect one's career?**\n* **Will it have any negative connotation? Is office experience important?**\n* **How do you adjust psychologically?**",
    "title": "How is it to adjust psychologically when working remote and how does it affect your career?",
    "subreddit": "cscareerquestions",
    "timestamp": 1565868968,
    "score": 11,
    "keyword": "indian manager"
  },
  {
    "text": "Bad experience with internship manager Previous post [here](https://www.reddit.com/r/cscareerquestions/comments/c3uvgv/having_a_bad_experience_with_intern_manager/). Full disclosure, this is all going on at Facebook.\n\nUpdate: I'm now at Week 9 of my internship. I'm no longer in too much danger, I think, of not receiving a return offer, because I internalized and improved on all their points of feedback. I am on target to finish my project, but not my stretch goal, which would roughly equate to a return offer with a \"Meets Expectations\" qualification.\n\nOn the bright side, this is a lot better than it was before. Before, I wasn't sure if I'd get a return offer at all; I'm a sophomore in college, anyway, so this way I'll be able to come back (this time to their NY office, which is better for me since I live in the East Coast) if I want to.\n\nStill, I can't help but be a bit bitter about this because of the tenuous relationship with my manager throughout. I give some examples in the previous post. My complaints about him are as follows:\n\n1. **Never has any time for me:** Sometimes, it feels like he's too exasperated with me to talk to me, and this leads to my misunderstanding of his tasks. Facebook takes independence among interns pretty seriously, but this is a problem for me. For example, I was ahead of schedule on my last sequence of diffs and wanted to stay ahead so I could get my stretch goal done. However, I asked him on Monday to review my diff (mandatory) before I could submit it. He didn't have time, so he had my peer reviewers do it; I made them happy with it, but neither of them would accept the diff on his behalf and let me deploy it. Then, on Wednesday, he reviews it and makes indecipherable comments (he's Indian, as am I, but he's heavily-accented) that I have to ask him about. We spend basically the whole morning talking about it because I always have a hard time understanding him, and he accepts it by the afternoon. This whole thing would have gone a lot faster if he was easier for me to understand and/or if he participated in the review from the beginning.\n2. **Miscommunicated critical things:** This week, he told me that I have to build a module to go with a diff that I submitted two weeks ago. He'd thought I'd already done it, but didn't bring the absence of that module up two weeks ago when that diff was in review (he'd known that that module would be needed all along.) Furthermore, he communicated to me that I'd finished a milestone that included that task, so now I'm getting \"I know I told you you finished it, but you didn't really\" from him.\n3. **Very hard to talk to:** He's a very introverted and private kind of guy, not to mention stressed out in general by his job and his personal life (newborn son.) Sometimes, it feels like he's angry with me for things like asking him how his weekend went. This bleeds into our work as a team, too, because I can't understand him sometimes about tasks; both my peer reviewers are very easy to understand and pretty amenable to whatever I want to do, and I've talked to a lot of people, engineers and managers alike, who made me feel like they spoke my language, but my boss has almost always made me feel the exact opposite. There have been numerous times where he'd shot down an idea that I had, only to repeat it to me as if it were his own and not understand that that was what I was saying in the beginning.\n4. **Shoots down my offers to do additional work:** I had a stretch goal that involved refactoring \\~1.5K lines of code; he told me to do it in the beginning of the week, thinking that we had time, but told me to shift focus away from it and onto the main project on Wednesday when I was basically already half done. I wanted to push it out since I was already almost done and since this would have given me a shot at an \"Exceeds Expectations\" classification, and even offered to come in on the weekends to do so, but he put his foot down and told me not to do it because there's nothing I can do to \"exceed expectations.\" This particularly infuriates me, because I worked hard from the beginning and was on fire w.r.t. productivity at one point; I could have greatly exceeded expectations on my project if not for the setbacks from (1-3)!\n5. **Unclear about feedback**: According to my team manager (boss' boss,) the biggest thing Facebook cares about when evaluating interns is productivity, which was good for me because I was on fire with productivity since the beginning. That was actually my strongest point, and even my manager acknowledged that I could have been extraordinary among the interns with it if not for other setbacks. However, the reason this doesn't stand out in my case is that there were enough setbacks from (1-4) that I won't have time to finish my stretch goal, which I would have had ample time to do otherwise. Both my peer reviewers say that there are no problems with my work and give me high reviews against Facebook's \"Five Pillars of Performance\" at this point, but my boss always goes back and forth from \"yeah, you've improved and are now doing well\" to \"I know I said you've improved, but not that much.\"\n\nThat's just the short list! I could continue to talk about specific instances of each item, but as you guys can see, I'm having a pretty bad experience working with this dude. I've started to get stressed out at the prospect of even talking to him, and favor asking my peer reviewers for clarification much more than I do him.\n\nI know this seems like a shitty thing to complain about, given that I am, after all, probably going to get a return offer. It's just that I'm the kind of guy who would work 80 hours/week, no questions asked, if it meant that I would become a better engineer and would have something else to show for myself. In fact, I've dreamt for year about being a successful and prolific engineer who pushes science forward in his everyday work, and would do anything to get there. From the start, my peer reviewers were telling me how smart I came off as in the way I work (use Vim, armed to the teeth with Bash commands) and gave me kudos for high productivity and code quality standards; it feels like, even though I'm doing \"fine,\" I could have been extraordinary if not for all this miscommunication and back-pedaling with my boss.\n\nAs for Facebook overall, it sometimes just makes me feel worse because, as per the culture, everyone seems to always have a good time and always be talking about how awesome the company is. There are a lot of other kids from my Uni who've come to FB, and they're all doing great. It's that and all this company Kool-Aid that makes me feel like there's something wrong with me.\n\nWould it be advisable for me to intern somewhere else next year? Now that I'm heavily considering it, I would much prefer a smaller company, clearer lines of communication with my manager, and more focus on becoming better at software engineering rather than talks with Sheryl Sandberg about how they're changing the world. I just want the opportunity to become a better software engineer, and I'm starting to wonder if I'm getting as much as I can of that at FB; I'm clearly not with this manager...",
    "title": "Bad experience with internship manager",
    "subreddit": "cscareerquestions",
    "timestamp": 1564091874,
    "score": 12,
    "keyword": "indian manager"
  },
  {
    "text": "Confused between 2 job offers for a PM role Hi all,\n\nCurrently I am in the middle of changing jobs and need some advice on which job would be better from a Product Management and future career perspective.\n\nMy background - I am an Indian female with around 3 years of work experience and currently work as an Associate Product Manager at one of the unicorn startups in India.\n\n1st offer - it's a L5 Product Manager role in Amazon, India. Offering decent salary. The product vertical looks good - pretty critical to the business.\n\n2nd offer - Its a Product Manager role in Zalando, one of the fashion tech unicorns in Germany. The product vertical is great - again pretty critical to the business. The salary is average(<60k euros) and I would have to relocate to Berlin.\n\nI believe my savings from the salary in India would be more than I would be able to save in Berlin at that salary.\n\nMy short term goal is to pursue higher studies - I am aiming for an M7 MBA (mainly Harvard, Stanford, Wharton, Sloan) and INSEAD for applications next year i.e MBA starting from 2021.\n\nI guess my question is, which of these jobs would be bigger value add to my profile, also from an MBA perspective and otherwise?\n\nPlease do share any other pointers that can be helpful in making this decision. Thanks :)",
    "title": "Confused between 2 job offers for a PM role",
    "subreddit": "cscareerquestions",
    "timestamp": 1570630955,
    "score": 6,
    "keyword": "indian manager"
  },
  {
    "text": "Company being really cheap. But I've only been here for a few months. Should I look already? Some background:\n\n* Graduated 2018 non-cs\n* Worked for indian IT consulting company for 9 months. Salary was under 60k.\n* Got job at e-commerce company handling logistics software. Salary is around 70k. I work primarily with React and C#/Entity. Been here for almost 6 months.\n* PNW but not Seattle.\n\nI learned they wanted to hire a developer to work at their warehouse in the midwest. I really want to work in the midwest and since I already know the processes, the company wouldn't have to train someone remotely which would be a huge pain so I offered to relocate. Also, it's easier to find a competent developer in the PNW than where their warehouse is.\n\nThe managers agree, but CTO said no unless I took a massive paycut since cost of living is lower over there. It's only lower by 10% and I'd go from no state income tax to over 5%. I said no, and basically the CTO is saying that they are going to try to find someone for cheap before thinking of relocating me.\n\nThis makes me think that yearly raises are barely going to be a thing and I'm already not a fan of how expensive some of the benefits are. Would it look bad if I started looking for work already or should I wait to hit at least 1 year so it doesn't look like I'm job-hopping all the time?",
    "title": "Company being really cheap. But I've only been here for a few months. Should I look already?",
    "subreddit": "cscareerquestions",
    "timestamp": 1576097197,
    "score": 4,
    "keyword": "indian manager"
  },
  {
    "text": "Typical security of a contract-to-hire job? This one is not turning out how I expected. I was hired by one of the co-founders of a small company to work for him as a junior software engineer. This is on a contract-to-hire basis starting with a 1099 contract period of 4 months for $18/hr and converting to W-2 full-time at $24/hr.\n\nThe company makes websites for other businesses, usually based on WordPress, or e-commerce stores. Nothing too crazy. There were only a few, like 3 or 4 developers and designers in-house but several more off-shore. \n\nThe company is very transparent about this and even mentions their Indian office in the contact page. (co-founders are not Indian but one of the managers is)\n\nAt the end of the four months, I got a performance review and co-founder says that he likes my performance a lot and is offering me a promotion to Project Manager, I politely declined saying that I prefer being a software engineer and building my software skills. He was fine with that except that he just decided to extend my contract period with no definite end. Says that he hasn't set up payroll to make full-time happen.\n\nA year later I was still a contractor, but churning out project work at a more consistent pace. I got used to the rhythm of juggling multiple projects, talking to many clients and even had two in which we personally visit their offices and get some days to work directly with them.\n\nIt eventually dawned on me and a few other local workers that he's keeping the local US developers as independent contractors and no real work is being done on getting them in full-time. At this point I decided if things won't change I might start looking for work. \n\nAlso while the higher-ups are mostly in their same positions we had several people of lower-levels (sales, SWE) come and go in just a few months. We were a shop of only about 15 people locally, but fresh new faces every 1-2 months were common.\n\nSo is this probably the norm for a smaller company that is still growing and shuffling around core staff in order to find out what is best for the company? What about job security? I am still an independent contractor with the same hourly rate. None of us are getting any employment benefits and if I quit I won't get unemployment.\n\nBecause I'm an IC though I started coming in at later hours, generally applying a more flexible schedule to take advantage of my status. I don't think my co-founder likes it but the rules are the rules. I still get my work done on time regardless.",
    "title": "Typical security of a contract-to-hire job? This one is not turning out how I expected.",
    "subreddit": "cscareerquestions",
    "timestamp": 1559845371,
    "score": 3,
    "keyword": "indian manager"
  },
  {
    "text": "Consulting firm has me in BI at Microsoft, but are giving the opportunity to move to web dev instead. But commute might be bad. Is it worth it? I'll try to keep this short. I currently work at Infosys, an Indian IT consulting company, and I am working out of their Redmond campus in Redmond, WA where it was planned that I'd be working in Business Intelligence with Microsoft. The original plan when I was hired was to get into full stack Java work but they didn't have anything at the time and placed me here.\n\nAfter learning what BI entails via 2 months of training, I asked if there was a way to be placed in web development instead.\n\nManager said that the process is that if I want to leave BI they can try to put me into web dev work but I would have to go back on bench, I may end up working much farther (up to 1 hr commute), and most likely with a less prestigious company than Microsoft. Sadly, I have to decide today cause the new BI project starts Monday.\n\nWould I be stupid to not choose web dev even if it means a bad commute? I am working hard outside of work to get a better job, but don't anticipate that happening anytime soon.\n\n* Pros of staying: Environment is very lax, show up anytime 7-11am as long as I am here for at least 6 or so hours, nice campus, 5 min commute.\n* Cons of staying: Doing BI, not web dev.\n* Pros of leaving: Doing web dev, not BI.\n* Cons of leaving: Commute will be much worse, don't know if the next project or team will be as lax.\n\nI know it is a personal decision, so I'm just curious what you guys think.",
    "title": "Consulting firm has me in BI at Microsoft, but are giving the opportunity to move to web dev instead. But commute might be bad. Is it worth it?",
    "subreddit": "cscareerquestions",
    "timestamp": 1550862644,
    "score": 3,
    "keyword": "indian manager"
  },
  {
    "text": "How do people cope with the stigma attached to being a management consultant when working with clients on a desperately awful assignment? I am a change management consultant with many faces: ex child literacy volunteer, ex-Big 4, ex-two behemoth IT consultancies. \n\nI tried to leave management consulting for good after 11 years into a Change industry role but unfortunately I got sucked back in. I'm now a Culture change contractor operating on behalf of an Indian IT outsourcer. While its only a short-term assignment, i'm commuting five hours one way weekly between two cities, with my wife and daughter away from me for an assignment that doesn't need my services as an Organization Change Manager.\n\nI don't really care about the projects success (its not my client business at stake, nor is it my consultancy organisation revenue margin - I only have a employment reference at stake). After my fair share of awful, demeaning, tricky, consultancy assignments (a project I did at PwC Spain the Partner offered to deliver it for free during the financial crisis) this is really the worst assignment I've ever had the misfortune (or fortune dependent on your standpoint) to experience. Lots of lessons to be learned (or mostly unlearned) unfortunately on how not do things...\n\n* Programme managers not communicating to the customer or their teams for several days and weeks\n* No project management plan, not even a PMO function set up\n* the Transition team committed 175 resources to be on the ground; now 4 months behind schedule and they have only delivered 95 bodies\n* Sending a status report to a customer Steering committee 4 weeks running where due dates for actions ALL occur in the past so forth\n\nPsychologically and culturally its a real struggle being present here at this circus. I'm being paid well and i realise I'm lucky to have another professional services employment (despite my experience, and investment in my career and competences). The assignment is part of a broader 'strategic partnership' and is not billed as time and expenses but at as whole service level contract.\n\nThings have gotten so bad, the Consultancy programme manager last replied to the customer 3 weeks ago (!), and when i challenged the customer on something they said last week about Change not adding value they said firmly \"No, the customer is always right\", to which, and I'd never imagined myself breaching professional etiquette and due care but I replied: \"actually no that's not true. its my role to tell you are WRONG for these reasons, and for these benefits to your project.\" Was this a step too far?\n\nPlease share your experiences!",
    "title": "How do people cope with the stigma attached to being a management consultant when working with clients on a desperately awful assignment?",
    "subreddit": "consulting",
    "timestamp": 1560346888,
    "score": 4,
    "keyword": "indian manager"
  },
  {
    "text": "Black History Month: Baseball Managers, Coaches, and Executives In memory of his passing today, my selection for today's topic is baseball managers, coaches, and executives, and specifically Frank Robinson.  Mr. Robinson was actually born in my hometown of Beaumont, Texas and during his career won two MVP awards and one World Series.  In 1975, he made history as the first African-American to be named of a major league club, when he was named as manager of the Cleveland Indians (while still playing!!!).  Mr. Robinson passed away on Thursday, February 8, 2019.  Rest in peace with the ancestors Mr. Robinson.",
    "title": "Black History Month: Baseball Managers, Coaches, and Executives",
    "subreddit": "blackladies",
    "timestamp": 1549605375,
    "score": 11,
    "keyword": "indian manager"
  },
  {
    "text": "Korean-American software engineer claims discrimination by Intel managers of Indian descent",
    "title": "Korean-American software engineer claims discrimination by Intel managers of Indian descent",
    "subreddit": "asianamerican",
    "timestamp": 1564275824,
    "score": 44,
    "keyword": "indian manager"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 126,
    "keyword": "indian manager"
  },
  {
    "text": "Low pay gender discrimination in Australia If you live in Australia - and this applies generally in Western countries - you will hear the moaning and complaining about women having a pay gap with men. Women have all the bad jobs, men are arseholes who murder their wives, and we need to rape the reputation of men as a group and provide the good jobs to women not men on the basis of gender to make all this iniquity right.\n\n&#x200B;\n\nYou've heard the spiel, right.\n\n&#x200B;\n\nTo this I have two words of response: Taxi. Driver. \n\n&#x200B;\n\nOf course women usually primarily care for young children, and schools during the day primarily care for older children. Sure there are exceptions, higher earning mum goes out to work, dad stays home and enjoys himself with baby - good on them. Not many women want that, they want to mother the babies and they want hubby to earn well to make it easy. \n\n&#x200B;\n\nGiven this, and how competitive it is to reach senior positions in competitive workplaces (ie. all workplaces), I find it not surprising that there are so few married women with children in the highest levels of management, eg. board level or senior exec. I find it extraordinary and manipulated - although given the endless rounds of women promotion (literally, like into the juicy senior job everyone wants) and male reputation tarnishing I'm not surprised - that THAT THERE ARE SO MANY WOMEN IN VERY SENIOR POSITIONS. Sometimes you get a talented go-getter who gives up everything including family for career - Julie Bishop, the former foreign minister of Australia, is a good example of this. She earned it. However, given the time out for family commitments, it boggles my mind that married women with multiple children would make it to the top without being given the job based on their possession of a vagina. In other words, you need manipulation in the extreme in favour of female applicants and against male ones to get the numbers of senior women in the workplace we have now, let alone this being an example of discrimination AGAINST women.\n\n&#x200B;\n\nLet's get back to taxi drivers. In Australia being a taxi driver has been one of the lowest status jobs out there. They work insane hours to support families and typically earn somewhere around $8 an hour, in a socialist country like Australia where minimum wage is set at around the low $20s per hour. They have to sit all day long, which is awful for health and posture, they're exposed to the sun, they have to deal with sometimes drunk and abusive customers and not uncommonly physical assaults. Surely if we want to help low income earners, taxi drivers would be the perfect place to start. Surely a few rallies to parliament house, some politicians speaking out for them, the charities and social services organisations prioritizing taxi drivers income. Well....not exactly.\n\n&#x200B;\n\nAny guess why not? It wouldn't be anything to do with the fact that something like 98% of taxi drivers are men, would it? In Australia, Indian immigrant men, by the way.\n\n&#x200B;\n\nLook, if like me you have a dick, and one or two testicles swinging on either side of it, you're not going to get any airtime. You're the aresehole, remember? So that taxi driver who earns $8 an hour is the arsehole, oppressing that focused white or Asian early 40s women who gets promoted to chair of the board and earns a few million yearly. But he's got a dick, so we already know he's bad, so why am I even writing this?\n\n&#x200B;\n\nMen I have no idea what to do in a society that hates my gender so much. I mean for us as a group, on an individual personal level there's usually plenty we can do. The way I see it, things went so nuts so quickly all I can see is at least making men INTERNALLY aware of how the system is stacked against them. I share many others' skepticism of any positive change to men's conditions through the political process, or even a willingness to block their further erosion through more and more man-hatred expressed through law and social beliefs. The only thing I believe I can do beyond the personal level is to at least make as many men as possible aware of the how under siege we, as a gender, have become.\n\n&#x200B;\n\nGood luck to all, but most particularly to Indian male taxi drivers, and least particularly to wealthy early 40s CEOs of large companies who got there mainly because they had a vagina.",
    "title": "Low pay gender discrimination in Australia",
    "subreddit": "MensRights",
    "timestamp": 1550710749,
    "score": 17,
    "keyword": "indian manager"
  }
]