[
  {
    "text": "can i sue? I am a temporary worker at a university in the Northeast.  I am the only actual worker bee in the core facility that I wrok in.  There are three directors who manage me.  And they are micromnaging me, and I believe are intent on forcing me out when the hiring freeze (covid) is lifted and they can bring in some one from India at about 1/2 my salary.\n\nSo they (2 out of the 3 managers) are making my life miserable, micromanaging even the smallest details.  Even down to things like Where I place the emergency key for when we might get locked out.  \n\nIf it turns out they decide to fire me, can I sue for unfair employment practices.  I think they would have a hard time finding someone with my skill sets, but if they have someone in mind from India (yes, these managers are Indian), they could make sure that person got hired instead of me.  \n\nHow to proceed?",
    "title": "can i sue?",
    "subreddit": "jobs",
    "timestamp": 1626803270,
    "score": 1,
    "keyword": "indian director"
  },
  {
    "text": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture. In 2012, while running for the US Senate, former Missouri House Representative Todd Akin stated, [\"If it’s a legitimate rape, the female body has ways to try to shut that whole thing down.”](https://www.politico.com/story/2012/08/akin-legitimate-rape-victims-dont-get-pregnant-079864)  As someone who [worked for IBM selling computers and ran the maintenance department at his father's steel company](https://news.stlpublicradio.org/government-politics-issues/2012-10-02/akin-embraces-image-of-minuteman-as-he-battles-establishment-including-his-own-party), it clearly gave him the expertise necessary in women's anatomy, biology, and physiology to be able to make this assertion.  Of course, as an anti-choice usurper of rights, what type of man would he be, unless he [physically restricted access to reproductive healthcare clinics for women in need](https://archive.thinkprogress.org/todd-akin-was-arrested-multiple-times-for-physically-blocking-womens-access-to-abortion-clinics-7dda2f38d322/)?\n\nAkin's son, Perry, said, [\"As my father’s death approached, we had people from all different walks of life share story after story of the personal impact he had on them.\"](https://apnews.com/article/former-rep-todd-akin-dead-0a1b944f96eee4b63d9ea57e04c44ca4)  Of this, I have no doubt.  I'm certain that there are millions of women across the globe who would have liked to share the impact your father's life had, and will continue to have, on them.\n\nIn 1990, Lawrence Lockman, a Republican member of the Maine House of Representatives wrote, while serving as director of the Pro-Life Education Association, [\"If a woman has (the right to abortion), why shouldn't a man be free to use his superior strength to force himself on a woman?  At least the rapist's pursuit of sexual freedom doesn't (in most cases) result in anyone's death.\"](https://archive.vn/5cKpD)  Well, in that case, since you make such a perfectly reasonable, rational argument...\n\nIn 1990, Texas Republican gubernatorial nominee Clayton Williams, lamenting poor weather conditions that threatened to cancel a cattle roundup at his West Texas ranch, likened the atmospheric conditions to rape, stating, [“Rape is kinda like the weather. If it’s inevitable, relax and enjoy it.”](https://www.snopes.com/fact-check/personal-foul/)\n\nIn 2018, former US Rep for Iowa, Republican Steve King was asked about his stance of not allowing exceptions for either rape or incest in anti-choice legislation.  He said, [\"What if we went back through all the family trees and just pulled out anyone who was a product of rape or incest? Would there be any population of the world left if we did that?\"](https://www.desmoinesregister.com/story/news/politics/2019/08/14/steve-king-abortion-rape-incest-westside-conservative-iowa-representative-birth-iowa-civilization/2007230001/)  Steve King, everyone; noted critical thinker, [construction worker](http://kingconstruction.net/), and [avowed](https://thehill.com/homenews/house/413601-steve-king-members-of-nazi-linked-party-in-austria-would-be-republicans-if) and [unabashed neo-Nazi](https://www.vox.com/policy-and-politics/2018/6/13/17459908/steve-king-neo-nazi-tweet-retweet).\n\nFormer Republican Senator from Pennsylvania, Rick Santorum, most recently in the news for attempting to erase all remnants of Native Americans from North American soil ([\"We birthed a nation from nothing. I mean, there was nothing here. I mean, yes we have Native Americans but candidly there isn't much Native American culture in American culture\"](https://twitter.com/JasonSCampbell/status/1386685340522536961)), when asked what his views were on abortion in cases of rape and incest in 2012, stated, [\"...the right approach is to accept this horribly created--in the sense of rape--but nevertheless a gift in a very broken way, the gift of human life, and accept what God has given to you...We have horrible things happen.  I can't think of anything more horrible.  But, nevertheless, we have to make the best out of a bad situation.\"](https://archive.thinkprogress.org/santorum-to-rape-victims-make-the-best-out-of-a-bad-situation-a8388910c907/)  Apparently, in the case of rape, it's a gift.  It's a horribly created gift, yet nonetheless, a gift.  However, in the case of incest, it's what?  Just a regular, everyday gift?  A normal byproduct of a fully-functional family life?\n\nAlso in 2012, Richard Mourdock, a Republican candidate at the time running for Senate in Indiana, stated, [\"...I came to realize life is that gift from God.  And I think even when life begins in that horrible situation of rape, that it is something that God intended to happen.\"](https://www.cbsnews.com/news/richard-mourdock-even-pregnancy-from-rape-something-god-intended/)\n\nIn 2014, Montana Judge Todd Baugh sentenced a 54-year-old, admitted child molester, convicted of repeatedly raping his 14-year-old female student, who committed suicide during the course of the trial, to 30 days in jail.  At sentencing, he stated that the victim [\"seemed older than her chronological age\" and was \"as much in control of the situation\"](https://thelede.blogs.nytimes.com/2013/08/29/protesters-demand-montana-judge-resign-over-rape-sentencing/) as her rapist.  One month later, in an interview, he defended his decision, stating, \"Obviously, a 14-year-old can't consent.  I think that people have in mind that this was some violent, forcible, horrible rape.  It was horrible enough as it is just given her age, but it wasn't this forcible beat-up rape.\"  [He also added that her death complicated the case](https://www.usatoday.com/story/news/nation/2013/08/28/teacher-rape-montana/2722817/).\n\nIn 2019, a Tennessee Judge Steven Sword sentenced former pastor, David Richards, to 12 years in prison, 60 short of the maximum prosecutors had sought, for repeatedly having raped his adopted daughter over the course of two years, beginning when she was 14-years-old.  Richards maintained his innocence throughout trial, attempting to portray his victim as a rebellious teenager, who only made the allegations, after he had imposed strict rules for his children.  However, his DNA profile was lifted from a seminal fluid sample recovered from the girl's bed frame.\n\n[The judge, in handing down his lenient sentence, stated that he took into account Richard's longtime ministry, the Bible study he began in jail while awaiting trial, and the community support he received from family, friends, and fellow Christians](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/).\n\nAt sentencing, over 30 friends and parishioners sat on Richard's side of the courtroom in support of him, while only six appeared for his victim.  One of those appearing on behalf of Richards to argue for sentencing leniency, David Thompson, who shared ministerial duties w/ Richards at their church, said, [\"I find it impossible for me to believe he's guilty of this. His business needs him. His family needs him. Our church needs him.\"](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/)  Clearly, his family needs him, since he's such a wonderful father.\n\nAnd, of course, there's the new breed of vitriolic misogynists who, in a single breath, deny rape culture while proliferating it w/ their toxic ideology.  They refer to themselves as \"[Western chauvinists](https://www.splcenter.org/fighting-hate/extremist-files/group/proud-boys),\" but in reality, [they're nothing but neo-Nazi terrorists](https://www.timesofisrael.com/not-nazi-enough-proud-boys-leader-wants-group-to-fully-embrace-white-supremacy/), and [that's all they've ever been](https://www.adl.org/blog/proud-boys-bigotry-is-on-full-display), so don't be fooled by their rhetoric.  They've now taken to wearing suits and ties and [holding yearly conventions that promise to make \"men masculine again,\" while \"Making Women Great Again.\"](https://the21convention.org/)  Since last year's conference was such disgrace, [this year's conference promises to be an even more hatefully misogynistic experience w/ 17 featured speakers, and in a first, they're actually going to allow to women to speak](https://22convention.com/)!\n\n>Women today are being taught to act more like men. Where has that led us? Skyrocketing rates of broken families, a documented decline in female happiness since the 1970s, endless social and dating dysfunction, and America at the #1 spot in the world for single motherhood. No longer will you have to give in to toxic bullying feminist dogma and go against your ancient, biological nature as a woman, great men and women have arrived to help #MWGA.\n\nIt's pretty clear that this toxicity has led to a rape culture that's just intolerable, and this is just a snapshot of what's taking place in America.  [Gender-based violence has rooted itself in some of the most populous countries in the world, and the problem only appears to be getting worse](https://www.atlanticcouncil.org/blogs/southasiasource/understanding-rape-culture-in-bangladesh-india-pakistan/).  In other parts of the world, the abuse of women is absolutely horrific, [akin to something the Third Reich did to Jews in the death camps](https://scholarworks.lib.csusb.edu/cgi/viewcontent.cgi?article=1233&context=history-in-the-making).  In 2016, an [Indian woman from the state of Rajasthan was gangraped by her husband and his two brothers](https://www.indiatvnews.com/news/india-woman-gangraped-by-husband-in-laws-tattooed-with-expletives-over-dowry-336883), then tattooed across her forehead and hands/arms w/ expletives, b/c her family failed to meet the husband's dowry demands.  In 2018, [a 17-year-old Moroccan girl was abducted, tortured, and gangraped by 13 men over the course of two months](https://www.aljazeera.com/news/2018/8/27/morocco-outcry-after-girl-is-raped-tattooed-with-swastikas).  They burned her w/ cigarettes and tattooed her all over her body, including w/ symbols of swastikas.\n\nThis could go on (and on and on and on and on), but there's only so much space available on the Internet.  What's clear is that those who perpetuate this violent culture are the same who propose and legislate the wholly ineffectual laws designed to deal w/ this problem, and they're also those who enforce, prosecute, and adjudicate said laws.  In a sense, it's allowing predators to sit in judgment of predators, while, at the same time, giving them the option to dismiss those they victimize.  I'd say that it's a broken system, except that it's not.  It's a system that's working exactly in the way in which it was intended.",
    "title": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633547326,
    "score": 2036,
    "keyword": "indian director"
  },
  {
    "text": "Rant! Should I quit? I work in a non public First Nation (Indian) school in Canada.  It has some great perks (class sizes under 10, etc), but I feel I'm being treated with so much disrespect I feel like quitting.\n\nThe educational director decided we needed a \"team building\" weekend in two weeks.   Weekend at a resort, free spa treatments.   Very nice.\n\nBut we are carpooling.  (It is 4 hours away) One member of my carpool told the rest of us that she is in charge.  She will drive, decide when we leave, where we eat, when we return.  This teacher is personal friends with the principal (but refuses to associate with the rest of the teachers).\n\nI sent a brief email to the education director asking if the person who is the self appointed driver can make up all these rules.  Maybe I should have asked the principal, but the Ed director is organizing it and I know the principal would side with his friend.\n\nThe Ed director emailed me back saying that no one person can be in charge and we need to discuss this.   Within the hour, the principal comes to my room and starts yelling at me that I was unprofessional to ask the Ed director questions when he is my boss.  I proceeded to ask him how to proceed with the teacher that insist she makes the rules.\n\nHis response \"you don't get to make choices.  We make choices where you will eat and what you will do.   You don't get to choose McDonald's \"  (I am a 6 ft, 300 lbs guy).\n\nAm I right to be SUPER annoyed at this?  Like feeling i want to quit?  There are hundreds of teaching jobs, why should I work for someone who wants to insult and yell at his staff?\n\nEDIT:  so my principal dropped in and observed my class unofficially yesterday.  We were doing a Lumio review (if you know what that is) when one of the kids turned to the principal and started talking about what they were learning (how the government t had banned the Potlatch).  Great I thought, engaging with the material.\n\nNot according to the principal.   I arrive today to have a written warning that my classroom management skills need to be improved because a student talked during a lesson and I didn't correct him.",
    "title": "Rant! Should I quit?",
    "subreddit": "Teachers",
    "timestamp": 1636604559,
    "score": 25,
    "keyword": "indian director"
  },
  {
    "text": "District wants to move me to K-8 music teacher. I dont have a strong background in Music. Need Advice. The title says it all but heres some additional info.\n\nI teach in a small rural school on an indian reservation. We have less than 400 kinds in the entire school, k-12\n\nMy district has been without a music teacher for nearly 2 years now.\n\nSome of my coworkers and superiors have noted my frustration with my class this year and i have indicated that i'd be open to moving up, down, sideways and into a specialist position if available. I just never thought they'd ask me to do music. My degree is in French and political science with a post bac elementary ed teaching endorsement. \n\nI'm intrigued at the possibility to teach the kids music (i've found great resources and materials to help me in that matter) but i'm nervous for teaching the 6, 7, and 8th grade students since i am somewhat deficient in this area (they are too but the burden is on ME to be the expert). They youngsters, i'm not too concerned about. the resources seem adequate to meet my needs with them. Honestly, K-6 would get me for a 25 minute special once a week but the middle schoolers would get me 45 minutes a day.  \n\n\nMyself, I've been taking music lessons for my own enjoyment for a while and getting good at guitar for a novice. On a professional level, i'm desperately looking for a reason to stay in the profession since whatever i've been doing and experiencing in the class hasn't been working for me so i want to give it one more year and changing it up like this seems like a good opportunity to test if continuing teaching is something i truly want to do. My girlfriend is musically inclined and is 50/50 on it but is leaning towards me trying it because she knows i'm currently dissatisfied with my career. My buddy is the band director in a neighboring town and he says it's 100% doable  but i'll need to work my tail off for the christmas concert. An in building para/TA wants to be my permanent in class aide and we even mentioned him taking it over when he completes his degree but thinks it would be a really good idea for me to take it (i think he just likes hanging out with me during the day, he's a cool guy). \n\nI WANT to do it but i dont want to put myself in a positon where i cant succeed. On the other hand, this is likely my last year in education barring some sort of epiphany.\n\nI figure, worse comes to worse, i teach music one year, decide to leave the profession with 5 years (retirement minimum in my state) and move on to law school and start a new professional career from that. Best case scenario, i find that passion for teaching that i seem to have lost and really excel at teaching music (despite my shortcomings). I know i have a lot of homework to do over the summer to be an adequate music teacher but i'm essentially all they got at this point and idk if i WANT to be in a regular classroom anymore so this might just be the breath of fresh air and change of pace i need. \n\n&#x200B;\n\nAnyone have any thoughts, experience, or insight into this? Keep it kind, keep it clean, keep it constructive, please.",
    "title": "District wants to move me to K-8 music teacher. I dont have a strong background in Music. Need Advice.",
    "subreddit": "Teachers",
    "timestamp": 1620079132,
    "score": 5,
    "keyword": "indian director"
  },
  {
    "text": "Help dealing with a super toxic/ racist work environment For background im black 23 year old Muslim woman and work for a super large media company based in London.  Its my second corporate job after university.  My last role was for the same company but in a start up section (if that makes sense) and the vibe was super chill.  We could work from home, the director wore jeans and t shirts and everyone was super chill and pretty diverse.\n\nI have now moved to a different role in the company in the main area of business and it is super corporate.  It is mostly white and most of these people are straight out of Oxford and private schools.  I am the only black woman out of 90 people and 1 of 2 black people and I cannot help but feel like I stand out especially because in my old team I had a older black woman who acted as my big sister.  In my first week whilst on a call with the Italian and German markets they remarked they could not have a 'black man' in a TV ad as it doesn't work in their markets I had my camera off so they weren't aware a black person was  on the call ( my name is generically ethnic) however I was told this was going to be taken very seriously and had a meeting with my team director who remarked that he was indian and one of the people on the call had a black husband.  This made me feel super disheartened as they were once again resorting to the black friend trope but I tried my hardest to move on.\n\nThe next week I was sitting in a communal area when another director was speaking to two white colleagues, he remarked that he used to live in a area of North London ( which is very nice but has a significant black population) and joked that he called the area stab central before laughing.  This hit very close to home as I am from a neighbourhood where stabbings are unfortunately quite common, one of my friends was stabbed a couple of years ago and now is paraplegic and my younger sister witnessed a classmate being stabbed to death on the train and is still traumatised.  This white privileged man joking about London's stabbing epidemic made me so mad and disgusted and I spoke to a colleague who was active in the diversity network (east asian male) about how horrified I was.  He proceeded to say that this kind of language is normal and he has heard way worse, so much for POC solidarity.  I spoke to a colleague and she said it was horrible but I don't think anything is being done about this. \n\n I am 3 weeks into the job and honestly I feel like the environment is so toxic I don't think I can last much longer.  What should I do, its a very hierarchical organisation so people will be scared to talk against directors if I need witnesses and such but I really don't want this to be swept under the rug and I really want to make things better for the other young working class black girls coming up after me. Any advice is appreciated.  Thanks so much!!",
    "title": "Help dealing with a super toxic/ racist work environment",
    "subreddit": "blackladies",
    "timestamp": 1638981406,
    "score": 17,
    "keyword": "indian director"
  }
]