[
  {
    "text": "An Open Letter to TCS Leadership Dear Leaders,\n\n&#x200B;\n\n&#x200B;\n\nI'm wishing this letter reaches TCS CEO Krithivasan, CHRO Milind Lakkad, CTO Ganapathy Subramanian and other top brass who can't be considered regular employees.\n\n&#x200B;\n\nAs a Tata group company, TCS has its values, purpose and direction in society, that most of us employees are really proud of. With this letter, I would like to urge you guys to introspect how just you have been to our values and how much you care for our own people. The company enjoys numero uno position among Indian IT peers, but what do we really have to be proud of?\n\n&#x200B;\n\nFirstly, let's talk about promotions. As you know, promotions are the only way to earn meaningful hikes within TCS. Even though you claim 12-15% raises are provided to top performers each year after appraisal, the reality is that A band gets \\~8%, B \\~6% and all other bands below that. Would you dare to publish the percentage of workforce who got the 12-15% any year, who you consider top performers? This is just a marketing gimmick you guys have been very successful at, until now. So, on promotions, how many promotions above C1/C2 level (C1 is Systems Engineer, the junior most level after trainee confirmation in TCS) have you rolled out in the last 5 years? Promotion cycles are on hold everytime the employees check internally and initiated promotions are pending with corporate HR function for 600+ days without a decision. 600+ days for a decision!!! Imagine that!\n\n&#x200B;\n\nDuring this last 5 years, as Indian inflation has stayed close to the 7% range, what benefit has any employee really made. Take the case of other geographies - US, UK, Europe or any other - where have you provided meaningful raises compared to inflation. And during the same period, how much has your salaries increased? Shouldn't you be role models leading the company through a tough phase if that's the real reason behind not initiating any promotions or raises to common employees? Let's take the average raises all C level leadership got in the past 5 years as a point of comparison. We only have the data that you publish through your friendly media. You have the accurate numbers. Compare it.\n\n&#x200B;\n\nMid Level Transformation and Wings Programs. - For outsiders, these are internal skill development programs they've introduced to retain talent. Aren't these programs cleverly crafted to TCS's advantage of marketing learning hours with each quarterly report or in presentations to be clients? Except the Wings1 which is applicable to junior cadre, how many employees have made monetary benefits from any of these other programs and by how much? Another deceiving tactic to ask employees to go through, just to delay promotions when they ask for it.\n\n&#x200B;\n\nThese transformation programs were aimed at bringing the salaries of employees to market standards. How many mid level employees with 5+ years of TCS experience get par market salaries in the company? And what is that percentage at the executive levels? How do you compare your salaries with market peers?\n\n&#x200B;\n\nComing to other rewards and benefits, by what percentage has the night shift allowance or performance awards increased in value in the last 10 years? Both of these have seen a 0% increase in a decade. And the \"Star of the Month\" or any equivalent award in the company is still valued at 300 INR. What a star it is!!?!!\n\n&#x200B;\n\nWhat happened with the 25x25 plan? We are getting back to offices a 100% now? Why did you fail in your plan? The reason you failed is because you lost considerable talent from the company in the last few years. Majorly due to policies above, there has been a good outflow of talent from the 5-15 year experience bracket who are key in the success of individual projects. When these people left the company, the replacements who came in were mostly with half the experience of the people who left, or in some cases anyone who was ready to join the company as most offers were not accepted by the interviewees. You will have the number of offers rolled out in the last 5 years which never got people to join in your database if you care to take a look. As a result, most projects have deteriorated in quality of deliverables and there is a dire need to step it up, for which you chose 100% work from office as the solution. Before COVID we had 4 lakh+ employees and now we have 6 lakh+. How many workdesks/parking spots/cafeteria seats/transport options have you added extra to accommodate these employees? How many of your offices have overflowing parking at the moment? Even with 3 days work from office? How many of your employees are from cities outside the ones you have offices in? Each of them save atleast 20,000 INR by staying in their hometown each month, and this has been a great help considering the peanuts you've given us as hikes in the last few years.\n\n&#x200B;\n\nAs TCSers by blood, we are ready to work with the company to navigate these challenges in project handling and delivery. But when will you see our concerns? When will you address those? Internal surveys like Pulse offer questions in brilliant ways to avoid any of these things coming to light. Let's have some transparency to hear the employee concerns first, and then make policy decisions that would help the workforce as well as the company.\n\n&#x200B;\n\nWith warm regards,\n\nA fellow TCSer.",
    "title": "An Open Letter to TCS Leadership",
    "subreddit": "WorkReform",
    "timestamp": 1696061447,
    "score": 15,
    "keyword": "indian ceo"
  },
  {
    "text": "I denied the job and I don’t know if I did the right thing? There’s this Startup which got funded from Department of Biotechnology under Indian govt. \n\nI gave interview for Project Associate in one of their drug development project. The project is of two years mainly developing one drug. \n\nSo after few days of my interview, The CEO called me and said this is an unofficial call to let me know they are thinking of giving the post to me if I’m comfortable with starting from 1 September till July 2025. He said you can’t leave the project in between. 9-5 and stipend is 17k per month. Also no leave. If taken leave then salary will be deducted.\n\nSo, the issue is I’ve been preparing for CSIR/UGC NET for almost more than year now and I’m very hopeful that I’ll clear my exam on December. I’ll clear my JRF ( at least I hope so) because I’ve been preparing for it seriously. I have to clear my exams because there’s not any other option. \n\nSo I asked the CEO if they can convert my post to Jrf only if I clear my exams after January. They said they can’t do it because they are not under DBT but only funded by DBT. \nIf I clear my exams then I can go for any project which will pay the basic Jrf amount that is 31k per month. Also can take into phd with fellowship. \n\n\nThe ceo said he’ll discuss with the panel Members to see if there’s any option to use my Jrf. But I don’t think they will call me back because they can’t afford to lose the project associate in between the project. \n\nMy first personality who kinda denied the job is confident in me saying we took the right decision. \nBut the second insecure personality is saying what if we don’t clear the exam in December and have to sit for another 6 months idle. We should’ve taken the job for two years. \n\nI’m really feeling weird about the whole thing because it was my first proper job that I got selected. \n\n\nTLDR: I refused my first job (contractual ) that was of 17k/month for two years. Because I believe I’ll clear my entrance for NET/Jrf which will give me 31k/ month in December for any project or in phd. \n\nNow I’m feeling mix if I did the right thing.",
    "title": "I denied the job and I don’t know if I did the right thing?",
    "subreddit": "careerguidance",
    "timestamp": 1693376478,
    "score": 1,
    "keyword": "indian ceo"
  },
  {
    "text": "What to do in terms of after offer negotiations? I am in IT for around 25 years. Never been laid off during last 2 recessions but this time couldn't survive as the new CEO wants to ship jobs overseas. It's a very tough job market. 2 months after layoff I am finally able to get two job offers. First one is 40% less than what I was making in the job from which I got laid off. It's one level down also. Second one - at the right level but 15% down than what I was making in the job from which I got laid off.\r  \n\r  \n\r  \n\r  \nIssue with the 2nd job offer - it's India based onsite/offshore model based company. When they submitted for the client - they put in the writing that they will offer me X. Now after clearing all the rounds with the consulting company and client, I am being asked to reduce the rate/salary by 15%(i.e. 85% of X). Is it fair or legal ? I am US Citizen. Client liked me and already started communicating with me.\r  \n\r  \nClient is also somebody like my ex-employer who laid off IT workers and outsourced those jobs to this Indian onsite/offshore company.\r  \n\r  \nShould I go for this 15% cut on the salary for what was already been agreed upon in writing. If a company is behaving unprofessional - I don't know what all is in store in future? I know it's a tough job market and I don't have any better offer as of now? This company is taking advantage of current market situation. Should I compromise to get this job and later if I find something - ditch this company(without any regrets as I really don't like people who can't keep their words).\r  \n\r  \nMy seniors told me compromise at first step is compromise for ever. But market conditions are really not good. There are lots of desperate H-1B visa holders who are undercutting billing rates for their survival. \r  \n\r  \nWhat should I do?",
    "title": "What to do in terms of after offer negotiations?",
    "subreddit": "cscareerquestions",
    "timestamp": 1687374871,
    "score": 1,
    "keyword": "indian ceo"
  },
  {
    "text": "How do you navigate a toxic workplace? I posted on here before, about how in my first week, A co-worker that found a new job in the company subtly warned me away from this job and to not stop looking for a better one.\n\nEveryone said “maybe he is jealous”, “ignore him he’s bitter”, etc. \n\nWell he was right. \n\nI’ve only been here 3 months but 1/2 of the team either quit/retired/transferred. \n\n - The deadline are super unrealistic. (How do I average 50 tickets daily but you get mad when you assign me 127 tickets and I can’t complete all of them).\n\n - my co-workers are high-key rude and act irritated when I ask any sort of questions. \n\n - I’ve had other IT jobs, but this is the 1st one where I literally don’t want to get out of bed in the morning and get anxious just thinking about work.\n\n - I was hired on as hybrid and the CEO is pushing for full-time in office now\n\nI want to quit so bad but:\n\n - the benefits and pay are great. \n\n - they’ll pay for my masters degree and if I leave within two years I have to pay it all back.\n\n - I had a hard time landing this role in the 1st place.\n\n - if I can last 1 year exactly, I can apply for other roles in the company and pray that it’s not as toxic as my current one.\n\nMy manager is heavily biased to the other team members (they’re Indian and I’m American) and I only see her for our weekly 5-minute chats. Which she bails out on most of the time.\n\nI found a very nice cybersecurity internship (technically in my last semester but school is online) that I would love to apply for, but I have a hard time justifying to myself switching from a permanent position when I have rent and bills to pay, to getting something temporary only for my happiness.\n\nThoughts? I need some advice.",
    "title": "How do you navigate a toxic workplace?",
    "subreddit": "cscareerquestions",
    "timestamp": 1678378707,
    "score": 1,
    "keyword": "indian ceo"
  },
  {
    "text": "Does the glass ceiling not apply to South Asians? I am Chinese American and have a lot of friends/family who are the same. Many of them are the kind of people who studied hard, went to good schools, work hard and have jobs at big tech companies where they make good money. From what I've heard Asians dominate many tech industries.\n\nHowever it seems like there is a glass ceiling and you rarely see Asian CEO at these companies which the exception of South Asians. If you just look at the US biggest companies #2 Microsoft and #3 Google have Indian CEO's and #5 Berkshire Hathaway it is likely Warren Buffet will be replaced by Ajit Jain who is Indian American. The CEO of Twitter is Indian American and Google just promoted an Indian American to run YouTube.\n\nI have a lot of respect for Indians and some of my best friends are Indian American. Indians are 1% of US population and Asians are 8%. Just curious why it seems like they can pass the glass ceiling while the rest of us cannot.",
    "title": "Does the glass ceiling not apply to South Asians?",
    "subreddit": "asianamerican",
    "timestamp": 1676577327,
    "score": 30,
    "keyword": "indian ceo"
  },
  {
    "text": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones Historically men have always been the problem-solvers for most of human existence. Men have always been counted onto to be problem-solvers because for the most part because we are hardwired to detect what is wrong with our environment or location. So I feel like when the industrial revolution came about to be, society counted on us to be not only problem-solvers, but also example-setters, the role models, the innovators, in other words, historically men fought tooth to the nail to try to make the world a safer, healthier and more stable place\n\nSo when the Industrial Revolution came to be, this put more pressure on men to be even more ''advancing'' and ponderous on to the grid and infrastructure of society, so we naturally have inclined to depend on men not only for advancing society, but to be the prime example-settlers for people to follow. I think that might be part of why we put so much pressure on men to be established and groomed by a certain age, where as women don't face those very same productivity pressures. I mean sure obviously people will judge a woman if she's being what they call a ''leech'' on the system, but for the most part what I am saying is they don't really get hit with the memo of hustle culture to the same degree men do, no one is going to judge a woman for working at McDonald's more than her being a nurse, but for a man that implies lack of intrinsic worth and respect and a good work ethic.\n\nI noticed this also disturbingly amongst ethnic minority male groups, whether it is the ''trabajador'' culture in the Hispanic community or the ''Be a baller'' mentality in the black community or the Silicone Valley Techie trope in the Indian community, I think those pressures are even more pronounced among men of color, but gonna try to refrain from over-emphasizing, I think you get my point though.\n\nBut this is also mostly used against working-class men, for example no top CEO in a fortune 500 company is gonna be told that their hard work doesn't pay off, even if they ended exploiting the resources along the way.\n\n&#x200B;\n\nI believe this to be a men's rights issue because since the working class consists mostly of men, this keeps the average man in the trenches",
    "title": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones",
    "subreddit": "MensRights",
    "timestamp": 1682608588,
    "score": 20,
    "keyword": "indian ceo"
  }
]