[
  {
    "text": "What certifications/qualifications does a schoolteacher with 13+ yrs of experience (5 yrs in the US) need to restart her career in the US after moving from India? Need advice for an experienced preschool/elementary teacher relocating from India to the US (prior teaching experience in the US)\n\nMy mom has 14+ years of experience as an elementary/preschool teacher (4 in California, 10+ in India). This includes one year as the principal at a small preschool in India (current job). Her certifications include B.Sc. Botany, and Early Childhood Education certification. She also got her B.Ed. through an Indian distance-learning program about 5 years ago. \n\nShe will move to the Midwest to be closer to me, in a couple years, and would like to keep working (not necessarily as a schoolteacher). I need some advice on what types of careers she can pursue in the Midwest. Legal status to work in the US is not a problem. \n\nAre there any new certifications she can/needs to obtain, to begin work in the education sector? She is excellent at drawing, and has worked as an art teacher, in the past. Further, she's taught Hindi to kids in the neighborhood, so we've considered helping her start a little home tutoring business to help Indian expat's kids with cultural studies. She has extensive experience teaching elementary level math and science. \n\nWould it be a better strategy to start applying to jobs in the public school systems in the US, or private schools/tutoring? Should I get her to start networking on LinkedIn? \n\nWould there be any options for her outside schools/teaching? \n\nSince we moved to India from the US about 10 years ago, and English isn't her native language, she's lost some fluency in the intermediate years. The speaking of English is not enforced strictly in most Indian schools. She's very dedicated and a fast learner, though, so I'm sure she'll regain fluency with some effort. \n\nThank you for reading!",
    "title": "What certifications/qualifications does a schoolteacher with 13+ yrs of experience (5 yrs in the US) need to restart her career in the US after moving from India?",
    "subreddit": "careerguidance",
    "timestamp": 1574090638,
    "score": 1,
    "keyword": "indian principal"
  },
  {
    "text": "Feminism and the Duluth Model. Note: In this post the terms \"IPV/DV/PV\" are used interchangeably.\n\n**1) The Duluth Model: The predominant model of domestic violence.**\n\nIn 1981, the Domestic Abuse Intervention Program created the Duluth Model, which was a more structured approach to batterer treatment and it is usually credited as introducing domestic violence into society's mainstream conscience. \"The program was born from the creative energies of battered women and feminist activists, included members of EMERGE, one of the first batterer intervention programs in the country. 13 battered women from Duluth participated in creating the Duluth Model's Power and Control Wheel based on traits and behaviours specific to their own abusive husbands. Later, scientists tested the program's curriculum with a sample group of nine subjects, including five battered women and four abusive men, who had all participated in the program. Based on the results of the test, the Duluth Model emerged as one of the nation's most utilized models for batterer intervention programs.\"\n\n[https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr](https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr)\n\nBefore we move on, let's get something straight here since I've seen a lot of denial around it generally from people who support feminism: The Duluth Model is entirely based on feminist theory. In [this](https://tspace.library.utoronto.ca/bitstream/1807/10972/1/NQ28298.pdf) thesis written by Ellen Pence herself (she is the woman who is usually credited with creating the Duluth Model) in 1997, she says in pages 1 and 2:\n\n\"I am indebted to the Domestic Abuse Intervention Project (DAIP), where I have worked for 16 years. As a group we have been an important part of a historic social movement. We were the first grassroots group to break through the barrier of institutional resistance to establishing community-monitored interagency policies (including policies mandating arrest, promoting aggressive prosecution, imposing increasingly harsh penalties on repeat offenders, and **requiring a feminist based educational model for abusers**). This speaks to the excellence of our group as well as to that of the leaders in our police and court system. To my co-workers and the many practitioners who have lent to my experience and to this specific endeavour, I am eternally grateful.\"\n\nShe says right here that the model is feminist based. Now that we've got that out of the way, we can move on to the main bulk of this.\n\nThe Duluth Model characterises domestic violence as being a primarily male-perpetrated crime caused by \"patriarchal terrorism\", theorising that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. Supposedly, men who batter are using violence to to maintain their individual and societal patriarchal dominance over women.\n\nDAIP itself says of Duluth:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"We still live in a sexist society where women are devalued, where many men believe they are entitled to be in control in an intimate relationship, and where men who batter believe they have the right to use violence. While it is a goal to change the attitudes of men who batter, the ultimate goal of the Duluth Model has always been to ensure that victims are safer by having the state intervene to stop the violence and address the power imbalance inherent in relationships where one person has been systematically dominated and subjugated by another.\"\n\nIt's described in further detail in a 1993 book that Ellen Pence co-authored; [\"Education Groups For Men Who Batter: The Duluth Model.\"](https://books.google.com.au/books/about/Education_Groups_for_Men_Who_Batter.html?id=tJ189FTdO38C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) The book says:\n\n\"The tactics used by batterers reflect the tactics used by many groups or individuals in positions of power. Each of the tactics depicted on the Power and Control Wheel are typical of behaviors used by groups of people who dominate others. They are the tactics employed to sustain racism, ageism, classism, heterosexism, anti-Semitism, and many other forms of group domination. Men in particular are taught these tactics in both their families of origin and through their experiences in a culture that teaches men to dominate. ...We use gender-specific terms not only because the curriculum is for men who batter, but because battering is not a gender-neutral issue.\"\n\nThe Duluth Model's Power and Control Wheel details the tactics that are used to sustain an abusive partner's control over an abuser.\n\n[https://www.theduluthmodel.org/wheels/](https://www.theduluthmodel.org/wheels/)\n\n* Physical and Sexual Violence (outer ring)\n* Using Intimidation\n* Using Emotional Abuse\n* Using Isolation\n* Minimizing, Denying and Blaming\n* Using Children\n* Using Male Privilege\n* Using Economic Abuse\n* Using Coercion and Threats\n\n[https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf](https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf)\n\nThe Duluth Model currently reigns as the most commonly state-mandated model of intervention. While many approaches to intervention include a mix of the Duluth Model's feminist analysis of DV and cognitive behavioural therapy (which is a more holistically-oriented approach to DV that maintains that DV is associated with cognitive distortions and faulty attitudes and beliefs), most existing intervention programs as well as state laws and guidelines that regulate IPV intervention still espouse key aspects of feminist perspectives on IPV etiology and intervention.\n\n**2) Gender symmetry in DV: The evidence and the denial.**\n\nHowever, more and more studies have come up showing gender symmetry in DV.\n\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf)\n\n\"More than 200 studies have found that men and women perpetrate partner violence at approximately equal rates and that the most prevalent pattern is mutual violence (Archer, 2002; Fiebert, 2004). Moreover, when it is not mutual, female-only and male\\~only partner violence occur with about equal frequency among married couples (K. L. Anderson, 2002; Capaldi & Owen, 2001; Gelles & Straus, 1988; Kessler, Molnar, Feurer, & Appelbaum, 2001; McCarroll, Ursano, Fan, & Newby, 2004; Medeiros & Straus, 2007; Moffitt, Caspi, Rutter, & Silva, 2001; Straus, Gelles, & Steinmetz, 2006; Williams & Frieze, 2005). Among young couples and dating couples, the percentage of female-only partner violence exceeds the percentage of male- only partner violence (Straus & Ramirez, 2007; Whitaker, Haileyesus, Swahn,& Saltzman, 2007). This pattern of gender symmetry is true even for severe partner violence, such as kicking, attacks with objects, and choking. However, the injury rate is much higher when the perpetrator is male (Gelles & Straus, 1988). Police statistics and crime survey statistics seem to contradict the idea of gender symmetty because 80% to 99% of the perpetrators identified in such surveys are men (Straus, 1999). This is not because of higher numbers of physical attacks by men but because of the greater probability of injury from attacks by men and greater fear for safety by women (Straus, 1999). These are characteristics that lead to police intervention. Such cases are mistakenly taken as representative of partner violence, even though at least 95% of partner violence cases are not known to the police (Kaufman Kantor & Straus, 1990; Statistics Canada, 2005).\"\n\nAnd...\n\n\"Not only do men and women tend to perpetrate physical partner violence at about equal rates, but they tend to do so for similar reasons. The most commonly reported proximate motivations for use of violence among both men and women are coercion, anger, and punishing misbehavior by their partner (Cascardi & Vivian, 1995; Follingstad, Wright, Lloyd, & Sebastian, 1991; Kernsmith, 2005; Stets & Hammons, 2002). For example, Pearson (1997) reported that 90% of the women she studied assaulted their partner because they were furious, jealous, or frustrated. The motive of self-defense, which has often been put forward as an explanation for high rates of female violence, explains only a small proportion of partner violence perpetrated by women (and men; Carrado, George, Loxam, Jones, & Templar, 1996; Felson & Messner, 1998; Pearson, 1997; Sarantakos, 1998; Sommer, 1996). For example, using a college student population, Follingstad ot al. (1991) found that perpetrators reported that their motivation was self-defensive about 18% of the time (17.7% for men, 18.5% for women). As violence becomes more severe, there are greater gender differences in the use of violence in self-defense; however, self-defense is still a motivation for a relatively small proportion of violence. For example, in a sample of couples presenting for marital therapy, Cascardi and Vivian (1995) found that 20% of wives and no husbands attributed their use of severe aggression to self-defense.\"\n\nOne study even showed that half (49.7%) of relationships which had violence were reciprocally violent, and that in nonreciprocally violent relationships, women were the perpetrators in more than 70% of the cases.\n\n[https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020](https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020)\n\nIn 1999, Ellen Pence, in her book [\"Coordinating Community Responses to Domestic Violence: Lessons from Duluth\"](https://books.google.com.au/books/about/Coordinating_Community_Responses_to_Dome.html?id=Vk_qT-apdT4C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) came out herself and admitted that she and the DAIP staff involved in Duluth were driven by ideology. In the chapter \"Some Thoughts On Philosophy\", she wrote:\n\n\"The Power and Control Wheel, which was developed by battered women attending women's groups, was originally a description of typical behaviours accompanying the violence. In effect it said \"When he is violent, he gets power and he gets control.\" Somewhere early in our organizing efforts, however, we changed the message to \"he is violent *in order to* get control or power.\" The difference is not semantic, it is ideological. Somewhere we shifted from understanding the violence as rooted in a sense of entitlement to rooted in a desire for power. By determining that the need or desire for power was the motivating force behind battering, we created a conceptual framework that, in fact, did not fit the lived experience of many of the men and women we were working with. The DAIP staff - like the therapist insisting it was an anger control problem, or the judge wanting to see it as an alcohol problem, or the defense attorney arguing that it was a defective wife problem - remained undaunted by the difference in our theory and the actual experiences of those we were working with. We all engaged in ideological practices and claimed them to be neutral observations.\"\n\n\"Eventually, we began to give into the process that is the heart of the Duluth model: interagency communication based on discussions of real cases. It was the cases themselves that created the chink in each of our theoretical suits of armor. Speaking for myself, I found that many of the men I interviewed did not seem to articulate a desire for power over their partner. Although I relentlessly took every opportunity to point out to men in the groups that they were so motivated and merely in denial, the fact that few men ever articulated such a desire went unnoticed by me and many of my coworkers. Eventually, we realised that we were finding what we had already predetermined to find.\"\n\nSo even Ellen Pence herself outlined the limitations of the Duluth Model and acknowledged that she and her coworkers had created a conceptual framework that was inadequate in describing DV.\n\nHowever, the conception that DV is a primarily male-perpetrated crime which is an outgrowth of normal male behaviour and socialisation still persists, and people who challenge Duluth's characterisation of DV face extreme backlash.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n\"Suzanne Steinmetz made the mistake of publishing a book and articles (Steinmetz, 1977; Steinmetz, 1977-1978) which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware. Twenty years later the same processes resulted in a lecturer at the University of Manitoba whose dissertation found gender symmetry in PV being denied promotion and tenure.\"\n\n\"A PhD student working with Straus was warned at a conference that she will never get a job if she does her PhD research with him. At the University of Massachusetts, Straus was prevented from speaking by shouts and stomping. At two hearings held by the Canadian Commission On Violence Against Women the chairperson stated that nothing Murray Straus publishes can be believed because he is a wife-beater and sexually exploits students (Toronto Magazine article, ??). When Straus was elected President of the Society For the Study Of Social Problems, a group of members occupied the first few rows of the auditorium and, at the start of the presidential address, stood up and walked out.\"\n\n\"As a result of these types of harassment, there is widespread self-censorship by authors who fear that publishing politically incorrect data will undermine their reputation, or in the case of graduate students, their ability to obtain a job.\"\n\nSo despite all the evidence proving that DV is a crime that can be committed by both genders and that men and women who commit DV both share similar motivations, the Duluth Model is still very frequently used and widely accepted.\n\nEDIT: You know what, I'm including more.\n\n**3) The VAWA and a lack of services for abused men.**\n\nAs a result of this erroneous viewpoint that Duluth has created, male victims of domestic violence struggle to obtain services. Most resources are allocated to helping female victims of DV and much less for men.\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\nThe Violence Against Women Act is the centre of controversy, with a lot of complaints being made about sex-based discrimination by VAWA-funded programs. Technically, anti-discrimination provisions apply to the Violence Against Women Act, and the 2005 renewal of VAWA added this requirement:\n\n\"Nothing in this title shall be construed to prohibit male victims of domestic violence, dating violence, sexual assault, and stalking from receiving benefits and services under this title. 16\"\n\nHowever, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature:\n\n* \"In 2002, the OVW instructed the Delaware Domestic Violence coordinating council that, “states must fund only programs that focus on violence against women.”17\"\n* \"Department of Justice (DoJ) research solicitations have explicitly excluded applications that focus on male victims. One Solicitation for Proposals from the DoJ National Institute of Justice specifically prohibited “proposals for research on intimate partner violence against, or stalking of males of any age…”18\"\n\nAnd...\n\n\"Given these federal actions, it is not surprising that state-level governmental programs follow suit\":\n\n\"In Texas, an application for a program serving male victims was turned down because “programs that focus on children and/or men” were deemed ineligible.20 The next year, a grant application kit from the Texas Criminal Justice Division used identical words to reiterate the exclusion: “Programs that focus on children and/or men.”21\"\n\n\"Likewise, the OVW awarded $3 million to Baylor University to establish the Faith and Community Technical Support (FACTS) program designed to reduce domestic violence in rural communities. In 2006 the FACTS program issued a grant solicitation stating, “As with previous VAWA methods, it is assumed that … all victim data reported is about victimized women.”22 One of the questions on the FACTS grant application asks, “Number of years organization has spent working on violence against women issues.\"\n\nIn 2007, a letter was sent to the Office on Violence Against Women under the Freedom of Information Act (FOIA) requesting the OVW provide \"sex-specific utilisation data for each of the following grant programs\":\n\n1. Transitional Housing Program\n2. Rural Domestic Violence and Child Victimization Enforcement Grant Program\n3. Legal Assistance for Victims Program\n4. Stop Violence Against Indian Women\n5. Grants to Encourage Arrest Policies and Enforcement of Protection Orders\n6. Grants to Reduce Violent Crimes Against Women on Campuses\n7. Services, Training, Officers, and Prosecutors (STOP) Violence Against Women Formula Grant Program\n\n\"Overall, only 9.7% of persons receiving help were male victims, the remaining 90.3% being female victims. The percentages of male victims for the Legal Assistance for Victims and Transitional Housing programs were much lower – 3.9% and 0.4% respectively.49\"\n\nIn accordance with this, the experiences of men who attempt to seek help for domestic violence through formal resources have largely been negative. From a study of U.S. men who have sustained domestic violence from their female partners:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\n\"Qualitative research has documented the experiences of men who seek help for female-to-male IPV (Cook 2009; Hines et al. 2007). For example, Cook (2009) performed in depth interviews of 30 men who sustained all types of IPV from their female partners and tried to seek help. This work shows that men often experience barriers when seeking help. When calling domestic violence hotlines, for instance, men who sustained all types of IPV report that the hotline workers say that they only help women, infer or explicitly state that the men must be the actual instigators of the violence, or ridicule them. Male helpseekers also report that hotlines will sometimes refer them to batterers’ programs. Some men have reported that when they call the police during an incident in which their female partners are violent, the police sometimes fail to respond. Other men reported being ridiculed by the police or being incorrectly arrested as the primary aggressor. Within the judicial system, some men who sustained IPV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of IPV and abusing their children. According to some, the burden of proof for male IPV victims may be especially high (Cook 2009).\"\n\nAnd...\n\n\"We found that men who sustain IPV seek help from a variety of resources, most typically from informal resources, such as family, friends, and the Internet, and the formal resource of a mental health professional. Family and friends were overwhelmingly reported as being the most helpful resource, and mental health and medical professionals were rated as being among the most helpful of the formal resources. These professionals were reported to have taken the male victims seriously and to inquire about the origin of the men’s injuries. The resources providing the least support to men seeking help for IPV victimization are those that are the core of the DV service system: DV agencies, DV hotlines, and the police. On the one hand, about 25% of men who sought help from DV hotlines were connected with resources that were helpful. On the other hand, nearly 67% of men reported that these DV agencies and hotline were not at all helpful. Many reported being turned away. The qualitative accounts in our research tell a story of male helpseekers who are often doubted, ridiculed, and given false information. Thus, our hypotheses that men who would have largely negative experiences with formal resources were supported, which is consistent with prior qualitative research (Cook 2009; Hines et al. 2007).\"\n\n\"These findings are in stark contrast to ratings of social services by battered women. For example, in a study of 119 women who sought services for DV-related concerns from a DV shelter, 89% of the clients believed that they were helped by the services that they received and 84% reported that they felt better because of these services (McNamara et al. 2008). These findings are similar to a study which examined women’s impressions of a hospital-based DV support group (Norton and Schauer 1997). Of the 59 women in this study, 95% reported that they were mostly or very satisfied with the services that they received. Their reasons for satisfaction included that the group leaders were supportive, they were able to hear about other women’s experiences with abuse and were supported by them, they received referrals for additional support/services and they were able to learn about DV. These findings are consistent with other literature which states that women are often very satisfied with the services that they have received for IPV (Bowker and Maurer 1985; McNamara et al. 1997; Molina et al. 2009). Similar results with regard to satisfaction among battered women have been found in relation to police assistance. For example, one study of 95 female IPV victims indicated that the female victims found the police to be very helpful and 80% would contact the police again for assistance (Apsler et al. 2003).\"\n\nSo male victims are largely marginalised.\n\n**4) Mandatory Arrest Laws and Predominant Aggressor Policies.**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV. Statutes in numerous states directed police officers to undergo training on domestic violence and victim assistance and limited their discretion.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n\"Under the assumption that intimidated witnesses are reluctant to testify against their abuser, district attorneys began to adopt “no-drop” prosecution that circumvented victim cooperation. The 23 states that call for *mandatory arrest* allow the least amount of discretion, with statute language that ranges from vague, as in Colorado (“probable cause to believe a crime of domestic violence was committed”), to more specific, as in Washington where police can arrest when there is probable cause to believe a person 16 years or older within A, B, C, D, E the previous 4 hours assaulted a family or household member and believes (1) felonious assault occurred, or (2) assault resulting in bodily injury occurred whether injury is visible or not, or (3) any physical action occurred which was intended to cause reasonable fear of imminent serious bodily injury or death. (Hirschel, 2008, pp. 19–20)\".\"\n\nAnd when mandatory arrest laws were instituted, the arrests of women *skyrocketed.*\n\n\"In California, men in 1987 were arrested at a rate of 247 per 100,000, whereas women were arrested at a rate of 74.8 per 100,000. By 1997, the rates had increased only 136% for men, or up to 338 arrests per 100,000, but as much as 500% for women (DeLeon-Granados, Wells, & Binsbacher, 2006). Feminists welcomed the rise in male arrests. However, despite evidence that “political and/or organisational pressure may discourage officers from arresting women as aggressors” (Hirschel & Buzawa, 2009, p. 5), they found the sharper spike in female arrests of concern.\"\n\nSo, in order to counter this, feminists worked with policy makers to institute \"predominant aggressor\" guidelines which allegedly attempted to curb the arrest of victims by taking into account the “relationship behind the assault”.\n\nTo anyone denying that predominant aggressor guidelines have anything to do with Duluth's feminist analysis of DV or feminism, DAIP (remember: birthplace of the Duluth Model) itself states:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"Doing away with **pro-arrest policies targeting the predominant aggressor (a core component of the Duluth Model)** reduces the total number of arrests but increases the proportion of dual arrests. Dual arrests have proven ineffective in stopping violence, and they also have the unfortunate consequence of making victims more reluctant to call the police when further acts of violence occur.\"\n\nSo there you go.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\nCalifornia is one of several states that defines the dominant aggressor not as the first aggressor but rather the most “significant,” a sharp deviation from accepted police practice in responding to other crimes. As specified under state law and found in the domestic violence section of the Peace Officer Standards and Training (POST) manual, here are the factors taken into account when determining the predominant aggressor.\n\n* Age, weight, and height of the parties;\n* Criminal history;\n* Domestic violence history, including convictions and probation;\n* Strength, special skills (e.g., martial arts, boxing);\n* Use of weapons;\n* Offensive and defensive injuries;\n* Seriousness of injuries;\n* Use of alcohol and drugs;\n* Who called 911;\n* Who is in fear;\n* Presence of behaviors of power and control in the relationship;\n* Detail of statement;\n* Demeanor of the parties; and\n* Existence of corroborating evidence (California Commission on POST, 2010, pp. 3–5, 3–6)\n\nNone of these criteria are openly anti-male, but there are some bits that are prejudicial to men as a result of the criteria that was selected in determining the predominant aggressor.\n\n\"Again, many of these factors are vague, not easily interpreted and of dubious value. “Age, weight, and height of the parties,” and martial arts training are only relevant if the individual actually uses these advantages in an aggressive way. Men are usually bigger and stronger than women are, but most men do not abuse their partners, and there is no correlation in the general population between a person’s size and strength and the extent to which they abuse intimate partners, including among same-sex couples (Renzetti, 1992). When men are assaulted, they often refrain from striking back, both out of fear of being arrested and the code of chivalry. ... A man who is larger and stronger than his partner may have the *potential* of causing greater physical damage, but this factor is irrelevant unless he actually uses this to his advantage, just as the smaller woman has the *potential* to obtain a gun and kill him. The reader will notice that for weapons, officers are asked to consider their *use*, but not so with size and strength. In this respect, there is reason to suspect that the choice of criteria may be prejudicial to men (Sacks, 2010).\"\n\nOn the other hand, how police are trained to identify the predominant aggressor is blatantly gender-biased.\n\nIn two official police training manuals, including the POST manual cited earlier (California Commission on POST, 2010):\n\n\"The POST manual contains sections that define domestic violence that discuss its impact on victims and instruct officers in a detailed manner on response and arrest procedures and the protection of victims. Brief case scenarios are presented for the purpose of illustration and to facilitate learning. ... The manual generously offers 50 such examples, in which one party abuses or otherwise acts aggressively toward the other. ... Of the 50 examples, *not a single one* depicts unilateral abuse by a female upon a male (see Table 1). ... The examples send out a clear message to law enforcement in California, the largest state with more than 10% of the U.S. population: Officers should concern themselves only with male-perpetrated violence.\"\n\n\"The Maine training program, *Identifying Predominant Aggressors in Domestic Violence Cases (Train-the-Trainer*), is a 2-to 4-hour presentation consisting of lectures, video scenarios, and group discussions from the Maine Criminal Justice Academy, the organization that conducts trainings for all law enforcement and corrections agencies in the state of Maine (Rogers & Faragher-Houghton, 2008, p. 3). More so than the POST training, the Maine curriculum focuses right from the start, in its definition of domestic violence, on the exclusive needs of female victims. Following an exposition on the evolution of the criminal justice response, trainees are presented eight examples (one involving a public disturbance; the others depicting a domestic violence incident between a man and a woman) and asked to decide which party is the predominant aggressor based on the state’s legal criteria (similar to California’s), and who to arrest. Trainees are then informed that in seven of those cases, it is the man who should be arrested. In the other case, there is no specific recommendation to arrest either the man or the woman, but the clear implication is that the man is the dominant aggressor.\"\n\nAnd...\n\n\"The gender bias found in both the California and Maine trainings is blatant, indeed. However, considering the process by which dominant aggressor laws were put on the books, one should hardly be surprised. Laws protecting victims from domestic abuse were enacted not by abused men or men’s rights groups or disinterested bureaucrats, but through the efforts of battered women’s advocates, some of whom had previously been victimized in their own lives, and by feminists concerned broadly with the oppression of women (Mills, 2003). It was feminists who fought for the creation of dominant aggressor guidelines, and they did so explicitly to stem the rising tide of female arrests, on the grounds that domestic violence is a *gendered* problem. This view, based on a feminist analysis of patriarchy and sometimes referred to as the *gender paradigm* (Dutton & Corvo, 2007; Dutton & Nicholls, 2005), has had a profound influence on policy and intervention.\"\n\n\"The existence of training bias and political activism only suggest—and do not prove—that police officers actually carry out arrests in a gender-biased manner, and clearly much more research is needed. However, there is evidence elsewhere in the criminal justice response to domestic violence of a clear political agenda, as evidenced by the tendency of police to dually arrest significantly more often when the male is the victim, compared to the female (Hirschel & Buzawa, 2009); the preferential granting of restraining orders to women relative to men in response to similar complaints (Muller, Desmarais, & Hamel, 2009); the failure of law enforcement to adequately inform male victims regarding community resources (Buzawa & Hotaling, 2006); and the proliferation of intervention programs based on a patriarchal theory (Dobash & Dobash, 1979; Pence & Paymar, 1993). In addition, telling is the official domestic violence training offered by the U.S. Victims of Crime office, whose training manual gives 11 examples of physical domestic violence and various power and control tactics. Of these 11 examples, 8 involve male-on-female battering, 2 involve female-on-female lesbian abuse, and 1 involves a male perpetrator and a victim whose gender is not specified (Office of Justice Programs, 2010). Once again, trainers are not able to imagine any scenario whatsoever in which the perpetrator is a woman and her victim is a man.\"\n\nSo this has been the unfortunate effect of the Duluth Model and the narrative that feminists have created and tried incredibly hard to maintain that it is primarily men who are the perpetrators of DV/IPV. And that they have successfully maintained, despite there being a massive body of evidence that disproves said narrative.",
    "title": "Feminism and the Duluth Model.",
    "subreddit": "MensRights",
    "timestamp": 1561084678,
    "score": 100,
    "keyword": "indian principal"
  }
]