[
  {
    "text": "CMS launches a new model for Primary Care > Today, the Centers for Medicare & Medicaid Services (CMS) announced a new primary care model – the Making Care Primary (MCP) Model – that will be tested under the Center for Medicare and Medicaid Innovation in eight states. Access to high-quality primary care is associated with better health outcomes and equity for people and communities. MCP is an important step in strengthening the primary care infrastructure in the country, especially for safety net and smaller or independent primary care organizations. The model seeks to improve care for patients by expanding and enhancing care management and care coordination, equipping primary care clinicians with tools to form partnerships with health care specialists, and leveraging community-based connections to address patients’ health needs as well as their health-related social needs.\n> \n> The goals of MCP are to 1) ensure patients receive primary care that is integrated, coordinated, person-centered and accountable; 2) create a pathway for primary care organizations and practices – especially small, independent, rural, and safety net organizations – to enter into value-based care arrangements; and 3) to improve the quality of care and health outcomes of patients while reducing program expenditures.\n> \n> The MCP Model will provide participants with additional revenue to build infrastructure, make primary care services more accessible, as well as better coordinate care with specialists. CMS expects this work to lead to downstream savings over time through better preventive care and reducing potentially avoidable costs, such as repeat hospitalizations. MCP will run for 10.5 years, from July 1, 2024, to December 31, 2034. The model will build upon previous primary care models, such as the Comprehensive Primary Care (CPC), CPC+, Primary Care First models, and the Maryland Primary Care Program (MDPCP).\n> \n> CMS will test this advanced primary care model in Colorado, Massachusetts, Minnesota, New Jersey, New Mexico, New York, North Carolina, and Washington. CMS will work with model participants to address priorities specific to their communities, including care management for chronic conditions, behavioral health services, and health care access for rural residents. CMS is working with State Medicaid Agencies in the eight states to engage in full care transformation across public programs, with plans to engage private payers in the coming months. The model’s flexible multi-payer alignment strategy allows CMS to build on existing state innovations and for all patients served by participating primary care clinicians to benefit from improvements in care delivery, financial investments in primary care, and learning tools and supports under the model.\n> \n> “The goal of the Making Care Primary Model is to improve care for people with Medicaid and Medicare,” said CMS Administrator Chiquita Brooks-LaSure. “This model is one more pathway CMS is taking to improve access to care and quality of care, especially to those in rural areas and other underserved populations. This model focuses on improving care management and care coordination, equipping primary care clinicians with tools to form partnerships with health care specialists, and partnering with community-based organizations, which will help the people we serve with better managing their health conditions and reaching their health goals.”\n> \n> Strong relationships with primary care teams are essential for patients’ overall health. Primary care clinicians provide preventive services, help manage chronic conditions, and coordinate care with other clinicians. By investing in care integration and care management capabilities, primary care teams will be better equipped to address chronic disease and lessen the likelihood of emergency department visits and acute care stays, ultimately lowering costs of care. This model will support participants with varying levels of experience with value-based care, including Federally Qualified Health Centers (FQHCs) and physician practices with limited experience in value-based care, as CMS continues to work to reduce disparities in care and drive better patient experience and outcomes.\n> \n> “Ensuring stability, resiliency, and access to primary care will only improve the health care system,” said CMS Deputy Administrator and Center for Medicare and Medicaid Innovation Director Liz Fowler. “The Making Care Primary Model represents an unprecedented investment in our nation’s primary care network and brings us closer to our goal of reaching 100% of Traditional Medicare beneficiaries and the vast majority of Medicaid beneficiaries in accountable care arrangements, including advanced primary care, by 2030.”\n> \n> The model includes a progressive three-track approach based on participants’ experience level with value-based care and alternative payment models. Participants, which include FQHCs, Indian Health Service facilities, and Tribal clinics, among others, in all three tracks will receive enhanced payments, with participants in Track One focusing on building infrastructure to support care transformation. In Tracks Two and Three, the model will include certain advance payments and will offer more opportunities for bonus payments based on participant performance. This approach will support clinicians across the readiness continuum in their transition to value-based care, furthering CMS’s goal to ensure 100% of traditional Medicare beneficiaries are in a care relationship with accountability for quality and total cost of care.\n> \n> Primary care organizations within participating states may apply when the application opens in late summer 2023. The model will launch on July 1, 2024.\n\nIt appears this new initiative will favor “value based care”? Do current providers think this will improve compensation for PCPs and improve care for patients?\n\nhttps://www.cms.gov/newsroom/press-releases/cms-announces-multi-state-initiative-strengthen-primary-care\n\nhttps://innovation.cms.gov/innovation-models/making-care-primary#:~:text=Launching%20July%201%2C%202024%2C%20the,related%20social%20needs%20(HRSNs)%20such",
    "title": "CMS launches a new model for Primary Care",
    "subreddit": "medicine",
    "timestamp": 1686831875,
    "score": 37,
    "keyword": "indian director"
  },
  {
    "text": "I am making a mistake in this Job market leaving my Good Job at Large Company just because I don’t Want to move to Arkansas? I have 75 days to find a job or be unemployed  I currently work for a large company based in Arkansas in an 80% remote role where I work 4-5 weeks from my parents’ Home in Texas and go to Arkansas for in-person meetings for a week staying at a hotel, paying out of my pocket. this was a special arrangement that I had with my Boss (who has left the company) as the Company policy was to be in the office in Arkansas 3-4 days a week. I Joined the company last summer in July straight out of college and lived full time in Arkansas for 8 months but have been working remotely from Texas the last three months after I got out of my lease and my Boss approved our special argument.\n \nAfter my Boss left last week, my department director informed that my role would require me to live in Arkansas full time and I would have to move to Arkansas. after speaking with my Parents and friends, I have decided that I will not be moving to Arkansas and instead will be leaving my Job the first week of August. Since this was a special arrangement that I had with my Boss (who has left the company) and not with the company.\n \nWhile my job is not Bad and I get a decent Paycheck, I do not want to live in Arkansas at all. The 8 months I lived in Arkansas was the worst 8 months of my life since it was hard to make friends, first time I lived away my parents and I missed certain aspects of big cities (diverse food, Indian movies in theaters, sporting events)\n \nMy question is \n I am making a mistake in this Job market leaving my Good Job at Large Company just because I don’t Want to move to Arkansas?\n\nThanks for all the feedback!\n\nAdding a little more context:\n\nI am 22 (graduated college early) so very early in my career\n\nI have a great support system in Texas and very close with my parents and siblings who live in Texas I don’t want to live anywhere far away and most importantly my parents dogs are my best friends In the world and I would not get to hang out with them daily if I moved to Arkansas. \n\nThe division I work it has very lax RTO policy but my coworkers all come to office daily and are local to the area. \n\nMy job was always intended to be full time in Arkansas, my boss just was lax about enforcing it and I took full advantage of it.\n\nThe company I work for is Walmart\n\nI work in supply chain.\n\nI have a BS in supply chain from a school in Texas\nMy parents live in DFW (big hub for supply chain)\n\nMy career plan was to try out living in Arkansas for a little bit but that didn’t work out the way I wanted to and want puriste options closer to home.\n\nI have saved up a decent amount of money form internships and work that I willing to try to something new even if it pays less.\n\nAlso I have started my Job search in the DFW area",
    "title": "I am making a mistake in this Job market leaving my Good Job at Large Company just because I don’t Want to move to Arkansas? I have 75 days to find a job or be unemployed",
    "subreddit": "careerguidance",
    "timestamp": 1686070566,
    "score": 618,
    "keyword": "indian director"
  },
  {
    "text": "Why are accountants, CPAs, and the AICPA so nonchalant about our jobs going to India? Deloitte recently announced that 1/3 of their workforce will be based in India in the next 4 years. PwC and EY already have entire engagements that are wholly staffed by Indians. KPMG stands for Karachi Pune Mumbai Goa at this point.\n\nYou don't have to be an economics genius to know drastically increasing the labor supply with cheap workers from the 3rd world will lower our market price and erode our bargaining power.\n\nAlso we've all seen the quality of work coming out of India, it's pretty awful and a lot of it has to be reworked by overworked by exhausted managers and staff in the US. Everyone on this sub knows this. The partners and directors also know this.\n\nThis trend will seriously damage accounting pay and prestige, and both are already at an all-time low. \n\nI don't understand why the accounting profession isn't doing anything. Look at Hollywood going on strike to prevent screenwriters from being replaced with AI - look at nurses, UPS drivers, government workers etc all going on strike.\n\nWhy are we not doing anything? Or at the very least, saying anything?",
    "title": "Why are accountants, CPAs, and the AICPA so nonchalant about our jobs going to India?",
    "subreddit": "Accounting",
    "timestamp": 1691622089,
    "score": 847,
    "keyword": "indian director"
  }
]