[
  {
    "text": "Newly hired lead web designer has me second guessing my first dev position. Hi o/ not sure if thats the right flair or this is the right sub, as im (39m) 6 months in on my first job as a web developer. After 3 yrs of part time classes while working to get my A.S. and dev certification, and a yr and a half of looking, i landed a developer role with a tiny, 20 personish company.\n\nFor the last 6 months ive been tasked with building a site that i was given a total of 4 screen shots of, no real data or any files or previous anything, just 4 screen shots and asked if i could build something similar to them, and told to get creative with it. Its now some 7 html pages, 9 js files, and css for days lol\n\nIts also my first remote gig which is kinda nice. I speant 20+ yrs in kitchen work, so being in the a/c and listening to spotify all day is a plus too.\n\nIve only dealt with the CEO whom hired me and the payroll lady, thats all. I havent met another person that works for us, collaborated with or bounced ideas or thoughts or questions off of, nobody, just myself and a couple of reddit subs when id get stuck. Up until 2 days ago...\n\nI get a text over the weekend asking if i could go into the office monday, to meet a new hire and go over some things. The new hire is, im assuming, the new lead designer, and i say that only since he wasnt introduced as so and so the new blah blah. But, hes a 30 yr long friend of the CEO, and theyve done numerous projects and made tooooooons of money together, thats what they were saying.\n\nCEO leaves to do a conferance call down the hall in another room, so hes not there anymore. We start going over some things, work history, random stuff, conversation. Some 30 minutes in and he starts talking about how hes leaving an extremely large, well known company that handles gov contracts because of vaccine mandates. Hes anti vax, claims to never have had any vaccine, and plans on staying pure for religious reasons. So he came here now to work. Rather arrogant, cocky, very his way or no way type of vibes.\n\nHe then gets back into work history, and how prior to the big company hes leaving, he worked with \"a bunch of indians that didnt know s**t about building apps\" and \"were completely terrible clowns to deal with\", mocked the way they talk, and used a very racial tone along with some not so nice language and terms. He did this 3 other different times over the total 5 hrs i was there, mind you ive only known this guy for maaaaybe an hr by now.\n\nMixed in with all that, i find out theres a prototype/mock build of what ive been doing for the last 6 months, and apparently hes the one that built what i have the 4 screen shots of, but i was never told about this proto from the CEO, but was supposed to be. Now im going back and moving, adjusting and rebuilding portions to follow with his proto. \n\nWe talk a little more on responsiveness, although he kept calling it \"zoom display\". He tells me he doesnt do media queries for anything above 1400px 😳 \"because if you try to hit all screen sizes its just gonna make a bunch of unneccesary work for us\" and \"tablet sizes are about where it stops now\". In my head im going \"uh what the actual f**k\" ive never heard/seen that done\". I go from 400 - 700 - 1000 - 1300 - 1920, all my projects have those 5 queries.\n\nTheres a couple other things from this meeting too, but ill kinda stop there.\n\nI text him yesterday at 5pm ish just to share the new reworked updates ive done so far. He responds with \"ok good progress, see ya tommorrow\". I responded jokingly \"How? You comin to my house orrrrr what? Lol\" He says \"Oh CEO said he told you to come in\". I text back \"No i was never asked to go in there tommorrow (today)\". I text CEO about it and tell him id rather not as i wasnt feeling well, which was a lie, i just got suuuuuper not cool with new guy from the 5 hr conversation at the office the day before. He says \"ok cool no biggie\". And now here i am today.\n\nIm honestly here asking for advice as to what to do/how to go about this. Im back cruising the job sites, but it reminds me that it took a yr and a half and literal 100s of applications and resumes to get this job. I could go back to the country club i was at prior, but the pays not really close, as i just got put on salary 2 weeks ago with this. I would have group health insurance again instead of having to source my own like now though, which that was a s**t show in itself.\n\nIm really just need some pointers and/or advice please. And im sorry if i just wasted an hr + of anyones time whom reads this. Thank you to anyone that responds.",
    "title": "Newly hired lead web designer has me second guessing my first dev position.",
    "subreddit": "cscareerquestions",
    "timestamp": 1635349324,
    "score": 7,
    "keyword": "indian ceo"
  },
  {
    "text": "What should my expectations be when working with an offshore team? I’m the lead backend developer at our company. I’m over two junior Devs, and have one off-shore engineer who is an absolute gem of a developer. Writes good, clean code, always gets stuff done in time, is proactive about problem solving, etc. I can basically tell him, “Hey, here’s the problem/what isn’t working,” and 2 days later he’ll come back with a solution, fully ready to implement, tests written, etc. \n\nWell, recently our CEO decided we needed to go faster and (against my advice and the advice of our VP of Engineering), decided to hire an offshore team in India to help us “go faster.”\n\nI’ve never worked with an Indian team, and as I said, my one off-shore dev absolutely spoils me.\n\nAnyway, we were assured that the 3 devs we’d be getting had at LEAST 6-8 years of experience in our tech stack. I assigned them some fairly straightforward tickets (things I would have given my junior devs), including where in the codebase the solutions should be implemented, etc. Basically wrote the whole thing is pseudo-code, so they just had to write it in actual code. Had my VP of engineering go over the tickets for a second pair of eyes because honestly I hate this sort of management and work and I just want to be building things myself. \n\nANYWAY, after a week and a half, I finally got some code back from them, and about 80% of it is pure trash. Either because it wasn’t to our specs, it just straight up won’t work, or many other reasons. Like, my juniors give higher quality work than what was submitted, and in about 1/4 the time. \n\nSo my question is, what is a reasonable expectation for an offshore team? Is this a culture thing for Indian devs where they won’t ask any questions? \n\nI tell them every day on slack that I’m available for any clarifications or to help with anything, and the most I’ve gotten is either “no questions, everything is clear!” Or questions about reading a stack trace error they didn’t understand (something else super frustrating. Shouldn’t a “senior” dev be able to read a stack trace and see a typo or syntax error?). \n\nIf they fail to deliver, I’m pretty sure my CEO will blame it on me. But at this point, it’d be 1000% cheaper and faster to just write it all myself.",
    "title": "What should my expectations be when working with an offshore team?",
    "subreddit": "cscareerquestions",
    "timestamp": 1628464266,
    "score": 5,
    "keyword": "indian ceo"
  },
  {
    "text": "One year at a Big 4 and the next 1 year at a seed stage startup. What should I do next? (23, IND) Hi folks,\n\nFirstly, I think this sub hears this a lot from people my age but I believe everyone has a separate store and path, so here is mine. This one is gonna be a big ass post, but I really require some decent advice to take the next step here.\n\nI am a CS graduate from India, have been interested into tech since school, did stuff from HTML to Android Studio to Android ROM development to what not.\n\nGot placed into a Big 4 consulting tech US India office as a Business Analyst. Got into an 4-yr running insurance project having a workforce of 350+. Started off as a QA for 2 months, switched to API Integration dev etc, mastered Mulesoft ESB. Got to know lots of people, got some awards. Handled project final go-live solo for the team after senior team-members were taken off the project. Left the company after completing a year.Pros: Amazing people and culture, great fun; Cons: very monotonous work, meager salary\n\nJoined a small startup as the first person in tech, through a friend who knew the CEO of the startup. They were looking for CTOs/Tech folks and somehow wanted me to join after a couple of intro/coffee/beer meetings. I wasn't confident at first (cuz I am not at all a great coder or experienced developer), but felt I have nothing to lose and incredible stuff to see and learn. I worked after hours of my MNC job for 6 months and then joined as full-time. I started with writing the first line of code back in Jan 2020, and right now leading a team of 8 (devs/mobile/design/QA) working on 2 projects with \\~10k users.\n\nPros:\n\n* Crazy adventure, I feel I learnt endless stuff about tech, people, startups, business etc;\n* Brainstormed an idea with the team in lockdown which became the flagship product of the company and got us funding; handled every single technical decision of the product (it's a software offering for insurance policyholders, both web and mobile apps);\n* Technical things I supervised: Python, Django, Flutter, AWS, React, Figma, Google Cloud, DigitalOcean, Firebase, JIRA, Trello, other third-party services; Amongst these, I have only learnt intermediate level python/Django and AWS I'd say, for all other items I depend on the people under me or the internet.\n* Also handled entire IT of the \\~100 employees using cPanel and Google Workspace;\n* Did couple of other stuff like setting up all social media, designing logos, wrote every single word of  content on the websites/apps.\n* I learnt a lot about Indian healthcare and insurance business, feels like I made my mark through the stuff I built\n* And a lot of other stuff...\n\nCons:\n\n* Incredibly hectic, everyone have their own demands from Tech team and just wants those done asap (all other teams and incl. the founders) and I am one of those \"Never Saying No\" folks so it just went pretty rough and bad; took a toll on my physical/mental health too; I know it's my fault too but I just was so attached to the project;\n* Decent compensation but no benefits; not even ESOPs or insurance as was promised during joining; don't see any fair growth in salary in future knowing the mindset of the founders;\n* No affirmation or support on my technical decisions: A lot of things I did went bad but I never knew they would. I am the most technical person in the whole company so everyone just left all things to me.\n* Other than people under me in my team, everyone in the company is like 10-15 years older to me;\n* Shit loads of mismanagement; leadership ain't focused on tech and just want Sales; Five people in leadership, no single person to take decisions; everyone has a separate opinion; co-founders themselves keep pitching the product in separate ways to potential investors/customers to lure them in;\n* No tools or metrics to track anything, be it revenue, tech, employees or anything; Not even a single line of documents/roadmap of the project; requirements/features keep changing every week (literally);\n* Every new idea is sent to tech team without any plan, execution, forecasting and wasted lot of time on those marketing/sales ideas that didn't work once;\n* People aren't hired based on skills and requirements; too much work pressure on each employee;\n* And majority of all, No empathy for employees, no culture or benefits or fun\n* Even after my resignation in April beginning, the CEO or others are not doing anything to find a replacement or get the knowledge-transfer from me\n\nSo my tenure ends on June 15 and I have no clue on what to do next. I feel I had more fun and more social in my first Big4 job, but i had more adrenaline/challenge and a matching role in the startup.I am not a pro coder but I like tech, experimenting with code and technologies. I have ventured into hundreds of different items, but I lose interest in coding after sometime always. I definitely like being social, putting ideas to technical solutions, planning out projects and features, feedback and debugging issues, and keeping the workplace fun for my colleagues. In both my jobs, I definitely put in a lot many hours than I was supposed to, only because I get attached to project/people/vision or probably cuz I take on whatever I can and people misuse that.\n\nHow can I assess myself in terms of strengths and interests and build a good skill for lifetime?And what kind of roles should I apply to?I think I should go slow,  learn something to build a strong resume and find a great-paying job in next 2-3 months? Or probably go for further studies like a Masters first? Or join a similar startup where I can contribute my technical and industry skills to?I wish to travel more than I have till now (both were like desk jobs), work on personal projects also, give some time to personal interests and play some regular football.\n\nLooking forward to hearing from you guys, or connecting with people in the same boat or people who can mentor a lost mind. :)\n\nCheers.",
    "title": "One year at a Big 4 and the next 1 year at a seed stage startup. What should I do next? (23, IND)",
    "subreddit": "cscareerquestions",
    "timestamp": 1621717030,
    "score": 1,
    "keyword": "indian ceo"
  },
  {
    "text": "Accept successful females! I am a 30yr old indian woman. Today I saw a video of Indira Nooyi, the CEO of PepsiCo where she says that her mother told her to - drop the crown when she enters the house and be the mother, daughter and wife to her family. She was talking about an instance where her mother sent her to get the milk for the house even though her husband was home earlier because he was tired and she needs to handle these responsibilities!!\n\nThe problem I have with the video is Indira Nooyi talked about it proudly. I see it as a failure of women!! Am I the only one to feel this??",
    "title": "Accept successful females!",
    "subreddit": "Feminism",
    "timestamp": 1616870211,
    "score": 8,
    "keyword": "indian ceo"
  }
]