[
  {
    "text": "Advice on salary Negotiation with an Indian Director I received an offer for around $54,000 for a procurement position with pretty good benefits (great medical) in SOCal. The director is from India with a couple years in the US and I am white. I feel he is trying to lowball me on a job offer.\n\nHowever, I have great experience with procurement and purchasing in a different field. The director has said he will have to train me on the new terminology so he would not pay me the $66,000 i asked for. \n\nThe interesting part is he was animated/rude about the negotiating process and that I was being sort of a pain for asking more. I am familiar with the software and processes his company uses so I feel the training I need is not a huge factor. The comparisons on salary sites for the industry/size of the company suggest I am well within the salary ranges.\n\nIs this a cultural thing should I push again for the $66,000? I had an Indian friend say they will haggle me down on salary pretty hard.",
    "title": "Advice on salary Negotiation with an Indian Director",
    "subreddit": "jobs",
    "timestamp": 1486452048,
    "score": 1,
    "keyword": "indian director"
  },
  {
    "text": "Indian judge acquits film director of rape after saying 'a feeble no could mean yes'",
    "title": "Indian judge acquits film director of rape after saying 'a feeble no could mean yes'",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1506500299,
    "score": 17,
    "keyword": "indian director"
  },
  {
    "text": "Burnt my bridges with an employer who was narcissistic, egotistic AND didn't pay my overtime wages. Tl;dr – Former employer turned out to be scum and even refused to pay overtime wages until I threatened to take him to court. \n\nStory starts back in 2015. I had been working part time at numerous jobs for 2 ½ years at this point (after having been full time for a while) and was incredibly frustrated with the lack of income. Some of the jobs I held down would go from giving me 39 hours a week to less than 5 hours, and while I had the support of my husband to keep us afloat, I couldn’t stand not being able to financially provide. So when I interviewed for a corporate but franchised owned hotel, I was ecstatic. This establishment, of which we’ll nickname Vacation Hotel, was a little franchised, family owned hotel that seemed fantastic to work for. I distinctly remember leaving the interview thinking “WOW. I want to work there!!”\n\nIt’s funny, because looking back on it, every employee who came and left had thought the same thing. And boy, did this hotel have more turnover then they let on. The manager – who we’ll name Kyle – had the same charm in all his interviews. He put on a damn good show, so good no one could see how fake it was. He did, after all, go to law school – and the more you got to know him, the easier it was to tell. \n\nKyle had charm. He spoke about how he treated each and every employee he had like family, so much so that he had leant a former employee money for a new car after they had been in an accident.  This was a story he told in every one of his interviews, though you wouldn’t know it at first. He spoke about how he hated large corporations and would treat his employees like humans, not robots. He’d even “randomly give raises” when he saw good performance, instead of waiting for annual reviews. I not only remember these things from my interview, but I began to watch him interview more and more people during my year there…of which, he gave the same speech with the same genuine realness. \nKyle became one of the biggest frauds I’d ever dealt with. Narcissistic and egotistic aren’t words that do his behavior justice. And it took me some time to accept that. Because him and his family “treated” everyone like they were, indeed, family. You fell for it, and you began to do everything you could for them. You felt obligated to be the best employee you can for such a “great and kind boss” who would give you the shirt off his back. Kyle always found a way to rope you in – he didn’t explain in his interviews that working full time did NOT mean you got benefits, in fact I saw many people assume it like I did. No health care, no time off, nothing. You worked for your hourly wage and that was it. This was one of the biggest bummers to me shortly after starting, as I had wished he told me up front in the interview. The second biggest bummer was when he explained he “did not budget for overtime.” No one could give me an answer to how he got away with this. I considered asking him, but I let it go.\n\nYou see, Kyle promised me big things. He was opening another hotel. And after having a 2 ½ year stint of struggling to find work, the idea of a stable career made me ecstatic. Kyle promised me a salary, a positon, and a future. While deep in my heart I had no desire for the hotel business, money does talk. And the numbers he showed me said a lot – it said stability. So Kyle ensured me I’d be experiencing all of this; money, stability, a career – if I showed my worth. He wasn’t “just going to hand it” to me until I showed I was capable. While most employers will promote you and then train you, Kyle did things backwards. He’d train and then promote. Why? Kyle was a penny pitcher. “Why pay me the salary if I don’t know what I’m doing?” and “It’ll catch up to you in the end, you’ll be making more money than you can dream of.” \n\nI fell for it. Kyle did things to make you want to stay – he’d act like he cared for you. He gave multiple employees loans when they fell short on money, though I refused to fall into it. But hell, I did get into a situation where my husband and I wanted to rent somewhere else but our credit was too damaged to get a place, so he called a potential landlord and recommended me for the townhouse we now live in. I was grateful for that, but never let it tie me down. I didn’t ask for it, he was kind enough to do it for me. And while he did a wonderful favor, I know in my heart I would get by without him. \n\nRegardless, I started training with the measly hourly income that every other front desk employee got. I was doing the work of Director of Sales for the hotel, Housekeeping Management, and accounting. It was becoming exhausting, and as Kyle was beginning to open that other hotel – guaranteeing I would be the general manager – I began to look for other work during my free time. I really didn’t want the job anymore. But I soaked up the experience from him until I left.\n\nThe biggest downfall from Kyle was two things.  Number 1 – I began to see that he had a major anger problem. He was a perfectionist. Something told me it had something to do with his nationality of being Indian, and how his father who owned the hotel would scrutinize him for the smallest mistake. Mistakes were NOT allowed at his hotel. Not the smallest, itty bitty mistake. If one of his bills was overcharged by $2, and I paid that amount, he’d go full Hulk on me. The yelling from him started to kill my confidence. My fellow co-workers began to notice how exhausted, tired and stressed I was becoming. I let them know that I was always walking on eggshells, no mistake was allowed during my shift. If it happened, he’d shout and yell at you like you were child, using words like “stupid” and “dumb” – and he wouldn’t pull you into his office, he’d do it publicly. \n\nNumber 2 – Kyle didn’t follow the law. It wasn’t “in his budget” to pay overtime. He felt he could reward his employees with random bonuses (of which never truly happened) as opposed to paying the dues owed. In my “training” it was a requirement to work 45-55 hours a week, 6 days a week.  I didn’t receive a cent of that in overtime, just my hourly wage. I also found out very quickly how heavily taxed you are in pay when you work over 40 hours.  So the extra $100 or so I was “making” a week really came out to be $20 or so after taxes. When I asked not to work over 40 hours, suddenly it wasn’t allowed. I would be stripped of my titles because a “real manager works as hard and as long as they need to.” And I would need to get used to “working 60-80 hours a week if needed.” This was all fine and dandy, but if I was working these hours, I wanted the right pay. He made it clear it wasn’t happening. “All would be paid in due time.” So while Kyle went on multiple trips – London, India, Las Vegas, New York – I managed the hotel. I did his job for him, of which he made clear that I was doing as much. At first it was appealing to be an acting general manager…until it wore me down.\n\nIt wasn’t until a fellow co-worker sat me down and told me up front about how she felt regarding the situation. I was shocked to hear her say she felt I was being used, abused and mistreated. But I agreed with her. She was looking for work, I was looking for work – we both wanted out. I still did my job, but stopped caring very quickly. As the rose colored glasses fell of completely, I saw him mistreat and abuse others. Inside the establishment that seemed so fantastic was really an ugly family who used their employees to gain profit. \n\nI can’t say I would have left when I did if it weren’t for my husband’s accident. In autumn of 2016, he got into a terrible motorcycle accident. He was flown to shock trauma and spent 4 days there, having needed surgery on his arm and knee. Of course I immediately called out of my next shift, but later that day as I waited for his surgery to take place; Kyle kept blowing up my phone asking when I’d be back and if I could return the next day for work. After all, Kyle’s wife (who also worked at the hotel) was newly pregnant and stopped working immediately. So he “needed” me there to “run” the hotel. He didn’t like the answer I had for him – I needed time off. Not having benefits for such a thing, he made it seem like a requirement to return to work. As I had already been losing my patience with him, this became the last straw. Just like I distinctly remember my interview with him, it was the moment in the hospital waiting room that I distinctly remember making a life alternating decision – my family came first. And if that meant being there but not providing thousands of dollars, I would take it. I couldn’t imagine having to rush back to a freaking hotel instead of being with my injured husband, all because the housekeepers needed help. While that was his life, it wasn’t the life for me.\n\nNot even 5 weeks after his accident did I find another job and put in my resignation. I held out until I found a job with benefits, so I could stop paying an arm and leg to the Afford Care Act. I sent him an email, wrote him a hand written letter, and gave him 2 weeks notice. I was hoping to part peacefully, but that wish never came true. A couple days later I was pulled into his office and he spent an hour convincing me of why I needed to stay and everything I’d be giving up (it was always money with Kyle) if I left. I stayed firm, even as he promised an immediate raise and large bonus in my next paycheck. He promised to pay my health care from the ACA and even start giving me vacation time. Having told him three times my answer was final; I was then berated for a period of time that I can’t even remember. It was almost surely a half an hour that he told me I was going to fail in life, that I’d go nowhere – especially without him, and I’d never get such a great opportunity like he had given me. \n\nIt was in that moment, I knew I made the right choice.\nWe left on civil terms, regardless of how he treated me during that moment. I kept in touch – hell, I even did a Saturday or two in shifts for him while I started my new job. And then I filed a complaint with the Department of Labor for unpaid overtime wages. Per the DOL, you have to request the unpaid wages first before you take the employer to court. So I wrote up a letter, calculated from my pay stubs the amount I was owed, and certified mailed it to him. \n\nI heard back the day he received the letter. 13 text messages blew up my phone at once, all about how he was such a great friend to me, how dare I do such a thing, I willing worked those hours, I have no right to “steal” this money from him, how he helped me get the house I live in and how I’d regret my decision to send that letter. \n\nKyle was smart. Kyle knew that if he didn’t pay me what I asked for, it’d go to court and he’d owed hundreds of thousands of dollars to all his other employees who were owed unpaid overtime. It was better for him to pay what I was owed as opposed to everyone else. My response was civil – I quoted the FSLA and once again requested only what I was owed in unpaid overtime. He said he’d have a check for me in a couple days with payroll, and would mail it to me as I requested.  \n\nI was hoping that would be it for us. He’d send his check and we’d call it a burnt bridge. Instead, that Friday that he was going to mail it, he showed up at my doorstep. For 5 minutes he banged on the door like a primal animal – I was upstairs taking a nap and my husband was downstairs, quite frankly, ignoring it. I’ll be honest, we really don’t answer the door unless we know we’re expecting guest, as we get a lot of solicitors in our neighborhood. It wasn’t until I was woken up by my phone blowing up – it was Kyle, saying he was outside and if I wanted the check, I needed to open the door.\n\nF. That. Sh!t. He wasn’t coming into my safe space, my HOME, to berate and abuse me. I wouldn’t allow it. I knew from experience what would happen, as I had seen him withhold employee’s last paychecks until they came to pick it up when he was at the hotel so he could put them down and call them horrible, stupid people. He wasn’t going to do that in my home. I asked my husband to deal with him. According to him, it was hard to get the check – not because he was my husband and not the person the check was addressed to, but rather Kyle kept trying to pass on messages through him. \n\n“Tell her we could have done this face to face, and it’s a shame she had to let it come to this, and that she’s a coward, she’ll never go anywhere, ect ect.” Not hearing it, my husband told him to keep his business out of our home and to hand the check over or leave.\n\nAt the end of the day, I got my owed wages. I know I came out on top, though I’m greatly angered that Kyle tried to invade my personal space at home with his petty anger. I’ve learned a great lesson from this experience, and feel like a much better person after it all. I’ll no longer give all of myself to any employer, no matter what they promise me or even what they pay me. If I can’t divide my time between my personal life and my job, I need to step away from the latter. Because life is too short to spend my entire day away from the things I truly love. A job is a job, but my family is my life. \n\nTl;dr – Former employer turned out to be scum and even refused to pay overtime wages until I threatened to take him to court.",
    "title": "Burnt my bridges with an employer who was narcissistic, egotistic AND didn't pay my overtime wages.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488565251,
    "score": 12,
    "keyword": "indian director"
  },
  {
    "text": "Career Advancement Advice: leaving current employer after 2 years? Hello Everyone,\n\nI’m looking for a bit of input, perhaps those with a few more years professional experience can draw from their time in the work force and offer a bit of insight. First some background: ~6 years ago I’d broken into my industry as a sales associate. Having experienced a fair amount of success, advanced in ~3 years time to the manager level at a second employer, where I have been for the last 2+ years.\n\nFast forward to today; I’ve received an offer to join a multinational generic pharmaceutical manufacturer at the Associate Director level, with a fairly substantial bump in pay. \n\nI’m weighing the pros and cons of leaving my current employer, a European based manufacturer, a brilliant group of scientists/engineers/support staff, and joining a new company. In terms of career progression and future earnings potential, I believe this is the right move. Looking ahead, it is likely that I return to school for an MBA, and believe the progression will show well in the application process as well.\n\nI certainly know what I’d like to hear from the group … but I’m open to hearing other opinions, especially any which are dissenting. Implications of moving from one company to another in a relatively short period of time? Am I right to assume this is a symptom of today's job market? Is the clear jump in pay, responsibility and title justification enough? I wonder how far loyalty would take me in my current role.\n\nThanks!\n\n**Personal Info**\n\n* Age: 28 years old\n* Male\n* Single, no dependents \n\n**Employer A (current)**\n\n* Pharmaceutical Drug Substance and Fine Chemical manufacturer headquartered in Europe.\n* Account Manager with responsibilities in North America\n* Base Salary: $85,000/yr\n* Bonus Potential: 15-20%\n* Additional: $5k/yr car allowance, preventative maintenance and insurance paid\n* Work from home office when not on the road. Travel required to Portugal 2x per year, totaling ~4 weeks in Europe, in addition to regional business travel\n* Ceiling in terms of advancement\n\n**Employer B**\n\n* Pharmaceutical Drug Substance, Drug Product and Fine Chemical manufacturer headquartered in India\n* Associate Director, API Sales, with responsibilities in North America\n* Base Salary: $110,000/yr\n* Bonus Potential: 15%\n* Additional: $9k/yr car allowance\n* 100 mile round trip commute\n* Ranked among top three Indian drug manufacturers, with a number of verticals for future advancement \n* Will be responsible for new product selection and higher level of oversight in day-to-day sales operations",
    "title": "Career Advancement Advice: leaving current employer after 2 years?",
    "subreddit": "careerguidance",
    "timestamp": 1487775879,
    "score": 1,
    "keyword": "indian director"
  }
]