[
  {
    "text": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture. In 2012, while running for the US Senate, former Missouri House Representative Todd Akin stated, [\"If it’s a legitimate rape, the female body has ways to try to shut that whole thing down.”](https://www.politico.com/story/2012/08/akin-legitimate-rape-victims-dont-get-pregnant-079864)  As someone who [worked for IBM selling computers and ran the maintenance department at his father's steel company](https://news.stlpublicradio.org/government-politics-issues/2012-10-02/akin-embraces-image-of-minuteman-as-he-battles-establishment-including-his-own-party), it clearly gave him the expertise necessary in women's anatomy, biology, and physiology to be able to make this assertion.  Of course, as an anti-choice usurper of rights, what type of man would he be, unless he [physically restricted access to reproductive healthcare clinics for women in need](https://archive.thinkprogress.org/todd-akin-was-arrested-multiple-times-for-physically-blocking-womens-access-to-abortion-clinics-7dda2f38d322/)?\n\nAkin's son, Perry, said, [\"As my father’s death approached, we had people from all different walks of life share story after story of the personal impact he had on them.\"](https://apnews.com/article/former-rep-todd-akin-dead-0a1b944f96eee4b63d9ea57e04c44ca4)  Of this, I have no doubt.  I'm certain that there are millions of women across the globe who would have liked to share the impact your father's life had, and will continue to have, on them.\n\nIn 1990, Lawrence Lockman, a Republican member of the Maine House of Representatives wrote, while serving as director of the Pro-Life Education Association, [\"If a woman has (the right to abortion), why shouldn't a man be free to use his superior strength to force himself on a woman?  At least the rapist's pursuit of sexual freedom doesn't (in most cases) result in anyone's death.\"](https://archive.vn/5cKpD)  Well, in that case, since you make such a perfectly reasonable, rational argument...\n\nIn 1990, Texas Republican gubernatorial nominee Clayton Williams, lamenting poor weather conditions that threatened to cancel a cattle roundup at his West Texas ranch, likened the atmospheric conditions to rape, stating, [“Rape is kinda like the weather. If it’s inevitable, relax and enjoy it.”](https://www.snopes.com/fact-check/personal-foul/)\n\nIn 2018, former US Rep for Iowa, Republican Steve King was asked about his stance of not allowing exceptions for either rape or incest in anti-choice legislation.  He said, [\"What if we went back through all the family trees and just pulled out anyone who was a product of rape or incest? Would there be any population of the world left if we did that?\"](https://www.desmoinesregister.com/story/news/politics/2019/08/14/steve-king-abortion-rape-incest-westside-conservative-iowa-representative-birth-iowa-civilization/2007230001/)  Steve King, everyone; noted critical thinker, [construction worker](http://kingconstruction.net/), and [avowed](https://thehill.com/homenews/house/413601-steve-king-members-of-nazi-linked-party-in-austria-would-be-republicans-if) and [unabashed neo-Nazi](https://www.vox.com/policy-and-politics/2018/6/13/17459908/steve-king-neo-nazi-tweet-retweet).\n\nFormer Republican Senator from Pennsylvania, Rick Santorum, most recently in the news for attempting to erase all remnants of Native Americans from North American soil ([\"We birthed a nation from nothing. I mean, there was nothing here. I mean, yes we have Native Americans but candidly there isn't much Native American culture in American culture\"](https://twitter.com/JasonSCampbell/status/1386685340522536961)), when asked what his views were on abortion in cases of rape and incest in 2012, stated, [\"...the right approach is to accept this horribly created--in the sense of rape--but nevertheless a gift in a very broken way, the gift of human life, and accept what God has given to you...We have horrible things happen.  I can't think of anything more horrible.  But, nevertheless, we have to make the best out of a bad situation.\"](https://archive.thinkprogress.org/santorum-to-rape-victims-make-the-best-out-of-a-bad-situation-a8388910c907/)  Apparently, in the case of rape, it's a gift.  It's a horribly created gift, yet nonetheless, a gift.  However, in the case of incest, it's what?  Just a regular, everyday gift?  A normal byproduct of a fully-functional family life?\n\nAlso in 2012, Richard Mourdock, a Republican candidate at the time running for Senate in Indiana, stated, [\"...I came to realize life is that gift from God.  And I think even when life begins in that horrible situation of rape, that it is something that God intended to happen.\"](https://www.cbsnews.com/news/richard-mourdock-even-pregnancy-from-rape-something-god-intended/)\n\nIn 2014, Montana Judge Todd Baugh sentenced a 54-year-old, admitted child molester, convicted of repeatedly raping his 14-year-old female student, who committed suicide during the course of the trial, to 30 days in jail.  At sentencing, he stated that the victim [\"seemed older than her chronological age\" and was \"as much in control of the situation\"](https://thelede.blogs.nytimes.com/2013/08/29/protesters-demand-montana-judge-resign-over-rape-sentencing/) as her rapist.  One month later, in an interview, he defended his decision, stating, \"Obviously, a 14-year-old can't consent.  I think that people have in mind that this was some violent, forcible, horrible rape.  It was horrible enough as it is just given her age, but it wasn't this forcible beat-up rape.\"  [He also added that her death complicated the case](https://www.usatoday.com/story/news/nation/2013/08/28/teacher-rape-montana/2722817/).\n\nIn 2019, a Tennessee Judge Steven Sword sentenced former pastor, David Richards, to 12 years in prison, 60 short of the maximum prosecutors had sought, for repeatedly having raped his adopted daughter over the course of two years, beginning when she was 14-years-old.  Richards maintained his innocence throughout trial, attempting to portray his victim as a rebellious teenager, who only made the allegations, after he had imposed strict rules for his children.  However, his DNA profile was lifted from a seminal fluid sample recovered from the girl's bed frame.\n\n[The judge, in handing down his lenient sentence, stated that he took into account Richard's longtime ministry, the Bible study he began in jail while awaiting trial, and the community support he received from family, friends, and fellow Christians](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/).\n\nAt sentencing, over 30 friends and parishioners sat on Richard's side of the courtroom in support of him, while only six appeared for his victim.  One of those appearing on behalf of Richards to argue for sentencing leniency, David Thompson, who shared ministerial duties w/ Richards at their church, said, [\"I find it impossible for me to believe he's guilty of this. His business needs him. His family needs him. Our church needs him.\"](https://www.knoxnews.com/story/news/crime/2019/05/09/former-pastor-nets-12-year-prison-term-rape-adopted-daughter-david-lynn-richards/1143006001/)  Clearly, his family needs him, since he's such a wonderful father.\n\nAnd, of course, there's the new breed of vitriolic misogynists who, in a single breath, deny rape culture while proliferating it w/ their toxic ideology.  They refer to themselves as \"[Western chauvinists](https://www.splcenter.org/fighting-hate/extremist-files/group/proud-boys),\" but in reality, [they're nothing but neo-Nazi terrorists](https://www.timesofisrael.com/not-nazi-enough-proud-boys-leader-wants-group-to-fully-embrace-white-supremacy/), and [that's all they've ever been](https://www.adl.org/blog/proud-boys-bigotry-is-on-full-display), so don't be fooled by their rhetoric.  They've now taken to wearing suits and ties and [holding yearly conventions that promise to make \"men masculine again,\" while \"Making Women Great Again.\"](https://the21convention.org/)  Since last year's conference was such disgrace, [this year's conference promises to be an even more hatefully misogynistic experience w/ 17 featured speakers, and in a first, they're actually going to allow to women to speak](https://22convention.com/)!\n\n>Women today are being taught to act more like men. Where has that led us? Skyrocketing rates of broken families, a documented decline in female happiness since the 1970s, endless social and dating dysfunction, and America at the #1 spot in the world for single motherhood. No longer will you have to give in to toxic bullying feminist dogma and go against your ancient, biological nature as a woman, great men and women have arrived to help #MWGA.\n\nIt's pretty clear that this toxicity has led to a rape culture that's just intolerable, and this is just a snapshot of what's taking place in America.  [Gender-based violence has rooted itself in some of the most populous countries in the world, and the problem only appears to be getting worse](https://www.atlanticcouncil.org/blogs/southasiasource/understanding-rape-culture-in-bangladesh-india-pakistan/).  In other parts of the world, the abuse of women is absolutely horrific, [akin to something the Third Reich did to Jews in the death camps](https://scholarworks.lib.csusb.edu/cgi/viewcontent.cgi?article=1233&context=history-in-the-making).  In 2016, an [Indian woman from the state of Rajasthan was gangraped by her husband and his two brothers](https://www.indiatvnews.com/news/india-woman-gangraped-by-husband-in-laws-tattooed-with-expletives-over-dowry-336883), then tattooed across her forehead and hands/arms w/ expletives, b/c her family failed to meet the husband's dowry demands.  In 2018, [a 17-year-old Moroccan girl was abducted, tortured, and gangraped by 13 men over the course of two months](https://www.aljazeera.com/news/2018/8/27/morocco-outcry-after-girl-is-raped-tattooed-with-swastikas).  They burned her w/ cigarettes and tattooed her all over her body, including w/ symbols of swastikas.\n\nThis could go on (and on and on and on and on), but there's only so much space available on the Internet.  What's clear is that those who perpetuate this violent culture are the same who propose and legislate the wholly ineffectual laws designed to deal w/ this problem, and they're also those who enforce, prosecute, and adjudicate said laws.  In a sense, it's allowing predators to sit in judgment of predators, while, at the same time, giving them the option to dismiss those they victimize.  I'd say that it's a broken system, except that it's not.  It's a system that's working exactly in the way in which it was intended.",
    "title": "In light of the death of Todd Akin, a Republican member of the Missouri House Representatives, who coined the term \"legitimate rape,\" I wanted to highlight some of his colleagues' comments over the years in helping perpetuate the patriarchal rape culture.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633547326,
    "score": 2041,
    "keyword": "indian judge"
  },
  {
    "text": "I just got the news of my good childhood friend passing away and i don't know how to process this information. It's too much to handle and there is no one i can talk to.....\nMy childhood friend passed away yesterday in an accident. She has an amazing family, 2 kids, husband, brother and a mother. \nI don't know what to feel. I feel numb. She was my childhood ki dost, she was my first ever \"Saheli\". Her name was Durgesh/Durga but for me she was always \"Baby\". Yes, it was her nickname. The only person I called baby my entire life was her. Do you remember those old printed big size framed photographs that Indians use to put in their homes? It was in trend in 90s. I still have thode photos of Baby and I from our childhood. I don't know what to do except hold that picture and cry. \n\nWe spent so much time together in our childhood but grew apart growing up but that doesn't change the place we had for eachother. We were always in each other's prayers, we always had so much love for eachother irrespective of the fact that we don't talk regularly or meet regularly. \nWe were kind of those friends who grew apart because we didn't have personal phones to keep in touch, she use to live near my dad's place of business so i use to go to my dad's office on weekends/holidays to meet her. Sometimes, she use to come home with daddy after work and surprise me and we would spend some days together. Playing, dancing, talking and just being with eachother. Growing up, we were busy with school and then college. In college, I was told that she is getting married, i was kinda sad because we were quite young at the time. She was 22 when she got married and i wanted her to be more financially independent before being married off to a stranger. I was so concerned for her and her life to come, mostly because marriage is one of the biggest fears i have but I decided to put on a brave face, prayed for her, hoped for everything to be the best, dressed up and went to see her on her biggest day. \n\nOh boy, she looked beautiful and HAPPY. Yes, happy, so full of love and excitement just like she has always been. I was still scared for her to be taking this big a step but she seemed to have welcomed the change so i was happy for her. I just prayed with all my heart that her husband turns out to be a good human being and takes care of her always and forever. \nAnd you know what? He turned out to be an amazing person, as far as I know. He is a hair stylist and such a  feminist. You know some people who don't know the term \"Feminism\" but are feminist at heart because for them equality is the only way, that's how they have been raised. He was like that.\n\nHe introduced my baby to the world of makeup, she learned it quite fast and both of them started working together. He use to style the hair and she use to do the makeup, perfect team.  In 2020, when COVID happened i came across her Facebook page where she use to post the content around their work. Happy clients, makeup tutorials, hair styling tutorials, process videos etc etc. It made me so sooo sooooo happy! Seeing her working with her partner, who I wasn't sure of initially, it gave me hope in this godamn world. \n\nSome days back talking to my sister about life. I had an epiphany that I have so much shit to deal with and it would have been nice if Baby and I still had been on daily talking terms. I needed someone else's perspective, someone who has my best interests at heart, someone who won't judge me, someone who I can trust. All other \"childhood friends\" seemed busy or we weren't in the situation of being able to talk freely. That moment, I remembered my Baby. I knew, I could always talk to her no matter how depressed or sad I am. I knew if I would ask, she would be there. My sister told me that it's not too late and it's not like we had a fight or something so i should initiate the conversation. \n\nI texted her on her FB account, exchanged numbers and texted. We made plans to meet, we made plans to talk, we made plans to come to each others houses just like old times. This was before Diwali. She told me she will be visiting her house, the same house which is close to my dad's place of business on Bhaidooj (Indian festival). \n\nAnd today, one week later, I get the news of her passing away. She was with her 2 kids, her mother and one more family relative. \nThey met with an accident, everyone survived but she didn't. They were on a tractor and it lost its balance. She was under that tractor and no one helped. No one helped a lady stuck under a fucking tractor. \n\nShe was young, she was so fucking young. She had her entire life ahead of her. Her kids are so small. Her husband, I can't fathom what he must be going through, what about his team now? Her mother, she was the only hope in her mother's life. Her brother? He was happy knowing that her sister is in a safe family. A good family who takes care of our beloved baby. \n\nAnd now, she is gone forever. \n\nI don't know what to feel. I don't know how to accept this information. So much pain, so much pain thinking about it. I talked to her just a week back, we had plans, to see eachother, to be more involved in each other's lives just like before. Now, because we are grown up, we have the freedom to be with eachother, whenever we want. We have personal phones too. We could have talked whenever, wherever we wanted. \n\nWhy Mahadev? Why this happened? I know we should not mourn the dead but this isn't fair Mahadev. This isn't fair. Life isn't fair, I know but why good people have to suffer the most? I see bad ones having all the fun, where is karma? Where the fuck is Karma here? She didn't hurt a soul in her entire life and this is what happens? I didn't even get to say goodbye. Why Mahadev? We deserved a fairwell. \n\nAt 26 she was married, had kids, had an fulfilling partner and family, self satisfactory work life and everything except she is dead now. Gone too soon my love, my baby. \n\nMay Shivaay looks after the kids who lost their mother, \nMay Shivaay looks after the mother who lost her only daughter, \nMay Shivaay looks after the man who lost his family, friend, partner and wife.",
    "title": "I just got the news of my good childhood friend passing away and i don't know how to process this information.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1636619572,
    "score": 20,
    "keyword": "indian judge"
  },
  {
    "text": "Huge feminist protests erupt across Caribbean island Trinidad and Tobago in light of the recent rape and murder of a 23-year-old girl, Andrea Bharatt. [https://www.newsamericasnow.com/caribbean-news-andrea-bharatt-murder-trinidad-and-tobago/](https://www.newsamericasnow.com/caribbean-news-andrea-bharatt-murder-trinidad-and-tobago/)\n\nTens of thousands of men and women are protesting against the government of Trindad to do something to improve the safety of our women. Dozens have gone missing and have most likely been raped and murdered.\n\nAfter the recent (Jan kidnapping, murder and suspected rape of Andrea Bharatt, enough is enough!\n\n[https://newsday.co.tt/2021/01/30/arima-woman-kidnapped-ransom-demanded/](https://newsday.co.tt/2021/01/30/arima-woman-kidnapped-ransom-demanded/)\n\n**She was an innocent sweet, university educated, 23-year-old girl who worked as a clerk at a Magistrates court.** She was was abducted in a 'fake taxi' on January 29th. After several massive manhunts, her body was eventually found 7 days later. From all accounts, she had been killed the same day she was taken.\n\n**About Trinidad -** The southernmost Caribbean Island and 3rd richest country in the Western Hemisphere per capita, the oil-rich Trinidad who invented Steelpan music, Soca and Calypso and has the world's second-biggest carnival, is no stranger to violence and crime.\n\nWe are a uniquely cosmopolitan island (40% Indian, 40% Black, 20% mixed/white/Venezuelan/Syrian) country of 1.5M people that has surprisingly little racial tension but has been plagued over the last 2 decades with increasing gang violence.\n\nHowever, despite having near 500 murders annually for the last 20 years (10,000 people murdered) one recent murder shook the nation to its core (after years of several women going missing or murdered/raped).\n\n**Andrea Bharatt was possibly raped, murder and then dumped over a ledge along a mountainous road in Aripo.**\n\nPolice were able to hold two suspects, one was found with her bank card who later sold out his accomplice.\n\n**The main suspect was well known to the police.** In fact, he had 70 charges and numerous criminal cases against him, yet for some reason, **he was not in jail.** On 5 occasions shoddy (or bribed) police work resulted in cases being dropped. Other cases were still pending, but judges saw it fit for some reason to grant him bail.\n\n**The lack of urgency, complacency, incompetence, corruption and ownership of these issues by authorities has ANGERED an entire nation, a nation where women are feeling increasingly unsafe.**\n\nIt has been met with silence, and politicking by the government who refuses to take responsibility and attempt to pass the blame.\n\nProtestors and feminists are taking to the streets to bring attention to this issue, but we need this to go international to pressure our government to take responsibility and weed out corruption.\n\n&#x200B;\n\nThe two suspects later died in police custody with the police claiming one 'fell off his chair' and the other got injured in an escape attempt.\n\nNo doubt police who were complicit in these guys not being in jail and were trying to shut them up,\n\n&#x200B;\n\n**This is reminiscent of what happened in Delhi with the brutal bus gang rape in 2012.**\n\nHowever, we need your help. We have a condescending out of touch government that caters only to the needs of the richest in the island and not the average citizen.\n\n&#x200B;\n\nThe victim - [https://s1.stabroeknews.com/images/2021/02/andrea-b2.jpg](https://s1.stabroeknews.com/images/2021/02/andrea-b2.jpg)\n\nA video project by the victim - [https://youtu.be/lqaJDOxfeFg](https://youtu.be/lqaJDOxfeFg)\n\nThe headlines - [https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p180x540/148357699\\_10158003590655814\\_4702965862099867631\\_o.jpg?\\_nc\\_cat=108&ccb=2&\\_nc\\_sid=730e14&\\_nc\\_ohc=OOPzySAt6sgAX\\_zfXSE&\\_nc\\_ht=scontent.fpos1-1.fna&tp=6&oh=6f657382c1bda4f7523dc0c0e170a079&oe=60483DD0](https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p180x540/148357699_10158003590655814_4702965862099867631_o.jpg?_nc_cat=108&ccb=2&_nc_sid=730e14&_nc_ohc=OOPzySAt6sgAX_zfXSE&_nc_ht=scontent.fpos1-1.fna&tp=6&oh=6f657382c1bda4f7523dc0c0e170a079&oe=60483DD0)\n\nThe essence of the government's response - [https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p526x296/147852653\\_10159315695791119\\_866468936050134841\\_o.jpg?\\_nc\\_cat=103&ccb=2&\\_nc\\_sid=730e14&\\_nc\\_ohc=LBTXQi4pP3QAX8aOWi9&\\_nc\\_ht=scontent.fpos1-1.fna&tp=6&oh=b11bf5728cd0266c4a99a6b505897f16&oe=604959CF](https://scontent.fpos1-1.fna.fbcdn.net/v/t1.0-0/p526x296/147852653_10159315695791119_866468936050134841_o.jpg?_nc_cat=103&ccb=2&_nc_sid=730e14&_nc_ohc=LBTXQi4pP3QAX8aOWi9&_nc_ht=scontent.fpos1-1.fna&tp=6&oh=b11bf5728cd0266c4a99a6b505897f16&oe=604959CF)\n\nVideo of our Government's nonchalance and condescending attitude here - [https://www.facebook.com/100001952421497/posts/5106469866094710/?sfnsn=wa](https://www.facebook.com/100001952421497/posts/5106469866094710/?sfnsn=wa)\n\nAll the women killed/missing over the last decade or so - [https://scontent.fpos1-2.fna.fbcdn.net/v/t1.0-9/144741275\\_747508228171\\_652795971916147088\\_o.jpg?\\_nc\\_cat=105&ccb=2&\\_nc\\_sid=8bfeb9&\\_nc\\_ohc=WuQiiDTRauoAX\\_WtmhP&\\_nc\\_ht=scontent.fpos1-2.fna&oh=5e3cba222c8379d1a2e61bcd1df47fce&oe=60466014](https://scontent.fpos1-2.fna.fbcdn.net/v/t1.0-9/144741275_747508228171_652795971916147088_o.jpg?_nc_cat=105&ccb=2&_nc_sid=8bfeb9&_nc_ohc=WuQiiDTRauoAX_WtmhP&_nc_ht=scontent.fpos1-2.fna&oh=5e3cba222c8379d1a2e61bcd1df47fce&oe=60466014)\n\nPetition (one of many) - [https://www.change.org/p/minister-of-national-security-protect-our-women-in-t-t?recruiter=false&utm\\_source=share\\_petition&utm\\_medium=facebook&utm\\_campaign=psf\\_combo\\_share\\_initial&utm\\_term=psf\\_combo\\_share\\_abi&recruited\\_by\\_id=150ab800-67ce-11eb-a39e-db9fdf139296&utm\\_content=fht-27200205-en-gb%3A0](https://www.change.org/p/minister-of-national-security-protect-our-women-in-t-t?recruiter=false&utm_source=share_petition&utm_medium=facebook&utm_campaign=psf_combo_share_initial&utm_term=psf_combo_share_abi&recruited_by_id=150ab800-67ce-11eb-a39e-db9fdf139296&utm_content=fht-27200205-en-gb%3A0)\n\n&#x200B;\n\nWe want this to go viral, this needs to reach CNN, MSNBC, BBC, even FOX or OAN (we really don't care at this point).",
    "title": "Huge feminist protests erupt across Caribbean island Trinidad and Tobago in light of the recent rape and murder of a 23-year-old girl, Andrea Bharatt.",
    "subreddit": "Feminism",
    "timestamp": 1612830730,
    "score": 67,
    "keyword": "indian judge"
  },
  {
    "text": "The Indian State officially stalked a survivor [TW: Stalking, Harassment] \n\nIn 2019, a Supreme Court staff accused the Chief Justice of India, Ranjan Gogoi, of sexual harassment. He got away by presiding as the judge over his own trial.\n\nRecently, India was accused of using the Israeli Surveillance and Hacking software, Pegasus, along with other right wing countries like Hungary and Saudi Arabia. In the snooping list it was revealed that along with numerous activists, the woman who accused Gogoi of sexual harassment was also put under surveillance. 3 of hers and 11 of her family members associated with her were hacked.\n\nThe survivor had already reported receiving death threats after the allegations went public. The Indian state helped Gogoi get away with Sexual Assault. \n\nRight now he is serving as a nominated member of Rajya Sabha, the upper house of Indian Parliament as a \"post retirement award\"",
    "title": "The Indian State officially stalked a survivor",
    "subreddit": "Feminism",
    "timestamp": 1626713966,
    "score": 17,
    "keyword": "indian judge"
  },
  {
    "text": "Indian Supreme Court judge asks the rapist to marry the victim. Not sure if this was shared here",
    "title": "Indian Supreme Court judge asks the rapist to marry the victim. Not sure if this was shared here",
    "subreddit": "Feminism",
    "timestamp": 1616074589,
    "score": 8,
    "keyword": "indian judge"
  }
]