[
  {
    "text": "Phone interview with a recruiter who had a really thick accent So it appears a big bank is outsourcing their recruiters. I just got off the phone with a recruiter that had a very thick Indian accent. I had to keep asking her to repeat herself. At one point she got upset with me for asking what she saying again and again. She probably won't be sending my resume to the hiring manager now. This is really not fair at all. I don't think it is asking too much to have someone do interviews who speak clear English.",
    "title": "Phone interview with a recruiter who had a really thick accent",
    "subreddit": "jobs",
    "timestamp": 1636567390,
    "score": 10,
    "keyword": "indian manager"
  },
  {
    "text": "Watch out for the job scams - I almost fell for it. Anyone else getting bombarded with them? \n\nHi everyone,\n\nI really need to get this off my chest. I think I'm going crazy because these scams are so ubiquitous and well-done that I can't even tell a real company from a scam these days. \n\nI don't know about you but I've been getting so many of these fake recruiter scams from India. They used to be flimsy emails riddled with grammatical errors telling me I got a job offer for a position I obviously didn't apply to (eg, only tangentially-related to my field or in a nearby state but like 4 hours away by car). \n\nNow they're aggressive, They text me the same form texts (\"Hi this is Kristina from the HR department at Empire Management! I am trying to contact you regarding potential employment. We would like you to schedule a preliminary zoom interview to meet with us. Please shoot me a quick call to discuss and set up at \\[my area code\\]-XXX-XXXX\"), call me constantly (\"Hi, this is Nailini from Evolution Communications,\") offering me interviews instead of jobs (more believable), and even making actual fake websites for their fake companies. I figured this out because they all have the exact same format/template (eg, [www.evolutioninternationalco.com](https://www.evolutioninternationalco.com), www.emptiremgmtgroup.com) \n\nIt's actually how impressive the lengths they go to scam. They manage to have US numbers you can call, they arrange \"interviews\", and they even have domain names and websites (those are expensive), with not a spelling error in site! I don't even know how they can pull this off it's scary and I almost fell for it. The worst part is they are for jobs I actually would be qualified for, in my area! Of course I agreed to set up a Zoom interview with the first one who contacted me, which I didn't attend. It seems they're way more desperate these days and would go to greater lengths and spend more money to nab someone. \n\nIt's freaking me out to the point where I don't even know what companies are real and which are fake. For example, NewAgeSys is absolutely fake, yet they have a legit-looking website, job postings on LinkedIn, and even a \"recruiter\" who tried to connect with me despite having received an MBA from an obscure Indian medical college in 2020 suddenly appearing in Princeton, NJ? \n\nI'm trying to break into a new field and the constant barrage of Indian scams (they're all from India, based on the way they communicate, the accents on the phone, etc.) is freaking me out and making me suspicious of everyone who contacts me. Theyre sounding so real now! I even have a close friend's sister who got duped by one of them - she was offered a position she did a Zoom interview for and everything (these scammers even research the bloody job descriptions!) and they had her pay for a certain kind of certification she would need for the job, and then disappeared. \n\nAny advice? Anyone else go through this? I feel so alone in this and feel like they're chasing me down and won't leave me the heck alone! They call me at all hours of the day and my emotions are all over the place because I get so hopeful it's an actual interview just to look into the company more in depth online and realize it's a scam (I have some headhunters working on my behalf so sometimes I assume the headhunter sent them my CV).",
    "title": "Watch out for the job scams - I almost fell for it. Anyone else getting bombarded with them?",
    "subreddit": "jobs",
    "timestamp": 1621954074,
    "score": 6,
    "keyword": "indian manager"
  },
  {
    "text": "Job wants me to work remotely 8 hours a day but spread out throughout the day so I wouldn’t have overtime, with uncertain hours. Is this legal? I work for a tech consulting firm based in India. I’m sure some of y’all can guess which company. But this is what my day looks like \n\n9 AM - meeting that can go til 10:00 but usually lasts 15 minutes \n\n10:30 - 5:00 P.M.  first round of “loads” that can go up until 9 pm but usually stop around 5 \n\n6:30-7:45 second round of loads that usually end at 7:15 but can go for an unspecified amount of time depending on how many errors there are \n\nI’m in the U.S. and don’t know how to handle this situation. I’ve tried talking to my manager about overtime but they basically said “oh but you have a break during these hours” which is true I’m not working usually but it’s impossible to live a life or plan anything around. It means I can’t really go to the doctors, grocery shop or even go to the gym on weekdays. An hour and a half max is barely enough to do anything. To make matters worse we never know when the jobs will finish so I can’t plan anything with friends. \n\nI think I’ll be paid overtime for when I actually work over 8 hours but I don’t know if I should argue the time in between (ie 9:15-10:00) should count as time I’m “working”. Im basically expected to be on call most of the day. \n\nIt is an Indian company and my coworker is Indian and doesn’t even get overtime so I feel a little bad complaining because the job itself is pretty easy and I’m lucky to have a job right now but I’m going crazy. I’m already isolated working from home and not being able to see friends is only going to make things worse :( \n\nI graduated May 2020 and this is my first job out of college so I don’t know how to handle this. I want my bosses to like me but also being on call 11 hours a day without being paid for it is insane. \n\nAny advice is very much appreciated.\n\nEdit: I’m paid hourly and eligible for overtime\n\nEdit 2: this is all a little confusing sorry but basically the gist of it is my company wants me to be “on call” for 10.5 hours a day with a 30 min break in the morning I don’t have to worry about. Should I log the hours I need to be on call as overtime?",
    "title": "Job wants me to work remotely 8 hours a day but spread out throughout the day so I wouldn’t have overtime, with uncertain hours. Is this legal?",
    "subreddit": "jobs",
    "timestamp": 1614642538,
    "score": 3,
    "keyword": "indian manager"
  },
  {
    "text": "How to contact Manpower temp agency? In 2019/2020 I worked for the temp agency manpower for 3 months before being hired onto the factory they placed me in. I am now trying to fill out my taxes, and cannot complete them until I have the W2s from this temp agency. \n\nI have tried calling the office I originally interviewed at, and am met with phone prompts but no longer have the necessary information needed to get past these blocks. I also tried to call 2 numbers of people who emailed me (one was the regional manager I believe, and one was the manager for the physical location I interviewed at) 1 was disconnected, and the other never called me back.\n\nI then tried the W2s@manpower.com site, which had me call a number which transferred me to an Indian call center, where they proceeded to ask me for my FULL social security number, which I absolutely am not comfortable giving out like that. They could not find me with all the other information I provided them (name, phone number, last 4 of social, and time I was employed there.)\n\nToday I went to the physical place I interviewed at (which was 45 minutes away from where I now live so quite a drive, and my only day off this week) and despite it being 40 minutes before close (closes at 5pm) the whole office was closed.\n\nThis whole thing has just been super unprofessional, and honestly I'm irritated. These W2s are the only thing I need to complete my taxes.\n\nSo....how do I contact someone at Manpower?! I just want to talk to an actual person, not jump through a whole bunch of automated phone prompts! For reference the physical branch is in Eau Claire, Wisconsin, USA. \n\nIs there an email, or a specific combo of phone prompts to push to talk to someone at that branch, or a number for HR or something? I feel I have exhausted all avenues, and seriously need to get my taxes done.",
    "title": "How to contact Manpower temp agency?",
    "subreddit": "jobs",
    "timestamp": 1617832101,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Job offer after 6 months of my last interview 6 months ago i was invited by a tech company for a position as project manager. The interviews went well and they sent me an offer (draft) but their HR legal were not familiar with my type of visa (TN)  the process was delayed and they had to fill the position. (I disclosed from the start that my work authorization was under a TN visa)\n\nA few days back they contacted me again with a new offer (which is attractive)  and they got clearance from their HR legal counsel. \n\nRight now I'm pretty happy were I am, the project I'm working on is winding down and i enjoy the slow rhythm  after a few months of hectic activity at breakneck pace. I'm currently happy with the money make. Just a few weeks I had talks with my manager about my growth path and I have had excellent feedback from our customers (i got a shout out at our quarterly US town hall).\n\nMy employer is a public company operating in multiple countries and its stock has done extremely well in the last few quarters, strong growth, etc. \n\nThe Company that extended the offer is a small private company in the AI/finance ecosystem, that just a few months ago got a 70 - 80 million funding round by a large and well known NY private equity firm.\n\nNow I like where I'm now in my current job, and I felt a little disrespected when they they didn't follow through the first time they send me an offer, though i totally understand their reasons.\n\nCurrent Job: Ok money/benefits,  career growth in the near future.  \n\nJob Offer:  Slightly better money (20% more), stock options. The tech sounds interesting and the company may have crazy growth in the future. \n\nNow, in my current company most of the employees are Indians, in the new company most of the employees are Israelis so there may be some cultural shock at the beginning. (I'm the only mexican in my team but i adapted well to my Indian bosses/coworkers,  I have heard rumors that Israeli work culture is tough )\n\nShould I take the offer ? or should I stay. I'm on the fence.",
    "title": "Job offer after 6 months of my last interview",
    "subreddit": "jobs",
    "timestamp": 1640326137,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "can i sue? I am a temporary worker at a university in the Northeast.  I am the only actual worker bee in the core facility that I wrok in.  There are three directors who manage me.  And they are micromnaging me, and I believe are intent on forcing me out when the hiring freeze (covid) is lifted and they can bring in some one from India at about 1/2 my salary.\n\nSo they (2 out of the 3 managers) are making my life miserable, micromanaging even the smallest details.  Even down to things like Where I place the emergency key for when we might get locked out.  \n\nIf it turns out they decide to fire me, can I sue for unfair employment practices.  I think they would have a hard time finding someone with my skill sets, but if they have someone in mind from India (yes, these managers are Indian), they could make sure that person got hired instead of me.  \n\nHow to proceed?",
    "title": "can i sue?",
    "subreddit": "jobs",
    "timestamp": 1626803270,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "How are nurses treated in different countries? Edit..... Thanks everyone for your contributions, they've made for really interesting reading. Lots of differences but lots of similarities too👍\n\nI'm a Brit and I'm going to be honest here, a lot of what I read here about how nurses are viewed/treated in other countries sounds awful.\n\nThe NHS is a long way from being perfect but it does a good job of protecting its employees from abuse/bullying employees. It doesn't matter if you're a housekeeper or the senior clinician in a huge hospital. If your behaviour falls short of accepted standards then you're probably in serious trouble. Shouting at someone can easily lead to you losing your job. \n\nYup, we get ungrateful and potentially nasty patients from time to time. Abuse the staff physically and they will probably be declined access in the future.\n\nPaid holidays?  There are slight variations depending on the length of time served but as a nurse approaching retirement age I get 6 weeks plus 8 days of public holidays.\n\nPay? Hmmm... I think you do *much* better in the States.\nIn a 'basic' month (no overtime, no nights/weekends) I probably take home £2200 after all deductions. With a bit of overtime that will be much closer to 3k. It's very difficult for newly qualified nurses to get a mortgage to become home-owners unless they regularly commit to a lot of overtime. Most will have to rent for a considerable time before they can afford a house deposit if they're by themselves.\n\nHours.... Full time here is 37.5 hours.\n\nPension... A subject close to my heart currently 😊. Most NHS employees don't bother arranging a separate privately held pension as the NHS provision is excellent. Basically, after 40 years of service you should expect to retire and receive  half of your normal salary, paid for life (and a one-off lump sum of between three and five times your annual pension)\n\nLiability insurance costs most nurses about £25-30 a month which also covers membership of a union.\n\nProfessional membership of the Nursing and Midwifery Council (NMC) is about £10 per month and is compulsory if you wish to practice as a nurse.\n\nQualifications.. Nursing in the UK is entered through a three year degree course and throughout your career you are obligated to provide evidence of ongoing education that is relevant to your scope of practice. This isn't as difficult as it sounds and most nurses manage their formal revalidation every three years with no issue (and at no financial cost to themselves)\n\nUniforms are always provided to NHS employees. In fact, you're not usually allowed to buy your own.\n\nRespect? During the height of the first COVID wave the public stood in their doorways at 8pm every Thursday for 8 weeks and applauded care workers. The first time I was at home to witness this I cried like a baby. My entire neighbourhood was out.\n\nVacancies? I don't know a single out of work nurse. Plenty of vacant nurses posts over here. We actively recruit overseas all the time. I'm amazed the Philippines has any nurses left!  We're currently employing lots of Indian nurses too. It's great to be working in such a melting of cultures.\n\n\nI'm genuinely interested in people's comments about how aspects of their experience of nursing differ to my own.\n\nI'm Simon, 54 years old and always worked in the OR as a scrub nurse. Been  team leader for bariatrics and colo-rectal surgery for the last 10 years or so.",
    "title": "How are nurses treated in different countries?",
    "subreddit": "nursing",
    "timestamp": 1620801117,
    "score": 12,
    "keyword": "indian manager"
  },
  {
    "text": "Rant! Should I quit? I work in a non public First Nation (Indian) school in Canada.  It has some great perks (class sizes under 10, etc), but I feel I'm being treated with so much disrespect I feel like quitting.\n\nThe educational director decided we needed a \"team building\" weekend in two weeks.   Weekend at a resort, free spa treatments.   Very nice.\n\nBut we are carpooling.  (It is 4 hours away) One member of my carpool told the rest of us that she is in charge.  She will drive, decide when we leave, where we eat, when we return.  This teacher is personal friends with the principal (but refuses to associate with the rest of the teachers).\n\nI sent a brief email to the education director asking if the person who is the self appointed driver can make up all these rules.  Maybe I should have asked the principal, but the Ed director is organizing it and I know the principal would side with his friend.\n\nThe Ed director emailed me back saying that no one person can be in charge and we need to discuss this.   Within the hour, the principal comes to my room and starts yelling at me that I was unprofessional to ask the Ed director questions when he is my boss.  I proceeded to ask him how to proceed with the teacher that insist she makes the rules.\n\nHis response \"you don't get to make choices.  We make choices where you will eat and what you will do.   You don't get to choose McDonald's \"  (I am a 6 ft, 300 lbs guy).\n\nAm I right to be SUPER annoyed at this?  Like feeling i want to quit?  There are hundreds of teaching jobs, why should I work for someone who wants to insult and yell at his staff?\n\nEDIT:  so my principal dropped in and observed my class unofficially yesterday.  We were doing a Lumio review (if you know what that is) when one of the kids turned to the principal and started talking about what they were learning (how the government t had banned the Potlatch).  Great I thought, engaging with the material.\n\nNot according to the principal.   I arrive today to have a written warning that my classroom management skills need to be improved because a student talked during a lesson and I didn't correct him.",
    "title": "Rant! Should I quit?",
    "subreddit": "Teachers",
    "timestamp": 1636604559,
    "score": 23,
    "keyword": "indian manager"
  },
  {
    "text": "At my whits end. Need advice Hey Reddit. i rarely get on Reddit anymore but i dont know where to turn to anymore. I need to vent and ask advice. I (30) am in my 6th year of teaching in the middle school/Upper Elementary level in AZ. I've come to the realization that i hate it. I didnt always but these last few months have really made me reconsider if i want to be a teacher anymore. I've taught exclusively on Indian reservations and I moved this year to be closer to family. My new school is really not working for me. I really thought it'd be better than it is but i absolutely HATE going to work everyday. It was never this bad for me even in my first year teaching. I feel absolutely unfulfilled.\n\nThere was a time where i had excellent relationships with my students, their families, and colleagues. I liked my job. I liked teaching, coaching, hosting clubs etc and all this was on another reservation with a whole host of their own problems. I feel like i made a mistake leaving it and now i cant ever go back (other reasons). And while few of them were superstars academically, i never felt like i was a complete failure because we had a great Teacher/Student relationship that was about more than just grades (after my first year) but even this was hard won and I honestly feel like i just got lucky with a great group. So great that i looped up with them for 3 years. Was it always sunshine and rainbows? Absolutely not.\n\nNo amount of SEL strategies or management have worked for me with a particular groups of kids. In reality, 75% of my class is fine behavior wise. Its that other 25% that bugs me. They know they bug me. They do it on purpose. they dont care. i cant bring myself to let their disrespect not bug me without just throwing up my hands and walking out of the school. I honestly feel like that some days. I my issue with the kids? With my lack of confidence in the admin and the disciplinary practices in this district? Is it myself and something i need to do differently? IDK. I can only be told horrible things by petulant children who rule the roost at home and have zero respect or discipline so many times before i just want to wash my hands of them, this job, this career. I sought help from counselors and admin but if i talk to three different people, they will all tell me 3 different things even if we're all in the room together.\n\nI'm tired of the bad kids. I'm tired of teaching lower grade topics in an upper grade classroom to students who will half a\\*\\* the work then cry about it. I'm tired of feeling like the behavioral routine just ends with a slap on the wrist or a stern warning. I'm tired of 70% of my students having 0 motivation to improve themselves.  Im. so. tired.\n\nAnyone else who's worked on reservation have any insight or similar feelings or experience? Do i move to a non-rez school and see if it's different? Do i just chalk it up and move on to a new career? I was accepted to law school a few years ago. Should i do that or is it too late for me? I'd rather go back to construction than risk having another year dealing with such awful behaviors anymore. Suck it up and give it a year?",
    "title": "At my whits end. Need advice",
    "subreddit": "Teachers",
    "timestamp": 1615270620,
    "score": 5,
    "keyword": "indian manager"
  },
  {
    "text": "Should I break my contract? I'll make this quick, but I need unbiased advice. I'm a first year art teacher working a k-8 position. I love a lot of things about my job, for example, how easy lesson planning is at my current school, my co-worker(another at teacher), and my admin isn't to bad, but I don't really connect with my students culturally and I'm not as interested in the content I teach. I worked for 7 years as an illustrator and a fine artist and I find a lot of projects we do at this level boring. The school I'm teaching at is an upper class white school and the subtle homophobia and racism I experience on a daily basis feels draining. I'm white passing(mixed) and I look straight and my students don't know I'm gay and most assume I'm white. I can't comment on anything they say without fear of patents or repercussions from my administration, and I'm terrified of parents finding my marriage announcement on social media. A majority of the parents are involved in the PTA and are very involved in their children's education. My school's culture is conservative, Christian, and upper class, and my co-workers and admin reflect this demographic. I often find myself lying about my personal life to protect myself.\n\nI recently got a message from one of my mentors that her high school is looking to hire another art teacher and her principle wants me back as a teacher. The admin at this school is not as kind,  classroom management is harder, and the population is title 1 and needs more TLC, but I love the content I would be teaching at this school, and I connected better with the student population. I grew up in foster care and I saw myself in my students. Sometimes it felt like I was teaching to a mirror because the way my students acted and behaved reminded me so much of myself and my friends. I can say I genuinely loved my students at this school. The principle at this school wants to offer me 3,000 more to teach than what I'm making now. I currently make 45,600 and I would be making 48,800 with the opportunity to get promotions and move up the pay scale when I get my masters degree. \n\nShould I break my contract and jump? Or stay at my current school? \n\nAlso, I've never broken and a contract before and could use some guidance on that topic as well.\n\nSorry for spelling errors I'm on mobile.\n\nEdit: Thank you for the advice. I appreciate everyone helping me and I'll post an update in the summer. I feel a lot more prepared than I did before and I'm going to let the other principle know that I'd like to to teach at the high school.\n\n I also had a pm asking me for more information regarding some of the homophobia and racism in my school. Inside and outside of my classroom I've heard students and co-workers use slurs or make fun of trans people. I've also had kids in my classroom discuss what their parents would do if they had a trans teacher( get them fired/harass them). I've had to deal with a lot of racism and it would be a long post if I listed everything, but yesterday for example I had a co-worker sarcastically ask me why \"Indians\" drank so much because she hated teaching kids with fasds at her last school. She doesn't know I'm Indigenous and is my team lead. I made the mistake of speaking up earlier in the year and was excluded from team activities and emails, even professional emails for proctoring and 504/IEP meetings. I've also gotten mean texts. I haven't felt like I could talk to anyone about this in my real life, so it feels nice to get this off my chest. Thank you everyone.",
    "title": "Should I break my contract?",
    "subreddit": "Teachers",
    "timestamp": 1621719079,
    "score": 7,
    "keyword": "indian manager"
  },
  {
    "text": "Career guidance for someone who has had a 2 year gap (with no work ex/skills) after Bachelors in Engineering? As embarrassing as this would sound, it took 6 years (instead of 4) to complete my engineering because of backlogs and my apathy towards the course which I ironically enrolled for (Electronics and communication).\n\nTo top it off, I have now had a 2 year gap on top of this already 6 year long degree, in which I've learnt nothing of relevance or worked anywhere. To be brutally honest this has been a result of of mix between a lot of familial problems and procrastination/apathy towards the situation from my side, I have no point in hiding that fact at this point in my life.\n\nThere's no doubt that I acknowledge the fact that these roadblocks will prove to be a struggle to deal with if I intended to begin a career afresh from scratch, especially at 26 with no experience whatsoever.\n\nBut come as late as it may have, I really want to put the past behind me right now. I really don't want these roadblocks to bog me down in my endeavors which I put in beginning from NOW. Right now I feel like I have the zeal to work my socks off and excel in whatever I want to pursue in life beginning from this moment.\n\nThe only issue I face is the lack of a proper career guidance given the context of where I am in my life right now. I pretty much don't have any friends/relatives who I can interact with on this nor do I have access to career counsellors where I live.\n\nI have been vacillating between management and software fields, not really certain would be a better path. At this point, to me it's more than where I can excel in than what I specifically find interesting, don't think I have the luxury to that at this stage.\n\nGiven the context of my background and with me being 26 right now, what should be the field I should be picking so as to still excel in making a career moving forward?\n\nI would really appreciate it even more if someone could guide me on this with context to Indian job industry or any advice in general would be appreciated too.",
    "title": "Career guidance for someone who has had a 2 year gap (with no work ex/skills) after Bachelors in Engineering?",
    "subreddit": "careerguidance",
    "timestamp": 1638167004,
    "score": 9,
    "keyword": "indian manager"
  },
  {
    "text": "I don't like the career path I'm on. What else can I do instead of having to start at the beginning? Indian here for context. I was forced into computer science and hated every second of it. I managed to change paths into training and recruitment and eventually got a degree in human resources and management. Due to the lack of jobs the year I graduated (I graduated in Italy ) I ended up in data science. It's fun and all but my manager is, in a word, toxic. \nI want to change jobs but I feel and possibly am underqualified for every data science job out there. \n\nI don't know what I can do to get a job I like and get paid a decent salary. I'm willing to move out of EU to Canada or America or even back to India but I'm lost as to what to do next, in terms of career paths. \n\nI enjoy writing, I enjoy designing games, I am really good with data visualization and tools related to them. I code ok but I'm not happy when I do it. \n\nI might need some career guidance. Please and thank you.",
    "title": "I don't like the career path I'm on. What else can I do instead of having to start at the beginning?",
    "subreddit": "careerguidance",
    "timestamp": 1625334213,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "Is it worth quitting my job because I'm unhappy and want to focus on school? I've been working with my employer for going on 3 years now, and I'm starting to absolutely hate the job. The management does not communicate with us about anything, the work we do is boring and repetitive (Digital Content Moderation), and the company that we are contracted for is honestly the shadiest business (I can't say who because I'm under NDA). I'm going to school for Political Science, and working on my Teacher Certification. I live at home, have minimal bills outside car, insurance, phone. I've been keeping up with my Roth IRA for about a year now.\n\nWhen talking about the job, it's aggravating. It deals with political ads, and when I took the job, I thought I would maybe learn something about political campaigning, while getting paid well. Well, three years later and I'm not supposed to know who my own mayor is, but I need to know who the mayor of Manila is. There was even a time that we were supposed to reference Indian political party flags, but not allowed to know what the state flags are, without \"proper context\". This also just the surface of it. I haven't even talked about the shitty management there, which I could write a whole book on.\n\nPlus, I'm gonna end up needing to quit this job next spring anyway, so I can do my clinical teaching.\n\nIs it worth quitting the job, working part time, focusing more on school? I feel like I know the answer (yes as long as I can pay the bills), but is it worth it if I need to lower my IRA contribution to do it? Personally, I want to enjoy school more, but it's hard to when my job stresses me out, I work the same days as classes, and work till 10 every night.\n\nTL;DR: Is it worth quitting my job and making less, if it means I'll be happier and can focus on school? Need some reddit wisdom.",
    "title": "Is it worth quitting my job because I'm unhappy and want to focus on school?",
    "subreddit": "careerguidance",
    "timestamp": 1614140622,
    "score": 1,
    "keyword": "indian manager"
  },
  {
    "text": "How much will it screw up my career to job hop for a second time I’ve got a weird situation. \n\nI’m 22, and I graduated in December 2020 from a rural college in a town with no tech sphere. I took the first offer I got, which was with GM. They baited and switched me into data entry with effectively no hope of becoming a real software dev, so I bounced quick. I plan to not even include this job on my resume. \n\nI then started a job as a software developer for a pretty low salary ($54k, Charlotte NC) to GTFO of GM. I’ve been here 6 months now. This company only works in contracts and outsourcing; we have no product of our own. They promised me I’d learn so much here, but they have me on only one project that takes like 10 minutes of work a day, and I’ve written only like 4 SQL queries in my entire time here. I mostly do QA. The company was just bought by a massive Indian multinational that gives me WITCH/H1b scam vibes. Manager won’t give me any more responsibilities and I’m only learning what I teach myself with all my downtime. My manager is not a pleasant person and the workplace is a bit racist. High turnover after one year. \n\nI’m getting attention from recruiters on LinkedIn for positions that pay 60% more at minimum. Would it destroy my career to bounce a second time, particularly if I leave GM off the resume? I will explain why I’m leaving by saying something diplomatic like “I have a continuous desire to learn.”",
    "title": "How much will it screw up my career to job hop for a second time",
    "subreddit": "cscareerquestions",
    "timestamp": 1637096842,
    "score": 121,
    "keyword": "indian manager"
  },
  {
    "text": "My Experience as an Associate Analyst with Infosys I know this will be helpful to some people since I had questions when I first joined Infosys. \n\n**BACKGROUND**: recent Berkeley liberal arts grad self taught in C# and Python.\n\n**APPLICATION**: I applied online for the associate analyst position and a recruiter reached out to me the next day. I had an online interview within two weeks. This was early 2020 before Covid.\n\n**INTERVIEW:** My interviewer had a very thick Indian accent. As he joined the call I heard \"what should I even ask him?\". Maybe my interviewer was new? He asked me to summarize my resume, asked if I knew how to code, and then asked some generic behavioral questions. Zero coding problems. That was it. Maybe I got lucky? According to some coworkers they had coding problems so experiences will vary. \n\n**SALARY:** I was slated to start in March 2020 but obviously Covid happened. My hiring date was pushed to Oct 2020 and I eagerly accepted since jobs were scarce. My starting pay was 57k with a 4k bonus that you have to return if you leave within a year.\n\n**TRAINING**: Infosys sends you an outdated Dell laptop. Some people in my cohort received broken laptops that couldn't even bootup. Everything was remote. \n\nThey hired Trinity College to teach us business analyst methodologies such as scrum and agile processes. They also trained us on how to effectively research data and present Powerpoints. The whole process was online and was a month long of team exercises. The trainers were great people and they really try their best to support you. \n\n**WORK:** The vast majority of my cohort were benched (had zero projects). We sat around and still got paid which was great but if you are trying to advance your career this is likely a dead end position. \n\nThere are occasional trainings that are assigned for upcoming potential projects. Our training was heavily dependent on what Infosys needed at the time. If they needed more Java developers they'll assign Java courses. If they need Appian developers (half my cohort) they will assign Appian training. \n\nDespite this most of my cohort was not placed for almost a year now. Most of my time with Infosys is just checking emails for 5 minutes a day and submitting my 40 hour time sheet (which is mandatory) at the end of the week. I basically did nothing. It was a very long paid vacation filled with uncertainty of whether you will be placed on a project or not. \n\nThose who did get placed got recognizable names such as Apple, Wells Fargo, and so on. But getting placed is rare... I've even asked my manager many times for a project and he just kept telling me to wait. Well it's almost been a year now and I'm just sitting around collecting checks.\n\n**VERDICT:** I would not recommend Infosys if you can find a better job. Sure it's great that they pay you when benched but for those of us trying to advance our careers we have nothing to show for it. I advise those who are benched to start your own personal projects. As I am writing this I counted roughly a hundred analysts benched on our email list. Infosys really has a lot of cash to give away.\n\nI've since found a better position that I am starting soon so thank heavens. Regardless, I am grateful Infosys hired me but I cannot recommend them to anyone unless you like uncertainty. However, a job is a job if you can't find anything else. \n\n**TLDR:** Infosys will pay you to do nothing and you are better off working for another company if possible.",
    "title": "My Experience as an Associate Analyst with Infosys",
    "subreddit": "cscareerquestions",
    "timestamp": 1628113535,
    "score": 35,
    "keyword": "indian manager"
  },
  {
    "text": "Quitting a Company within 7 Months Because I am not getting along with the team. So I recently joined a company as a Senior Software Engineer for an Indian Based MNC in Bangalore.\n\nFrom day 1 the experience has been awful.\n\nLet me give the gist of things\n\n1 - NO KT (Knowledge Transfer )\n\n2 - No Proper introduction to Colleagues or Team\n\n3 - Initially I was told I will be assigned a buddy who will help me for the first 6 Months as I become accustomed to the Company and the team. I was assigned a buddy for a week who basically setup VPN and got me my credentials for AWS and other stuff\n\n4 - My first work was a complex task which nobody had worked with. In fact, looking at my PR the design requirements would change and I would be blamed for not planning this ahead.( I did not know how the application I am building would be used. )\n\n5 - Incomplete Work Assignments\n\n6 - my Work would constantly be reassigned without my Knowledge\n\n7 - Non-Technical Manager\n\n8 - My  Manager yelled at me on call when another colleague was present.\n\nI feel I have taken enough and burn out. I have lost interest in work. Initially, I was okay not having anybody to help me get accustomed to the team as figuring things out by myself would be beneficial in the long term.\n\nWhat got me disinterested is the constant reassignment of my work without informing me and not having any colleagues whom I can actively approach when I am in a pinch.\n\nAlso, My 6-month performance came in and I was told I am underperforming.\n\n&#x200B;\n\nOther factors to consider\n\n1 - remote job -\n\n2 - I have 3 years of experience. So I am not a seasoned Software Engineer. maybe if I had more experience I would do a quicker job I guess\n\n3 - I expected I would be joining a team that is friendly as they seemed friendly in the Interview\n\n&#x200B;\n\nFeel Free to point out my mistakes. I am looking at this as a learning opportunity.\n\nAlso, If I can make any changes to improve my relationship with the team It would help as I really don't want to skip jobs this quick\n\nAny Advice is appreciated",
    "title": "Quitting a Company within 7 Months Because I am not getting along with the team.",
    "subreddit": "cscareerquestions",
    "timestamp": 1632204143,
    "score": 23,
    "keyword": "indian manager"
  },
  {
    "text": "Unemployed and filled with apathy This is a vent.  I needed to communicate this to someone or some group.\n\nI graduated August 2020.  I had a part time TA job that ended shortly thereafter.  My thesis project was basically a remote software developer internship, but not technically.  I thought an undergrad in computer science, plus a relatively practical thesis, plus a former career (ie, I have soft skills) would've been enough to get plenty of responses from companies.  It hasn't come close.    \n\n\nSome opportunities evaporated because of COVID. I got far for a data analyst role out-of-state, but I never heard back after I submitted a form that asked for salary expectations ($70-$80k was the range I inputted. learned a lesson there, and that's to ask what the budget is for the position during the first interview.)  I was recently approached about another data analyst role in NY (again, out-of-state) that was paying 52k - yeah, no thanks.  The Indian bodyshops contacted me several times already, but I ignored those messages based on what I read on this subreddit.  Recruiters asked for my resume for several software developer roles after saying I'd be a good fit, but I never hear back.  A few others tried to entice me with business analyst positions with little to no technical skill-set required.  Why would I go back to school to get a technical degree to work in a non-technical position?  \n\n\nI've applied to about 140-150 companies either directly or indirectly (sending resume to recruiter who reached out on LinkedIn).  I tailor my resume and cover letter for most of those applications, which ranged from software engineer to technical business analyst.  I reached out to a few contacts, including friends of my parents and siblings.  Several of these contacts (including a technical recruiter) helped a lot in refining my resume.  But I don't think it'll be enough.  \n\n\nI completed several toy apps before I went back to university for a CS degree.  Since graduating, all I have to show for it is a login and registration portal with Java, Spring Boot and SQL.  The plan was to build something I find interesting, but I lost interest.  Perhaps it's because of the tech stack.  Perhaps the lack of positive feedback from the job hunt is weighing me down.  My lack of job hunting success is probably part resume (now fixed) but probably also lack of a sophisticated portfolio to show hiring managers.  Some on this subreddit might respond with, \"Build a web app with Node and React!\".  I enjoyed most of the CS classes, debugging, programming, etc, but I'm filled with a sense of apathy after all these months.  I'm not sure where to go from here.",
    "title": "Unemployed and filled with apathy",
    "subreddit": "cscareerquestions",
    "timestamp": 1617679291,
    "score": 25,
    "keyword": "indian manager"
  },
  {
    "text": "Manager threatening me about consequences This is an Indian company.\n\nI am about to switch jobs now. I got a new offer where I’ve told them that I’ll be joining right after a month. On the same day of offer, I handed over my resignation which is 15 days ago, to my manager and concerned authorities also stating my last day of work. In my current company, I have an option of 1 month buyout where usual notice period is of 2 months. He hasn’t replied me personally or on mail yet until today suddenly out of nowhere he showed up and said that he’ll not relieve me as I’ve not asked from him regarding the last working day during resignation. I pointed him out that I had already mentioned at the end of mail “Please feel free to let me know if there’s anything else I can aid…”. He got furious and said again that was my fault that I didn’t ask him. When I said that I won’t work If you force me to stay after my last day, he replied that he might take “disciplinary/legal action”against me If I do this. I’ve gone through the clauses stated in the appointment letter but nowhere I could find that my manager would be able to hold me from relieving. \n\nMy question is - Will I be able to get through this and get out legally by the last working day I had mentioned in the mail, and what happens If he doesn’t relieve me by last day and what options do I have in that case?\n\nFellow redditors, please help me out here If you can. Thanks in advance.",
    "title": "Manager threatening me about consequences",
    "subreddit": "cscareerquestions",
    "timestamp": 1633968363,
    "score": 12,
    "keyword": "indian manager"
  },
  {
    "text": "Associate SWE - imposter syndrome help (Onboarding issues?) I'm based in USA and the company is a large retail, I'm on the backend web dev team.\n\nI recently graduated in May and finally landed a job, I have some freelance experience but no industry experience so I hope they aren't expecting that much of me or if I'll get booted or anything. I just started this past Monday. My manager seems nice and friendly however I only had a 1:1 with him for about 10 minutes because he wanted me to join this other company meeting for new hires.\n\nI was given about 10 hours worth of videos that are recordings from earlier this year where the team explains how the system works and gives the overview to two other new hires (or new to the team). The issues I'm having is, it's taking me longer to go through the videos because they all have thick Indian accents, also the new hires are asking complex questions I have no idea about.\n\nI don't know the expectation of me from these videos but I'm watching through them, I'm supposed to be introduced to the team next week.",
    "title": "Associate SWE - imposter syndrome help (Onboarding issues?)",
    "subreddit": "cscareerquestions",
    "timestamp": 1635346123,
    "score": 7,
    "keyword": "indian manager"
  },
  {
    "text": "What should my expectations be when working with an offshore team? I’m the lead backend developer at our company. I’m over two junior Devs, and have one off-shore engineer who is an absolute gem of a developer. Writes good, clean code, always gets stuff done in time, is proactive about problem solving, etc. I can basically tell him, “Hey, here’s the problem/what isn’t working,” and 2 days later he’ll come back with a solution, fully ready to implement, tests written, etc. \n\nWell, recently our CEO decided we needed to go faster and (against my advice and the advice of our VP of Engineering), decided to hire an offshore team in India to help us “go faster.”\n\nI’ve never worked with an Indian team, and as I said, my one off-shore dev absolutely spoils me.\n\nAnyway, we were assured that the 3 devs we’d be getting had at LEAST 6-8 years of experience in our tech stack. I assigned them some fairly straightforward tickets (things I would have given my junior devs), including where in the codebase the solutions should be implemented, etc. Basically wrote the whole thing is pseudo-code, so they just had to write it in actual code. Had my VP of engineering go over the tickets for a second pair of eyes because honestly I hate this sort of management and work and I just want to be building things myself. \n\nANYWAY, after a week and a half, I finally got some code back from them, and about 80% of it is pure trash. Either because it wasn’t to our specs, it just straight up won’t work, or many other reasons. Like, my juniors give higher quality work than what was submitted, and in about 1/4 the time. \n\nSo my question is, what is a reasonable expectation for an offshore team? Is this a culture thing for Indian devs where they won’t ask any questions? \n\nI tell them every day on slack that I’m available for any clarifications or to help with anything, and the most I’ve gotten is either “no questions, everything is clear!” Or questions about reading a stack trace error they didn’t understand (something else super frustrating. Shouldn’t a “senior” dev be able to read a stack trace and see a typo or syntax error?). \n\nIf they fail to deliver, I’m pretty sure my CEO will blame it on me. But at this point, it’d be 1000% cheaper and faster to just write it all myself.",
    "title": "What should my expectations be when working with an offshore team?",
    "subreddit": "cscareerquestions",
    "timestamp": 1628464266,
    "score": 6,
    "keyword": "indian manager"
  },
  {
    "text": "Sticking it out in a \"low-code\" environment under a struggling company? Hey CSCQ, a little bit of background of where I'm at. I took a job with the company I interned with back in Summer 2019. The position began in last October and started out with a 6-week training program. The training program was sort of a coding \"bootcamp\" where we were asked to develop a web app in 6 weeks along with other new hires. However, your placement was ultimately decided by a \"placement algorithm\" determined by both the managers and new hires' choices. Essentially, new hires were asked to select a few managers they wouldn't mind working for, managers were asked to select a few new hires they think are a good fit for the position, then the algorithm sorts you into placements based off what the algorithm says.\n\nI'm not being fully charitable to the process, but the end result was that I was placed with a manager under a position with a sub-company, a position I did not think would be a good fit for me. I did not think it would be a good fit because 1) the work was being done with the sub-company's own \"low-code\" dev environment, which is really just a rather unwieldy drag-and-drop with source control and 2) the manager seemed impersonal and distant from his presentation during the training program, which was confirmed when a re-organization happened 3 weeks in and I was assigned a new manager. Also, the sub-company had some startling awful Glassdoor reviews; I understand Glassdoor has a strong selection bias but the veracity, frequency, and timing of the negative reviews in comparison to the scant positive reviews indicated a heavily disorganized and struggling company. This worry too was also confirmed by the town halls I've attended since I've been in the position; obviously the company tries its hardest to paint a positive picture but there is a persistent problem that our clients range from neutral to unhappy with our product and that we have not scaled anywhere near the investors' expectations.\n\nI give all that information to say is it worth sticking it out in this position, or should I just up and leave? I understand the standard advice is always to never leave without another offer lined up, but I struggle even keeping up with the bare minimum since clearing even small stories requires a lot of hand-holding and 1-on-1s with my Indian coworkers who aren't always available during my work hours. I've had some bite from other companies but far less than I would've liked, but do have some familial and networking strings to pull on still. I'm not a career idealist, even being thrown in a CRUD dev position plugging away at tickets, like my internship was, would be preferable to this. Financially, I'm still single living with my parents with only ~$22k left in student loan debt and no monthly expenses, with potentially less debt depending on the Biden administration.\n\n\nTL;DR - Stick it out and wait for offers in a floundering company where I struggle to do the bare minimum, or up and leave to try and find a more bearable position elsewhere?",
    "title": "Sticking it out in a \"low-code\" environment under a struggling company?",
    "subreddit": "cscareerquestions",
    "timestamp": 1610490912,
    "score": 3,
    "keyword": "indian manager"
  },
  {
    "text": "Being fully honest with managers in corporations I always believed that being 100% honest is not a good idea, especially when dealing with people that we are not very close to (real friends/family..), because people get easily offended.  \n\n\nI work for a Bank in Europe as a developer, and yesterday I had a feedback meeting with my manager, and he said that some team members (like the Scrum master, Analyst) said that my technical skills are good, I'm active and I do all the work assigned to me, but the problem is that I'm not proactive enough, especially when it comes to dealing incidents and bugs reported by QA team. The truth is that I'm totally aware of what I'm doing, because I find the context very demotivating and I can't wait to start working for another client (I work for a consulting company). \n\nSo I only finish to sprint tasks/stories assigned to me, and I don't look beyond that, but this manager (who is Indian, works as internal in the Bank) and the other team members expect me to perform like the other external Indians, taking the initiative to work on this that are not asked from me (like a tester developing an automated API testing tool, while no one asked him to do it and it's not part of our planning), or jump on the first incident that happens, while it should be first investigated by the analysts because they know more about the business.  \n\n\nSo during that meeting, I bullshitted my way out of it, saying to the manager that he's right and I should try to be more proactive etc, while deep down, I could have told him that the context is very demotivating, the code is garbage, there are no technical evolution in what I'm doing, there's no way I'm working +10 hours like your fellow Indians and doing things no one asked me to do.\n\nknowing that my days with this client are limited, none of this matters anyway, but I want to know the opinion the people here who have more experience with the corporate culture. let's suppose that that I wanted to stay with this client, did I do the right choice by bullshitting the manager ? or if I tried to be a little bit honest, will that change anything ?",
    "title": "Being fully honest with managers in corporations",
    "subreddit": "cscareerquestions",
    "timestamp": 1630144691,
    "score": 2,
    "keyword": "indian manager"
  },
  {
    "text": "I don’t like being asked where I’m from if you don’t know me. Is it rude to tell a client I’m not going to answer that while at a big 4 firm or can I face repercussions? There’s a certain kind of person who has to always ask someone where they are from within the first few minutes of meeting them. I’m of this Earth from what I understand, from the depth of my mother’s vagina. I’m the biproduct of two human beings having a good time, human beings who due to genetic imperfections and no 100% transfer of alike genes along with the introduction of new combinations along with the passage of time resulting in this process occurring over the course of dozens of generations might as a whole have different inclinations or different appearances than another human being, different from the first human on the planet. Amalgamated with the leveraging of consciousness - something no one can define in a contained complete manner - and genetic variances that the very first human already had within them and thus within all of us, we oft look different and have inclinations towards making different mouth movements to communicate, but we all have a little of all of these variances in all of us. So I don’t define myself by the lines colonial Britain drew some 100 years ago. \n\nIf you don’t know me and you ask my ethnicity within the first 5 minutes of meeting me I don’t think your head is in the right place, as a human, and neither is mine but that’s a different topic. Until unless you want to gain an understanding of who I am by forming characterizations of my being based on within which contained lines I was born then why the fuck are you asking and so hell bent on it? I’ve had complete strangers be really pushy on this. One instance that comes to mind was this guy of Indian background ask me when I used to work at a hardware store. .. “where are you from” “Canada.” “No but where?” “Canada” “where are your parents from.” “Their mind, their body, their spirit, the spark that allowed them to begin their creation, I don’t know.” “What country are they from.” This was a real conversation. Eventually dude fucked off. As a customer who I will load 10x4s for in your car me answering where I’m from\nby the characteristics you define is not that important. \n\nI find that some clients take advantage of the fact that we are expected to be super nice to them. Last week I had a call with a controller to send a tb, and the guy interrogated the heck out of me - how long do ppl stay, number of years to manager, number of employees in Canada, (like he’d never heard of big4 before lol) ethniticy. Why do you need to know the ethnicity of a guy you’ll never meet who you’re talking to on the phone? Is it an appropriate response to just say “from the Earth” or talk about how it’s a bogus concept anyway because of genetic variations, inclinations, and not defining ourselves with such a limited concept?\n\nWhether my thought process is right or wrong this question always irks me until unless I know you very well. I don’t want to answer it.",
    "title": "I don’t like being asked where I’m from if you don’t know me. Is it rude to tell a client I’m not going to answer that while at a big 4 firm or can I face repercussions?",
    "subreddit": "Accounting",
    "timestamp": 1612051471,
    "score": 0,
    "keyword": "indian manager"
  },
  {
    "text": "How to earn and establish more respect in the workplace? I’ve been at my job for about a year now. It’s a global company and my team itself is pretty small— there’s program managers, developers and then there’s me, the marketing person. The team is mixed racially (Hispanic, Indian, a couple of yt men, etc), but it’s all men. I’ve noticed, while battling imposter syndrome already, they tend to treat me like a secretary or like someone they have to “tell” what to do even though I speak for myself. I’ve tried being the friendly one to progeny being labeled the Angry Black Woman, especially when I’ve had to deal with pushback or being steamrolled. This is clearly a Good Ole Boys environment, and sometimes my own manager will overlook me or the disrespect unless I point it out to him.\n\nAnd yes, this is not the best but we’re in a panorama and I want to at least be able to have a couple of years here for my resume and for other goals I’d like to achieve. \n\nAny advice when trying to establish more professional respect? Any good phrases to professionally say “I’m not playing with you” and to deal with being steamrolled in a non passive aggressive way?",
    "title": "How to earn and establish more respect in the workplace?",
    "subreddit": "blackladies",
    "timestamp": 1616511625,
    "score": 23,
    "keyword": "indian manager"
  },
  {
    "text": "American Indian Music Artist? I just realized I don't know any American Indian music artists and when I google it I just get Native American music. I'm manage my uni's Asian American Association and wanted to get an Asian American playlist, but all the artists on the spotify playlists are all of east asian descent. \n\nI'm of HK lineage but it's always pissed me off when people would tell my Indian friends they're not Asian American. It's obvious that my American Indians feel excluded and I want to change that.",
    "title": "American Indian Music Artist?",
    "subreddit": "asianamerican",
    "timestamp": 1630443902,
    "score": 7,
    "keyword": "indian manager"
  },
  {
    "text": "Discrimination against Indian men in Western countris Hey Redditors,\n\nI am not Indian myself, however some friends of mine and aquaintances have described that they feel that the women have been specifically targetting them due to large amount of media surrounding rape allegations in India which is reported in the media.\n\nThey explained that there are issues in India in low educated areas, however this is a small proportion of the country concentrated in the south indian regions. India is obviously a vast country with many races. These areas do not at all represented the major cities and other developed educated areas. This being said the media will tend to publish as though it is widespread in India aswell exaggerating the actual incidents prior to any convictions causing stereotyping of Indian men.\n\nThey have been experiencing that white women (not Asians) in Australia tend to discriminate against them in their work places with one describing a situation where even their strata manager had not attended to a complaint they made within the building that they rent appropriately.\n\nTo the Indian men out there, is this something you have personally experienced?",
    "title": "Discrimination against Indian men in Western countris",
    "subreddit": "MensRights",
    "timestamp": 1637129634,
    "score": 37,
    "keyword": "indian manager"
  }
]