[
  {
    "text": "why are American Indians not known for their success while Indian Americans (from India) are known for math skills and becoming CEO's of the best companies?",
    "title": "why are American Indians not known for their success while Indian Americans (from India) are known for math skills and becoming CEO's of the best companies?",
    "subreddit": "AskReddit",
    "timestamp": 1511731066,
    "score": 1,
    "keyword": "indian ceo"
  },
  {
    "text": "Upcoming AMA Announcement: Vivek Ravisankar, CEO and Co-founder of HackerRank, Wednesday 08/30! Thanks to the help of the reddit admin team and the fine folks over at HackerRank, we will have Vivek Ravisankar, CEO and Co-founder of HackerRank, here with us next **Wednesday, August 30th at 4pm PDT** for an AMA. The AMA will be posted ahead of time to collect questions. This is a verified that has been arranged with the HackerRank team, and you can see proof [here](https://twitter.com/rvivek/status/900431952133595136) on Twitter.\n\n**About [Vivek Ravisankar](https://www.linkedin.com/in/vivekravisankar/), CEO and Co-founder of HackerRank:**\n\nAfter graduating from NIT in India, Ravisankar worked as a software engineer at Amazon, where he spent hundreds of hours interviewing other developers. To help bring efficiency and standardization to the technical hiring process, he cofounded HackerRank, the first Indian startup to graduate from Y-Combinator.\n\n**Thought leadership:**\n\n* TechCrunch: [Unlocking Trapped Engineers](https://techcrunch.com/2016/01/12/unlocking-trapped-engineers/)\n* Forbes: [The Immutability of Math & How Almost Everything Else will Change](https://www.forbes.com/sites/vivekravisankar/2016/05/31/the-immutability-of-math-and-how-almost-everything-else-will-pass/#47ae6d4e7871)\n* Forbes: [Blockchain & the Decentralization of CS Education](https://www.forbes.com/sites/vivekravisankar/2015/11/01/blockchain-the-decentralization-of-cs-education/#48df1e2344be)",
    "title": "Upcoming AMA Announcement: Vivek Ravisankar, CEO and Co-founder of HackerRank, Wednesday 08/30!",
    "subreddit": "cscareerquestions",
    "timestamp": 1503509150,
    "score": 209,
    "keyword": "indian ceo"
  },
  {
    "text": "Traveling to India as a cs career American born and raised but descent from Indian origin.\nIve always had a dream when I pick up a cs career to be able to travel back and forth. I had an engineer father (mechanical) who was able to travel to china when he worked for one company. We have a neighbor who works for apple, goes to china alot.\nWith software so deeply rooted between india and the united states, are there opportunities for non ceo's and high level management but regular programmers to travel?",
    "title": "Traveling to India as a cs career",
    "subreddit": "cscareerquestions",
    "timestamp": 1510723707,
    "score": 0,
    "keyword": "indian ceo"
  },
  {
    "text": "Immigration and CS jobs I live in Canada (although I'm not Canadian) and I had hopes of going to Cali for FT because lets face it, California or Washington (maybe NYC) are the only places where software engineers actually make money. Salaries are low in Canada, ~60k US after conversion. Why is the general consensus that immigrants steal US citizens' jobs? Tech is dominated by Asians, and although they may be \"American,\" they really aren't (they moved there some time). Google's CEO is Indian, Microsoft, Adobe, .... The simple reason I would like to move to USA is because of $$$. Period. What are your thoughts on this topic?",
    "title": "Immigration and CS jobs",
    "subreddit": "cscareerquestions",
    "timestamp": 1493281639,
    "score": 0,
    "keyword": "indian ceo"
  }
]