[
  {
    "text": "My father. &#x200B;\n\nI'm Indian and more often than not, in our society, a girl's fate is sealed the day she takes her first breath. It is decided that she will learn to cook , knit, take care of the house, raise children and will make her family proud by being the perfect submissive wife and daughter in law. She will be educated but not so that she can have a career of her choice. Her education will come in handy if the family has money problems and she can get a job to supplement their income. And of course, if her husband is successful, then she has no need to work. She can stay at home with her children and be content with being a mom.\n\nIn a society that harbors such toxic notions about women and girls, my father is a rare exception. When I was a kid, he always told me that I need to study hard and succeed in life not so I can be a working housewife but so that can leave my mark in the world. He always encouraged me to have my own identity and to form my own opinions. He also believes that women competing with men on an equal footing is a mark of a healthy society. In fact, now that I think about it, I was able to realize that I did not want children as early as in my teens, because of the way he raised me.\n\nHowever, he would say certain things that would bother me deeply. In my early 20s when we would discuss my career, he would end every conversation with how when I've achieved great success, I would be such a great role model for my children. That I would teach my sons and daughters that gender roles are a relic of the past.\n\nThese are all wonderfully progressive ideas but the trouble was that I did not want children. The mere thought of getting pregnant and giving birth terrified me. So one day as we were having a similar conversation, I cut him off mid sentence and told him that I was not going to have children. I still remember the look of utter bewilderment and confusion on his face. He asked me why I would say such a thing and don't I want to pass on my legacy to the next generation. I told him I can pass on my legacy even without having my own kids. My own accomplishments would be my legacy. As for the next generation, I can provide guidance and support to young people when I'm at a certain age. He then asked what would happen when I'm old. Who would take care of me? I told him it would be selfish to have a child just so they can look after me when I'm old. If I have no desire to raise a child , what kind of a parent would I be? I also pointed out that a lot of people don't have kids and are perfectly healthy and fit in their old age. He then told me not to be hasty and to think about my decision. I could tell that he was troubled and frankly, I was a bit annoyed with him as I shouldn't have to justify this decision.\n\nA few days later , he told me he had thought long and hard about the things that I had said and that they make perfect sense. I have the right to live as I wish and no one has the right to judge me. He said that his only expectation of me was that I would make myself a productive member of society. In that moment I felt closer to my father than ever before.\n\nI often read stories about how parents often flip out when their kids tell them they are CF. They demand grandchildren, as if that's something they are entitled to. This only makes me appreciate my father even more.",
    "title": "My father.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1558275924,
    "score": 1676,
    "keyword": "indian judge"
  },
  {
    "text": "The first time I bought condoms. I'm Indian and as you can imagine, sex is a taboo subject in my country. Most people here just like to pretend that it doesn't exist. Female sexuality is a subject that's never to be touched with a 20 foot pole.\n\n&#x200B;\n\nAt 22, I decided I was ready to have sex. I hadn't started dating, as I was still living with my parents. But I did want to get sex out of the way. So this guy who attended my university and I agreed to meet up at his place when his parents would be out.\n\nI decided to buy the condoms myself. Some of my friends had said that they always made their boyfriends buy them, as men are a lot less likely to be judged. I just wanted to see what it would be like.  I went into the drug store near my uni and picked up a whole bunch of different kinds - dotted and ribbed, flavored etc.\n\n&#x200B;\n\nI wanted to think of myself as a confident person, who did not allow herself to be affected by what other people thought. But as I stood in line behind a few people, I couldn't shake off the feeling of nervousness that came over me. I was beginning to worry what the shop owner or the other customers would think. I tried to push these thoughts away, telling myself they were strangers that I'd never see again.\n\n&#x200B;\n\nHowever, no drama, no awkwardness ensued. The shop owner, a middle aged man, didn't give me weird looks, didn't made any snide comments, didn't ask if I was married. He treated me the way he would any other customer. The lady right behind me did stare at my condoms, then back at me, then back at my condoms, then back at me again. But other than that there was no unpleasantness.\n\n&#x200B;\n\nI know this doesn't sound like a big deal, but given the time and the place, it certainly was. Back then, I was not the woman that I am today and if someone had said something inappropriate, I don't think I would have been able to defend myself. I probably would have just left the store with anger, a sense of helplessness and no condoms. But that shop owner's conduct made all those worries disappear.\n\n&#x200B;\n\nAs I left the store, I realized that this is exactly what buying condoms should be like, no different from buying groceries. It shouldn't have to be an \"adventure\". It shouldn't be a big deal.\n\n&#x200B;\n\nI'd love to know what your first time purchasing condoms was like. Please do let me know in the comments.",
    "title": "The first time I bought condoms.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1565598260,
    "score": 603,
    "keyword": "indian judge"
  },
  {
    "text": "[Trigger Warning]How can I overcome my jealousy, hatred and bitterness for other women? **I know I have some grave issues and I sound really toxic. You are free to judge and criticise me but please don't downvote this post to oblivion. I am desperate for some help.**\n\nI am a 24 year old Indian woman. I grew up in a relatively liberal(literally, not the political aspect) family. I was(and am) treated as an equal and my folks have given me freedom to chase my dreams.  I have a tough feminist reputation- it isn't for nothing. I am quite vocal about women's rights and problems. To be frank, I personally haven't experienced much(if any) discrimination in my life. In a nutshell, I have had an easy life for a woman, especially in a country like India. \n\nComing to my problem, despite all the feminist ideology I spout, I am extremely jealous of other women. Whenever I see a woman achieving things I desired for myself, a crippling sense of insecurity stabs the darkest corners of my mind and I feel extreme hatred for them. As far as I am concerned, I feel sympathy for women from the lowest strata of the society but when I see a woman getting better than me, I feel threatened. \n\nDespite working hard(believe me, I am being 100% honest in this post) and having some talent(but not enough), I am unable to achieve my goals.\n\n* I went to unremarkable schools and colleges. I don't know if women from other countries can understand what I mean but they are the institutional equivalents of 'Tom, Dick and Harry'. I was a good student, everyone praised and appreciated me greatly. You might be wondering what is so wrong with this. But it inflated my ego and I overestimated my talents. \n\n* I have always loved arts and studied a humanities subject. I was not that good in 'subjects that matter'(STEM) but rather than working on my shortcomings in those areas, I chose to concentrate on my strengths. But as I have explained in the previous point, my strengths, which were a source of pride for me and my school and college, aren't impressive. I realised that I am not particularly spectacular or noteworthy as compared to other women with whom I have to compete for everything. \n\n* I am unable to handle any compliments when I rarely get one. I smile act graciously but I loathe them. It reminds me of the people who had congratulated a appreciated me in the past. I hate them. They made me feel like a queen when I am below average, at best. I would have been much better off if I had only small dreams. \n\n* I don't look good. This is not about 'it is inner beauty which counts' talks, which even I resort to often. I am overweight and pcos has wrecked so much havoc in my body that I look more like a 35-40 year old woman aging badly. \n\n* I feel extremely guilty and desperate when I compare my circumstances with other women. Not many people get to live as comfortably as I could, but they have achieved so much. I have worked hard, but I am not good enough. I won't say that I am an absolute failure- I am barely floating. \n\n* I relish reading articles which bash women. Reading things like 'Meghan Markle is a gold digger', 'X actress gained weight', 'Y politician is a bitch', 'Z looks horrible without makeup ', etc. I know that such narratives are regressive. Actually, I have written an article about how they damage the perceptions of young women. But the hypocritical jealous aspect of my personality loves such discourses. \n\nI love talking about sorority, empowerment and whatnot. But the moment I feel some woman is better than me, I feel bitter. I don't express it openly because I don't want to lose my reputation, but deep within, I am seething.   This behavior gets worse in online platforms. For example, there is this wonderful woman I follow in Reddit. I stalk her account and read her posts because she writes about interesting topics in a lucid manner. As much as I love her writings and acknowledge her skills, I hate her. I downvote each and every post and comment she writes. I can't help it. \n\nThis hatred is not limited to real life. I hate strong female characters in popular media. The more I want to live and achieve what a character did, the more I spew venom against her. Typical bully attitude. \n\nI don't act on my feelings in real life but I don't know when am I going to lose control. I keep on asking the same question: why am I not good enough? Why don't I look good? Why can't I get a good job? Why can't I write satisfactorily?\n\nThough everyone in my life thinks they are some random accidents, I have attempted to kill myself thrice. It is as if I am not good enough even to die. I stopped attempting further because I don't want my parents to bear the hospital expenses. We are quite well off and they can afford it easily, but I feel guilty that I am only a burden on them. \n\nI am aware that I am an extremely unhealthy individual. I want to change my attitude. But I don't know what to do. \n\n\n**TL;DR**: Insecurity issues, extremely jealous of other talented successful woman and do not know what to do with it.",
    "title": "[Trigger Warning]How can I overcome my jealousy, hatred and bitterness for other women?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1550846508,
    "score": 18,
    "keyword": "indian judge"
  },
  {
    "text": "Former Indian High Court judge and family accused of domestic violence by daughter in law",
    "title": "Former Indian High Court judge and family accused of domestic violence by daughter in law",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1569045966,
    "score": 5,
    "keyword": "indian judge"
  },
  {
    "text": "Jihadi Judge of an Indian Court allegedly calls to shoot Hindus under his protection.",
    "title": "Jihadi Judge of an Indian Court allegedly calls to shoot Hindus under his protection.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1567272678,
    "score": 1,
    "keyword": "indian judge"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 125,
    "keyword": "indian judge"
  },
  {
    "text": "Feminism and the Duluth Model. Note: In this post the terms \"IPV/DV/PV\" are used interchangeably.\n\n**1) The Duluth Model: The predominant model of domestic violence.**\n\nIn 1981, the Domestic Abuse Intervention Program created the Duluth Model, which was a more structured approach to batterer treatment and it is usually credited as introducing domestic violence into society's mainstream conscience. \"The program was born from the creative energies of battered women and feminist activists, included members of EMERGE, one of the first batterer intervention programs in the country. 13 battered women from Duluth participated in creating the Duluth Model's Power and Control Wheel based on traits and behaviours specific to their own abusive husbands. Later, scientists tested the program's curriculum with a sample group of nine subjects, including five battered women and four abusive men, who had all participated in the program. Based on the results of the test, the Duluth Model emerged as one of the nation's most utilized models for batterer intervention programs.\"\n\n[https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr](https://scholarship.law.umt.edu/cgi/viewcontent.cgi?article=2027&context=mlr)\n\nBefore we move on, let's get something straight here since I've seen a lot of denial around it generally from people who support feminism: The Duluth Model is entirely based on feminist theory. In [this](https://tspace.library.utoronto.ca/bitstream/1807/10972/1/NQ28298.pdf) thesis written by Ellen Pence herself (she is the woman who is usually credited with creating the Duluth Model) in 1997, she says in pages 1 and 2:\n\n\"I am indebted to the Domestic Abuse Intervention Project (DAIP), where I have worked for 16 years. As a group we have been an important part of a historic social movement. We were the first grassroots group to break through the barrier of institutional resistance to establishing community-monitored interagency policies (including policies mandating arrest, promoting aggressive prosecution, imposing increasingly harsh penalties on repeat offenders, and **requiring a feminist based educational model for abusers**). This speaks to the excellence of our group as well as to that of the leaders in our police and court system. To my co-workers and the many practitioners who have lent to my experience and to this specific endeavour, I am eternally grateful.\"\n\nShe says right here that the model is feminist based. Now that we've got that out of the way, we can move on to the main bulk of this.\n\nThe Duluth Model characterises domestic violence as being a primarily male-perpetrated crime caused by \"patriarchal terrorism\", theorising that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. Supposedly, men who batter are using violence to to maintain their individual and societal patriarchal dominance over women.\n\nDAIP itself says of Duluth:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"We still live in a sexist society where women are devalued, where many men believe they are entitled to be in control in an intimate relationship, and where men who batter believe they have the right to use violence. While it is a goal to change the attitudes of men who batter, the ultimate goal of the Duluth Model has always been to ensure that victims are safer by having the state intervene to stop the violence and address the power imbalance inherent in relationships where one person has been systematically dominated and subjugated by another.\"\n\nIt's described in further detail in a 1993 book that Ellen Pence co-authored; [\"Education Groups For Men Who Batter: The Duluth Model.\"](https://books.google.com.au/books/about/Education_Groups_for_Men_Who_Batter.html?id=tJ189FTdO38C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) The book says:\n\n\"The tactics used by batterers reflect the tactics used by many groups or individuals in positions of power. Each of the tactics depicted on the Power and Control Wheel are typical of behaviors used by groups of people who dominate others. They are the tactics employed to sustain racism, ageism, classism, heterosexism, anti-Semitism, and many other forms of group domination. Men in particular are taught these tactics in both their families of origin and through their experiences in a culture that teaches men to dominate. ...We use gender-specific terms not only because the curriculum is for men who batter, but because battering is not a gender-neutral issue.\"\n\nThe Duluth Model's Power and Control Wheel details the tactics that are used to sustain an abusive partner's control over an abuser.\n\n[https://www.theduluthmodel.org/wheels/](https://www.theduluthmodel.org/wheels/)\n\n* Physical and Sexual Violence (outer ring)\n* Using Intimidation\n* Using Emotional Abuse\n* Using Isolation\n* Minimizing, Denying and Blaming\n* Using Children\n* Using Male Privilege\n* Using Economic Abuse\n* Using Coercion and Threats\n\n[https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf](https://www.domesticviolenceintervention.net/wp-content/uploads/2014/02/Eckhardt.etal2013.Manuscript.pdf)\n\nThe Duluth Model currently reigns as the most commonly state-mandated model of intervention. While many approaches to intervention include a mix of the Duluth Model's feminist analysis of DV and cognitive behavioural therapy (which is a more holistically-oriented approach to DV that maintains that DV is associated with cognitive distortions and faulty attitudes and beliefs), most existing intervention programs as well as state laws and guidelines that regulate IPV intervention still espouse key aspects of feminist perspectives on IPV etiology and intervention.\n\n**2) Gender symmetry in DV: The evidence and the denial.**\n\nHowever, more and more studies have come up showing gender symmetry in DV.\n\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf](http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.588.4366&rep=rep1&type=pdf)\n\n\"More than 200 studies have found that men and women perpetrate partner violence at approximately equal rates and that the most prevalent pattern is mutual violence (Archer, 2002; Fiebert, 2004). Moreover, when it is not mutual, female-only and male\\~only partner violence occur with about equal frequency among married couples (K. L. Anderson, 2002; Capaldi & Owen, 2001; Gelles & Straus, 1988; Kessler, Molnar, Feurer, & Appelbaum, 2001; McCarroll, Ursano, Fan, & Newby, 2004; Medeiros & Straus, 2007; Moffitt, Caspi, Rutter, & Silva, 2001; Straus, Gelles, & Steinmetz, 2006; Williams & Frieze, 2005). Among young couples and dating couples, the percentage of female-only partner violence exceeds the percentage of male- only partner violence (Straus & Ramirez, 2007; Whitaker, Haileyesus, Swahn,& Saltzman, 2007). This pattern of gender symmetry is true even for severe partner violence, such as kicking, attacks with objects, and choking. However, the injury rate is much higher when the perpetrator is male (Gelles & Straus, 1988). Police statistics and crime survey statistics seem to contradict the idea of gender symmetty because 80% to 99% of the perpetrators identified in such surveys are men (Straus, 1999). This is not because of higher numbers of physical attacks by men but because of the greater probability of injury from attacks by men and greater fear for safety by women (Straus, 1999). These are characteristics that lead to police intervention. Such cases are mistakenly taken as representative of partner violence, even though at least 95% of partner violence cases are not known to the police (Kaufman Kantor & Straus, 1990; Statistics Canada, 2005).\"\n\nAnd...\n\n\"Not only do men and women tend to perpetrate physical partner violence at about equal rates, but they tend to do so for similar reasons. The most commonly reported proximate motivations for use of violence among both men and women are coercion, anger, and punishing misbehavior by their partner (Cascardi & Vivian, 1995; Follingstad, Wright, Lloyd, & Sebastian, 1991; Kernsmith, 2005; Stets & Hammons, 2002). For example, Pearson (1997) reported that 90% of the women she studied assaulted their partner because they were furious, jealous, or frustrated. The motive of self-defense, which has often been put forward as an explanation for high rates of female violence, explains only a small proportion of partner violence perpetrated by women (and men; Carrado, George, Loxam, Jones, & Templar, 1996; Felson & Messner, 1998; Pearson, 1997; Sarantakos, 1998; Sommer, 1996). For example, using a college student population, Follingstad ot al. (1991) found that perpetrators reported that their motivation was self-defensive about 18% of the time (17.7% for men, 18.5% for women). As violence becomes more severe, there are greater gender differences in the use of violence in self-defense; however, self-defense is still a motivation for a relatively small proportion of violence. For example, in a sample of couples presenting for marital therapy, Cascardi and Vivian (1995) found that 20% of wives and no husbands attributed their use of severe aggression to self-defense.\"\n\nOne study even showed that half (49.7%) of relationships which had violence were reciprocally violent, and that in nonreciprocally violent relationships, women were the perpetrators in more than 70% of the cases.\n\n[https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020](https://ajph.aphapublications.org/doi/pdf/10.2105/AJPH.2005.079020)\n\nIn 1999, Ellen Pence, in her book [\"Coordinating Community Responses to Domestic Violence: Lessons from Duluth\"](https://books.google.com.au/books/about/Coordinating_Community_Responses_to_Dome.html?id=Vk_qT-apdT4C&printsec=frontcover&source=kp_read_button&redir_esc=y#v=onepage&q&f=false) came out herself and admitted that she and the DAIP staff involved in Duluth were driven by ideology. In the chapter \"Some Thoughts On Philosophy\", she wrote:\n\n\"The Power and Control Wheel, which was developed by battered women attending women's groups, was originally a description of typical behaviours accompanying the violence. In effect it said \"When he is violent, he gets power and he gets control.\" Somewhere early in our organizing efforts, however, we changed the message to \"he is violent *in order to* get control or power.\" The difference is not semantic, it is ideological. Somewhere we shifted from understanding the violence as rooted in a sense of entitlement to rooted in a desire for power. By determining that the need or desire for power was the motivating force behind battering, we created a conceptual framework that, in fact, did not fit the lived experience of many of the men and women we were working with. The DAIP staff - like the therapist insisting it was an anger control problem, or the judge wanting to see it as an alcohol problem, or the defense attorney arguing that it was a defective wife problem - remained undaunted by the difference in our theory and the actual experiences of those we were working with. We all engaged in ideological practices and claimed them to be neutral observations.\"\n\n\"Eventually, we began to give into the process that is the heart of the Duluth model: interagency communication based on discussions of real cases. It was the cases themselves that created the chink in each of our theoretical suits of armor. Speaking for myself, I found that many of the men I interviewed did not seem to articulate a desire for power over their partner. Although I relentlessly took every opportunity to point out to men in the groups that they were so motivated and merely in denial, the fact that few men ever articulated such a desire went unnoticed by me and many of my coworkers. Eventually, we realised that we were finding what we had already predetermined to find.\"\n\nSo even Ellen Pence herself outlined the limitations of the Duluth Model and acknowledged that she and her coworkers had created a conceptual framework that was inadequate in describing DV.\n\nHowever, the conception that DV is a primarily male-perpetrated crime which is an outgrowth of normal male behaviour and socialisation still persists, and people who challenge Duluth's characterisation of DV face extreme backlash.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n\"Suzanne Steinmetz made the mistake of publishing a book and articles (Steinmetz, 1977; Steinmetz, 1977-1978) which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware. Twenty years later the same processes resulted in a lecturer at the University of Manitoba whose dissertation found gender symmetry in PV being denied promotion and tenure.\"\n\n\"A PhD student working with Straus was warned at a conference that she will never get a job if she does her PhD research with him. At the University of Massachusetts, Straus was prevented from speaking by shouts and stomping. At two hearings held by the Canadian Commission On Violence Against Women the chairperson stated that nothing Murray Straus publishes can be believed because he is a wife-beater and sexually exploits students (Toronto Magazine article, ??). When Straus was elected President of the Society For the Study Of Social Problems, a group of members occupied the first few rows of the auditorium and, at the start of the presidential address, stood up and walked out.\"\n\n\"As a result of these types of harassment, there is widespread self-censorship by authors who fear that publishing politically incorrect data will undermine their reputation, or in the case of graduate students, their ability to obtain a job.\"\n\nSo despite all the evidence proving that DV is a crime that can be committed by both genders and that men and women who commit DV both share similar motivations, the Duluth Model is still very frequently used and widely accepted.\n\nEDIT: You know what, I'm including more.\n\n**3) The VAWA and a lack of services for abused men.**\n\nAs a result of this erroneous viewpoint that Duluth has created, male victims of domestic violence struggle to obtain services. Most resources are allocated to helping female victims of DV and much less for men.\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\nThe Violence Against Women Act is the centre of controversy, with a lot of complaints being made about sex-based discrimination by VAWA-funded programs. Technically, anti-discrimination provisions apply to the Violence Against Women Act, and the 2005 renewal of VAWA added this requirement:\n\n\"Nothing in this title shall be construed to prohibit male victims of domestic violence, dating violence, sexual assault, and stalking from receiving benefits and services under this title. 16\"\n\nHowever, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature:\n\n* \"In 2002, the OVW instructed the Delaware Domestic Violence coordinating council that, “states must fund only programs that focus on violence against women.”17\"\n* \"Department of Justice (DoJ) research solicitations have explicitly excluded applications that focus on male victims. One Solicitation for Proposals from the DoJ National Institute of Justice specifically prohibited “proposals for research on intimate partner violence against, or stalking of males of any age…”18\"\n\nAnd...\n\n\"Given these federal actions, it is not surprising that state-level governmental programs follow suit\":\n\n\"In Texas, an application for a program serving male victims was turned down because “programs that focus on children and/or men” were deemed ineligible.20 The next year, a grant application kit from the Texas Criminal Justice Division used identical words to reiterate the exclusion: “Programs that focus on children and/or men.”21\"\n\n\"Likewise, the OVW awarded $3 million to Baylor University to establish the Faith and Community Technical Support (FACTS) program designed to reduce domestic violence in rural communities. In 2006 the FACTS program issued a grant solicitation stating, “As with previous VAWA methods, it is assumed that … all victim data reported is about victimized women.”22 One of the questions on the FACTS grant application asks, “Number of years organization has spent working on violence against women issues.\"\n\nIn 2007, a letter was sent to the Office on Violence Against Women under the Freedom of Information Act (FOIA) requesting the OVW provide \"sex-specific utilisation data for each of the following grant programs\":\n\n1. Transitional Housing Program\n2. Rural Domestic Violence and Child Victimization Enforcement Grant Program\n3. Legal Assistance for Victims Program\n4. Stop Violence Against Indian Women\n5. Grants to Encourage Arrest Policies and Enforcement of Protection Orders\n6. Grants to Reduce Violent Crimes Against Women on Campuses\n7. Services, Training, Officers, and Prosecutors (STOP) Violence Against Women Formula Grant Program\n\n\"Overall, only 9.7% of persons receiving help were male victims, the remaining 90.3% being female victims. The percentages of male victims for the Legal Assistance for Victims and Transitional Housing programs were much lower – 3.9% and 0.4% respectively.49\"\n\nIn accordance with this, the experiences of men who attempt to seek help for domestic violence through formal resources have largely been negative. From a study of U.S. men who have sustained domestic violence from their female partners:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\n\"Qualitative research has documented the experiences of men who seek help for female-to-male IPV (Cook 2009; Hines et al. 2007). For example, Cook (2009) performed in depth interviews of 30 men who sustained all types of IPV from their female partners and tried to seek help. This work shows that men often experience barriers when seeking help. When calling domestic violence hotlines, for instance, men who sustained all types of IPV report that the hotline workers say that they only help women, infer or explicitly state that the men must be the actual instigators of the violence, or ridicule them. Male helpseekers also report that hotlines will sometimes refer them to batterers’ programs. Some men have reported that when they call the police during an incident in which their female partners are violent, the police sometimes fail to respond. Other men reported being ridiculed by the police or being incorrectly arrested as the primary aggressor. Within the judicial system, some men who sustained IPV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of IPV and abusing their children. According to some, the burden of proof for male IPV victims may be especially high (Cook 2009).\"\n\nAnd...\n\n\"We found that men who sustain IPV seek help from a variety of resources, most typically from informal resources, such as family, friends, and the Internet, and the formal resource of a mental health professional. Family and friends were overwhelmingly reported as being the most helpful resource, and mental health and medical professionals were rated as being among the most helpful of the formal resources. These professionals were reported to have taken the male victims seriously and to inquire about the origin of the men’s injuries. The resources providing the least support to men seeking help for IPV victimization are those that are the core of the DV service system: DV agencies, DV hotlines, and the police. On the one hand, about 25% of men who sought help from DV hotlines were connected with resources that were helpful. On the other hand, nearly 67% of men reported that these DV agencies and hotline were not at all helpful. Many reported being turned away. The qualitative accounts in our research tell a story of male helpseekers who are often doubted, ridiculed, and given false information. Thus, our hypotheses that men who would have largely negative experiences with formal resources were supported, which is consistent with prior qualitative research (Cook 2009; Hines et al. 2007).\"\n\n\"These findings are in stark contrast to ratings of social services by battered women. For example, in a study of 119 women who sought services for DV-related concerns from a DV shelter, 89% of the clients believed that they were helped by the services that they received and 84% reported that they felt better because of these services (McNamara et al. 2008). These findings are similar to a study which examined women’s impressions of a hospital-based DV support group (Norton and Schauer 1997). Of the 59 women in this study, 95% reported that they were mostly or very satisfied with the services that they received. Their reasons for satisfaction included that the group leaders were supportive, they were able to hear about other women’s experiences with abuse and were supported by them, they received referrals for additional support/services and they were able to learn about DV. These findings are consistent with other literature which states that women are often very satisfied with the services that they have received for IPV (Bowker and Maurer 1985; McNamara et al. 1997; Molina et al. 2009). Similar results with regard to satisfaction among battered women have been found in relation to police assistance. For example, one study of 95 female IPV victims indicated that the female victims found the police to be very helpful and 80% would contact the police again for assistance (Apsler et al. 2003).\"\n\nSo male victims are largely marginalised.\n\n**4) Mandatory Arrest Laws and Predominant Aggressor Policies.**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV. Statutes in numerous states directed police officers to undergo training on domestic violence and victim assistance and limited their discretion.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n\"Under the assumption that intimidated witnesses are reluctant to testify against their abuser, district attorneys began to adopt “no-drop” prosecution that circumvented victim cooperation. The 23 states that call for *mandatory arrest* allow the least amount of discretion, with statute language that ranges from vague, as in Colorado (“probable cause to believe a crime of domestic violence was committed”), to more specific, as in Washington where police can arrest when there is probable cause to believe a person 16 years or older within A, B, C, D, E the previous 4 hours assaulted a family or household member and believes (1) felonious assault occurred, or (2) assault resulting in bodily injury occurred whether injury is visible or not, or (3) any physical action occurred which was intended to cause reasonable fear of imminent serious bodily injury or death. (Hirschel, 2008, pp. 19–20)\".\"\n\nAnd when mandatory arrest laws were instituted, the arrests of women *skyrocketed.*\n\n\"In California, men in 1987 were arrested at a rate of 247 per 100,000, whereas women were arrested at a rate of 74.8 per 100,000. By 1997, the rates had increased only 136% for men, or up to 338 arrests per 100,000, but as much as 500% for women (DeLeon-Granados, Wells, & Binsbacher, 2006). Feminists welcomed the rise in male arrests. However, despite evidence that “political and/or organisational pressure may discourage officers from arresting women as aggressors” (Hirschel & Buzawa, 2009, p. 5), they found the sharper spike in female arrests of concern.\"\n\nSo, in order to counter this, feminists worked with policy makers to institute \"predominant aggressor\" guidelines which allegedly attempted to curb the arrest of victims by taking into account the “relationship behind the assault”.\n\nTo anyone denying that predominant aggressor guidelines have anything to do with Duluth's feminist analysis of DV or feminism, DAIP (remember: birthplace of the Duluth Model) itself states:\n\n[https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf](https://www.theduluthmodel.org/wp-content/uploads/2017/03/CounteringConfusion.pdf)\n\n\"Doing away with **pro-arrest policies targeting the predominant aggressor (a core component of the Duluth Model)** reduces the total number of arrests but increases the proportion of dual arrests. Dual arrests have proven ineffective in stopping violence, and they also have the unfortunate consequence of making victims more reluctant to call the police when further acts of violence occur.\"\n\nSo there you go.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\nCalifornia is one of several states that defines the dominant aggressor not as the first aggressor but rather the most “significant,” a sharp deviation from accepted police practice in responding to other crimes. As specified under state law and found in the domestic violence section of the Peace Officer Standards and Training (POST) manual, here are the factors taken into account when determining the predominant aggressor.\n\n* Age, weight, and height of the parties;\n* Criminal history;\n* Domestic violence history, including convictions and probation;\n* Strength, special skills (e.g., martial arts, boxing);\n* Use of weapons;\n* Offensive and defensive injuries;\n* Seriousness of injuries;\n* Use of alcohol and drugs;\n* Who called 911;\n* Who is in fear;\n* Presence of behaviors of power and control in the relationship;\n* Detail of statement;\n* Demeanor of the parties; and\n* Existence of corroborating evidence (California Commission on POST, 2010, pp. 3–5, 3–6)\n\nNone of these criteria are openly anti-male, but there are some bits that are prejudicial to men as a result of the criteria that was selected in determining the predominant aggressor.\n\n\"Again, many of these factors are vague, not easily interpreted and of dubious value. “Age, weight, and height of the parties,” and martial arts training are only relevant if the individual actually uses these advantages in an aggressive way. Men are usually bigger and stronger than women are, but most men do not abuse their partners, and there is no correlation in the general population between a person’s size and strength and the extent to which they abuse intimate partners, including among same-sex couples (Renzetti, 1992). When men are assaulted, they often refrain from striking back, both out of fear of being arrested and the code of chivalry. ... A man who is larger and stronger than his partner may have the *potential* of causing greater physical damage, but this factor is irrelevant unless he actually uses this to his advantage, just as the smaller woman has the *potential* to obtain a gun and kill him. The reader will notice that for weapons, officers are asked to consider their *use*, but not so with size and strength. In this respect, there is reason to suspect that the choice of criteria may be prejudicial to men (Sacks, 2010).\"\n\nOn the other hand, how police are trained to identify the predominant aggressor is blatantly gender-biased.\n\nIn two official police training manuals, including the POST manual cited earlier (California Commission on POST, 2010):\n\n\"The POST manual contains sections that define domestic violence that discuss its impact on victims and instruct officers in a detailed manner on response and arrest procedures and the protection of victims. Brief case scenarios are presented for the purpose of illustration and to facilitate learning. ... The manual generously offers 50 such examples, in which one party abuses or otherwise acts aggressively toward the other. ... Of the 50 examples, *not a single one* depicts unilateral abuse by a female upon a male (see Table 1). ... The examples send out a clear message to law enforcement in California, the largest state with more than 10% of the U.S. population: Officers should concern themselves only with male-perpetrated violence.\"\n\n\"The Maine training program, *Identifying Predominant Aggressors in Domestic Violence Cases (Train-the-Trainer*), is a 2-to 4-hour presentation consisting of lectures, video scenarios, and group discussions from the Maine Criminal Justice Academy, the organization that conducts trainings for all law enforcement and corrections agencies in the state of Maine (Rogers & Faragher-Houghton, 2008, p. 3). More so than the POST training, the Maine curriculum focuses right from the start, in its definition of domestic violence, on the exclusive needs of female victims. Following an exposition on the evolution of the criminal justice response, trainees are presented eight examples (one involving a public disturbance; the others depicting a domestic violence incident between a man and a woman) and asked to decide which party is the predominant aggressor based on the state’s legal criteria (similar to California’s), and who to arrest. Trainees are then informed that in seven of those cases, it is the man who should be arrested. In the other case, there is no specific recommendation to arrest either the man or the woman, but the clear implication is that the man is the dominant aggressor.\"\n\nAnd...\n\n\"The gender bias found in both the California and Maine trainings is blatant, indeed. However, considering the process by which dominant aggressor laws were put on the books, one should hardly be surprised. Laws protecting victims from domestic abuse were enacted not by abused men or men’s rights groups or disinterested bureaucrats, but through the efforts of battered women’s advocates, some of whom had previously been victimized in their own lives, and by feminists concerned broadly with the oppression of women (Mills, 2003). It was feminists who fought for the creation of dominant aggressor guidelines, and they did so explicitly to stem the rising tide of female arrests, on the grounds that domestic violence is a *gendered* problem. This view, based on a feminist analysis of patriarchy and sometimes referred to as the *gender paradigm* (Dutton & Corvo, 2007; Dutton & Nicholls, 2005), has had a profound influence on policy and intervention.\"\n\n\"The existence of training bias and political activism only suggest—and do not prove—that police officers actually carry out arrests in a gender-biased manner, and clearly much more research is needed. However, there is evidence elsewhere in the criminal justice response to domestic violence of a clear political agenda, as evidenced by the tendency of police to dually arrest significantly more often when the male is the victim, compared to the female (Hirschel & Buzawa, 2009); the preferential granting of restraining orders to women relative to men in response to similar complaints (Muller, Desmarais, & Hamel, 2009); the failure of law enforcement to adequately inform male victims regarding community resources (Buzawa & Hotaling, 2006); and the proliferation of intervention programs based on a patriarchal theory (Dobash & Dobash, 1979; Pence & Paymar, 1993). In addition, telling is the official domestic violence training offered by the U.S. Victims of Crime office, whose training manual gives 11 examples of physical domestic violence and various power and control tactics. Of these 11 examples, 8 involve male-on-female battering, 2 involve female-on-female lesbian abuse, and 1 involves a male perpetrator and a victim whose gender is not specified (Office of Justice Programs, 2010). Once again, trainers are not able to imagine any scenario whatsoever in which the perpetrator is a woman and her victim is a man.\"\n\nSo this has been the unfortunate effect of the Duluth Model and the narrative that feminists have created and tried incredibly hard to maintain that it is primarily men who are the perpetrators of DV/IPV. And that they have successfully maintained, despite there being a massive body of evidence that disproves said narrative.",
    "title": "Feminism and the Duluth Model.",
    "subreddit": "MensRights",
    "timestamp": 1561084678,
    "score": 102,
    "keyword": "indian judge"
  },
  {
    "text": "Judge Threatens Indian Man With ‘Legal Consequences’ If He Won’t Impregnate Wife He Wants Divorce From",
    "title": "Judge Threatens Indian Man With ‘Legal Consequences’ If He Won’t Impregnate Wife He Wants Divorce From",
    "subreddit": "MensRights",
    "timestamp": 1561409984,
    "score": 72,
    "keyword": "indian judge"
  },
  {
    "text": "Men's plight mentioned in the Indian parliament. On a topic very unrelated to men's rights, a female MP mentions \" I feel a certain kind of narrative is being set in this country where men are made to feel small and anti-feminist if they pass any order which is logically correct...\". It's not just people with the authority to pass orders, it's even the common public. Any opinion, action, or event is seen with a sharp feminist (or in most cases misandrist) lens. And if it doesn't fit that narrative, it's ignored, rejected or at times subject to serious consequences.\n\n[Link1](https://rightlog.in/2019/01/meenakshi-lekhi-sabarimala-01/)\n\n[Link2](https://indianexpress.com/article/india/sabarimala-cpm-mp-says-kerala-has-to-uphold-sc-order-meenakshi-lekhi-cites-constitutional-morality-5524079/)\n\nA recent example I'd say is the scrapping of section 497 of the Indian constitution (criminality of adultery). The law in its originality was unfairly disadvantageous to men, but the reason cited for its quash was \"women's sexual autonomy\". It was crystal clear that nobody cared for the men. In fact, the only person with a mildly different opinion to the court's judgement was a female judge who was part of that constitution bench. It's a sad state of affairs when you have to be female to speak or do the right thing. But now, it's at least out in the open.\n\n[Link3](https://www.livelaw.in/adulterous-woman-cant-be-treated-as-victim-and-the-man-seducer-justice-indu-malhotra-on-striking-down-s-497ipc/)",
    "title": "Men's plight mentioned in the Indian parliament.",
    "subreddit": "MensRights",
    "timestamp": 1546807395,
    "score": 14,
    "keyword": "indian judge"
  },
  {
    "text": "ContraPoints has cisgender heterophobia. Traps are indeed not gay, but entrapment is not virtuous. ContraPoints \"Traps are not gay\" is somewhat agreeable, to an extent..\nhttps://youtu.be/PbBzhqJK3bg\n\nBut she missed out crucial facts about reality.\nAll behaviour, including female behaviour can be traced back to the desire to not get a Darwin award. Women are what must be protected to ensure a successful future of the group provided there is at least _a_ male left, and drives their individual behaviour, like all of us, in ways we are both aware of, unaware of, or find uncomfortable. Like women's increased empathy for their children and family.  Its why we value women's health and judge them on their beauty. A man is evolutionarily replaceable in comparison. One man, no matter how overworked, scarred, mutilated or damaged can make pregnant hundreds of thousands of women, at the same time. Of course it happens to be mainly the strong, adventurous, aggressive risk taking but lucky men, regardless of damage along the way, that were the ones that were not erased from the face of the earth. Any that were were were just society's excess. It's just life for unlucky men, and still is. It's why we value them only by their ability to be successful and provide. One woman can only have one baby at a time, for a maximum in the order of a few tens, and so each woman, provided there are a few men left, is worth more alive and healthy, and has been since the dawn of time. She also acts, in every part of her behavior, to be the one that has a right to any man's sustenance and protection when available. That why we treat men, especially underprivileged men, as disposable - homelessness, war, suicide, healthcare, not caring when \"weak\" men are victims of domestic abuse. Women get a multiple billion £\\$ lobby and support establishment to protect their interests and make sure they are looked after from cradle to grave, however valid it is to want to do this in its own right, and however valid each cause is. And why some feminists hate transwomen \"piggybacking\" on their ruthlessly fought for social privileges.\n\nNow men too _might_ want to have a say in society caring for them as individuals, beyond just hoping they are lucky enough to look after themselves... I don't know, its a controversial opinion. But, regardless of whether men care or not about their genes being killed off - commuting gene suicide - kind of like a one person genocide - something like what people feel like when being \"erased\" - for some odd reason, society shows time and again that men are always the back of the queue for empathy, even when they are actually being erased, because society knows that since the dawn of time that they are in fact replaceable.\n\nLet's just keep playing the game, why not? Bad thing never happen when we treat men as disposable right?\n\nOne further way for a man to get a Darwin award is to have a relationship with a woman that cannot have a child, if she hides from him that she cannot have a child. Sure, up to her, it's personal and her choice not to say. Equally, some men might not want to say that they cannot have kids, or hide that they are a drug addict, or pretend they are much more wealthy than they are, despite being totally broke and in massive debt. Up to them right? He's never laying an trap. Right? It's his business whoever he happens to be.\n\nSure, I'm with her, it's not a trap. Men have the right to withhold any information from who they are dating, regardless of what emotion it would cause if a woman were to find out the truth about him, or what that truth was. He is what is is, and if she's attracted to him that's all she needs to know. /s.\n\nAs it happens, I've had sex with a transwoman, and might potentially date one long term in the right circumstances. But it is not virtuous with withhold information a potential partner. You have a right to, but that does not make it not a trap, when crucial relationship information is being withheld. Of course everyone from gay men, effeminate men, to transwomen, or  bipolar women, or anything that can effect the success of passing on genes - *are not traps*. No-one is fundamentally \"A TRAP\". But everyone is equally capable of trapping someone about the evolutionary potential, or attraction otherwise that they can offer. I do consider it immoral not to be honest about things that are fundamental to a relationship. I have facts about me that if I were to withhold from a woman, she would be within her rights to say it feels just as bad as rape if I were to have a sexual relationship with her and withhold - we all do, no-one gets to say. Of course it isn't rape, or illegal, but it's at very least entrapment. I don't get to say what information being withheld is \"not a trap\". I would never tell women that it's simply my right to withhold that information, regardless of what feeling that may manifest itself in in the woman - and say it's simply my right and her concerns are just \"sexist/abelist/misandrist\".\n\nOf course homophobia and transphobia is a bad thing, but that doesn't deny people a right to dating preferences, no matter where they come from, whether related to evolution or not. If a man claiming to be heterosexual is not attracted to blond haired women, blond women cannot claim he is \"not heterosexual\" because they're blond and that man is not attracted to her, despite being a real woman. Or fat/bipolar/tall/anorexic/Chinese/tomboy/homeless/aggressive/has a child/doesn't have children/trans/Jewish/white. All men that don't date or are not attracted to any type of woman is still heterosexual. Some men might happen to face significant backlash if entrapped by someone of a particular type, through no fault of their own. I know of an Indian man that commuted suicide when he was in love with a white woman because his family wouldn't accept her, and was shamed. It's bad, but not because it's whitephobia. And at least she didn't entrap him, it would have been incredibly irresponsible if it were possible to hide that she were white and did. The Caste system is bad, but people have the choice to it, along with racial dating preferences. Some men might not be ready do deal with a question of what it means to date a transwoman, regardless of the society they come from, and why they are not. Women who don't date homeless men are OK, but having men live on the street is still a bad thing, along with throwing them out on the street.\n\nNo-one is a trap, but people can lay traps. Don't be a manipulative trap and erase someone's feelings about what they find or chose are their dating preferences.\n\nI'd potentially date a transwoman, but never an incompassionate, unsympathetic, manipulative one, to anyone's dating preferences or mine.\n\nThis is what people are often saying when they say \"traps are gay\". When these kind of \"traps\" happen, the entrapment is being justified with a new kind of trans specific heterophobia. Men that don't want to date transwomen are OK, still heterosexual, and can be annoyed to any degree when entrapped. Don't be irresponsible. It's also OK to be heterosexual and date transwomen, of course.",
    "title": "ContraPoints has cisgender heterophobia. Traps are indeed not gay, but entrapment is not virtuous.",
    "subreddit": "MensRights",
    "timestamp": 1549660511,
    "score": 4,
    "keyword": "indian judge"
  },
  {
    "text": "The first time I bought condoms.  \n\nI'm Indian and as you can imagine, sex is a taboo subject in my country. Most people here just like to pretend that it doesn't exist. Female sexuality is a subject that's never to be touched with a 20 foot pole.\n\nAt 22, I decided I was ready to have sex. I hadn't started dating, as I was still living with my parents. But I did want to get sex out of the way. So this guy who attended my university and I agreed to meet up at his place when his parents would be out.\n\nI decided to buy the condoms myself. Some of my friends had said that they always made their boyfriends buy them, as men are a lot less likely to be judged. I just wanted to see what it would be like. I went into the drug store near my uni and picked up a whole bunch of different kinds - dotted and ribbed, flavored etc.\n\nI wanted to think of myself as a confident person, who did not allow herself to be affected by what other people thought. But as I stood in line behind a few people, I couldn't shake off the feeling of nervousness that came over me. I was beginning to worry what the shop owner or the other customers would think. I tried to push these thoughts away, telling myself they were strangers that I'd never see again.\n\nHowever, no drama, no awkwardness ensued. The shop owner, a middle aged man, didn't give me weird looks, didn't made any snide comments, didn't ask if I was married. He treated me the way he would any other customer. The lady right behind me did stare at my condoms, then back at me, then back at my condoms, then back at me again. But other than that there was no unpleasantness.\n\nI know this doesn't sound like a big deal, but given the time and the place, it certainly was. Back then, I was not the woman that I am today and if someone had said something inappropriate, I don't think I would have been able to defend myself. I probably would have just left the store with anger, a sense of helplessness and no condoms. But that shop owner's conduct made all those worries disappear.\n\nAs I left the store, I realized that this is exactly what buying condoms should be like, no different from buying groceries. It shouldn't have to be an \"adventure\". It shouldn't be a big deal.\n\nI'd love to know what your first time purchasing condoms was like. Please do let me know in the comments.",
    "title": "The first time I bought condoms.",
    "subreddit": "Feminism",
    "timestamp": 1565599096,
    "score": 401,
    "keyword": "indian judge"
  },
  {
    "text": "A female student in my college was raped. We need help to reconstruct our college rules. \nTL;DR: A Indian female student was raped. The college might be at fault but theres a possibility of a cover up. Need to set things straight.\n\nThis is my first post in this subreddit. I put all my trust on my fellow redditors to help us in this extremely grave situation.\n\nThe college under discussion is in Tamil Nadu, India. A female student was raped by an outsider right outside the gates of the college campus. The girl, who was with another male friend, was confronted by a history-sheeter who posed as a policeman on duty early in the morning around 3 a.m. FYI, the female students residing in hostel arent allowed into the campus OR the hostel beyond curfew hours. Having nowhere to go, the duo tried to pass time until sunrise near a busstop opposite the campus. Neither of the two students knew the local language. Taking advantage of this, the culprit physically hurt the male friend, took the girl in the pretense that he would take her back to hostel, but instead assaulted her and raped her,and brought her back to the same busstop.\n\nA police complaint was filed later and the culprit was nabbed. Both the male and female students are receiving medical attention as i type this post.\n\nSeveral newspaper outlets caught onto this and some are trying to blame the girl falsely accusing her of being intoxicated. \n\nThe poor girl could have been saved, had the college administration allowed her to enter her hostel after curfew.\n\nMy campus has been historically very rude and sexist towards female students. We had to face professors who are downright sexist, discriminatory, moral-policing-happy and casteist(FYI caste is a form of social diacrimination rampant in India for ages. Though the state of Tamil Nadu has had a better culture of anti-caste sentiments than other states, some people never change). Investigations into such issues have NEVER borne any fruit. \n\nFemale students face immoral curfew rules and moral policing that makes hostel life similar to a prison sentence. The neighbourhood where the college is situated is a bad one, with a history of dacoitery, thievery,molestation, assault, etc. The only safe space for the girl students are their hostels, to which the girl was denied entry. Right from the way female students have to dress to the way they have to interact with male students, theyve been targetted in most walls of their college life. A Women's Cell in campus hasnt done much for the welfare of its female students. Rather, theyve only succumbed to the popular mindset that female students \"have to suck it up amd move on\" =(\n\nWe as students would like to raise awareness among our past and present students, gain some solidarity, stage some active form of dissent towards the sexist college administration and reconstruct the rules that are applicable to female students in campus. Some of us alumni are in far off places, but can reunite over social networking and electronic media.\n\nI request my fellow redditors to suggest ways to make the college administration uncomfortable enough to come out of their dwlusional bubble. Any ideas for protests, sit-ins, change in legislature, etc is appreciated. \n\nWe are very desperate to teach the old-fashioned college administration a lesson in how students are supposed to be treated and not judged based on the way we dress or talk to male students.\n\nThanks in advance. I sincerely hope y'all respond with ideas.",
    "title": "A female student in my college was raped. We need help to reconstruct our college rules.",
    "subreddit": "Feminism",
    "timestamp": 1565093872,
    "score": 15,
    "keyword": "indian judge"
  }
]