[
  {
    "text": "How the female CEO of an Indian startup avoids hiring sexist men",
    "title": "How the female CEO of an Indian startup avoids hiring sexist men",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1560535250,
    "score": 826,
    "keyword": "indian ceo"
  },
  {
    "text": "Pilot or Engineer for an Indian ? Throwaway account cuz real account followed by my cousins. And we aren’t really close. \n\nI am an 17 year old Indian boy and am preparing for one of the most difficult entrance exams in entire Asia. Know as JEE (Joint Engineering Examination). It’s extremely difficult but it gets you to IIT (Indian Institute of Technology) which is the best for engineers in India. Sundar Pichai (CEO of Google) is an IIT alumni. \n\nSo, I am positive I will not be able to clear this exam but if I get average marks I will be able to get admission in the best private college of India.  And end up getting a job for $1500 a month. My parents are really hoping I clear this examination and get to IIT. I love them and I do not want to let them down.  \n\nBut I have a dream of becoming a pilot. I have been fascinated with planes my entire childhood and would love to fly one. I want to work for Gulf airlines like Emirates or Etihad and make it my job. \n\nI don’t have the courage to break my parents heart. They will surely support my decision but they won’t be proud of me. They won’t look at me the same way they would’ve if I were an IITian. Btw, once I become an Captain for a Gulf airline, I can easily earn $10,800 monthly with rent paid. \n\nWhat should I do ?",
    "title": "Pilot or Engineer for an Indian ?",
    "subreddit": "careerguidance",
    "timestamp": 1567157549,
    "score": 2,
    "keyword": "indian ceo"
  },
  {
    "text": "Do you think minorities are well represented in this industry?  This is probably a more US-centric question, but I guess could apply to the rest of the West.\n\nI don't see many latino/as and black people in software development except for maybe one per medium sized company or one out of a 100. They seem to be more represented in hardware IT.\n\nAmong minorities, I definitely see many Indians and Chinese men on the software side and many of them have gained the highest positions in companies (Microsoft CEO, Alphabet CEO, Nvidia CEO, etc.). Off the top of my head, I can't even think of a black or hispanic CEO in tech or among tech VCs.\n\nAmong white women, the representation is growing, but not necessarily in dev. It's usually positions like PM, UX or maybe front-end dev. Chinese and Indian women are more represented on the software side, though I've seen it more in quality than development. As for black and latina women, I've only seen representation in the Bay Area and even then, that's next to nothing.\n\nI know there are hiring biases and other factors that get in the way such as CTCI tests, salaries, perceptions, lack of interest among the groups, social climate and so on.\n\nDoes anyone here think it's a problem that can ever be fixed? Doesn't think it's a problem at all? I'm trying to get perspectives for career reasons.",
    "title": "Do you think minorities are well represented in this industry?",
    "subreddit": "cscareerquestions",
    "timestamp": 1546286980,
    "score": 3,
    "keyword": "indian ceo"
  },
  {
    "text": "Starting 4th year of graduation, thinking of applying for job, couple of questions. Hi, am new here and wanted some advice , Hope you could help   For the context about me, I am an Indian btech 4th year cse student in a low end 3rd tier college .\nI think i am now ready to look into job side of this world, but have lots of doubts , read my story.  \n\nI have been learning android for last 2 years. Most of the time i have been trying to understand how stuff works in android , but i have also gained a few other skills ( python programming, kotlin/flutter basics data analysis basics, testing, some graphic designing, aweful web dev ,etc). But i really want to work with Android. I don't have any specific Salary figure in mind, but i guess my knowledge is better or atleast par with most of the good android developers.   \n\nSo i want to know how is this fresher/placement thingy work?   \n\n1.) GETTING KNOWN? : How can i make some good android based company aware that I am available for hiring? Should i start emailing every android related company that i know of? Should i start listing my profile on recruitment sites like linkedin or internshala? This year it is being said that companies will come for placements. From the status of my college, they are going to give me way to less $ , nd i know am not going to like any of them, but i guess i have to sit for them too.\n\n2.INTERVIEW OR DIRECT PLACEMENTS?  : I am currently starting my 4th year in clg. Afaik , 4th year isnt that strict and their can be leniency in terms of attendance. But my college is a place full of political cun*s in the name of directors and HODs and I don't know if they are again going to enforce the ugly 75% mandatory criteria they have been trying to enforce on our batch since last 2 years. Plus if the company is from a different state/country , then my attendance would definitely not suffice.  \n\nSo mainly i am unsure if somehow a company hires me, i would be able to start immediately. I heard that there are interviews for job recruitment after which the candidate is binded with an agreement to do some months training followed by permanent working after college completion.   \n\nThis type of agreement is  actually suitable for me, since from what my friend tells me, trainings can be lenient and understanding regarding exam preparations nd stuff.  \n\nSo what do company usually chooses? Binding a fresher on immediate working basis or do they consider graduate completion?  \n\nAlso, i suck at competitive coding. Do i need to polish myself on that or some company is willing to give me chance on the basis of my other skills 🙈(okay, no kidding , that's a serious question. I need to either work on getting better in competitive or build more apps since I don't have  a lot of full fledged apps on my resume)  \n\n3.) ANDROID OR EVERYTHING? From what i have heard, working as a professional fresher is more like being an allrounder than being a domain specialist. But as i already stated, i really dig android and that's no small framework. I may do other stuff too, but it won't interest me nd my output might be less efficient than expected.\nSo freshers can really be asked to do any stuff? Or can i still be in the area i like being into?  \n\n4.) ESTABLISHED COMPANY OR START-UP? Apologies for a general debate starter. Ignoring the business side of the conversation ( job safety vs more salary, experience, etc) the thing that's most important for me is the presence of a team. I want someone to assign me a task, whose vision i could follow, from whom i could learn, and some other people who are supportive and doing the same amount / similar work that am doing . This is so much import8 for me that i can easily ignore other factors for a better team. I once took a call from a startup ceo who hired me, a 2 month old android beginner at that time, as the \"lead android developer\"  \n\nBut if am being on a team where i am supposed to do any random stuff that is assigned, then obviously this whole point of \"visionary, helpful leader\", \"supportive team,\"etc goes moot, i guess.  But anyways, established company or start ups?  \n\n\n5. ANY other stuff that you would like to share? Are my priorities wrong? Please share, i would be grateful",
    "title": "Starting 4th year of graduation, thinking of applying for job, couple of questions.",
    "subreddit": "cscareerquestions",
    "timestamp": 1563999793,
    "score": 0,
    "keyword": "indian ceo"
  },
  {
    "text": "Low pay gender discrimination in Australia If you live in Australia - and this applies generally in Western countries - you will hear the moaning and complaining about women having a pay gap with men. Women have all the bad jobs, men are arseholes who murder their wives, and we need to rape the reputation of men as a group and provide the good jobs to women not men on the basis of gender to make all this iniquity right.\n\n&#x200B;\n\nYou've heard the spiel, right.\n\n&#x200B;\n\nTo this I have two words of response: Taxi. Driver. \n\n&#x200B;\n\nOf course women usually primarily care for young children, and schools during the day primarily care for older children. Sure there are exceptions, higher earning mum goes out to work, dad stays home and enjoys himself with baby - good on them. Not many women want that, they want to mother the babies and they want hubby to earn well to make it easy. \n\n&#x200B;\n\nGiven this, and how competitive it is to reach senior positions in competitive workplaces (ie. all workplaces), I find it not surprising that there are so few married women with children in the highest levels of management, eg. board level or senior exec. I find it extraordinary and manipulated - although given the endless rounds of women promotion (literally, like into the juicy senior job everyone wants) and male reputation tarnishing I'm not surprised - that THAT THERE ARE SO MANY WOMEN IN VERY SENIOR POSITIONS. Sometimes you get a talented go-getter who gives up everything including family for career - Julie Bishop, the former foreign minister of Australia, is a good example of this. She earned it. However, given the time out for family commitments, it boggles my mind that married women with multiple children would make it to the top without being given the job based on their possession of a vagina. In other words, you need manipulation in the extreme in favour of female applicants and against male ones to get the numbers of senior women in the workplace we have now, let alone this being an example of discrimination AGAINST women.\n\n&#x200B;\n\nLet's get back to taxi drivers. In Australia being a taxi driver has been one of the lowest status jobs out there. They work insane hours to support families and typically earn somewhere around $8 an hour, in a socialist country like Australia where minimum wage is set at around the low $20s per hour. They have to sit all day long, which is awful for health and posture, they're exposed to the sun, they have to deal with sometimes drunk and abusive customers and not uncommonly physical assaults. Surely if we want to help low income earners, taxi drivers would be the perfect place to start. Surely a few rallies to parliament house, some politicians speaking out for them, the charities and social services organisations prioritizing taxi drivers income. Well....not exactly.\n\n&#x200B;\n\nAny guess why not? It wouldn't be anything to do with the fact that something like 98% of taxi drivers are men, would it? In Australia, Indian immigrant men, by the way.\n\n&#x200B;\n\nLook, if like me you have a dick, and one or two testicles swinging on either side of it, you're not going to get any airtime. You're the aresehole, remember? So that taxi driver who earns $8 an hour is the arsehole, oppressing that focused white or Asian early 40s women who gets promoted to chair of the board and earns a few million yearly. But he's got a dick, so we already know he's bad, so why am I even writing this?\n\n&#x200B;\n\nMen I have no idea what to do in a society that hates my gender so much. I mean for us as a group, on an individual personal level there's usually plenty we can do. The way I see it, things went so nuts so quickly all I can see is at least making men INTERNALLY aware of how the system is stacked against them. I share many others' skepticism of any positive change to men's conditions through the political process, or even a willingness to block their further erosion through more and more man-hatred expressed through law and social beliefs. The only thing I believe I can do beyond the personal level is to at least make as many men as possible aware of the how under siege we, as a gender, have become.\n\n&#x200B;\n\nGood luck to all, but most particularly to Indian male taxi drivers, and least particularly to wealthy early 40s CEOs of large companies who got there mainly because they had a vagina.",
    "title": "Low pay gender discrimination in Australia",
    "subreddit": "MensRights",
    "timestamp": 1550710749,
    "score": 16,
    "keyword": "indian ceo"
  }
]