[
  {
    "text": "Please throw some in my current dark situation Hey I am 22(M), automobile engineering graduate from India, who truly see myself becoming financially independent in my 40s. I worked at a company for 1 year since it was emotionally and physically draining and had to work for almost 13-16 hours per day (for my non- indian friends, this is how work-life imbalance In India is ). I resigned my job had some savings, traded and lost my savings( please don't judge, I know the game and as I was improving my emotions in trading the capital was finished, since the money was tooo less). My parents are employed so now I am at my home, doing an online course( which I am not interested in, since I am doing it just to show my parents that I am working on  myself). I really wanna do something on my own, thinking of.doing dropshipping. I am a person who can really work hard and I know it myself. My dear friends,\n1) can somebody give some ideas for some passive income for myself \n2) What is your opinion in going back to bangalore and working as a delivery boy during night and working On a side hustle during daytime \n3)What are some options that I can apply with my degree in management and maybe hospitality field \n4)how is abroad studies now, I am in a dilemma whether to leave since I hear India is the next big thing \n\nCan everybody post an opinion and if somebody is in the same boat or have been In this  boat before, throw some light kings , throw some light",
    "title": "Please throw some in my current dark situation",
    "subreddit": "jobs",
    "timestamp": 1698493043,
    "score": 3,
    "keyword": "indian judge"
  },
  {
    "text": "Any advice please?  \n\nHello Everyone. I came across this sub just a few minutes ago and would very much appreciate any input I can get just now. For context I'm a nursing student in the Uk specifically and I'm doing adult nursing. when it comes to all things theory and uni course work I always get an A but my biggest problem so far has been placements.\n\nThe more I go on placements the more scared i get about a future one because I never seem to get the score I'm expecting . I try my hardest and my best but something is always lacking either so e certain staff not taking a liking to me or some staff thinking I'm not working as much as I should. I'm not good at small talk and gossip shared between nurses probably because I'm a guy and I just stand to the side keeping quiet.\n\nit seems like no matter what I do I cant get a good grade. I've experienced microaggression from people I've never worked with in a ward from gossip told behind my back and all these is just skewing with my perspective of this course.\n\nI cant change myself to please people just to get a better grade. an Indian friend of mine gave me an advice saying that because of our colour (I'm Black) wed be judged even before we say anything and I should just go with the flow.\n\nI'm really scared of future placements as well as graduating and meeting co workers who behave this same way sometimes I really doubt myself in this course. Most of the time I'm afraid thinking; Do they like me, will what I say sound weird, will my accent be difficult to get past, its so very draining.\n\nPlease help me out with any advice, anything you think I should incorporate or do better. I'm really tying to be positive here.",
    "title": "Any advice please?",
    "subreddit": "nursing",
    "timestamp": 1694043499,
    "score": 2,
    "keyword": "indian judge"
  },
  {
    "text": "Most confusing and anxious phase in my life, can somebody guide me ? Hey I am 22(M), automobile engineering graduate from India, who truly see myself becoming financially independent in my 40s. I worked at a company for 1 year since it was emotionally and physically draining and had to work for almost 13-16 hours per day (for my non- indian friends, this is how work-life imbalance In India is ). I resigned my job had some savings, traded and lost my savings( please don't judge, I know the game and as I was improving my emotions in trading the capital was finished, since the money was tooo less). My parents are employed so now I am at my home, doing an online course( which I am not interested in, since I am doing it just to show my parents that I am working on  myself). I really wanna do something on my own, thinking of.doing dropshipping. I am a person who can really work hard and I know it myself. My dear friends,\n1) can somebody give some ideas for some passive income for myself \n2) What is your opinion in going back to bangalore and working as a delivery boy during night and working On a side hustle during daytime \n3)What are some options that I can apply with my degree in management and maybe hospitality field \n4)how is abroad studies now, I am in a dilemma whether to leave since I hear India is the next big thing \n\nCan everybody post an opinion and if somebody is in the same boat or have been In this  boat before, throw some light kings , throw some light",
    "title": "Most confusing and anxious phase in my life, can somebody guide me ?",
    "subreddit": "careerguidance",
    "timestamp": 1698493414,
    "score": 0,
    "keyword": "indian judge"
  },
  {
    "text": "Dealing with with racial insecurity / hypervigilance 31M gay desi guy living in a progressive/liberal US city here. I have faced a lot of racism (ranging from overt to casual/microaggressions) in my life and it has caused me a lot of CPTSD and stress. This has lead me to being very hypervigilant and insecure about my race.\nI’m already doing therapy but thought might wanna ask here.\n\nMy insecurity is less about “I am ashamed to be brown” but more about “I wish I didn’t have to go deal with all the cultural stereotype baggage”. More examples of triggers include:\n\n- Everytime I am in diverse group of people, I automatically put myself in some sort of social hierarchy. E.g. if I meet a hot white guy, I’ll automatically assume they won’t be into me or that I’d be judged for my skin color\n\n- I watch a movie/TV show set in Europe or hear friends talking about how London/Barcelona is so beautiful and fun and instantly wonder why can’t people talk the same about India (versus the usual stereotypes of poverty, pollution, casteism. India is beautiful, it has some of the most stunning landscapes and historical sites in the world)\n\n- I meet a non-Indian person and they instantly tell me about how they have an Indian coworker who got an arranged marriage or an gay Indian friend who is married but closeted (I don’t make any assumptions when I meet a white person, for e.g. that they have 4 step parents or that their parents are racists)",
    "title": "Dealing with with racial insecurity / hypervigilance",
    "subreddit": "asianamerican",
    "timestamp": 1684296201,
    "score": 13,
    "keyword": "indian judge"
  },
  {
    "text": "Hypocrisies of Feminists Feminists are the biggest hypocrites of everything. We all know this by now. Add any other examples of hypocrisies in the comments.\n\n* They preach about stop body shaming yet will insult men with \"small dick energy\" or call them a \"little man\".\n* Claim they want men to open up their feelings but insult them with words such as fragile, fragile male ego, fragile masculinity, toxic masculinity, emotional, sensitive, etc. They are the same people to hold up a mug saying \"male tears\" too.\n* They want their experiences invalidated yet will always claim that women attempt suicide at higher rates (which is not true) when it comes to men killing themselves more. This is invalidating men's experiences.\n* They want to not be judged by their number of sexual partners but will call any man who disagrees with them incels or virgins. They will further complain about how men should stop valuing themselves and other men by their body count yet women clearly do the same thing in this example.\n* They do not want women to be generalized but then proceed to generalize all men as rapists, creeps, pedophiles, murderers, etc. On the topic of rape, men are not even close to the supermajority of rapists compared to women but feminists refuse to admit this.\n* They view gender based scholarships and affirmative action as equality despite women already making up a majority of college enrollment.\n* Feminists claim that they want to abolish all gender roles but will never adhere to them themselves. They demand men pay the first date if not all the dates, demand that men ask them out, demand men propose, demand a man taller or substantially taller than them. They will never advocate for more women working in dirty lower paying jobs, just the white collar cushy office jobs. They only want to abolish gender roles that are convenient to them.\n* They claim \"my body, my choice\" but will actively genitally mutilate (circumcise) their sons. It is mostly done by women and requires a mother's consent. They do nothing when it comes to the selective service or the draft for men.\n* They call men misogynistic for dating preferences such as having no body hair or not being fat but demand a man 6 feet tall with a 6 figure income.\n* Feminists claim that men never take accountability when men get longer sentences for the same crimes.\n* Feminists will claim that the suffering of women is a man's fault and the suffering of a man is a man's fault or the sufferers fault too. How much have they done to address the growing educational gap between men and women? When women fall behind in education, it is a man's fault. When men fall behind in education, it is a man's fault.\n* Feminists will whine and bitch about how most of the top 0.000001 % are male billionaires while never talking about how most homeless people are men (who there are a lot more of than billionaires).\n* Feminists claim that their opponents are sexist despite asserting that \"men are trash\" or \"#killallmen\".\n* Feminists will claim they are not racist but will characterize Indian men as creeps and sexual predators.",
    "title": "Hypocrisies of Feminists",
    "subreddit": "MensRights",
    "timestamp": 1691023832,
    "score": 144,
    "keyword": "indian judge"
  },
  {
    "text": "In Canada, a dad wrote about having evidence of being a victim of domestic violence and his girlfriend being abusive towards their baby, yet he is being criminalized as an abuser based on her false claims In Canada, a dad wrote about having evidence of being a victim of domestic violence and his girlfriend being abusive towards their baby, yet he is being criminalized as an abuser based on her false claims\n\nHere is my reply in the hopes that it helps to protect child abuse victims and helps to assist domestic violence victims who face discrimination and who wish to seek justice:\n\nI'm not an attorney and this is not legal advice.\n\nIn Canada, you wrote about having evidence of being a victim of domestic violence and your girlfriend being abusive towards your baby, yet being criminalized as an abuser based on her false claims.\n\nFalse allegations of this nature are:\n\n> Misleading Justice\n> Marginal note:Perjury\n\n> 131 (1) Subject to subsection (3), every one commits perjury who, with intent to mislead, makes before a person who is authorized by law to permit it to be made before him a false statement under oath or solemn affirmation, by affidavit, solemn declaration or deposition or orally, knowing that the statement is false.\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/page-32.html\n\nGovernment officials who knowingly participate or who are willfully ignorant of these crimes may be defrauding victims:\n\n> 380 (1) Every one who, by deceit, falsehood or other fraudulent means, whether or not it is a false pretence within the meaning of this Act, defrauds the public or any person, whether ascertained or not, of any property, money or valuable security or any service,\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/section-380.html\n\nEvery person is equal and deserves justice:\n\n> 15. (1) Every individual is equal before and under the law and has the right to the equal protection and equal benefit of the law without discrimination and, in particular, without discrimination based on race, national or ethnic origin, colour, religion, sex, age or mental or physical disability. (2) Subsection (1) does not preclude any law, program or activity that has as its object the amelioration of conditions of disadvantaged individuals or groups including those that are disadvantaged because of race, national or ethnic origin, colour, religion, sex, age or mental or physical disability.\n\n> https://en.wikipedia.org/wiki/Section_15_of_the_Canadian_Charter_of_Rights_and_Freedoms\n\nI would consider if mom's actions create a need to petition the court to change the child custody arrangement:\n\n> 1. Figure out if there has been a significant change\nLook to see if you or your partner's situation has changed.\n\n> If you have to go to court, the court will only make an order changing your decision-making responsibility and parenting time arrangement if there has been a significant change.\n\n> Decision-making responsibility and parenting time used to be called custody and access.\n\n> The conflict between the parents has got worse over time.\nThe parent with decision-making responsibility is always making it difficult for the parent with parenting time to spend time with the child.\n\n> https://stepstojustice.ca/steps/family-law/1-figure-out-if-there-has-been-significant-change-5\n\nConsider a CCLA complaint about police misconduct towards you as a domestic violence victim as well as your child as a victim of child abuse:\n\n> Fighting for reasonable limits to police powers, and accountability for abuse.\n\n> https://ccla.org/our-work/criminal-justice/police-powers-accountability/\n\n> In addition, in Canada – as in the United States and the United Kingdom – a judge is subject to disqualification for an “appearance of bias.” However, in a 2003 case, Wewaykum Indian Band v. Canada, 2 S.C.R. 259, 2003 SCC 45, Canada’s Supreme Court articulated the proper test for disqualification for appearances somewhat differently than any American court ever has when it asked: “What would an informed person, viewing the matter realistically and practically – and having thought the matter through – conclude? Would this person think it more likely than not that the judge, whether consciously or unconsciously, would not decide fairly?” The Court added that “[w]hether there is a reasonable apprehension of bias is to be assessed from the point of view of a reasonable, fair minded and informed person.” Id. At 74.\n\n> https://www.judicialrecusal.com/recusal-disqualification-canada/\n\nIf the judge in my case is signing orders harming my child and is intentionally refusing to examine evidence of my child's abuse, mom's domestic violence, and is through their refusal to respect my and my child's charter rights to equal treatment, and is therefore endangering the welfare of my child as well as myself, I would consider a judicial complaint. Each province is different. Here is information for Ontario:\n\n> Making a Complaint\n\n> If you have a complaint of misconduct about a provincial judge or a justice of the peace, you must state your complaint in a signed letter. The letter of complaint should include the date, time and place of the court hearing and as much detail as possible about why you feel there was misconduct. If your complaint involves an incident outside the courtroom, please provide as much information as you can, in writing, about what you feel was misconduct on the part of the judge or justice of the peace.\n\n> You do not need a lawyer to make a complaint and there is no fee. Please indicate in your letter if there is a specific title, pronoun or form of address you would like Council staff to use when communicating with you.\n\n> https://www.ontariocourts.ca/ocj/conduct/do-you-have-a-complaint/\n\nIf the prosecuting attorney is doing this same, or is using orders as a weapon to protect mom as a child abuser and as a domestic violence perp, including harassing me as a victim and tampering with evidence by purposefully refusing to review it:\n\nI would consider making a complaint about the attorney. Each province is different. Here is information for Ontario:\n\n> Steps to Make a Complaint about a Lawyer or Paralegal\n\n> https://lso.ca/protecting-the-public/complaints/how-to-make-a-complaint\n\nIf I felt the police were not protecting me, especially because of discrimination, I would consider contacting an attorney and contacting Canada Justice:\n\nContact the Minister\nEmail\nmcu@justice.gc.ca\n\nMailing address\nThe Honourable David Lametti\nMinister of Justice and Attorney General of Canada\n284 Wellington Street\nOttawa, Ontario K1A 0H8\n\nFax\n1-613-957-3559\n\nGiven that this seems to be a pattern or practice of potentially illegal discrimination based on sex, it may be the basis for a civil rights class action.\n\nClass action in Canada:\n\n> In Canada, a class action is a form of procedural collective relief brought under specialised class proceedings legislation whereby one or more claimants can seek collective relief for themselves and on behalf of individuals who have similar claims. In a certified class proceeding, a court can adjudicate \"common issues\" relating to class members in a single proceeding, whereby \"success for one is success for all\".\n\n> https://content.next.westlaw.com/practical-law/document/I99a83254410011e598dc8b09b4f043e0/Class-collective-actions-in-Canada-overview\n\nI wish you the best of luck in your search for justice.",
    "title": "In Canada, a dad wrote about having evidence of being a victim of domestic violence and his girlfriend being abusive towards their baby, yet he is being criminalized as an abuser based on her false claims",
    "subreddit": "MensRights",
    "timestamp": 1689529581,
    "score": 99,
    "keyword": "indian judge"
  },
  {
    "text": "A male litigant in Canada complained he has been given less than 48 hours notice for a court appearance, that this has happened repeatedly, his complaints about this have been ignored, and he is facing serous emotional distress as a consequence A male litigant in Canada complained he has been given less than 48 hours notice for a court appearance, that this has happened repeatedly, his complaints about this have been ignored, and he is facing serous emotional distress as a consequence \n\nI'm not an attorney and this is not legal advice.\n \nYou wrote: (above)\n\nI understand you're in Canada.  I may reference various Provinces. Please consult your local Province for various details.\n\nAn intentional and repeated pattern or practice of denying you or fathers in general adequate notice may be part of a conspiracy to deny you adequate time to prepare. If court administrators are knowingly violating court rules, laws, and the charter rights of litigants, they may be committing:\n\nFraud\n\n> Fraud\n\n> 380 (1) Every one who, by deceit, falsehood or other fraudulent means, whether or not it is a false pretence within the meaning of this Act, defrauds the public or any person, whether ascertained or not, of any property, money or valuable security or any service,\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/section-380.html\n\nYou describe severe emotional distress as a consequence. To the extent that such officials are committing these acts in a domestic relations matter, with or on behalf of the other relationships partner, they may be acting as willing agents of domestic violence. In such acts, they may be discriminating against male victims of domestic violence. Any related discrimination may be a violation of charter rights:\n\nDiscrimination against domestic violence victims and child abuse victims on the basis of sex is illegal:\n\n> Canadian Charter of Rights and Freedoms\n\n> 15. (1) Every individual is equal before and under the law and has the right to the equal protection and equal benefit of the law without discrimination and, in particular, without discrimination based on race, national or ethnic origin, colour, religion, sex, age or mental or physical disability. (2) Subsection (1) does not preclude any law, program or activity that has as its object the amelioration of conditions of disadvantaged individuals or groups including those that are disadvantaged because of race, national or ethnic origin, colour, religion, sex, age or mental or physical disability.\n\n> https://en.wikipedia.org/wiki/Section_15_of_the_Canadian_Charter_of_Rights_and_Freedoms\n\nSuch acts may be emotional abuse:\n\n> There are different kinds of abuse\n> Abuse is harm that can be physical, sexual or emotional. Neglect is also a form of abuse.\n\n> Emotional Abuse\n> Saying mean things to another person to hurt them is a way of bullying, scaring, or putting them down. So is threatening to hurt someone or to do something mean to them, like destroying their toys or other possessions or harming their pets.\n\n> https://www.justice.gc.ca/eng/cj-jp/fv-vf/ca-me.html\n\nIf they falsify or destroy records of their acts which undermine the charter rights of their victims, or misrepresent their actions, they may be:\n\n> Misleading Justice\n> Marginal note:Perjury\n\n> 131 (1) Subject to subsection (3), every one commits perjury who, with intent to mislead, makes before a person who is authorized by law to permit it to be made before him a false statement under oath or solemn affirmation, by affidavit, solemn declaration or deposition or orally, knowing that the statement is false.\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/page-32.html\n\nBy giving only male litigants very limited notice, they may be willfully attempting to pervert the course of justice, a crime:\n\n> Obstructing justice\n\n> 139 (1) Every one who wilfully attempts in any manner to obstruct, pervert or defeat the course of justice in a judicial proceeding,\n\n> https://laws-lois.justice.gc.ca/eng/acts/c-46/page-32.html\n\nThe blatant display of shameless and plainly unfair acts including denying adequate notice may be part of a pattern or practice of intimidating male litigants. That is a display that they will not be treated fairly, and a form of intimidation of male justice system participants, possibly a crime:\n\n> Intimidation of a justice system participant or a journalist\n\n> 423.1 (1) No person shall, without lawful authority, engage in conduct referred to in subsection (2) with the intent to provoke a state of fear in\n\n> (b) a justice system participant in order to impede him or her in the performance of his or her duties; or\n\n> “justice system participant” means\n\n> (b) a person who plays a role in the administration of criminal justice, including\n> (v) an informant, a prospective witness, a witness under subpoena and a witness who has testified,\n\n> Canadian Criminal Law/Offences/Intimidation of a Justice System Participant\n\n> https://en.wikibooks.org/wiki/Canadian_Criminal_Law/Offences/Intimidation_of_a_Justice_System_Participant\n\nThe individuals involved in these acts may feel comfortable with these acts, possibly as a standard pattern or practice, because they have entered into an agreement together to knowingly violate the rights of male litigants. That may be a crime:\n\n> Conspiracy\n\n> 465. (1) Except where otherwise expressly provided by law, the following provisions apply in respect of conspiracy:\n\n> (b) every one who conspires with any one to prosecute a person for an alleged offence, knowing that he did not commit that offence, is guilty of an indictable offence and liable\n\nI would consider a motion to recuse a judge if they failed to ensure I was given proper notice.\n\n> In addition, in Canada – as in the United States and the United Kingdom – a judge is subject to disqualification for an “appearance of bias.” However, in a 2003 case, Wewaykum Indian Band v. Canada, 2 S.C.R. 259, 2003 SCC 45, Canada’s Supreme Court articulated the proper test for disqualification for appearances somewhat differently than any American court ever has when it asked: “What would an informed person, viewing the matter realistically and practically – and having thought the matter through – conclude? Would this person think it more likely than not that the judge, whether consciously or unconsciously, would not decide fairly?” The Court added that “[w]hether there is a reasonable apprehension of bias is to be assessed from the point of view of a reasonable, fair minded and informed person.” Id. At 74.\n\n> https://www.judicialrecusal.com/recusal-disqualification-canada/\n\nIt seems like the judge involved may have knowingly declined to follow the law. If I felt this were true, I would consider a judicial complaint. Each province is different. Here is information for Ontario:\n\n> Making a Complaint\n\n> If you have a complaint of misconduct about a provincial judge or a justice of the peace, you must state your complaint in a signed letter. The letter of complaint should include the date, time and place of the court hearing and as much detail as possible about why you feel there was misconduct. If your complaint involves an incident outside the courtroom, please provide as much information as you can, in writing, about what you feel was misconduct on the part of the judge or justice of the peace.\n\n> You do not need a lawyer to make a complaint and there is no fee. Please indicate in your letter if there is a specific title, pronoun or form of address you would like Council staff to use when communicating with you.\n\n> https://www.ontariocourts.ca/ocj/conduct/do-you-have-a-complaint/\n\nI would consider making a complaint about any attorneys involved. Each province is different. Here is information for Ontario:\n\n> Steps to Make a Complaint about a Lawyer or Paralegal\n\n> https://lso.ca/protecting-the-public/complaints/how-to-make-a-complaint\n\nI might consider these acts a fraud or scam, and report them as such:\n\n> How to report fraud and scams in Canada\n> https://www.competitionbureau.gc.ca/eic/site/cb-bc.nsf/eng/04339.html\n\n> Canadian Anti-Fraud Centre\n> Report fraud and cybercrime\n> https://www.antifraudcentre-centreantifraude.ca/report-signalez-eng.htm\n\nIf I felt the police were not protecting me, especially because of discrimination, I would consider contacting an attorney and contacting Canada Justice:\n\nContact the Minister\nEmail\nmcu@justice.gc.ca\n\nMailing address\nThe Honourable David Lametti\nMinister of Justice and Attorney General of Canada\n284 Wellington Street\nOttawa, Ontario K1A 0H8\n\nFax\n1-613-957-3559\n\nIf I felt that this were part of a pattern or practice and other parents and their children were being harmed, I would consider organizing a class action:\n\nClass action in Canada:\n\n> In Canada, a class action is a form of procedural collective relief brought under specialised class proceedings legislation whereby one or more claimants can seek collective relief for themselves and on behalf of individuals who have similar claims. In a certified class proceeding, a court can adjudicate \"common issues\" relating to class members in a single proceeding, whereby \"success for one is success for all\".\n\n> https://content.next.westlaw.com/practical-law/document/I99a83254410011e598dc8b09b4f043e0/Class-collective-actions-in-Canada-overview\n\nI wish you the best of luck in your search for justice.",
    "title": "A male litigant in Canada complained he has been given less than 48 hours notice for a court appearance, that this has happened repeatedly, his complaints about this have been ignored, and he is facing serous emotional distress as a consequence",
    "subreddit": "MensRights",
    "timestamp": 1695176054,
    "score": 61,
    "keyword": "indian judge"
  },
  {
    "text": "An Indian High Court judge calls out 'legal terrorism' of women who misuse the anti-dowry law to harass husbands",
    "title": "An Indian High Court judge calls out 'legal terrorism' of women who misuse the anti-dowry law to harass husbands",
    "subreddit": "MensRights",
    "timestamp": 1692717850,
    "score": 40,
    "keyword": "indian judge"
  },
  {
    "text": "A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney. A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney.\n\nHere is my reply in the hopes that it helps other parents who are seeking justice, and it helps to protect children who are vulnerable to child abuse when their parents cannot effectively represent themselves in an effort to protect their children.\n\nI'm not an attorney and this is not legal advice.\n\nYou wrote: (above)\n\nThe Supreme Court said that people in court have a right to self representation except for people who have a mental illness. If denied the right to self represent, I might ask the judge what mental illness they believe I have and if they have any evidence that I have not seen or sworn testimony from any medical professional I have not yet met.\n\n> Indiana v. Edwards - 554 U.S. 164, 128 S. Ct. 2379 (2008)\n\n> RULE:\n\n> The United States Constitution permits judges to take realistic account of the particular defendant's mental capacities by asking whether a defendant who seeks to conduct his own defense at trial is mentally competent to do so. That is to say, the United States Constitution permits States to insist upon representation by counsel for those competent enough to stand trial under Dusky but who still suffer from severe mental illness to the point where they are not competent to conduct trial proceedings by themselves.\n\n> https://www.lexisnexis.com/community/casebrief/p/casebrief-indiana-v-edwards\n\nIf anyone intentionally creates a web site which deceptively gives the false impression that they are providing public services such as forms, but in reality has broken the links, that may be wire fraud:\n\n> Whoever, having devised or intending to devise any scheme or artifice to defraud, or for obtaining money or property by means of false or fraudulent pretenses, representations, or promises, transmits or causes to be transmitted by means of wire, radio, or television communication in interstate or foreign commerce, any writings, signs, signals, pictures, or sounds for the purpose of executing such scheme or artifice, shall be fined under this title or imprisoned not more than 20 years, or both.\n\n> 18 U.S. Code § 1343.Fraud by wire, radio, or television\n\n> https://www.law.cornell.edu/uscode/text/18/1343\n\nIt is possible that the court officials to whom you spoke insist on you using an attorney, because they believe the attorneys you will hire have been coerced into providing inadequate legal representation.\n\nI previously wrote about a coercive environment for attorneys:\n\n> A lawyer helped a father to stop paying child support for a child which was not his. She was disbarred. The person stating this alleges she was targeted and that lawyers fear retaliation for helping their clients who are fathers.\n\n> https://www.reddit.com/r/MensRights/comments/13uzqrp/a_lawyer_helped_a_father_to_stop_paying_child/\n\nIf this web site is cited in any document as example of how the courts comply with state or federal laws which enable the court to obtain federal funds it may also be:\n\n> (a)Whoever, if the circumstance described in subsection (b) of this section exists— (1)being an agent of an organization, or of a State, local, or Indian tribal government, or any agency thereof— (A)embezzles, steals, obtains by fraud, or otherwise without authority knowingly converts to the use of any person other than the rightful owner or intentionally misapplies, property that— (i)is valued at $5,000 or more, and\n\n> 18 U.S. Code § 666.Theft or bribery concerning programs receiving Federal funds\n\n> https://www.law.cornell.edu/uscode/text/18/666\n\nPossible failure to respect:\n\n> \"There is a fundamental right under the Fourteenth Amendment for a parent to oversee the care, custody, and control of a child.\"\n\n> Troxel v. Granville, 530 U.S. 57 (2000)\n\n> https://supreme.justia.com/cases/federal/us/530/57/\n\nPossible honest services fraud:\n\n> For the purposes of this chapter, the term “scheme or artifice to defraud” includes a scheme or artifice to deprive another of the intangible right of honest services.\n\n> 18 U.S. Code § 1346.Definition of “scheme or artifice to defraud”\n\n> https://www.law.cornell.edu/uscode/text/18/1346\n\n> https://en.wikipedia.org/wiki/Honest_services_fraud\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code § 241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nOther possible federal crimes.\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible cause for a federal civil rights action under:\n\n> 42 U.S. Code § 1983 - Civil action for deprivation of rights\n\n> https://www.law.cornell.edu/uscode/text/42/1983\n\nUS courts provide forms:\n\n> Complaint for Violation of Civil Rights (Non-Prisoner)\n\n> https://www.uscourts.gov/forms/pro-se-forms/complaint-violation-civil-rights-non-prisoner\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A dad complained that the local court basically makes it impossible for him to represent himself, and one example is that the links on the local web site to obtain self representation forms do not work, and when he complains they tell him he must obtain an attorney.",
    "subreddit": "MensRights",
    "timestamp": 1689252434,
    "score": 36,
    "keyword": "indian judge"
  },
  {
    "text": "A father going through a divorce described how his ex-wife's lawyer submitted a degree which the judge signed which had incorrect financial figures without proof which effectively benefited his ex-wife an additional $8,000 from the sale of their marital home A father going through a divorce described how his ex-wife's lawyer submitted a decree which the judge signed which had incorrect financial figures without proof which effectively benefited his ex-wife an additional $8,000 from the sale of their marital home\n\nHere is my reply in the hopes that it helps other parents who are seeking justice, promotes the integrity of the legal system, and protects family resources for the benefit of children.\n\nI'm not an attorney and this is not legal advice.\n \nYou wrote: (Above)\n\nPossible perjury:\n\n> 18 U.S. Code § 1621.Perjury generally\n\n> https://www.law.cornell.edu/uscode/text/18/1621\n\nAnyone may report the crime of perjury to the police.\n\n> 18 U.S. Code § 1622 - Subornation of perjury\n\n> Whoever procures another to commit any perjury is guilty of subornation of perjury, and shall be fined under this title or imprisoned not more than five years, or both.\n\n> https://www.law.cornell.edu/uscode/text/18/1622\n\nPossible:\n\n> Fraud\n\n> Fraud is both a civil tort and criminal wrong.\n\n> In civil litigation, allegations of fraud might be based on a misrepresentation of fact that was either intentional or negligent.  For a statement to be an intentional misrepresentation, the person who made it must either have known the statement was false or been  as to its truth.  The speaker must have also intended that the person to whom the statement was made would rely on it.  The hearer must then have reasonably relied on the promise and also been harmed because of that reliance.\n\n> https://www.law.cornell.edu/wex/fraud\n\nPlease note it is possible that your ex-wife owes her attorney a substantial amount of money. It is also possible your ex-wife does not currently have this amount in readily available funds. It is possible that an attorney may devise a scheme or artifice to increase their client's financial benefit from the sale of any asset such as a marital home for their own financial benefit, to ensure mom has cash equivalents sufficient to pay them promptly. \n\nThe judge may have accepted possibly falsified financial documentation at face value and did not give dad the opportunity to have an impartial hearing to review.\n\nI would consider a motion to recuse the judge.\n\n> Liteky v. United States, 510 U.S. 540 (1994)\n\n> 28 U.S.C. §455(a) requires recusal of a judge in any proceeding in which his impartiality may be questioned.\n\n> https://casetext.com/analysis/judges-motion-to-recuse-removal-on-remand\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n> Complaints Against Lawyers\n\n> The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.\n\n> https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n> Model Rules of Professional Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/\n\nIf any judge or person exercising judicial decision making authority and subject to the judicial code of conduct (e.g. some Title IV-D child support etc. employees or Title IV-E child welfare employees who make judicial recommendations such as child placement, child custody, parenting time, or child support calculations), they may also be subject to complaints under this process, even if they are not attorneys. \n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n> Model Code of Judicial Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>  How to File a Grievance\n> http://jtc.courts.mi.gov/file_a_grievance/index.php\n\nState child support, parenting time, and child protection are all primarily funded under federal law Title IV-D and Title IV-E.\n\n> https://www.law.cornell.edu/uscode/text/42/651\n\n> 42 U.S. Code § 651 - Authorization of appropriations\n\nThe fact pattern you describe suggests they that the other lawyer may have devised a scheme or artifice to defraud or embezzle from the children and parents family money, a federal crime:\n\n> (a)Whoever, if the circumstance described in subsection (b) of this section exists— (1)being an agent of an organization, or of a State, local, or Indian tribal government, or any agency thereof— (A)embezzles, steals, obtains by fraud, or otherwise without authority knowingly converts to the use of any person other than the rightful owner or intentionally misapplies, property that— (i)is valued at $5,000 or more, and\n\n> 18 U.S. Code § 666.Theft or bribery concerning programs receiving Federal funds\n\n> https://www.law.cornell.edu/uscode/text/18/666\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nI wish you the best of luck in your search for justice.",
    "title": "A father going through a divorce described how his ex-wife's lawyer submitted a degree which the judge signed which had incorrect financial figures without proof which effectively benefited his ex-wife an additional $8,000 from the sale of their marital home",
    "subreddit": "MensRights",
    "timestamp": 1689158676,
    "score": 26,
    "keyword": "indian judge"
  },
  {
    "text": "A father complained parents are blamed for the negative behaviors that children exhibit when in the care of their alienating parent. A father complained parents are blamed for the negative behaviors that children exhibit when in the care of their alienating parent.\n\nHere is my response, in the hope that it will help other parents, their children, and families who are attempting to seek justice, and that this information may help protect children from abuse.\n\nI'm not an attorney and this is not legal advice.\n \nI wrote a message to a dad in a similar situation which may help you to seek justice. You can read it here (and several other places)\n\n> A dad says that the mother of his child wants him either in jail or in the ground, and she is manipulating his child to lie to avoid being yelled at by mom. He is fighting to maintain a relationship with child and he feels he is unable to continue.\n\n> https://www.reddit.com/r/MensRights/comments/uzbt02/a_dad_says_that_the_mother_of_his_child_wants_him/\n\nKnowingly making false statements regarding the needs of a child or failing to adhere to standards to protect children and families may be manufacturing a false claim of child abuse:\n\nThe National Association of Social Workers has a Code of Ethics:\n\n> https://www.socialworkers.org/About/Ethics/Code-of-Ethics/Code-of-Ethics-English\n\nPossible misconduct by a social worker:\n\n> Social Workers:\n\n> How To File a Complaint\n\n> Steps for filing a request for professional review\n\n> NASW is very interested in reviewing situations that affect the integrity of our profession.\n\n> https://www.socialworkers.org/About/Ethics/Professional-Review/How-To-File-a-Complaint\n\nA social worker or school worker who may have manufactured a false claim of child abuse is abusing that child. In so doing they are failing to report their own abuse, a crime.\n\n> A person who, while engaged in a professional capacity or activity described in subsection (b) of section 226 of the Victims of Child Abuse Act of 1990 on Federal land or in a federally operated (or contracted) facility, or a covered individual as described in subsection (a)(2) of such section 226 who, learns of facts that give reason to suspect that a child has suffered an incident of child abuse, as defined in subsection (c) of that section, and fails to make a timely report as required by subsection (a) of that section, shall be fined under this title or imprisoned not more than 1 year or both.\n\n> 18 U.S. Code § 2258.Failure to report child abuse\n\n> https://www.law.cornell.edu/uscode/text/18/2258\n\nFalse statements to the the court may be:\n\n> 18 U.S. Code § 1621.Perjury generally\n\n> https://www.law.cornell.edu/uscode/text/18/1621\n\n> 18 U.S. Code § 1622 - Subornation of perjury\n\n> Whoever procures another to commit any perjury is guilty of subornation of perjury, and shall be fined under this title or imprisoned not more than five years, or both.\n\n> https://www.law.cornell.edu/uscode/text/18/1622\n\nMisuse of child protection resources to promote the abuse of children within the home and prevent them from safety within the home is a violation of federal law:\n\n> 42 U.S. Code § 629 - Purpose\n\n> (2)To assure children’s safety within the home and preserve intact families in which children have been maltreated, when the family’s problems can be addressed effectively.\n\n> https://www.law.cornell.edu/uscode/text/42/629\n\nPossible criminal conspiracy against rights:\n\n> \"If two or more persons conspire to injure, oppress, threaten, or intimidate any person in any State, Territory, Commonwealth, Possession, or District in the free exercise or enjoyment of any right or privilege secured to him by the Constitution or laws of the United States, or because of his having so exercised the same; or\"\n\n> 18 U.S. Code § 241.Conspiracy against rights\n\n> https://www.law.cornell.edu/uscode/text/18/241\n\nIt is possible that the fact pattern may be consistent with a scheme or artifice to defraud or embezzle from the children the accurate child custody, parenting time, and child protective services they are due, a federal crime:\n\n> (a)Whoever, if the circumstance described in subsection (b) of this section exists— (1)being an agent of an organization, or of a State, local, or Indian tribal government, or any agency thereof— (A)embezzles, steals, obtains by fraud, or otherwise without authority knowingly converts to the use of any person other than the rightful owner or intentionally misapplies, property that— (i)is valued at $5,000 or more, and\n\n> 18 U.S. Code § 666.Theft or bribery concerning programs receiving Federal funds\n\n> https://www.law.cornell.edu/uscode/text/18/666\n\nOther possible federal crimes.\n\nI would consider a complaint to your state's Bar Association and its State Disciplinary Committee. The ABA has links for each state:\n\n> Complaints Against Lawyers\n\n> The ABA is not a lawyer disciplinary agency and has no authority to investigate or act upon complaints filed against lawyers. Each state has its own agency that performs that function in regard to lawyers practicing in that state. Locate your state agency from the Directory of State Disciplinary Agencies.\n\n> https://www.americanbar.org/groups/professional_responsibility/resources/resources_for_the_public/\n\nEach state has documented rules of professional conduct for attorneys. Most are very similar to the model rules published by the American Bar Association (ABA):\n\n> Model Rules of Professional Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_rules_of_professional_conduct/model_rules_of_professional_conduct_table_of_contents/\n\nJudges are expected to abide by the judicial code of conduct for your state. Most states are similar to the model.\n\n> Model Code of Judicial Conduct\n\n> https://www.americanbar.org/groups/professional_responsibility/publications/model_code_of_judicial_conduct/\n\nEvery state has a method to file a grievance against a judge who violates their ethical duties. Here it is for Michigan. Other states are similar.\n\n>  How to File a Grievance\n\n> http://jtc.courts.mi.gov/file_a_grievance/index.php\n\nState child support, parenting time, and child protection, and elder abuse are all primarily funded under federal law Title IV-D and Title IV-E. Consider filing complaints.\n\n> HHS Office of Inspector General\n\n> Phone. 1-800-HHS-TIPS (1-800-447-8477)\n\n> https://oig.hhs.gov/fraud/report-fraud/contact.asp\n\n> HHS Office of Civil Rights\n\n> https://www.hhs.gov/civil-rights/filing-a-complaint/index.html\n\nDepartment of Justice Civil Rights\n\n> The Civil Rights Division of the Department of Justice, created in 1957 by the enactment of the Civil Rights Act of 1957, works to uphold the civil and constitutional rights of all Americans, particularly some of the most vulnerable members of our society. The Division enforces federal statutes prohibiting discrimination on the basis of race, color, sex, disability, religion, familial status and national origin.\n\n> https://www.justice.gov/crt\n\nAnyone may report federal crimes to the FBI.\n\n> (202)324-3000\n\n> http://tips.fbi.gov/\n\nPossible basis of a class action lawsuit for similar situated people:\n\n> WHAT ARE SOME EXAMPLES OF CLASS-ACTION LAWSUITS?\n\n> There are many cases and issues that can be brought as class-action lawsuits. Often, class actions fall into one of the following categories:\n\n> ...\n\nFor children and families who consume and pay for services which may be inadequate or corrupted:\n\n> Consumer: These class actions hold accountable business entities who engage in systematic and fraudulent or illegal business practices that scam or harm the consumer. Examples include antitrust cases like price-fixing, market allocation agreements and monopolistic schemes.\n\nFor potential employees and employees denied access to work such as appointments as LGALs because they refuse to engage in corrupt acts:\n\n> Employment: Employees who have been discriminated against, employees with immigrant worker issues, workers who have hour and wage issues and employees who have on-the-job injuries or suffer because of employer safety violations can bring class-action lawsuits against employers.\n\n> https://www.hbsslaw.com/about/what-is-a-class-action-lawsuit\n\nFor general civil rights:\n\n> CIVIL RIGHTS CLASS ACTIONS:\n\n> A SINGULARLY EFFECTIVE TOOL TO COMBAT DISCRIMINATION\n\n> For over 50 years, class actions have been among the most powerful tools to secure civil rights in\n> America. Brown v. Board of Education,\n> 1 which outlawed school segregation and set the stage\n> for the entire civil rights movement, was a class action lawsuit. More recent examples include\n> the case portrayed in the Hollywood movie “North Country,” based on the case Jenson v. Eveleth\n> Mines and considered to be the first sexual harassment class action lawsuit.\n\n> CENTER FOR JUSTICE & DEMOCRACY\n\n> https://centerjd.org/system/files/CivilRightsClassActionsF.pdf\n\nI wish you the best of luck in your search for justice.",
    "title": "A father complained parents are blamed for the negative behaviors that children exhibit when in the care of their alienating parent.",
    "subreddit": "MensRights",
    "timestamp": 1683473012,
    "score": 18,
    "keyword": "indian judge"
  },
  {
    "text": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones Historically men have always been the problem-solvers for most of human existence. Men have always been counted onto to be problem-solvers because for the most part because we are hardwired to detect what is wrong with our environment or location. So I feel like when the industrial revolution came about to be, society counted on us to be not only problem-solvers, but also example-setters, the role models, the innovators, in other words, historically men fought tooth to the nail to try to make the world a safer, healthier and more stable place\n\nSo when the Industrial Revolution came to be, this put more pressure on men to be even more ''advancing'' and ponderous on to the grid and infrastructure of society, so we naturally have inclined to depend on men not only for advancing society, but to be the prime example-settlers for people to follow. I think that might be part of why we put so much pressure on men to be established and groomed by a certain age, where as women don't face those very same productivity pressures. I mean sure obviously people will judge a woman if she's being what they call a ''leech'' on the system, but for the most part what I am saying is they don't really get hit with the memo of hustle culture to the same degree men do, no one is going to judge a woman for working at McDonald's more than her being a nurse, but for a man that implies lack of intrinsic worth and respect and a good work ethic.\n\nI noticed this also disturbingly amongst ethnic minority male groups, whether it is the ''trabajador'' culture in the Hispanic community or the ''Be a baller'' mentality in the black community or the Silicone Valley Techie trope in the Indian community, I think those pressures are even more pronounced among men of color, but gonna try to refrain from over-emphasizing, I think you get my point though.\n\nBut this is also mostly used against working-class men, for example no top CEO in a fortune 500 company is gonna be told that their hard work doesn't pay off, even if they ended exploiting the resources along the way.\n\n&#x200B;\n\nI believe this to be a men's rights issue because since the working class consists mostly of men, this keeps the average man in the trenches",
    "title": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones",
    "subreddit": "MensRights",
    "timestamp": 1682608588,
    "score": 19,
    "keyword": "indian judge"
  },
  {
    "text": "Why the Woke ideology is terrible for both men and women & Why you should follow it anyway Who is the woke ideology designed for? women and LGBT. So of course if you're a woman & LBGT you're going to have an easier time supporting the woke movement and see nothing wrong in it. It's like having a 10 years old seeing a Youtube video \"10 reasons parents suck\" or a parent seeing a Youtube video \"10 reasons children suck\", of course you're going to like it since it's in favor of your group. Or Baby Boomers seeing a video \"10 reasons the younger generation suck\". It's pure validation, so why would you question it?\n\nThere's also pro-woke men in hopes that they can get some women if they are \"in favor of women\" because they can't get otherwise. But fundamentally, I would say on the article \"Top Ten reasons Why You Should Live Woke-Free\" number 1 is that Woke is a cope ideology. It doesn't help you improve your life, only helps you cope. There have been studies that the woke ideology is based on cope and on envy (tearing down what others have). That woke people have the lowest linguistic intelligence on average. That woke people are the least likely to understand the point of view of the other political ideologies (not agree with it, but understand it, as in being able to accurately describe it). All these are Red Flags in my opinion.\n\nIf I were part of an ideology based on cope and on envy, with the lowest linguistic intelligence on average, and the least likely to understand the point of view of the other political ideologies, I would seriously raise some questions whether I'm in the right ideology.\n\nBut you know what? let's do it in a clean format\n\n**Top Ten reasons Why You Should Live Woke-Free**\n\n**1. It's a cope ideology** \n\nLet's say you are fat, you don't like the fact you are fat, people are not attracted to you, you don't move your body as fast as you would like to, generally you live a worse life than your non-fat counterparts.\n\nWhat can you do? you can either:  \na) Work on yourself to lose weight, \"I want to be a hot man\".  \nb) Cope, \"It's perfectly acceptable the way I am and I shouldn't be judged for it\".\n\nWe should not make fun of fat people for being fun. But as always, the woke ideology takes a healthy principle and twists it 180\\*. We should not make fun of fat people for being fun. That doesn't mean we shouldn't say \"being fat is unhealthy, being fat is unattractive\" if asked. But the woke ideology goes even further. \"you are fatphobic if you won't want to date me because I'm fat\" and \"people should not judge me for being fat otherwise they're fatphobic\", \"people should love and accept me for being fat otherwise they're fatphobic\" (to hell with their preferences), \"skinny women promote unrealistic body standards\". (well, they exist, don't they? so how are they 'unrealistic' if they exist?)\n\nThe woke defense usually goes in 3 ways:\n\n1. It's not political. The best argument a woke person does when they make a political claim and someone counters it, it's not a political thing to begin with. \"Nah, it's not a woke thing, it's a human thing!\".\n\n2. It doesn't happen that often. \"Come on, you are exaggerating, this doesn't happen nearly as often as you say it does\". This one may actually be in good fait since they never see that, being woke.\n\n3. Extrapolate with something else not related to the subject. \"Oh yeah, so that means that now we have to make fun of people in the wheel-chair for being disabled?\".\n\nLet's say you're a woman. You listen to all this woke and 100% agree to it. Start to over eat, get fat, and then expect everyone else to love you for who you are, freely. You expect men to give you as much of a chance as they give to skinny good-looking women, etc. That doesn't happen. What do you do? cope even harder and become even more entrenched in the woke ideology, saying it's the men's fault for not being attracted to you for being fatphobic. And becoming men-haters, because you want stuff from men but have nothing to offer in return so you cope. And the skinny feminine woke-men who are pro all this thing are not really your type because you learned from the woke movement that you deserve the best, without doing a thing for it.\n\nAnd fatphobic is a wrong term. Going back to the low linguistic intelligence part. Phobia is a strong, irrational fear. People who are \"fatphobic\" are not afraid of fat women in the same way they are afraid of spiders or snakes for example. There's a completely different emotion altogether. It's actually disgust.\n\nBut not calling the people who won't date fat women for being fat  \"fatphobic\" and instead calling them something more correct like \"fat-fastidium\" has some problems. Because if you admit that the core emotion behind it it disgust and not fear. You have to ask yourself some questions: why is it disgust? we are disgusted by things we find lesser, lacking, not important. So it will open a whole can of worms that will eventually lead the woke person in the direction that it's disgust because they are fat and it's a failure of their own doing. And that is a very uncomfortable thought and the very opposite of woke.\n\nIf I were to summarize the whole ideology I would say \"woke is cope\". When you feel you have no chance in life on your own you turn to woke.\n\nYou're fat? instead of cope and becoming feminist, work on yourself. Your true problem is that you are unambitious, want everything in life to come easy, want to blame someone else for your poor choices, and don't want to be judged for this.\n\nAnd the opposite of woke/cope is responsability, personal responsability.\n\nI used fat & \"fatphobic\" as a particular example. But I goes for everything that is woke. For example promiscuity or \"free sex\".\n\nAgain, woke starts from a healthy principle and twists it 180\\*. We should not treat women like we did in 1950s and they should have equal rights. But equal rights = equal responsabilities. And this is where woke people leave the room. Woke promote promiscuity for women, and people who judge you for being promiscous are bad.\n\nAnd I say do whatever you want, if you want to be promiscous, be promiscous, if you don't want to be promiscous, don't be promiscous. But at least make sure that you know what the consequences are and be aware of the consequences. Just like the fat women, they are lied by the woke movement into thinking it's okay and everything will be fine for them if they do this. It won't.\n\nOf course, there's pro-woke men like \"you do you girl!\" in hopes that if the woman gets more promiscous maybe, just maybe, he'll get some of that p\\*\\*\\*\\*. What's the issue with that? If pro-woke man couldn't get any woman without women being promiscous, the pro-woke man couldn't get any woman with women being promiscous, it's not women, it's him that's the problem. He being a too low standard. Even for promiscous and non-promiscous women.\n\nIf the woman gets more promiscous, she'll get more promiscous with the top 10-20% of men, because there's hardly any man that would say \"no\" to free sex. So why would the woman sleep with someone in the bottom 30-40% when she can have the top 10-20% all day long? it's simply not in her advantage. So she won't do it, and the pro-woke man's conclusion is that he needs to simp even harder and needs to tell her to get more promiscous even harder. The wider her horisont the more likely she is to sleep with him, right? right? right? wrong.\n\nOf course, being anti-woke involves not coping which it means taking the hard truth.\n\nWhy is being a promiscous woman bad? Because men won't want to date you, they will only want to sleep with you. You can twist and turn like the fat woman saying \"fatphobic\" but this is the truth. Are you a wife material or a one night stand material? From men's POV there are women good for having a relationship with them and being their partner, and women good for sleeping with them and that's it.\n\nWoke be like: \"but we don't care about the body count, why should the men care?\". Well, men don't care about your job nearly as much as women care about the man's job, men don't care about the woman's height nearly as much as the women care about the men's height. Complaining that other people don't have the standards that you do is just ridiculous. \n\nSo feel free to be a promiscous woman if you want. But there are consequences:\n\nWhat we see here is a woman frustrated that men leave after they hear of her past.\n\nAgain, it's not \"not being strong enough\", it's disgust. A completetly different emotion. She's not in tune with reality.\n\nBut the most predatory tactic is that woke people tell this to women when they are in their early 20s even 15-20 y.o. and women will grow up thinking that being promiscous is okay and will have no negative consequences. There's no \"men won't want to date you, they will only want to sleep with you\" there in that narrative, there's \"men who judge body count\" bad in that narrative. And as such, being young and impressionable, they take that advice, become promiscous, and end up regretting later in life when the poor decisions come back to them.\n\nhttps://www.reddit.com/r/TrueOffMyChest/\n\nJust search \"body count\" and see who has more to suffer from this. Is there men complaining that \"my gf has high body count and I left?\" or is there women complaining that \"I have high body count and no good man would want me?\".\n\nI'm perfectly fine with women being promiscous or not promiscous if they are perfectly aware of the decision and the consequences. If you assume it, perfectly fine for you. What I have a problem with is when they are being lied into making one of these decisions, that they would not have picked otherwise if they knew the full extent of it, it's pure and plain manipulation, and it comes back to bite those women after their \"glory days\" are done.\n\nSo, to reply to the average woke posting on Twitter: \"where are all the good men gone?\", with the good women.\n\n**2. It's an envy ideology**\n\nEnvy is a really crap emotion. You thought disgust is bad, but at least disgust has the core role of protecting you from disease. Guilt has the role of being self-critical and questioning yourself. Fear has the role of protecting you from life-threatening or negative consequences situations. Every bad emotion as some good part to it, some reason this emotion is actually good in some way.\n\nExcept envy. There is no good reason for envy.\n\nYou can use jealousy as gas. But not envy.\n\n\\- If you are a fat woman jealous that other women are skinner than you, what are you going to do? work out to lose weight so that you become as skinny as them. That's what jealousy does.\n\n\\- If you are a fat woman envious that other women are skinner than you, what are you going to do? tear down those skinny women or the men who validate those skinny women for being \"unfair\".\n\nJealousy is probably the closest thing to envy, but even jealousy has a positive use, you can use it as a gas to get you where you want. Jealousy wants to have that another has.\n\nIf Joe has a cool red car and I:\n\nAm jealous -> I want a cool red car too.\n\nAn envious -> I want to destroy Joe's cool red car.\n\nYou can see in what ways jealous can be beneficial even though the emotion is not positive.\n\nBut for envy, historically the most envious societies had the least economic development. Why? because whenever someone would rise above the norm, they would make sure they'll drag it right down. You can't become rich in a society where whenever you rise up above average, the less rich will ally to tear you down. Because of this you won't have any incentive to get rich. Because of this the society itself will not become rich. So congratulations, you're all equally poor now. Sure, you live misrable, but at least your neighbour isn't doing better than you.\n\nIf you want to create a society predominantly based on envy it would be the Soviet Union. If you want to create one based on disgust it would be India. The soviet revolutionaries in 1917 were like \"kill the rich\" but they didn't kill the rich, they killed the other farmers who were slightly better than them. You can also see envy in how a society treats their merchants, civilizations like Rome, Islam, China went at some point through a phase of poverty through decomercialization through the ruling classes' regulating the merchants out of social power and wealth.\n\nThe merchants have always been the main attraction of envy. Since anyone can become a wealthy shoes saleman, but the nobility was inaccessible to anyone not born in it. This means you're not judged for not becoming an aristocrat, not attracting envy. The jews, indian and chinese were often treated horribly in countries they lived in as a minority because they were better merchants.\n\nJeaousy is when you are a child and you want your friend's toy truck.\n\nEnvy is when you want your friend to lose their toy truck at no gain to yourself, since your friend has happiness that you can't have.\n\nEnvy is a horrible emotion that enables no one. Envy evolved as a hedge against massive inequality, massive inequality is a massive cripple to society, so envy evolved as a group hedge against it. But, overall it does more harm than good, envy is a big force that holds societies back. \n\nFor more info: Envy, A Theory of Social Behavior, Helmut Schoeck.\n\nThis is already long, so I'll try to be short from now on.\n\n**3. Where are the rich, succesful, woke millionaires?**\n\nIf it's such a good ideology, where are the woke millionares? Yeah, celebrities get asked \"are you a feminist?\", \"are you la la la?\". And of course they say \"yes\" because those are the people who pay them. You have to appeal to the left-leaning demograhpic. \n\nYou pointed this out perfectly with: \"You know I’m not a big fan of people for the most part, but even I see the problem with biting the very hand that feeds and nourishes you\".\n\nThey don't care about being woke, they care about keeping their fan base satisfied by appearing woke.\n\nWhich, not practicing what you preach but preaching that you are in support of \\[insert establishment here\\] seems to do wonders for the average person.\n\n**4. Going after the likes of Andrew Tate, Ben Shapiro, Jordan Peterson with basically no accusations**\n\nYou know there's something wrong with the wokes when you hear their arguments.\n\nGlad you said \"without resorting to the name-calling and verbal flatulence and the like which is your norm\" because that's pretty much their norm.\n\nWhen the woke can't defend itself in a healthy debate, you're either: racist, sexist, fatphobic, xenophobic, cancelled.\n\nRacist used to mean something and to be taken seriously. It used to mean someone who discriminates based on race and was a serious issue. But because of the woke overusing this word as an attack dog, \"everything is racist\", racist lost all meaning and it doesn't bat an eye from people anymore. Today, racist simply means not left-wing. Which is terrible for when cases of real racism happens, they may not be taken seriously because people are already used with the 'racism' version of the left.\n\nIt's like the story of the body who cried wolf.\n\nEventually, no one is going to believe you when the real wolf comes.\n\n**5. If you don't like the woke they come after you big. Like the Catholic Church in the 15th century.**\n\nHow can you trust something that's so aggressive as being good?\n\nWhen something is oppressive, it's usually bad. And the people who go out of their way to say \"I'm the good guy\" are not usually the good guys. And my god, the woke people are so proud of being the good guys. They are these champions of justice who stand up to these: racist, sexist, fatphobic, xenophobic, cancelled. On the right.\n\nBut it goes deeper than that.\n\nJordan Peterson is about to lose his public licence, for, and this is the official accusation, a retweet of the Conservative Party of Canada.\n\nBut if you ask the woke people: It's not political, he really was just a bad psychologist.\n\nAnd Andrew Tate, at first I thought Andrew Tate's arrest was for real. That he really did what they say he did. Until the 2 women that he supposedly kidnapped came out on social media with a video saying that they never testified against  Andrew Tate, the police self-reported, they didn't sign anything against Andrew Tate, and they did not agree to be victims in the Andrew Tate's case, in fact they filed a case against the police for putting them as victims in Andrew Tate's case. And to his day there's no official accusation against Andrew Tate, he's preemptively behind bars, for months. Like WTF is that? innocent before proven guilty? this is beyond innocent before proven guilty, this is trying to proven guilty despite no evidence.\n\nhttps://www.youtube.com/shorts/9rpz0Oy0ZLc\n\nThey have more videos like this. Imagine being accused in a case where you victim insists she is not a victim. And the police ignores the victim saying she is not a victim.\n\nBut they, it has nothing to do with the fact they disagree with them. They are bad people for teaching young men bad stuff. They have to be bad men. Otherwise, how could the woke be good by comparison:\n\nThe no.1 defense of the woke for something political is:\n\n1. It's not political. The best argument a woke person does when they make a political claim and someone counters it, it's not a political thing to begin with. \"Nah, it's not a woke thing, it's a human thing!\"\n\nThere is no honor in that. How can you trust an ideology with no honor and no compunction?\n\nI'm no conservative, but at least from the conservatives I know there are certain limits they would just not cross. The woke crossed those limits a long time ago, they are an ideology without compunction, and how can an ideology without compunction be trusted?\n\n**6. The woke hate religion but everything for them is sacred**\n\nI'm an atheist. I agree that nothing is sacred and everything can be questioned.\n\nExcept, not with the woke people. You can't question their beliefs, ideas, otherwise you are \\[BAD MAN\\] and deserve to be canceled.\n\nLike \"I'm offended\", is one of the strongest words of the woke. But what does \"I'm offeneded\" really mean? nothing. It's nothing than a whine, a complain. It says nothing about the reality of the situation at head.\n\nOf course you are offended, that's part of cope. I'd be surprised if you weren't offended in fact and that would have been a good sign. Or if you were willing to be offended.\n\nOf what use is a philosopher who doesn't hurt anybody's feelings? Freedom of speech gives us the right to offend others, whereas freedom of thought gives them the choice as to whether or not to be offended.\n\n\"Those who are determined to be ‘offended’ will discover a provocation somewhere. We cannot possibly adjust enough to please the fanatics, and it is degrading to make the attempt.\" - Christopher Hitchens (he said that long before the woke people were a thing)\n\nAnd let's not forget the classic:\n\nhttps://www.youtube.com/watch?v=VEOHQoh82bs\n\n**7. They won't debate you, they will cancel you.**\n\nThis says everything about the woke mindset.\n\nIf people like Andrew Tate, Ben Shapiro, Jordan Peterson were so wrong, how come the woke can't destroy them in debates, like they destroy the woke people in debates all the time?\n\nWhere is the Andrew Tate, Ben Shapiro, Jordan Peterson of the woke people? there's isn't any. I remember Anita Sarkeesian was big once, but she was the favourite punching bag of the right because how how bad her arguments were.\n\nThe right didn't try to cancel her, didn't attack her character, didn't say \"Antia bad person\", they just made fun about how bad her arguments really were.\n\nAnd his is a healthy line in a healthy world. One that the woke crossed long ago by silencing those that disagree with them. \n\n**8. The woke won, they are the establishments, where are the results?**\n\nCome on, when you post Black Lives Matter & LBGT & Feminism and most major companies as well as news outlets agree with you and share your message. You are not anti-establishment, you are the establishment.\n\nSo you won. Where are the results? there aren't any.\n\nIn fact, the blue states have higher inequality than the red states. What's up with that?\n\n**9. Hypocrisy, they don't apply the same standards to men that they apply to women**\n\nIt's a fundamentally hypocrite movement. Fat men into woke agenda? No.\n\nWhen was the last time you heard a Woke person that a woman is in the wrong for rejecting a man for being fat? Or a woke person saying about man that \"all men are perfect\" or that \"hot men give unrealistic expectations to men\".\n\nNevermind that their ideology is pure cope. But that cope only applies to one direction - women. If you are a man, you don't get the same advantages female woke get.\n\n***But there 1 reason why you should be pro-woke:***\n\n**10. They are the establishment**\n\nYou want a job in Hollywood? be woke, even if you really aren't.\n\nYou want to not have issues at your job? be woke, even if you really aren't.\n\nBecause conservatives aren't willing to cross that line that woke people are.\n\nIt's like a woman attacking a man with a bat tacking advantage of the fact that men are thought not to hit women, this is why being the woke is the more privileged way to be.\n\nBeing woke gives you more social privilege.\n\nAnd at the same time you get to complain about not having privilege. Despite you being the establishment and being able to do something to lift black people out of povery for example, but you don't.\n\nSo yeah, when you put things into balance, I think it's better to sell your soul and be woke.\n\nThe trick is to do it like most Hollywood stars to: don't practice woke principles of cope, but declare you are an absolutely woke person and always in favor of whatever woke people are. They will love you for it, while you get to keep the benefits of not being woke with your personal choices.\n\nI believe \\[INSTER GOOD STUFF HERE, ANYTHING THAT MAKES YOU FEEL COMFORTABLE, SO THAT YOU LIKE ME, BECAUSE I LIKE POPULARITY\\], thank you.\n\n**The problem I have with the woke is that it ruins the life of the people who practice the woke**. But if you are a true-woke believer and have practiced the woke and it works for you, good for you. Maybe it's not an ideology for everybody but it works for some people, like stoicism. I wouldn't feel comfortable with cope and not doing anything to better myself, and blaming the enviroment for my own problems, instead I would try to raise myself up by myself, to get to the top. So if you want to do anything that is bad in the woke, like being overweight or promiscuous or others I haven't touched, as long as you are perfectly aware of the consequences and is truly your choice, go for it. You have my full support if you fully assume it and you know what you're doing. But if you were tricked by the woke ideology that this is the right way to go and there are no consequences and it's the racists, sexist, deplorable, who hate you and fear you, and this is in fact why your life sucks, and your life will be better once you get rid of them. I can only have my sympathy for you.",
    "title": "Why the Woke ideology is terrible for both men and women & Why you should follow it anyway",
    "subreddit": "MensRights",
    "timestamp": 1676325278,
    "score": 0,
    "keyword": "indian judge"
  }
]