[
  {
    "text": "What was the job interview that changed your life? Here's mine:\n\nAbout 4 years ago, I graduated from a local community college with an associate's degree, and I was planning on transferring to a university for a bachelor's.  I had no idea what to do next, so by default, I decided to go for a degree in Business Admin, without any passion for it. Like any Asian parents, my parents wanted me to go to med school, but I hated biology and chemistry with a passion, so I didn't listen to them. Thankfully, they let me do whatever and didn't disown me haha.\n\nAt the time, I was working to support myself. I was tired of my cashier job, so I applied for a waiter job at a local Japanese restaurant, hoping for a change of scenery. The manager gave me a call, and asked me to come to the restaurant for an interview. During the interview, he looked at my resume and asked me what I was doing next for my bachelor's degree, and I told him Business Admin. He asked why, I said I didn't know exactly what I wanted to do next, so I went with the most popular degree out there. He started getting very condescending about my choice, and told me that I should have gone with medical, or engineering, or something to do with computer and technology (he's also Asian). In my mind, I thought it was none of his business, that only my parents can talk to me like that, but I kept my mouth shut and sat through the entire interview. I found out a couple days later that I didn't get the job.\n\nThat night I went home, I was still very upset about what the restaurant manager said, and I couldn't sleep as I kept thinking about his words. No one had confronted me like that before, let alone a stranger. I started second-guessing my decision, that if it was the right choice for me. I knew he was right, I knew I picked business admin only for the sake of going to a university. I started looking back, and trying to figure out what I was good at, so I could at least base on that for my next degree. I realized I enjoyed building computers (I had built a couple before), so it only made sense for me to go for a computer engineering degree right? But it wasn't as simple as that. Since I took the easy courses to get my associate's, and didn't take any advanced physics or math courses, which are the pre-requisites for most engineering programs, I would have to start all over again at community college, and it would take me an additional 2-3 years, on top of the core courses of the undergrad program, to graduate. \n\nBecause I was impatient and didn't want to hear my parents nagging about when I'm going to university again, I decided to go for a different path. I talked to my advisor, and explained to him that I wanted to work with technology. He recommended this Information Systems program at a university that's an hour of driving from where I lived. The program was a combination of business and technology, and it accepted most of my pre-requisite classes from my community college. It was a no brainer for me. I applied and got accepted. I moved to a new city, and continued working part time to support myself. During the program, I was introduced to database, IT infrastructures, project management, a little bit of programming, and I had the best time there. Fast forward 3 years, I graduated during the covid-19 pandemic. It took me hundreds of applications, but I finally landed my dream job as a business systems analyst. I find joy in what I'm doing, and I'm proud of the work I deliver everyday. I know what my career path is going to look like in the next 3, 5, 10 years; and what it's going to take to advance my career.\n\nLooking back, I'm very grateful for that fateful night, where I was confronted by a stranger in the middle of a restaurant. I'm very grateful for that manager, whether he was saying it from the heart, or he was just looking down on me. If it hadn't happened, I still wouldn't have known what to do with my life, and I wouldn't have been where I am today. It was one of the best things that have ever happened to me. I went back to the restaurant to see if he was still working there, but found out he'd left. Thank you for reading my story.",
    "title": "What was the job interview that changed your life?",
    "subreddit": "jobs",
    "timestamp": 1615002329,
    "score": 212,
    "keyword": "japanese manager"
  },
  {
    "text": "Searching for first jobs preferably remote Hi everyone,\n\nSo…bit of a weird situation. I’m going on 25 and I’ve never had a job before. Not for lack of trying tho. I’ve applied to many retail jobs since like 16 (I still have my work permit that I needed to work at the time). Even in college I’ve applied for Target jobs (only to be told that despite the application, they wanted evening hires) and even local pet shops (for supplies like food and toys etc). This job I actually got far having interviewed twice, once with the store manager and once with the district manager, only to be rejected in the end.\n\nWell, I just accepted an admission offer for a masters degree program in Communication that I will be starting in the spring. So with so much time before January, I want a job to make some money and really begin to build my resume properly with some real experience working. \n\nSo I guess what I want to ask is, how exactly do I job search properly. Obviously with covid still going on, I want a remote job. Something very entry level that doesn’t require any experience but asking for someone with a willingness to grow and learn. \n\nIdk if this is important but I’m the type of person who is very personable and sociable. I’ve always enjoyed talking to people. Some of my skills include being able to type at an average of 70 words per minute which I actually take some pride in. I also enjoy languages. I took Spanish in middle and high school and always enjoyed learning Spanish. I’m pretty rusty now cuz I haven’t really been using it. I also started teaching myself Japanese very slowly. Just something I enjoy doing. \n\nI graduated in 2019 so I don’t think internships are an option for me until I start my masters program. And the masters program is for beginning a career in PR, if this is important to know. So yeah, I would appreciate any advice. I just want a simple entry level job I can do from home that isn’t a scam that I can succeed in and put on my resume. \n\nThank you so much in advance",
    "title": "Searching for first jobs preferably remote",
    "subreddit": "jobs",
    "timestamp": 1629942704,
    "score": 6,
    "keyword": "japanese manager"
  },
  {
    "text": "I'm quitting this job after almost 2 months working here and I don't know what to do Hi there, \n\nI'm a little bit lost and I need some of your expertise. \n\nI am a junior electrical engineer with about 3 years of working experience, in this short period I've worked for 3 companies, however, I got laid-off last year due to covid so I did freelance work for almost a year.  \n\nI got hired as a Service Engineer back in Mid-Sept at this Japanese company which hires mostly internationals H1 employees, the company struggles to hire  American talent, and well, the office culture is based on the Japanese working culture (Which I found really interesting and hence why I took the job). \n\nSo a few incidents have been happening however, something very fucked-up happened 2 months ago with an international co-worker who is a Junior engineer at the firm, and I've been thinking to pursuit legal grounds on what happened, not because of money or anything, but because I want to prevent this to happen to another recent hire. \n\nSo on my 1st  week of work I was assigned to this man,  let's call it 'K' to work with him in various maintenance related-work for a week.  that week on a Thursday, I came early as always, but I noticed this guy had an attitude, he seemed pissed, I politely ask him if there was anything to do. \n\nHe asked me in a defying way 'Oh so you're an electrical engineer right?', I politely said 'Yes' \n\nthen we enter a room where the machinery utilities are (Air compressors, tower water, etc.) -Keep in mind that that was my 2nd time entering this room, the first time I entered that room was the day before, and just for like 5 seconds- K  then proceeded to give an assignment, which I couldn't really understand given his thick accent,  for my understanding he wanted me to set an alarm inside a high-voltage air compressor. He never asked me if I had worked with air compressors before or anything. I politely said that I would do anything I could do.  \n\nHe then said that I could've had 30 mins to finish this task.\n\nI asked him if it was all safe to do the job by myself, he switch-off the air compressor knob and said 'yes'.  (He forgot to turn off the main power supply, something I didn't know).\n\n Before I proceeded to work on it another co-worker: 'R' enters the compressor room and tells me to stop working on it, cause it'll be hazardous, (he points out to the main switch feed which wasn't off) which makes me freak out.\n\n\\-It appears co-worker K did not follow the OSHA electrical regulation to look out/tag out the main supply-, R co-worker proceeded to the lookout and tag out the main supply, then telling me that it's safe for me to work on the air compressor this time, he stayed with me for about 2 hours. \n\nI was extremely bothered about the whole situation with co-worker K, so 2 hours later I approach my manager to explain the whole situation about the K co-worker did.  It seems like my manager called him out about this situation. then an hour later 'K' co-worker approaches me in the utility room -I was still working on this air compressor-  begins to yell at me, cusses me, and harass me (as retaliation for telling my manager about the incident early that morning),\n\nHe called a 'little bitch', 'I'm full of shit', 'He doesn't understand why this company hired me', etc. \n\nI proceeded to talk to my manager about the harassment. \n\nI quit this job 4 weeks later, kinda ashamed of myself cause I don't like to jump around from workplace to workplace, but it's a toxic environment, I was thinking that  I should move on with a labor attorney I would like to prevent this to happen to any recent hire and especially I'd like to sue this 'K' co-worker. \n\nI've could've died due to negligence. also early this week I learned that the 'K' co-worker did not have OSHA safety training before. despite working in this company for almost 2 years. \n\n&#x200B;\n\nI need advice, I don't really know what to do. sorry if it was too long!",
    "title": "I'm quitting this job after almost 2 months working here and I don't know what to do",
    "subreddit": "jobs",
    "timestamp": 1637353338,
    "score": 3,
    "keyword": "japanese manager"
  },
  {
    "text": "Am I being discriminated? I don't know where else I can say this. I've been working for a trading company selling supplements in Tokyo for two years now. At the time the company was looking for a \"native English speaker\" as they wanted to \"strengthen communication with overseas clients\", and when I stepped in for an interview I got hired on the spot.\n\nAs I don't have a degree I was super happy to be offered a full time position with health insurance covered, and I was really interested in supplements since I have a chemistry background- at least before I dropped out due to financial reasons.\n\nJapanese isn't my first language- it's my third, and I had to study it for a year. I finished language school early than most and started working a bunch of part time jobs.\n\nThe first few jobs they asked of me were exciting- translating emails, translating technical documents, interpreting for meetings, etc. Slowly they asked me to start handling imports and logistics, really interesting stuff too. Slowly I became the only person handling the company's imports, inventory and financial management. Slowly my physical and mental health declined that I have breakdowns everyday. Slowly I became responsible for all of these without me actually having a position or salary that reflects what I actually do- all I am to the company is \"the English person\". \n\nI've already mentioned wanting a formal position for either logistics or overseas customer service to my\nmanager several times. I got offered a position today for \"sales development and research\"- to which I expressed my gratitude but honestly said that I'd prefer being offered a position that reflects my actual work. \n\nMy manager told me to stop asking the company to \"treat me like I'm special\". I apologized and said that I just want a position where my actual duties are understood by the name of it, and asked him to clarify how I made him think that way of me.\n\nHe then goes on to list a bunch of petty things I usually don't do in the office- that I don't make coffee anymore, that I don't refill the water dispenser, that I don't pick up letters in the post when they arrive, that I don't dress formally enough- by the way I wasn't told that I should do these, but he just told me that this is how everyone in Japan does it.\n\nI told him I would have appreciated if he mentioned that these things were concerning him as I didn't grow up in Japan. He says that I've been a \"member of Japanese society\" for two years now, and making him say all this shows that I haven't been \"considerate enough\". \n\nI tell him that he's being discriminative to assume that I understand all the rules of Japanese society and that I'm not asking to be treated like I'm special, but I require his patience. He tells me that by asking him to be patient I am asking to be treated special. I realize that the conversation is going nowhere, and after several pauses in between me crying and not knowing what to say in Japanese, I tell him I'm quitting.\n\nI've been in the \"sales department\" for two years now and nothing I do actually deals with \"sales\", aside from casually forwarding product information to clients and calling them up on when their next order is. I'm so overloaded with logistics and translation that I never \"closed a deal\" with anyone and my overall position just doesn't make sense at all.\n\nI already know that my company is just trying to get me to do whatever they want while they still can. Well, then, I'm doing the same. I am taking classes online and working on my certification to be a professional translator. I am also taking JLPT N1, an exam for the highest level of Japanese proficiency, this year. Once I've got both certifications I will start looking for a full time position.\n\nI am trying my best to stay patient and stay in the company until I have my certifications altogether so I can start looking for a job, but things have just been so overwhelming. I got myself an ice cream and cried for another 4 hours after I got home. I can't even open my eyes fully. I don't know how to face anyone next week. I don't know how much longer my physical and mental health can hold on.",
    "title": "Am I being discriminated?",
    "subreddit": "jobs",
    "timestamp": 1624651336,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "I am not going anywhere for the next two years, leave me alone already! First off sorry if this sounds like whining, I'm just stressed, mad, and need to get back on my anti-depressants. I feel like I'm going insane...\n\nIn October of last year I started a new job after quitting at the hotel I worked at as a Front Desk Agent. The last job's general manager made my schedule almost non-existent and stole wages from me, on top of blaming everything under the sun on me when I was her actions that cause the events the days I happened to be working. Long story short, I'm going to sue for at least wage theft if an employment lawyer would respond to me.\n\nAnyway, I technically started 2 jobs after leaving the hotel and my side job of card stocking (the cards wanted me to work certain times and days even though they were aware of my schedule, had to stop because of being hired at other places). The retail store I left before Christmas as my convenience store job offered 40 hrs a week after fully reviewing my resume (hired me on the spot as casual/part-time because they needed adult employees) and the higher ups where shocked someone with my experience wanted a low level position.\n\nSo, what has happened after my first 3 months probation? Well let's call this co-worker \"Old Lady\". \n\nNow Old Lady, has been working there for almost 2 years, she apparently moved from BC and worked in the same chain of convenience stores... being transferred frequently until she ended up in SK. Old Lady has never learned how to work in kitchen until recently this year and she absolutely hates it when she has to work in there (complains about the grease and how dirty you can get, ect).\n\nI got along with Old Lady for my probationary period, we'd joke and talk. However she was primarily working in the mornings and would cover evenings or graveyards as needed, the times when both the manager and the assistant manager usually worked because they have small children at school during the morning hours. Eventually though (I think she requested?) she was moved permanently to evenings.\n\nI had told Old Lady, that I was *stuck* working for the store during the evenings for at least two years, well I attend school for the 2021-2023 semesters. She at the time told me that *no one is ever stuck in a job* and said I had options, which I originally took as her trying to make me feel like I wasn't trapped working there. (I now believe it was the first hint she didn't like me very much...)\n\nSo in my fourth month, I am working with Old Lady. She was in the kitchen after firmly telling me that *she had to work in the back* (probably from customer complaints about her refusing to wear a mask well out front) and I needed to put away stock. Now Old Lady had a bad habit of going to the back, picking up stock and bringing it to the front, just to set it down and not inform anyone that she wanted someone else to take care of it. It also so happened that day I was so bogged down with customers, I didn't have a chance until 6 hours into the shift to actually start putting away stock. That is when Old Lady came out of the back (for cash out) and annoyed asked why I didn't put away anything yet, I gave a short \"I was busy with customers.\" as customers started to line up again, however I saw that *did you really f@cking say that to me?!* look in her eyes. I had mentally pushed it out, thinking I was just being overly paranoid or something (I wasn't).\n\nAnd it began. Little things here and there. Slamming down stock on the front counter, giving me dirty looks, asking me to stock only to return two minutes later to complain that I hadn't done any stocking, snide comments under her breath when I walked by, telling other co-workers lies about me, and verbally telling me I don't know how to do something when I assured *and showed* her I was doing it correctly/as taught by the managers, ect. Eventually she just dropped all illusion of decorum, and straight up started yelling and belittling me whenever we were alone.\n\nI did end up losing my cool once and this was after having a failed \"talk\" with a manager mediating (I should have really canceled and took a week off for bereavement, as a close friend happened to have just died the day before). She was yelling and calling me names, since I am currently not on my anti-depressants as I left an environment that forced me on them originally, I am a tab bit more emotional and the stress got to me. She back down a little but quickly discovered after I do that I just get silent and stop acknowledging her presence, which makes her even worse (I do this because I don't want my emotional words be use against me, nor does my brain filter anything I say in that state).\n\nIt has been almost 3 months since Old Lady decided to behave this way. I have tried many time to just put everything behind me and work as if it never happened. Our managers are tired of her crying about *me being mean and rude* and hearing my side and my recordings of her freaking out on me at random. I am currently primarily working in the back now, since Old Lady complained that do to her age (early 50s) that she can't cook/clean as fast as I can (yet she tells me I'm lazy and she does 10x more than me everyday) and can't lift the heavier boxes in the back (I need to see a chiropractor for my back from my days of lifting steel). She constantly claims I am sitting in the office or just doing nothing, because she can't see me on the cameras (as she is playing on her phone up front now) and I enjoy listening to music well cooking/cleaning.\n\nThe only time she has \"caught\" me not doing my job, was when I was on my brake and told a different coworker I was going on my 30 minute brake, and watching one Japanese YouTube video that was using drawings to represent the YouTuber that was discussing a topic. She accused me of watching cartoons and doing absolutely nothing the whole shift. However I had caught her watching dramas on her phone multiple times or her just sitting in the office \"doing paperwork\" (we are the same level of employee, only the management does any orders or paperwork).\n\nBecause of SK's laws (I studied them in high-school and after to keep updated on employment laws), neither of us can be fired until the pandemic has be officially been called off of a consistent 2 to 4 weeks. I had told management I am just there on 40 hr weeks on evenings, until my studies are done and my loan is paid off, then I will see if I stay, reduce my schedule, or leave completely (they were fine with that reasoning as they asked if I could change our written agreement to fix the tension). However I just learned I possibly qualify for DTC, and if it goes through, I might be able to reduce myself to 32 hrs a week. Since my Dysphonia is a factor in misunderstanding Old Lady and I'm having problems understanding customer requests that it will effect my performance eventually.\n\nThat leads up to yesterday. Where I had told another coworker about potentially going on DTC to cover a day of work and/or my medications. I didn't care who over heard me, as I was trying to swallow my pride over it and turn it into a positive thing. Old Lady over hears me, and waits till near the end of the night to bring it up:\n\n**Old Lady**: \"You should just go on your disability and quit.\"\n\n**Me**: \"What? No, why would I do that?\"\n\n**Old Lady**: \"You obviously *hate* working here, you should quit.\"\n\n**Me**: *Slams shut drawer, because she was rude all day* \"No, you should f@cking quit. Quit bothering me!\"\n\n**Old Lady**: \"Don't f@cking yell at me! You don't like working here, you don't know how to do your job! You should quit!\"\n\n**Me**: *As I walk back to the kitchen* \"Old Lady, I only *hate* you! Do your f@cking job and leave me alone!\"\n\nAfter that she tried to start again as I began stone walling her and just focused on cleaning the kitchen. I ended up leaving an hour early because the stress made me feel sick. Interestingly that was also the time she was bogged down with a long line of very drunk people, that I should of helped with, but she made clear to me she didn't want me to work with her at all. I told the next shift of me being to stressed out and leaving and hour early because of her.\n\nFunny enough, she usually stays until the end of my shift, which ends 30 minutes after hers anyway. Just so she gets an hour overtime for doing nothing. Well, me leaving earlier than I was supposed to, just meant she would have to actually work her overtime.\n\nI am not excited for whatever \"talk\" one of the managers will have with me after she goes crying to them. However I will mention her threatening me with my job and show them the recordings of her doing so and her refusing to let me work with her.\n\nThis all started just because I didn't immediately do one thing she asked 3 months ago...",
    "title": "I am not going anywhere for the next two years, leave me alone already!",
    "subreddit": "jobs",
    "timestamp": 1615716358,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "What career path/industry can I persue? I’m hoping someone here can help me get some insight on a career path. I basically just fell into my current industry and want to pursue something that I have a keen interest in. Problem is I don’t know what those opportunities are and googling hasn’t helped as much as I had helped. \n\n&nbsp;\n\n**My work history**  \nI graduated with a B.S. in Mechanical engineering. Currently I have 2 years experience in the construction industry. 1 year working in materials testing (lab work) and 1 year as a project engineer with a general contractor on the federal projects (management work).\n\n&nbsp;\n\n**Career Aspects I enjoy/want**  \n-Management  \n-Science / Engineering  \n-Culture / Language\n\n&nbsp;\n  \nI really enjoy the management side of things. I enjoy building the team, working the timeline, and solving the problems that come up. When it comes to science and engineering the things I enjoyed most in college was materials science by far. But in all my interest is large and varied when it comes to STEM. As for culture and languages I have always really enjoyed Japanese languages first and foremost even though I can’t speak it. But just like with STEM it is varied. I have had coworkers from France, Spain, Mexico and have always been picked their brain about the culture they come from. \n\n&nbsp;\n\n**Career Goals**  \n-Salary 150K – 250K   \n-Clear Career Path  \n-Work/Life balance  \n-Northern US Location  \n\n&nbsp;\n\nBeing able to make 150K – 250K when I am in mid to late career. One good thing I can say about construction management is that the career path is fairly straight forward which I like. I know the goal and what I need to do to reach that goal. But the work/life balance is horrendous! Working 60-80 hour work weeks including Sat and sometimes Sun.  being in a career culture of over worked and basically you live to work. Work/life balance is a must. Some part of the country tend to favor certain industries.  Of course you can find a opening in any states but some places just simply have more option which means you also have greater career mobility if you live in those area. I just tend to like the northern states like Washington, Massachusetts and Colorado.",
    "title": "What career path/industry can I persue?",
    "subreddit": "jobs",
    "timestamp": 1615083407,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Nearly 2 weeks and I have not received my interview, is this normal? I applied to a company's marketing role in Tokyo, they are a small young company and they initially (I assume accepted my application) as they requested I send them my resume and a photo. Since then, it has been 12 days without a peep from the HR department. I understand they're busy, but how common is this? I'm considering sending a friendly email after the 14 day mark to see what's going on. \n\nOn their site, the procedure is as follows:\n\n 1. Apply via job listing - Done  \n\n\n2. After reviewing your application our staff will contact you by email. - They did  \n\n\n3. Arrange Online interview (English speaker will take your interview) - No reply on this yet  \n\n\n4. Second Online interview (with general manager)  \n\n\n5. For successful applicants we will apply for your work visa.  \n\n\n6. After visa is granted, arrange your move to Tokyo \n\n&#x200B;\n\n Optimistically, I'd assume they have a lot of applications (about 4000 since the listing in late Jan 2021) so they'll get around to interviewing me next week eventually.\n\nPessimistically, I assume I've been rejected without notice. But most Japanese companies have notified me if I'm unsuccessful and I didn't even have an interview yet so it's kind of hard to believe I've been rejected.",
    "title": "Nearly 2 weeks and I have not received my interview, is this normal?",
    "subreddit": "jobs",
    "timestamp": 1616294750,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "I am on probations and I'm panic about not catching up fast enough I am on the first month out of 2-month probation. The job is at Sales Department of a Mall operated with Japanese style and JP boss but the local managers. My main task this month is taking over all the operational, little tasks daily (asking tenants to fix their store, arrange leaflet, standee locations, manage tenants promotion... etc). I also start to learn the administrative work, draft the documents (schedules, addendum, request for approval) and submit them for legal reviews.\n\nThe thing is, this is an extremely busy time when the mall about to be renovated and everybody is spinning with complicated cases. So I have very simple and brief training and they expected me to figure it out and do it myself mostly. There are no solid training materials, all just observing.\n\nFor email to tenants, for example, I read through all the previous emails and took up on that. It's simple and trivial so at this time they just order me to email and I carry it away. Sometimes they check it and if there are any flaws, they pointed it out and ask me to explain. Or for the documents, I have to check all the legal Agreement files and draft 40 schedules/addendums with like 5 minutes of training. This is my first job after graduation and I don't know a lot of things, so I only learned after I made mistakes. A lot of them. I feel like shit guys.\n\nI mean these are simple tasks and I think I should have a sharper mind, learn things more quickly and stuff but I feel like drowning every day coming home from work. My mentor really just asking how can you make mistake like that with a disappointing look. I don't know if I'm just being weak or there should be a better training program. Please reach out and let me know your experience and how can I get my head straight! Thank you.",
    "title": "I am on probations and I'm panic about not catching up fast enough",
    "subreddit": "jobs",
    "timestamp": 1618410928,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Confused of which offer to take after big counteroffer This might be a long one, fair warning. Any advice is much appreciated! Thank you in advance.\n\nI just graduated with my B.S. in May. Prior to that I had been working as an intern for approximately 1.5 years in a local company. Was headhunted and received an offer from my current company at $60k, 1 week vacation, 80/20 health care, 401k 3% match, good dental and vision. They wanted me to start part time immediately so I accepted. I’ve been working full time there since May. \n\nThere are both good and bad things about this job. Firstly, my hours are lenient. I can come in when I want with reason, as long as I do 40 hrs a week. I’m basically my own manager with the exception of reporting to my operations manager. I have plenty of interesting projects and I appreciate the ability to work on what I want when I want with deadlines for major research in mind. Company is apart of a group of sister companies, and access to funds I need for projects is very easy to come by. Unfortunately there’s always negatives. The work culture is a bit toxic. Too much political discuss, lack of respect for scientific process … not my cup of tea. They don’t pay their operators nearly enough so that leads to disinterest in performance from them. Management doesn’t really communicate properly and this has led  to immense tension between a coworker of mine and a supervisor, placing me in the middle of it to essentially babysit. Operators don’t really respect my coworker’s attempts to improve the process, but I’ve been steadily working on building up a good relationship to improve this. Said coworker is pregnant and due in December. I’m effectively going to be taking on her responsibilities while she is gone, which has been cutting into my R&D time. I am the youngest individual there so sometimes I get flack for my age, but I mostly ignore the insecurities of others. \n\nOut of the blue, I was headhunted again. A competitor wanted me. Offered me $6k increase, which I negotiated to $15k - putting me in at $75k. Benefits include 2 weeks vacation, 5 sick days, 5 personal days. 75/25 health insurance, okay dental and decent vision. Biggest difference comes in with culture. There is more intellectual support. Instead of being alone, I’d have PhDs to bounce ideas off of. This could be good or bad, and I can’t be sure that the work place isn’t just as toxic. Obvious respect for scientific process. Company is owned by a Japanese parent company, so there would seemingly be good monetary support for projects. They seemed very eager to hire me. The role would eventually place me in a management position (6-12 months out). \n\nLet my company know I’d received an offer. A few days later we had a meeting with the president to discuss. I was not expecting a counteroffer. Essentially, I was told they want me to stay. They are willing to offer a $10k bonus once I finish 20 prototypes, and a $10k bonus once I get my prototypes to production. After this, they’d be evaluating my salary for a raise and profit sharing. \n\nI told them I’d need 24 hours to consider. Now I’m left confused and wondering if I should stick it out or jump ship. I’m not sure how much I trust their word now that they are aware I would be willing to leave.",
    "title": "Confused of which offer to take after big counteroffer",
    "subreddit": "jobs",
    "timestamp": 1629994622,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "How do I best handle a colleague who's obsessed with me and my race, but also kinda hates me? I have a Japanese colleague who when she first met me was under the impression I must have had some Japanese ancestry. I do not but I am one of those brown skinned racially ambiguous women who get mistaken for literally everything under the sun and who some people become really fascinated by my looks and fetishize me.\n\nThis woman started off our work relationship by telling me if I need more work she can hand off some of her petsitting jobs to me, then proceeded to ask me my age, and when I told her she cooed \"your skin is so dewy, you look so young!\" (i'm barely in my 30s.)\n\nAnd then she proceeded to assume I was part Japanese and asked me literally dozens of questions over the next couple weeks like \"so did you watch Pokemon growing up? I didn't because I grew up here speaking English\" and all sorts of other weird shit. When I brought in one of those cutesy Japanese animal pens, she asked where it was from. I said some company in Texas, and she asked if that's where my family was from. I told her no it was some website in Texas. Every conversation had my family's origins as a subtext and shoehorned in.\n\n I told her I am not Japanese, I do not speak Japanese, that this is your culture and your people.\n\nAnd never have I ever been mistaken as having English as a second language either. The weird thing about that example is that months later I'd learn she actually didn't grow up speaking English and grew up in Japan. So not sure why she lied about that. There were other times I just walked away because I was so uncomfortable by her questions and race related chatter.\n\nWhen she cornered me and just point blank asked me where my family was from, I said California. She was like wow cool Cali girl, WHAT ARE YOU??? \n\nI just walked away. \n\nI also noticed by then that she mimics how I talk. She mimics how I talk to customers, VERBATIM, and in the same tone. I don't code switch sometimes and will say y'all or ain't, etc, and she has started to talk like that too.\n\nFrom then on I would disinterestedly say hi to her and answer her work related questions, but I would never have a conversation with her. She started mispronouncing my name all the time when she hadn't before, then she stopped talking to me. She also talked shit behind my back like I was the problem here. I'm guessing this included to the owner, who she's close with.\n\nIn December where there was a work related shitfight among the whole group she called me \"snarky\" when I said I felt marginalized in this group. She then called me a waste of time for stating she made me uncomfortable with her dozens of personal questions and that was why didn't answer her phone call, and because I said I could not pay my rent if we went on strike for two weeks.\n\nShe ignored me and was passively hostile for a few months until April this year when she became super friendly and then started talking non-stop about how woke she is, how she translates anti-racist literature etc. She stopped when I pointed out to her she LOVED our last manager, who was really racist and screamed at Black women, and screamed at us non-Asian WOC.\n\nI did get a slight sexual vibe off her obsessive questioning, which made me surprised she has a boyfriend and was straight. Having said that it's an open relationship and now that we get along again, I have seen how she falls in love with anyone who comes into our store and finds attractive.\n\nI think she is obsessed with me and my race, but considering dozens of Black men come in asking for her, and how she mimics everything I do, I also wonder if she's trying to find out how to snag a Black boyfriend.\n\nI need to make clear I don't think this woman really likes me. I think she still hates me for the perceived rejection last year and because I won't admit to being Japanese, which I'm not, but I also do think she's obsessed with me.\n\nI don't know what to do at this point other than maintain a distance and don't really engage but in a far more diplomatic way than last fall, when saying nothing more than hi and one word answers made me her worst enemy. I'm also at a loss because the boss seems to like her, though I made sure I let the boss know over the winter that this woman really hates her and was going to wage a social media campaign against her with burner accounts as a way to discredit the garbage she was telling people about me.",
    "title": "How do I best handle a colleague who's obsessed with me and my race, but also kinda hates me?",
    "subreddit": "jobs",
    "timestamp": 1625323435,
    "score": 0,
    "keyword": "japanese manager"
  },
  {
    "text": "If you were the manager of the Japanese education what would you do to increase literacy?",
    "title": "If you were the manager of the Japanese education what would you do to increase literacy?",
    "subreddit": "AskReddit",
    "timestamp": 1613358907,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Things are finally looking up for me, why did he have to go and rain on my parade. Hi all, I don't post much on reddit, but  I saw a post about imposter syndrome on the front page today. And well it made me think, and brought up a lot of negative emotions so I just wanted to vent about it I guess. \n\nI'm an artist, I've been drawing since I was a little girl. I'm not great at a lot but I've always had an almost obsessive passion for drawing. I'm going to be 30 this year and I've never been able to make a career out of art, though its what I've always wanted.  My brother recently came to visit, and we started talking about why I've never pursued any art related job as he could see I was miserable in my dead end retail job. After talking it though with him, I realized I have had SO many opportunity's to branch out into an art career. \n\nWhen I was eighteen I worked for a colorist for a small Japanese company, when I met with the owner he offered to sponsor me. So I could go to a Japanese art school for international students that specialized in Manga. I turned him down.\n\nLater on I got a job working at a pizza hut, the store manager found out that I draw and brought these little dry erase boards and markers so I could draw little caricatures of my co-workers. I did it , and an owner of a tattoo parlor saw them and liked them so much he offered to make me an apprentice and teach me how to tattoo. I turned him down.\n\nLater an another customer who owned a graphic design company , saw them and offered me a job working for him. I turned him down.\n\nLater on representatives from the Japanese branch of pizza hut came to our store on my day off, they saw my artwork and love it so much. They wanted to work with me to design a box, they left their contact info with my manager, she gave it me when I came back to work. I never called them\n\nAnd just so many other examples, when I was explaining this to my brother he was shocked how many opportunities I had gotten. When he asked me why I never took any of these opportunities I told him that I didn't think my art was that good, and that I didn't want to fail. He told me that I had imposter syndrome, I had never heard that term, but when he explained it to me I couldn't argue. It sounded like me. Then he told me something that I don't think I will ever forget, he told me there are thousands  upon thousands of artists. And most of them never get any opportunity's to do art professionally, but I've had so many chances thrown in my face that it must mean that I am good at what I do.\n\nI have super low self esteem, and I've been depressed for years which I think contributed to me throwing away all these chances. But recently things have turned around for me. A few weeks after my brothers visit, I got an email from a producer from a company I have always wanted to work for. She told me she had seen my artwork online and had really loved it. She was looking for an artist for a comic project and wanted to know if I was interested. I had gotten emails like this before and had ignored them, but with the conversation with my brother still fresh in my head I decided to take a chance and agree.\n\nI've signed an NDA so I can't go into to much detail, but the project is about a preexisting character from a MAJOR comic company. She wanted me to do a paid sample test to see what I could do, I put my all into that sample, AND I GOT THE PROJECT!!! I'm going to be the lead artist !!! I'm so excited!!\n\n A part of me thought it was too good to be true, that it was a scam. That surly there are better artist out there, but I got on a call with the all the producers and talked to everyone and its legit, its for real! I'm in shock! I signed the contract yesterday and I will begin working on it in a few weeks. I've pushed down all my negative emotions and anxiety, I've been feeling amazing!\n\nWell today I told my co-workers at my current retail job, and all of them were so excited for me, the store manager walked over to see what going on and I told him. And he was super skeptical about the whole situation, he asked me what company ,and I told him I could couldn't tell him exactly which one cause I signed an NDA But I have him three choices. \n\nMarvel, DC, or Image comics\n\nWell he said it had to be Image comics, because he's never heard of that company. Something about that stung, I don't know  it was like he thought that I wouldn't be good enough to work for Marvel or DC so it had to be the publisher he's never heard of (jokes on him cause it isn't Image.) He then started asking me about what they would pay me, and its a WHOLE lot more then what I make there, like four times more.\n\nThen he started saying that I won't  leave there, and that I liked working there. Yeah I like my co-workers they are awesome people! But this is a giant opportunity , I would frankly be an idiot if I didn't take this opportunity. Not only is the pay great, its something major I could put on a resume for future comic jobs. But him saying all that brought up those negative emotions again and its just irritating, like WHY CAN'T I BE GOOD ENOUGH TO WORK FOR A MAJOR COMIC BOOK PUBLISHER!! what?!I just have to be a retail worker for the rest of my life?  Why did he have to be that way.\n\nI've already decided once I get my first paycheck for the project, I'm going to quit. I'm the lead cashier, I've been employee of the month multiple times. I hit all the numbers, I get TONS positive customer reviews , I've never once called out in two years, I have to train all the new cashiers because the cashiers I train do better than the cashiers others have trained. WELL FUCK HIM! I'm gonna take this opportunity with both hands and run with it. Wish me luck ,and thanks for listening",
    "title": "Things are finally looking up for me, why did he have to go and rain on my parade.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1625633261,
    "score": 82,
    "keyword": "japanese manager"
  },
  {
    "text": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender This happened about a year ago, but due to recent events in \"the bible belt\", I remembered it and thought it was worth sharing.\n\nSo I was working for a consultancy company which was doing work all over the place. I didn't have a project for a while so the pressure was on to get me to a client, no matter what or where. One day we get an email from sales that a position had opened up in a place that I never heard of. It turned out to be a small/medium-sized village in bumfuck nowhere with an industrial park that housed a couple of big companies for that region.\n\ninitially, my manager (Chinese) always sends a couple of internal resumes with one or two obvious good matches. She didn't get any replies, followed by the sales rep saying \"this is the bible belt, unfortunately, they are not as progressive as our company. They said they wanted to handle communications with me instead\". That should have been a red flag from the start but since this was an international partner the company didn't care (which was a red flag for me to get out eventually).\n\nThen they asked if they could interview a top 3, where I wasn't part of. My manager pushed for me to be included because all 3 were male. Me and another female colleague, with way more experience, were skipped.\n\nWe start the call and almost immediately we get \"What are Sara(not my real name), Wendy(manager) and Jenny doing in this call!?\" and \"listen, you have to understand that...here in bumfuck nowhere we don't work alongside women. It will impact our working environment\". It was obvious the guy wanted to say that he didn't want to work with women. I stepped in and hijacked the whole thing and start asking them questions about the project, what skills they need, etc to get the conversation back on track. At the end of the call, Jenny almost quit on the spot for not being defended by the sales rep.\n\nThe client was happy with the call and invited me to do an in-person interview (according to the sales rep, which I didn't believe for a second). So I travel to bumfuck nowhere and I feel like I'm traveling to a different country where it would be wise to carry a pocket knife or something.\n\nIt was cold that day so I were a sweater (keep that in mind). I enter the office building, meet the guy we spoke to, he gets another colleague to do the interview with and we enter a meeting room. 30 minutes since I entered the building and I realize I didn't give my name and I start to get very scared. I tell them of my experience and my team. I also sneak in some things about my manager and Jenny and the guy goes \"yeah what is Wendy anyway? Chinese? Japanese? I can't tell those people apart. And Jenny? Why the hell is that young woman working? I don't understand women from where you come from\". I try to play it off that men and women should have equal opportunities in life and he replies \"it's not right, women shouldn't work at that age. They should stay at home and take care of their partner\" and I think to myself \"HOLY SHIT I REALLY AM IN BUMFUCK NOWHERE! IS THIS STILL THE SAME COUNTRY I LIVE IN!?\"\n\nSo then they start glancing over the printed resumes and see that I am actually Sara and it gets super quiet while I'm already thinking about how many people I have to walk past and how many doors are between me and the fresh air. Then the other says \"hmm...so you're one of those transvestite people, are you?\". And I say \"well it's called transgender actually and yes\". What followed was a bombardment of slurs and nasty comments like \"God doesn't approve of that kind of lifestyle, you're a sinner\" to a point where I disconnected myself from reality until it was over. At some point, I came back to reality and said \"well it's obviously not going to work out but thanks for inviting me\". I tried to shake his hand but he gave me the meanest look I've ever seen. When I walked out a group of people went quiet and started laughing when they realized.\n\nI walked out, shaking, and had to sit on a bench for a couple of minutes. It was like all the work I put in my self-esteem and confidence over the years was instantly worthless. Every time someone walked past me I felt scared and judged. I took the first train back and stopped at a train station where I was 100% sure to be comfortable and had some fast food for lunch to comfort myself. I felt so betrayed by my employer that my trust in them never recovered and I eventually left the company.\n\nThe only thing that kept me going was the thought that the world is a big place and that there are many places other than bumfuck nowhere to live my life.\n\nedit: grammar fixes",
    "title": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615114235,
    "score": 0,
    "keyword": "japanese manager"
  },
  {
    "text": "First year teacher struggling I just graduated college in May with a degree in Communications and also Japanese. There was a position open at a high school in my area for a Japanese teacher. I applied just kinda on a whim but got the job. It’s been very challenging since I’ve never taught before and I have almost no material. There is another Japanese teacher but they’re not very helpful. When I come to them for advice they tend to micro manage and have made some comments. On multiple occasions they’ve mentioned I’m not qualified for my position and would not have gotten this job if it weren’t for the teacher shortage. (It’s probably true but I feel like that’s something you don’t say out loud). We share a classroom and they’ve told me next semester they’re going to co-teach with me during their planning.\n\n \n\nI’m honestly dreading it. I like my students but on days when they don’t listen or are rude, it’s so hard to keep going. Some of them take my things, constantly try to sit at my desk, and play random videos on the projector when I’m trying to teach. Everyone’s on their phones. I keep telling myself if I were more engaging I could get them to pay attention but it feels like no matter what I come up with it doesn’t work. When I come home I’m just planning or grading. Some weeks I can do it but other times I get burnt out and the kids can tell.\n\n \n\nI feel so guilty for wanting to quit. There are some really sweet kids who write cards and bring me little presents. They’re so passionate about Japanese. Everyone keeps telling me this is the worst semester and it’ll get better, but I’m having a hard time believing it. I never really wanted to be a teacher, to begin with, but I also don’t have anything else lined up. I thought if I really couldn’t take it I could quit before the next semester. I have to enroll in a program soon to get my license but that sounds like the straw to break the camel's back. Maybe if the circumstances were different I could like it more? I need to make a decision soon.",
    "title": "First year teacher struggling",
    "subreddit": "Teachers",
    "timestamp": 1639458155,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "Is this Career Burnout, or just wanting a Career Change? I have a confusing thoughts about my current job, and I don't know if I should stay or I should try harder to find what I actually want/like to do/my passion. \\*Please be aware that it's going to be long text below since it's more like \"off my chest\" post, so feel free to skip :)\n\nAllow me to explain my background first: I am a foreign female in early 30s living in Japan and just married to a local. Soon I will change to spousal visa from working visa so I think I will have more freedom to choose my own job in the near future. I can speak so-so Japanese, enough for business environment and daily life and also can speak read and write English almost fluently.\n\nI have been through working life for almost 7 years, mainly in sales & mkt field for 5 years in my home country. Here is what I like about current job in Japan which I started 1,5 years ago:\n\n* It's related to electricity/power/energy, the fields that many people call very stable at least in Japan, and my place happen to be part of the biggest energy group in Japan. Being able to be part of this company makes some of my friends and colleagues envious to me. Corona doesn't impact this company at all since the demand for power will always be there forever. Pay and benefits are quite good.\n* I work as business development, which many people think its cool..\n* However my main work mostly utilize my language skill. I am the only one foreigner in this company and it is the first time they hired one. They rely heavily on me to read documents, making summaries, checking somethings in contracts, translations, etc because I am the only who can speak my country's language, English, and Japanese. Some Japs can speak English but honestly, not so well. I like it when I do this kind of work; I feel the sense of achievement and relief when I helped colleagues and customers. I got praised with this and I am motivated by praise and flatteries (though I know its not good to feed on them)\n* Most of the people are nice and fun. I don't see them as workaholics which is the image ppl usually have about working Japs. Although most of the workers are old and never interact with foreigner (very local company) they welcome me so much and I feel comfortable\n* I like the environment; unlike what I heard about other Jap companies, its easy to take leave, you are free to decide WFH schedule, my boss' manager and other higher ups are super nice, even I had fun communicating with CEO. They have many leave system in a year that it is easy to get leaves accumulated. They also have flex time, and good leave system for pregnancy and post-delivery period.\n* Working pace is not so crazy and actually I can say its quite relaxing. No targets. No hard pressure. Senior and boss kindly understand what my capacity is, especially as a foreigner.\n* This is the job where I can speak English to my boss and CEO, and I cant find much of this kind of job currently in Japan. Some vacancy that comes a lot is recruitment firms, and although I am curious about that job I heard many negative thought revolving around the stress and fast paced and competitive environment, which I might appreciate if I am still single. However I don't think that kind of fierce job is suitable for my family oriented life plan\n\nSo many good points that I actually want to explain, but honestly I think so many times that this job is not \"me\". There are too many times I feel unmotivated and don't work at all in whole day. There are many times I imagine myself working other job in other companies. Though I mentioned no stressful pressure in the last point, I have many stressful moments where I have to bring that stress to home, thus somehow it affects my private life (we wanted to have a child soon but somehow it wont do with the work stress and anxiety).\n\nIt might be related to some bad points that I think about the job and the company:\n\n* That I don't feel like I am able to release my stress to other colleague. no matter how nice they are, I am still a non Japanese, and there is always this invisible barrier that don't let me getting close to them and be able to express my worry, fear, what I want etc. The problem not only lies in language differences, the culture and mindset difference has taken a toll of my mental too.\n* As I said, too many old ppl in my company, hence I don't have friends of same age that I can rely to, even just for fun. I feel lonely and more stress with this.\n* Yeah, I get to work on something related to language skills, but actually my main job is supposed to be business development, and yeah it is a cool job, you got to see many new techie startups, talk to them and ask to be partner then sell the tech together, to Japs customers or other countries. But... I don't have the drive to do it somehow. Like, I just don't care about difficult themes and technical biz, how can I offer it to other companies? There are many days where I dont have certain task to do, that time I suposed to search startups biz and new tech and such, actively pursuing new business devs, but I just don't move.. WFH also make it worse since I always get distracted by housewife-y activities that give me more sense of achievement and motivation better.\n* I realized I prefer to have targets and have someone press me on what to do/what to work on, rather than \"please do it your way as long as you bring the result\". I already get used to getting assigned to handle certain products, learn about it, then approach \\[countable\\] customers in a day to achieve \\[countable\\] sales in a month. I don't have this now.\n* I get used to work that require me to move, like doing business trips, visiting clients, entertaining them, interacting with new ppl etc. With corona + the current workflow, it feels so boring and stuck. I mean, I am not even allowed to interact with the customers in my own home country..\n* The company mindset are so old that they don't utilize IT nicely. Hence, when doing WFH, I am happy that there are not much meetings or no moments like my boss are checking me every 5 mins or sth like that, no. But at the same time the motivation become so low and the anxiety of not knowing what others doing is creeping up.\n* No proper training or guidance from higher ups. about business investments etc. I have to learn how to read FS/BS/PL, read legal contracts, etc by myself. Yea, its good that I learn new things for my own development, and I can use it in other field in case I quit this job but.. honestly.. I don't actually care about these energy, new technology blabla things. When I learn things, I don't even know if it is correct or not because nobody can correct me anyway. I feel like jack of all trades, master of none. one day I have to do A task, the next day I have to learn B to do C, and then I was asked to do D so I learn from zero again. It keeps repeating and I see myself as a stupid person who don't remember how to do A B C D etc at all. I cannot find the \"rhythm\" of this job and I feel like always out of place\n* The theme of power, electricity, energy etc is too much for me. everything is too broad. we have to read news everyday about anything also, not to mention most of the materials are in Japanese language. I got overwhelmed easily with difficult words and vocabs.\n* As I mentioned before, not utilizing IT means they still do everything manually, including stamping documents, signatures, approvals, etc. Very old fashioned and might need tens of years to change the system. I cannot stand to wait for that change.\n* All in all, I feel I don't contribute much to this company, feeling stupid and don't know how to do the job, cannot measure what I did and what I can do in the future, and feeling like I receive salary for nothing, most of the time.\n\nIn conclusion, what makes me stay is just because the combination of Corona + slow-paced no-hard-pressure work + not so bad money and benefits.\n\nAre the points above shows I have career burnout? Am I just getting tired of working?\n\nOr should I blame myself because I force myself to work in something I don't have interest to? Is it worth to leave this stable and prestigious company/field to re-start a journey of finding what I love to do? If I consult this to Japanese, they think with my current age my life plan, it is better to just stay and endure, since its not a bad company, rather, a stable company and don't give pressure much. I am posting this here to hear many other opinion, or if any of you have the same experience.",
    "title": "Is this Career Burnout, or just wanting a Career Change?",
    "subreddit": "careerguidance",
    "timestamp": 1630307599,
    "score": 4,
    "keyword": "japanese manager"
  },
  {
    "text": "Should I pursue my career as an engineer or go to college as a teen Hey I want some advice in my situation.\nIm currently a high school student(17) in Japan working full-time at a SaaS company as \na web developer(contract) while going to an online school. Im fluent in Japanese and English so school and work is okay communication wise. Im coming up to my senior year in high school and I need to make a decision wether if I should go to college or pursue my career as an engineer. I put a lot of thought to it and it’s a really though call, both point in my opinion are valid.tho I have many many things to learn and will face a lot of hardships I believe I have some skills.\nlet me introduce you to my background.\nI was first introduced to programming when I was in sixth grade(12) when I got my first laptop.\nit was a used old laptop but It was intriguing. I loved technology and having a computer was my \nbest gift ever. My mom introduced me to a robotics club short after tho I didn’t understand what I was doing I enjoyed making robots using Ardino. After I got into middle school I didn’t do any programming for a while. But I was interested in operation systems and hacking, I watch YouTube videos and had some fun. \nOn the last year of my middle school I went to a coding bootcamp. Thats when I learned javascript, I made some cool and simple project as well as doing a little bit of game creation with unity. Since I live in Japan and go to a Japanese school I had to take a test to go to a school of choice. School wasn’t really a thing for me, I didn’t like the system of it so I epically failed. \nAfter failing my test and my mom very disappointed in me I went to a pretty famous online high school with a good system to give me a lot of free time.So when enrolled I took a lot of web development courses via my school and Udemy. I made many projects and, It was honestly fun and I enjoyed something for the first time that gave me skills. After three or four month I went to a lounge meetup with some engineers. \nThere I met my mentor Nate who worked at a FAANG level company. \nHe was a really cool guy.\nHe took me under his wings letting me work as an intern teaching me and helping me build a path for being an engineer while getting paid to help with his project.After a year or so my internship ended so I decided to give it a shot and submitted my resume to a company posted on indeed. And luckily a company hired me. \nI was pretty impressed with my self because I didn’t use any connections and was able to pass my interview at this company. \nAnd it leads to now. \nI’ve been working little over a month now and I have learned so much. And my adaptability was tested since the framework changed from \nReact to Vue and it was a docker based project.\nI needed some time but I managed to get used to it. I have gone through a lot and Im enjoying what I’m doing a lot. But I just don’t know If I should go to college. People say its only 4years give or take but 4 years for a person in their early 20s sound a lot for me. Not only that but it cost almost 100k witch is just crazy. I asked on quora and many people answered I should go to collage because my pay will get better or I will get a better role but I wasn’t sure if that applies to the programming industry. Im just stuck here and need advice. Thank you\n\nEdit: I probably confused some people. I’m in Japan because I have dual citizenship, us and japan. I’m Japanese/American. Sorry for the confusion 😓😓 I can go to the USA citizenship wise and planning to go after high school.",
    "title": "Should I pursue my career as an engineer or go to college as a teen",
    "subreddit": "cscareerquestions",
    "timestamp": 1632142340,
    "score": 27,
    "keyword": "japanese manager"
  },
  {
    "text": "How to complain against boss in small company So I am the lead of the R&D team in a company of 25. I report directly to the second-in-line of the company, whose official title is “Director of Development”. \n\nMy boss is an extreme narcissist who micromanages, doesn’t listen when we say something can’t work and isn’t worth the effort (both true, every time), disrespects everyone, devalues everyone with sly comments, threatens to nullify bonuses etc. \n\nWith only the CEO above him in a small company, I see it as risky to go directly to the CEO, because I feel my boss will somehow lie his way out of my complaints, as he always does. I have a few recorded videos of him straight up leaving calls while people are trying to talk to him, examples of his devaluing comments, and lying that he made decisions that caused everything to break. The worst one shows him being incredibly insensitive (joking) about how my cat got killed by coyotes the day beforehand. \n\nI got a written performance warning from him yesterday. My team and I know that it’s because of his managing.  If I file an complaint, he will definitely put our missed goals against me. The team (whom have been with the company for 4 years, me 7 months) will probably not join the complaint because their culture (Japanese under an American boss) unfortunately is submissive. \n\nMy question is: what should I expect if I file an complaint and speak to the CEO? Should I even do it? My boss is extremely good at sliding by tough situations with his charm. Options are to just bear with him and continue looking for a job, or complain about my boss and start massive turmoil within the company I love. Both options are very stressful, consequences imposed on my fellow coworkers, and involve feelings of loss.\n\nI love this company and the opportunity I’ve been given to make an product that will make an difference in the real world. I don’t want to lose that, but the absurdity of my boss is just too much to bear. Yes, I have had conversations with him regarding his actions, and he does not take responsibility or take steps to change his behavior.\n\nRegardless, I’m grinding leet code and getting ready for interviews, because I legitimately can’t work under this guy.\n\nI guess this turned into more of an venting post…\n\nEdit: CEO is HR btw",
    "title": "How to complain against boss in small company",
    "subreddit": "cscareerquestions",
    "timestamp": 1634418659,
    "score": 0,
    "keyword": "japanese manager"
  },
  {
    "text": "1L on leave of absence after experiencing 2 mental breakdowns. My parents are livid and I;m terrified. My story goes back, way back. I was diagnosed with depression when I was 14 and prescribed Prozac, but I stopped taking it within a year after my family urged me to stop and after a suicide attempt where I tried to overdose on my medicine. In spring 2019 of my 3rd year of university, I attended LSAT prep night classes while going to school during the day. I was trying to get a double major but dropped the second one by the end of the school year since the school barely had enough courses to complete it and I didn't want to continue on to a 5th year. During that time, I fainted from low blood pressure on a bus ride to school once and ended up losing around 20 pounds from stress. I took the first digital LSAT that summer and cancelled my score since it was a 149, way below my target score. During the fall semester of my final year of uni I focused on my courses so I could maintain a decent GPA while working part-time; my mom would always call me to ask if I was studying for the LSAT and I either evaded the question or lied and said I would once I finished my regular coursework for the night. I decided that once the spring semester started I would study for the LSAT since I only had two easy classes to take with few meeting times.\n\nAs everyone is aware, 2020 had a rough start. Looking back I probably had a relapse into my depression after receiving my LSAT score. I didn't study for the LSAT at all and just stayed in bed once I got back to my apartment. When my mom called to ask me how studying for the LSAT was going I would snap at her and even hang up my phone. Come March I wasn't ready for the April LSAT at all, so I was relieved when it got cancelled due to COVID. I told my mom that I would take the test later during the year and spend my time studying and working. She was not pleased to say the least. My parents would spend days screaming at me, calling me a deadbeat for working at the local Target instead of trying to get a job that was more prestigious and used my bachelor's degree (I majored in Human Geography) and my infrequent studying. I broke down and told them I didn't want to go to law school anymore, and stayed with grandma to study at her house. My aunt and grandma convinced me to go back home a few weeks later, but I started slacking on my studying until I just stopped once the holiday rush started at work.\n\n2021 and my mom is yelling at me and calling me a deadbeat who achieved nothing in 2020. So I buckled down and studied for real. I would study for a few hours before work and study some more once I came home from work and even during the weekends. I managed to get up to 160 on some practice tests and could answer three sections correct on logic games, which used to be my weakness. I felt ready for the April 2021 LSAT. Then, on the day of the test, I had a panic attack in the very first section, logic games to add insult to injury. I had heart palpitations so intense I was practically punching my chest to calm down. By the end of the section I just wanted to shut down my laptop and run away, but I powered through the test and finished. I was absolutely sure that I bombed it so I drank as much Vodka as I could and got black out drunk. I vaguely remember my younger sister and cousin picking me up off the kitchen floor and helping me walk upstairs to my bedroom. I haven't swallowed a single drop of alcohol since then.\n\nI got my LSAT score in late April. It was 151, I never even scored that low on my practice tests. I decided applying to schools would be pointless and I should retake the test, but my mom encouraged me to apply to some law schools. I got rejected from one school, which was also my top choice I was dreaming of attending, I got put on the waitlist at another, and I finally got accepted at one school. I won't say any names, but the school has a 55% bar passage rate and in 2020 the ABA warned them they could lose accreditation if they couldn't raise their bar rate. I was nervous about attending the school, even with the scholarship they gave me, but my mom said I could work hard in my first year and transfer out. I talked to my mentor and a friend who already works in the legal field and they said they knew people who went to lower ranked law schools and transferred to better schools after their 1L year. \n\nSchool started in August and I started out fine enough, my only concern was that I learned law school worked on a different grading curve. There were only a certain amount of As to be given so students who put in A-level effort weren't guaranteed to get an A. I told myself I would try my best to be one of the few who got an A. By the 3rd week of school I stopped reading and struggled to complete assignments, at times I just didn't turn in any assignments. I stopped eating and only ate once a day so I wouldn't get hunger pangs and headaches. Once classes ended I went straight to my apartment and climbed into bed; watching the sun go down outside my window until I could fall asleep. I called my mother after my first breakdown and she got me connected with a psychiatrist that prescribed Zoloft to me. I told the Dean of Student Affairs about my suicidal ideations, and he set up an appointment with a therapist program affiliated with the school. I ended up spending the night at the local hospital on suicide watch. \n\nI tried to get back into the groove of things, but I still struggled to read and do my assignments despite talking to a therapist and the Dean of Student Affairs once a week. I had my 2nd breakdown when 1Ls were notified to have a mandatory meeting with career services to discuss pro bono work and looking for summer internships and jobs. I wasted my first 2 months of law school depressed and ruining my grade; I was scared that I would flunk the semester and be stuck at a school on the verge of losing accreditation or that after graduating I would struggle to find work since employers would judge me for going to a low tier school. I told my mom I wanted to withdraw and seek more intensive out patient care and enter with the winter class, and she accused me of wanting to run away from law school by entering a facility. Choice words were said, including me saying my mom just wanted me to stay in a school so she could bragging about how her daughter was in law school, even if it's a bad law school.\n\nAfter talking to relatives, the Dean of Student Affairs, my professors, my mentor, and friends, I decided it was in my best interest to take a leave of absence and retake the LSAT to see if I could get into a better school while I still could; if that failed I would come back to my current school and try Plan B - getting top grades so I could transfer out. When I told my parents, as the title said, they were livid. They told me I was taking the easy way out and that since I knew nothing about struggle that I thought I could reset when life doesn't work that way. My father said he refuses to pay for my rent and my mom is flip flopping between saying she'll pay for my rent but once my lease ends I'm on my own or that I need to find a job to pay for my father's half of the rent. She also demands that I find a way to end my lease prematurely so I can come back home so they aren't wasting money on me since I'm not in law school anymore. I have some money saved from working since high school so I can pay for rent until March without working; I plan to take the January LSAT so if I manage to pull up my score I plan to work so I don't drain my savings.\n\nMy mom is a nurse practitioner and says that professionals don't care where I went to school, but my mentor, cousin, and friend that's been a lawyer for 5 years says that the legal field is still a bit elitist and I should follow my heart. My friend is fluent in Cantonese and Japanese and passed the New York bar exam. She had to move to Japan for family reasons and was applying to law firms there; a recruiter told her that because of her academic background they didn't think she was qualified to work there. She ended up getting an in-house job in Sega's legal department, but hearing that scared me since her school is leagues above my current school. That just cemented that the school I go to ***does*** matter, and I want to go ahead and try taking the LSAT before I end up ruining my future. Just like how retaking the LSAT doesn't guarantee I will be accepted to a new school, I'm not guaranteed an A in school and a transfer to a better school. After this long spiel, I just want some advice. How do I convince my parents that I'm not giving up on law school? That I can pull up my LSAT score and get into a better school?",
    "title": "1L on leave of absence after experiencing 2 mental breakdowns. My parents are livid and I;m terrified.",
    "subreddit": "LawSchool",
    "timestamp": 1634925659,
    "score": 6,
    "keyword": "japanese manager"
  },
  {
    "text": "Gah that American \"math\" team post on the front page really bothered me. I get it, it's a casual joke. Asians tend to dominate math competitions. But more importantly, the sense that even though you're winning a competition for America and are American through and through, you're still a foreigner in your own country.\n\nIt used to drive me insane when people asked me \"where are you really from\". I'd want to reply well started in Alabama, moved to Chicago when I was still young before school, and now I work in New York. I would carry my passports out in airports like a badge of honor so people would know I'm \"american\". \n\nAnd it took me decades to unfurl the toxic defense mechanisms I spent my life throwing up. Growing up, I vehemently rejected Asian culture. I hated my name so I changed it legally. I beat the shit out of my body playing lacrosse at a high level because it was the whitest sport (all conference and even then I was known in the conference as the \"asian kid\" or the \"chinky boy with skills\"). I attended a fucking US military academy for a year instead of a top 5 school initially because I wanted to show the world how American I was. \n\nIt took me until 25 and working in Asia on projects for half the year to finally get it. To finally be in a place where the assumption isn't I'm a math guru or code monkey. Where my managing directors don't assume I'm a work horse and nothing more. Where instead of preparing the deck for sales meetings, I got to actual drive the meetings and lead. But more importantly, as I matured, I understood so much more about myself and why I am the way I am.\n\nI never realized how much growing up in the midwest as one of the only Asians in my school would impact my sense of self. My obsession with fitting in and being \"american\" led me to completely reject so much of what makes me well, me. \n\nThis current movement of Asians standing up for themselves and doing it together makes me so fucking proud. I now realize my history and culture isn't just that of China but it's about the workers brought here to build the railroads. The asian communities that popped up early on that suffered untold racism and abuse. The Chinese exclusion act and the Japanese internment camps are some of the most atrocious decisions by my country. But I'm so fucking proud to be part of that history. To know that the strength to endure untold hardship and sacrifice for the future generations flows through me and is part of my history and culture means everything. So thank you to all the activists and people stronger than me who push the narrative. You guys have made me so proud to be Asian American and my children will love and embrace their culture and heritage in a way I never allowed myself to. So thank you.",
    "title": "Gah that American \"math\" team post on the front page really bothered me.",
    "subreddit": "asianamerican",
    "timestamp": 1621955598,
    "score": 116,
    "keyword": "japanese manager"
  },
  {
    "text": "Ramen made with low carb Nasoya pasta Like many people, I've gained weight over the past year while in Covid lockdown and later in voluntary isolation. It didn't help that I had prostate issues and was wearing a catheter which largely limited my movement.\n\nAfter undergoing prostate surgery, my doctor gave me a complete physical prior to announcing that I was medically cleared to return to work. He also told me that I needed to lose weight and set a target goal of 50 pounds. I put myself on a low carb diet. Even though I don't exercise, I've managed to lose 7 pounds over the past three weeks.\n\nAs an Asian American, I really miss rice and pasta. Stir fried vegetables just don't seem to taste as good when they're not eaten over rice. I also miss chow mein, cheung fun stuffed noodles, steamed bao, and steamed dumplings; all of which I have typically made at home from scratch.\n\nTwo weeks ago I discovered Nasoya Pasta Zero Shirataki Spaghetti at my local WalMart. This low carb pasta is gluten free and is made from the root of the konjac plant. Also known as the konnyaku potato, devil's tongue, voodoo lily, snake palm, or elephant yam; the konjac is a Japanese root vegetable that's full of fiber. Nasoya sells this pasta in the refrigerated section of the produce department in 8 oz. packages. A serving of 2/3rds of a cup only has 4 grams of carbohydrates. In contrast, 2/3rd of a cup of spaghetti would have 28.35 grams of carbohydrates.  An equivalent amount of dried Ramen would have 26.6 grams of carbs.\n\n&#x200B;\n\n[konjac plant](https://preview.redd.it/jou608s157q61.jpg?width=785&format=pjpg&auto=webp&s=1187d2d6ac9aa50e880e4dc15aea7b3328de46ba)\n\nI used this pasta to make Ramen. The broth came from a Hakkas style braised chicken with red chilies. My soup included stir fried cabbage, sliced nori, steamed broccoli and cauliflower, stewed turnips and carrots, and chayote squash that was simmered in the broth. I also added a slice of ham, a hardboiled egg, and a garnish of green onions.\n\n&#x200B;\n\nhttps://preview.redd.it/vjl56elm67q61.jpg?width=576&format=pjpg&auto=webp&s=0740f42db033f2fbf606cf10dd520e5b67ae44e4\n\nThe konjac pasta was surprisingly tasty. Since I have largely been sticking to fish, lean meats and vegetables for the past three weeks, it was nice to once again enjoy some noodles even if it was just 2/3rds of a cup.",
    "title": "Ramen made with low carb Nasoya pasta",
    "subreddit": "asianamerican",
    "timestamp": 1617124826,
    "score": 0,
    "keyword": "japanese manager"
  }
]