[
  {
    "text": "Promising job Wife had an interview, brought ceo cupcakes cause it said he had a sweet tooth, nailed the interview, but didn't get it because she wasn't bilingual. Which wasn't list in job description. What a waste of time and really hope....you know...to not be broke and homeless. Considering they were looking to expand to Texas and Utah...sure, buddy. Then got called by a scammer for four hours the rest of the day. Think we both took our frustration out on them. Like, I even know broken Spanish and Japanese, she knows French. I hate this job market and everyone says it's A-OK, nothing more than I would love to do than work or help my team and others.",
    "title": "Promising job",
    "subreddit": "jobs",
    "timestamp": 1696509656,
    "score": 1,
    "keyword": "japanese ceo"
  },
  {
    "text": "I have a weird life. How can I get a career out of it? I'm 19 looking for a good paying career or job. \n\nMy goal is to move to Japan at around 25. I'm already fluent but want more money to live good.\n\nMaybe a career that gets me to Japan?  \n\n\nI'm desperate because I don't like having my own company anymore. I'd like something stable with growth opportunities and fixed salary (or variable as commission).  \n\n\nAs mentioned in the title, since I was 14 I was working as a freelancer. So I don't have formal education. Dropped out of high school, too.  \n\n\nThis is my current Resume experience. I work from Brazil but have an LLC in the US so can work there.:  \n\n\n**Business Owner**  \nDec 2022 - Present   \nBrazil · Remote\n\n  \nConect acts delivering high-performing short-form digital media for creators, increasing their audience. (conectdigital.com).  \nAs Founder & CEO, I oversee our core strategies, product roadmap, ops, marketing, and planning.  \nRapidly grew from $0 to $15k MRR in 3 months using Outreach Lead Gen methods.\n\n  \nIn 2023 we gathered over 100M views for clients, averaging an increase of 200% views per client.  \nDeveloped automated cold and warm outreach strategies, referral systems, and paid ads to drive sales on auto pilot.  \nLeveraged Monday, Adalo, and Zapier to automate workflows and reduce costs, increasing workflow speed by 80% and saving up to $3000/mo in costs.\n\n\\--\n\n  \nCompany 2  \n2 yr 1 mo  \n**Director of Operations**  \nFull-time\n\n  \nStreamlined workflow management within Monday.com, automating processes with Zapier, increasing efficiency by 50% and cutting employee costs.  \nManaged the entire production department, optimizing their workflow and reducing expenses by 30% in 1 month by changing their compensation method.  \nCollaborated with the CEO and CFO for strategic planning, targeting lowering costs while maintaining video production levels.\n\nStreamlined workflow management within Monday.com, automating processes with Zapier, increasing efficiency by 50% and cutting employee costs. \n\nManaged the entire production department, optimizing their workflow and reducing expenses by 30% in 1 month by changing their compensation method. \n\nCollaborated with the CEO and CFO for strategic planning, targeting lowering costs while maintaining video production levels.…see more  \n\n\n**Freelance video editor**  \nMar 2017 - Aug 2022 · \n\n  \nEdited 15,000+ videos ranging from YouTube videos to mainly Short-Form content.  \n\n\n  \nI have very high linguistics skills, as I got fluent in English in about a year or so, and fluent in Japanese in 2 years and a half.  \n\n\nAlso, very high level artistic skills in music and arts as painting and drawing. I've sold some before.  \n\n\n  \nPlease help me.\n\n&#x200B;",
    "title": "I have a weird life. How can I get a career out of it?",
    "subreddit": "careerguidance",
    "timestamp": 1699653919,
    "score": 1,
    "keyword": "japanese ceo"
  }
]