[
  {
    "text": "How do you all deal with this shit? I am a licensed teacher in Japan (originally from America, but I moved to Japan and got a teaching license)\n\nI have been a member of this sub for a week, and I gotta say....if I was a teacher in the U.S. I would lose my fucking mind.\n\nLet me give you some examples why\n\n1. I usually teach English (because, duh) but every teacher in Japanese junior high schools is assigned a second subject, and once a week they will join that subject's lessons as like an assistant. So I basically go observe a social studies lesson once a week, and recently it was WW2, and the teacher said oh hey, David, can we ask you about America's point of view on WW2, and why you dropped the bombs. I stood up and said, the prevailing theory of why we dropped the bombs was to save lives, in 2 ways. One, save American lives by preventing a land invasion, and 2, save Japanese lives but scaring the shit out of the citizens of Japan to the point where they would give up. Dropping the atomic bomb on Japan was the best choice. And he said, could you stand in front of the dome in Hiroshima and say that? And I said, I could absolutely say that, because I wasn't alive, and that is what I was taught. And he thanked me after the lesson, and the kids asked me a few questions about if anyone in my family hates Japan (some of them do) and I answered honestly, and that was the end of it.\n2. I taught a lesson about how a large portion of the Japanese population is xenophobic, which can lead to foreign people, especially non-white foreign people feeling unwelcome. How Japanese people, especially Japanese people older than 40 seem to have a superiority complex, and it leadls to them thinking Japan is the only country on earth with \"X\", and how in America we have a lot of people who believe the same thing. The students/parents/principals were all super cool.\n3. A girl I teach was told she looks like a monkey by a boy (she's 15, so she was devastated) and she asked me if she was ugly, and I saw you are gorgeous and any boy with a brain would fall in love with you immediately. There was 2-3 other teachers nearby, and they all basically joined in saying similar stuff.\n4. I will start this one off by saying, Japanese kids can be waaaaaaaaaaaaaaaaaaaaay more innocent than American kids, and have a very child-like view of the world. So a 12 year old girl at my school, fresh to the JHS tried out a new shampoo, and was insanely excited how soft her hair got. So when she was coming into the school she said, oh sensei, look how soft my hair is, feel it, and immediately like threw her pony tail into my hand. I let it go immediatley, and just said wow that's amazing. However, her mom was standing right there, and complained to the assistant principal, who was also outside saying hi to students. The assistant principal immediately snapped back with, I don't know if you saw what I saw, but your daughter basically threw her hair into his hand, what was he supposed to do. If you don't want her to do that kind of thing, tell her it's inappropriate, I am sure he was much more uncomfortable than she was.\n5. Every time a fight happens inside the school, me, or another larger male teacher will go break it up, get the kids into seperate rooms, figure out what happened, talk to them for 20-30 minutes, and that's it. That's the whole story. There are no police, if there are no injuries and it was a first time occurence, than there is no escalation to parents, it's just chill.\n6. If a student is being a complete fucking menace, and preventing other student's from learning. Another teacher who is free during that period will come to the room, and essentially be that kid's watcher. If the kid continues to disrupt the class to the point where other students can't learn, then the extra teacher will take them somewhere else (the gym or something) and just hangout with them until they calm down.\n7. Anytime a parent complains about anything regarding curriculum/a teacher's behavior, the assistant principal/principal answers the same way, 100% of the time. I am sorry you feel that way, we are legally required to teach this curriculum, and there is nothing we can do to change that. If you have any further issues please contact your local representative.\n8. The pay is standard nationwide, and is roughly 1.25x the national average salary\n\n&#x200B;\n\nI don't know how the hell you guys do it.\n\nAlso, I really hope this post didn't read as, HA HA LOOK AT HOW GREAT MY LIFE IS , SUCKERS!\n\nThe whole reason I was inspired to get into teaching in the first place was a few teachers I had while growing up in America.\n\nI just can't believe how fucking terrible it is teaching in the U.S.\n\n&#x200B;\n\nP.S. - I pay for 0 of my school supplies.",
    "title": "How do you all deal with this shit?",
    "subreddit": "Teachers",
    "timestamp": 1687173017,
    "score": 3005,
    "keyword": "japanese principal"
  },
  {
    "text": "Top complaints I received when managing a complaints unit in the education system A redditor suggested I compile some of my favourite complaints from my time running a complaints unit in the education system. So here are a few (including the one that inspired this post):\n\nA mom complained that the teacher was harming her daughter’s mental health by failing her in English. The reason she failed was because she hadn’t submitted any work the entire year. The mom’s view was that if her daughter committed suicide due to the failing grade it was our fault. \n\nA member of the public called and told us that the local school was encouraging the Year 1 students to be alcoholics by getting them to chant “midori” over and over.  I found out it was sports day, the school taught Japanese and all the house teams were named using the Japanese words for different colours, midori meaning green. \n\nA dad called to complain that the school was oppressing his son’s religious rights by refusing to allow him to wearing his religious headdress in school photos. The religious headdress was a colander and their religion was the Church of the Flying Spaghetti Monster.  When dad came to meet with the principal he was also wearing a colander on his head. \n\nA local schools used songs instead of a school bell, and the kids got to vote for the songs. A parent complained about the song “I like to move it, move it” which was popular due to the movie Madagascar. He said that the song was referring to peddling drugs and the “move it” was a reference to drug trafficking.  \n\nA parent called to complain about a teacher assigning “the Hunger Games” as a class text. She said it was inappropriate to assign a book where children kill each other. She said they should assign classic books like Anne of Green Gables, or Great Expectations or Lord of the Flies. Hmmm. She swore to me that she had read Lord of the Flies and it was a wholesome story about the value of boys working as a team. \n\nA father complained about the use of wifi in public schools and wanted us to return to LAN cables for internet access. As he was talking to me, he was hiding behind concrete columns to shield himself from wifi rays and told me he was worried about my ovaries. \n\nI once even had a community member who complain about one of my team members who “lied” to her about the principal’s name. She said that it was because we didn’t want to give the right email for the principal to the complaint. I was really confused as I know my staff wouldn’t lie. The complainant said “the principal’s name is Mary, not Dot!  Your worker lied to me” over and over again. I asked my worker and she swore she didn’t lie and just gave the principal’s email address. It only made sense to me when I saw Mary Jones’ email address which was Principal.Jones@SmithPrimarySchool. The complainant had heard this as Principal Dot Jones.",
    "title": "Top complaints I received when managing a complaints unit in the education system",
    "subreddit": "Teachers",
    "timestamp": 1684060498,
    "score": 1003,
    "keyword": "japanese principal"
  }
]