[
  {
    "text": "What are some Japanese/Anime songs that you can listen to that won't cause other people to immediately judge you?",
    "title": "What are some Japanese/Anime songs that you can listen to that won't cause other people to immediately judge you?",
    "subreddit": "AskReddit",
    "timestamp": 1690684778,
    "score": 1,
    "keyword": "japanese judge"
  },
  {
    "text": "The Chen 2023 Paper Raises Serious Concerns About Pediatric Gender Medicine Outcomes When I started my Child and Adolescent Psychiatry training in the 2010s, the diagnosis and treatment of gender dysphoria were rapidly becoming controversial in the field. Doctors and nurses who had spent decades on inpatient adolescent units, usually seeing one gender dysphoric child every 4-5 years, now saw multiple transgender-identifying kids in every inpatient cohort. It was a rare patient list that did not include at least one teenager with pronouns not matching their sex.\r  \n \r  \nViewpoints about this differed, with every student, resident, fellow, and attending having their own perspective. All of us wanted what was best for patients, and these discussions were always productive and collegial. While I am not naive about how heated this topic can be online, I have only ever had good experiences discussing it with my colleagues. Some of my attendings thought that this was merely a social fad, similar to Multiple Personality Disorder or other trendy diagnoses, like the rise in Tourette's and other tic disorders seen during the early pandemic and widely attributed to social media. Others, including myself early on, thought we were merely seeing psychological education doing what it is supposed to do: patients who would, in earlier decades, not realize they were transgender until middle age were now gaining better psychological insight during their teen years. This was due to a combination of increased tolerance and awareness of transgender people and was a positive good that shouldn't necessarily raise any red flags or undue skepticism.\r  \n \r  \nDuring my outpatient fellowship year, I began to suspect a combination of both theories could be true, similar to ADHD or autism, where increasing rates of diagnosis likely reflected some combination of better cultural awareness (good) and confirmation bias leading to dubious diagnoses (bad). Confirmation bias is always a problem in psychiatric diagnosis, because almost all psychiatric diagnoses describe symptoms that exist along a spectrum, so almost anyone could meet the DSM5TR criteria for any condition, so long as you ignored the severity of the symptom, and people are often not good at judging the severity of their own symptoms, as they do not know what is \"normal\" in the broader population.\r  \n \r  \nI considered myself moderate on these issues. Every field of medicine faces a tradeoff between overtreatment and undertreatment, and I shared the worries of some of my more trans-affirming colleagues that many of these kids were at high risk for suicide if not given the treatment they wanted. Even if you attribute the increase in trans-identification among teens to merely a social fad, it was a social fad with real dangers. If an influencer or spiritual guru on social media was convincing teens that evil spirits could reside in their left ring finger, and they needed to amputate this finger or consider suicide, the ethical argument could be made that providing these finger amputations was a medically appropriate trade of morbidity for mortality. \"How many regretted hormonal treatments, breast surgeries, or (in our hypothetical) lost ring fingers are worth one life saved from suicide?\" is a reasonable question, even if you are skeptical of the underlying diagnosis.\r  \n \r  \nAnd I was always skeptical of the legitimacy of most teenagers' claims to be transgender, if for no other reason than because gender dysphoria was historically a rare diagnosis, and the symptoms they described could be better explained by other diagnoses. As the old medical proverb says, \"when you hear hoofbeats, think horses and not zebras.\" The DSM5 estimated the prevalence of gender dysphoria in males as a range from 0.005% to 0.014%, and in females as a range of 0.002% to 0.003%, although the newer DSM5TR rightly notes the methodological limitations of such estimates.\r  \n \r  \nRegardless, most of the symptoms these teens described could be explained as identity disturbance (as in borderline personality disorder and some trauma responses), social relationship problems (perhaps due to being on the autism spectrum), body image problems (similar to and sometimes comorbid with eating disorders), rigid thinking about gender roles (perhaps due to OCD or autism), unspecified depression and anxiety, or just gender nonconforming behavior that fell within the normal range of human variation. It seems highly implausible that the entire field of psychiatry had overlooked or missed such high rates of gender dysphoria for so long. Some of my colleagues tried to explain this as being due to the stigma of being transgender, but I do not think it is historically accurate to say that psychiatry as a field has been particularly prudish or hesitant to discuss sex and gender. In 1909 Sigmund Freud published a case report about \"Little Hans,\" which postulated that a 5-year-old boy was secretly fixated on horse penis because of the size of the organ. I do not find it plausible that the next century of psychoanalysis somehow underestimated the true rate of gender dysphoria by multiple orders of magnitude because they were squeamish about the topic. In fact, the concept that young girls secretly wanted a penis was so well known that the term \"penis envy\" entered common English vocabulary! Of course, the psychoanalytic concept of penis envy is not gender dysphoria per se, but it is adjacent enough to demonstrate the implausibility of the notion that generations of psychoanalysts downplayed or ignored the true rate of gender dysphoria due to personal bigotry or cultural taboo.\r  \n \r  \nTherefore, for most of my career I have been in the odd position of doubting my gender-affirming colleagues, who would say \"trans kids know who they are\" and talk about saving lives from suicide, but also believing that they were making the best of a difficult situation. In the absence of any hard outcome data, all we had to argue about was theory and priors. I routinely saw adverse outcomes from these treatments, both people who regretted transitioning and those whose dysphoria and depression kept getting worse the more they altered their bodies, but I had to admit this might be selection bias, as presumably the success cases didn't go on to see other psychiatrists. I could be privately skeptical, but without any hard data there was no public argument to make. The gender affirming clinicians claimed that they could correctly identify which kinds of gender dysphoria required aggressive treatment (from DSMIV-TR to DSM5 the diagnosis was changed to emphasize and require identification with the opposite gender, rather than other kinds of gendered distress and nonconformity), and even when they were wrong they were appropriately trading a risk of long term morbidity for short term mortality. There was nothing to be done except wait for the eventual long term outcomes data.\r  \n \r  \nThe waiting ended when I read the paper \"Psychosocial Functioning in Transgender Youth after 2 Years of Hormones\" by Chen et al in the NEJM. This is the second major study of gender affirming hormones (GAH) in modern pediatric populations, after Tordoff 2022, and it concluded \"GAH improved appearance congruence and psychosocial functioning.\" The authors report the outcomes as positive: \"appearance congruence, positive affect, and life satisfaction increased, and depression and anxiety symptoms decreased.\" To a first approximation, this study would seem to support gender affirming care. Some other writers have criticized the unwarranted causal language of the conclusion, as there was no control group and so it would have been more accurate to say \"GAH was associated with improvements\" rather than \"GAH improved,\" but this is a secondary issue.\r  \n \r  \nThe problem with Chen 2023 isn't its methodological limitations. The problem is its methodological strength. Properly interpreted, it is a negative study of outcomes for youth gender medicine, and its methodology is reasonably strong for this purpose (most of the limitations tilt in favor of a positive finding, not a negative one). Despite the authors' conclusions, an in-depth look at the data they collected reveals this as a failed trial. The authors gave 315 teenagers cross-sex hormones, with lifelong implications for reproductive and sexual health, and by their own outcome measures there was no evidence of meaningful clinical benefit.\r  \n \r  \n315 subjects, ages 12-20, were observed for 2 years, completing 5 scales (one each for appearance, depression, and anxiety, and then two components of an NIH battery for positive affect and life satisfaction) every 6 months including at baseline. The participants were recruited at 4 academic sites as part of the Trans Youth Care in United States (TYCUS) study. Despite the paper's abstract claiming positive results, with no exceptions mentioned, the paper itself admits that life satisfaction, anxiety and depression scores did not improve in male-to-female cases. The authors suggest this may be due to the physical appearance of transwomen, writing \"estrogen mediated phenotypic changes can take between 2 and 5 years to reach their maximum effect,\" but this is in tension with the data they just presented, showing that the male-to-female cases improved in appearance congruence significantly. The rating scale they used is reported as an average of a Likert scale (1 for strong disagreement, 3 for neutral, and 5 for strong agreement) for statements like \"My physical body represents my gender identity\" and so a change from 3 (neutral) to 4 (positive) is a large effect.\r  \n \r  \nIf a change from 3 out of 5 to 4 out of 5 is not enough to change someone's anxiety and depression, this is problematic both because the final point on the scale may not make a difference and because it may not be achievable. Other studies using the Transgender Congruence Scale, such as Ascha 2022 (\"Top Surgery and Chest Dysphoria Among Transmasculine and Nonbinary Adolescents and Young Adults\") show a score of only 3.72 for female-to-male patients 3 months after chest masculinization. (The authors report sums instead of averages, but it is trivial to convert the 33.50 given in Table 2 because we know TCS-AC has 9 items.) The paper that developed this scale, Kozee 2012, administered it to over 300 transgender adults and only 1 item (the first) had a mean over 3.\r  \n \r  \nThese numbers raise the possibility that the male-to-female cases in Chen 2023 may already be at their point of maximal improvement on the TCS-AC scale. A 4/5 score for satisfaction with personal appearance may be the best we can hope for in any population. While non-trans people score a 4.89 on this scale (according to Iliadis 2020), that doesn't mean that a similar score is realistically possible for trans people. When a trans person responds to this scale, they are essentially reporting their satisfaction with their appearance, while a non-trans person is answering questions about a construct (gender identity) they probably don't care about, which means you can't make an apples-to-apples comparison of the scores. If this is counter-intuitive to you, consider that a polling question like \"Are you satisfied with your knowledge of Japanese?\" would result in near-perfect satisfaction scores for those in the general public who have no interest in Japanese (knowledge and desire are matched near zero), but lower scores in students of the Japanese language. Even the best student will probably never reach the 5/5 satisfaction-due-to-apathy of the non-student.\r  \n \r  \nI am frustrated by the authors' decision not to be candid about the negative male-to-female results in the abstract, which is all most people (including news reporters) will be able to read. I have seen gender distressed teenagers with their parents in the psychiatric ER, and many of them are high functioning enough to read and be aware of these studies. While some teens want to transition for personal reasons, regardless of the outcomes data, in much the same way that an Orthodox Jew might want to be circumcised regardless of health benefits, others are in distress and are looking for an evidence-based answer. In the spring of 2023, I had a male-to-female teen in my ER for suicidal ideation, and patient and mother both expressed hopefulness about recently started hormonal treatment, citing news coverage of the paper. This teen had complicated concerns about gender identity, but was explicitly starting hormones to treat depression, and it is unclear whether they would have wanted such treatment without news reporting on Chen 2023.\r  \n \r  \nMoving on to the general results, the authors quantify mental health outcomes as: \"positive affect \\[had an\\] annual increase on a 100-point scale \\[of\\] 0.80 points...life satisfaction \\[had an\\] annual increase on a 100-point scale \\[of\\] 2.32 points...We observed decreased scores for depression \\[with an\\] annual change on a 63-point scale \\[of\\] −1.27 points...and decreased \\[anxiety scores\\] annual change on a 100-point scale \\[of\\] −1.46 points...over a period of 2 years of GAH treatment.\" These appear to be small effects, but interpreting quantitative results on mental health scales can be tricky, so I will not say that these results are necessarily too small to be clinically meaningful, but because there is no control group these results are small enough to raise concerns about whether GAH outperforms placebo. It is unfortunate that it is not always straightforward to compare depression treatments due to several scales being in common use, but we can see the power of the placebo effect in other clinical trials on depression. In the original clinical trials for Trintellix, a scale called MADRS was used for depression, which is scored out of 60 points, and most enrolled patients had an average depression score from 31-34. Placebo reduced this score by 10.8 to 14.5 points within 8 weeks (see Table 4, page 21 of FDA label). For Auvelity, another newer antidepressant, the placebo group's depression on the same scale fell from 33.2 to 21.1 after 6 weeks (see Figure 3 of page 21 of FDA label).\r  \n \r  \nI won't belabor the point, but anyone familiar with psychiatric research will be aware that placebo effects can be very large, and they occur across multiple diagnoses, including surprising ones like schizophrenia (see Figure 3 of the FDA label for Caplyta). I am genuinely surprised and confused by how minimal this cohort's response to treatment was. Early in my career I thought we were trading the risk of transition regret for great short-term benefit, and I was confused when I noticed how patients given GAH didn't seem to get better. This data confirms my experience is not a fluke. I could go in depth about their anxiety results, which on a hundred-point scale fell by less than 3 points after two years, but this would read nearly identically to the paragraph above.\r  \n \r  \nA more formal analysis of this paper might try to estimate the effects of psychotherapy and subtract them away from the reported benefits of GAH, and an even more sophisticated analysis might try to tease apart the benefits of testosterone for gender dysphoria per se from its more general impact on mood, but I think this is unnecessary given the very small effects reported and the placebo concerns documented above. Putting biological girls on testosterone is conceptually similar to giving men anabolic steroids, and I remain genuinely surprised that it wasn't more beneficial for their mood in the short term. Some men on high doses of male steroids are euphoric to the point of mania.\r  \n \r  \nBut my biggest concerns with this paper are in the protocol. This paper was part of TYCUS, the Trans Youth Care in United States study, and the attached protocol document, containing original (2016) and revised (2021) versions explains that acute suicidality was an exclusion criterion for this study (see section 4.6.4). There were two deaths by suicide in this study, and 11 reports of suicidal ideation, out of 315 participants, and these patients showed no evidence of being suicidal when the study began. This raises the possibility of iatrogenic harm. It would be beneficial to have more data on the suicidality of this cohort, but the next problem is that the authors did not report this data, despite collecting it according to their protocol document.\r  \n \r  \nThe 5 reported outcome measures in Chen 2023 are only a small fraction of the original data collected. The authors also assessed suicidality, Gender Dysphoria per se (not merely appearance congruence), body esteem and body image (two separate scales), service utilization, resiliency and other measures. This data is missing from the paper. I do not fully understand why the NEJM allowed such a selective reporting of the data, especially regarding the adverse suicide events. A Suicidal Ideation Scale with 8 questions was administered according to both the original and revised protocol. In a political climate where these kinds of treatments are increasingly viewed with hostility and new regulatory burdens, why would authors, who often make media appearances on this topic, hide positive results? It seems far more plausible that they are hiding evidence of harm.\r  \n \r  \nOf course, Chen 2023 is not the only paper ever published on gender medicine, but aside from Tordoff 2022 it is nearly the only paper in modern teens to attempt to measure mental health outcomes. The Ascha 2022 paper on chest masculinization surgery I mentioned above uses as its primary outcome a rating scale called the Chest Dysphoria Measure (CDM), a scale that almost any person without breasts would have a low score on (with the possible exception of the rare woman who specifically wants to have prominent and large breasts that others will notice and comment on in non-sexual contexts), even if they experienced no mental health benefits from the breast removal surgery and regretted it. Only the first item (\"I like looking at my chest in the mirror\") measures personal satisfaction. Other items, such as \"Physical intimacy/sexual activity is difficult because of my chest\" may be able to detect harm in a patient who strongly regrets the surgery but is worded in such a way as not to detect actual benefit. They should have left it at \"Physical intimacy/sexual activity is difficult\" because a person without breasts can't experience dysphoria or functional impairment as a result of having breasts, even if their overall functionality and gender dysphoria are unchanged. Gender dysphoria that is focused on breasts may simply move to hips or waist after the breasts are removed.\r  \n \r  \nTordoff 2022 was an observational cohort study of 104 teens, with 7 on some kind of hormonal treatment for gender dysphoria at the beginning of the study and 69 being on such treatment by the end. The authors measured depression on the PHQ-9 scale at 3, 6, and 12 months, and reported \"60% lower odds of depression and 73% lower odds of suicidality among youths who had initiated PBs or GAHs compared with youths who had not.\" This paper is widely cited as evidence for GAH, but the problem is that the treatment group did not actually improve. The authors are making a statistical argument that relies on the \"no treatment\" group getting worse. This would be bad enough by itself, but the deeper problem is that the apparent worsening of the non-GAH group can be explained by dropout effects. There were 35 teens not on GAH at the end of the study, but only 7 completed the final depression scale.\r  \n \r  \nThe data in eTable 3 of the supplement is helpful. At the beginning the 7 teens on GAH and the 93 not on GAH have similar scores: 57-59% meeting depression criteria and 43-45% positive for self-harming or suicidal thoughts. There is some evidence of a temporary benefit from GAH at 3 months, when the 43 GAH teens were at 56% and 28% for depression and suicidality respectively, and the 38 non-GAH teens at 76% and 58%. At 6 months the 59 GAH teens and 24 non-GAH teens are both around 56-58% and 42-46% for depression and suicidality. At 12 months there appears to be a stark worsening of the non-GAH group, with 86% meeting both depression and suicidality criteria. However, this is because 6/7 = 86% and there are only 7 subjects reporting data out of the 35 not on GAH from the original 104 subject cohort. The actual depression rate for the GAH group remains stable around 56% throughout the study, and the rate of suicidality actually worsens from Month 3 to Month 12.\r  \n \r  \nWe cannot assume that the remaining 7 are representative of the entire untreated 35. I suspect teens dropped out of this study because their gender dysphoria improved in its natural course, as many adolescent symptoms, identities and other concerns do. However, even if you disagree with me on this point, the question you have to ask about the Tordoff study is why these 7 teens would go to a gender clinic for a year and not receive GAH. Whatever the reason was, it makes them non-representative of gender dysphoric teens at a gender clinic.\r  \n \r  \nThe short-term effect of GAH is no longer an unanswered question. Its theoretical basis was strong in the absence of data, but like many strong theories it has failed in the face of data. Now that two studies have failed to report meaningful benefit we can no longer say, as we could as recently as 2021, that the short-term benefits are so strong that they outweigh the potential long-term risks inherent in permanent body modification. Some non-trivial number of patients come to regret these body modifications, and we can no longer claim in good faith that there are enormous short term benefits that outweigh this risk. The gender affirming clinicians had two bites at the apple to find the benefit that they claimed would justify these dramatic interventions, and their failure to find it is much greater than I could have imagined two years ago.\r  \n \r  \nI am not unaware of how fraught and politicized this topic has become, but the time has come to admit that we, even the moderates like me, were wrong. When a teenager is distressed by their gender or gendered traits, altering their body with hormones does not help their distress. I suspect, but cannot yet prove, that the gender affirming model is actively harmful, and this is why these gender studies do not have the same methodological problem of large placebo effect size that plagues so much research in psychiatry. When I do in depth chart reviews of suicidal twenty-something trans adults on my inpatient unit, I often see a pattern of a teenager who was uncomfortable with their body, \"affirmed\" in the belief that they were born in the wrong body (which is an idea that, whether right or wrong, is much harder to cope with than merely accepting that you are a masculine woman, or that you must learn to cope with disliking a specific aspect of your body), and their mental health gets worse and worse the more gender affirming treatments they receive. First, they are uncomfortable being traditionally feminine, then they feel \"fake\" after a social transition and masculine haircut, then they take testosterone and feel extremely depressed about \"being a man with breasts,\" then they have their breasts removed and feel suicidal about not having a penis. The belief that \"there is something wrong with my body\" is a cognitive distortion that has been affirmed instead of Socratically questioned with CBT, and the iatrogenic harm can be extreme.\r  \n \r  \nIf we say we care about trans kids, that must mean caring about them enough to hold their treatments to the same standard of evidence we use for everything else. No one thinks that the way we \"care about Alzheimer's patients\" is allowing Biogen to have free rein marketing Aduhelm. The entire edifice of modern medical science is premised on the idea that we cannot assume we are helping people merely because we have good intentions and a good theory. If researchers from Harvard and UCSF could follow over 300 affirmed trans teens for 2 years, measure them with dozens of scales, and publish what they did, then the notion that GAH is helpful should be considered dubious until proven otherwise. Proving a negative is always tricky, but if half a dozen elite researchers scour my house looking for a cat and can't find one, then it is reasonable to conclude no cat exists. And it may no longer reasonable to consider the medicalization of vulnerable teenagers due to a theory that this cat might exist despite our best efforts to find it.\r  \n \r  \n\\-An ABPN Board Certified Child and Adolescent Psychiatrist\r  \n \r  \nPS - To be clear, I support the civil rights of the trans community, even as I criticize their ideas. I see no more contradiction here than, for example, an atheist supporting religious freedom and being opposed to antisemitism. If an atheist can critique both the teachings and practices of hyper-Orthodox Hasidic Judaism, while being opposed to antisemitism at the same time, I believe that I can criticize the ideas of the trans community (\"born in the wrong body\") while still supporting their civil rights and opposing transphobia in all forms.",
    "title": "The Chen 2023 Paper Raises Serious Concerns About Pediatric Gender Medicine Outcomes",
    "subreddit": "medicine",
    "timestamp": 1691100364,
    "score": 2009,
    "keyword": "japanese judge"
  },
  {
    "text": "I'm middle aged but sometimes, I still feel like I don't belong I'm in my mid-40s and by now, I should have it figured out but I don't. I mean, I think generally I do but I got so triggered today. We're heading to Japan in a couple weeks and I know gratuity is not generally accepted.  There are exceptions though and I was asking about those exceptions on a visiting Japan FB group I'm in.\n\n95% of the comments were of disdain and admonishment.  I was accused of feeling superior to the Japanese, of wanting to change their culture, of not wanting to accept other cultures, of not giving a shit about anybody but myself and how so fucking American I am, which given the context, I translated that to how close-minded I am.\n\nWherever their anger is coming from, I'm not judging but it just got me thinking again about how being Asian and not really feeling like you belong anywhere, something I have struggled with my entire life but really it's been  years since I've even thought about. \n You get married, you have kids, your identity shifts to parenthood and raising children but their comments was a stark reminder: I'm too Asian in America and too American in Asia.  Last time I felt that way was in 1998 when I went on Taiwan Loveboat.\n\nI just needed to vent a little and didn't really have a place to do it.  I'm not teaching my kids anything about our heritage.  They're not learning Chinese and while I justify it to myself that, \"I just don't have the time,\" while partially true, if I'm having a hard time as a full ABC, how will my half AA/1/4 German 1/4 Irish/English kids deal with identity when they are older? \n\nI thought I was so over this identity crisis.  Leave it to some internet strangers into shaming me for not being stingy. My terrible attempt at trying to be funny.",
    "title": "I'm middle aged but sometimes, I still feel like I don't belong",
    "subreddit": "asianamerican",
    "timestamp": 1676952510,
    "score": 29,
    "keyword": "japanese judge"
  }
]