[
  {
    "text": "What to do with life? This is a bit of a weird question but it feels right to ask it here first. \n\nFor context I am still young, just graduated university, and landed a very good starting offer at a highly sought-after tech company. I have a new sense of stability - I am not constantly worried about doing Leetcode or applying to companies, I don't have to constantly read the news hunting for a new prestigious startup I could be working for, I'm not obsessively scrolling through Linkedin for a potential opportunity and the list goes on. Overall - I no longer am doing a lot of the tiring and time-consuming things I was trying to get that \"goal\" offer. \n\nThe problem? I feel empty almost. \n\nIt's been weird trying to affirm to myself that this newfound free time I spend on myself isn't being wasted but I'm slowly acclimating. I've hit that \"target\" I've had since middle school and I'm sorta lost now. \n\nWhat do I fill my time with? (Both technically with new things to learn to progress my career and personal life things)\n\nFirst - What is the next step of technical learning to progress my career? I want to grow as a technical developer, maybe become a principal developer in a few years ... reach a CTO level position, and either run development at a company or leave and join a startup as a CTO/Founding Developer (something like that). What do I start doing to hit that goat? I've seen people say to start with AWS Cloud Practioner, Systems Design, Distributed Systems but insight from experienced people would be great.\n\nSecond - What are new things I can do for fun? I do have hobbies currently: I like sports, love to cook, enjoy a wide variety of TV Media from American to Japanese and Korean. What new things can I explore?\n\nI also hope this post can help other students but STEM ones particularly. I've noticed a lot of us have devoted so much of our lives to landing that Facebook or Stripe offer new grad (or whatever is trending now) that we don't know what to do after we've achieved it.",
    "title": "What to do with life?",
    "subreddit": "cscareerquestions",
    "timestamp": 1632214675,
    "score": 3,
    "keyword": "japanese principal"
  }
]