[
  {
    "text": "HR Insulted Me and Will Not Answer My Questions Hi Reddit, this is my first post, so forgive me for any redundancy or mistakes.\n\nLast Thursday I started working at a Japanese Manufacturing Plant, mainly as a factory worker, but also as a person who can act as a coordinator between the Japanese and American employees. When I got the job offer, I was told that it'd be a 70/30 split between factory time and language support time, and after talking to one of the members of HR, he detailed that during 2nd shift I'd be spending a couple of hours out of every day interacting and working with the Japanese staff, while the majority is on the factory floor. This I am completely satisfied with, but I, wanting to have a more concrete time then 'sooner or later', went back in and talked to another person in HR. Let's just call them 'Jay'. \n\nI brought up my concerns about getting to do the language area of my job, and brought up what I've been told by the other HR managers. I end up getting told that \"I must of heard them wrong\" and that I'm being \"ungrateful\" for inquiring about the translation job because they were nice enough to hire me and give me a higher pay even though they already have a full time translator for 1st shift. Jay continues to tell me that what I heard was wrong because I was just hearing only what I wanted, and that Jay is a 'forgiving' person, so they'll let this one slide. I'm angry and hurt, and too scared to ever inquire about the 2nd part of my job ever again. I sent an email to the person who detailed what my days would look like just so I can have backup since Jay pulled the card of \"Oh, I talked to the other HR people and didn't hear anything about that\". I was also told that I wasn't 'focusing' on my job even though Jay is never on the floor. \n\nI agree with the points when Jay told me to 'calm down' and 'just trust in the process', but that deflection of responsibility and calling me 'ungrateful' really rubs me the wrong way about this company. Everybody else, my managers, the Japanese and American co-workers are fantastic. I thoroughly enjoy my job and surprisingly enjoy factory work despite not having any prior experience. \n\nOn another note, these HR people come in out-of-state since we currently have no local HR management. I don't know if that does much, but any advice or insight would be greatly appreciated Reddit.",
    "title": "HR Insulted Me and Will Not Answer My Questions",
    "subreddit": "jobs",
    "timestamp": 1565215217,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "Quitting temp to perm a month in I was contracted by a small Japanese-run staffing agency that specializes in finding workers for Japanese companies here in the US. I took it to get out of an untenable work situation and this particular staffing agency strongly prefers people who are bilingual over any other set of skills. \n\nJapanese is technically my first language but my main language is English after having lived in the US the majority of my life. My Japanese is like the equivalent of a native 8th grader who is just fluent enough but would not compare to a native speaker in their 30s who's had the time to hone their professional/adult lingo, as I am doing now, in English.\n\nAnyway, during the interview with the company (which was conducted all in Japanese which was a little bit awkward, because I would have conveyed myself way better in English) I told my prospective employers that while my conversational Japanese is good, my professional and technical vocabulary is very lacking. They assured me that this would not be a problem as the company culture is very American and all the vendors I would be dealing with are American. \n\nSo fine, it would be a good way to get a foot in the door into an industry in which I have no formal training. The job they described was that of being the lone support staff to a smaller department branching off from the main company that was hiring me, basically forming their own legal entity. I believe I was misled about just how contentious this particular split would be, and now I have come to find that while the initial company that hired me has been supporting my current company, they are under no legal obligation to really help other than as a professional courtesy. \n\nIt's a bit convoluted and not that important, but the fact is that now I'm getting all of my \"soft training\" through a different corporate company (other than the one that originally hired me) based in Japan, where 70% of my colleagues speak solely in Japanese. I am finding myself Google translating very formal work-related words I have literally never had to use/heard of in Japanese and it's making my job 10x harder, not to mention 40% of their instruction ends up in just me making blind assumptions. At this point I don't really have a clue how this corporate hierarchy even works. \n\nFurthermore, the person who is supposed to formally train me in the technical aspects of my job has been MIA for the first 3 weeks of my employment and is finally returning next week to train me. The bottom line is I either misunderstood the job and/or bit off more than I can chew. It was a little sus when I was extended an offer the same day after my interview. \n\nIn the meantime I have interviewed for a job and they extended a verbal offer but not a written one, which they promised would be in the next day or so. If and when I receive the written offer, I want to quit effective immediately. It's been less than a month since I started and since I haven't really done much in a way of being a significant support to the main team, I also don't see the point of giving 2 weeks notice just to train with the main trainer and then leaving. I do not have any plans of my time here ever making it onto my resume, nor will I ever make the mistake of contracting with a bilingual Japanese staffing agency ever again.\n\nThe problem is that both of my immediate supervisors will be out of town this week on business and they're really only placeholders for the trainer who is my ultimate supervisor who I've also only met once during the interview. There is going to be another manager but he's kind of in a lateral position to mine. \n\nSo who do I speak to directly about my quitting? The lateral manager guy? The temp agency and then just send out a mass email to everyone who I've slowly been interacting with throughout my time here?",
    "title": "Quitting temp to perm a month in",
    "subreddit": "jobs",
    "timestamp": 1548209846,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "Messaged for a marketing job on indeed... What do you think? I have been trying to find a graphic design, or anything similar, job for only about a week now. Im on the last year of my bachelors degree in Media Informatics with a minor in Japanese. Im pretty confident but know its a long road since it is a very competitive field.\n\nToday I got a message on indeed about a marketing representative position by the marketing manager at a Kitchen Remodeling place. He had said he read my resume I posted on Indeed and felt I would be a good fit. He briefly just said some generic things like, \"Willing to learn, thinking about customer needs, helping with appointment scheduling, etc\". \n\nIm confused since Im not 100% sure if this is a branding job or a field marketing job where I sell stuff or go to business expos. Ive been in various sales and retail positions for about 4 years now so I have a lot of experience with that; but im wanting to explore a different route with design. If its marketing regarding branding Im fine with that, but Im not interested in a sales position. \n\nHe listed his phone number and I assume the best thing to do is call and ask about more info on the position. I was wondering what typically is the case or what your opinion to do would be?",
    "title": "Messaged for a marketing job on indeed... What do you think?",
    "subreddit": "jobs",
    "timestamp": 1557863030,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "Wanting to take back control by behaving recklessly I wasn't sure where to post this but I realized this has a lot to do with being a woman and I wanted to get some support and feedback here. \n\nFor the past 4 years, I worked in a very male-dominated field, made worse by the fact that there was an extreme hierarchy system at this particular company. People came and went, but the culture remained the same - the women were supposed to be pretty, entertaining things, and the men went out and yelled, cursed, got shit done. I had heard the most stereotypical, sexist, horribly rude things you could ever imagine - \"you should just get married,\" \"get the pretty ones in the picture, not the dogs,\" \"there's nothing wrong with a woman coming to work just to find a husband,\" \"there's no point in teaching a woman anything after 30 because they're going to get married and pregnant soon anyway.\" No matter what your job position was, they called the women \"parrots\" because \"it's not like they actually know anything, they just parrot back what they've been told.\" This became my whole life. On top of that was the insane level of stress they put on you for actual work related things. Berating you, yelling at you, throwing things across the room to make your point was just the norm, and they were 12 hour work days, with 2-3 Saturdays a month as well.\n\nI quit 3 months ago because not only was I starting to feel physical effects from all this mental stress (I developed mysterious lower back pain, monthly colds, migraines, etc.) but I just felt like enough was enough. We had some senior executive members arrive for a VIP presentation and they put me in charge of making hot towels for them. You know the kind you get at Japanese restaurants? I was washing those out in the sink when it just all hit me at once and I burst out crying in the kitchen. I was literally washing rags at work and my job title was supposed to be \"Project Manager.\" \n\nI left this company for a different company and I am here now. This work culture is completely different. There are more women in executive positions, more women in general, and nicer people to deal with. No one is screaming or fighting or cursing. Everyone is just here to do their jobs and get along with their coworkers. \n\nSo happily ever after, everything should be great right? I am actually still just as on edge and restless as I ever was. No one is yelling at me, no one is pressuring me, no one is making disgusting comments.... and I feel like something is wrong. And I don't know what to do. I am in complete control of everything and yet I feel out of control. I drink every single night, I want to go out to strange bars and clubs and dance the whole weekend away. Anything that feels risky, slightly unsafe or dangerous appeals to me. I want to find a sugar daddy and get money from him and spend it all in one night.\n\nLuckily, I am not actually so reckless enough to indulge in any of these things.... but it's all still in my heart, it's on my mind. My whole body buzzes with this awful energy and I can't focus on my actual work. \n\nMy question is - will I actually feel any better if I do something crazy? I feel like I am on the cusp of some kind of psychological break through but I'm not quite there yet... what is wrong with me and what should I do? And in any case, I'm in such a positive, calm environment now... why am I unable to embrace that? It's right in my lap! \n\nHas anyone else felt this kind of \"energy\" before? What do I do about it? What is wrong with me?",
    "title": "Wanting to take back control by behaving recklessly",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554306894,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "What hours are normal for an industrial engineer? My husband is an industrial engineer and he's in a difficult situation at work. He works at a small factory that does tier 2 plastic and some tier 1 metal. The old plant manager did not allow any continuous improvement projects. During the seven years that my husband worked under him, he was basically assigned countless tasks not related to CI - I know that he talks about packaging and master data and countless other things that he is responsible for. Just everything without CI is probably enough work for 2 full time people.\n\nEnter new plant manager. My husband is promoted to a newly created CI manager position and give one employee - a blowhard who is not used to actually working and says things like, \"Why do we need to spend thousands of dollars on a crane? I can build something to do this for $100.\" Oh, and he feels like he should have gotten the CI manager job (high school education, zero engineering background) and is trying to sabotage my husband. I feel like I should also mention that there are several other people trying to sabotage my husband (plant manager is aware, he told my husband), because everyone is used to the old way of doing things - no change allowed, don't spend a penny even if it will save you $1000.\n\nMy husband has been putting in 11+ hour days for several months now, but got called in to speak to the plant manager and told that he is not getting his CI projects completed fast enough, not getting enough done. The new plant manager is the sort of person who likes to see his employees working 7 days a week. So, my husband did go in to the empty factory over the weekend and put in two full days of work. He has also started going in to work even earlier - he likes to do his extra hours in the am rather the pm. I think his basic plan is to be at work between 3 and 4 am and he usually leaves work at 5:30.\n\nAt the factory that he worked at previously, things changed over time until he was working a lot of overtime. I don't remember how many hours. Maybe leaving work at 7+? So he is worried that trying to find a position at a different factory is useless and not going solve the problem. He'll just end up somewhere else where he is overworked.\n\nHere are some of the pros and cons that we are trying to keep in mind:\n\nMoving to a new factory would probably mean that he would be in a place where coworkers understood and supported CI at least to the extent where they will not be actively fighting him on everything.\n\nMoving to a new factory would probably mean that his position will not be bogged down with a ton of additional responsibilities that would normally be done by a clerk or in some other department.\n\nWe currently live 1 mile from his factory. So the commute is nothing, he can even ride his bike to work.\n\nWe live near family. We would be moving away from my stepdaughter who has a daughter and another on the way. However, we don't refuse to move away because of this.\n\nMy husband got his IE degree in his mid 30's, spent a few years at a Japanese owned automotive factory - great experience - and then 7 years at his current factory where he wasn't allowed to do any CI. So he feels like he has missed out on a ton of growth and on the job experience.\n\n&#x200B;\n\nAny advice would be helpful. Is this a case of \"better the devil you know\"?",
    "title": "What hours are normal for an industrial engineer?",
    "subreddit": "engineering",
    "timestamp": 1548869007,
    "score": 5,
    "keyword": "japanese manager"
  },
  {
    "text": "Thinking of quitting dream job because of toxic managers; can't win for losing. Any advice or insight? **TLDR: I had a successful event recently, but no good feedback from any of my toxic management. Management only talks to me when I've done something wrong and I'm reaching my last straw.  I originally wanted a raise, but now I'm thinking of leaving my dream job at this toxic workplace. What would you do?**\n\nHi everyone,\n\nI'm a woman working in a toxic, male-dominated industry at an American company in Japan. Cool, famous company with big name-recognition; awful awful working environment.\n\nTo give an example of what I'm working with, the territory manager is a cold Japanese guy (let's call him Tanaka) who feeds on negative energy and my direct lead is a misogynist narcissistic American (let's call him Jimbo) who has really adapted to the Japanese culture of not being PC at all. He also has an awful temper, talks negatively about everything and everyone and will straight up ignore you if you're below him and he's mad at you or if he's wanting to feel important.\n\nJimbo's made jokes about cheating on his girlfriend, he's made multiple people in the office cry with his outbursts, he's belittled my ideas and then taken them to HQ without me in the discussion. When I asked him about why he did that, he gaslit me and said I remembered it wrong. He's done so much more, but I will leave it at that for now. Tanaka feeds off of Jimbo's energy and has given a lot of clout to Jimbo for his seniority and knowledge.\n\nUntil now, I've been trying to get through and biting my tongue because it's a dream job at a dream company with great benefits. I'm also trying to make it 6 more months before leaving so it doesn't look bad on my resume. However, a recent incident has my blood boiling, and I think I'm at my last straw.\n\nI have been in charge of an event that takes six months of prep. This is the first time I've been fully in charge. We had record-breaking numbers and turnout for the event. Another team was involved in getting speakers for the event.\n\nI was giving updates to Tanaka about the numbers, especially when we passed landmarks. I was expecting a pat on the back or something (he did that for the last person who was completely in charge) but I only got silence from him. I was a bit annoyed at this because he's quick to give negative feedback, so I was hoping for him to finally say something nice...\n\nAt the afterparty of the event, Jimbo pulls me aside and says, \"Good job on this event BUT you need to be giving more credit to people. The admin manager (gossipy JP woman) told me you've been taking all the credit\". I was shocked and hurt by this because I had never said this success was only because of myself. I was also increasingly annoyed because Jimbo frequently calls himself the \"One-man team\".\n\nI didn't want to think the team thought I was taking all the credit so I immediately tried to rectify this by thanking everybody for their hard work. I said I couldn't do the event alone, and I also got some nice sweets for everyone. I also wrote HQ with giving the team clear credit for their work, and HQ wrote back saying we did an amazing job (nicest feedback I had gotten that far; was in tears when reading it).\n\nIn the end, I couldn't get any positive feedback without a \"but\". The territory manager has been colder to me than usual (I have also been noticeably quieter/standoffish than usual for sure and Japanese people are the most passive aggressive people on Earth).The general admin lady has barely talked to me for the past few weeks which has been awful because she was usually nice to me.\n\nI was going to ask for a raise but the territory manager is so mean-spirited. I'm getting to the point of wanting to leave my dream job. These people have been so awful. I would like to try and work at HQ, but I have had absolutely no success in finding any advocates for me there. I feel like I should talk to Tanaka and see why he's mad at me, but direct confrontation doesn't always work in Japan, and I'm tired of apologizing to these grade A assholes.\n\nMisc. info; we recently had reviews for everyone. I was quite honest (while being hopefully professional and leaving anecdotes out of the reviews). People haven't received their reviews yet and the hammer's coming down on me probably early next week...\n\nI feel depressed and helpless. The most interesting thing about me is this job and I don't know what I would do after this...\n\nAny advice?\n\nEdit: Thank you guys for all the kind words and advice. I'm putting my resume together now.",
    "title": "Thinking of quitting dream job because of toxic managers; can't win for losing. Any advice or insight?",
    "subreddit": "careerguidance",
    "timestamp": 1571670220,
    "score": 123,
    "keyword": "japanese manager"
  },
  {
    "text": "Teaching is wearing me down to the point where it's unhealthy. What careers should I look into? I've been a teacher for 6-ish years now.  I've taught a weird variety of things (French, English, computer, Bible, art, etc.), to every grade K-12, at public and private schools.  My default is to say, \"I love it,\" but I'm really questioning that now.  What I know for sure is that **I need at least a year away from teaching to see if I'm healthier in a different career**.  I have a lot of feelings about this, so I'll bold what's important and you can skip the rest.\n\nPositives and negatives of my experience as a teacher:  \n\\+ The public school parents were very supportive of me and quick to straighten out their kids if they had issues.  \n\\- The private school **parents** are downright cruel to my coworkers and me.  Their kids can do no wrong and they demand that we make good grades happen.  Picture the \"I demand to speak to your manager!\" lady, but there are dozens of them and they have kids and I'm responsible for parenting them because the Karens won't.  (Have I got STORIES.)  \n\\+- Dealing with those parents is manageable when I have a very supportive principal who backs me up.  When I don't (and we have a lot of turnover, so it's very on and off), I'm kinda screwed.  There's no winning with Karens.  \n\\+ The private school kids are, for the most part, absolutely amazing.  They work hard and are respectful.  Some days we have serious life discussions, occasionally we have a turtle dance party.  It's like a big family.  \n\\+ The public school kids were sweet in their own odd ways, like drawing me as Big Fat Meany Mrs. Puff or shooting spitballs at me in the cafeteria.  No, really, they meant these things as compliments.  \n\\- The public schools where I've worked had daily fights.  I'm not intimidating enough to deal with those, and it made me so sad when a sweet kid would get beat up just for being different.  There were so many issues I couldn't begin to help with, and with 30 kids in most classes, I had to just keep teaching even if a girl's eyes were bloodshot from drugs or a boy had his head down because his dad got angry again last night.  \n\\+ I love kids.  I get so attached to them that I cry at the end of every school year.  I want to adopt every one of them.  \n\\+ Teachers are pretty fun to be around, honestly.  I've made some great friends among my coworkers, and I've learned a lot about life from others.  At my current job, it's like a family too.  We get together at the math teacher's house twice every summer for a homemade lunch, and at work we laugh 'til our faces hurt.  Also nice: the nature of our job makes it so we have to keep safe boundaries in our conversations, so awkward oversharing really doesn't happen much.  \n\\- Things change every year.  Change is good, but in teaching, it's mostly **pointless annual changes**.  A new lesson plan format, a new buzz word to learn, blah blah.  There's so much we should be changing, but instead we change the language of it.  I gave up on even keeping my lesson plans from one year to the next because trying to adjust them to the new formats took longer than starting over.  Like, I get that the non-teachers in charge of education get bored, but *stahp.*  \n\\- *Non-teachers are in charge of education.  I would like to personally kick each one of them in the shins.*  \n\\- There's no end to the work.  From student teaching through my first or second year of teaching, I hardly slept.  (Part of that was typing *pointless lesson plans*, but that's beside the point.)  Teaching is a job where you could work 24/7 and still not be providing the ideal education.  **There's always more you could/should/would be doing**, always lessons to improve, always activities/games to create, always differentiation to implement, always parents to email, and every individual kid needs individual help.  I had a really strong work ethic until I taught for a while.  Now I know it's partially in vain, because...  \n\\- Both my jobs teaching French have ended because I didn't increase the numbers enough.  Here's the thing: At my first job, I *doubled* the enrollment in French.  They said I should have tripled it.  At the second job, we only offered French at first, so everyone took it.  They added Spanish while the school's numbers were too low, so my classes shrunk drastically.  I worked hard to create an exploratory program to get kids excited about French, and I was going to have a decent French 1 this year.  But they said it wasn't enough.  \n\\+ Summers and weekends off, yo.  \n\\+ I love that teaching makes it so easy for me to **encourage** and help people.  At the first job, I was in the Sunshine Club and we would just do little things to cheer the kids and teachers up every so often.  At my current job, I've done things like decorating the halls, writing encouraging notes to kids, and cheering the kids on at games.  It gives me life.   \n\\+ I have a lot of fun with the creative side of teaching, on the rare occasions I have time for it.  I paint posters for each individual volleyball player, make decorations for the classroom, stuff like that.  **Doing some art on a regular basis is good for my health.**  \n\\- The **pay** is seriously problematic.  At the public school, I made a totally reasonable salary and had benefits and retirement.  At the private school, I make $21k per year.  No benefits except a little bit of help with health insurance.  I can only afford to work there because I have extremely low rent.  \n\\- **The job is so mentally, emotionally, and physically exhausting that I don't think it's healthy for me to stay much longer.  I get home some days and almost fall asleep in my driveway because I don't have the energy to get out of the car.  There are so many late nights required for school functions.  I don't have the time or energy to plan meals, cook healthy food, or exercise.  Some years are marked in my memory by crying on the bathroom floor trying to get ready for work, wanting a day off so badly, then crying at my desk when work ended.  To be fair, I do have major depression, and it's better now with treatment.  Still, my energy and motivation are very low and I've been really questioning whether a different career would help me manage.**  \n\\+ And the thing is, I do enjoy teaching.  I like teaching people things.  I feel warm fuzzies when kids can do something new that they couldn't do yesterday.\n\nWhat I'd look for in a new job:  \n\\+ Working for people who don't feel **entitled** to treat me like a bag of dog poop  \n\\+ **Fun** coworkers who keep professional boundaries  \n\\+ The company is well **organized**  \n\\+ **Clear** expectations  \n\\+ **I don't take work home** / I can have a life outside of work / once it's done, it's done  \n\\+ Salary that **pays the bills**, lets me get my teeth fixed, and allows me to **retire** (preferably early if I invest)  \n\\+ Somewhere I can be **creative**  \n\\+ Somewhere I can **help/encourage** people.  Even if the job itself is mundane, I want at least a workplace where I'm allowed to do small, kind things for the people around me.  \n\\+ I'd be cool with having the option to do overtime work.  Heck, getting paid to work late is a totally novel concept to me.\n\n**I know it makes sense for me to get a job working with kids, but I'm thinking I'll do that on the side.**  Maybe help at a youth group or something.\n\nSkills I have:  \n\\+ **Typing** (100+ wpm, personal best 141)  \n\\+ **Writing/grammar/English/editing**  \n\\+ Kind of **psychology**.  I had some psych in college.  I've been through a lot and worked with kids who also have emotional issues.  \n\\+ **Art** (traditional and digital, but I'm no professional)  \n\\+ **Photography** (more the artsy side than the technical side, until I can take a class)  \n\\+ Fluent in French, but not sure I want to use it  \n\\+ Dealing with difficult people  \n\\+ **Computer** stuff, to an extent  \n\\+ **Teaching**, obv  \n\\+ **Working hard** at both tedious and challenging projects  \n\\+ I'm kind of an idea person?  \n\\+ Staying **calm**\n\nInterests:  \n\\+ **Video games** (my #1 favorite thing)  \n\\+ **Learning languages**, especially Japanese, Korean, maybe Italian, but really anything  \n\\+ **Writing** (I want to write YA books eventually and would also consider writing articles of some sort)\n\nWeaknesses:  \n\\- I'm very **honest**, so I have to work for something I believe in, even if it's just toothbrushes that definitely brush teeth.  \n\\- My face shows exactly what I'm feeling  \n\\- I get **migraines** from: being on the computer too much (I can be on for many hours, but not ALL day), loud and repeated noises, going in and out of AC too much, flashing lights, etc.  \n\\- I'm over 90% **introverted**, so I really need a lot of time to myself to recharge.  That means no more than a 40 hour work week and minimal social events.  I'm chill with having lunch with my coworkers and the occasional fun outing, but I couldn't do a job that relied on serious socialization.  Small talk?  No prob.  Telling you about something I believe strongly in?  Easy.  Getting to know people and networking with them?  I have some of the skills, but it's exhausting.\n\nPersonality: INFP, Ravenclaw, Enneagram 1w2\n\nSo I'm thinking I should look into being a secretary or doing some kind of writing, but I'm interested in knowing what other jobs might be a good fit for me and what experience you all have in those fields.",
    "title": "Teaching is wearing me down to the point where it's unhealthy. What careers should I look into?",
    "subreddit": "careerguidance",
    "timestamp": 1568775391,
    "score": 4,
    "keyword": "japanese manager"
  },
  {
    "text": "Should I be paid on or off the books?  So I'm a 16 year old HS student in new Jersey and I started my first job as a bus boy last week. When I met my boss for the interview he told me I would get payed minimum wage ($10.00 here) and after takes it would be around $8.50. He didn't tell me to do paperwork or anything and I was kinda confused about how my pay was gonna work but hes an old Japanese guy and I just thought I should let it be for the interview. Last night after I finished work I asked the manager (a different person than my boss) about getting paid and filing for taxes and she said that because I was just part time they were gonna pay me in cash at $8.50 an hour which she claimed was around the same as the minimum wage after taxes. She said she would pay me on Sunday and also said if I wanted to I could be paid on the books but she made it seem like I would make less if I did so I said no. I worked 22 hours last week so would it be better for me to be payed in cash or on the books?",
    "title": "Should I be paid on or off the books?",
    "subreddit": "careerguidance",
    "timestamp": 1572710331,
    "score": 3,
    "keyword": "japanese manager"
  },
  {
    "text": "should I take the chance? Hi, first of all, I studied Mechatronics (now 26), Trilingual (English, Japanese, Bahasa Indonesia and a lil bit of Mandarin) and now working in Japan as a Mechanical Design Engineer or what they call it 機械設計 in Japanese. I also have experience in Controls using PLC at my current company which mainly deals with Measurement and Calibration system.\n\nAs a Mechatronics student, we did touch a couple of programming languages such as MATLAB, Labview, ANSYS, C++, but not more than just a tool for doing analysis, not develop things like what they do at IT or Computer Science classes.\n\nI did touch Python on my own, but never really got deep with that. I know I could do it if I put more effort, but I couldn't take more of my focus away from my current job and family.\n\n&#x200B;\n\nEnough with intros, So recently I got a mail on LinkedIn from a recently established robotics company(2015), but a subsidiary of one of the biggest media/telecommunication company in Japan.\n\nThey are currently planning a large scale projects about next generation logistics by automating a lot of stuffs and the HR manager told me that my experience at my current company and my educational background suits the position of a System Architect??? in their company.\n\n&#x200B;\n\nMy heart says that I want to challenge this job because it could be a step forward in reaching my dream, I have always wanted to start my own company but I am not able to take the risk because I have a family right now.\n\nAnd by being a System Architect for a new project/venture like this, I could definitely gain experience while scaling down the risk if I do fail ( I get fired at most, but probably they won't because it's a Japanese company).\n\nMoreover, the pays and benefits/welfare are much better than my current company because the parent company is one of the biggest company in Japan.\n\n&#x200B;\n\nOn the other hand, my brain says \"hold-on, the position does not really align with my experience and all that, does it?\". Ok, perhaps there might be some of my skills that could be used, but system architect is not a job for mechatronics engineer rather for those ppl who excels in IT and computer science (or maybe I am just wrong on this part).\n\nAlso, by having to take the steering wheel of this project, the responsibilities are gonna be huge and it would be very busy (much as doing a startups i guess?). Which means I would have lesser time than I already have with my family.\n\n&#x200B;\n\nSorry for the long post, should I take the challenge or turn it down?",
    "title": "should I take the chance?",
    "subreddit": "careerguidance",
    "timestamp": 1558322636,
    "score": 3,
    "keyword": "japanese manager"
  },
  {
    "text": "How can I get more references? I am currently at a terrible dead end job, and I'm looking around for something better. Unfortunately my managers and supervisors refuse to be put as references because it's against company policy while I'm still employed there (something about avoiding retaliation). I have been at this place for almost 3 years, so that means any references from before that time are very outdated! I understand now how important it is to keep in touch with old employers, but I've messed that up by not doing so.\n\n&#x200B;\n\nI know need at least 3 current references to apply for any job, so what do I do? I have to work 9 1/2 hour days Mon- Fri and at least every 4th weekend, so it's not going to be easy to pick up a part time job, especially when I'm trying to learn some skills on the side (At the moment I'm limiting my focus to Java, Japanese and animation.) \n\n&#x200B;\n\nShould I try to get a part-time job anyway? Is this situation salvageable?\n\nEdit: I should make it known that though I give the impression of being a young person, I am actually 26 and have been out of school for 3 years.",
    "title": "How can I get more references?",
    "subreddit": "careerguidance",
    "timestamp": 1566756203,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "I'm returning from TEFLing for a significant amount of time. What can/should I do to plan ahead, when I'm not really sure what it is I want to do when I get bacK?   \n\nHello, Reddit I feel a bit lost and need some advice. The TLDR of this is that  I’m nearly 29 and in my fourth year of teaching English in Japan as an Assistant Language Teacher, and I need to decide if I want to carry on here, or go back home. But don’t know how to proceed once I get back home.\n\nI’m leaning towards going back home; it turns out I’m less okay with not being very well paid and being far away from my family than I thought I’d be. But if I go back home I have no idea what I could do work wise, as my education/work history hasn’t geared me to acquiring any hard skills, at least not to a level that I could be paid for them. As such, googling different work areas, nothing looks particularly appealing, but what I would want to do isn’t really an option any more. And I need to make a decision. I feel like a deer in the headlights of the oncoming truck of time…I probably shouldn’t have been standing in the road for so long.\n\nHere’s what I’m sitting on;\n\nFor my GCSEs, (I’m from the UK,) I got 5 A’s and 6 B’s. Then for my A levels got a C, and an E; that E was in maths. I was miserable and lonely at school. As such, I didn’t study very hard and just wanted to play video games and watch anime into the early hours of the morning, to escape. I was able to coast by with not studying for my GCSE’s, but not my A levels. It didn’t help that I chose those topics based on what I thought I “should” study, without a concrete goal in mind, rather than what I think I might have enjoyed or would have been good at. \n\nObviously with those grades, I wasn’t able to get into university just then. I had originally had planned to do a gap year, and that turned into a gap two years. It was volunteer work for a charity abroad doing basic stuff, working in a kitchen, shifting inventory around etc. At the end of it I was thinking of re-doing my A levels but in different subjects. Drawing was and is hobby of mine (not great at it, not bad, but not great) and, so I was considering doing graphic design or illustration etc. But my parents were insistent that I needed to go get a degree, any degree. “It shows you can think.” They said.\n\nThey found, a four year, access to higher education, social anthropology course. It seemed interesting, so I went ahead with it, without thinking about exactly what I do with it after. Just the generic, naïve, mind set of degree = good job. Yeah…that was not the best idea.\n\nIt was interesting, but I didn’t like the university itself, so I leveraged my gap years and the one year access to higher education course to apply to higher ranked universities in the same subject. Luckily this worked. So from getting a C,D and an E, I managed to get a 2:1 social anthropology degree from a  university which would have required 3 A’s at A level, which is at least something. \n\nAfter graduating, was a period of unemployment, filled in with some volunteering, a weekend TEFL course, and trying, more seriously to learn to draw. Then went to Japan as an ALT.\n\nHonestly, it was just because I was a nerd and wanted to go to Japan. I was also sponging off my sister at the time, which was motivation to just get a job, any job. And it’s not great trying to find work when you have to explain exactly what your degree means, at least people know what “English,” and “History” and “Philosophy,” are. At the time I thought I could make a career out of being and English language teacher. And I feasibly still could, get a CELTA and then a DELTA. I’m just not sure I want to. I don’t dislike teaching,  I’m just kind of neutral towards it, but that isn’t enough to keep me here in Japan. Though I wouldn’t necessarily call what I do as an ALT “teaching,” more “human tape recorder + person who comes up with grammar practice activities.” Fun when the students enjoy it, sucks when they don’t. But it’s too easy and is kind unfulfilling. And it isn’t paid very well. I’m not expecting to make a lot of money. I think the potential for that ship sailed long ago, but higher than minimum wage would be nice.\n\nI must admit I feel like I’ve wasted the next three years, though this  past year has been better. I’ve lost a lot of weight. I was lucky enough to find a Japanese teacher in January, and passed the N5 Japanese Language Proficiency Test (the lowest level) in August. Tried the N4, a few days ago, though I’m pretty sure I didn’t past that. I was trying to cram a lot of grammar in the space of three months and just wasn’t used enough to using it all simultaneously. I definitely still continue to study, but it will be years before I know enough for it to be useful in a work environment, and I need to make a decision now.\n\nOver the past few months I’ve also learned CSS and html and I’m working through Free Code Camp, learning JavaScript. I took a bite of the meme, “learn to code.” Whether I actually use it or not to be a front end web developer is uncertain, but even so it’s still useful and interesting to know for its own sake. I’ve also downloaded an Excel course off of Udemy that intend to go through, now that I’m not spending most of my time studying Japanese. But I kind of feel like I’m grasping at straws, just doing what I can, because I’m not really sure what to do. \n\nSo I guess, my situation is that I need to do something that makes me more attractive to employers, what I should do or how to pick a direction, when the thing that actually interests me (the art) isn’t really something I can get paid for. Getting a masters degree is so an idea; in a subject that’s more immediately useful than Social Anthropology. But it’d be an awful lot of extra debt to take on, without a definite plan in mind. And I don’t think my background leans me towards anything in particular. So I don’t know what I should do. Meanwhile the clock is relentlessly ticking, ever ticking.\n\nSo I could really do with some advice.",
    "title": "I'm returning from TEFLing for a significant amount of time. What can/should I do to plan ahead, when I'm not really sure what it is I want to do when I get bacK?",
    "subreddit": "careerguidance",
    "timestamp": 1575362010,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Expectations of an Engineering Manager I have been a security engineer for less than a year in my company's security team. I feel like my Engineering Manager is not performing what would be expected of him, but I would like to ask for other opinions.\n\nBackground: My team is split into subteams dealing with different products. I do product support, so my responsibilities include doing security reviews or penetration tests for new feature releases of our product. We have an EM for each subteam. My EM joined the company about 3 months ago (I was previously under another EM who joined around the same time as me). What he has been working on mainly our whole team's working proccesses, like how to manage our tickets. This is to give visibility to upper management on what we are working on. However, he has not been involved in any of our assigned product's projects. He does not know even basic information like what the timelines are or the people working on the projects. There is somewhat of a language barrier here, as our company communicates and documents in 2 languages (English and Japanese), and his Japanese is poor. However, the rest of our team accepts it as a fact of life and makes use of Google Translate, interpreters and so on to get by. Hence, it should not be an excuse for poor comprehension.\n\nWhile I understand each EM has their own style, other team EMs I have worked with understood at least the background and context of the projects they are associated with, and thus were able to provide me with high-level advice or a general strategy on how to proceed with a project. They also actively communicate with other teams and provide suggestions to them. In contrast, I feel that whether my EM is there or not makes no difference to my progress on projects. Each week he asks how a particular task is going, I give him a status update, and that's about it.\n\nMy EM has already irritated some other teams. For example, there was an issue with some information disclosure in the requests our backend was sending. My EM created a bunch of tickets simply saying 'Fix sending X in requests' sent to different teams involved without any explanation of the background or specifically what each team involved should do. Most of the teams (naturally) didn't respond. One team's tech lead told him off and told him to provide context when he requests a team to do something. And even though that project fell under my EM's domain, he asked another (more experienced) team EM to handle it instead! That EM ended up being the one to communicate with the tech lead and advise on how to solve the issue. Which I felt strongly is what my EM should have been doing instead, instead of handing off to someone who is not even in charge of those projects.\n\nI am not the only one who feels this way about my EM. My mentor, who is a more experienced security engineer on a different subteam, bluntly told me \"your EM is fucking useless\" for the reasons stated above. Others feel he is focusing on way too minute details (most of his day to day work seems focused around how to configure tickets or run sprints) while we have big security issues to fix in the company.\n\nSo my questions are what exactly I should be reasonably expecting from an EM, and how I can deal with my EM. We just had a feedback window and I wrote some feedback (which has not yet been reviewed) suggesting that he read more project documentation and communication from other teams so he would be more up to date and be better able to assist the teams. I also suggested that when communicating with other teams about tasks, he should provide context and solutions for them so they feel we are helpful rather than being a nuisance ordering them to do things. I am also considering changing subteams to be under another EM, because I do not feel my EM will be able to help me develop technically or professionally. I feel that since I am pretty junior, I would prefer an EM who provides more guidance. (And I do not want to be associated with someone who is likely to irritate many other engineers.) I would like to know how I should proceed for the next few months, and how I can go about the proccess of changing teams. Thanks for reading this far.",
    "title": "Expectations of an Engineering Manager",
    "subreddit": "cscareerquestions",
    "timestamp": 1561987593,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "I cried in-front of my co-workers As embarrassing as the title. I went for my first business trip with my current team (not my first business trip). We've been working non-stop, 5 A.M.-11P.M. some days, others 7 A.M. to 10 P.M., with almost no breaks in between, you get the picture.\n\nI was having a training session with a co-worker as our team is merging with a team that is having issues, so we are supporting them. From my team, I've done the less support as of request from my Manager, but I'm slowly being getting more and more involved. Now, this was my third training for the day, all the trainings were non relatable. The third training though, I was just not getting it, I think my brain was completely burnout. I admit my attitude was a bit on defeat mode, and it doesn't help that I work in a complete different language, and although english is also not my first language, their english is worst.\n\nMy co-worker starts getting very frustrated, she says she will go have a drink. I'm just tired by that point, and out of nowhere she screams. That finally caught my managers attention, and ask what was going on. I explain, and I said to him that I'm very sorry but my brain is just not getting this. I ask him if I can step out, and he explains we have work to do. I mentioned to him that I do understand, but I'm just not feeling well (In reality I was trying really hard not to feel). By that point my boss says, my other co-worker is coming up to explain. My co-worker arrives, explains, but I can't hold my tears. It was a combination of frustration of not understanding, embarrassment of making my co-worker get so frustrated at me to the point of screaming, and being told to suck it up. I felt frozen, and almost robot like, but with tears running down my face. I finished the training and started creating the files. But needless to say the damage was done. In the end I apologised to my boss and my team, and continued working.\n\nI asked my co-worker if I could have lunch with her in order to talk, and although we haven't done it due to time, I'm planning to talk to her soon. Now please add into consideration, I work in consulting in Japan. This is supposed to be a global pjt, but my team is all Japanese except for that co-worker who is Taiwanese. I'm from South America.\n\nNow, how to recover after this? Also, should I mention this situation to my Mentor?\n\n**Edit: Thank you everyone for the amazing advice, after reading all the comments/messages. I feel stronger and more encouraged about my upcoming decision. I truly appreciate it. For the people quoting Karoshi, please stop watching too much anime, is more complicated than that.**",
    "title": "I cried in-front of my co-workers",
    "subreddit": "consulting",
    "timestamp": 1569584633,
    "score": 100,
    "keyword": "japanese manager"
  },
  {
    "text": "A compilation of evidence debunking feminist historical revisionism. I have made a post somewhat similar to this before but I've since collected a lot more information about these topics and so I believe warrants yet another post.\n\n*Myth #1: Women weren't allowed to work.*\n\nMost documentation from the past heavily implies that people attempted to avoid working as much as possible. Even so, many women did work (mostly because they had no choice but to) and there has never been a law restricting women from working.\n\n\"Though creative research has produced evidence of women working at male-dominated occupations in the eighteenth century and before, there is undoubtedly more documentation out there, in newspapers, diaries, legal proceedings, and prints. What is more compelling is the lack of documentation that women were not allowed to work. Although religious practices and social norms might have restricted certain activities in some parts of the world, there were no laws prohibiting women from working a trade.\"\n\nAt the time, only members of a trade guild (associations of producers that trained craft people, maintained control over production, regulated competition and prices) were allowed to sell their goods or practice their skill within the city. Non-guild members were prohibited from selling competitive products. An aspiring master would have to pass through the career chain from apprentice to journeyman before they could be elected to become a master tradesman. They would then have to produce a sum of money and a masterpiece before they could actually join the guild. If the masterpiece was not accepted by the masters, they were not allowed to join the guild, possibly remaining a journeyman for the rest of their life.\n\nWomen were not barred from any of the trade guilds in Britain at least as far back as the 1400s. Apprentice forms for guildwork had spaces left blank to insert 'he' or 'she', though girls who chose this traditional route to mastery of a trade (which was extremely long and arduous) were usually orphaned and had low prospects for marriage, thus they were going to need to work.\n\nMarried women, though, had the privilege of circumventing the long, onerous, arduous process of trade certification as they could receive the master tradesman status from their husbands and thereby continue his work, even take on apprentices to train (which suggests that the social assumption was that wives would learn enough about their husband's business and trade to be able to at least continue to oversee it after he died). Lots of widows continued to run their husbands' businesses long after their death.\n\nThe Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\n\nA 1770 publication called *The Tradesman's True Guide or a Universal Directory for the Towns of Birmingham, Wolverhampton, Walsal, Dudley and the manufacturing village in the neighborhood of Birmingham* carried exhaustive lists of tradesmen and tradeswomen alphabetically by name and by trade, and there are women listed in every trade from butcher to wire drawer.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nReally, very little I've seen shows that women were maliciously \"kept out\" from trades or professions that they wanted to enter into. It may have been a social norm that most women did not seek out careers as they do now, but looking at the histories of the first women to enter into medicine, law, etc, show that they hardly faced any resistance in doing so.\n\nIn 1847, Elizabeth Blackwell became the first woman to attend medical school in the US and was the first woman on the Medical Register of the General Medical Council. She sent applications for admission to twelve of the most promising institutions in the northern states, and her application was accepted by the medical department of Geneva University. Feminist revisionist history \"explains\" that she was only admitted to the college by the evil men as a joke, but as will be amply demonstrated this is the opposite of what actually happened.\n\nIn fact, the student body sent her a letter to welcome her:\n\n>At a meeting of the entire medical class of Geneva Medical College, held this day, October 20, 1847, the following resolutions were unanimously adopted:–  \n>  \n>Resolved – That one of the radical principles of a Republican Government is the universal education of both sexes; that to every branch of scientific education the door should be open equally to all; that the application of Elizabeth Blackwell to become a member of our class meets our entire approbation; and in extending our unanimous invitation we pledge ourselves that no conduct of ours shall cause her to regret her attendance at this institution.  \n>  \n>2. Resolved – That a copy of these proceedings be signed by the chairman and transmitted to Elizabeth Blackwell.\n\nShe describes this letter as one of her most valued possessions, and in her autobiography she states that the men of the college supported her 100% and beyond.\n\n\"The behaviour of the medical class during the two years that I was with them was admirable. It was that of true Christian gentlemen. I learned later that some of them had been inclined to think my application for admission a hoax, perpetrated at their expense by a rival college. But when the *bona-fide* student actually appeared they gave her a manly welcome, and fulfilled to the letter the promise contained in their invitation.\"\n\nShe also notes that the general public also had a favourable view of a woman entering into medicine.\n\n\"The admission of a woman for the first time to a complete medical education and full equality in the privileges and the responsibilities of the profession produced a widespread effect in America. The public press very generally recorded the event, and expressed a favourable opinion of it. Even in Europe some notice of it was taken, and 'Punch' showed his cordial appreciation by his amusing but friendly verses.\"\n\n[http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III](http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III)\n\nThere are also other examples of women entering into \"male\" fields and encountering little resistance. There's the example of Arabella Mansfield, the first female lawyer in the United States. Although by Iowa law the bar exam was restricted to \"males over 21,\" Arabella Mansfield took the exam in 1869, passing it with high scores. Mansfield challenged the state law excluding her, and the Court ruled that women may not be denied the right to practice law in Iowa, admitting Mansfield to the bar.\n\nOr Ada Lovelace, who was encouraged in her mathematical ability from a young age by her parents and received the best of tutors to increase her ability. She worked with Charles Babbage on his Analytical Machine, though they both \"fell into historical obscurity, and the Analytical Engine was unknown to builders of electro-mechanical and electronic computing machines in the 1930s and 1940s when they began their work, resulting in the need to re-invent many of the architectural innovations Babbage had proposed.\"\n\nOr Amelia Earhart, who was flown \"like a sack of potatoes\" by pilot Wilmer Stultz across the Atlantic in her 1928 transatlantic flight, and immediately became a celebrity, wrote a book about the experience, was used to endorse products, and dubbed 'Lady Lindy'. There is a plaque that marks where the plane landed in Wales. All the fervour over it was solely because she was a woman who crossed the Atlantic regardless of the fact that she didn't do any flying at all in her 1928 flight (She did, however, go on to complete a transatlantic solo flight later on in 1932).\n\n[https://en.m.wikipedia.org/wiki/Amelia\\_Earhart](https://en.m.wikipedia.org/wiki/Amelia_Earhart)\n\nOr, for a very long-ago example of this, Murasaki Shikibu from Japan around the year 1000, who listened at the door while her brother received lessons in Chinese writing and through that learned it herself. She was far from reviled for being a woman who knew Chinese and was commissioned by the Empress to write the Tale of Genji, a classic work of Japanese literature often called the world's first novel.\n\nOh, the o p p r e s s i o n .\n\n*Myth #2: Marriage was an institution created by men to oppress women. Men were disproportionately given privilege and power and women were treated like his property in marriage.*\n\nAgain this is a bastardisation of the past. Feminism has to stop treating men as the enemy and as the source of all women's (and also men's) problems. They need to realise that things weren't always as they are now, and realise that it was not Patriarchy or men that restricted the choices of both genders and forced them into strictly defined roles, but that these roles came about because it was the best way of arranging societies in the past - a past that was much harsher and more unforgiving than it is now. A past in which there was more work to do than there were hours in a day. A past where men spent most of their short lives working like mules to support themselves and their families and women spent most of their short lives incapacitated by childbirth and child-rearing. A past in which we sent children into coal mines that ruined their lungs and into factories which lost them limbs. Things sucked, and the reason it was bearable at all back then was *because* of the gender roles.\n\nMen were not the ones who relegated women to the domestic sphere or kept them dependent on men. Biology did. A woman at that time could not simply strike out on her own and do whatever she wanted. For most of history we had no reliable birth control, no safe abortion, no maternity leave, or social security, and most public sphere work back then involved hard labour. And if you were a woman back then who wanted to be able to have sex, then you would have had to plan your life around the idea that you would be getting pregnant, giving birth, and breastfeeding for most of your adult life - and that would have meant you could not be a reliable enough worker to support even yourself, let alone a child, and it would inherently have made you dependent on other people to help you. Until the last 100 years or so, most women could not have lived a life of children and public sphere work, independent of a man (and not all can today, realistically).\n\nEven with support, most women in poor and middle class families had to work because that was the only way to make enough money to live.\n\nSo in a time when single motherhood was a one-way trip to the gutter, marriage was a practical arrangement. The function of marriage was not to oppress women, but to positively assign paternity inasmuch as possible, and then obligate the men so assigned to their children and the mothers of their children. For life.\n\nThe taboo on sex outside of marriage (which was applied to men no less than women) made it difficult for an unscrupulous man to cheat the system. These rules surrounding marriage also mitigated the problem of paternity uncertainty, which maximised men's willingness to invest in their kids. \"I know these are my kids, so I will work hard to feed and shelter them.\" And the reason why we kept lifelong monogamous marriage for so long is because it increased the resources which would have been available to offspring, providing a healthier environment for children to grow up in.\n\nSo when a man married a woman, he was legally obligated to feed, clothe and shelter her and any children produced in the marriage to the best of his ability. Unlike what feminists seem to think, he could not sell her. He could not return her for his money back. He could not drop her at the local midden heap. He could not destroy her the way he could his actual chattels. He could not trade her for a better one. He could not legally neglect her.\n\nJust to make things crystal clear, here is a summary list of entitlements that women enjoyed in marriage (and after marriage) during the old \"patriarchal\" system of the past.\n\n1. When a woman married, she had to hand over her property to her husband's care (again, NOT because she herself was property, but because he was administrator of the family), but he OWED her not just a living, but the best living he was financially capable of providing for her. A wife was entitled to be maintained by her husband.\n2. Though women did not have the right to enter into contracts in their own name in marriage, women had the privilege of the Law of Agency, giving them the legal right to purchase goods on their husbands' credit as their agent. If the wife racked up debts that the husband couldn't pay, she was immune from liability for the debts she racked up - that liability fell to the husband instead.\n3. Women had the entitlement of being protected from prosecution for any number of crimes if they could prove their husbands were aware of said crimes. In which case, he would be prosecuted in her stead--not just held AS responsible as she was, but held solely responsible for her actions. This allowed married women to displace accountability for a large number of offences onto their husbands. \"She's out of control and does what she wants, regardless of my wishes,\" was not a valid legal defence for those men.\n4. Women were exempt from paying taxes, and there was an entire female underground economy of barter and trade that was not subject to taxation or government interference. Even when married women gained the right to hold property within marriage, it was their husbands who were responsible for the taxes owing on it, and it was their husbands who were held 100% financially liable for providing all necessaries to the family, including the wife, even if she made more money than he did.\n5. After divorce, men were held fully financially responsible under the law for the ex-wife and kids. Divorced women were entitled to be supported by their ex-husbands to a level commensurate with the husband's for potentially the rest of their lives unless she remarried.\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nThat doesn't sound at all like women were treated like property to me.\n\nI'm sorry, but if I have property, I have no legal duty of care toward the actual property I own, nor any obligation to commit to own it until death. I can smash my property on the ground and treat it however I want and it would be my right to do so. Men could not do any of that to the women they were married to. They had obligations towards them to provide for them - even after divorce, and to protect them - even from the consequences of their own actions. Wives had no such obligation towards their husbands - they were entitled to be the ones who were supported. Because the purpose of marriage in the past was not to oppress women and make them the property of men, but to ensure that women and their children could be provided for and protected, and to place the responsibility for that provision and protection on the man even at cost to his own wellbeing, health, and even life. This has been the case since time immemorial.\n\n\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"\n\nEphesians 5.\n\n[https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV](https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV)\n\nIn fact, many of the supposed \"privileges\" men had in marriage in the past were to help them carry out their obligations and to prevent them from becoming wholly onerous.\n\nIf a man had an obligation to be accountable for provision for his wife and children and to maintain family finances, it stood to reason that he also should have the entitlement of having control over any assets of his marriage, including those his wife brought into the marriage, because he was the one who had a responsibility to keep the entire family afloat and to increase their holdings.\n\nIf a man was responsible for the protection of his wife and children to the point where he could be legally required to stand between his wife and the law within numerous contexts, and be punished in her stead (whether she contracted debts he couldn't pay or committed a crime he would have to answer for), it makes sense why he would be considered head of household and why his family would need to obey him as well as abide by the restrictions he placed on them.\n\nIf, upon divorce, a man would be held solely responsible for the maintenance of his wife and child, it makes sense why he would get custody of the child that he was supporting, as well as ownership of assets so he could satisfy that obligation.\n\nWe gave men these rights and privileges because they were the tools that he needed to satisfy his responsibilities. And in that way there was a balance. \"Women \"got less\" because their obligations and accountability were less, their responsibility was less. Men \"got more\" because the buck stopped with them, whether that buck consisted of a sack of coins or his blood.\"\n\n*Myth #3: Men were allowed to beat their wives with impunity.*\n\nIn the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\n*Myth #4: Husbands were owed sex with their wives. Marital rape was not illegal, and marriage as an institution was based around rape of women.*\n\nThe idea at the time was that there could not be such a thing as marital rape because as a married person you are owed sex from your spouse, i.e. conjugal rights. This applied to both men and women. People who believe that conjugal rights \"allowed husbands to rape wives\" and not the other way around haven't actually done any research.\n\nIt was based on the idea that **both parties** had a right to sex in the relationship, and this was exercisable in law by each partner in a marriage.\n\nThe Bible said:\n\n\"*It is* good for a man not to touch a woman. **2** Nevertheless, because of sexual immorality, let each man have his own wife, and let each woman have her own husband. **3** Let the husband render to his wife the affection due her, and likewise also the wife to her husband. **4** The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.* **5** Do not deprive one another except with consent for a time, that you may give yourselves to fasting and prayer; and come together again so that Satan does not tempt you because of your lack of self-control.\"\n\n[https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV](https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV)\n\nDo note the specific passage where it says \"The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.\"*\n\nAnd here's a quote from an article detailing the history of sex and marriage.\n\n\"A hundred years ago or so, if you took the statute books literally, the only people entitled to have sex with each other were people who were legally married. All other sex was against the law. Fornication (sex with unmarried people) was illegal; so was adultery (sex with a married person—but not the person you yourself were married to). Cohabitation—living with someone in a sexual relationship—was against the law, except for people who were legally married. Enforcement was, shall we say, something less than perfect. At times, it was almost nonexistent. And the rules were riddled with exceptions. Sodomy, on the other hand, was quite a serious crime; and the full weight of the law sometimes came down heavily on people who had gay or lesbian sex.\"\n\n\"Married people were not only *entitled* to have sex; they were, in a way, *required* to have sex. Of course, nobody checked on whether John and Mary were having sex every night, or once a week, or once a month, or never. But if either John or Mary did not perform at all, for whatever reason, the frustrated partner had grounds for divorce; or even perhaps an annulment.\n\n[https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking](https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking)\n\nHusbands faced divorce if they were impotent and unable to consummate the marriage, though charges were usually made years after the wedding day. There was a similar charge of frigidity for wives, but it seems that wives charging their husbands for impotency was far more common. Husbands had to show an erection to a court audience and sometimes attempt to perform sex with their wives as well.\n\n[Source 1](http://www.bu.edu/law/journals-archive/bulr/volume89n5/documents/HOFFMAN.pdf) [Source 2](https://www.theparisreview.org/blog/2016/05/18/the-hard-on-on-trial/)\n\nBeing incapable of performing sex for your wife could merit corporal punishment. One medieval husband wrote about his unhappy marriage and his impotence in a book called The Lamentations of Little Matheus.\n\n\"My wife wants it, but I can’t. She petitions for her right. I say no. I just can’t pay.\"\n\n\"Even given his sexual incapacity, Matheolus was subject to corporal punishment:\n\n\"Acting as her own advocate, Petra {Matheolus’s wife} puts forward the law that if a shriveled purse {scrotum} can’t pay because it’s empty, under statute recompense for that injury is corporal punishment.\"\n\n[https://www.purplemotes.net/2015/05/03/matheolus-church-wife/](https://www.purplemotes.net/2015/05/03/matheolus-church-wife/)\n\nSo what does this show? It shows that both parties had an obligation to provide the other partner with sex during the marriage, and could not deprive their spouse of it. If it was an issue, it was not an issue that solely affected women.\n\n*Myth #5: \"Men had the vote and women did not. Women's suffrage was a matter of women as a united group fighting for their rights against the evil men that kept it from them. Suffragettes were champions of equality who got women the vote. Etc, etc.\"*\n\nReally, I'm very tired of hearing this one.\n\nIn Britain, the right to vote was not only restricted by gender, but also by class. Property owners had the vote, the vast majority of men did not. In 1830, just 3% of the population had the right to vote.\n\nDuring this time, there were a few groups who were fighting for the vote to be extended to them, and one of these groups were the Chartists, who were active from 1830 to 1868. They were fighting for broad electoral reforms including:\n\n* a vote for all men (over 21)\n* the secret ballot\n* no property qualification to become an MP\n* payment for MPs\n* electoral districts of equal size\n* annual elections for Parliament.\n\nThey presented three huge demonstrations to Parliament, and their requests were denied every time. The restrictions were relaxed but not abolished. Benjamin Disraeli said when introducing the Second Reform Act of 1867: \"We do not live – and I trust it will never be the fate of this country to live – under a democracy. The propositions which I am going to make tonight certainly have no tendency in that direction.\"\n\nThere were also the suffragists and the suffragettes, who were fighting for the vote to be extended to women. Suffragists emerged in the mid-19th century and believed in peaceful, constitutional campaign methods. In the early 20th century, after the suffragists failed to make significant progress, a new generation of activists emerged. These women became known as the suffragettes, and they were willing to take direct, militant action for the cause.\n\nHowever, a huge amount of women disagreed with women's suffrage. So many women objected to the franchise being imposed on them that in the mere 18 months leading up to a 1910 parliamentary debate on women's suffrage, anti-suffragettes had managed to collect 300,000 signatures from women who objected to the franchise being imposed on them. Meanwhile, in the 16 years leading up to that debate, suffragettes only managed to collect 193,000 signatures of women who wanted the vote.\n\nA segment from the transcript of the debate:\n\n\"Still, for what it is worth, one finds that from 1890–1906 only 193,000 women signed Petitions to this House in favour of female suffrage, and that during the last eighteen months, a period in which a strong anti-suffrage association has been in existence, 300,000 women, some of them eminent women, have signed petitions against it, and to the effect that these proposals shall not be forced upon them.\"\n\nAnd...\n\n\"A rather interesting illustration was furnished by an inquiry which was instituted by \"The Sheffield Independent,\" a newspaper which I think itself is sympathetic with these proposals. This inquiry was addressed to the women householders of Sheffield. Twenty-three thousand papers were sent out, and of the replies 9,000 were in favour of woman suffrage and 14,000 were against it. The representatives of this paper reported that in many cases their emissaries were chased with violence from the houses by the female inhabitants under the impression that they were collecting statistical matter as the emissaries of the suffragist party.\"\n\nIt may be difficult to understand why so many women would reject the vote so vehemently, but this was an era where full citizenship rights like the right to vote were granted only to those with citizenship responsibilities like conscription (and sometimes not even then). In that historical context, the vote was actually viewed not just as a right, but also an obligation. So it was never really about men in power shutting women out of the franchise. It was about government having to decide whether to impose a responsibility on women that women as a whole *clearly did not want.*\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\nRegardless of the lack of support for women's suffrage among women, suffragettes became extremely militant in their activism. In 1903 Emmeline Pankhurst founded the Women's Social and Political Union (WSPU) with her daughters Christabel and Sylvia, and the WSPU carried out a nationwide bombing and arson campaign. Between 1912 and 1915, hundreds of bombs were left on trains, in theatres, post offices, churches, even outside the Bank of England; while arson attacks on timber yards, railway stations and private houses inflicted an untold amount of damage.\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nInstead of being beneficial in supporting the vote for women, it was disastrous. Lloyd George said: \"The action of the militants is ruinous. The feeling amongst the sympathisers of the cause in the House is one of panic. I am frankly not very hopeful of success if these tactics are persisted in.\"\n\nTerrorism aside, Emmeline Pankhurst was also resistant to acquiring the vote for working class men, realising that this would be much tougher than winning the vote for \"respectable\" AKA upper-class women, and underlying the resistance appears to have been her contempt for working-class men. According to Sean Lang in his book on Parliamentary reform: \"The Pankhursts became stridently anti-male, ruthlessly dropping even the most loyal of their male supporters from the WSPU, and claiming, as Christabel did in her 1913 book *The Great Scourge*, that men were “little more than carriers of venereal disease”.\"\n\n[https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/](https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/)\n\nWhen WW1 came around in 1914, suffragettes also threw their support behind the White Feather campaign with the aim of shaming men into enlisting. Those young women went in for the kill, striking men at the very heart of their masculine identities, the bestowing of a feather telling them, \"If you don't go off to be maimed or die, you are no longer a man in the eyes of some brassy chit you've never even met before and will probably never see again.\" And many men went, because a woman's censure - ANY woman's censure - had the power to drive them straight into the teeth of death.\n\nBy mid 1915, it was clear that not enough men were signing up to replace the fatalities on the front line, and the Military Service Act was introduced in January 1916. By March 1916 compulsory conscription for all single men aged 18-41 was in place. In May 1916, the Act was extended to include conscription for married men.\n\n[http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html](http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html)\n\nIt was only at that point that the British government considered extending the vote to all men, as most of the propertyless, working class men that were conscripted into war during WW1 did not have the right to vote, and this was finally starting to be seen as the injustice that it was. In the trenches class divisions were eroded to the extent that class no longer had any real meaning and every man was the equal of each other in terms of sacrifice and service to one's country.\n\nMen got universal suffrage in 1918 with the Representation of the People Act, which enfranchised more than five million men over the age of 21 without regard to property or class. Women of all classes were piggybacked onto the Act, with an age restriction temporarily in place to prevent women from becoming a supermajority voting bloc, given that about 1 million British men had died in the war. Regardless, this brought more than eight million women over 30 into the electorate. And just ten years later, the 1928 Act (the act which gave women electoral equality) gave the vote to women at age 21, which added another five million women to the electorate.\n\n[https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/](https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/)\n\nIntroducing the 1918 Bill, the Home Secretary George Cave said: \"War by all classes of our countrymen has brought us nearer together, has opened men's eyes, and removed misunderstandings on all sides. It has made it, I think, impossible that ever again, at all events in the lifetime of the present generation, there should be a revival of the old class feeling which was responsible for so much, and, among other things, for the exclusion for a period, of so many of our population from the class of electors. I think I need say no more to justify this extension of the franchise.\"\n\nThe Act was achieved not by the suffragettes’ terrorist tactics, but by fighting of men in WW1, when thousands of men from their many different backgrounds came together to fight the common enemy. This finally achieved what the Chartists, the Levellers and the peasants before them had struggled for in terms of eroding barriers of class. Without the sacrifice of men who endured the horror of trench warfare in WW1, class barriers would have persisted and at most the vote would have been extended only to elite, wealthy, propertied women.\n\nIn a later study of attitudes to conscription in 1939, one woman responded: \"In the last war \\[(WW1)\\] I never told one man that he ought to go. I tried to put myself in their place. If I’d been them I wouldn’t have gone. When I saw them going through the streets – all the young men – I used to think that they were being driven like cattle to the slaughter house. And they were, weren’t they? Fodder for the guns.\"\n\nThe common idea that all men had the vote, and that women did not, and that women's suffrage was a fight of women who were united against men working as an oppressive force to keep them down is an affront to these men who died in a literal war that secured universal suffrage for everyone (many of which, in fact, did not have the vote). It also ignores and erases the will and sentiment of many, many, *many* anti-suffragette women who actively rejected the vote and protested vehemently against it being imposed on them.\n\nFurthermore, the view that suffragettes were a valiant, fair-minded, equality-oriented group who got women the vote and whose activism merely amounted to firecrackers in barrels is an affront to any right-thinking person. The real violence and extremism of the suffragettes is barely, if at all, recognised by the general public, and this is partly due to attempts by suffragettes to sanitise their history.\n\n\"Laura E. Nym Mayhall, in her work on the militant suffrage movement, identified the importance of \"a small group of former suffragettes\" in the 1920s and 1930s, who created a highly stylised story of the WSPU and the history of suffrage in England, which emphasised \"women’s martyrdom and passivity\". The group set about compiling the documents, memoirs and memorabilia that now form the basis of the Suffragette Fellowship Collection held by the Museum of London.\"\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nAnd here we are now, in crazy world. According to the dominant narrative, all men always had the vote since the dawn of recorded human history, and they refused to give it to women because penis. The demonstrations of the Chartists, and the dead bodies of these men that were sacrificed to the unpopular idea of male suffrage (and who got votes for women in the process), have gone down the memory hole. The terroristic actions of the suffragettes, engaged in for the benefit of wealthy and privileged women only and for which they were barely punished, are the noblest of acts for the noblest of causes. And of course, the only reason anyone could EVER have opposed them was because of misogyny.\n\nedit: wording\n\nedit 2: Added some extracts from [w1g2's comment](https://www.reddit.com/r/MensRights/comments/edyrf5/a_compilation_of_evidence_debunking_feminist/fbtays6?utm_source=share&utm_medium=web2x).",
    "title": "A compilation of evidence debunking feminist historical revisionism.",
    "subreddit": "MensRights",
    "timestamp": 1576979536,
    "score": 341,
    "keyword": "japanese manager"
  }
]