[
  {
    "text": "How to complain against boss in small company So I am the lead of the R&D team in a company of 25. I report directly to the second-in-line of the company, whose official title is “Director of Development”. \n\nMy boss is an extreme narcissist who micromanages, doesn’t listen when we say something can’t work and isn’t worth the effort (both true, every time), disrespects everyone, devalues everyone with sly comments, threatens to nullify bonuses etc. \n\nWith only the CEO above him in a small company, I see it as risky to go directly to the CEO, because I feel my boss will somehow lie his way out of my complaints, as he always does. I have a few recorded videos of him straight up leaving calls while people are trying to talk to him, examples of his devaluing comments, and lying that he made decisions that caused everything to break. The worst one shows him being incredibly insensitive (joking) about how my cat got killed by coyotes the day beforehand. \n\nI got a written performance warning from him yesterday. My team and I know that it’s because of his managing.  If I file an complaint, he will definitely put our missed goals against me. The team (whom have been with the company for 4 years, me 7 months) will probably not join the complaint because their culture (Japanese under an American boss) unfortunately is submissive. \n\nMy question is: what should I expect if I file an complaint and speak to the CEO? Should I even do it? My boss is extremely good at sliding by tough situations with his charm. Options are to just bear with him and continue looking for a job, or complain about my boss and start massive turmoil within the company I love. Both options are very stressful, consequences imposed on my fellow coworkers, and involve feelings of loss.\n\nI love this company and the opportunity I’ve been given to make an product that will make an difference in the real world. I don’t want to lose that, but the absurdity of my boss is just too much to bear. Yes, I have had conversations with him regarding his actions, and he does not take responsibility or take steps to change his behavior.\n\nRegardless, I’m grinding leet code and getting ready for interviews, because I legitimately can’t work under this guy.\n\nI guess this turned into more of an venting post…\n\nEdit: CEO is HR btw",
    "title": "How to complain against boss in small company",
    "subreddit": "cscareerquestions",
    "timestamp": 1634418659,
    "score": 0,
    "keyword": "japanese director"
  },
  {
    "text": "Gah that American \"math\" team post on the front page really bothered me. I get it, it's a casual joke. Asians tend to dominate math competitions. But more importantly, the sense that even though you're winning a competition for America and are American through and through, you're still a foreigner in your own country.\n\nIt used to drive me insane when people asked me \"where are you really from\". I'd want to reply well started in Alabama, moved to Chicago when I was still young before school, and now I work in New York. I would carry my passports out in airports like a badge of honor so people would know I'm \"american\". \n\nAnd it took me decades to unfurl the toxic defense mechanisms I spent my life throwing up. Growing up, I vehemently rejected Asian culture. I hated my name so I changed it legally. I beat the shit out of my body playing lacrosse at a high level because it was the whitest sport (all conference and even then I was known in the conference as the \"asian kid\" or the \"chinky boy with skills\"). I attended a fucking US military academy for a year instead of a top 5 school initially because I wanted to show the world how American I was. \n\nIt took me until 25 and working in Asia on projects for half the year to finally get it. To finally be in a place where the assumption isn't I'm a math guru or code monkey. Where my managing directors don't assume I'm a work horse and nothing more. Where instead of preparing the deck for sales meetings, I got to actual drive the meetings and lead. But more importantly, as I matured, I understood so much more about myself and why I am the way I am.\n\nI never realized how much growing up in the midwest as one of the only Asians in my school would impact my sense of self. My obsession with fitting in and being \"american\" led me to completely reject so much of what makes me well, me. \n\nThis current movement of Asians standing up for themselves and doing it together makes me so fucking proud. I now realize my history and culture isn't just that of China but it's about the workers brought here to build the railroads. The asian communities that popped up early on that suffered untold racism and abuse. The Chinese exclusion act and the Japanese internment camps are some of the most atrocious decisions by my country. But I'm so fucking proud to be part of that history. To know that the strength to endure untold hardship and sacrifice for the future generations flows through me and is part of my history and culture means everything. So thank you to all the activists and people stronger than me who push the narrative. You guys have made me so proud to be Asian American and my children will love and embrace their culture and heritage in a way I never allowed myself to. So thank you.",
    "title": "Gah that American \"math\" team post on the front page really bothered me.",
    "subreddit": "asianamerican",
    "timestamp": 1621955598,
    "score": 116,
    "keyword": "japanese director"
  }
]