[
  {
    "text": "CVS Interview, What just happened? About a week ago, my wife got a phone call from a very enthusiastic manager at CVS to interview as a pharmacist. She told her all these great goodies about the job and how she loves to work with new Graduates and her excitement over my wife's experiences. She said she is especially happy wifey has an RN degree too. She stated she is excited to see her and the interview will be more or less to determine if my wife is willing to hit the ground rolling aka (more of a formality).\n\n&nbsp;\n\nA few days later the district manager calls my wife apologizing about how enthusiastic the manager was stating that she skipped the normal interview process by calling her first, that he has to call and do a pre-interview and then assign her to a manager/region but she jumped the gun; so he has a lengthy interview with her and he is happy to go ahead with the onsite, saying in his career he has had only 10 candidates out of hundreds that had her dual degree. \n\n&nbsp;\n\nToday she went in for the interview, the manager sees my wife and my wife says her whole body language changed, warmness and excitement went out the window, just cold stoic conversations. The manager said she wanted someone with nursing experience, not someone who just went straight from nursing to college (?), the wife said she has over 4 years of working in various departments (per her resume). \nThe interviewer then said she is looking for specific skills (no elaboration), the wife said she has the basics related to the position from her rotations, and that the interviewer had been previously expressed preference of her being a new grad.\n\n&nbsp;\n\nThe interviewer then went on to give her potential negatives on how involving the position is (things she knows) suggesting it might not be something she might want. The wife replied that she's more than up for it. \n\nThe interview ended with \"we will see if we want you for another onsite interview\". \n\n&nbsp;\n\nWhat hurt me the most is when my wife called me really depressed and almost in tears asking me if this went sideways because she was black? Her name sounds Japanese (we are African) and most time people are surprised that the name and voice do not match perceived appearance. \n\n&nbsp;\n\nI refuse to believe that this is a reason, I just need help wrapping my head around all this. How did things go so sideways? I always tell my wife to add these people on LinkedIn so that there are no surprises. This is just gut wrenching sad. \n\n&nbsp;\n\n**TLDR:** Warm exciting phone interview goes cold on meeting my wife in person.",
    "title": "CVS Interview, What just happened?",
    "subreddit": "jobs",
    "timestamp": 1491334385,
    "score": 9,
    "keyword": "japanese manager"
  },
  {
    "text": "I HATE MY JOB SO MUCH AND NEED SOME HELP ASAP okay. so. back story. i have 2 jobs. i'm 18 and seriously just trying to make a ton of money before i go to college. anyway. i work part time at a japanese place and part time at a pizza place. i have worked the pizza place for almost 8 months and honestly don't hate it. the people are fine, the work isn't terrible, and i know what i'm doing and am used to it. now the japanese job i have had for like 48 hours and I HATE IT. for starters, most people there speak japanese and i do not. i am completely fine with this bc i can learn some stuff and obviously i am not chatting a ton with people bc we are all mainly working. my manager, however is very back and forth between being strict and bossy to being relaxed and VERY chill. she emailed me about 24 hours after being hired demanding i memorize the menu before my shift that night. I am okay with the memorization, i am just very alarmed at the fact that I am being expected to memorize the entire menu and the way the restraraunt functions so quickly.The pizza place is very busy and very fast paced, but the japanese place really isn't. we get about 15 customers in a course of 2 hours so....not very busy.  that's why i'm so confused why i am expected to learn SO quickly. for me i learn through experience and learning super fast in one day is not going to work. i feel awkward, and uncomfortable in the shop and honestly and just so lost. i get that may be a \"first day\" thing but i have had many other jobs and this type of awkwardness is very different that the usual first day confusion. idk what to do and i'm just soooo conflicted about whether i should stick with it till i get the flow of things or just find a job where i get better vibes. i do not want to work in this field of jobs forever and am only doing this to get money so i'm not really trying to better my knowledge about the food industry or anything. idk. i just need help.",
    "title": "I HATE MY JOB SO MUCH AND NEED SOME HELP ASAP",
    "subreddit": "jobs",
    "timestamp": 1505496192,
    "score": 3,
    "keyword": "japanese manager"
  },
  {
    "text": "[F27, UK] Wannabe journalist. Disabled, highly qualified, can't drive. No career progression opportunities. Where should I go? I work as an administrator for a national charity in the UK and, since applying for a part time job to support my MA (Japanese), I have remained in the same 18 hour job as I have been for the past 3 years.  I am paid the UK 'living' (a.k.a. minimum) wage of £7.50 per hour, meaning I live off around £7,000 per year and the occasional food bank during Christmas. I have qualifications outside of my MA and 8 years of positive working experience, with some really good references from organisations I previously volunteered/worked for.\n\nI fulfill my duties every day on shift promptly and to a high standard.  I also try and create jobs for myself while I am working. Nevertheless, I am also very skilled copywriter, and although that's not my job (I am just an Admin Assistant on paper)  I get frequently approached by the PR managers and journalistic types in work on how to do jobs, which is something I am happy to do, and I get a lot of positive comments about my work.  Never have I turned one down as that's ultimately what I would love to be - a journalist.  And I am great at that - I have wrote plenty of articles for our website that have generated 12 times more positive hits than our usual articles.\n\nI know it's ridiculously competitive; that's why I have done a plethora of courses both inside and out of work to try and refine my skills. That's not what scares me.  What I find frustrating is how when I try and apply for opportunities within and outside of work to progress (or even create my own opportunities), I get told that my career choice is 'unrealistic' because my disabilities would 'limit' me greatly.\n\nThe context, I guess, is this:  I have a disorder which impairs my peripheral vision, meaning I can't track travelling items or judge their speed.  I have tried driving lessons before and although I know perfectly well how to get a car running, I cannot track other people's behaviour well because of it.  I am also a lady with Asperger's Syndrome and, although my work would never know this one, I also have PTSD. Neither of these two stop me from doing my job in the slightest, but I have been subject to discussions where people say 'because you have Asperger's, you don't understand'.  \n\nIt's frustrating! Argh. Furthermore, any attempt to suggest avenues for further training typically gets turned down because 'it's not relevant' to my job. \n\nI would understand if I were a bad employee, but the reality is, I am not when I think about it.  I volunteer my time constantly, I take on new challenges.  A bit like that person you know in work who just cannot say \"no\".  I have been told by these same people that I am an 'ideal employee', yet...\n\nI know it's time to leave. I don't feel valued and I know they either cannot or will not allow me to develop into a positive role for them, which is a shame because I know I would be useful.  My question is, where to?  What kind of jobs in journalism (or fields related to journalism) would even consider hiring someone outside the capital who cannot drive? \n\nDoes anyone out there have any connections, ideas or suggestions?  Even some constructive criticism?  I know that at times I can miss the bigger picture, so if anyone out there can give me any kind of clue, even if you think it's harsh, please tell me!",
    "title": "[F27, UK] Wannabe journalist. Disabled, highly qualified, can't drive. No career progression opportunities. Where should I go?",
    "subreddit": "jobs",
    "timestamp": 1499201004,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Careers in Tech for Former Teachers I'm pretty desperate and I'm embarrassed by my lack of experience both within the field of education and outside of it. I've only been a teacher for about a year. I started in one school district that was a mess. Then I moved to a new district which has treated me extremely welldread but I'm still stressed out of my mind. I've pulled about 8 all nighters this past month and I've just overall been exhausted, unfocused, unmotivated, and discouraged by the profession. I had a passion for education but I'm finding more and more that it's not quite the right fit for me. I enjoy working with individual students even if they're struggling but I cannot manage a classroom or deal with non-stop requests from well meaning teachers, administrators, and parents requesting that I take on all these additional responsibilities when I already feel so overwhelemed.\n\nI found that one part of teaching I really do enjoy is finding new tech tools and designing class websites, etc. to create unique learning experiences that allow for self-paced learning. I have some elementary programming experience with android programming, html, css, pho, and mysql but it's truly elementary. That being said I would love to learn but I'm just so consumed with teaching even when school doors are closed, that I can barely find time to further develop my knowledge.\n\nIdeally I'd love to work in edtech, but really any tech/IT related field would suit me for the time being as I'm desperate to make a career change for my mental health.\n\nAnd if anyone knows of any other jobs that accept former teachers with limited job experience please let me know. I'm looking for full time work with a comparable salary and Healthcare coverage.\n\nI'm flexible and willing to learn in order to meet the needs of your organization. I also have some Spanish and Japanese language experience if that would be useful.",
    "title": "Careers in Tech for Former Teachers",
    "subreddit": "jobs",
    "timestamp": 1490050693,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Not getting any results with work search after grad school. I'm feeling way behind the people I graduated with and generally undesirable. I finished grad school in December of 2012 and I managed to work at some ESL schools near where I went to school, but they were always part time, so I would look for other work but I was only able to get work at another school. I was only let go from my last 3 jobs because of low enrollment and lack of experience (they cut from the bottom and it's always been me). \n\nMy wife had a baby right before I left my last job in February 2015 and she wanted to take on more work for herself instead of me applying for jobs that wouldn't work out, so I was stay at home parent until my son was old enough to go to childcare at 18 months old last May (this gap was 13 months).\n\nI did try to apply for overseas positions, but I never got any replies. I applied for a veterans' work therapy program that started when my son started school in May 2016, but it was conditional that I continue to apply for other work outside of the program. I got an ESL teacher job on short notice and left my job working for the VA medical center doing custodial work in July 2016. I was there from July 2016 to the middle of October when student enrollment dropped off sharply and I was let go again for lack of experience.\n\nI've been applying for work through Craigslist and ESL job sites, but I got an interview with an English school company in Japan and a Nonprofit canvassing job in the SF Bay Area. The Japanese school turned me down and the Nonprofit had donation quotas I could never hope to achieve. I'm running short on money and I need help getting a job, but I feel like the people that look at my resume either despise me or completely ignore my applications. I have trouble keeping a positive attitude in interviews and my family have been making me feel worthless about the whole situation. I wanted to work abroad straight out of grad school, but I got married before I could make it happen. Now I spend my time alone searching for work and I have a subscription to Flexjobs of $50 for the year.\n\nMy students, colleagues, and administrators all said that I was a good teacher at every teaching job, but I can't get work in the field I prepared for and I just don't feel really great about myself.\n\n[Link to a post with my resume information](https://www.reddit.com/r/resumes/comments/5ooi1b/teaching_esl_im_not_getting_offers_for_anything/)",
    "title": "Not getting any results with work search after grad school. I'm feeling way behind the people I graduated with and generally undesirable.",
    "subreddit": "jobs",
    "timestamp": 1484735453,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Why do most Japanese firms have long work hours? Massive work loads? What if there's no work left for the day? Is it valid grounds for negative review by the manager and HR (and subsequently, can get fired) if one leaves earlier than the boss?",
    "title": "Why do most Japanese firms have long work hours? Massive work loads? What if there's no work left for the day? Is it valid grounds for negative review by the manager and HR (and subsequently, can get fired) if one leaves earlier than the boss?",
    "subreddit": "AskReddit",
    "timestamp": 1511931825,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Would anyone be willing to share their experience with an ARL program, especially in utah? Hi! I am from Utah, but I have worked in Japan the last 6 years (not teaching English) in Japan. Japan has been a good run for me but now I want to take my family and go back to Utah for a number of reasons. (Lower stress environment, better hours, but also I really love teaching.)\n\nMy father is a high school science teacher so I have always loved science and I have always kept myself very knowledgeable in science because I love it. But I don't have a degree in science nor do I have a teaching certificate. (My degree was Japanese Lang/Lit and Asian Studies)\n\nI am posting this here because I would really appreciate any information and experiences from anyone who has participated in an ARL (Alternative Routes to Licensure) program, especially in Utah.\n\nI especially think I am suited to be an earth sciences teacher and I am currently studying for the appropriate PRAXIS tests which I think I can easily pass after a few months of study.\nI could also easily teach a Japanese class, but I think there is no demand for that, and I would be much more excited about teaching Earth science anyway.\n\nUtah has a huge shortage of teachers, especially science teachers, so (as I gather) if you can get a good enough score on applicable PRAXIS tests you can get in an ARL program and become a teacher even if you don't have an applicable degree or teaching certificate.\n\nObviously living in Japan means I can't just walk on over to the BOA and get information easily. So I am trying to get as much information as I can now as I move forward trying to determine how and if I can manage this transition.\n\nLuckily, I can take PRAXIS tests here in Japan, so I am currently studying for those and hope to take one or two  before the end of the year as a sort of self-evaluation.\n\nI would be so greatful if someone out there who has gone through this sort of process would be willing to share their experiences with me.\n\nI am getting some information from my dad (who is a very successful chemistry teacher), but he mostly just says stuff like, \"I am *sure* you could do it. You are better than that bozo they hired last year. or \"You are so well suited to it.\" etc. But I really am having a hard time getting a good picture of how the overall flow of the system works, etc. The timeline of the whole process, when pay starts, how much support/training is offered, etc.\n\nThank you.",
    "title": "Would anyone be willing to share their experience with an ARL program, especially in utah?",
    "subreddit": "Teachers",
    "timestamp": 1498865556,
    "score": 5,
    "keyword": "japanese manager"
  },
  {
    "text": "Not sure how to feel about coworkers talking in another language to the extent that it feels exclusionary. Can someone please help me understand if I am in the wrong? Hello,\nI work in a Japanese-American Company. I work with 5 other people in the same office. All of us are in the same department in an open-office environment. The assistant manager and two of the other purchasing agents speak Japanese (one from the US and one from Japan). Conversations in Japanese are very common. Until recently, the last few weeks, it has never bothered me. I have worked here for almost a year now. One of the agents and the assistant manager have been having conversations in Japanese throughout the entire day lately, and I have been finding it more and more exclusionary. I understand wanting to talk in your native language because I can speak French, but I prefer English given the choice. However, both of them have lived in the US for 20 years and are nearly as fluent in English as I am. The worst part of this is I can’t pinpoint why this has been bothering me. They have had conversations in Japanese the entire time I have worked here. A lot of their conversations in Japanese are about issues our department/company is facing, and because they don’t have these conversations in English anymore, I know far less about what is going on than I used to. I know that their conversations dip into their personal lives, and I am actually okay with this part. However, I have noticed a growing rift between the US workers who only speak English (excluding me) and the 2 Japanese employees. They have gotten to where they barely ever talk to each other, and they don’t really respect each other. The Manager of our department being one of those English speakers has made this situation even more annoying. Also, I think it has been bothering me because my own workload has been steadily increasing as theirs seems to be decreasing, according to how much they talk and not work (note:  they also pass a lot of their work to me). I mean these conversations have lasted all day (while they were in the office), and they don’t really do anything else while they talked.\nAlso, I want to show that I am not just bothered by the use of foreign languages. I have friends from several different nations, and when we get together, we talk in several different languages together.  Most of these friends speak languages I do not know, and it is fine.  For example, we’ll be having a conversation and someone will say something in Arabic, then someone will kind of explain to the non-Arabic speakers what was said if anyone seems curious. Another example, a group of Spanish and English spearkers, and French and English speakers talking in all three languages together. The Spanish and the French can be loosely understood by both groups due to similarities, so English is used when people are unsure of the exact translation or when someone wants to be sure everyone understands what they say. Two of my friends may say something to each other in their mutual language and not explain it to the group because it was an obvious aside and not really important to the whole group. Or even a work example, our department is all talking together, and there will be both Japanese and English in the conversation but everything is being explained to everyone involved. These are the sorts of situations I am used to, and I have no problems with them because everything is out in the open if need be. There may be languages being used that don’t get explained, but it isn’t something that is important. \nSo, their conversations have been distracting for a multitude of reasons, and I am not certain how I feel or how I should feel. I want to work for the UN one day, so I feel like I should learn how to just be okay with this. I also see the real affect it is having on our department. There is also the point that they are spending more and more time at work not working (and they have very important jobs). I can’t tell if I am being petty for wanting them to stop talking in Japanese as much, or if I am in the right to think that they need to work harder to try to communicate in English more often. I also can’t tell if I am just being spiteful because of the increased workload for me from doing their stuff for them. Can anyone offer any advice for this situation?",
    "title": "Not sure how to feel about coworkers talking in another language to the extent that it feels exclusionary. Can someone please help me understand if I am in the wrong?",
    "subreddit": "careerguidance",
    "timestamp": 1498146673,
    "score": 15,
    "keyword": "japanese manager"
  },
  {
    "text": "Master's in TESOL, hitting a wall. What should I be doing about work now? What am I going to be able to do in the future? I finished grad school in December of 2012 and I managed to work at some ESL schools near where I went to school, but they were always part time, so I would look for other work but I was only able to get work at another school.\n\nI was only let go from my last 3 jobs because of low enrollment and lack of experience (they cut from the bottom and it's always been me). My wife had a baby right before I left my last job in February 2015 and she wanted to take on more work for herself instead of me applying for jobs that wouldn't work out, so I was stay at home parent until my son was old enough to go to childcare at 18 months old last May (this gap was 13 months).\n\nI did try to apply for overseas positions, but I never got any replies. I applied for a veterans' work therapy program that started when my son started school in May 2016, but it was conditional that I continue to apply for other work outside of the program. I got an ESL teacher job on short notice and left my job working for the VA medical center doing custodial work in July 2016. I was there from July 2016 to the middle of October when student enrollment dropped off sharply and I was let go again for lack of experience.\n\nI've been applying for work through Craigslist and ESL job sites, but I got an interview with an English school company in Japan and a Nonprofit canvassing job in the SF Bay Area. The Japanese school turned me down and the Nonprofit had donation quotas I could never hope to achieve. I'm running short on money and I need help getting a job, but I feel like the people that look at my resume either despise me or completely ignore my applications.\n\nI have trouble keeping a positive attitude in interviews and my family have been making me feel worthless about the whole situation. I wanted to work abroad straight out of grad school, but I got married before I could make it happen. Now I spend my time alone searching for work and I have a subscription to Flexjobs of $50 for the year.\n\nMy students, colleagues, and administrators all said that I was a good teacher at every teaching job, but I can't get work in the field I prepared for and I just don't feel really great about myself.\n\n[Link to a post with my resume information](https://www.reddit.com/r/resumes/comments/5ooi1b/teaching_esl_im_not_getting_offers_for_anything/)",
    "title": "Master's in TESOL, hitting a wall. What should I be doing about work now? What am I going to be able to do in the future?",
    "subreddit": "careerguidance",
    "timestamp": 1484736253,
    "score": 7,
    "keyword": "japanese manager"
  },
  {
    "text": "Would anyone be willing to assist me in some possible career choices for my background and interests? TL;DR at bottom~\n\nI apologize for the lame title, but it is what it is. Thank you for taking your time to give this a glance. Allow me to tell you a little about myself, and thank you for helping me with this selfish request.\n\nI am a recent graduate of a 4 year University. I ended up changing my major so many times that I went with what they call an \"Individualized Studies Program\". It was basically a way out since I had so many credits and was getting burnt out. I suppose you could think of it as a General Studies degree. So I graduated with a BA, with concentrations in Japanese Language and Culture, Computer Science, and Computer Information Systems.\n\nI started out majoring in Japanese, that was my passion at the time. But as I got into my new college and started making friends and learning about the things they were taking, my interest also changed. There was a a program at my college called Simulation, Animation, and Gaming. I had been interested in gaming and had been a gamer since 6th grade. So I thought, wow, I could try this major and get some hands on at what it's like to be a video game designer / developer. So I gave it a try, bad idea. The program was new, and poorly managed. I loved the animation bits that we got to do, but one of my classes was a cover to cover book follow-along, and another was video tutorials everyday which felt like a waste of my time. Which it was.\n\nSo, after being thoroughly disappointed with the SAG major, I decided that perhaps I might like the more back-end side of game design and majored in Computer Science. It wasn't bad, in fact I really enjoyed the first programming class (we were using Java). But that was mostly because I had an awesome teacher. I took the second class with the same teacher, and that's where some problems started arising. Even though I liked programming, it got to a point where I just couldn't follow the logic. And then when it got to the third class, with a new, more strict teacher, I had to drop.\n\nWhen I was majoring in Comp Sci I was also taking some Computer Information Systems classes for a business side of things. I didn't mind those classes too much, I had good teachers, and bad. But they felt like more of a grind. So I just used them to get the upper level credits I needed for my \"General Studies\" degree.\n\nIn my life I've also tried a lot of things. Ballet and Tap, Piano, Clarinet, Violin, Gymnastics, Horse Back Riding, Ultimate Frisbee, and even Quiddich in college. But I'm not doing any of those things today, nothing has ever stuck.\nFor the longest time I have had no idea what I want to do with my life. I've had many many interests, but nothing has ever stuck. The one thing I do know is that I want to be really good at something. Be extremely proficient in a skill/trade/occupation. It is a main drive for me.\nMy personality type is INFP, but everytime I look at the INFP careers I cringe a little. Most of them deal with people a lot, I don't want to deal with people. Of course, not ever INFP is going to be the same.\n\nI am interested in computers, I've been staring at a computer screen for more than 8 hours a day since I was 12 and it doesn't bother me a bit. I built my own gaming computer, but it's not a hobby, and I've only built one. I enjoy looking things up. When people say they can't find something, to me it sounds like a challenge, and I can usually find it. If I have a question I always dig to find it, so I suppose I like researching? I have attempted programming again and again. I tried to brush up on Java after I graduated, I have also tried JavaScript, but with the same result. I always get to a certain point where things just don't click, and I don't know how to make them click.\nMy favorite subject in school was Math, I absolutely love Algebra. I always did well in Biology as well, but I never pursued it as a serious interest. My least favorite were English(god I hate English), Geometry, and Chemistry(had a hard time understanding).\nI have taken a few of those online career test. I've gotten Actuary a few times, Bioinformatics Scientist a few times, Data Architect, some other things that didn't sound as interesting. I was looking into the Data Analyst / Scientist career. But the one thing I'm worried about is programming. I like programming, but there's always that point. I just get stuck.\n\nSo, I'm not sure what I should do, and I reaching out to the community for some insight or assistance, or whatever information you might be able to give me. Thank you so much.\n\nTL;DR:\n\nI've tried many things in life that didn't stick, and graduated with a General Studies degree (Concentrations: Japanese Language and Culture, Computer Science, and Computer Information Systems). I enjoy working with computers and researching. I also love math and don't mind biology type sciences. I don't mind programming, but always get stuck at a certain point. My personality type is INFP, but I'm not a huge fan of working with people (counseling, teaching, etc) although I could. A few suggested careers I've gotten from test sites are Actuary, Bioinformatics Scientist, Statistician, Data Architect, and Data Analyst. But I am hesitant about these due to programming issues. Thank you.\n\nIf there's anything else you'd like to know about me, please ask. Thank you.",
    "title": "Would anyone be willing to assist me in some possible career choices for my background and interests?",
    "subreddit": "careerguidance",
    "timestamp": 1490625983,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "As a mid-career engnieer with a lot of international experience and fluent in a lot of the most common languages - what else can I do? Full details within. Thanks for the help. Full Disclosure: I am in no way unhappy with my job/career choices. I'm not actively looking for an \"out\", just curious what could be the next step. I always wanted to be an engineer and became one - never looked back. This is my mid-life \"what if\"... \n\nI have a BS in Mechanical Engineering and almost 15 years experience working in USA, UK, Japan, France, Germany, Spain and Mexico. Between 1 and 3 years in every location. Almost all my experience is in the Aerospace industry. I'm also fluent in English, Japanese, French, German, Spanish and Hindi - plus some Mandarin (learning atm).\n\nAs I said before, I love my job. I love travelling and really integrating into cultures. My most likely future is going to be in upper level engineering management with my current company which is fine by me. I just want to know if there's something else out there for me. Given my skills/experience, what else would you say would be a good fit? I was thinking maybe something about global business development if that's even a thing but I'd likely have to do an MBA for that. I'm open to going back to school I guess but for now I just want to check what's out there.\n\nThanks for the help. Feel free to ask for additional details and - so long as the answers arent too personal or classified - I'll answer.",
    "title": "As a mid-career engnieer with a lot of international experience and fluent in a lot of the most common languages - what else can I do? Full details within. Thanks for the help.",
    "subreddit": "careerguidance",
    "timestamp": 1504760651,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Looking for assistance choosing possible computer related career, but gets stuck on programming? TL;DR at bottom~\n\n\nI apologize for the lame title, but it is what it is. Thank you for taking your time to give this a glance. Allow me to tell you a little about myself, and thank you for helping me with this selfish request.\n\n\nI am a recent graduate of a 4 year University. I ended up changing my major so many times that I went with what they call an \"Individualized Studies Program\". It was basically a way out since I had so many credits and was getting burnt out. I suppose you could think of it as a General Studies degree. So I graduated with a BA, with concentrations in Japanese Language and Culture, Computer Science, and Computer Information Systems.\n\n\nI started out majoring in Japanese, that was my passion at the time. But as I got into my new college and started making friends and learning about the things they were taking, my interest also changed. There was a a program at my college called Simulation, Animation, and Gaming. I had been interested in gaming and had been a gamer since 6th grade. So I thought, wow, I could try this major and get some hands on at what it's like to be a video game designer / developer. So I gave it a try, bad idea. The program was new, and poorly managed. I loved the animation bits that we got to do, but one of my classes was a cover to cover book follow-along, and another was video tutorials everyday which felt like a waste of my time. Which it was.\n\n\nSo, after being thoroughly disappointed with the SAG major, I decided that perhaps I might like the more back-end side of game design and majored in Computer Science. It wasn't bad, in fact I really enjoyed the first programming class (we were using Java). But that was mostly because I had an awesome teacher. I took the second class with the same teacher, and that's where some problems started arising. Even though I liked programming, it got to a point where I just couldn't follow the logic. And then when it got to the third class, with a new, more strict teacher, I had to drop.\n\n\nWhen I was majoring in Comp Sci I was also taking some Computer Information Systems classes for a business side of things. I didn't mind those classes too much, I had good teachers, and bad. But they felt like more of a grind. So I just used them to get the upper level credits I needed for my \"General Studies\" degree.\n\n\nIn my life I've also tried a lot of things. Ballet and Tap, Piano, Clarinet, Violin, Gymnastics, Horse Back Riding, Ultimate Frisbee, and even Quiddich in college. But I'm not doing any of those things today, nothing has ever stuck. \n\n\nFor the longest time I have had no idea what I want to do with my life. I've had many many interests, but nothing has ever stuck. The one thing I do know is that I want to be really good at something. Be extremely proficient in a skill/trade/occupation. It is a main drive for me. \n\n\nMy personality type is INFP, but everytime I look at the INFP careers I cringe a little. Most of them deal with people a lot, I don't want to deal with people. Of course, not ever INFP is going to be the same.\n\n\nI am interested in computers, I've been staring at a computer screen for more than 8 hours a day since I was 12 and it doesn't bother me a bit. I built my own gaming computer, but it's not a hobby, and I've only built one. I enjoy looking things up. When people say they can't find something, to me it sounds like a challenge, and I can usually find it. If I have a question I always dig to find it, so I suppose I like researching? I have attempted programming again and again. I tried to brush up on Java after I graduated, I have also tried JavaScript, but with the same result. I always get to a certain point where things just don't click, and I don't know how to make them click.\n\n\nI have taken a few of those online career test. I've gotten Actuary a few times, Bioinformatics Scientist a few times, Data Architect, some other things that didn't sound as interesting. I was looking into the Data Analyst / Scientist career. But the one thing I'm worried about is programming. I like programming, but there's always that point. I just get stuck.\n\n\nSo, I'm not sure what I should do, and I reaching out to the community for some insight or assistance, or whatever information you might be able to give me. Thank you so much.\n\n\nTL;DR:\n\n\nI've tried many things in life that didn't stick, and graduated with a General Studies degree (Concentrations: Japanese Language and Culture, Computer Science, and Computer Information Systems). I enjoy working with computers and researching. I also love math and don't mind biology type sciences. I like programming, but always get stuck at a certain point. My personality type is INFP, but I'm not a huge fan of working with people (counseling, teaching, etc) although I could. A few suggested careers I've gotten from test sites are Actuary, Bioinformatics Scientist, Statistician, Data Architect, and Data Analyst. But I am hesitant about these due to programming issues. Thank you.\n\n\nIf there's anything else you'd like to know about me, please ask. Thank you.",
    "title": "Looking for assistance choosing possible computer related career, but gets stuck on programming?",
    "subreddit": "cscareerquestions",
    "timestamp": 1490631881,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "TIL that current Dodgers manager Dave Roberts is of Asian descent, being born in Okinawa, Japan to a Japanese mother (and an African American father)",
    "title": "TIL that current Dodgers manager Dave Roberts is of Asian descent, being born in Okinawa, Japan to a Japanese mother (and an African American father)",
    "subreddit": "asianamerican",
    "timestamp": 1508996295,
    "score": 76,
    "keyword": "japanese manager"
  }
]