[
  {
    "text": "6.5 months since I have been laid off from my Senior Corporate Communications role with 7 years experience - at a complete loss for what to do at this point First time poster, long time reader. Genuinely moved by some of the commenters here, thank you for helping so many people in their times of need! And... Well, it has been 6.5 months since I was laid off and I am at the end of my rope. I need help, too! Below is a condensed overview of my situation.\n\n&#x200B;\n\n* Professional Background:\n   * Title: Senior Corporate Communications Specialist\n   * Total experience in Marketing/Communications: 7 years\n   * Total Work Experience: 15 years\n      * I have employment gaps of up to 1 year between my major jobs and have worked jobs that were not relevant to my career to make ends meet.\n   * All of my experience is at Japanese companies and I moved back to the US about 4 years ago.\n   * I specialize in PR, Internal/External Communications, Branding, and Marketing at a Global capacity.\n      * I have no formal education for Marketing/Communications, though I have taught marketing/communications courses in a past career.\n      * I often acted as a liaison between Japan, the US, and Europe, connecting people with the right people within my organization of 40,000+ employees. I wore many hats and it was not uncommon for me to be on meetings with Europe at 6 or 7am and meetings with Japan until 10 to 11pm. 15-hour work days are no stranger to me.\n   * I read/write/speak Japanese fluently.\n      * I do not have any certification proving this, but I did live in Japan for over 12 years and have worked at roles in Japanese companies that require bilingual fluency for 7 years of my career.\n\n&#x200B;\n\n* I was laid off this April after the company announced their greatest loss in 20+ years of nearly $2B due to a failed acquisition in North America.\n   * I have reached out to my network, all people were happy to be personal references but had no idea any other ways they could help me in my job search.\n      * Most of my network is General Manager to C-suite. They are extraordinarily busy people.\n      * 90% of my network is in Japan.\n\n&#x200B;\n\n* I took a 3-month break before starting to look for a job seriously. \n   * I won't go into details, but I was actually relieved to be on the chopping block and the 3-month break was absolutely necessary for my mental health albeit likely disastrous for my chances of being hired for a new job. RIP.\n\n&#x200B;\n\n* I have been speaking with a career consultant for 6 months and it has yielded no success.\n   * During our last conversation, she was at a complete loss and seemingly entirely out of ideas. She mentioned that I have tried everything in the book and she is shocked that I am still not getting any interviews. She even suggested looking into substitute teaching or even something like a school bus driver or local car wash until I can find something in my field. ... I wish this were a joke.\n\n&#x200B;\n\n* My resume has been optimized for ATS systems.\n\n&#x200B;\n\n* I have been applying primarily for Communications Manager positions.\n   * My title was not manager at my previous company, but I took over the previous Communication Manager's job when he left to Japan (they didn't want to pay me Manager-level wages)\n      * I have experience managing vendors of up to 4 people, but no in-house management experience.\n   * I have also applied to some Senior Communications Specialist and lower level Marketing/Comms roles to no success.\n\n&#x200B;\n\n* I have sent out hundreds of applications and only earned 4 interviews.\n   * Two were HR screening interviews, two were with the people I would report to.\n      * Recently I had a 2nd interview with the VP of a company and I was ultimately unsuccessful.\n   * Most jobs I am applying for are local and tend to fetch between 50-200 applicants. I was shocked to see a recent listing have over 50 applicants within an hour of being re-posted...\n      * There haven't been any new postings for the past two weeks, but there have been plenty of re-posted jobs that I had already applied for and been either ghosted or rejected.\n   * I am focusing primarily on my state of residence. \n   * I have tried for out of state positions, but have been immediately rejected by their ATS systems every time (guessing location is the factor as I do not see these immediate rejections when applying locally).\n\n&#x200B;\n\n* I have contacted agents specializing in Communications and have been either ghosted or rejected due to lack of experience.\n\n&#x200B;\n\n* I have posted my resume on all of the major job boards to no success. \n   * Plenty of spam from people who are convinced I am perfect for the IT job they are seeking.\n\n&#x200B;\n\n* I would like to continue my career in Communications and am ready to forgo my Japanese language abilities for my next job. It would be nice to finally get to experience working at a non-Japanese company for a change.\n\n&#x200B;\n\nThat should pretty much sum up my situation. It usually takes me about 8-12 months to find a job, and they usually come when I least expect it. Be that as it may, I feel like I've tried everything and have entered a state of utter despair and hopelessness. I feel like my career is over. I am nearly 40 years old, single, and alone. While I do have some great friends around the world, none of them are nearby. I moved back to the US right before Covid hit, and I have never been the most outgoing person... \n\nSo, give it to me straight, Redditors! Is it curtains for me? Do I need to start again from scratch or should I keep trying in Comms? \n\nShould I continue focusing on Communications Manager job postings requesting experience of between 5-7 years (matching my experience level), or should I be focusing on lower-level positions that require less experience?\n\nHappy to relocate, but I'm always ATS rejected when I try for jobs that would require relocation. Even the ones that claim they support relocation!\n\nAlso, what the heck is going on in the job market right now? This does NOT feel normal to me. I have never seen this little success before in my job search, and this is not even close to my first rodeo. Does anyone have any ideas that can help me out?\n\nThank you so much for taking the time to read this post! Wishing you all the best of luck!!",
    "title": "6.5 months since I have been laid off from my Senior Corporate Communications role with 7 years experience - at a complete loss for what to do at this point",
    "subreddit": "jobs",
    "timestamp": 1698850779,
    "score": 159,
    "keyword": "japanese manager"
  },
  {
    "text": "What am I doing wrong? Why won't I still be hired for entry-level IT jobs I'm qualified to do? I've tried for years, I've done everything people told me to do, and I have nothing at all to show for it I'm angry. I'm tired. I'm getting extremely frustrated. I've finished my daily limbo of applying for IT jobs that is as mundane and soul-crushing as it has been for the whole of 2022 and the start of 2023 as I write this as an angry cry for help:\n\n**What have I been doing wrong all these years?**\n\n[Here is my resume:](https://drive.google.com/file/d/1eUIt0yIvUfG5tIi2v8syp5IBOq19D4te/view?usp=sharing)\n\nI have plenty of basic IT knowledge and have the following skills:\n\n&#x200B;\n\n* Windows Active Directory\n* Group Policy and Management\n* WSUS\n* Performance Monitoring\n* Computer Networking\n* Computer Imaging/Reimaging/Clean Operating Systems Installations\n* Help Desk Documentation\n* IT Ticketing Systems (ServiceNow)\n* Programming\n* CMD and PowerShell\n* Virtualization\n* Hardware/Software Troubleshooting\n* Web Development\n* Database Programming\n* PC Assembly/Disassembly/ Interior Maintenance/Parts Replacement/Diagnosis/Troubleshooting\n* Hardware/Software Maintenance\n* Communication\n* Leadership\n* Project Management\n* Teamwork\n* Customer Service\n* Microsoft Office Suite (All programs with 10+ years experience\n* Analysis Skills\n* Problem Solving\n\nAnd I have the following experience in these Operating Systems/programming language (my programming language knowledge however is basic)\n\n&#x200B;\n\n* Windows XP/7/8/10\n* Windows Server 2016\n* MacOS\n* iOS/Android\n* Red Hat Linux\n* Kali Linux\n* SQL\n* Java\n* Python\n* JavaScript\n* Apple Swift\n* HMTL5/CSS\n\n&#x200B;\n\nI also have tons of references from managers, colleagues, professors, co-workers who all speak highly of me and are on my resume. I have an Associate's Degree in IT. I have applied for so many jobs over the last year that I have lost count, along with hundreds of IT jobs in the last 4 years. I'll be 30 in 2 days.\n\nI wasn't getting interviews, but now I'm getting interviews, but ALWAYS being PASSED OVER for someone else. It's infuriating. The last job my recruiter tried getting me, NOBODY got hired out of 10 candidates. I also am fairly certain I am doing well in my interviews. I am confident, I give good posture, I wear nice clothes, style my hair properly to loom professional, have good hygiene, trim my facial hair to be neat and presentable, answer their technical questions and personal questions with not talking too much but giving a good amount of detail to the question and always try to demonstrate my intelligence and education.\n\nI don't have any real work experience though that these stupid American companies find desirable. The only thing I have is the stuff I did for my 2 year Associate's Degree in community college, the 4 years of volunteer IT work at my Australian community college, 1 year at Teletech as help desk support, and 3+ years of working as an IT person for a mom-and-pop mechanic shop where I set up their computer/network and do their IT maintenance for them while they pay me in cash for the hours I work (it's basically under the table contract work, but the manager vouches my work as a great reference).\n\nI also don't have a Bachelor's Degree (yet) as I have applied for University and am hopefully getting a Bachelor's in Information Systems (I don't like Computer Science) with a second major in Japanese studies/the language during the next 3-4 years.\n\nThe other thing that pains me and infuriates me when people bring it up is I have permanent facial palsy, so I do have a speech impediment, however my speech is understandable and I have had years of speech therapy as a child. Technically yes I am disabled, and have been living off SSI for the last 4 years which was a terrible mistake, and I am trying to get off of it with a proper IT job. I've also been discriminated not only for my disability, but my race as well (I'm Southeast Asian/Thai) although I've never been able to sue for it due to lack of incriminating evidence that would be acceptable in court.\n\n&#x200B;\n\nThis is the experience I have:\n\nComputer Technician (3+ years) for mechanic shop:\n\n\\-Built and installed main office computer along with hardware/software maintenance and troubleshooting.- Installed modem, routers, set up 2.4Ghz/5Ghz Wi-Fi and Ethernet network while configuring and diagnosing network issues.- Set up system administration. Installed, maintains, configures, and troubleshoots printers, mobile phones, tablets, and customer entertainment system.- Handles all technology errands, requests, and gives advice/solutions when asked for technological improvements and upgrades.\n\nTeletech (1 Year)\n\n\\- Learnt how to install Windows 10 Enterprise onto a secure encrypted USB Flash Drive. Learnt how to login into a secure Workbooth as well as login into various secure Windows 10 and Windows 7 Virtual Machines and balancing all of them to perform work related tasks. Also learnt how to use Windows VDI (Virtual Desktop Infrastructure)- Learnt how to operate Cisco IP Telephones, as well as how to call customers and co-workers through the phone. Also learnt how to put customers on hold, how to transfer to another call, how to create a conference on the phone, and how to transfer from group to secondary calls.- Learnt about HIPAA, customer security, how to handle important documents, private and secure informnation, confidential classified info, etc.- Learnt how to look up information online regarding to assisting customers on the phone- Learnt how to look for customer's member ID through the system, how to locate important data such as policy numbers, payment due, overdue payments, SSNs, confirmation numbers, etc.- Learnt how to change customer PCP (primary care physician), how to make a payment online as well as read statements in verbatum, how to make split payments, how to pay in installments, how to change addresses as well as passwords, how to verify information, basic customer service mannerisms and operations, learnt all about healthcare basics, healthcare policies and updates, healthcare security and privacy, how to verify customer ID cards and mailing ID cards as well as PCP information, and how to update policy handbooks as well as mailing them to customer.\n\nCanberra Institute of Technology (Voluntary IT Staff 3 years voluntary experience)\n\n\\- Help-desk support- Technical support specialist- Customer service- IT training\n\n\\- System Administration (Windows Active Directory)- PC Assembly/Disassembly/Maintenance- PC Parts Replacement- PC Diagnosis/Troubleshooting- Observed training new staff- Documentation- Software Maintenance- Hardware/Software Troubleshooting- Virtualization- Operating System Installations- Virtual Machine Installations- Microsoft Office- Hardware Assembly/Disassembly- Cleaning/Maintenance\n\nWith my LinkedIn, I took my parents who are a Business Analyst and an accountant with a MBA, studied their profiles and copied their formatting to make my own LinkedIn as professional as possible. Most of the stuff you see on here are taken from my resume and LinkedIn. It also gets noticed daily by people and I get messages from recruiters offering me job applications in IT.\n\nAlong with all of this, I constantly self-study, am always learning and updating my knowledge on technology and what's new/evolving, constantly trying to improve my knowledge and experience with learning new skills, and am studying to get my COMPTIA A+ certification.\n\nAnd despite all of this... **I still have not gotten a goddamn IT job. I've wasted so much of my life trying to get my foot into this god-forsaken field but nobody will hire me for an entry-level position when I feel I am CLEARLY qualified to perform the tasks and learn to improve my IT knowledge and experience. It's a catch-22 with this field. I need the experience to get the job, but I need the JOB to GET the experience (especially since no internship has taken me). I've never gotten a single internship or job offer as I was always passed over FOR SOMEONE ELSE.**\n\nI've built computers from scratch at home and at college, I've fixed broken computers and laptops, I've replaced parts, installed operating systems, changed operating systems, programmed basic software applications, designed websites, done ticketing systems, monitored performance on computers/networks, written into knowledge bases online and have documentation experience, led a real life IT project in college for a museum, trained myself to use Windows servers at home by virtualizing 3-4 servers and desktops with VMWare so I could learn Windows Server 2016 and Active Directory, I've taken proficiency and assessments tests on recruitment websites and took them until I got a high score to impress interviewers, I've set up my own networks and other people's networks, routers, printers, etc.\n\nI've used so many job search websites: Indeed, LinkedIn, Monster, DICE, SimplyHired, ZipRecruiter, as well as applying to HUNDREDS of company websites and recruitment agencies. NOTHING but interviews and that's it, or not even hearing from them, or the most insulting: A damn automated message saying \"They're going with other people\".\n\nI get good feedback from people and constructive criticism on how to improve my interview skills from recruiters and have had years of interview experience. YEARS.\n\nWhat the hell am I doing wrong? I've followed everyone's advice and have gotten **NOWHERE.** What am I supposed to do to get into this field?! My career has been meaningless because it has never taken off. At this point, I have a better chance of getting better at digital art and somehow making money off that than getting an IT job and starting my IT career...\n\nTell me what I'm supposed to do to get an IT job and start my IT career when **The United States of America does not want to hire me for a single IT job let alone an entry-level one**",
    "title": "What am I doing wrong? Why won't I still be hired for entry-level IT jobs I'm qualified to do? I've tried for years, I've done everything people told me to do, and I have nothing at all to show for it",
    "subreddit": "jobs",
    "timestamp": 1676261898,
    "score": 6,
    "keyword": "japanese manager"
  },
  {
    "text": "I'm 30 with an MA in Asian Studies and an advanced level of Japanese, but I can't find a job due to no entry-level experience. Considering being a high school Japanese teacher out of desperation. Feeling lost and depressed. Sorry this is super long, but I really needed to get this all off.\n\nAs I said in the title, I'm 30 with a BA and MA in Asian Studies and an advanced level of Japanese, but I can't find a job due to no entry-level experience.  I chose to study Asian Studies and Japanese because I became interested in Japan in high school and I was told that Asian Studies was a great major since it could be applied to a variety of fields, such as business, government, the FBI/CIA, etc. I had hoped to get into business where I could use my Japanese language skills and cultural knowledge to do international communications and travel to Japan for business.\n\nAfter graduating, I moved to Japan where I taught English for four years. I didn't want to be a teacher. It was just a means to experience Japan at a deeper level and improve my Japanese skills. I enjoyed teaching there for what it was and did pretty well with it as I made significant improvements to my school's English teaching system. However, the industry is terrible and foreign English teachers basically live paycheck to paycheck. Without having a near-native level of Japanese, job options besides teaching English are extremely limited there. Because of this, I moved back to the US last year as I felt it was time to get a real career started. I miss Japan terribly though.  \n\n\nNow, I've been job searching for over half a year, and I can't find a job, which is making me very depressed.  I managed to get three interviews for jobs I would have loved. I made it to the second round in an interview for my dream job at a major gaming company, but it didn't work out. Unfortunately, I've come to realize that while my background can be useful, it's too specific to solely rely on to find a job. My Japanese is around advanced level, but that's still far stretch from being fluent, so I don't qualify for fully bilingual positions. There are very few jobs (at least at the moment) that need someone with that kind of background, so I've given up on finding anything Japan-related and am searching for any decent job just to get my foot in the door and start and actual career path. I've applied to numerous jobs that I know I could quickly learn and do if given the chance, but I haven't gotten a single interview because even entry-level jobs are looking for specific skills and experience. I don't even qualify for administrative assistant positions. The only one interview I got was because my dad's acquaintance gave my resume to their company's recruiter and it was for an inside sales position. My Japanese skills and knowledge of Japan are a great supplementary skillset, but I lack any primary skills to land a job. I'm at a total loss at what to do now.\n\nI reached out to my Japanese professor and his suggestion was to become a high school Japanese teacher since I meet the requirements and it offers good job security and lifetime benefits in my state (which certainly sounds nice). He also suggested going for an Ed.D, but I don't want to take out more student loans. My parents and fiancée think I would be a great teacher, but I really don't want to teach as a career, especially in K-12. I always said if I ever wanted to teach, I would get a Ph.D and become college professor. I think I could enjoy teaching college. But even if I went that route, I would still need a full-time job while I was going for a Ph.D, and the starting salary for a college professor is just way too low to justify it at this point in my life. Despite all this, I'm considering going the teaching route because I'm so lost right now. I just don't know what else to do or what I can even do.  Teaching offers a much better salary compared to most of the entry-level jobs I've looked at, so I guess I could teach for a year while I continue to search for other options. Any suggestions or advice would be greatly appreciated!",
    "title": "I'm 30 with an MA in Asian Studies and an advanced level of Japanese, but I can't find a job due to no entry-level experience. Considering being a high school Japanese teacher out of desperation. Feeling lost and depressed.",
    "subreddit": "jobs",
    "timestamp": 1677660000,
    "score": 5,
    "keyword": "japanese manager"
  },
  {
    "text": "Many interviews, same result \"rejected\" Hello, I'm a computer engineer, that had been working since I was 19 yrs(I'm 23 now)in a Japanese Carmaker, as Trainee and as employee, programming macros and I want to became a data analyst. I know python  obviously excel and SQL. I don't see anything wrong with my resume, because I always reach interviews, but at interviews, just a simple question that can answer like reporting software, that isn't complicated, or I don't remember the answer at the time. Rejected, I'm felling frustrated because it's always the same, a waste of time for both parts. At my work and my family, everyone's telling me that I'm overqualified for my job, also I want to grow up in my career. But for managers I'm just not a good match even my experience is shit, I feel like an idiot because some people that even doesn't have a background at some positions get hired. Am I loser or what?",
    "title": "Many interviews, same result \"rejected\"",
    "subreddit": "jobs",
    "timestamp": 1695081527,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "What to expect for round 2 of job interview with VP? This is my first job hop after working for 1 and a half year (contract based) ever since I concluded my Military Service. (I 24M live in Singapore) \n\n\nI successfully completed the first interview round with HR and the Hiring Manager, leading to my selection for a second interview with the VP. \n\nWhat types of questions should I anticipate in this upcoming interview? Will they be technical or more focused on personal aspects? \n\nAsking this because I only had 1 round of interview that led to my contract based role. \n\nAlso, I think it's weird for a junior role (marketing executive) to be meeting a vice president, is this normal?\n\nContext:\n\nThe company that i am interviewing for is a Japanese FMCG MNC, and the VP leads one of their business (for instance, VP for skincare business APAC - marketing)\n\nI am not sure if this is the final round of the interview, but I will have to assume there is 3 as this is an MNC",
    "title": "What to expect for round 2 of job interview with VP?",
    "subreddit": "jobs",
    "timestamp": 1696420489,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Custom Anime Crocs Hey yall, kind of a random question here, but being a huge fan of Japanese anime, my friends got me multiple pairs of custom anime crocs for my bday. Kinda wanna wear them, my manager was cool with it but hospital director is a bit of a tight ass. Just curious if anyone else here has rocked a pair of these before. Fwiw, they're not like images of females showing a ton of cleavage that some anime are known for. Pretty conservative images and just some headshots of popular characters",
    "title": "Custom Anime Crocs",
    "subreddit": "nursing",
    "timestamp": 1698659442,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Totally Wiped at End of First Year? I'm a first year teacher with about a month left in the school year. I teach a subject I love (Japanese) and am very lucky to have (mostly) students who also are interested in the subject. I have one chaotic period but overall I have good relationships with all my students, I've managed to teach them at least something, and even in my chaos class a majority of students at least try. I feel passionate about the profession and am so glad to have found it. I get a good amount of sleep, I eat well, exercise, and I usually don't work weekends or past 4:30 PM (though I start work around 7:30 AM). I've even taken days off.  \n\n\nAnd this week I. Am so. Exhausted.  \n\n\nI've had low moments over the year but this is new, and it kind of came out of nowhere. I am dragging every day, my lesson plans suck, and my ability to manage the classroom at all is gone. I'm a month behind on grading, and yet I just can't face anything. Even with the students who I usually really enjoy, I hardly have the motivation to chat let alone teach.  \n\n\nI'm guessing this is normal but still: is this normal? Will it go away? Can I do anything to make it to the end? I don't want to be permanently burned out!!",
    "title": "Totally Wiped at End of First Year?",
    "subreddit": "Teachers",
    "timestamp": 1685050196,
    "score": 6,
    "keyword": "japanese manager"
  },
  {
    "text": "Im a delivery driver for a small business and it sucks  \n\nI (24, male) work for a dental lab. Basically, when you go to your dentist and need a crown, partial, implants or dentures, they order from us. \n\nIt's a small business, and the boss has no idea how to manage money. He owns three different cars, one for business meetings, a nice Mercedes that's kept in storage most of the time.( which I don't have a problem with because you need a nice car to show that your legit, I guess) but he also has a Cadillac SUV, and a Tacoma. Idk what his wife drives. \n\nAnyways, it just looks bad when he has to pull up at gas stations to hand me a different credit card for the gas. That's why I'm mentioning it. Like the card declines half the time. I've had to buy some gas here and there because if there's no money on the card and no cash in the business purse, then I'm fucked. Can't work. Plain and simple. Oh and dentists can't get their cases for their patients. So if your dentures are taking forever to get to you, I'm sorry, it's not entirely my fault. \n\nI work for California minimum wage, $15/hr. I have no benefits. No sick time. No 401k. No insurance. Nothing else. Just pay. \n\nI have a company car provided, and expense wise they take care of it, like oil changes and shit. But they have no idea, like no clue about car repair or even maintenance. \n\nI was driving a 2010 Kia soul, with 285,000 miles. Cracked windshield, fucked alignment that drives to the left. \n\nBefore it was stolen, the brake pads were grinded down to nothing. The transmission was failing. One headlight was out. One taillight was out. The key snapped off a while ago, and it was just glued back on pretty much. \n\nIt was sketchy to drive, and I was getting scared. (No I did not steal the car ok, I know what your thinking) \n\nSo I'm glad it's gone. But, when I did have it, it was so hard getting parts and getting any sort of permission to take care of it. \n\nWhen it was stolen, I couldn't work, because they refused to rent a car daily. I couldn't work for a full week and was looking at other jobs. \n\nI didn't want to use my own car, because it's  new (under 50k miles new, which is as new as someone my age can get) and if I wrecked it, I would owe like $20k while finding a new car. (never been in an accident btw) and the mileage is killer. Years of use in a month basically because I'm driving over 100 miles a day. And they aren't going to reimburse me for the mileage. \n\nI am lucky enough to get paid at all. Is basically what my supervisor told me. So, yeah I'm trying to have this job be as temporary as possible. \n\nBut to get to the real point for the post; it sucks. \n\nIm given  routes by someone who doesn't know where everything is. They don't know how long it takes to get from one place to another. They never calculate traffic. They expect me to drive fast, which I'm not going to do, I will not risk life and limb for this bullshit. Im a California driver, so I'm already driving fast enough. \n\nThe doctors talk and complain to me, like I know what dental problems they are having. I'm a driver, not a fucking technician. And they never have the cases ready to go at a moments notice. Alot of them have two hour lunches and they complain that we never come by. They keep reminding me their lunch hours, like our schedules can easily accommodate theirs. Like bro I don't have lunch till I'm done. Hell most of the time I'm eating while I drive. \n\nI can't shit, because there's literally no time for it. Recently, I've had like a whole page of destinations for my morning route, ( this particular day, it was a 3 hour route, but they kept telling me it should have been less than 2 hours, and then they keep adding places when I'm on the road, like wtf). It took me all day that time. They were on my ass, asking me why it took so long. \n\nI didn't have the words, tried going through the route with them about it, but they insisted I was fucking around. I'm just over it with them, looking for work somewhere else.\n\nThe doctors are horrible, they complain all the time. Their staff always try to leave early, and lie about me not being in time for deliveries and pick ups. \n\nBut the worst thing is that no one believes Im working in good faith. Both the doctors and my own co workers think I'm some fuck who doesn't want to work. My only friend is an older Mexican man, who knows what's up, and told me before everyone there are fucking idiots. He owns his own business, this is a side gig for himself. \n\nBut oh my god, people are so incompetent and I'm suffering because some fuck doesn't want to run his business like a business. \n\nI'm not the only one who suffers. A Japanese man living in Texas is a remote worker, a tooth designer working for us part time. He hasn't been paid this entire month. \n\nThe boss is in Vegas, and people have not been paid. I also heard this is more of a hobby for him, because his wife is rich. So basically he's a beta male cuck who has people depend on him but he just likes to pretend he's a business owner. That's it, that's my boss. \n\nBefore this I was working for a overnight courier franchise, at a warehouse. I worked long hours, graveyard. It was horrible, it gave me insomnia. But, at least they gave me sick hours, health insurance, and let me work overtime. They wrote me up for attending my grandmother's funeral, and withheld a check from me, but idk it was better than getting fucked by some people who have no concept of business. \n\nThe warehouse job also had pizza night on Friday so I mean that was cool. \n\nBut fuck small businesses man. At least the ones run by an idiot.",
    "title": "Im a delivery driver for a small business and it sucks",
    "subreddit": "WorkReform",
    "timestamp": 1702700929,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "How to become a product manager? Advice I want to tell you about the path of becoming a product manager (PM) and the vision of this profession. It is not the only true one, but it will definitely broaden your horizons. The article is most suitable for students and graduates with minimal work experience.\n\n# The base\n\nA product manager is not about knowledge of IT terms and the use of existing tools. Knowledge of the agile manifesto will undoubtedly help you on the way, but will not make you a product manager. That's why I don't recommend starting with books that directly write about product management (inspired, the lean startup, hooked). I believe that in order to approach such books, you need to initially have a base for discussion. Otherwise, you will not be able to reach your potential as a PM, while reading them. Each product experience is unique and depends on the situation and time.\n\nTo begin with, I recommend reading books that gonna help you understand the philosophy of proper management and product approach:\n\n1. Kaizen: The Key To Japan's Competitive Success. The book is about Japanese philosophy, thanks to which the concepts of kanban and lean were born. This philosophy can be put not only in the foundation of the agile, but also in the foundation of your own life path.\n2. Writing That Works; How to Communicate Effectively In Business. As a product manager, you will connect different parts of the business and constantly communicate. It is necessary to properly structure and convey your thoughts to the interlocutor.\n3. High Output Management. This book describes the basic product approach to doing business. You will learn how to conceptually understand the product, thanks to the “black box” principle.\n4. The Goal: A Process of Ongoing Improvement. To build clear processes and avoid bottlenecks.\n5. Blue Ocean Strategy. Real examples of product development analysis in different business area and a clear explanation about competition principles\n\n# Explore the pain\n\n1) Get a job as a manager. The vacancy “sales manager” / “customer service manager” is perfect for starting:\n\n* In most cases, it does not require work experience\n* Learn how to sell yourself and your product ideas\n* Ability to identify customer pains\n* Improving communication skills\n* Finding optimal ways to solve the problem\n* Working with documentation and its creation\n\nIdeally, you need to get a job in a company that is connected with the IT industry. This will ease the way and give you the opportunity to grow as a PM within the company. You will know the audience and their pain perfectly and will be able to improve the company's existing products without any problems.\n\n2) Make your own business. A more complex, but at the same time a more profitable way for getting knowledge. It is not necessary to create a complex business with large risks and investments. You can buy socks in China and resell them on the local marketplace - this is also a business. Everything that you will do while creating a business will be relevant to your future profession.\n\n# Google it\n\nTo understand the development processes, you have to take an ordinary product and decompose it. The easiest way to do this is, to take the google.com search, but you can choose any other popular product (instagram, telegram, reddit). You need to understand what is happening inside the product: before, during and after using it.  \nTry to answer the following questions:\n\nHow this product works technically\n\nHow the design of this product works\n\nHow this product makes money\n\nYou need to focus on those keywords:\n\n* Technical:\n   * Frontend\n   * Backend\n   * API\n   * DataBase\n   * Programming language\n   * Server\n   * Analytics\n   * Platform (desktop, mobile)\n* Design:\n   * User experience (ux)\n   * User interface (ui)\n* Money:\n   * Advertisement\n   * Subscription\n\nThis is the end of part 1, thanks for your attention and i hope you learned something new. I would like to discuss this with you and have some feedback.\n\nNext time, i want to write about:\n\nIn Part 2:\n\n* about the terminology of product management\n* the stages of the appearance of the feature from idea to implementation\n* what is technical specification\n\nIn Part 3:\n\n* metrics and experiments\n* preparation for the interview",
    "title": "How to become a product manager? Advice",
    "subreddit": "careerguidance",
    "timestamp": 1688968876,
    "score": 16,
    "keyword": "japanese manager"
  },
  {
    "text": "Should I take a job opportunity offered by my current employer to work in Japan? Title says it, but I'm being requested to move to Japan to work at HQ for a few years starting in April 2024.\r  \n\r  \nBackground:\r  \n\r  \nCurrently work in sales and purchasing in the United States with 2 direct reports. Can speak business Japanese, can write Japanese using a keyboard, but can't read Japanese Kanji (Chinese characters) outside of those commonly used in emails.\r  \n\r  \nThey are wanting me to work in Japan to get some more experience so that I can come back and eventually be a higher level manager in the United States. I believe I will just be a regular sales/purchasing guy in Japan with no real direct reports for the duration in Japan.\r  \n\r  \nQuestion:\r  \n\r  \nWhat is the standard Japanese corporate life like in 2023? I know it has seen a lot of change after the pandemic.\r  \n\r  \nWhat would you do in my shoes, or have you ever been in my shoes before?",
    "title": "Should I take a job opportunity offered by my current employer to work in Japan?",
    "subreddit": "careerguidance",
    "timestamp": 1699766013,
    "score": 5,
    "keyword": "japanese manager"
  },
  {
    "text": "Not Passionate About Anything, But Want to Find a Suitable Path. What should I do? Hello Reddit,  \nI'm fed up trying to get a dream job and just want to start a career that generally makes sense with my background. I'm not particularly passionate about any specific field or industry, so I'm open to any and all suggestions.  \n\n\nHere's my full resume:  \n**Education**  \nJohns Hopkins University School of Advanced International Relations (SAIS) Master of Arts in International Relations (MAIR) Concentrations: Security, Strategy, & Statecraft, Asia  \nHarvard University International Security Certificate  \nDickinson College Bachelor of Arts, International Relations  \n\n\n**Publications**   \nDuchaine (2023). Could a 500-year-old treaty hold the key to peace in space? The Space Review. Duchaine (2023). Is China’s rise in space over? Indexing space power for the next space age. The Space Review. Duchaine (2023). Despite the Luna-25 failure, Russia is not a declining space power. The Space Review  \n\n\n**Experience**  \nCenter for Space Governance  \nFellow  \nJune 2023-Present   \nCollecting open source space launch, satellite, and budgetary datasets in excel to create a space power index to analyze the great power system (US, China, Russia, India, Europe, and Japan) for trends Drafting a policy-relevant brief on potential sources of conflict and cooperation between the US and China in the space domain  \n\n\nAmerican Forest and Paper Trade Association  \nInterim Government Coordinator  \nMay 2022-September 2022   \nCoordinated projects schedules, agendas, tasks, and meeting logistics to facilitate collaboration between AF&PA committees Copy-edited briefing papers and other relevant materials for Capitol Hill Organized meeting preparation to facilitate collaboration between AF&PA committees Maintained legislative tracking documents  \n\n\nManheim Central Middle School Special Education   \nParaeducator  \nSeptember 2020-June 2021   \nDelivered behavior management support and recorded behavior data to help special education students function in general education classrooms  \n\n\nMaine Representative Margaret O’Neil   \nResearch Consultant   \nMay 2020-September 2020   \nConducted a literature review and analyzed best conservation policy practices Drafted a policy guide to collaborative natural resources management between the State government and indigenous peoples to support Representative O’Neil’s legislation and committee work  \nOffice of U.S. Special Counsel Washington D.C. Staff Assistant January 2019-May 2019 Screened and verified visitors. Managed office space. Assisted with the complaint filing process.  \n\n\nUS Senator Angus King Policy   \nIntern   \nSeptember 2018-December 2018   \nConducted extensive legislative research and monitored news related to international affairs, science and technology, and the judiciary Drafted official correspondence on behalf of the Senator Conducted Capitol tours for constituents Provided general office management support, including sorting the mail, scanning and sending documents, and purchasing office supplies  \n\n\nCampbell, Campbell, Edwards & Conroy, P.C.   \nPaoli, PA   \nParalegal  \nJune 2018- September 2018   \nServed as lead paralegal for various lemon law cases for the firm.  \n\n\nGarmey & Associates  \nPortland, ME Law Clerk  \nMay 2017- September 2017   \nRead and summarized legal documents. Created a mediation powerpoint presentation. Edited deposition videos for viewing at mediation and trial, helping win over $2 million for our client.  \n\n\n**Community Service and extracurriculars**   \nAPO Service Organization   \nCarlisle, PA President September 2015-December 2018   \nLed a team of 30 to plan the annual fundraiser, bringing in over $400, an organization record Directed a marketing campaign that increased organization membership by 200% Ran weekly meetings, increasing attendance from on average 10 members/week to 40 members/week  \n\n\nDickinson College Model United Nations   \nCarlisle, PA   \nFounder, Vice President   \nFebruary 2017-May 2017   \nFounded the club and grew it from 2 members to 95 members Established the conflict simulation committee and planned 3 conferences in the spring of 2017  \n\n\n**Additional Information**   \nLanguages: Chinese Mandarin: intermediate mid, Japanese: intermediate low, Arabic: beginner",
    "title": "Not Passionate About Anything, But Want to Find a Suitable Path. What should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1693406065,
    "score": 6,
    "keyword": "japanese manager"
  },
  {
    "text": "How do you quit your stable job? \nI am working in IT industry for a foreign-invested  conglomegrate  in Japan.\nWe are funded from our parent company which located in my home country. \nLast year, I was transfered form the head branch to Japanese branch. Although it was my long-waited wish to work in Japan, i lost my enthusiasm overtime due to the remote social life during covid.\nThe first year was good, i had been continuing work in the same project by the end of 2022. Salary is okay, the depriciation of Japanese yen impacts my plan seriously though.\nAfter the project finished, i moved on some different projects. Then my nightmare started from April 2023. Few words about my project:\n- The requirement costs double the budget.\n- Due to the budget shortage, no bonus no rest no holiday.\n- My boss promised a lot with clients and left the rest of the work.\n- Management is so bad, i dont know what do they do. Go around and blame team members.\n- Our team is under a lot of stress\n\nI am so stressful and I think i almost reach my limit. Tbh, i though of sucidal. \nWith all of my determination, i decided to change my job and f*k my boss but the market is unactive that keep my from quitting immediately. \nI am worried that i can not get a higher paying job and lose all my status i have built here.",
    "title": "How do you quit your stable job?",
    "subreddit": "careerguidance",
    "timestamp": 1692407612,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "I have a weird life. How can I get a career out of it? I'm 19 looking for a good paying career or job. \n\nMy goal is to move to Japan at around 25. I'm already fluent but want more money to live good.\n\nMaybe a career that gets me to Japan?  \n\n\nI'm desperate because I don't like having my own company anymore. I'd like something stable with growth opportunities and fixed salary (or variable as commission).  \n\n\nAs mentioned in the title, since I was 14 I was working as a freelancer. So I don't have formal education. Dropped out of high school, too.  \n\n\nThis is my current Resume experience. I work from Brazil but have an LLC in the US so can work there.:  \n\n\n**Business Owner**  \nDec 2022 - Present   \nBrazil · Remote\n\n  \nConect acts delivering high-performing short-form digital media for creators, increasing their audience. (conectdigital.com).  \nAs Founder & CEO, I oversee our core strategies, product roadmap, ops, marketing, and planning.  \nRapidly grew from $0 to $15k MRR in 3 months using Outreach Lead Gen methods.\n\n  \nIn 2023 we gathered over 100M views for clients, averaging an increase of 200% views per client.  \nDeveloped automated cold and warm outreach strategies, referral systems, and paid ads to drive sales on auto pilot.  \nLeveraged Monday, Adalo, and Zapier to automate workflows and reduce costs, increasing workflow speed by 80% and saving up to $3000/mo in costs.\n\n\\--\n\n  \nCompany 2  \n2 yr 1 mo  \n**Director of Operations**  \nFull-time\n\n  \nStreamlined workflow management within Monday.com, automating processes with Zapier, increasing efficiency by 50% and cutting employee costs.  \nManaged the entire production department, optimizing their workflow and reducing expenses by 30% in 1 month by changing their compensation method.  \nCollaborated with the CEO and CFO for strategic planning, targeting lowering costs while maintaining video production levels.\n\nStreamlined workflow management within Monday.com, automating processes with Zapier, increasing efficiency by 50% and cutting employee costs. \n\nManaged the entire production department, optimizing their workflow and reducing expenses by 30% in 1 month by changing their compensation method. \n\nCollaborated with the CEO and CFO for strategic planning, targeting lowering costs while maintaining video production levels.…see more  \n\n\n**Freelance video editor**  \nMar 2017 - Aug 2022 · \n\n  \nEdited 15,000+ videos ranging from YouTube videos to mainly Short-Form content.  \n\n\n  \nI have very high linguistics skills, as I got fluent in English in about a year or so, and fluent in Japanese in 2 years and a half.  \n\n\nAlso, very high level artistic skills in music and arts as painting and drawing. I've sold some before.  \n\n\n  \nPlease help me.\n\n&#x200B;",
    "title": "I have a weird life. How can I get a career out of it?",
    "subreddit": "careerguidance",
    "timestamp": 1699653919,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "I worked hard for a career and I'm throwing it away. How do you just do your job and care about it? TLDR: Im a jack of all trades who never commits to things. I forced myself to get my life together in the last few years, start holding down jobs, consistently workout and finally do a 3 month coding course. I thought I was improving. Got a coding job from that and in 2022 I stopped working. Nothing motivates me and I hate remote work. Now I've lost the job, need a new one but I don't think I will ever be able to keep a job and care about it. I want to know how people manage to just have a job and do well at it. Thanks.\n\nHi. I am a jack of all trades sort of creative person who never finishes anything. I have a degree in Japanese, I'm a good writer but I don't finish things, I'm an okay artist etc. But generally I do not commit to anything, and start to avoid things as soon as I achieve any success in them. I learnt japanese on my own very well but when I started my degree I immediately stopped studying for example.\n\nIt took an extreme change in mindset in 2019 to get me to actually finish my degree, because I had been not engaging and handing in everything late. I put in some solid strategies that helped me and started going to the gym regularly. After that, 2020 messed me up but in 2021 I decided to take my adult professional life into my own hands and I quit my job (which I was about to get fired from), moved home and did a 3 months software engineering bootcamp. I did it because I had wanted to learn to code when I was a kid and I heard it made a lot of money. I've always been poor and I realized I needed money to improve my life.\n\nI coded basically 12 hours a day Monday to Saturday and worked a job on Sunday. I was single focused and felt pretty alive and like I was finally focusing on useful stuff to move my life forward and I might end up with a respectable career and some money. I had an anger that drove me to be better and push forward. I also destroyed my health a bit but I bounced back in a month.\n\nIn February 2022 I started a software engineering job, in March I moved back to the city where my friends are. Felt like a success. My job gave me little work to do, no deadlines and I had no in person contact with my co-workers. I was also pretty comfortable and no longer angry. My mental health felt stable for once. I proceeded to do nothing for a year. Every day sitting in my house doing 1 hour of work and wiggling my keyboard. Feeling guilty so not actually enjoying other things except the gym which is probably the only productive thing I can do consistently.\n\nAt the start of this new year 2023, my contract is not going to be renewed at my company so I have to find a new job. I have to decide whether to renew my expensive apartment contract without knowing if I'll be able to afford it. If I can't I'd have to move home again to the middle of nowhere. And so there's some fire under my arse to study and get another job. But I don't see the point... \n\nI feel like it's not going to work. I have proved myself incapable time and time again of consistency. I either am very focused or I fail to even do the bare minimum. I don't seem to be able to just do what is required to not get fired. I have to feel a lot of pressure or a lot of passion. I can't imagine ever caring enough about any job to do it. No normal motivators seem to work on me. And the fact that remote work is the norm now is destroying me too because I don't even have the social environment to make me feel engaged. Every year since 2019 I felt like I was making improvements in preventing myself from sabotaging my life but I have managed to undo them in 2022. The only thing that's stuck is gym. I literally worked hard for a job and then threw it away as soon as I got it. Sometimes I think, what if I stopped trying to have a sensible career and starting doing some crazy creative passion project and it would probably be more successful just because I would be able to give a single ounce of care about it. I hate being told what to do and I think companies are evil and soul crushing. I cannot bring myself to care about a company doing well. I also used to love tech but I think it is destroying our lives these days and we need to stop innovating at the expense of the planet. But I think I can't even stay consistent on a career in something more fun. I think I'd just grow to hate it, or grow to hate myself from lack of consistency. Honestly the only thing that motivates me is thinking women might like me more if I'm successful, and a general fear of dying in irrelevance. I'm obsessed with self improvement but it doesn't stick.\n\nHow do you people just do jobs?\nDoes anyone else feel this way?\nWhat do I do?",
    "title": "I worked hard for a career and I'm throwing it away. How do you just do your job and care about it?",
    "subreddit": "careerguidance",
    "timestamp": 1672768291,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Fresh Grad, Complex Background, Wit's End Hi. I'm a non traditional student. I dropped out in 2012, struggled with drug abuse and video game addiction for a while, went back to community college in 2017 then finally finished a Bachelor's in physics in May 2023.\n\nWhile I was in school I managed to land a part time software engineering role at my college that lasted for two years until I graduated. I like writing code, and the physics research culture scared me so much that I decided I wanted to do software engineering after I graduated instead of pursuing grad school. I have zero internships, only my part time experience.  \n\n\nI've been applying to a lot of places over the summer (admittedly, not enough, somewhere around 80\\~ apps sent so far since May), and I've had no luck.\n\nI had one interview back in May that I screwed up because I didn't have the right mentality.\n\nHad another interview last month and it went well. I accepted a formal offer contingent on an interim security clearance, but today my clearance was denied and the offer was rescinded.\n\nI used a lot of psychedelics/stimulants/marijuana up until 2018, and I have some casual use in the intervening years.  I'm not proud of it, but I'm honest about it. I have no criminal record, I can pass a drug test, and drugs have not been a part of my life for a long time; but I feel like it will be many years before I'm eligible for the kind of clearance I need to work in the fields where my skills and background are the most desirable.   \n\n\nI'm kind of at a loss right now.\n\nI don't know if I should persist in hunting for software jobs or if I should apply for grad school instead (my interest in physics is coming back now that I've been out of school for a few months and my grades were decent, but I don't have the kind of research experience that grad programs are looking for).\n\nI'm in a data science program right now that will pay part-time in the upcoming spring, but at this point my savings are running out and I need to find part time work so I can continue supporting myself. I'll have less time to skill build.\n\nI also screwed up this summer, thinking I'd be able to get a job on the weight of my resume alone. I spent a lot of time studying Japanese instead of focusing on skill building and putting together a portfolio.\n\nThe problem with skill building though? The market seems extremely uncertain right now, at least to me. There's a lot of fear in regards to AI and LLMs and the kind of roles they will erase. Lately I've started to see posts about a lot of entry level positions getting canned because management is enabling senior devs to use AI to become more efficient.\n\nShould I refine the skills I learned as a part timer (web dev) and continue to look for jobs in that area? Should I go all in on data science and machine learning?  \nHow do I take a miscellaneous problem domain and turn it into a career?  \nI can never seem to follow through on long-term personal projects, and I'm having difficulty putting together a portfolio of even mediocre quality. I'm so nervous that the skills I'm investing in will be worthless by the time I finish acquiring them, and it seems like every employer only wants to hire someone with experience on their specific tech stack right now. It makes it hard to commit to anything.\n\nI don't know how to proceed and it all seems so futile right now. I feel like it's impossible to compete with my peers. They're all younger, cleaner, and seem to be natural talents; or they're older and have superior breadth/depth of experience.  \n\n\nHelp.",
    "title": "Fresh Grad, Complex Background, Wit's End",
    "subreddit": "cscareerquestions",
    "timestamp": 1700249652,
    "score": 4,
    "keyword": "japanese manager"
  },
  {
    "text": "What career advice would you offer up outside of the usual? Thinking about things around soft skills, choosing good companies, and other stuff that most of us have had to learn through trial and error.\n\nFor me, it would be \"Learn another language if at all possible.\" It will open more opportunities for you at higher levels, and it also gives you a broader base of cultural experience making you that much less prone to biased solutions.\n\nWe like to say English is the language of coding, and that's true to a point, you don't need another language to be a junior or mid-level engineer in most places. But, unless you plan on staying in a strictly English speaking company with only English-speaking clients, you will find that if you want to be a senior dev, or an engineering manager, at many companies, English-only can hold you back. \n\nMy experience of school in English speaking countries was that we don't prioritise learning another language. Here I am now, I live in Europe, I'm thinking about going to Japan, I *should* be going for high level engineer roles or engineering manager roles. But so many of the amazing opportunities I see, will require me to be fluent in German, or Japanese because, at that level, I'm not just coding, I'm talking to clients, stakeholders, etc. Most devs around me know three or more languages. It's a huge benefit for them.",
    "title": "What career advice would you offer up outside of the usual?",
    "subreddit": "cscareerquestions",
    "timestamp": 1697626438,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "[Advice needed] Becoming \"Tech Lead\" (infra/cybersec) Hi everyone,\n\nFirst of all sorry in advance for my broken English.\n\n \n\nI may need your help regarding a big turn I am about to make in in my career path, since I’m not super experienced yet…. this is a tough decision.\n\nI’m currently in the middle of a heavy recruiting process to possibly become “Technology Lead” for a big foreign company in Japan.\n\n(It is not specifically related to programming/software stuff that could usually be when talking about “Tech Lead” in the IT industry. It is more related to Infra/Cybersec fields.)\n\n\n \n\nThe mission in summary:\n\n\n▪︎My boss will be the director of IT in Japan\n\n▪︎Nobody below me (the team may grow later), my main associates will be the Tech lead located in other countries (China, HK, Singapore, etc…)\n\n▪︎Will constantly interact with technical experts and with business/application teams in order to drive projects\n\n▪︎Will work as a bridge/point of contact between local infra teams/vendors in Japan, regional IT teams (Asia) and central IT team in Europe/US\n\n▪︎Have to stay aware about technologies, cybersecurity, infrastructures, services, etc…\n\n \n\n\nMy situation now:\n\n\n▪︎Just turned 30 (last 6 years in Japan so at least I know the working culture in the country)\n\n▪︎9 years of experience as infra engineer (different domains such as system and network), with good tech knowledge now\n\n▪︎No real experience with having high responsibilities\n\n▪︎No real experience in project management, leading meetings, etc…\n\n▪︎Can speak 3 languages including Japanese\n\n \n\n\n\nLooks like it will be 50% technical stuff (teams tech support, etc…) and 50% management/coordination (projects, meetings, etc…).\n\nInside the technical field I can expect around 30% of cybersecurity related subjects.\n\nI think that I can adapt and learn quickly but nonetheless the mission might be very challenging to me.\n\n \n\nIn your opinion, what kind of task/BAU I can expect to have ?\n\n \n\nI am confident about handling the technical and communications part but even if I don’t fear challenges, I don’t want to drown since I am kind of “junior” in management/organizational domain.\n\n \n\nHas someone have similar experience to share ?\n\n \n\nAny advice is welcome\n\nThank you!",
    "title": "[Advice needed] Becoming \"Tech Lead\" (infra/cybersec)",
    "subreddit": "cscareerquestions",
    "timestamp": 1676527750,
    "score": 1,
    "keyword": "japanese manager"
  },
  {
    "text": "Entertainment company or Aerospace company, which offer should I take? My(26f) current company is Japanese entertainment company. I worked here for 3 years as account payable and currently make $48k.\nAfter my husband got job at well known aerospace company and started making six figures right out of college, I decided I’m ready to level up my skills by getting a degree.\n\nI started pursuing accounting degree this March. The college is fully online(WGU).\n\nSeveral company reached out to me after I  put my college information on LinkedIn as I also started applying to similar position with more responsibility. I ended up landing offer from two very different companies.\n\nCompany A is in similar business to my current, focused more on licensing of the Japanese stuffs they make. They were looking for staff accountant. Direct report will be made to accounting manager who is willing to teach me from scratch, offering to be a mentor for my accountant journey. They will allow me to build experience as an accountant immediately. Basic benefits. Slightly less PTO than current. Will accrue more based on years worked. Same pay as current.\n\nCompany B is an aerospace start up. Different aerospace company from my husband’s. when I first decided to pursue accounting, we talked about how it will be cool if we can both work in aerospace industry. Direct report will be director of finance but my position will be mix of account payable and procurement. I will not be doing much direct accounting stuffs but higher starting salary (+$15k), flexible PTO, equity bonus. \n\nJoining either of the company will allow me to build relationship with great mentor. They both have snacks and drinks I can have while I work. \n\nTLDR: I recently started accounting degree and received two job offer. One as staff accountant with basic benefit, second as account payable and procurement specialist with higher pay.\nWhich offer should I take if I really want to reach 6 figure asap?",
    "title": "Entertainment company or Aerospace company, which offer should I take?",
    "subreddit": "Accounting",
    "timestamp": 1687570332,
    "score": 2,
    "keyword": "japanese manager"
  },
  {
    "text": "Advice for Taking care of my hair from scratch Hi guys,\n\nI hope you are doing well. I'm going to start my natural hair care journey and instead of me posting pictures of my hair I'm going to ask you guys some general questions and see if anyone can guide me to some youtubers, tiktokers, instagrammers, etc or just give me some advice.\n\nI've been wearing a turban and want to start showing my hair. Right now I'm just in a cycle where I keep cutting off my hair cause I get frustrated and wear my turban. I'm also embarrassed cause my hairline is bad and I'm East African so we know I have a big forehead lol. \n\nI know that I want to buy Jamaican castor oil and hair grow serums to fix my hair line. I'm thinking of also just cutting my hair off completely and making it all small and even. ' I've been using kitchen scissors to just cut my hair off and keep it manageable so I can put it under my turban. I don't know if I should just cut it this time properly with my kitchen scissors or buy a buzzer hair cutter so I can cut it properly. \n\nI just don't know what to do when my hair grows out. Long term I do want to get it braided. But as of right now I don't know day to day what to do with it. Right now I'm just washing my hair with shampoo and then using conditioner. I do this once every other day. \n\nOverall my questions are:\n\n\\- Should I buy a razor so I can completely cut my hair short and make it even, or would I be able to achieve the same effect by still using my kitchen scissors?  \n\n\\-  How are you guys taking care of your hair day to day?  Like I know I don't have the type of hair type where I can just quickly comb it and go. Do you guys have any youtubers or anyone you are getting advice from?  I would say my hair type is 4a-4b?\n\n\\-  Has anyone had any success in fixing their hair lines? I remember there was a hair serum that went viral on twitter back in the day I think it was from an Asian ( Japanese?) brand. I'm sure I have it saved somewhere in my photo album but I'm curious if anyone has any serums that have worked for them?\n\nThank you :)",
    "title": "Advice for Taking care of my hair from scratch",
    "subreddit": "blackladies",
    "timestamp": 1678745896,
    "score": 3,
    "keyword": "japanese manager"
  },
  {
    "text": "I'm Japanese and starting a new hotel job. There are Japanese businessmen staying for the whole month! I recently got accepted at a front desk position at a nearby hotel. When I walked in for orientation I saw asian men in suits working on computers in the lobby. It really sparked my interest. When I asked the manager about them, he explained that there are Japanese people on business trips staying at the hotel. I was thrilled! I often feel lonely in Pennsylvania because I'm one of the very few Japanese Americans who live here. \n\nAfter the orientation I walked back to the lobby and saw two guys left. I could clearly hear one of them on the phone speaking our language, and when he hung out, I calmly approached them and began speaking to them in Japanese. They were completely caught off guard! Now I'm not fluent in Japanese, but they really appreciated my efforts. I told them how I'm a new employee who will be working here and we talked about our culture for a bit. I cannot wait to start training tommorrow!",
    "title": "I'm Japanese and starting a new hotel job. There are Japanese businessmen staying for the whole month!",
    "subreddit": "asianamerican",
    "timestamp": 1702104458,
    "score": 278,
    "keyword": "japanese manager"
  }
]