[
  {
    "text": "[F27, UK] Wannabe journalist. Disabled, highly qualified, can't drive. No career progression opportunities. Where should I go? I work as an administrator for a national charity in the UK and, since applying for a part time job to support my MA (Japanese), I have remained in the same 18 hour job as I have been for the past 3 years.  I am paid the UK 'living' (a.k.a. minimum) wage of £7.50 per hour, meaning I live off around £7,000 per year and the occasional food bank during Christmas. I have qualifications outside of my MA and 8 years of positive working experience, with some really good references from organisations I previously volunteered/worked for.\n\nI fulfill my duties every day on shift promptly and to a high standard.  I also try and create jobs for myself while I am working. Nevertheless, I am also very skilled copywriter, and although that's not my job (I am just an Admin Assistant on paper)  I get frequently approached by the PR managers and journalistic types in work on how to do jobs, which is something I am happy to do, and I get a lot of positive comments about my work.  Never have I turned one down as that's ultimately what I would love to be - a journalist.  And I am great at that - I have wrote plenty of articles for our website that have generated 12 times more positive hits than our usual articles.\n\nI know it's ridiculously competitive; that's why I have done a plethora of courses both inside and out of work to try and refine my skills. That's not what scares me.  What I find frustrating is how when I try and apply for opportunities within and outside of work to progress (or even create my own opportunities), I get told that my career choice is 'unrealistic' because my disabilities would 'limit' me greatly.\n\nThe context, I guess, is this:  I have a disorder which impairs my peripheral vision, meaning I can't track travelling items or judge their speed.  I have tried driving lessons before and although I know perfectly well how to get a car running, I cannot track other people's behaviour well because of it.  I am also a lady with Asperger's Syndrome and, although my work would never know this one, I also have PTSD. Neither of these two stop me from doing my job in the slightest, but I have been subject to discussions where people say 'because you have Asperger's, you don't understand'.  \n\nIt's frustrating! Argh. Furthermore, any attempt to suggest avenues for further training typically gets turned down because 'it's not relevant' to my job. \n\nI would understand if I were a bad employee, but the reality is, I am not when I think about it.  I volunteer my time constantly, I take on new challenges.  A bit like that person you know in work who just cannot say \"no\".  I have been told by these same people that I am an 'ideal employee', yet...\n\nI know it's time to leave. I don't feel valued and I know they either cannot or will not allow me to develop into a positive role for them, which is a shame because I know I would be useful.  My question is, where to?  What kind of jobs in journalism (or fields related to journalism) would even consider hiring someone outside the capital who cannot drive? \n\nDoes anyone out there have any connections, ideas or suggestions?  Even some constructive criticism?  I know that at times I can miss the bigger picture, so if anyone out there can give me any kind of clue, even if you think it's harsh, please tell me!",
    "title": "[F27, UK] Wannabe journalist. Disabled, highly qualified, can't drive. No career progression opportunities. Where should I go?",
    "subreddit": "jobs",
    "timestamp": 1499201004,
    "score": 1,
    "keyword": "japanese judge"
  },
  {
    "text": "Experienced a ton of sexism and racism in South Korea and need to vent You'd think this was a more appropriate post for the country's sub but, having read so many ~~white men~~ people there apologize for racism, I thought the sexism aspect would at least be appropriate here. **TL:DR at the bottom.**\n\nIt's probably my fault for not reading up on the 'bad' aspects of Korean culture, but I don't know many people who look for those things before visiting a country that has a modern-looking society. Being half Asian the racism and sexism I receive from my mother's homeland is minimal and tolerable. At 5'8\" I stand out. My plain features, brown skin and lankiness draw judgement because 'mixies' are meant to be pale and have more Anglo features. My bad. \n\nAnyway, my stay in Hong Kong and Taiwan was dope. So much to see and so much good food to eat! Shopping was cheaper than back home. Nice. The last leg was South Korea, the source of my mother's beloved K-Dramas and my opportunity to see snow for the first time. What I actually experienced was the opposite of dope. \n\nIt started as I got off of the plane. By far I was the tallest woman there. I stood near the exit and three people approached from behind whispering. I turn around to face my friend and the group glances at me with an audible sigh 'oh, negro'. It was a shock to hear someone refer disdainfully, out loud, to a person as negro. I wondered if they were seeing people who had dark skin or were African (American) around. When there was no person with brown skin other than myself close by I jumped to the conclusion that they might be talking about me and judged based on my features - big lips, booty and wide-ish nose. I dismissed it as me imagining things. \n\nThe next day I was in Meyongdong, a big tourist area, near my hotel. We rushed about and it was packed with stylish people and all the cheap makeup and street food we wanted. As I got bored I tuned in to the crowd around me. So, FYI, the locals LOVE to stare and make comments about foreigners in Hangul, and if they really want to speak their mind a descriptor or two in English as you walk by. By the time I made it back to the hotel I'd been called Japanese (called, not asked) and Chinese and Americano (anyone who can speak English) and... ni**er, once. I saw an African family on a train later with such miserable looks on their faces that I wondered if they were getting the same treatment.  \n\nNow sexism and internalized-mysogyny. Going in I knew Korea has impossibly high beauty standards and I was not exempt from judgement; not that I could hide given I was taller than most people as well as having brown skin. I believe women did not like that I was tall and thin as that is a huge ideal and the vast majority are smaller than 5'8\". Two other girlfriends who were with me have typical Asian height and features and were mostly ignored. Men especially didn't like that I was tall. Contrary to reports, Korean men did not appear any taller to me than other Asian men. So while women laughed as I walked by and grabbed their boyfriends to drag them further away, men got aggressive, like intentional shoves in crowds and 'tch-ing' as they would walk past. Old men turned around after seeing me as I approached. If I stood next to them in a crowd they'd move elsewhere. A kid walked by and called me a giant monster as his parents smirked. It was bewildering how frequent and constant this behavior was. Almost everyone I walked past was laughing or giving dirty looks. Even people some distance away. Christ. By the end of my 2nd day I tired of what was happening and concluded this was top of the range sexism and racism. [I Googled this shit and found that I wasn't alone and the issue is swept under the rug.](http://ireport.cnn.com/docs/DOC-1221602) [Open discrimination is not legislated against and foreigners complaints are dismissed](http://www.koreaobserver.com/nearly-all-foreigners-victim-of-discrimination-in-seoul-29001/). Great. Also found out that speaking English when not white invites scorn for being a snob and 'better' than Koreans, which they mocked me for too. Another layer of bullshit to deal with.\n\nOn the 4th day I had enough and stayed in my hotel. It was great tbh, but my travel companions who had typical Asian appearances thought I was crazy. I was fine with watching action movies all day instead of looking at the ground to try in an attempt to hide myself.\n\nBy the 7th day I was willing to face the music and go on the DMZ tour, which was amazing, then I had dinner and it was back to the bullshit. I decided to go out for the remaining couple of days anyway as I had recharged my spirit staying in the hotel and wanted to see what I could, which was a bad decision. I only remembered Gangnam was the capital of superficiality once I saw all the plastic surgery ads in the train station. Walking around there the laughs were louder and the men yelling 'You're a big girl!' was just enough evidence for my friends to start believing me. \n\nBy the end I was emotionally worn down. I was happy my flight was early morning but the abuse from other Korean travelers continued until I got off the plane in Singapore. The biggest irony was sitting in the departure lounge as a Korean woman walked past with a bag that said 'RACISM' with a cross through it. If I weren't so demoralized I would've laughed. \n\n**TL:DR - Beware of rampant, open, sexism and racism in Korea, and by all means do not be brown, tall and female. People defend Korea's nationalist monoculture and say 'you just have to deal with it' but you'd think there'd at least be some tiny courtesy to keep the racist and sexist comments quieter. Even sadder is that it's being taught to children. I don't hate Korea, it's a beautiful country, but I wish their culture did not foster so much ignorance. For *anyone* visiting there you'll need something tougher than thick skin.**",
    "title": "Experienced a ton of sexism and racism in South Korea and need to vent",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1484496487,
    "score": 4,
    "keyword": "japanese judge"
  },
  {
    "text": "Romance is dead There is a widespread misconception that women are hopeless romantics.   Turns out it's the other way around.  \n\n>So let’s start with how men and women score on the most well-known measure of romanticism, the Romantic Beliefs Scale.2 This questionnaire asks people to rate the extent to which they agree with statements like, “There will only be one real love for me,\" “If I love someone, I know I can make the relationship work, despite any obstacles,\" and, \"The person I love will make a perfect romantic partner; he/she will be completely accepting, loving, and understanding.”\n\n>The researchers who developed the scale have found that, on average, men outscore women\n\n[Source](https://www.psychologytoday.com/blog/close-encounters/201408/whos-really-more-romantic-men-or-women)\n\nAlas, the dual assaults of feminism and globalization are leaving huge numbers of men with no romantic prospects.   Why?   Because despite what feminists initially claimed, hypergamy doesn't suddenly disappear when women achieve financial stability and increased social status.   \n\n[Article](http://www.cbsnews.com/news/why-men-are-having-problems-getting-married/) from CBS notes:\n\n>That meshes with the problems facing younger American men who lack college degrees. In 1990, more than 17 percent of men between 18 to 39 worked in manufacturing, but by 2007 that had declined to about 11 percent, Autor and his co-researchers found. Fewer job opportunities reduce “the supply of young men who would likely be judged as **good marital prospects**,” they noted. \n\n>It’s not only that young working-class men are less marriageable when jobs dry up, but that some of these men are actually disappearing, the paper noted. \n\n>Where are these young men going? Many are turning to risky behaviors such as heavy drinking and drug use. Trade shocks are leading to higher mortality rates for young men, which explains some -- but not all -- of the imbalance. Young men are also disappearing because they’re incarcerated, homeless or migrating to other areas to find better job opportunities. \n\nSo in other words, working class men are doing horribly.   \n\nBut not to worry gents, just as feminists are determined to create gender equality in the political and legal spheres (cough), they are doing their best to help working class men achieve decent employment and therefore a chance at having a happy relationship.   Oh wait...\n\n>A \"man-cession.\" That's what some economists are starting to call it. Of the 5.7 million jobs Americans lost between December 2007 and May 2009, nearly 80 percent had been held by men. Mark Perry, an economist at the University of Michigan, characterizes the recession as a \"downturn\" for women but a \"catastrophe\" for men.\n\n>Last November, President-elect Obama addressed the devastation in the construction and manufacturing industries by proposing an ambitious New Deal-like program to rebuild the nation's infrastructure. He called for a two-year \"shovel ready\" stimulus program to modernize roads, bridges, schools, electrical grids, public transportation, and dams and made reinvigorating the hardest-hit sectors of the economy the goal of the legislation that would become the recovery act.\n\n>Women's groups were appalled. Grids? Dams? Opinion pieces immediately appeared in major newspapers with titles like \"Where are the New Jobs for Women?\" and \"The Macho Stimulus Plan.\" A group of \"notable feminist economists\" circulated a petition that quickly garnered more than 600 signatures, calling on the president-elect to add projects in health, child care, education, and social services and to \"institute apprenticeships\" to train women for \"at least one third\" of the infrastructure jobs. At the same time, more than 1,000 feminist historians signed an open letter urging Obama not to favor a \"heavily male-dominated field\" like construction: \"We need to rebuild not only concrete and steel bridges but also human bridges.\" As soon as these groups became aware of each other, they formed an anti-stimulus plan action group called WEAVE-- Women's Equality Adds Value to the Economy.\n\n[source](http://www.weeklystandard.com/no-country-for-burly-men/article/17737)\n\nFor a group of people who so often call themselves \"socialists\" they sure seem hellbent on harming working class men.   There is however a silver lining to the death of romance.    Thanks to feminism marriage no longer provides any benefit to men, and on the contrary is an exceedingly risky proposition.   Therefore working class men are ultimately being spared a life of misery.   \n\nStill, being alone is another type of misery.   In one sense men are being freed, but on the other the loss of love is tragic.   Most men aren't suited to monk lifestyles.   They are being forced into this position out of a combination of hypergamy run amok and anti-male laws.   \n\nLest there be any confusion, working class men are not some minor part of the economy.   They are the people who maintain civilization.    \n\nUnless the MRM succeeds, I anticipate that the Japanese herbivore phenomenon will rapidly go global.   It may spread so quickly that people won't even realize what's happening before it's too late.   When I first saw Karen Straughan's video \"Fempocalypse\" I assumed she was engaging in hyperbole.  Now I'm not so sure...",
    "title": "Romance is dead",
    "subreddit": "MensRights",
    "timestamp": 1488279889,
    "score": 53,
    "keyword": "japanese judge"
  }
]