[
  {
    "text": "So... my former students passed on a rumor that my former Dean/AP didn't like me and was intentionally giving me a bad reference I happened to run into some of my former students at the mall today.  They passed to me a rumor that the AP of my former school didn't like me and wanted to give me a bad reference.  One of the schools I applied for required you to put the name and contact info of the Principal.  But since I didn't have much contact with the Principal on a daily basis, I think they must have referred them to the AP instead.\n\nI used a reference checking service on all my listed references (a former department head, a PTA president, a coworker, and a Head of Academics) and they all said great things about me.  I've maintained close relations with them.  For example my Department Head got me one-on-one clients in my neighborhood for tutoring.  My wife teaches the PTA president's daughter Japanese.  My coworker and I have referred each other for jobs and so on.\n\nSo it turns out that what I've been suspecting for months might be true.  Someone who for whatever reason held a grudge against me actually is trying to portray me in the most negative light possible.",
    "title": "So... my former students passed on a rumor that my former Dean/AP didn't like me and was intentionally giving me a bad reference",
    "subreddit": "Teachers",
    "timestamp": 1561320152,
    "score": 11,
    "keyword": "japanese principal"
  },
  {
    "text": "Teaching is wearing me down to the point where it's unhealthy. What careers should I look into? I've been a teacher for 6-ish years now.  I've taught a weird variety of things (French, English, computer, Bible, art, etc.), to every grade K-12, at public and private schools.  My default is to say, \"I love it,\" but I'm really questioning that now.  What I know for sure is that **I need at least a year away from teaching to see if I'm healthier in a different career**.  I have a lot of feelings about this, so I'll bold what's important and you can skip the rest.\n\nPositives and negatives of my experience as a teacher:  \n\\+ The public school parents were very supportive of me and quick to straighten out their kids if they had issues.  \n\\- The private school **parents** are downright cruel to my coworkers and me.  Their kids can do no wrong and they demand that we make good grades happen.  Picture the \"I demand to speak to your manager!\" lady, but there are dozens of them and they have kids and I'm responsible for parenting them because the Karens won't.  (Have I got STORIES.)  \n\\+- Dealing with those parents is manageable when I have a very supportive principal who backs me up.  When I don't (and we have a lot of turnover, so it's very on and off), I'm kinda screwed.  There's no winning with Karens.  \n\\+ The private school kids are, for the most part, absolutely amazing.  They work hard and are respectful.  Some days we have serious life discussions, occasionally we have a turtle dance party.  It's like a big family.  \n\\+ The public school kids were sweet in their own odd ways, like drawing me as Big Fat Meany Mrs. Puff or shooting spitballs at me in the cafeteria.  No, really, they meant these things as compliments.  \n\\- The public schools where I've worked had daily fights.  I'm not intimidating enough to deal with those, and it made me so sad when a sweet kid would get beat up just for being different.  There were so many issues I couldn't begin to help with, and with 30 kids in most classes, I had to just keep teaching even if a girl's eyes were bloodshot from drugs or a boy had his head down because his dad got angry again last night.  \n\\+ I love kids.  I get so attached to them that I cry at the end of every school year.  I want to adopt every one of them.  \n\\+ Teachers are pretty fun to be around, honestly.  I've made some great friends among my coworkers, and I've learned a lot about life from others.  At my current job, it's like a family too.  We get together at the math teacher's house twice every summer for a homemade lunch, and at work we laugh 'til our faces hurt.  Also nice: the nature of our job makes it so we have to keep safe boundaries in our conversations, so awkward oversharing really doesn't happen much.  \n\\- Things change every year.  Change is good, but in teaching, it's mostly **pointless annual changes**.  A new lesson plan format, a new buzz word to learn, blah blah.  There's so much we should be changing, but instead we change the language of it.  I gave up on even keeping my lesson plans from one year to the next because trying to adjust them to the new formats took longer than starting over.  Like, I get that the non-teachers in charge of education get bored, but *stahp.*  \n\\- *Non-teachers are in charge of education.  I would like to personally kick each one of them in the shins.*  \n\\- There's no end to the work.  From student teaching through my first or second year of teaching, I hardly slept.  (Part of that was typing *pointless lesson plans*, but that's beside the point.)  Teaching is a job where you could work 24/7 and still not be providing the ideal education.  **There's always more you could/should/would be doing**, always lessons to improve, always activities/games to create, always differentiation to implement, always parents to email, and every individual kid needs individual help.  I had a really strong work ethic until I taught for a while.  Now I know it's partially in vain, because...  \n\\- Both my jobs teaching French have ended because I didn't increase the numbers enough.  Here's the thing: At my first job, I *doubled* the enrollment in French.  They said I should have tripled it.  At the second job, we only offered French at first, so everyone took it.  They added Spanish while the school's numbers were too low, so my classes shrunk drastically.  I worked hard to create an exploratory program to get kids excited about French, and I was going to have a decent French 1 this year.  But they said it wasn't enough.  \n\\+ Summers and weekends off, yo.  \n\\+ I love that teaching makes it so easy for me to **encourage** and help people.  At the first job, I was in the Sunshine Club and we would just do little things to cheer the kids and teachers up every so often.  At my current job, I've done things like decorating the halls, writing encouraging notes to kids, and cheering the kids on at games.  It gives me life.   \n\\+ I have a lot of fun with the creative side of teaching, on the rare occasions I have time for it.  I paint posters for each individual volleyball player, make decorations for the classroom, stuff like that.  **Doing some art on a regular basis is good for my health.**  \n\\- The **pay** is seriously problematic.  At the public school, I made a totally reasonable salary and had benefits and retirement.  At the private school, I make $21k per year.  No benefits except a little bit of help with health insurance.  I can only afford to work there because I have extremely low rent.  \n\\- **The job is so mentally, emotionally, and physically exhausting that I don't think it's healthy for me to stay much longer.  I get home some days and almost fall asleep in my driveway because I don't have the energy to get out of the car.  There are so many late nights required for school functions.  I don't have the time or energy to plan meals, cook healthy food, or exercise.  Some years are marked in my memory by crying on the bathroom floor trying to get ready for work, wanting a day off so badly, then crying at my desk when work ended.  To be fair, I do have major depression, and it's better now with treatment.  Still, my energy and motivation are very low and I've been really questioning whether a different career would help me manage.**  \n\\+ And the thing is, I do enjoy teaching.  I like teaching people things.  I feel warm fuzzies when kids can do something new that they couldn't do yesterday.\n\nWhat I'd look for in a new job:  \n\\+ Working for people who don't feel **entitled** to treat me like a bag of dog poop  \n\\+ **Fun** coworkers who keep professional boundaries  \n\\+ The company is well **organized**  \n\\+ **Clear** expectations  \n\\+ **I don't take work home** / I can have a life outside of work / once it's done, it's done  \n\\+ Salary that **pays the bills**, lets me get my teeth fixed, and allows me to **retire** (preferably early if I invest)  \n\\+ Somewhere I can be **creative**  \n\\+ Somewhere I can **help/encourage** people.  Even if the job itself is mundane, I want at least a workplace where I'm allowed to do small, kind things for the people around me.  \n\\+ I'd be cool with having the option to do overtime work.  Heck, getting paid to work late is a totally novel concept to me.\n\n**I know it makes sense for me to get a job working with kids, but I'm thinking I'll do that on the side.**  Maybe help at a youth group or something.\n\nSkills I have:  \n\\+ **Typing** (100+ wpm, personal best 141)  \n\\+ **Writing/grammar/English/editing**  \n\\+ Kind of **psychology**.  I had some psych in college.  I've been through a lot and worked with kids who also have emotional issues.  \n\\+ **Art** (traditional and digital, but I'm no professional)  \n\\+ **Photography** (more the artsy side than the technical side, until I can take a class)  \n\\+ Fluent in French, but not sure I want to use it  \n\\+ Dealing with difficult people  \n\\+ **Computer** stuff, to an extent  \n\\+ **Teaching**, obv  \n\\+ **Working hard** at both tedious and challenging projects  \n\\+ I'm kind of an idea person?  \n\\+ Staying **calm**\n\nInterests:  \n\\+ **Video games** (my #1 favorite thing)  \n\\+ **Learning languages**, especially Japanese, Korean, maybe Italian, but really anything  \n\\+ **Writing** (I want to write YA books eventually and would also consider writing articles of some sort)\n\nWeaknesses:  \n\\- I'm very **honest**, so I have to work for something I believe in, even if it's just toothbrushes that definitely brush teeth.  \n\\- My face shows exactly what I'm feeling  \n\\- I get **migraines** from: being on the computer too much (I can be on for many hours, but not ALL day), loud and repeated noises, going in and out of AC too much, flashing lights, etc.  \n\\- I'm over 90% **introverted**, so I really need a lot of time to myself to recharge.  That means no more than a 40 hour work week and minimal social events.  I'm chill with having lunch with my coworkers and the occasional fun outing, but I couldn't do a job that relied on serious socialization.  Small talk?  No prob.  Telling you about something I believe strongly in?  Easy.  Getting to know people and networking with them?  I have some of the skills, but it's exhausting.\n\nPersonality: INFP, Ravenclaw, Enneagram 1w2\n\nSo I'm thinking I should look into being a secretary or doing some kind of writing, but I'm interested in knowing what other jobs might be a good fit for me and what experience you all have in those fields.",
    "title": "Teaching is wearing me down to the point where it's unhealthy. What careers should I look into?",
    "subreddit": "careerguidance",
    "timestamp": 1568775391,
    "score": 5,
    "keyword": "japanese principal"
  }
]