[
  {
    "text": "Police in Japan uncovers a ring of 17 men who have filmed 10,000 naked women in hot springs across Japan for decades. The men hid in mountainous areas near the springs and used telephoto lenses to film the women. They also held gatherings to view the footage together, police say. **News link:** \n\n[https://www.insider.com/voyeurs-japan-hot-springs-filmed-women-police-say-2023-2](https://www.insider.com/voyeurs-japan-hot-springs-filmed-women-police-say-2023-2)\n\n&#x200B;\n\n>The Japanese police have arrested 17 men suspected of photographing and filming more than 10,000 women who were bathing in hot springs.  \n>  \n>The group's ringleader, Karin Saito, 50, was arrested in December 2021, per the [Yomiuri Shimbun](https://www.yomiuri.co.jp/national/20230201-OYT1T50285/). Saito was nabbed in the Hyogo Prefecture, west of Kyoto, and charged under a nuisance prevention ordinance, a local [law against illicit photography,](https://www.asahi.com/ajw/articles/13866723) [The Asahi Shimbun](https://www.asahi.com/ajw/articles/14830952) reported.  \n>  \n>**Between December 2021 and February, 16 more men were arrested, including a doctor from Tokyo, senior company executives, and local government officials,** reported the [South China Morning Post](https://www.scmp.com/week-asia/people/article/3209915/japans-hot-spring-perverts-circulated-photos-10000-women-over-30-years-police?module=lead_hero_story&pgtype=homepage). The men were detained by the police in 11 different prefectures, per The Asahi Shimbun.\n\n&#x200B;\n\n&#x200B;\n\n>  \n>  \n>**Saito has confessed to taking voyeuristic photos of nude women for 30 years in 46 different prefectures,** the police told the Yomiuri Shimbun. After being arrested, Saito informed the police about at least a dozen others in his group, reported the SCMP.   \n>  \n>Saito and his crew used high-end camera equipment like long-focus telephoto lenses to film women bathing in the open-air hot springs, the Japanese police told The Asahi Shimbun. **The men would take these pictures while hiding in mountainous areas several hundred meters from the springs, the police said. The group would also get tips from Saito on how best to photograph the women, and hold gatherings to view the footage together.**\n\n&#x200B;\n\n&#x200B;\n\n>Yutaka Seki, an executive director at the Japan Hot Springs Association, told the SCMP that while photography and filming are prohibited in hot springs, new technology makes it difficult to fully prevent such cases from happening.  \n>  \n>\"I am very much in favor of both sexes being able to bathe together in a friendly and safe manner, but incidents such as this attract bad publicity and worry people,\" Seki told the SCMP. \"And that makes my hope of mixed, communal bathing — as used to be the case in the past — more difficult.\"  \n>  \n>**In 2018, people convicted of taking illicit photographs faced a year in prison and a fine of a million Japanese yen ($8,784)**, per the [SCMP](https://www.scmp.com/week-asia/society/article/2168389/metoo-too-slow-japan-peeping-toms-come-under-spotlight).  \n>  \n>Hot springs, or \"[onsens](https://www.japan-guide.com/e/e2292.html)\" as they are known in Japanese, are popular across the country amongst locals and tourists. Known for their mineral-rich hot water, these baths are said to have a relaxing impact on the body and mind and are meant to be enjoyed naked.   \n>  \n>Representatives for the Japan Hot Spring Association did not immediately respond to Insider's request for comment.",
    "title": "Police in Japan uncovers a ring of 17 men who have filmed 10,000 naked women in hot springs across Japan for decades. The men hid in mountainous areas near the springs and used telephoto lenses to film the women. They also held gatherings to view the footage together, police say.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676372749,
    "score": 129,
    "keyword": "japanese director"
  },
  {
    "text": "Custom Anime Crocs Hey yall, kind of a random question here, but being a huge fan of Japanese anime, my friends got me multiple pairs of custom anime crocs for my bday. Kinda wanna wear them, my manager was cool with it but hospital director is a bit of a tight ass. Just curious if anyone else here has rocked a pair of these before. Fwiw, they're not like images of females showing a ton of cleavage that some anime are known for. Pretty conservative images and just some headshots of popular characters",
    "title": "Custom Anime Crocs",
    "subreddit": "nursing",
    "timestamp": 1698659442,
    "score": 1,
    "keyword": "japanese director"
  },
  {
    "text": "I have a weird life. How can I get a career out of it? I'm 19 looking for a good paying career or job. \n\nMy goal is to move to Japan at around 25. I'm already fluent but want more money to live good.\n\nMaybe a career that gets me to Japan?  \n\n\nI'm desperate because I don't like having my own company anymore. I'd like something stable with growth opportunities and fixed salary (or variable as commission).  \n\n\nAs mentioned in the title, since I was 14 I was working as a freelancer. So I don't have formal education. Dropped out of high school, too.  \n\n\nThis is my current Resume experience. I work from Brazil but have an LLC in the US so can work there.:  \n\n\n**Business Owner**  \nDec 2022 - Present   \nBrazil · Remote\n\n  \nConect acts delivering high-performing short-form digital media for creators, increasing their audience. (conectdigital.com).  \nAs Founder & CEO, I oversee our core strategies, product roadmap, ops, marketing, and planning.  \nRapidly grew from $0 to $15k MRR in 3 months using Outreach Lead Gen methods.\n\n  \nIn 2023 we gathered over 100M views for clients, averaging an increase of 200% views per client.  \nDeveloped automated cold and warm outreach strategies, referral systems, and paid ads to drive sales on auto pilot.  \nLeveraged Monday, Adalo, and Zapier to automate workflows and reduce costs, increasing workflow speed by 80% and saving up to $3000/mo in costs.\n\n\\--\n\n  \nCompany 2  \n2 yr 1 mo  \n**Director of Operations**  \nFull-time\n\n  \nStreamlined workflow management within Monday.com, automating processes with Zapier, increasing efficiency by 50% and cutting employee costs.  \nManaged the entire production department, optimizing their workflow and reducing expenses by 30% in 1 month by changing their compensation method.  \nCollaborated with the CEO and CFO for strategic planning, targeting lowering costs while maintaining video production levels.\n\nStreamlined workflow management within Monday.com, automating processes with Zapier, increasing efficiency by 50% and cutting employee costs. \n\nManaged the entire production department, optimizing their workflow and reducing expenses by 30% in 1 month by changing their compensation method. \n\nCollaborated with the CEO and CFO for strategic planning, targeting lowering costs while maintaining video production levels.…see more  \n\n\n**Freelance video editor**  \nMar 2017 - Aug 2022 · \n\n  \nEdited 15,000+ videos ranging from YouTube videos to mainly Short-Form content.  \n\n\n  \nI have very high linguistics skills, as I got fluent in English in about a year or so, and fluent in Japanese in 2 years and a half.  \n\n\nAlso, very high level artistic skills in music and arts as painting and drawing. I've sold some before.  \n\n\n  \nPlease help me.\n\n&#x200B;",
    "title": "I have a weird life. How can I get a career out of it?",
    "subreddit": "careerguidance",
    "timestamp": 1699653919,
    "score": 1,
    "keyword": "japanese director"
  },
  {
    "text": "Can anybody help?  \n\nHi everyone,\n\nI live in brazil, which has a very complicated economy and I also live in Sao Paulo one if the most expensive city to live in brazil if not worldwide. \n\nI work at a multinational company for about 2 years now, and at first it was amazing, a salary of around 3k usd with commissions per month, which is very high for Brazil, considering the minimum wage is less than 300 usd. \n\nMy first boss was a very straightforward guy, the rules were for everyone and the same for all, than about 5 months into the job he quit, and I got a new boss, since US Headquarters don't want to involve themselves here, they have a headquarters in Argentina, which runs the entire latam company, it's a very nepotism system, with the whole family of the latam director working at Argentina in the company regardless if they are capacitate for the job or not. Most don't even speak English. \n\nMy boss is also from Argentina and was hired by the latam director, the problem started with how she doesn't have rules, she can be the most amazing friend today and your worst enemy tommorow, I work at sales, so basically she's been taking clients from my accounts and passing to other more friendly towards her, and I can do nothing, I have talked with her and she doesn't do a thing, I had homework rules change 5 times in the past year, because she changes the rules according to her mood. \n\nNow we have a new employee for about 8 months now, the guy is extremely talented and high qualified for the job, but he is also a snake who does everything do fuck everyone else at the job and since my boss don't want to stay in brazil she loved him, and is making him be the new leader of Brazil, but the guy is extremely toxic, tried to do so much shit towards me even tho I tried to avoid him all the time. \n\nNow I'm stuck deciding whether I quit or not, I m 32 so I don't have the same easy to be umployed as I was earlier in life, but I also saved about 40k usd, so which gives me 3 years of my expenses paid. \n\nDon't know if I quit or just try to get by, or also just move abroad, I have double citizen ship Italian so I can work anywhere in Europe and I also speak English Spanish Portuguese and Japanese\n\nMy phycologist says I'm having burnout already. \n\nAny advices?",
    "title": "Can anybody help?",
    "subreddit": "careerguidance",
    "timestamp": 1691063111,
    "score": 1,
    "keyword": "japanese director"
  },
  {
    "text": "[Advice needed] Becoming \"Tech Lead\" (infra/cybersec) Hi everyone,\n\nFirst of all sorry in advance for my broken English.\n\n \n\nI may need your help regarding a big turn I am about to make in in my career path, since I’m not super experienced yet…. this is a tough decision.\n\nI’m currently in the middle of a heavy recruiting process to possibly become “Technology Lead” for a big foreign company in Japan.\n\n(It is not specifically related to programming/software stuff that could usually be when talking about “Tech Lead” in the IT industry. It is more related to Infra/Cybersec fields.)\n\n\n \n\nThe mission in summary:\n\n\n▪︎My boss will be the director of IT in Japan\n\n▪︎Nobody below me (the team may grow later), my main associates will be the Tech lead located in other countries (China, HK, Singapore, etc…)\n\n▪︎Will constantly interact with technical experts and with business/application teams in order to drive projects\n\n▪︎Will work as a bridge/point of contact between local infra teams/vendors in Japan, regional IT teams (Asia) and central IT team in Europe/US\n\n▪︎Have to stay aware about technologies, cybersecurity, infrastructures, services, etc…\n\n \n\n\nMy situation now:\n\n\n▪︎Just turned 30 (last 6 years in Japan so at least I know the working culture in the country)\n\n▪︎9 years of experience as infra engineer (different domains such as system and network), with good tech knowledge now\n\n▪︎No real experience with having high responsibilities\n\n▪︎No real experience in project management, leading meetings, etc…\n\n▪︎Can speak 3 languages including Japanese\n\n \n\n\n\nLooks like it will be 50% technical stuff (teams tech support, etc…) and 50% management/coordination (projects, meetings, etc…).\n\nInside the technical field I can expect around 30% of cybersecurity related subjects.\n\nI think that I can adapt and learn quickly but nonetheless the mission might be very challenging to me.\n\n \n\nIn your opinion, what kind of task/BAU I can expect to have ?\n\n \n\nI am confident about handling the technical and communications part but even if I don’t fear challenges, I don’t want to drown since I am kind of “junior” in management/organizational domain.\n\n \n\nHas someone have similar experience to share ?\n\n \n\nAny advice is welcome\n\nThank you!",
    "title": "[Advice needed] Becoming \"Tech Lead\" (infra/cybersec)",
    "subreddit": "cscareerquestions",
    "timestamp": 1676527750,
    "score": 1,
    "keyword": "japanese director"
  },
  {
    "text": "Entertainment company or Aerospace company, which offer should I take? My(26f) current company is Japanese entertainment company. I worked here for 3 years as account payable and currently make $48k.\nAfter my husband got job at well known aerospace company and started making six figures right out of college, I decided I’m ready to level up my skills by getting a degree.\n\nI started pursuing accounting degree this March. The college is fully online(WGU).\n\nSeveral company reached out to me after I  put my college information on LinkedIn as I also started applying to similar position with more responsibility. I ended up landing offer from two very different companies.\n\nCompany A is in similar business to my current, focused more on licensing of the Japanese stuffs they make. They were looking for staff accountant. Direct report will be made to accounting manager who is willing to teach me from scratch, offering to be a mentor for my accountant journey. They will allow me to build experience as an accountant immediately. Basic benefits. Slightly less PTO than current. Will accrue more based on years worked. Same pay as current.\n\nCompany B is an aerospace start up. Different aerospace company from my husband’s. when I first decided to pursue accounting, we talked about how it will be cool if we can both work in aerospace industry. Direct report will be director of finance but my position will be mix of account payable and procurement. I will not be doing much direct accounting stuffs but higher starting salary (+$15k), flexible PTO, equity bonus. \n\nJoining either of the company will allow me to build relationship with great mentor. They both have snacks and drinks I can have while I work. \n\nTLDR: I recently started accounting degree and received two job offer. One as staff accountant with basic benefit, second as account payable and procurement specialist with higher pay.\nWhich offer should I take if I really want to reach 6 figure asap?",
    "title": "Entertainment company or Aerospace company, which offer should I take?",
    "subreddit": "Accounting",
    "timestamp": 1687570332,
    "score": 2,
    "keyword": "japanese director"
  }
]