[
  {
    "text": "Looking into this job at Harvard I applied recently to Harvard as a research assistant to the Weatherhead Center under the Program on US-Japan Relations.\n\nWhile I didn't make the initial cut (and the Executive Director thanked me for taking the time to consider applying in e-mail), I suddenly found the position of Program Coordinator at the Reischauer Institute of Japanese Studies.\n\n\\----\n\nDuties:\n\nWorks closely with the administrative leadership to coordinate the  activities of the Reischauer Institute of Japanese Studies. Primary  responsibility involves student support services. Plans and organizes  student information, orientation, returnee sessions, and other  student-related gatherings. Coordinates all aspects of application  intake/processing, review, placement/award, budgeting and orientation  for students traveling to Japan for internships, summer school, language  studies, and research. Maintains all student records relating to travel  abroad including release forms/waivers, and assists with record keeping  and analytics. Prepares correspondence relating to student placement  and programming with various units across campus and host organizations.  Produces materials – print, web, social media – to promote student programs in Japan. Position also involves support to designated faculty,  including calendar, correspondence, website, course materials,  committees, publications, travel arrangements, and files. Position also  includes event coordination and communication, including some website  maintenance. Occasional frontline responsibilities. Performs other  duties as required. Occasional overtime required.\n\n**Basic Qualifications**\n\n3+ years of administrative experience. Education may count towards experience.\n\n**Additional Qualifications**\n\nBachelor's degree with a concentration in East Asian  Studies or Japanese Studies strongly preferred. Excellent  writing/editing skills; communication and organizational skills are essential. Working knowledge of desktop publishing skills and  familiarity with computers and technology preferred. Candidates with cross-cultural experiences and/or experiences working/studying abroad a  plus. Knowledge of Japan and Japanese strongly preferred.\n\n\\----\n\nI only have two years of admin experience since I help out with a NGO as a volunteer aside from doing research stuff. Also did a BA in Vancouver, Canada towards Political Science. I can also hit some of the additional qualifications needed.\n\nIt's a tempting job ad, but I'm not sure if I can relate to it (I would like to, at some point, do research on East Asia/Japan from an academic/institute perspective someday). I did study upper level courses based on East Asia (One course is modern Japan).\n\nAnother question is for example, I have (maybe) minimal desktop publishing skills since I have my own blog to publish my own articles on what's happening in Japan.\n\nWould like some thoughts on whether I should give this a shot.",
    "title": "Looking into this job at Harvard",
    "subreddit": "jobs",
    "timestamp": 1564535863,
    "score": 0,
    "keyword": "japanese director"
  },
  {
    "text": "First real job my mentor/supervisor is someone extremely difficult to work with, and keeps making meetings at inconvenient times (~1 am) my time, then doesn't show. Now they are upset that i am not producing. Wtf am i supposed to do? I took this job because it seemed really interesting, i had some amazing offers but this was a position basically doing ML/AI type stuff, so i went with this position.\n\nI joined this company 3 weeks ago, i had my interview with them almost 2 months ago. A good chunk of my team is spread out over the world, but i go into the office and work with a few others. My mentor/direct supervisor who i am going to call J, works remotely in Australia, while i am in EST.\n\nWhen i started i got some really barebones instructions, during the interview i was told i was going to be mentored (J Interviewed me), and said i would be coding in Python. Well when i started its not Python its Scala, and J said \"oh i might have confused them\". I know Python but i don't know Scala at all. Okay whatever.\n\nMy first week i had no direction, i offhandedly mentioned that J is my supervisor and apparently the general gist is that they are a brilliant person, but they are impossible to work with. They also have a huge tendency to basically turn off all forms of communication and work for 8 hours ignoring anything and everything.\n\nAt this point J has basically not responded to anything i have sent them aside from the very first introduction video chat i had with them. I ended up taking work from the developers who are doing Python basically working on handling the big data pipeline. This lead to J sending an angry email to our director complaining about me working on stuff when i need to be assisting them (i didn't want to start anything so i didn't respond).\n\nI ended up pinging J again basically saying \"Hey look i need some idea/direction of what i am working on, i see the git code base but there is no docs or anything\". J finally responded to me and sent me a dozen+ different research papers about what i am supposed to work on implementing. Half the papers aren't in English, and even then those papers are 50+ pages long, and don't really explain a lot of stuff very well, and seem to reference other concepts and ideas from other papers that i am struggling to wrap my head around.\n\nI made a big list of questions for J, who never answered 90% of them, the ones they did answer they said i should look at X, but X is written in Japanese or Korean or some language i don't understand. Finally they caved and basically told me they would need to setup a meeting for Knowledge transfer.\n\nJ has setup half a dozen meetings at times that work for them basically 3 - 4pm their time, which to me is like 1am \\~ 2am my time for the purpose of knowledge transfer. Apparently it has to be after at earliest 3pm because they don't like to be disturbed in the mornings.\n\nI have stayed up for these fucking 1am meetings my time, only for J to not show at all. Or they do show and ping me at 430am my time basically being like \"oh sorry i got distracted solving a problem, i forgot\". Then J becomes pissy for me \"wasting their precious time.\" On Monday they basically sent me a message telling me i needed to be more flexible, and actually produce something because otherwise \"i don't see the value of keeping you around\".\n\nThey set another meeting for tonight at 00:30am my time. It is now \\~2:50am my time and they have not shown. I see them pushing commits, and they are online on slack, but set to do not disturb and are not responding to me.\n\nBasically i don't understand or know what i am supposed to do.\n\nAlso i don't want to lose this job because i basically moved out east for this job, and i was given a great signing bonus along with them giving my relocation fee as a lump sum upfront.",
    "title": "First real job my mentor/supervisor is someone extremely difficult to work with, and keeps making meetings at inconvenient times (~1 am) my time, then doesn't show. Now they are upset that i am not producing. Wtf am i supposed to do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1572419110,
    "score": 20,
    "keyword": "japanese director"
  }
]