[
  {
    "text": "Donald Duck and Goofy were depicted in an old cartoon fighting against the Japanese in WW2. What war crimes do you think they committed behind the scenes and how do you think they should be tried if you were judge?",
    "title": "Donald Duck and Goofy were depicted in an old cartoon fighting against the Japanese in WW2. What war crimes do you think they committed behind the scenes and how do you think they should be tried if you were judge?",
    "subreddit": "AskReddit",
    "timestamp": 1613586923,
    "score": 5,
    "keyword": "japanese judge"
  },
  {
    "text": "I just want to wear cute clothing without having weird comments about it I’m 14, so i don’t have my own job rn, so i can’t but my own stuff yet.\n\nYes ik this is probably such a small problem but, i just want to wear cute cardigans with sheep on it, or one where it has a duck and her family with hearts on it, and not be called childish or “asian-obsessed” by my own mother because half of the models are either asian or the style is based off some japanese characters.\n\nI also get the weird comments about how i’ll attract p*dos or creeps in general because the way i dress, to which i can say i’ll attract too many sick people to count just from me being in my lumberjack outfit that shows nothing and doesn’t really show my body shape. so no. it’s not clothing that’s the problem it’s creeps thinking they’re entitled to a minors time.\n\nI just wish i could have more freedom with clothes even if my style goes to medium crop tops to old lady clothing, i just wanna be less paranoid i’ll be judged by my family..\n\nsorry for this kinda weird rant. hope you all stay safe.",
    "title": "I just want to wear cute clothing without having weird comments about it",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1609981122,
    "score": 14,
    "keyword": "japanese judge"
  },
  {
    "text": "I thought he liked me; he took advantage of me and I let it happen. So, I was talking to this guy on OKCupid for a while, and a couple weeks ago, he asked me to talk through Instagram instead, because he was more active there. And you know, I was like sure why not because OKC's messaging system sucks ass and I hate it there too lol.\n\nThen we started talking even more, and even made plans to watch a movie and The Haunting of Hill House together over Netflix Watch Party and stuff since we were both quarantining. On New Year's Eve, midnight hit. He wished me a Happy New Year. I said Happy New Year back. He started to flirt with me and because I'm an idiot I took the bait and flirted back. I was so happy and excited. I've never been asked out by anyone except as a joke, I've never had a boyfriend, been on a date, never even been kissed. And I'm 27. It's so lonely and humiliating.\n\nDon't judge me for this but-\n\n*sigh* Then I got too caught up in the moment, I was experiencing a slight manic episode throughout the day, it became elevated during this whole exchange, and he goaded pictures out of me (joke's on him though because the one of my chest is the one I need to send to my dermatologist, so really all you can see is my stretch marks and the big scar where I had something implanted). I didn't send full on nudes, just my underwear really. I sent two, and neither of them have identifying marks or my face. He acted like he was into it, and I was like \"Oh we've been talking for a while, and no one has ever flirted with me or anything like that! I've never even been asked out or on a date, before! Is this going to go somewhere?\" I was so excited....\n\nThe last message I got from him was \"hot\" and then he just fucked off. I can't find his profiles, not his Instagram or OKC account! I asked if he was okay and I KNOW he saw it because it said \"Seen\" and I'm so fucking mad. Like, I'm seething. I feel so gross and used and upset. And I don't need to hear all the typical platitudes that people say when relationships or flirting is the topic.\n\nI'm still mad about this. It wouldn't have been so bad if he had just asked straight up for pictures (because then I would've said no), but it was the flirting and the plans and the sweet talk that got to me. Why did I ever think anyone would like me Like That??\n\n\"Oh you'll find someone!\", \"You have a great personality!\" (so I'm ugly??), \"relationships aren't everything!\", etc. I'm so sick of that crap. First off, it always comes from people who DO have boyfriends/girlfriends or have been in relationships before, in high school and college. Secondly it's always so patronizing. I am well aware that Relationships Aren't Everything™️. I'm sick of being alone, and I'm sick of being ghosted. It always hurts every time it happens. People are too chickenshit to actually say what they're looking for, and no one seems to actually care or realize how insulting that is.\n\nJust the newest installment in a long line of heartbreak. From being the victim of the \"Ask Out the Ugliest Girl In Class to Homecoming\" in high school, to being ghosted by my Japanese penpal after speaking back and forth and sending gifts to each other (and even making plans to visit each other) for 7 years after I met him when I was 15~16 and he just stopped all communication, to being constantly ghosted on OKCupid or CoffeeMeetsBagel....\n\nI am so stupid.",
    "title": "I thought he liked me; he took advantage of me and I let it happen.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1610048915,
    "score": 10,
    "keyword": "japanese judge"
  },
  {
    "text": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender This happened about a year ago, but due to recent events in \"the bible belt\", I remembered it and thought it was worth sharing.\n\nSo I was working for a consultancy company which was doing work all over the place. I didn't have a project for a while so the pressure was on to get me to a client, no matter what or where. One day we get an email from sales that a position had opened up in a place that I never heard of. It turned out to be a small/medium-sized village in bumfuck nowhere with an industrial park that housed a couple of big companies for that region.\n\ninitially, my manager (Chinese) always sends a couple of internal resumes with one or two obvious good matches. She didn't get any replies, followed by the sales rep saying \"this is the bible belt, unfortunately, they are not as progressive as our company. They said they wanted to handle communications with me instead\". That should have been a red flag from the start but since this was an international partner the company didn't care (which was a red flag for me to get out eventually).\n\nThen they asked if they could interview a top 3, where I wasn't part of. My manager pushed for me to be included because all 3 were male. Me and another female colleague, with way more experience, were skipped.\n\nWe start the call and almost immediately we get \"What are Sara(not my real name), Wendy(manager) and Jenny doing in this call!?\" and \"listen, you have to understand that...here in bumfuck nowhere we don't work alongside women. It will impact our working environment\". It was obvious the guy wanted to say that he didn't want to work with women. I stepped in and hijacked the whole thing and start asking them questions about the project, what skills they need, etc to get the conversation back on track. At the end of the call, Jenny almost quit on the spot for not being defended by the sales rep.\n\nThe client was happy with the call and invited me to do an in-person interview (according to the sales rep, which I didn't believe for a second). So I travel to bumfuck nowhere and I feel like I'm traveling to a different country where it would be wise to carry a pocket knife or something.\n\nIt was cold that day so I were a sweater (keep that in mind). I enter the office building, meet the guy we spoke to, he gets another colleague to do the interview with and we enter a meeting room. 30 minutes since I entered the building and I realize I didn't give my name and I start to get very scared. I tell them of my experience and my team. I also sneak in some things about my manager and Jenny and the guy goes \"yeah what is Wendy anyway? Chinese? Japanese? I can't tell those people apart. And Jenny? Why the hell is that young woman working? I don't understand women from where you come from\". I try to play it off that men and women should have equal opportunities in life and he replies \"it's not right, women shouldn't work at that age. They should stay at home and take care of their partner\" and I think to myself \"HOLY SHIT I REALLY AM IN BUMFUCK NOWHERE! IS THIS STILL THE SAME COUNTRY I LIVE IN!?\"\n\nSo then they start glancing over the printed resumes and see that I am actually Sara and it gets super quiet while I'm already thinking about how many people I have to walk past and how many doors are between me and the fresh air. Then the other says \"hmm...so you're one of those transvestite people, are you?\". And I say \"well it's called transgender actually and yes\". What followed was a bombardment of slurs and nasty comments like \"God doesn't approve of that kind of lifestyle, you're a sinner\" to a point where I disconnected myself from reality until it was over. At some point, I came back to reality and said \"well it's obviously not going to work out but thanks for inviting me\". I tried to shake his hand but he gave me the meanest look I've ever seen. When I walked out a group of people went quiet and started laughing when they realized.\n\nI walked out, shaking, and had to sit on a bench for a couple of minutes. It was like all the work I put in my self-esteem and confidence over the years was instantly worthless. Every time someone walked past me I felt scared and judged. I took the first train back and stopped at a train station where I was 100% sure to be comfortable and had some fast food for lunch to comfort myself. I felt so betrayed by my employer that my trust in them never recovered and I eventually left the company.\n\nThe only thing that kept me going was the thought that the world is a big place and that there are many places other than bumfuck nowhere to live my life.\n\nedit: grammar fixes",
    "title": "Got shut down due to my (obvious female) name, then people listened to me because they heard my voice, then shut down again when they figured out I was transgender",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1615114235,
    "score": 0,
    "keyword": "japanese judge"
  },
  {
    "text": "1L on leave of absence after experiencing 2 mental breakdowns. My parents are livid and I;m terrified. My story goes back, way back. I was diagnosed with depression when I was 14 and prescribed Prozac, but I stopped taking it within a year after my family urged me to stop and after a suicide attempt where I tried to overdose on my medicine. In spring 2019 of my 3rd year of university, I attended LSAT prep night classes while going to school during the day. I was trying to get a double major but dropped the second one by the end of the school year since the school barely had enough courses to complete it and I didn't want to continue on to a 5th year. During that time, I fainted from low blood pressure on a bus ride to school once and ended up losing around 20 pounds from stress. I took the first digital LSAT that summer and cancelled my score since it was a 149, way below my target score. During the fall semester of my final year of uni I focused on my courses so I could maintain a decent GPA while working part-time; my mom would always call me to ask if I was studying for the LSAT and I either evaded the question or lied and said I would once I finished my regular coursework for the night. I decided that once the spring semester started I would study for the LSAT since I only had two easy classes to take with few meeting times.\n\nAs everyone is aware, 2020 had a rough start. Looking back I probably had a relapse into my depression after receiving my LSAT score. I didn't study for the LSAT at all and just stayed in bed once I got back to my apartment. When my mom called to ask me how studying for the LSAT was going I would snap at her and even hang up my phone. Come March I wasn't ready for the April LSAT at all, so I was relieved when it got cancelled due to COVID. I told my mom that I would take the test later during the year and spend my time studying and working. She was not pleased to say the least. My parents would spend days screaming at me, calling me a deadbeat for working at the local Target instead of trying to get a job that was more prestigious and used my bachelor's degree (I majored in Human Geography) and my infrequent studying. I broke down and told them I didn't want to go to law school anymore, and stayed with grandma to study at her house. My aunt and grandma convinced me to go back home a few weeks later, but I started slacking on my studying until I just stopped once the holiday rush started at work.\n\n2021 and my mom is yelling at me and calling me a deadbeat who achieved nothing in 2020. So I buckled down and studied for real. I would study for a few hours before work and study some more once I came home from work and even during the weekends. I managed to get up to 160 on some practice tests and could answer three sections correct on logic games, which used to be my weakness. I felt ready for the April 2021 LSAT. Then, on the day of the test, I had a panic attack in the very first section, logic games to add insult to injury. I had heart palpitations so intense I was practically punching my chest to calm down. By the end of the section I just wanted to shut down my laptop and run away, but I powered through the test and finished. I was absolutely sure that I bombed it so I drank as much Vodka as I could and got black out drunk. I vaguely remember my younger sister and cousin picking me up off the kitchen floor and helping me walk upstairs to my bedroom. I haven't swallowed a single drop of alcohol since then.\n\nI got my LSAT score in late April. It was 151, I never even scored that low on my practice tests. I decided applying to schools would be pointless and I should retake the test, but my mom encouraged me to apply to some law schools. I got rejected from one school, which was also my top choice I was dreaming of attending, I got put on the waitlist at another, and I finally got accepted at one school. I won't say any names, but the school has a 55% bar passage rate and in 2020 the ABA warned them they could lose accreditation if they couldn't raise their bar rate. I was nervous about attending the school, even with the scholarship they gave me, but my mom said I could work hard in my first year and transfer out. I talked to my mentor and a friend who already works in the legal field and they said they knew people who went to lower ranked law schools and transferred to better schools after their 1L year. \n\nSchool started in August and I started out fine enough, my only concern was that I learned law school worked on a different grading curve. There were only a certain amount of As to be given so students who put in A-level effort weren't guaranteed to get an A. I told myself I would try my best to be one of the few who got an A. By the 3rd week of school I stopped reading and struggled to complete assignments, at times I just didn't turn in any assignments. I stopped eating and only ate once a day so I wouldn't get hunger pangs and headaches. Once classes ended I went straight to my apartment and climbed into bed; watching the sun go down outside my window until I could fall asleep. I called my mother after my first breakdown and she got me connected with a psychiatrist that prescribed Zoloft to me. I told the Dean of Student Affairs about my suicidal ideations, and he set up an appointment with a therapist program affiliated with the school. I ended up spending the night at the local hospital on suicide watch. \n\nI tried to get back into the groove of things, but I still struggled to read and do my assignments despite talking to a therapist and the Dean of Student Affairs once a week. I had my 2nd breakdown when 1Ls were notified to have a mandatory meeting with career services to discuss pro bono work and looking for summer internships and jobs. I wasted my first 2 months of law school depressed and ruining my grade; I was scared that I would flunk the semester and be stuck at a school on the verge of losing accreditation or that after graduating I would struggle to find work since employers would judge me for going to a low tier school. I told my mom I wanted to withdraw and seek more intensive out patient care and enter with the winter class, and she accused me of wanting to run away from law school by entering a facility. Choice words were said, including me saying my mom just wanted me to stay in a school so she could bragging about how her daughter was in law school, even if it's a bad law school.\n\nAfter talking to relatives, the Dean of Student Affairs, my professors, my mentor, and friends, I decided it was in my best interest to take a leave of absence and retake the LSAT to see if I could get into a better school while I still could; if that failed I would come back to my current school and try Plan B - getting top grades so I could transfer out. When I told my parents, as the title said, they were livid. They told me I was taking the easy way out and that since I knew nothing about struggle that I thought I could reset when life doesn't work that way. My father said he refuses to pay for my rent and my mom is flip flopping between saying she'll pay for my rent but once my lease ends I'm on my own or that I need to find a job to pay for my father's half of the rent. She also demands that I find a way to end my lease prematurely so I can come back home so they aren't wasting money on me since I'm not in law school anymore. I have some money saved from working since high school so I can pay for rent until March without working; I plan to take the January LSAT so if I manage to pull up my score I plan to work so I don't drain my savings.\n\nMy mom is a nurse practitioner and says that professionals don't care where I went to school, but my mentor, cousin, and friend that's been a lawyer for 5 years says that the legal field is still a bit elitist and I should follow my heart. My friend is fluent in Cantonese and Japanese and passed the New York bar exam. She had to move to Japan for family reasons and was applying to law firms there; a recruiter told her that because of her academic background they didn't think she was qualified to work there. She ended up getting an in-house job in Sega's legal department, but hearing that scared me since her school is leagues above my current school. That just cemented that the school I go to ***does*** matter, and I want to go ahead and try taking the LSAT before I end up ruining my future. Just like how retaking the LSAT doesn't guarantee I will be accepted to a new school, I'm not guaranteed an A in school and a transfer to a better school. After this long spiel, I just want some advice. How do I convince my parents that I'm not giving up on law school? That I can pull up my LSAT score and get into a better school?",
    "title": "1L on leave of absence after experiencing 2 mental breakdowns. My parents are livid and I;m terrified.",
    "subreddit": "LawSchool",
    "timestamp": 1634925659,
    "score": 6,
    "keyword": "japanese judge"
  }
]