[
  {
    "text": "Gracefully turn down an offer or just take it I've been unemployed 1 month. Last week I went on a interview and it was not great. They seemed interest in me but I wasn't really interested in the position. What really sent me over the edge was the interviewer asked me if I had a problem with multiculturalism/if I was racist (I'm white, 90% of the company is korean) I'm not racist but the question irritated the shit out of me. There were lots of other moments when I felt that the guy who would be my manager was a cocky idiot.  \nAnyways since I had decided that I didn't want to work there, it's the law of the universe that they would naturally want to make me an offer for that role. They recruiter for the role just left me a voicemail telling me he has fantastic news/they were making an offer...\nI'm not sure, should I accept? My desire to work there is about a 5 on a scale of 1-10.  Should I tell them I need to think about it? Is it okay to say I'm not sure?  \nUgh",
    "title": "Gracefully turn down an offer or just take it",
    "subreddit": "jobs",
    "timestamp": 1489528281,
    "score": 2,
    "keyword": "korean manager"
  },
  {
    "text": "\"Mining\" Teaching Experience for Job-Relevant Skills? What general job skills can l pull from a teaching position without stretching it too thin? i.e. l immediately think of things like project management and leadership.\n\nOr is that just a waste of time? l don't want to blow out a bunch of opportunities if l'm wrong\n\nl just spent 3 years teaching English to kindy through early high-school age students in South Korea. To put it in a sentence, l was in charge of up to 20 kids at a time that needed to be perpetually entertained, taught, and motivated to do the work. \n\n* Throw in the fact that 90% of Korean students are usually **tired** beyond hell since they all have to attend multiple after-school academies, sometimes even on the weekend.\n* A lot of these students have no respect for expat teachers and don't want to be at the academy in the first place (can't blame em for the latter). l had to figure out a unique and effective teaching method for almost every class, even if the material was the same.",
    "title": "\"Mining\" Teaching Experience for Job-Relevant Skills?",
    "subreddit": "jobs",
    "timestamp": 1501808773,
    "score": 2,
    "keyword": "korean manager"
  },
  {
    "text": "Boss from another culture is making work miserable, but the difficulty of finding more work makes me feel trapped. tl;dr - Korean boss is a huge energy vampire, doesn't know anything about the industry we're working in, watches us through security cameras and makes inappropriate comments about women. Pays me barely above a living wage for a job that's so stressful I can't sleep or enjoy the rest of my life.\n\nSo I started recently (just shy of four months ago) a job as a marketing manager for a small independent mobile game publisher.\n\nI had been looking for a job for a while, was super stressed out as I was pretty much out of money, and all the people I usually did freelance work with had nothing for me or stopped calling.\n\nI got this interview after applying for a copywriting position, thinking I'd mostly be dealing in app descriptions, PR, etc. I made a rookie mistake, after briefly discussing what I thought were the job duties, he asked my salary requirement. I was afraid to go too high and drive it off, and gave a number. He noted it. Then he starts adding extra stuff—turns out he wanted an office manager that would also handle all sorts of other stuff. And like a fool, I said nothing about wanting to adjust my original figure to account for these additional duties.\n\nWhen he offered me the job a few days later, he actually beat my asking price by a few thousand dollars a year, and it worked on me *again*, making me feel better even though I knew I should have held for more.\n\nWork starts, and at first it was alright, but over time it's become a near nightmare. He said he wanted to foster a creative environment, but he constantly asserts himself into our pipeline—most notably by taking ads I'd written and filmed (or that our animator animated), and adding weird stock footage and framing the ads for things they were never meant for. I told him as such, but he basically dismissed those concerns.\n\nThere have been other strange occurrences that just put me off: he used to frequently mention hiring \"attractive females\" to sit across from us to make the place more interesting. He has lost his cool on several occasions over minor issues—we released our first game and the metadata didn't match the update I'd put in. He has a fit, saying it needs to be fixed immediately, it's an emergency, it will all be ruined. I tell him it'll be fine. The game released minutes ago, no one has seen it, no one has downloaded it yet, and a mobile game's success isn't contingent on a pristine first hour. He doesn't yield in the least, he starts calling our international dev team into the office at what was their one in the morning to try to get things fixed. He blamed me at first, until I showed him that I'd updated the information correctly—turns out the dev team had given me the wrong account information. Still, it doesn't foster much loyalty.\n\nDuring a meeting in which we were discussing international publishing targets, he mentions that the game was a failure in Korea (where it was developed), despite having (according to him) over $500,000. When I asked how that's not a success, he said it's because more than that was spent on the game. I told him the costs seemed far too high for a game of our scope—typical budgets should have been 10-20% of that. He straight told me I didn't know what I was talking about and to be quiet. I looked up mobile budgets for projects similar to ours...I was a little low, but was closer to the mark than he was.\n\nI battle with coming in daily. It's a small team—only four of us, including me and the boss, and it'll be three after he tells our contact animator not to come in anymore (with no notice, I'll add, I know it's coming), so there's not a lot of action or buzz around the place. The energy is notably higher when the boss isn't in.\n\nBUT on two separate occasions as of this morning, he's sent a text to an employee while he was gone that indicate he's *watching us through the security cameras*. Today he texts me asking where the animator is—the dude had just stepped out for a smoke break, nothing to get so riled up about. The previous time he sent a message to the only female that he \"liked her dress\". It was deeply disconcerting.\n\nNow, he's from Korea, but has been in the States for some time. I know there are cultural differences, but I'm losing sleep and hair for a $35k/yr job that has a mean salary almost twice that (albeit for slightly larger companies). I can't enjoy my Sundays—knowing that Monday is coming sends me into depression.\n\nBut looking for work is somehow worse. People say I'm lucky I have a job while I look, but it's starting to feel like the only reason I got this job was because my boss has no idea what he's doing, and was able to sucker me in with shady business tactics. I've applied to several jobs a day for the last two weeks, with two rejections and no other responses.\n\nThe other complicating factor is that he promises more for me soon. There's a six month probationary period built into the contract, and he has frequently requested that I don't ask about wages and the like, because he wants me to be the Face of the company in the States, and to help build it together, and that once the six months is up, I'll be \"compensated accordingly\". I want to believe that, but he's all but outright lied in the past—so I don't know how reliable that is.\n\nAm I just incapable of being happy with my job? Should I stop worrying so much? I'm looking for more work and am appreciative of what I'm learning here, but I feel like I'm losing years off the end of my life as a result. I've been hoping at least to get another offer so I could leverage it against my current stuff and either have an out or get enough to make it worth staying. But nothing.\n\nSorry, I know I'm rambling. This has been building up for quite some time. I'm not the only one in the office that is feeling this way, either. Both the other team members have told me they've considered leaving because of the environment.\n\nWhat should I do with him? Would it be worth losing the job to bring it up? It's all so complicated.",
    "title": "Boss from another culture is making work miserable, but the difficulty of finding more work makes me feel trapped.",
    "subreddit": "jobs",
    "timestamp": 1495825903,
    "score": 0,
    "keyword": "korean manager"
  },
  {
    "text": "I want to work abroad? Mid-twenties. NYC. I work in corporate finance. 2 years as an associate out of college, decent company. Now I've been a senior analyst for 1+ year at a good company making ~80K.\n\nI just decided I want to move to Korea.\n\nI'm going to be staying in the States for another year then will begin making moves. I know that going abroad could mean a pay cut and getting there as a senior analyst could be hard. I'm thinking that maybe for the year or so I'm still here I try to find a manager position. That way, when I am looking for a job in Korea I will be at a higher starting point, both in terms of salary and (I hope) appeal.\n\nFinding a manager position with 3+ years experience will be hard, but I don't think impossible. If I do not manage to find a higher level position I will just stay at my current job for another year then try to get to Korea as a senior analyst or maybe manager. I'm not pressed if I don't get manager, I just want a similar salary to what I'm making now in Korea.\n\nIf I do manage to find a manager position I am to stay there ~1 year then apply for Korea. The pay increase is great but I'm afraid of the following:\n\n* Harder to find a similar level position since hierarchy is different in Asia (I would be applying to American companies though) So maybe I go from manager -> senior analyst? How bad does that look?\n\n* Resume looks like I move around too much?\n\nI am not Korean, would need Visa, and am planning to learn and possibly test (TOPIK) on language skills. My priorities are literally Korea -> money -> career path. I just want to make the move soon, at most staying 2 years.\n\nTLDR: 3+ years in corporate finance making ~80K. Want to move to Korea soon making a similar amount. What's the best way to make that happen?",
    "title": "I want to work abroad?",
    "subreddit": "careerguidance",
    "timestamp": 1510789413,
    "score": 3,
    "keyword": "korean manager"
  },
  {
    "text": "First job into the tech world: dev vs. consultant vs. data analytics(?) Hello guys,\n\nI am a senior graduating this December, and I have received a few offers for some internships. I am planning on trying to do my best to convert the offer I select into a full-time position.\n\n(People don't seem to mention company names here..? is that a rule?) but here are the offers:\n\n---------------------------------------------------\n1. Card company that is everywhere you want to be - .NET Dev Intern for developing Authorize.NET apps\n2. Joint Venture between smallsoft and accent***. - Technical Consultant Intern (does both dev work and has exposure to new techs such as VR/AR/etc.)\n3. #BeMagenta telecommunications company - Big Data Analysis? (not sure, they said they have a clean slate... tons of data in the cloud, but don't know what to do with all this stuff so are hiring people to do things with it)\n\n---------------------------------------------------\nI definitely want to get my hands dirty and do a lot of coding myself, but I also want some exposure to a lot of the business aspects so that I can go up and above the dev team become a technical manager one day. \n\nHere are my questions:\n\n1. Which of the positions do you guys think will be the most helpful? \n\n2. Has anyone interned at any of these companies before? If so, any information is welcome!\n\n3. If I don't end up getting a full-time position out of the internship, which would be the most helpful in the job search in the future?\n\nThank you so much in advance, this sub has been tremendous in help during my effort to find an internship this year.\n\nEDIT: tbh, it's not actually a first job. I worked at a very popular korean electronics company as a web developer intern last summer as well.",
    "title": "First job into the tech world: dev vs. consultant vs. data analytics(?)",
    "subreddit": "cscareerquestions",
    "timestamp": 1489167672,
    "score": 1,
    "keyword": "korean manager"
  }
]