[
  {
    "text": "What shall I do to handle a new bad job situation I was hired 3 weeks ago in a company, a colleague was assigned to train me, most of the times she's busy and when she has time she explains things fast , and seems to be angry when I ask questions, she told me that I need to get authorization to access the company's system and different programs, she didn't tell me who to call and how to ask for the authorization , I asked other employees and took me time to get to the right people, and then she got angry and yelled at me for getting the authorization late, she gives me things to do and when I make mistakes , she belittles me and treats me as if I was stupid, I'm still in probation period and I don't want to insult her or put her in her place, because I don't want to be fired I need the job, my manager doesn't care , he barely speaks to anyone and he doesn't bother with anyone, since the first day I asked for a desk to sit on, he only cared to tell people to give me one only 2 days ago , I'm supposed to do a report next week but I didn't understand how to do it completely and I'm frightened to ask her because I know she'll not help and worse , what shall I do to put her in her place without ruining my chances in a company? P.s it's a Korean company and that colleague is also Korean, I don't know if her attitude and behavior is normal in companies in Korea?, Is it normal to treat New employees like this to tough them up or something ? or is she just rude?",
    "title": "What shall I do to handle a new bad job situation",
    "subreddit": "jobs",
    "timestamp": 1557515507,
    "score": 1,
    "keyword": "korean manager"
  },
  {
    "text": "Teaching is wearing me down to the point where it's unhealthy. What careers should I look into? I've been a teacher for 6-ish years now.  I've taught a weird variety of things (French, English, computer, Bible, art, etc.), to every grade K-12, at public and private schools.  My default is to say, \"I love it,\" but I'm really questioning that now.  What I know for sure is that **I need at least a year away from teaching to see if I'm healthier in a different career**.  I have a lot of feelings about this, so I'll bold what's important and you can skip the rest.\n\nPositives and negatives of my experience as a teacher:  \n\\+ The public school parents were very supportive of me and quick to straighten out their kids if they had issues.  \n\\- The private school **parents** are downright cruel to my coworkers and me.  Their kids can do no wrong and they demand that we make good grades happen.  Picture the \"I demand to speak to your manager!\" lady, but there are dozens of them and they have kids and I'm responsible for parenting them because the Karens won't.  (Have I got STORIES.)  \n\\+- Dealing with those parents is manageable when I have a very supportive principal who backs me up.  When I don't (and we have a lot of turnover, so it's very on and off), I'm kinda screwed.  There's no winning with Karens.  \n\\+ The private school kids are, for the most part, absolutely amazing.  They work hard and are respectful.  Some days we have serious life discussions, occasionally we have a turtle dance party.  It's like a big family.  \n\\+ The public school kids were sweet in their own odd ways, like drawing me as Big Fat Meany Mrs. Puff or shooting spitballs at me in the cafeteria.  No, really, they meant these things as compliments.  \n\\- The public schools where I've worked had daily fights.  I'm not intimidating enough to deal with those, and it made me so sad when a sweet kid would get beat up just for being different.  There were so many issues I couldn't begin to help with, and with 30 kids in most classes, I had to just keep teaching even if a girl's eyes were bloodshot from drugs or a boy had his head down because his dad got angry again last night.  \n\\+ I love kids.  I get so attached to them that I cry at the end of every school year.  I want to adopt every one of them.  \n\\+ Teachers are pretty fun to be around, honestly.  I've made some great friends among my coworkers, and I've learned a lot about life from others.  At my current job, it's like a family too.  We get together at the math teacher's house twice every summer for a homemade lunch, and at work we laugh 'til our faces hurt.  Also nice: the nature of our job makes it so we have to keep safe boundaries in our conversations, so awkward oversharing really doesn't happen much.  \n\\- Things change every year.  Change is good, but in teaching, it's mostly **pointless annual changes**.  A new lesson plan format, a new buzz word to learn, blah blah.  There's so much we should be changing, but instead we change the language of it.  I gave up on even keeping my lesson plans from one year to the next because trying to adjust them to the new formats took longer than starting over.  Like, I get that the non-teachers in charge of education get bored, but *stahp.*  \n\\- *Non-teachers are in charge of education.  I would like to personally kick each one of them in the shins.*  \n\\- There's no end to the work.  From student teaching through my first or second year of teaching, I hardly slept.  (Part of that was typing *pointless lesson plans*, but that's beside the point.)  Teaching is a job where you could work 24/7 and still not be providing the ideal education.  **There's always more you could/should/would be doing**, always lessons to improve, always activities/games to create, always differentiation to implement, always parents to email, and every individual kid needs individual help.  I had a really strong work ethic until I taught for a while.  Now I know it's partially in vain, because...  \n\\- Both my jobs teaching French have ended because I didn't increase the numbers enough.  Here's the thing: At my first job, I *doubled* the enrollment in French.  They said I should have tripled it.  At the second job, we only offered French at first, so everyone took it.  They added Spanish while the school's numbers were too low, so my classes shrunk drastically.  I worked hard to create an exploratory program to get kids excited about French, and I was going to have a decent French 1 this year.  But they said it wasn't enough.  \n\\+ Summers and weekends off, yo.  \n\\+ I love that teaching makes it so easy for me to **encourage** and help people.  At the first job, I was in the Sunshine Club and we would just do little things to cheer the kids and teachers up every so often.  At my current job, I've done things like decorating the halls, writing encouraging notes to kids, and cheering the kids on at games.  It gives me life.   \n\\+ I have a lot of fun with the creative side of teaching, on the rare occasions I have time for it.  I paint posters for each individual volleyball player, make decorations for the classroom, stuff like that.  **Doing some art on a regular basis is good for my health.**  \n\\- The **pay** is seriously problematic.  At the public school, I made a totally reasonable salary and had benefits and retirement.  At the private school, I make $21k per year.  No benefits except a little bit of help with health insurance.  I can only afford to work there because I have extremely low rent.  \n\\- **The job is so mentally, emotionally, and physically exhausting that I don't think it's healthy for me to stay much longer.  I get home some days and almost fall asleep in my driveway because I don't have the energy to get out of the car.  There are so many late nights required for school functions.  I don't have the time or energy to plan meals, cook healthy food, or exercise.  Some years are marked in my memory by crying on the bathroom floor trying to get ready for work, wanting a day off so badly, then crying at my desk when work ended.  To be fair, I do have major depression, and it's better now with treatment.  Still, my energy and motivation are very low and I've been really questioning whether a different career would help me manage.**  \n\\+ And the thing is, I do enjoy teaching.  I like teaching people things.  I feel warm fuzzies when kids can do something new that they couldn't do yesterday.\n\nWhat I'd look for in a new job:  \n\\+ Working for people who don't feel **entitled** to treat me like a bag of dog poop  \n\\+ **Fun** coworkers who keep professional boundaries  \n\\+ The company is well **organized**  \n\\+ **Clear** expectations  \n\\+ **I don't take work home** / I can have a life outside of work / once it's done, it's done  \n\\+ Salary that **pays the bills**, lets me get my teeth fixed, and allows me to **retire** (preferably early if I invest)  \n\\+ Somewhere I can be **creative**  \n\\+ Somewhere I can **help/encourage** people.  Even if the job itself is mundane, I want at least a workplace where I'm allowed to do small, kind things for the people around me.  \n\\+ I'd be cool with having the option to do overtime work.  Heck, getting paid to work late is a totally novel concept to me.\n\n**I know it makes sense for me to get a job working with kids, but I'm thinking I'll do that on the side.**  Maybe help at a youth group or something.\n\nSkills I have:  \n\\+ **Typing** (100+ wpm, personal best 141)  \n\\+ **Writing/grammar/English/editing**  \n\\+ Kind of **psychology**.  I had some psych in college.  I've been through a lot and worked with kids who also have emotional issues.  \n\\+ **Art** (traditional and digital, but I'm no professional)  \n\\+ **Photography** (more the artsy side than the technical side, until I can take a class)  \n\\+ Fluent in French, but not sure I want to use it  \n\\+ Dealing with difficult people  \n\\+ **Computer** stuff, to an extent  \n\\+ **Teaching**, obv  \n\\+ **Working hard** at both tedious and challenging projects  \n\\+ I'm kind of an idea person?  \n\\+ Staying **calm**\n\nInterests:  \n\\+ **Video games** (my #1 favorite thing)  \n\\+ **Learning languages**, especially Japanese, Korean, maybe Italian, but really anything  \n\\+ **Writing** (I want to write YA books eventually and would also consider writing articles of some sort)\n\nWeaknesses:  \n\\- I'm very **honest**, so I have to work for something I believe in, even if it's just toothbrushes that definitely brush teeth.  \n\\- My face shows exactly what I'm feeling  \n\\- I get **migraines** from: being on the computer too much (I can be on for many hours, but not ALL day), loud and repeated noises, going in and out of AC too much, flashing lights, etc.  \n\\- I'm over 90% **introverted**, so I really need a lot of time to myself to recharge.  That means no more than a 40 hour work week and minimal social events.  I'm chill with having lunch with my coworkers and the occasional fun outing, but I couldn't do a job that relied on serious socialization.  Small talk?  No prob.  Telling you about something I believe strongly in?  Easy.  Getting to know people and networking with them?  I have some of the skills, but it's exhausting.\n\nPersonality: INFP, Ravenclaw, Enneagram 1w2\n\nSo I'm thinking I should look into being a secretary or doing some kind of writing, but I'm interested in knowing what other jobs might be a good fit for me and what experience you all have in those fields.",
    "title": "Teaching is wearing me down to the point where it's unhealthy. What careers should I look into?",
    "subreddit": "careerguidance",
    "timestamp": 1568775391,
    "score": 4,
    "keyword": "korean manager"
  },
  {
    "text": "28 and feeling very stuck...continue in TEFL? Physical Therapy? Environmental? Or something else? Some thoughts would be great to hear. 28F, I've been a bit all over the place. I've got an odd story and could really use some thoughts. I'm sorry, it's going to be LONG because I need to be clear!!! I'll def **TL;DR** it though!\n\nI earned my AA in Art Studio, then figured I should get my BA in something that might help me get a job more, so I majored in Art Education. I did love art but honestly wasn't very disciplined and never developed much of a body of work. I was able to get a job teaching in an after-school arts program and did that for two years along with another PT job in a gym daycare - I always had fun with the art teaching gig and a lot of days it didn't even feel like work. But, those jobs weren't enough to pay bills, I was still young and living with my parents but didn't feel ready to have my own classroom in a public school (actually, I breezed through college almost too quickly because I dual enrolled my senior year of high school, and I sort of regret it). \n\n[This is when I started noticing issues...I started noticing that I was having a really hard time working with other people when I worked in the daycare. I always worked with other girls and women and had to talk to the moms and customers a lot. I *always* felt anxious, and uncomfortable, and like I couldn't communicate properly. I think I hung around the little kids as a sort of way to hide from these things, like the fact that I didn't feel like I could talk with adults. I remember leaving work crying sometimes because of how weird I always felt. Sometimes I would just sort of check out, and I sensed that some of my co-workers knew something was wrong with me, although they were nice to me. I also felt stressed when my after-school art camp became a full-blown summer camp and suddenly I was working with a lot of other people. I remember this is when I started calling out of work from social anxiety...]\n\nI knew I wanted to travel, so I ended up going to South Korea to teach English. I had a hard time during that year but my experiences were worth it, I think. I think it's important to see more of the world. But it took a toll on both my physical and mental health. I had broken up with a guy before I left who I really loved - it was complicated - and that year in Korea was a tough year.\n\nThen, I came back to my hometown for 2 years and worked some PT jobs. 6 months in a bakery, 6 months in a deli, and about 5 months in Target. I had sooooo much social issues with these jobs and the deli job actually started making me feel suicidal, I wish I would have quit it sooner. I did make an alright friend in the bakery job, but I started realizing what a passive and quiet person I am and actually one guy told me that I could be really hard to work with, which crushed me. I think I'm just really hard to talk with, slow to catch onto things maybe, and super super distracted. Target actually wasn't too bad because I was working a very chill, slower-paced roll where I didn't have to be around people so much. But I didn't want to do it forever and again that kind of work doesn't pay the bills, SO...\n\nI went back to South Korea again. I felt pretty excited about it. I had even been continuing to learn Korean and was placed in a better area of the country than my first round. The first 2 months or so went pretty well, but then my health started to really deteriorate. I was losing hair, was feeling crushingly depressed at times, and the air pollution issue in the country was really bumming me out. I also felt super stressed at my schools and wasn't doing as well as I'd hoped. 4 months in, I decided that I wasn't going to stay for 2-3 years like I had planned to. :( I definitely didn't feel ready to leave the country and didn't want to come back to the US/my hometown, but my health was just getting so bad that I didn't really have a choice. I miss Korea every day now and still want to go back and somehow make it work there more long-term. \n\nWhen I got back, I found work at a smaller, slower restaurant as a server, but quickly found out that the manager was an absolutely horrible person. I was also really struggling as a server and was making all kinds of mistakes all the time - forgetting things and just being really absent-minded. My co-workers were alright about it but I couldn't take the abuse from my boss, I left crying way too many times and it just started getting too awkward working around him so much (he also never paid me any of the tip money...). \n\nSO, I'm almost afraid that I've developed an anxiety around having a job. I HAVE to get one, asap. This is horrible to admit but I have like $500 right now and am living with my parents, my life sucks. But I keep having so much flash-backs of all the things I've gone through and I feel so burnt out. I know it's mostly my struggles just being around other people. I actually am pretty sure I might have some form of Aspergers. \n\nAt this point in my life, I feel that it's most important to try to get a job in the Environmental field. I'm so fed up with what's happening with the world because of the fact that humans aren't caring for the Earth properly. But I haven't really been able to find a *job* to shoot for that would pay alright in that field, it just seems very wishy-washy and like you constantly would have to be fighting to be paid enough to live on. I don't want to be poor. \n\nI know that the healthcare field is ALWAYS hiring, but I've never been attracted to healthcare. And I don't think I'm a people-person. I've been considering doing something with Physical Therapy, there seems to be a lot of jobs in it and there's programs for it in my area. I do want a job where I would be on my feet more. But, I'm scared to start in on this and find out I can't handle how much I'd be working with other people. :/ \n\nI also think I could pursue TEFL some more, to see other countries (Japan, Spain, Taiwan, etc) but as cool as that life is, it also gets really lonely and stressful to do solo for too long. And teaching English isn't really what I want to do as a job. But, it's an option I suppose.\n\nAnyway, I've been looking at myself and I look SO burnt out and unhappy. I seriously just look like a wreck, I can't believe this is happened. I'll have days where I start to get working towards a path but then I'll feel so unmotivated the next day. How do I deal with this?? \n\n**TL;DR** Almost 30, feeling kind of burnt out and don't have many friends around (or a boyfriend), considering pursuing Environmental (passion, what I feel is important) OR Physical Therapy (good programs in my area, would teach good skills, good job outlook, would keep me active and on my feet) OR continuing with TEFL (have experience, am certified, could see more of the world). But, I have weird social issues and feel that I might have Aspergers - that plus the fact that I'm exhausted and unhappy is holding me back from moving forward with anything.",
    "title": "28 and feeling very stuck...continue in TEFL? Physical Therapy? Environmental? Or something else? Some thoughts would be great to hear.",
    "subreddit": "careerguidance",
    "timestamp": 1553481652,
    "score": 2,
    "keyword": "korean manager"
  },
  {
    "text": "Korean-American software engineer claims discrimination by Intel managers of Indian descent",
    "title": "Korean-American software engineer claims discrimination by Intel managers of Indian descent",
    "subreddit": "asianamerican",
    "timestamp": 1564275824,
    "score": 45,
    "keyword": "korean manager"
  },
  {
    "text": "Korean boy bands live in fear of obsessed female stalkers; authorities struggling to combat the problem Thorough documentation of the phenomenon:\n\nhttps://en.m.wikipedia.org/wiki/Sasaeng_fan\n\n> According to estimates given by celebrity managers to Korean media, popular Korean celebrities \"have between 500 to 1,000 sasaeng fans\" and are actively followed by about 100 sasaeng fans every day. Sasaeng fans are generally said to be females aged 17 to 22 years old who are driven to commit acts of, in some cases, borderline criminal behavior in order to get the attention of celebrities. These acts may include but are not limited to: seeking out celebrities at their dorms or homes, stealing their personal belongings or information, harassing their family members, and sending idols inappropriate \"gifts\" such as lingerie.\n\nTwo recent examples involving the popular group BTS:\n\nhttps://www.kpopmap.com/girl-tries-to-force-a-kiss-on-bts-suga-and-another-doesnt-wear-any-pants-to-get-bts-attention/",
    "title": "Korean boy bands live in fear of obsessed female stalkers; authorities struggling to combat the problem",
    "subreddit": "MensRights",
    "timestamp": 1549027962,
    "score": 34,
    "keyword": "korean manager"
  }
]