[
  {
    "text": "Day in the Life of a Forensic Accountant Hi all! I posted last week about my job and got a lot of questions about working as a forensic accountant (\"FA\") and how I ended up in this profession. For the sake of brevity, rather than restating all of that, attached is the link to that post (see the comments for where I talk about how I got into FA and my job search/interview tips) - [Initial FA Post](https://www.reddit.com/r/Accounting/comments/lhw2w8/i_brought_in_my_first_case/gn0lh2f?utm_source=share&utm_medium=web2x&context=3).\n\nSince I was asked to talk more about my job, I thought I'd give a glimpse into my life of working as an associate in the private sector of FA for a small firm in a metro city.\n\n8:30 am - get to work, get settled, read the news, check email, drink my coffee.\n\n9:00 am - check in with my manager to see what the goals of the day are\n\n9:15 am - locate a new case's court docket on PACER (electronic public access service for United States federal court documents), download/print/chronologically organize in a binder the pleadings, and read the pleadings while taking notes.\n\n11:00 am - go over my notes with my manager and do additional internet research as needed.\n\n11:30 am - switch over to another case where I'm completing a parts analysis for a case involving damages. In this situation, I have a bunch of data for these parts and need to determine what price to use for the parts purchased by the plaintiff since there's different price thresholds based upon purchase quantity.\n\n12:00 pm - lunch. Usually I study for the CPA during lunch.\n\n1:00 pm - continue my parts analysis, summarize my findings, tie down my data to the source documents, and review my work with my manager.\n\n4:00 pm - switch over to another case for which we received some new documents. I'll download them to the network, add them to our document log, and note on the log a brief description of what the document is (ex. May 2019 Bank Statement Acct x1234). Some of the documents are in Korean, so I'm researching translator tools for these documents.\n\n5:30 pm - go home\n\nSorry to crush some of your naive hopes and dreams that all FAs are fighting crime all day and taking down corrupt Wallstreet CEOs. Instead, a more realistic description is that I do a lot of research, need to be detail oriented in everything I do -- even in admin tasks like describing docs received, perform analyses/tie down my work, and I get to use my intuition to follow up on leads in the case that may be helpful.  All that to say... I'm a pretty normal accountant with a sexier job title, but my job is actually pretty fun. There's tons of variety among the cases I work on, and each case is a learning experience. What I ultimately love about my job is I usually have a pretty good idea of what I'm trying to accomplish with my work, but it's up to me to figure out how to get the work done. For me, that's the fun part... problem solving... there's a lot of that!\n\nAnyways, I hope this provided some insight into what FAs do, and if you're also a FA, I'd love to hear how your experience compares/constrasts with my own!",
    "title": "Day in the Life of a Forensic Accountant",
    "subreddit": "Accounting",
    "timestamp": 1613665940,
    "score": 57,
    "keyword": "korean ceo"
  }
]