[
  {
    "text": "24, Graduated with Bachelor of Arts, stuck in a job not related to my studies that I am passionate about. How do I transition out to a job in my major when I have no professional work experience in that field? This is my first time posting on anything on Reddit, I've lurked on here for years, but finally created an account because I feel so lost and I don't know where to go for advice so please excuse any errors in posting etiquette. I also apologize in advance for my long post, I tend to rant when I'm explaining unfortunately, but I sincerely thank anyone who will take the time to read.\n\nI graduated last year in April (2018) with a Bachelors in Arts, specifically in Honours Sociology and a minor in Psychology. However, all my electives were in political science because I have great interest in world politics, news, and government. I majored in sociology because I truly am passionate about social issues and policies.  I loved what I studied and am extremely passionate and knowledgeable and I thought I would be able to find a job after my schooling that would make use of my major. During my last year in university I even went on an internship abroad for 4 months in South Korea to work with a non-profit organization to help North Korean defectors assimilate into South Korea. I even worked on another project there helping to create a daycare program for Korean families on welfare. I also joined a club that focused on fostering youth leadership with UN's Sustainable Development Goals and volunteered as a campus ambassador for my school. I thought I was building towards a good resume for a job within my field of study. I tried to ignore the stereotypical joke about not being able to find a job when you have a bachelor is social sciences.\n\nHowever, job hunting in Toronto was extremely hard for me and for any new graduates to be honest and I was hard pressed to find any job that would take me because my start date to begin paying off my student loan was just around the corner. I applied to many entry level admin government jobs and program coordinators for non-profit companies (big and small) , and even research roles for sociological studies at universities in Toronto/Ontario. I landed a few interviews, but I think my nerves got the best of me and I just did not perform well in them and/or my resume just couldn't compare since I didn't have any real professional history on my resume besides part time jobs that I worked through university and my internship in Korea.\n\nI eventually landed a job as a Front Desk Associate (receptionist) at a private member's club, kind of like a social club for elite individuals like doctors, lawyers, judges, high business professionals, etc. I was super happy in the beginning because I finally got a paying job, but disappointed because it was nothing related to what I studied or wanted to do. I really wanted my career to be in anything that was working towards the betterment of society. Whether my job would make a small or big impact, I wouldn't care because I just wanted do something meaningful that could change just even one person's life. It doesn't mean I don't like my current job, I truly do because I do believe I am gaining great job experience and am learning a lot for a job in the hospitality industry. I may not be passionate about my work right now, but I definitely give it my all because I believe you should always do your best in any job., but I am worried I may be stuck in a field that I am not passionate about.\n\nI guess my question is how do I find a job related to my field of studies when on my resume employers will see that I have no professional job experience in the jobs that I'm applying for and the only professional job experience I have is currently working as a receptionist in a totally different field of work. I feel so eager to learn with so much passion, I know I may not have the job experience that many entry level jobs require in my field but if they could take a chance on me I know I could do whatever I needed to do to perform my best at it.",
    "title": "24, Graduated with Bachelor of Arts, stuck in a job not related to my studies that I am passionate about. How do I transition out to a job in my major when I have no professional work experience in that field?",
    "subreddit": "jobs",
    "timestamp": 1552690268,
    "score": 1,
    "keyword": "korean judge"
  },
  {
    "text": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist This post was created as a response to this thread and [comment](https://www.reddit.com/r/asianamerican/comments/bvxtgs/snapshot_of_miss_india_finalists_renews_debate/epuj6hq?utm_source=share&utm_medium=web2x) discussing beauty ideals\n\nI started typing up a message then lost it. I was gonna forget about it, but it really bothered me, as I see this kind of responses ALL the time in discussions involving asian beauty ideals. and judging from the replies and votes, the thread was no exception. So im typing up this post.\n\nFor some reason, we Asians have a hard time admitting that our beauty ideals have been heavily influenced by colonialism and eurocentricism. I think it happens because we don’t like to admit how much western ideals have been ingrained into us. Even as I’m writing this, I can’t help finding larger eyes, slimmer faces, and long legs more attractive than their counterparts.\n\nOther cultures have to face the self hate stemming from Western ideals outright, because they don’t have our convenient excuse of \"pale skin was always considered beautiful in Asia!!1\" I know I've said that more than a few times before I was forced to look beauty ideals beyond skin tone.\n\nI'm going to compare a few major old vs. modern beauty ideals below. Since I’m Korean, I’ll be mentioning a lot of modern Korean ideals and referencing older Korean texts, especially from the Choson period since that was the last period before Korea was introduced to the West, but I believe they’re pretty applicable to the rest of East Asia as well.\n\n&#x200B;\n\n1. Eyes\n\nLarge, double lidded eyes is the ideal eye shape in East Asia currently. However, this was not always the case. Many people will argue that large eyes are youthful and all cultures prefer large eyes, but this is an unsubstantiated claim.\n\nThe argument becomes even more unconvincing when we look at older Asian texts. In Korea, during the Choson era (which is the latest era before Western influences entered Korea), beauty was judged according to nine factors, called \\[gu-saek (구색)\\]([https://m.blog.naver.com/PostView.nhn?blogId=noa\\_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F](https://m.blog.naver.com/PostView.nhn?blogId=noa_1004&logNo=220518666214&categoryNo=7&proxyReferer=https%3A%2F%2Fwww.google.com%2F)).\n\nThe text never mentions eye size or even differentiates between double lids and monolids. The only requirement is that the \"eyes must be dark like midnight\" and that \"the eyes must be spaces appropriately.\" Other texts also mention that the contrast between the black and the white of the eyes are important, but again, never size or double-lid.\n\nSome texts even specify that (monolids with a slight slant upwards is preferred.)\\[[https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\\] This is in direct opposition to the large, double-lidded, almond eyes that are hailed as “beautiful” in Asia today.\n\n&#x200B;\n\n2. Face shape\n\nThere’s all kinds of plastic surgery in Asia focused on narrowing your face. Having a small face and head is an important part of “having good proportions.”\n\nHowever, an ideal face shape in the past was a round one, like a “full moon,” with a straight, broad forehead.\n\n&#x200B;\n\n3. Body shape\n\nCurrent beauty ideal is tall, leggy, with a short torso. People with longer torsos are considered to have worse “proportions” and there are calf reduction surgery being done to elongate our “stubby” Asian legs.\n\nHowever, in the choson period, long waists highlighting a woman’s curves was considered beautiful.\n\nFinally, we have older paintings and photos to draw upon. None of these women would be considered beautiful in Asia today. \n\n* [https://www.instiz.net/pt/4393935](https://www.instiz.net/pt/4393935)\n* [https://brunch.co.kr/@symriro/120](https://brunch.co.kr/@symriro/120)\n* [http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document\\_srl=13409659](http://www.djuna.kr/xe/index.php?mid=board&m=0&page=47&document_srl=13409659)\n\nI'm sure there are a lot more we could discuss, but the examples above clearly show how radically East Asia has been influenced by Western ideals of beauty as much as any other cultures. It’s time for us to start confronting our self-hate of our natural, predominantly occurring asian features instead of trying to deny it.",
    "title": "Yes, modern Asian beauty ideals ARE eurocentric and colonialist",
    "subreddit": "asianamerican",
    "timestamp": 1560845348,
    "score": 22,
    "keyword": "korean judge"
  }
]