[
  {
    "text": "Resignation Letter in Academic Essay Format I know quitting your job as a cook usually simply comes with two weeks notice or a ragequit walkout, but for eleven months I worked at a new franchise that had such potential which was being squandered by the incompetence of upper management. I present the nearly 6000 word thesis I turned in on my last day. Locations and names have been changed to cartoon references. Brackets represent ambiguous information in place of specific details.\n\nKrusty Krab ~~Careers~~ Jobs\n\nOpening in \\[Month/Year\\], Krusty Krab (KK) Bikini Bottom is on its 4th kitchen manager in less than a year. Krusty Krab O-Town has recently let go its inaugural kitchen manager and sous chef. Almost no member of the Bikini Bottom opening management team remains employed by KK. There is a pattern developing where one must question both the choice of employee and the directive given to new franchises. These lingering issues I brought concerns about in the first weeks of opening but was disregarded at every turn despite my experience with festival traffic. As a result I decided this was not a place I wanted to advance, but with a good-enough paycheck I’d be a lowly grunt in the kitchen four days a week, at five days a week I would have quit or been fired over a public outburst long ago. If Krusty Krab alters course slightly while being true to the brand this could be a successful chain.\n\nMy unique employment history in brick and mortar restaurants, food trucks, pop up culinary concepts, trade shows/conventions, and the film industry make me an ideal candidate to be on the opening team for new KK locations. My outgoing nature and foresight are valuable assets. For example, on training week before opening when I was standing around idly without a task I took it upon myself to organize the disarray that was dry storage. Overhearing Krabs tell another manager where he wanted the cleaning products placed, I had a jumping off point and the organization I created nine months ago is still largely in place. Since returning from my vacation in early February I have made it my mission to keep the storage area organized because it was again starting to resemble a hoarder’s house rather than a commercial kitchen. This is now part of my weekly routines because every time I turn my back there is more product being placed haphazardly just anywhere with little regard. I also recently reorganized the walk-in cooler because of problematic stocking with items being placed on the same shelf or below raw proteins. I also simply put all the like products together such as cheeses or fruits that were scattered amongst several shelves. With recent overordering I cannot keep up with the organization of the walk in cooler. The pattern recognition of food types and even simple shapes appears to be lost on the Bikini Bottom crew. My daily reorganization of containers is proof of this. Most days I’ll take a few minutes to put all cylinders together, all cambros together in descending volume, all deep and shallow pans next to each other rather than intermixed. My decision to be a kitchen manager at age 19 from 2005 thru 2008 and rarely enter restaurant management since is very calculated.\n\nWith my prior knowledge of professional kitchens I was becoming Bikini Bottom’s resident nag to coworkers as I made note of health department violations on a daily basis. I stopped after being largely ignored for two weeks. My regular health department nags include; a battle with jackets and hats being placed only in the designated area (a designated area that did not exist until I created a place for personal items a in January by neatly organizing the dry storage area again), waiting until prepped items are cooled before a cover is placed on top, placement of raw seafood, open containers (very often sugar, flour, and pancake mix bags ripped open and left), and dirty dishes/containers placed back in rotation. The dirty dishes and containers in rotation with the clean ones are at an atrociously high number. I have given up on making the 4th fryer seafood allergy safe too. With the low volume of seafood allergy safe items Bikini Bottom should purchase smaller baskets to visually discourage cross contamination with the other fryers and baskets. My skills to organize the kitchen do not end with simply where to store products to meet minimal health department standards.\n\nHalf of the space in the Bikini Bottom kitchen is completely wasted on an ill-advised walkway to the dishpit. An intelligent design would place a second doorway directly to the dishpit connected to the bar or where the bathrooms reside. Numerous times during the opening week of KK Bikini Bottom I said, yelled, sang, and muttered that we have too many food items for the amount of space we have. Icus stated that there was more space than Bluffington. Is Bluffington intelligently designed? Because Bikini Bottom most certainly isn’t. So Bikini Bottom actually has less space even if there is more square footage. See the attached diagram for an intelligent design that could potentially house a menu of this size. Bikini Bottom forces a line design on this kitchen when an open concept is needed for this menu. It’s as if this floorplan was created by a person who had only ever seen one commercial kitchen previously and couldn’t think 4th dimensionally to understand the needs of the workers to smoothly serve customers.\n\nThere is not enough counter space for pizzas without getting off the line, the microwave is placed completely out of the way, the freezer’s curved design is a waste of potential counter space and a falling hazard for containers stored on top of it, the toaster is an overcomplicated and overexpensive piece of machinery that serves exactly one purpose when a flat top could be used to toast bread and other purposes like a quesadilla special, sautee was designed without an overhang for spices, the pantry station lacks the counter space to have two containers of flour and two containers of batter for seafood allergies, there are no Frialator fryers which I have worked with at every single kitchen job previously instead we got the cheap Vulcan model (is that logical), the cheap low boy in pantry that doesn’t drain excess water anywhere it’s just supposed to evaporate somehow but doesn’t, the grill and fryer should be placed next to each other (with a higher volume of crossover than other stations), the floors are flat instead on having a mild decline towards the drains (just look at the standing water residing behind the oven right now), in the dishpit the spraying area and the filled sinks are backwards of a logical dipshit, the ramp to the back door is on the wrong side, there is no refrigerated place downstairs to stage extra food for busy shifts (the beer cooler is once again used for such food items because of this massive oversight), the prep station is an afterthought and miniscule, the dishes on the line are difficult to grab for anyone under 5’11” and inaccessible for anyone under 5’6” (instead of putting them underneath tables that also give that desperately needed counterspace I spoke of), there is not enough space to store to-go containers or boats behind the line, expo is lacking a low boy for the numerous items that are supposed to be cold but are instead kept at room temperature all day long, no one in management thought about buying shelves until right before Bikini Bottom opened as a result the clean full sheets sat on the floor for days, we had only the exact amount of 1⁄6 pans for an absurd amount of time making it impossible to rotate and clean them when necessary (which is daily), we still struggle with 1/9 pan supply. And just when I thought I documented all the poor design choices possible I stumbled upon a person whose office holiday party was booked at KK Bikini Bottom. The deck space works just fine as a deck. It does not double well as a gathering space. The space is too long and narrow for parties, it promotes little splitoff groups rather than a coming together of a larger gathering. It may be advantageous to contact a social psychologist for help designing a private party space that promotes intermingling rather than enforcing small pockets to form. The reorganization of the physical kitchen isn’t all that screams for an overhaul.\n\nThere are six positions on the line at the Krusty Krab; expo, oven, grill, sautee, fryer, and pantry. But the pantry and fryer positions are forced together like a bad remix. Everyone who mainly works pantry deserves a $6 raise immediately because it is a station and a half. Both Icus and Krumm, while kitchen manager, kind of acknowledged the pantry is too big for one station without outright mentioning the lopsided distribution of work. I imagine in the only location where this works, Bluffington, a second person joins the pantry at noon because of the unreasonable amount of items one person is tasked with. Bikini Bottom only has one person in this position at all times, maybe modify it for one person? The excess of items on the pantry position largely resembles a position I would call “set-up” or “build” at a previous job that made sensible choices. This build position should have tostadas, tacos, butcher’s blocks, toast, salads, lettuce wrap set ups, and preparing plating for whichever station is most bogged down. I have absolutely lost my mind yelling about salads at least once a month, ranting that they do not belong on the fryer position because of how illogical it is that five salads are included on the mountain of other items the pantry has. I have always considered working in a kitchen a kind of dance, and the pantry station demands an unnecessarily convoluted dance to keep up with the demand. Without the salads, tostadas, and tacos the station is already the busiest. Do we really need to combine ballet and swing by including these extra awkward dance steps in this single station? For a kitchen designed this poorly I suppose it is. Again, see attached document for an intelligently designed kitchen that might be able to accommodate this menu. Unless Bikini Bottom is going to close for a month to fix the baffling floor plan design the menu is shouting to be reduced to 30-36 items.\n\nThe menu is too big. Krusty Krab is the jack of all foods, master of none. In general I believe individual locations should be allowed 18% omissions, and 18% unique items to this wildly unwieldy menu sitting around 50 food items including sides. The insistence on keeping menu items that don’t sell at Bikini Bottom because of Bluffington is mind boggling. Chicken tenders do not sell at Bikini Bottom. fried sushi does not sell at Bikini Bottom, not enough to justify their place on the line. I don’t care how well these items work in Bluffinton. They. Do. Not. Work. At. Bikini. Bottom. If the KK location in the middle of the Atlantic Ocean sells an incredible amount of live krill does that mean Bikini Bottom and O-Town must sell live krill too? Take the fried sushi off the menu. I had a complete meltdown about this during a Dimmadome service and my valid point was met with indifference. Replace the kid’s tenders with a kid’s fish sticks. We already have the tilapia fish sticks on the line for tacos. Or make the kid’s fish sticks cod. We cut cod to order for fish tacos in spite of health code violations because it is too rare of an order to make beforehand. Saffron in mashed potatoes? If you must. Why are green tomatoes only on the menu during lunch? Bikini Bottom throws away a sizable amount of spoiled green tomatoes each week. Have green tomatoes on the menu all day long or don’t have them at all. The smoked salmon could go on salads or a special taco to justify its place on the line. The corn pico’s place on the line is unjustified. It only goes on one item, tostadas, which are not particularly popular. If we had a taco salad we could throw the corn pico on there. We also have unreasonable waste from unusable taco shells, smash up those imperfect taco shells and throw them on said taco salad. But before we add salads, let's get rid of the pear and kale salads. The pears' position on the line are unjustified, if we threw them on a taco variation maybe their place on the Bikini Bottom line could be argued but for now they only go on a salad that isn’t particularly popular. The kale salad is an issue of space for a 4th green for salads is too much. The krusty salad is my most hated house salad of all time. And it comes down to the toast with goat cheese. This ancillary step of spreading goat cheese on a cracker is an unnecessary step for an overly complicated dance and should be part of the expo dance if expo wasn’t a shoddily designed afterthought lacking a low boy.\n\nThere are a plethora of squeeze bottles on the pantry station that have no place on the overloaded station. They belong to an expo station with a low boy to keep them cold. Pantry has an overwhelming ten squeeze bottles: chipotle crema, sweet chili vinaigrette, buffalo, korean bbq, ranch, caesar, wine vinaigrette, lemon vinaigrette, honey mustard, and lemon aioli. Only the first four are justified on an intelligently designed fryer section, the second four belong on the build station, the last two have no place anywhere but expo. With this extra space sautee could keep their bottles and two purees cold in the fryer's lowboy instead of leaving them at room temperature all day inviting a pathogen party. This theorized intelligently designed expo would have room to keep these four squeeze bottles and a double of every sauce chilled to pour them into ramekins, a move that is highly common in the expo dance. The fact that expo doesn’t have a double of all squeeze bottles is foolish. Expo has to bother an overloaded station to pour these side sauces instead.\n\nHow many gallons of basil aioli has Bikini Bottom thrown away in 11 months? Four aiolis in general is way too many and most go on a single item; basil aioli on the incredibly unpopular veggie burger, lemon aioli for calamari, sweet chili aioli for the BLT that is only served half of the day, and garlic aioli actually goes on two items…I believe. What a colossal waste of precious little space, lose two aiolis and then you can sing the logical song with me. Perhaps we can put garlic aioli and sweet chili vinaigrette on the BLT separately and accomplish the exact same thing the sweet chili aioli does. The wings too have unneeded complications. Having worked at a sports bar specializing in wings for the better part of a decade I find KK’s plating of wings to be overly pretentious. The carrots, celery, and blue cheese have lost function. Heffer Wolf always said no one eats the carrot/celery julienne with blue cheese. It’s a complete waste of all the ingredients because you’ve gone too far with the presentation. Wings aren’t fancy. Wings are supposed to have a small pool of sauce and be sloppy. It’s like a sloppy joe that’s not sloppy, an unsloppy joe is a failure to sloppy joes just as the KK presentation of wings is a disparagement to the dish. Ever since training week back in 2022 I have used a scale to give Bikini Bottom a passing or failing grade.\n\nChokey Chicken to Chum Bucket is the scale I use to judge efficiency and sanity at Bikini Bottom. Both establishments are upscale casual dining experiences in Capitol City in the same vein as KK. Chokey had high employee retention and relatively smooth openings for new locations. Chum Bucket’s employee turnover was high and every location opening was chaotic. Which one sounds closer to KK? Chokey Chicken was filled with chefs I respect including Chef Ren Hoek who remains a close friend to this day. Ren lost his lifelong passion for kitchen work after working management at Chum Bucket. He’s actually seeking work in Bikini Bottom. Call him up at \\[phone number\\], but KK will give him Nam’ flashbacks of why he chose driving for a living rather than cooking for five years. The pair of us together helming Bikini Bottom with the ability to omit and create 18% of the overloaded menu can bring success to this franchise. We have worked well numerous times in the past on various concepts in the past including creating The Attack of the Pickled Tomatoes Burger for \\[Promotional live performance of a TV show\\] at the Capitol City Theater. We served 100 people in 60 at the \\[sitcom filming\\] lunch. That’s physically impossible but somehow we did it quite a few times.\n\nA fun anecdote about Ren Hoek’s KK experience from the soft launch; on training week numerous times I brought concerns about being seafood allergy safe that were dismissed. As mentioned earlier the pantry station lacks the counter space to have two containers of flour and two containers of batter, one each of which seafood never touches. Before the soft launch Chef Stimpy from Bluffington insisted all customers just kind of know everything is prone to be seafood contaminated. Well, chef Ren was a customer that night and this absolutely was not communicated to customers. He claimed to have a slight seafood allergy and was not informed of what the crab soup was. In reality he does not have a seafood allergy. I didn’t discuss the seafood issue with Ren, separately we noticed egregious violations of food safety standards and we each responded in our own way. The soft launch service was so awful that night Chef Ren walked out of a free meal to pay for some ramen, never to return to Bikini Bottom. I attribute this oversight, and many of Bikini Bottom’s (and probably O-Town’s) problems to hubris over the Bluffington location.\n\nChef Chokey would also be hesitant to join the KK team. It will cost a finder’s fee just for me to reveal Chef Chokey’s name. Chef Chokey was a lead in the rapid expansion of Chokey Chicken restaurants. He opened numerous restaurants and was big on the philosophy that each restaurant must have its own personality in order to fit the unique local culture and the variety of working spaces. This is in direct conflict with the KK way that everything must be exactly like the Bluffington location no matter what. There was only one Chokey Chicken location that had the full menu, Chokey Springfield. Chokey Springfield had a large space which was intelligently designed to accommodate such a large menu. The KK menu is all over the place, closing in on 50 menu items which comes up as a failure on the Chokey Chicken/Chum Bucket scale. This is not the only area KK comes up as a major failure on the Chokey Chicken/Chum Bucket scale.\n\nHas anyone in this company ever worked festival traffic before? Does anyone have the experience of working next to a major venue with 8000 seats before this one? The way Bikini Bottom handles Dimmadome services it certainly appears that the decision-makers fall on the wrong side of the Dunning-Kruger effect. Having all 50 items available during such massive traffic is completely asinine. An unwillingness to serve a partial menu is hindering the Bikini Bottom kitchen staff. I have worked festival traffic before, and Dimmadome events bring in festival traffic. I’ve worked inside a festival whose line never ended but every customer got their order in 5 minutes or less because the line kept flowing with only four items on the menu as that’s what was warranted at the B-Sharps Music Festival. I refuse to be set up for failure the way Bikini Bottom sets up Dimmadome services for failure. The entire week of concerts in \\[summer\\] 2022 I was set up for failure every day (it was after this I modified my availability to keep my sanity and my paycheck). When I brought my concerns about running efficiently during Dimmadome services I was labeled a B-worker for the first time in my employment history by Icus and Krabs. It is that moment which I was either going to holler at them both for being 2-dimensional thinkers who were obviously unqualified for the positions they accepted in this company, or just put my head down. If Bikini Bottom has a successful concert day service, hail your team because they snatched victory from the jaws of defeat. They swam with concrete shoes. I often wonder how many customers had bad experiences and never returned after concert days. A Dimmadome service should have no more than 25 items and have one or two specials to divert traffic towards an area the kitchen can keep moving. An Open Cup Open Plate (OCOP) special for foot traffic is absolutely needed. When I suggested OCOP special, Heffer was intrigued by this idea and immediately named burgers as the special to keep foot traffic flowing. Smithers wouldn’t hear this idea, babbling on about what’s advertised instead of hearing out a sound idea. This prattle despite radio commercials having inaccurate hours and social media promoting Bikini Bottom’s steak tacos to this day. I always found Smithers to be a better fit as a middle management office pencil pusher than as a hands-on restaurant manager. Overall I find KK managers are selected to be automatons not to question their orders rather than critical thinkers who could take the restaurant to the next level. During brunch service is another period of time that must be modified to lessen the heft of items. Having a full menu that barely works plus brunch is so deep into Chum Bucket territory, in my opinion we now have to use the Tropic Thunder scale of full \\[R-word censored by r/jobs\\] to describe a 60-plus-item brunch. Chef Ren hired back a Chum Bucket cook who had a mental breakdown and stormed out during brunch (plus full menu) service because Ren knew the employee was justified and upper management was completely unreasonable in their brunch requests. It’s not just questionable decisions that hinder KK staff but improper equipment as well.\n\nThis is the first restaurant I have worked at which uses a touch screen on the line rather than tickets. From day one I found this to be technology for technology’s sake inferior to tickets. Chef Ren forced a new Chum Bucket location to rip out touch screens from the line and bring in ticket printers because of the higher efficiency. The touch screen is a great idea for expo, not the entire line. My biggest gripe is that each station does not get all the information. Early on I was regularly yelled at for not staggering my items, well I can’t see the rest of the order; a problem I have never had with a ticket system. Touchscreen software is also much more prone to errors and glitches. When I reported an error during a heavy service Icus and Krabs blamed my skills on the line without looking into the malfunctioning screen further. It was glitchy for weeks before the two finally investigated and corrected the issue I brought to their attention long before. Those two gave me an immense amount of ammunition to dislike them in the opening weeks until I stopped caring. The issue I had with being unable to scroll beyond the bottom of a completely filled screen has returned and is still there as of \\[my last day\\]. There are also important details that get buried. A frequent meltdown I have is that sauce on side requests and other important modifications are not capitalized or in red to catch the eye as they have been at jobs with tickets. These details get lost on Bikini Bottom’s touchscreens. A sauce on side salad made by me will be wrong 50% of the time because of the instructions being camouflaged in a word salad. This goes for coleslaw on the side and drizzle on the side too. Drizzle in general I dislike because of the pretentiousness, but whatever, drizzle it on top rather than putting it in a ramekin if you must. There are numerous places where Bikini Bottom overcomplicates matters for reasons I cannot ascertain.\n\nWhy is there such a large variety of plates? Why do we have a medium circular plate for salads and a large bowl for salads with protein? This just confuses the simplest of matters. I was told this is done because of the high price hike with protein, a larger presentation was desired. But that price hike is the price of protein in 2023. Bikini Bottom should put all salads in the large bowls and use all the circular salad plates in a skeet shooting promotion. I understand why we have both a circular platter plate and a pizza plate but in my restaurant the circular platter plates must go...or maybe the large platter plate instead. Is the large platter used for anything besides fish and chips? That extra space on fish and chips plates are only used for side sauces which can easily be delivered to customers on small circular plates. What is the medium oval plate doing that the medium rectangular plate isn’t? And vice versa. Why do they both exist when they are approximately the same size? Let me write an internet commercial where we break a lot of plates so we can get some logical use out of the superfluous plates. I don’t care which one is destroyed, the ovals or the rectangles but one of them is an unnecessary redundancy in excess done again. Speaking of commercials, the unimaginative radio advertisements for Bikini Bottom are doing little to lure new customers to the restaurant.\n\nThe three radio spots I have heard on KBBL all sound like they were produced by a marketing 101 student who wasn’t a natural in the field. The voiceover actor was so uncharismatic I was certain someone from the office was chosen at random to read the copy. Then I heard that same voiceover actor selling pool supplies on another radio station so I concluded that Bikini Bottom must have hired the cheapest guy in town to produce the most basic of commercials. Perhaps there is someone else you could hire more qualified to voiceover these commercials, an actor with experience on an Emmy award winning cable program whose unique place in the film industry was written about on \\[website\\] would be a much wiser choice to be the voice of the KK? (See external link). In the ad there was no catchphrase, no jingle, no music whatsoever. This simple approach to commercials lacks the pizazz to catch the attention of radio listeners. The first two commercials I heard would get a C in marketing 101 as they were nearly the exact same and accomplished the bare minimum to sell wares, the third one would maybe get a B- because there was some sort of attempted gimmick with the voiceover whispering to represent thinking inside his head about what he was going to eat later at KK. Not only does this commercial give no reason for the man to think inside his head, the outside world still and unpopulated. To see what a creative person would do with this concept see the attached script. There is an attempted slogan that could become part of an ad campaign. Commercials aren’t the only lost opportunities in promotions.\n\nThere are numerous promotional celebrity tie-ins at Bikini Bottom’s fingertips with Dimmadome performers. The restaurant could have a Phish sandwich as a OCOP special on \\[Phish performance dates\\], or a pretentious Jelly Roll on \\[Jelly Roll performance date\\]. Has anyone reached out to the Dimmadome theater or talent management for approved special menu items to be promoted inside the dome? Perhaps a special 20% discount to ticket holders? Is Bikini Bottom capable of getting permits to extend Open Container hours beyond \\[cutoff time\\] for an afterparty or block party throughout a Dimmadome concert? I see additional marketing opportunities left on the table for all new locations.\n\nI believe new KK locations are missing out on a marketing campaign by opening with the entire cumbersome 50 item menu. This is a staggering amount of menu items which is too much to ask new staffers to perfect all at once. After a few months expanding the menu by approximately ten items is catching to customers who haven’t returned after a single visit or infrequently stop into KK. There are ten new food items that might appeal to them. Just like it appears KK doesn’t know what it’s looking for in a good commercial spot, this company doesn’t appear to recognize a talented from an untalented worker until it’s too late.\n\nIt is my understanding that KK had a headhunter to find Icus, the first Bikini Bottom kitchen manager. If it were up to me I’d hire someone to break the legs of that headhunter for bringing in a subpar kitchen lead. We are still attempting to recover from the lousy choices she made in the floor plan. If anybody responsible for Bikini Bottom’s floor plan is still giving input, stop them immediately. Once the doors were open to the public Icus had his head in the clouds to a point where I questioned if he saw the writing on the walls of an imminent demotion and stopped trying as a result. I had a full deck of 3x5 cards in an archaic powerpoint presentation bringing numerous concerns to light that he kept putting off listening to until he was fired. Those same cards were broken out for this essay. The second kitchen manager, Krumm, is a good lesson in honesty. According to Heffer, Krumm was given a bill of goods about how smoothly KK Bikini Bottom was running. Since Krumm stepped into a latrine pit which he was led to believe was a heated pool, he left in short time. Krumm also had plans to modify the menu but when his bosses told him to be a rodeo clown rather than a cowboy Krumm didn’t take too kindly to that. Meanwhile Heffer was the savior of the Bikini Bottom kitchen. I didn’t agree with every single decision he made, but I did with a majority of them. Heffer’s overhaul was such a blessing so I didn’t have to fiddle with the organization of 60% of the equipment anymore, only about 20% now. Too bad Heffer’s crippling depression came back after bashing his head into the wall out of frustration with the shackles KK restrained him with.\n\nThe current management team is enthusiastic but inexperienced. I see an accumulation of small infractions that might bring down Bikini Bottom’s health department rating significantly. I see the entire management team being inattentive or unaware about organizational issues. Whatever bureaucratic nonsense corporate tasks everyone with from the original sous chef Skeeter to Patty Mayonnaise that makes them walk away from the line between 11am and 1pm especially is infuriating. I have never been left alone on a multi-person line during peak hours so regularly, and I won’t tolerate it anymore. As much as I believe in his drive, I imagine our current kitchen manager SpongeBob will be let go after a disastrous service during the Dimmadome concert season that someone has to take the fall for. Chef Ren and I could help bring experience in management and dealing with festival traffic...if corporate does not force us to follow a failing strategy.\n\nAfter working nearly a year at KK you may ask why I’m not proficient on more than one station. Excellent question. First, when I move over to another station the squeeze bottles are never labeled (until Stu Pickles was hired, now they’re sometimes labeled), so I always looked at the glut of unlabeled sauces and I’d go back to my station because the basic information is missing (also a health department violation for having numerous unlabeled, unchilled bottles). In his first week the new general manager Stu Pickles pulled out 90% of the containers under the grill station because they were lacking labels despite an expected health department visit. The second reason for my menu ignorance is the mountain of prep for my own and upcoming shifts I have piled up on my station throughout service. My attention to detail appears to be next level with my ability to anticipate stocking all items for all shifts including the weeknd. The third reason I wouldn’t learn multiple stations is a defense against the afternoon conference calls. In \\[month\\] the Bikini Bottom line was unprepared for a busy post lunch because one cook was cut and our expo person was busy with a conference call. The two of us remaining on the line had a miserable slog through an unexpectedly busy afternoon. When I brought this up to Krabs he disregarded me, being a good bean counter he quoted the cost percentage. What he didn’t take into account was the missing expo person who could have jumped on the line and expo to help the understaffed two man team. That person was stuck on a conference call. Just recently I saw the company actively lose money because of this poorly thought-out meeting during business hours. A customer wanted to order a dessert that was 86ed but had been restocked by our prep cook an hour before. The server was unable to sell them their dessert because the only person in the building who could help un-86 an item was on a conference call. This conference call calamity is another bone-headed choice that speaks to a larger decision-making problem within the corporate structure. Finish the conference calls by 10:45 am eastern.\n\nIn conclusion, I quit my position as a lowly grunt for this company because of its unwarranted perplexing dance steps and below average management. I don’t care how much varnish and lacquer is supplied, I refuse to polish this Bikini Bottom turd as a manager or full-time employee under the current circumstances. You would have to take a pickaxe to the floor, possibly relocate the bathrooms to add a door to the dishpit, get rid of the cheap low boy that doesn’t properly drain excess water, and Mr Gorbachov knock down that wall in the middle of the kitchen to give the proper amount of space to work. Or simply reduce the menu to 36 items (including sides) because that’s the amount of space this dreadful design can comfortably output. Would Gordon Ramsay compliment KK for all the unnecessary convoluted complications abound, or would Chef Ramsay yell about keeping it simple and demand KK chuck it in the flip? Thanks to the numerous pop up restaurants I have been a part of and the hectic world of trade shows/conventions, I may have more experience than anyone else employed by KK in smoothly opening a new location. I would enjoy being part of the opening team to ensure new locations have an efficiency Bikini Bottom lacks, and to keep upper management away from their worst instincts. Work with me and Chef Ren and we will help you become a well oiled machine like Chokey Chicken instead of the Chum Bucket cesspit Bikini Bottom currently embodies.",
    "title": "Resignation Letter in Academic Essay Format",
    "subreddit": "jobs",
    "timestamp": 1685633924,
    "score": 0,
    "keyword": "korean judge"
  },
  {
    "text": "A man (53, civil servant) in Korea, who lured a 12-year-old elementary school girl outside by contacting her through social media and raped her in a car and broke into her home, gets suspended sentence (= no jail time) **News link:**\n\n[https://www.ytn.co.kr/\\_ln/0115\\_202301191421105348](https://www.ytn.co.kr/_ln/0115_202301191421105348)\n\n&#x200B;\n\n>A man (53, civil servant) lured a 12-year-old elementary school girl outside by contacting her through social media and raped her inside a car in Oct. 2022.  \n>  \n>Once police investigation started, he broke into her home and the bedroom, saying he wants to apologize and was arrested on the spot.  \n>  \n>At first, he was charged with statutory rape and got 4 years in jail, but he appealed.  \n>  \n>And now the court has just given him 3 years in jail and 4 years in suspended sentence, meaning no jail time.  \n>  \n>2 years of probation and 40 hours of viewing videos on sexual violence are also added.  \n>  \n>As for the reason for the suspended sentence, the court has said \"the crime is not light, but he admitted the crime and has compensated the victim, and the victim doesn't want him to be punished.\"\n\n&#x200B;\n\n=============================================\n\n&#x200B;\n\n**EDIT 1:** \n\nIn Korea, sex criminals routinely get away with only a slap on the wrist, found not guilty or get suspended sentence (meaning no jail time) or only get a small fine, etc. and the reason is because of a certain law that many Koreans have been demanding to be abolished for years.\n\nKorea is like one of the few countries where they still have this law that allows criminals or sex criminals to be able to avoid (heavy) punishment or jail time if - IF - the victim doesn't want the criminal to be punished.\n\n**The reason why such a law is so problematic and condemned and abolished in many other countries is because it enables/encourages the criminals to harass/bully/threaten the victim's safety, life, family, job, etc, etc, to force them to say to authorities that they don't the criminals to be punished.**\n\nSo, out of fear of retaliation, victims often end up not reporting the crime or telling judges in court that they don't want the criminals to be punished.\n\n&#x200B;\n\nThe compensation part is also very problematic because sex criminals in Korea often just throw some (small amount of) money to the victims to settle out of court or to pretend and show to judges that they deeply regret their actions.\n\n**In Korea, just the action of trying to give the victim however amount of money and saying sorry to JUDGES (NOT victims) and writing apology letters to JUDGES (NOT victims) help these criminals to get suspended sentences and avoid jail time.**\n\nYou actually often read news in Korea how some criminals wrote dozens or hundreds of apology letters to judges (but NEVER to the victims) and how the judges were so moved by the letters that they reduced sentences for these criminals or gave no jail time.\n\n&#x200B;\n\n&#x200B;\n\n**EDIT 2:**\n\n**Every single day, Korean newspapers are filled with these news articles where some sex criminals have gotten suspended sentences (= no jail time) for being the first time rapists, having tried to give some money to the victims, having written many sincere apology letters to the JUDGES (Never the victims) AND BECAUSE the victims don't want the criminals to get punished.**\n\n**This is why so many Korean women call Korea a rape cartel,  a republic of rapists, a country for and by rapists... because the politicians, lawmakers, cops, judges are all on the rapists' side.**\n\n&#x200B;",
    "title": "A man (53, civil servant) in Korea, who lured a 12-year-old elementary school girl outside by contacting her through social media and raped her in a car and broke into her home, gets suspended sentence (= no jail time)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1674885306,
    "score": 151,
    "keyword": "korean judge"
  },
  {
    "text": "“Kim Hyeonjin, Born 1998,” A Girl Falsely Framed As A #MeToo Liar **Link (English):**\n\n[https://ildaro.blogspot.com/2023/05/kim-hyeonjin-born-1998-girl-falsely.html](https://ildaro.blogspot.com/2023/05/kim-hyeonjin-born-1998-girl-falsely.html)\n\n(Original: [https://www.ildaro.com/9596](https://www.ildaro.com/9596) )\n\n&#x200B;\n\n&#x200B;\n\n[ On March 30th at 10:45 a.m., Cheongju District Court held an appeal hearing for Park Jinseong’s civil suit for defamation by public allegation of false facts. The victim Kim Hyeonjin \\(front row, fourth from the left\\), and her lawyer Lee Eunui \\(front row, fifth from the left\\) are in front of the court with supporters gathered in an act of solidarity. ](https://preview.redd.it/n13fotzks25c1.jpg?width=750&format=pjpg&auto=webp&s=e6f636d0503a02ef32c7cb9d6803a8aa43eefb77)\n\n&#x200B;\n\n&#x200B;\n\n# [“Kim Hyeonjin, Born 1998,” A Girl Falsely Framed As A #MeToo Liar](https://ildaro.blogspot.com/2023/05/kim-hyeonjin-born-1998-girl-falsely.html)\n\n## “The Law Stands with Victims” Series: The time Park Jinseong’s victims have walked through\n\nBy Lee Eunui\n\nPublished: March 30, 2023\n\nTranslated by Jun Jihai\n\n&#x200B;\n\nIt was the fall of 2019. A few women writers came in. Yoo Jinmok was one of them. What brought them to my law office was not their own doings. That day I heard a familiar name again, “Kim Hyeonjin, Born 1998.” \\[This is a reference to Cho Namju’s novel *Kim Jiyoung, Born 1982*. The book deals with the life of an average woman in misogynistic Korean society. It faced a harsh backlash from anti-feminism communities.\\]\n\n&#x200B;\n\n&#x200B;\n\n**A Poetry Class Ruined by Sexual Harassment**\n\nIn 2015, Hyeonjin was a 16-year-old high school student. Living in a small town, she wanted to study creative writing in college to be a poet, but she had no idea what to do to make that happen or how to write poems. The only resource she could count on was the Internet. She found Park Jinseong's blog, and his online poetry lesson was 120,000 KRW per month. Getting into college could not be an additional burden on her mother's shoulders, which were already heavy with the weight of working at a diner to feed her family as a single parent. That 120,000 KRW was all she had collected by saving little by little for over a year. But she decided to pay the fee to take his class.\n\nHyeonjin had been thrilled because she thought it was an excellent opportunity, but she became pretty uncomfortable once the classes started. Park Jinseong seriously sexually harassed her during the month via the Kakao Talk messenger app and phone calls.\n\nThe poet, who was 20 years older than his student, sent her Kakao Talk messages almost every day. “Let’s hold hands while walking on the streets,” “I will be your lover/because I want to,” “Be my lover,” “Do you have any experience with women? Have you ever held hands, kissed, hugged, or even had sex with one?” “Not just a teacher/I’m your teacher and a man,” “I will kill myself if you turn me down,” “It’s possible to have sex with each other’s mind /Our minds can be purely blank while our bodies are having sex,” “Hey, /I wrote a poem/Have I shown you?/It’s super erotic/It’s about sex/Wanna read?” “I want to have Bread-Hyeonjin.” He called her and said, “Women should be taught by men to be a woman.” In addition, he even asked for a picture of Hyeonjin in a school uniform.\n\nIt was a dilemma for Hyeonjin: she could not give up the poetry class that she had scraped up every penny to take, but she did not want to tolerate and respond politely to such remarks. She expressed her discomfort: “Don’t say things like that,” “I will report you to the police for violating the Act on Sex Offenses against Youth.” (The actual name of this act is “Act on the Protection of Children and Youth Against Sex Offense”.) But he didn’t stop. This middle-aged poet sexually harassed her, hinted that he knew her high school, and said he would go there to give her a book. Hyeonjin used to look up to him as a poet and a teacher, but his words were not merely disappointing but rather shocking to her as a girl who was only 16 years old.\n\nShe told her concerns and frustrations to her best friend every day. It was a subject that she could not bring up with her mother who was working hard to raise her and her older brother all alone. The fall of her second year in high school, the first step toward her dream—these were both stained by intolerable acts of sexual harassment. As she could not endure it anymore, she had no choice but to end the poetry class.\n\n&#x200B;\n\n**Falsely framed as a “defaming gold digger,” Hyeonjin gave up being a poet**\n\nAfter several months, Park Jinseong reached out to her with an offer of more poetry classes, but Hyeonjin did not respond. When the college entrance exam was right around the corner, she tried to get in touch with him to get advice on polishing her poetry drafts. The man who persistently tried to get a high school girl as his lover suddenly kept silent. Hyeonjin did not resent him for this or consider it odd. Memories of the sexual harassment and uncomfortable feelings of the year before came back, making her skeptical about her chances of going to college to study creative writing or composing poems. In the end, she decided to give up on poetry entirely.\n\nHer mother and school teacher suggested choosing a different major, and she did. At that time, the #MeToo movement was sweeping Korean society. Hyeonjin heartily joined the movement. She wished for there to be no more victims like herself. So in October 2016, she wrote a Twitter exposé on what she experienced without revealing the perpetrator’s name.\n\nEven though she did not write his name, Park Jinseong knew what she wrote was true and the perpetrator in her tweets was himself. Perhaps that is why he tried to contact her right after she made the tweets. Revealing the truth in an open space had a real impact. The middle-aged man finally gave her the apology that the high school girl could never get even after refusing him many times with desperate words such as “You are violating the Act on Sex Offenses against Youth” or “I like girls, not boys.” But his apology was conditional. He insisted that she should not tell anyone his name. He would kneel before her to apologize, give her free poetry classes, and pay for therapy, he said.\n\nHyeonjin said no to him many times, but that was not enough to stop him from insisting she should not reveal his name and pressuring her to accept his apologies. At not even nineteen, young Hyeonjin was intimidated by the fact that he knew her number and was tired of this never-ending conversation. Her initial intention was to express support for the victims by sharing her experience with no angle for compensation. Hyeonjin’s remark, “I’d like to have money if you insist,” should be understood as a rejection and an attempt to end the conversation, not literally. The perpetrator offered compensation, such as free poetry classes or payment of medical expenses, but Hyeonjin rejected all of them. She did not ask for anything.\n\nHyeonjin’s refusal to be silenced took a heavy toll. \\[Hyeonjin revealed the perpetrator’s name on March 29th, 2019 on Twitter.\\] Even though the messages clearly full of sexual harassment and pressure to be silent were still there, like feces on the streets, Park defamed her by making a statement online that “Kim Hyeonjin, Born 1998” was a criminal who defamed him with lies. He maliciously edited their Kakao Talk chats to frame her as being after money. Sometimes himself, or sometimes with his lawyer acquaintance, he urged her to ‘confess’ and apologize. He even exposed her name, age, hometown, and pictures of her on the Internet without her consent. This went on for years.\n\n&#x200B;\n\n**The victim was not aware of a lawsuit related to herself; the perpetrator’s win in court against a newspaper led to him suing Hyeonjin.**\n\nPark Jinseong turned the victim, a 19-year-old college student, into a “defaming gold digger,” and filed a civil lawsuit against *Hankook Ilbo*, a Korean newspaper, arguing that its reporting on him in relation to the #MeToo movement was false. \\[In 2016, *Hankook Ilbo* issued several reports on allegations of his sexual harassment against five women.\\] Hyeonjin was not even aware that there was an ongoing trial at that time. Of course, she had no chance to defend herself. In that first trial, the court took the perpetrator’s side, saying that the newspaper's reporting was “defamation by public allegation of false facts.” The decision was indifferent to the truth. The sexually harassing messages dumped over a 16-year-old girl like sewage were submitted to the judges as evidence—but they believed she had faked it. The lawsuit case was settled through arbitration at the appeals court. And Hyeonjin, even at that moment, was excluded.\n\nThe court’s wrong decision left repercussions. Anti-feminism communities, dominated by male users, had Park Jinseong as a symbol of a victim of the false #MeToo movement. After winning the case, Park Jinseong accused Hyeonjin of defamation through her alleged false #MeToo accusations, demanding 30 million won in damages.\n\n&#x200B;\n\n&#x200B;\n\n**Women writers gathered to raise money for litigation expenses**\n\nWhen she received the complaint from the perpetrator on October 17th, 2019, Hyeonjin was a 20-year-old junior in college, and she was poor. She had managed to hide her pain from her mother while walking through a long, dark tunnel of harm so as not to put more weight on her mother’s shoulders. But the perpetrator was asking for 30 million in damages this time. The victim broke down. Overwhelmed with despair, she wrote a Twitter thread explaining her circumstances. The first person who decided to take her hand was Yoo Jinmok.\n\nYoo Jinmok and Park Jinseong had been in the same literature club in college. She was made miserable by his obsessive courtship and harassment, and later by rumors that they had had a relationship. After she published *Dictionary of Hatred*, a novel that accused the literary world of sexual violence, Park Jinseong pestered her, saying that even though he did not do what one of the perpetrator characters in her story does, that character must be him. He relentlessly wrote on his social network account that they used to be in a relationship and she was defaming him with lies. He continued for several years, pushing her to the verge of mental breakdown. For her, he was a perpetrator who had tormented her with obsessive, one-sided courtship 20 years ago and who kept telling the lie that they had been in a relationship, disrupting her writing career even after 20 years.\n\nShe had been an 18-year-old freshman then, but she was now a writer in her forties. Yoo Jinmok filed a lawsuit against Park Jinseong. But the Daejeon District Prosecutors’ Office asked her, the victim, to prove the two had not had a relationship instead of asking the perpetrator to prove they had. All Yoo Jinmok wanted was for the defamation to end and an apology. On the day of their criminal mediation, Park Jinseong screamed and cursed at the courthouse’s front gate instead of apologizing to Yoo Jinmok, who was heading home with her husband and lawyer—me. His behavior was beyond my imagination, and since I have trouble recognizing people’s faces, I almost walked past him thinking he was a mentally ill person. It was not until I heard it from Yoo Jinmok that I realized who he was.\n\nWhen Yoo Jinmok’s husband protested his behavior, Park began swearing at him. After telling Yoo Jinmok to record him picking up a fight, I called 911. It was she who suffered from many of his acts, but ironically, he got his first criminal punishment because he cursed at her husband. \\[Afterwards, she also filed a civil lawsuit against him for damages and fought for years. I stood by her, and we went through the painful process together.\\]\n\nYoo Jinmok understood Hyeonjin’s injury, suffering, and frustrations better than anybody else. Yoo Jinmok took the lead in bringing Hyeonjin’s circumstances to the attention of women writers. The courts did not acknowledge the harm caused to the victim, and people on the Internet, who believe what they want to believe, argued she was a #MeToo liar. But the writers could sense the truth based on empathy and their own experiences. Many drops make a shower; so they started to raise money for Hyeonjin little by little.\n\nWhen Yoo Jinmok and other women writers visited my office for Hyeonjin, another journey of togetherness began. The starting point was the District Court in Yeongdong County. We responded to the lawsuit against the victim and filed a counteraction. Women writers who took part in raising the litigation expenses joined the long journey calmly. The lawsuit took more than two years, but during that time Hyeonjin and I were never left by ourselves. At the end of the heartwarming lawsuit, the court allowed both parties, Hyeonjin, and Park Jinseong, to take the stand for examination.\n\n&#x200B;\n\n&#x200B;\n\n**The case took a new turn: farewell to the years of unfairness**\n\nIn April 2021, the District Court in blooming Yeongdong got heated. Park Jinseong tried to provoke me, the plaintiff’s lawyer, by taking issue with my standing posture. And after the trial, with a lighted cigarette between his fingers, he flew at me, screaming “Are you her \\[bleep\\] lawyer?” To my great relief, my secretary, a former soldier and martial arts expert, cut him off and stopped him. The intense situation was cleared up as the women writers who attended the trial started to come out.\n\nThere had been a wrong judgment in the first place, which served as the legal foundation for other judgments, but the world did not turn its back on a desperate fighter for truth. The court ruled that Hyeonjin was right. With this carefully considered decision, the tide finally began to turn against injustice.\n\nThe dishonor of being a “#MeToo liar” as well as the frame of “the victim of false #Metoo” that favored the perpetrator were all brought down. That gave strength to Hyeonjin and others who had become disheartened. The fund-raising gained steam to prepare the money for the appellate civil lawsuit and a criminal complaint. That enabled us to move from civil court to investigation agencies. Unfortunately, the statutes of limitations of some particularly malicious acts had already expired, but there were other ones that were still within the statute of limitations. Even in this commotion, Park Jinseong never stopped condemning the victim. He posted an edited Kakao Talk chat on the Internet, arguing that he and Hyeonjin were in a relationship. But the end was near.\n\nRight after Park Jinseong lost a case against Hyeonjin for damages, another court ruled that he defamed Yoo Jinmok with false facts. Although it took nearly a year, his spate of statements online that Hyeonjin’s #MeToo claims were lies backfired, and he was sentenced to serve time by the Daejoen High Court as a punishment for defamation by publicly alleged false facts. The execution of punishment was suspended, though, but he was additionally ordered to do over 300 hours of community service. This person, who had underlined that he was a poet composing beautiful poems in reflection of himself, appealed both the civil and criminal judgments. Around the same time, Park Jinseong lost his appeal trial on defaming Yoo Jinmok.\n\n&#x200B;\n\n&#x200B;\n\n**People in need of a “False #MeToo” frame conspired with Park Jinseong; people gathered strength with “Kim Hyeonjin, Born 1998” to break that frame**\n\nIt took five years for Yoo Jinmok to be acknowledged as a true victim and to stop the defiling of her reputation, and Hyeonjin, even now that four years have passed, is still in the midst of hard times. What has helped them not to fall apart during those days is, ironically, the more severe and harsh condemnations by other people. Besides the harm by Park Jinseong, what gave unbearable suffering to victims were the sideway glances, thoughtless comments, and the accusing of those who identified with a perpetrator who consistently used fabrication. The making of Park into a victim of false #MeToo accusations and the delusional frame of false #MeToo itself are not the work of one person. Most people who had been enjoying positions which enabled them to be disrespectful felt discomfort and rebelled against the changes that must be made for the sake of an equal, respectful society. For them, #MeToo was something bothering and threatening. They wanted to believe that many of the victims’ stories were false or exaggerated.\n\nFor these people, Park’s claims about false #MeToo must have been appealing. The court’s ruling that the victim’s #MeToo accusation was false became a magic flute. The fact that the real victim was excluded from the trial or the full text of Kakao Talk conversations that contradicted the court’s judgment did not matter to them. The “victim of false #MeToo” frame was built by people who needed it to exist.\n\nBut the frame was torn down at last by the victims’ courage, people’s willingness to contribute to lawsuit expenses and many years of fights. After it came down, the creators of the frame blamed Park Jinseong as if it had been one person’s fault, instead of blaming their own foolish and false symbolization. But I repeat, there were far more than one person who created this widely-embraced, shameful frame.\n\nOn the surface level, the world finally realized that Hyeonjin, Park Jinseong’s underage victim and the first to make a #MeToo accusation against him, was the real victim who had to get through unfairness and had to fight at the risk of her life. Just like people suffer from radiation sickness after exposure, Hyeonjin has suffered from being treated as a perpetrator who committed defamation even though she was the victim of sexual harassment. Her life has been out of balance, but everything is coming back into place at last. The world will soon forget the victim’s pain and the perpetrator’s malicious acts. But Hyeonjin will walk the road of recovery for a while, slowly.\n\nThe pain that Hyeonjin suffered; the long process of getting back on her feet thanks to the support of others; the life of a victim, moving in the right direction even if at a slow pace—those will influence people who calmly observe her, and steer the world that hurt her to take a better way. I am grateful for our shared journey and the influence she has had on me. It is with support for the many Hyeonjins in this world that, instead of “Hyeonjin, Born 1998” which was the result of false frame by the perpetrator, I call her name once again—“Hyeonjin,” the brave survivor. \n\n&#x200B;",
    "title": "“Kim Hyeonjin, Born 1998,” A Girl Falsely Framed As A #MeToo Liar",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1702043579,
    "score": 8,
    "keyword": "korean judge"
  },
  {
    "text": "[Essay] Progressives/Feminists are bad at talking about men’s issues ###Preface\n\nI am not a feminist or an MRA. I only feel the need to preface with this given how uncharitable people can get when you’re even remotely critical of ideologies such as the one’s discussed here. I am also not an anti-feminist - though I do have strong objections to feminist rhetoric, institutions, and academia.\n\n###Introduction\n\nGender issues - we’re all aware of them. Men and women are expected to conform to certain roles, and are often punished when they don’t.\n\nIn the last century an ideology known as feminism emerged and rooted itself in progressive circles. Their initial concerns were legitimate; women couldn’t vote, own property, or divorce, among other things. The ideology achieved many victories, both legislative and social. Today, feminism is more popular than ever, garnering support from celebrities and multinational organizations like the United Nations. It’s taught in many schools as part of their mandatory curriculum, it’s widely supported among most progressives, and many would argue you would need to be one in order to even call yourself a progressive.\n\nWhy, then, is feminism so polarizing? Surely, there are plenty of women’s issues that exist today, and aside from far-right tradcons, who could really disagree with the fundamental premise of gender equality? Detractors of the ideology commonly claim that it’s “gone too far” - but what does that even mean? Many progressives claim that detractors of the ideology are reactionaries who simply misunderstand it. Is this really true? What’s actually going on here?\n\n###The Feminist Hypothesis\n\nFirst, it’s important to define feminism. If asked to define the ideology, most would say something like “the belief that both genders are equal / should be treated equally under the law”. This is an incomplete definition, however. This would be similar to defining liberalism as the belief in democracy. Of course, whilst believing in democracy is a necessary condition of liberalism, it’s not sufficient. Socialists (and even some fascists) believe in democracy, and they certainly aren’t liberals. Liberalism requires other beliefs, such as the right to private property (which socialists reject) and the belief in human rights (which fascists reject).\n\nFeminism, then, is more than just the belief in equality under the law. The other beliefs varies depending on the school of thought, but they’re all united in sharing one fundamental claim: that we live in a patriarchy that privileges men at the expense of women. More specifically, they argue that femininity is seen as inherently inferior to masculinity, and thus, all gender issues are fundamentally rooted in misogyny. For instance, it’s socially acceptable (even celebrated) for women to act masculine (eg, tomboys), but men who act feminine or often punished for it (they might be denigrated with insults that compare them to women - ‘pussy’, ‘sissy’, etc.). You can likely name several films with relatively masculine women (Ripley from Alien, Sarah Connor from Terminator, etc.), but almost no feminine male heroes. Women are punished for being women, men are punished when they aren’t masculine enough.\n\nFeminists conclude that the patriarchy hurts both men and women, and thus, everyone should be feminists and dismantle the patriarchy. \n\n###Critique\n\nThe issue with this hypothesis, and progressive gender ideology as a whole, is that it promotes a massive asymmetry in the way we view men’s issues compared to women’s. Progressives claim to value gender equality, but in reality they end up reinforcing the most rigid form of gender essentialism, even more-so than modern conservatives. This can be seen both in their rhetoric and in the legislation/social policies they support. I will demonstrate this by examining popular rhetoric and arguments used by feminists and progressives.\n\n**Toxic Masculinity**\n\nA controversial term that has emerged in recent years, “toxic masculinity” refers to the harmful set of expectations placed on men that causes them to hurt themselves or others. For instance, men are expected to be stoic, and so they may be less likely to seek out help when they need it. Men are expected to sleep with women, so they may physically lash out when rejected, since sexual conquest is tied to their self-worth.\n\nMany progressives claim that opponents of the term simply misunderstand it, but in reality, the reason people dislike the term is because there is a hypocritical asymmetry since “toxic femininity” is never discussed. Progressives end up being the biggest reinforcers of the traditional “toxic” masculine roles they claim to oppose. \n\nFor instance, the male suicide rate is often condescendingly blamed on “toxic masculinity”. We get the typical spiels from mainstream media about how men are pressured to be stoic, and if they could just open up emotionally, the male suicide rate would drop. This is an utterly bizarre argument, because statistically women are actually more likely to attempt suicide than men (men are more likely to succeed), yet this is never blamed on “toxic femininity”. Notice how mainstream media never claims that women are conditioned to be hyper-emotional, and if they could just learn to suppress their emotions, the attempted female suicide rate would drop. \n\nConsider too that women tend to not report rape or sexual assault out of a sense of shame or guilt. Would any progressive claim this is a consequence of “toxic femininity” - that women are pressured to be sexually chaste and “pure”, and that explains the lack of reporting? If anyone were to actually make such an argument, those same progressives would likely call them a victim blamer, yet this rhetoric is completely acceptable when it comes to men.\n\nIn other words, men and women both share the same reasons for committing suicide or not reporting rape (eg, shame), but it’s only framed as a systemic failure for women. For men, it’s framed as an insecure shortcoming, that they’re letting the pressures of “toxic masculinity” get to them, and they should just “do better” and seek help.\n\nIt’s also worth noting that women reinforce these “toxic” gender norms just as much as men, but that’s never acknowledged by progressives. Consider the [controversial Gilette ad](https://www.youtube.com/watch?v=koPmuEyP3a0) from a few years ago, where they attempted to “tackle toxic masculinity”. In the entirety of the ad, only men are blamed for reinforcing harmful masculine gender norms, women are completely absolved (aside from a couple of audience members during the sitcom segment). In fact, [at one point the ad shows](https://youtu.be/koPmuEyP3a0?t=29) a male employee silencing a female employee - even when progressives try to talk about men’s issues, they can’t help but make it about women’s issues as well. \n\nThis asymmetry is more explicitly clear when you enumerate all the possibilities:\n\n* Man is sexist against man: Toxic masculinity\n\n* Man is sexist against woman: Toxic masculinity (not “toxic femininity”)\n\n* Woman is sexist against man: Toxic masculinity\n\n* Women is sexist against woman: Internalized Misogyny (not “toxic femininity”)\n\nWhen men receive sexism, it’s their “toxic masculine gender role” that oppresses them - in other words, they oppress themselves. But when women receive sexism, they are just simply victims to misogyny. If a woman tells a man to man-up, it’s considered toxic masculinity since it reinforces the traditional masculine gender role of stoicism. But if a man criticizes a woman for sexual promiscuity, it’s not considered toxic femininity, despite it reinforcing the traditional feminine gender role of chastity (in fact, it’s considered another instance of toxic masculinity). So whether men or women reinforce harmful gender expectations of either gender, it’s labelled “toxic masculinity”. The term essentially becomes synonymous with “sexism”. This is the fundamental issue people have with the term - the inherit conflation of ‘masculinity’ with ‘sexism’ - the asymmetry. \n\nThe great irony here is that progressives end up reinforcing the very traditional gender norms they claim to be against. That is, that men possess hyper-agency and can never be victims, that their problems are of their own causing, and that women are just helpless victims who do no wrong. \n\nIt's not surprising, then, that the biggest feminist messages to men in the last few years have just reinforced the traditional “toxic” gender norm that men should be protectors. Look at the United Nation's [#HeForShe](https://www.heforshe.org/en) campaign, that suggested men should essentially protect women. It's no different than telling men to \"man up\", it's just rebranded in woke packaging to make it palatable to progressives, and it works. Notice too that these demands are never asked of women (there is no #SheForHe). Progressive demand men to be traditionally masculine, whilst simultaneously criticizing them for it.\n\n**Patriarchy**\n\nThere is perhaps no term in modern discourse more useless or vague than “patriarchy”. It’s used as a buzzword by progressives (along with “capitalism” and “white supremacy”) to explain away almost any phenomenon in modern society. Earlier we defined the patriarchy as a social system that “privileges” men at the expense of women (or values masculinity over femininity), but the way progressives have abused this term borders on unfalsifiable tautology - framing all gender issues as women’s issues.\n\nAccording to progressives, if women commit more suicide than men, that's evidence that we live in a sexist patriarchy. But if men commit suicide more than women, that's also evidence we live in a sexist patriarchy, and this is an instance of the patriarchy hurting men. Men are given harsher sentences for the same crime? Actually that’s patriarchal backfiring, since society views women as having no agency. Women get custody more often? Well that’s because society views women as the caretaker, so it’s actually misogyny. Only men are drafted? Of course, society views women as weak and incapable - misogyny. No matter the outcome, it's always framed as patriarchy/misogyny, it’s just taken as an axiomatic truth.\n\nTo test whether a claim is vacuous, a useful exercise is to reverse the situation and see if the conclusion still holds. Suppose we lived a society where gender roles were reversed. Men would have issues with domestic violence, date-rape, representation in politics, wouldn’t be taken as seriously in the workplace, catcalling, were judged more for their looks, etc., and women would have a higher suicide rate, get harsher prison sentences for the same crime, get worse school grades for the same work, it would be legal to cut off their clitoral hoods at birth and suck their genital wounds (the male equivalent would be “oral suction circumcision” - yes this is an actual thing).\n\nWould anyone look at such a society and deem it an “oppressive matriarchy” that “privileges” women over men? If not, then why is it when the roles are reversed (as it is in our society) it’s deemed as an “oppressive patriarchy” that “privileges” men over women?\n\n**Male Privilege** \n\nProgressives are also very selective when they examine gender inequality, largely overlooking men’s issues, or even framing them as a privilege.\n\nConsider the gender wage gap. Progressives/feminists argue that the reason women earn less than men is because of sexist social pressures that encourage women to be stay-at-home mom’s and discourages them from higher-paying careers. Whether this is truly the result of sexism or biological predispositions is not what I care to discuss, but what is interesting is that the other side is never talked about; that is, that men are socially pressured to earn money. Consider if the roles were reversed; suppose men were pressured to be stay-at-home dad’s and take care of the children, whereas women were pressured to work dangerous jobs, work overtime, and would be considered deadbeats otherwise. \n\nIf this were the case, there would be no discussion of a gender pay gap for men. Instead, we would hear of a gender labor and death gap for women. We would hear complaints that women were expected to work more hours than men, expected to take physically dangerous work, and die more often on the job. We would get statistics about how “on average, women work X amount of hours more than men in a year”. We would hear about the negative health consequences of stress and working overtime, the toll that being the primary breadwinner has on a person, how men need to “step up” and stop placing the burden of income on women alone. Yet, when this expectation is placed upon men, there is zero discussion about the burden of being the breadwinner - in fact, quite the opposite, it’s framed as a privilege.\n\n**”But the Patriarchy hurts men too!”**\n\nOne popular talking point among progressives is that the “patriarchy” hurts men as well, and that critics of feminism mistake “patriarchy” as synonymous with “men”, but this is far from the truth.\n\nConsider the recent overturning of Roe v Wade. To be clear, I think the ban is wrong, but the response from many feminists is telling; they immediately jump to blaming men, despite the fact that men and women [share similar views](https://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion) on abortion. Abortion is split among political lines, not gender lines, and despite progressives wishing the opposite, conservative women do exist.\n\nSo here we see the hypocrisy. On one hand they will claim that the patriarchy hurts men and women, and therefore feminism ought to be accepted by men. Yet, as soon as women are hurt by “the patriarchy”, the blame is immediately put on men, despite the fact that women reinforce/uphold harmful gender norms just as much as men. The fact that plenty of women supported the ban is ignored in favour of a convenient “male bad” narrative.\n\nSimilarly, if the “patriarchy” ends up hurting men, women’s agency/responsibility is totally ignored, and thus, the blame will lie on men. The term “patriarchy” becomes synonymous with “men”, with progressives blaming all of societies shortcomings on men alone.\n\nIf the hypocritical rhetoric is bad, the hypocritical institutions are far worse. Self-proclaimed feminist organizations like the United Nations (which claims to stand for gender equality) [finances the genital mutilation](https://news.un.org/en/story/2011/12/397192-un-launches-plan-accelerate-male-circumcision-aids-prevention-africa) of men in the Third World. whilst condemning the same mutilation of women. Then, that very same institution has the audacity to suggest that “men aren’t doing enough”, that “men need to stand against sexism”, and proceed to roll out initiatives like #HeForShe.  \n\nIt’s also worth noting that in the case of circumcision, the discarded foreskin is sometimes used to [produce skincare products](https://thesun.co.uk/fabulous/7836602/foreskin-facial-kate-beckinsale-how-serum-made/) for wealthy celebrities and socialites (likely the same that virtue signal about how misogynistic our society is). Could anyone imagine if male celebrities used skincare products derived from the skin tissue of amputated clitoral hoods from infant girls? Doubtless we would have international outrage and academic discourse about the “commodification of the female body” and whatnot. When it happens to men - radio silence (or mockery).\n\n**Progressives use right-wing rhetoric when it comes to men’s issues**\n\nMen’s issues are dismissed by progressives in the same way black issues are dismissed by conservatives. For instance, progressives blame the fact that men are more likely to be victims of violent crimes on other men, since men commit the majority of violent crime. Notice how this is no different to when conservatives blame black issues on black people. Compare “but it’s mostly men killing other men” to “but it’s mostly black people killing other black people”. Would progressives be okay with terms like “toxic blackness” to describe the negative aspects of black culture - eg, high crime rate, lack of fathers, misogyny in rap music, etc?\n\nConsider the fact that men are given harsher sentences for the same crime, compared to women. Feminists would argue that this is because society assigns hyper-agency to men and views women as weak and infantile, thus, men get harsher sentences. They would argue this is an example of how sexism against women ends up hurting men, that this is our patriarchal society “backfiring” on men. But notice that this logic completely falls apart when you swap gender for race. For instance, black people are sentenced to harsher sentences for the same crime compared to white people. Would any progressive unironically argue that this is because society views white people as weak and incapable, and thus this is an example of how racism against white people ends up hurting black people, that this is our “black supremacist” society backfiring on black people? The latter would be rightfully ridiculed, whereas the former is accepted and taught in sociology classes.\n\nUnder the feminist framework, it’s okay to blame men’s biological predispositions to dismiss male violence / male victims of violence, but don’t you dare suggest that those same biological predispositions may explain why men are more likely to be CEO’s. In other words, men’s failures are their responsibility, but their successes are not - their successes are the result of sexism, they’re illegitimate. (To be clear, I am not suggesting that biological predispositions are indeed the reason why men are more likely to be CEO’s; I am merely pointing out the hypocritical reasoning)\n\n\n**Media**\n\nSo how are men’s issues talked about by the media? Well, for the most part, they aren’t. But when they are, it can vary from blaming men for their issues (the typical spiels on toxic masculinity) to outright hostility.\n\n“Progressive” media outlet, Slate, once [ran an Op-Ed](https://slate.com/technology/2013/09/intactivists-online-a-fringe-group-turned-the-internet-against-circumcision.html) where they characterized and straw-manned the entire anti-circumcision movement as nothing but unhinged freaks, comparing them to anti-vaxxers. The article goes into great length smugly psycho-analyzing the motives of these activists, not even pretending to show balance or their side of the argument.\n\nThe United Nations absurdly claimed that [women would be the most impacted](https://www.cnbc.com/2022/03/11/un-women-says-russia-ukraine-war-exacts-high-price-from-women-girls.html) in regards to the invasion of Ukraine, despite men (some still being in high school) being banned from leaving the country. Evidently, men being forcibly conscripted to fight and possibly die doesn’t count as gender-based violence. It’s also worth noting that the UN emphasizes girls specifically, rather than all child refugees (boys and girls). Again, this is the same institution that tells men they just need to “do better” and stand up against inequality. \n \nVice, another “progressive” outlet, [recently wrote an article](https://www.vice.com/en/article/y3vx8k/south-korea-incel-gender-wars-election-womens-rights) about the South Korean election, titled “Young, Angry, Misogynistic, and Male: Inside South Korea’s Incel Election”. \n\nTo summarize, the article describes how anti-feminist rhetoric has emerged as an electoral campaign topic among the populist candidate Yoon Suk-Yeol (in fact, he won the election as of writing this). The article mentions how these male voters feel disenfranchised from South Korean society, given the blatant double standards. For instance, military service is mandatory for men when they finish high school, but not for women. This means men have to abandon their families for 1.5 years while women get a head start in their careers. The candidate, Yoon, vowed to abolish the Ministry of Women, a division of the government concerned with women’s issues. Aside from some vague mentions of political bias and claims that the ministry “treats men like criminals”, the article never describes why he wants to abolish it, or why the voters want him to abolish it, it’s just taken as a presupposition that the Ministry is fair and just. \n\nThat’s it. That’s the entire article. This, according to Vice, makes you a “misogynistic incel”. We’re so deeply-entrenched in “progressive” gender politics that merely pointing out the double standard that men must do mandatory service is enough for “progressive” outlets to label you a women-hating incel. There’s not a single man they interview in the article that express any entitlement to women. Just being opposed to the hypocrisy makes you an incel apparently.\n\nIt’s totally possible that the candidate is indeed a misogynist or has sexist policy positions - I don’t know much about South Korea - but the greater point here is that the article never mentions any of this. According to the internal logic of Vice, men merely being upset at blatant double standards is enough for them to be labelled misogynistic incels. It’s also worth noting the hypocrisy of these “progressive” media outlets in labelling young men who are rightfully upset about being discriminated against as incels, despite these same outlets decrying how widespread “toxic masculinity” is, completely oblivious to how they reinforce it by characterizing any man who points out male discrimination as being a bitter, angry virgin.\n\nNone of these articles were hard to find. I found the first one through a basic google search, and the other two from trending twitter/reddit posts. There are dozens of more like this written every year, this was just a small sampling of how ridiculously hysterical progressive media is towards men’s issues.\n\n**Nice Guys**\n\nSpeaking of incels, the entire phenomenon of \"nice guys\" (men who disingenuously befriend women in an attempt to sleep with them) is ironically exacerbated by the very same \"progressives\" who claim to want to \"liberate\" men from their confined gender roles.\n\nProgressives, and mainstream media as a whole, demonizes male sexuality, characterizing it as creepy or predatory. Consider again the controversial Gilette ad from a few years back. There's a [scene where a man goes to approach a woman](https://youtu.be/koPmuEyP3a0?t=56), and then is stopped by his friend. It's the middle of the day, broad daylight, busy street, etc. so the woman is in no danger, yet according to progressives, even approaching women in public is problematic nowadays.\n\nIt’s no surprise that teenage boys take these messages to heart - that they’re inherently predatory and must suppress any desire to be blunt or forthcoming with what they want. They act amicable, nice, and passive, because that’s what they were told to do, and more importantly, they don’t want to risk being branded as a creep or sexual predator. When this inevitably doesn’t work out, they express frustration, and then the very same group that told them to act that way demonizes and mocks them for it.\n\nIt’s no surprise then why figures like Jordan Peterson and Andrew Tate get popular. The right-wing gives an alternative to alienated young men that doesn’t demonize them for being born with a penis.\n\n###Conclusion\n\nThe message from progressives/feminists is clear. Women’s issues are caused by society, and so society must change to accommodate women. Men’s issues are caused by men, and so men must “do better” and change to accommodate society. Women’s issues are systemic - men’s issues are individual failures. Social change for women - pull yourself by your bootstraps for men. \n\nUnder the feminist framework, sexism against men is framed as male privilege, whereas sexism that benefits women is framed as female oppression (consider the term “benevolent” sexism - even when women benefit, they’re still victims). Their rhetoric and language portray a victim narrative for women, and an oppressor narrative for men, no matter the circumstance.    \n\nAt the heart of progressive gender ideology is this absurd notion of trickle-down equality - that if we just focus on fixing women’s issues, men’s issues will just magically solve themselves. As time has come to past, it’s clear that this is simply not true. Women have made great strides in almost all sectors of life, whereas men have stagnated or even regressed, usually as the result of questionable social policies created in the name of “equity”. It is now blatantly clear that schools discriminate against male students for the same work compared to women, that universities and employers favour female candidates, and that ironic misandry is tolerated (even encouraged) in the public sphere, but even mentioning this is considered controversial. \n\nProgressives and feminists fundamentally view gender equality as a zero-sum game. Attention and resources given to men’s issues are resources that could be used towards women’s issues. In doing so, they must frame any good-faith opposition to their absurd ideology as right-wing reactionaries (take the “Manosphere” for instance - a new buzzword that lumps mass murdering incels with pick-up artists and men’s right’s activists - despite these groups having almost nothing in common). \n\nAll of this goes to show what is essentially tantamount to gaslighting on a global scale. \n\n“The patriarchy hurts both men and women” - but women’s issues are the only one’s taken seriously, whereas men’s issues are treated with condescension (or ignored). \n\n“Both genders reinforce harmful gender norms” - but only men are told to change, whereas women are assumed to be perfect.\n\n“We should encourage men to speak up about gender issues” - but if they do they’ll be labelled a misogynistic incel.\n\n“Feminism is for men” - but feminist organizations actively support blatantly anti-male legislation and policies (eg, UN financing male circumcision in the Third World).\n\nThe progressive hostility towards men’s issues is directly responsible for the rise of people like Andrew Tate, and I fully expect more figures like him to gain popularity in the near future. It’s hard to express just how frustrating it is to see even the most trivial of women’s issues discussed ad-naseum by progressives and mainstream media (eg, female multimillionaire actresses make slightly less than their male counterparts), whereas some of the most egregious human rights violations still being legal to commit against men is totally ignored, or even supported. The progressive failure has obviously reached a tipping point now - red pill content has exploded in popularity over the last year, and when the pendulum swings back, I expect there will be a fierce overcorrection from progressives. Unless progressives become willing to actually discuss men’s issues, things are only going to get worse, but chances of that seem slim.",
    "title": "[Essay] Progressives/Feminists are bad at talking about men’s issues",
    "subreddit": "MensRights",
    "timestamp": 1680527489,
    "score": 62,
    "keyword": "korean judge"
  }
]