[
  {
    "text": "My Boss isn't giving me any work or responsibilities-should I quit? I (F/26) started a new job a few weeks ago as an \"Administrative Assistant\" to this guy who basically flips houses/property. He isn't a company-just a guy who does this as a living. One of my clients told me about him since she used to work with him and claims that he is reliable. He calls me an \"Assistant Project Manager\" but that's incredibly hyperbolic. I have no knowledge or experience regarding construction or managing a project at all. Before this, I was a freelance proofreader and an English teacher to Korean students. But he took me on anyway and had me come in for two weeks of \"training\". In those two weeks, I'd drive over an hour just to get to his house or cafe (again, he's not a company so no proper workspace), watch as he takes phone calls or follow him around to the house under construction, and go back home. Every time I tried to make a suggestion about how I could help, he'd somehow veer off-topic and then be pulled away to a different phone call. Most of those training days I was there for less than three hours which I consider a fat waste of time since I live so far. He'd send me home because he was busy-I didn't even come in every day of the week. There was no former hiring process, but he did give me a packet full of expectations and what I could expect to be paid monthly. However, he never spoke about it further.\n\n\"Why don't you just talk to him and ask for more responsibilities/make your own work/demand clarification about your payment and start date?\" you may ask. And I'll tell you, I did! I still do! Almost every day. Last week I sent a very firm e-mail to him, asking him once again what it is I can do to help. I've made Excel spreadsheets for his data and contacts, and he says that it's a good idea but then never gives the data to me. I've started learning Project Management software so we can organize our projects, but he doesn't want to use it. I've introduced myself to all of his sub-contractors and had them tell me about their assignments. Hell, I even offered to sort the man's mail.  In the same e-mail, I told him that I *need* clarification and peace of mind about wage fulfillment as well. Will I get paid for that \"training\"? When and how will I get my salary? He didn't even read the email until I was there, at his house, the next afternoon. And even then he couldn't give me a straight answer. I can't say he's scamming me for free labor, because he hasn't given me any work to begin with. \n\nThis week marks the beginning of my full-time employment and I'm here 8-hours a day now. However, I still don't have anything to do. I get to his house after driving for an hour, and before I can even speak he disappears. Today he was on the phone for three hours with me sitting at his dining room table twiddling my thumbs and watching the Today show on his living room TV. I finally got fed up and told him that I'm going to the house that he's working on (since that's what we normally did anyway). He told me to go watch the workers and make sure everything is going smoothly. Obviously, I can do that, but how can I spend an entire workday standing there watching other people work? I just walked around the house looking at stuff I've been looking at for the past two weeks for a few hours until lunch. Nothing had changed from the day before, nothing had gone wrong, and no one had any questions or needed help. I called him and asked him what he wanted me to do after lunch and he told me to go back to the construction site. I am, but I'm just going to stand there for a few more hours until I get my ass back into my car and spend another hour going home. \n\nI understand that at the beginning of a lot of jobs, nothing really happens. The promised monthly salary is amazing, and I've met some pretty cool and talented people. I get to work in a nice part of town and see cool houses being built. It has the potential to be creative and hands-on. However, I am doing this without the security of being in a company, benefits, and I haven't gotten paid yet even for training. I seriously don't know what this guy expects of me and he only tells me \"oh, eventually you can maybe do this\". I don't even have a place to retreat to and do administrative work because he expects me to be on the construction site (no service or wifi, and no place to sit), or at his house (obviously can't be there unless he is also there). My parents suggest that maybe he isn't used to having an assistant or someone to help him, but his subcontractors have told me that he's had them before. I don't want to sit around and wait to work unless my hand is held, but everything about this job is new to me and I need some more guidance. He insists that things will pick up after this project is done, but I'm no sure how much time I can afford to waste here.\n\nMy dad said that this might not be a good fit for me. My mom blames me for not trying hard enough. I could read up on project management and learn more about construction (my dad loves that stuff) but I'm wondering if it would be worth it. I feel like it's too early on for me to act on my own. It's only been three weeks and two of those weeks have been cut short. Not to sound like a child, but this is my first \"real job\" and I don't know what to do. I'm bored out of my mind and frustrated. I admit I am lazy and love downtime, but on *my time*, if that makes sense. I don't want to drive all the way out here for nothing. I want to do my job, get paid, and live my life. Do you think it's worth staying here? Should I look for something more stable?",
    "title": "My Boss isn't giving me any work or responsibilities-should I quit?",
    "subreddit": "jobs",
    "timestamp": 1638303903,
    "score": 0,
    "keyword": "korean manager"
  },
  {
    "text": "How do I respond to an offer to work in Korea for my company for 6 months? I work in the US as a Program Manager (Coordinator) for a Korean based Tier 1 supplier. I have only worked there for 4 months and I heard this week from my Launch Manager that I may be asked by our Korean Managing Director if I would be willing to go to Korea for 6 months. This would be to learn more about how the main Corporate office conducts launching new programs and about a particular product that is new to the North American Plant I work at. \n\nI understand that at 4 months on the job that this would be a considerable offer. I have no children and my Wife would be supportive. Sure, we'd missed each other. I imagine the pressure would be immense, but nothing more than I would place on myself. \n\nI never really considered this to be a possibility when looking at the broad scope of my career at the company.\n\nI have some questions I would like help with, but maybe there are some other questions I'm not asking myself.\n\nIs this opportunity too good to pass up?\nIs there a giant red flag I am missing?\n\nWhat should I expect them to provide? I assume that living expenses (Quarters, Food, Phone, & Transportation) would be paid by the company. I wouldn't want to leave something on the table (Compensation or time back home).\n\nAny advice or perspective would be welcome. I know this is all a \"What if\" scenario, but I want to be prepared for it and not make an uneducated decision if it happens. Thanks!",
    "title": "How do I respond to an offer to work in Korea for my company for 6 months?",
    "subreddit": "careerguidance",
    "timestamp": 1637860720,
    "score": 3,
    "keyword": "korean manager"
  },
  {
    "text": "What do I need to learn in order to integrate a whole bunch of data from legacy systems with new, mobile apps? So upfront I'm just a dumb PM who is talking with a friend about working for him where a bunch of old crusty legacy systems need to share data with some emerging modern webapps.\n\nI'm somewhat of a \"technical\" PM in the fact that I have an MSCIS and some experience developing webapps (basics: html, css, js/ts) and am currently leading a small team to migrate some apps from EC2 instances to K8s clusters. \n\nHere's the problem: upper management tends to have no fucking clue what the difference between what Ive done is what they might ask me to do is. (they've already hired C# programmers to go make webapps with typescript and stuff like that) So I figure I need to cram some udemy or edx in.... uhhhh data engineering? enterprise architecture? what the fuck is this shit called? Good news is I don't need to know how to \"do the thing\", but I do need to know how to \"speak the language\" of making old app talk to new app\n\nI looked into a course like this: [https://www.edx.org/course/data-engineering-basics-for-everyone?index=product&queryID=1331452dd94b8a88fe84e5c1d7065b27&position=2](https://www.edx.org/course/data-engineering-basics-for-everyone?index=product&queryID=1331452dd94b8a88fe84e5c1d7065b27&position=2)  \n\n\nbut it had a lot of data sciencey sounding stuff like ETL and python which seem more about big data analytics and predictive modeling rather than taking some companies old shit and making integrating data with new shit. Any pointers because I am well and truly lost here. like...kafka? (or is that too old already?)  \n\n\nI feel like im about to be hired as a chinese language professor because I know how to count to 14 in korean.   \n\n\nCan't really go into details but I do have like a year to get ready while working full time in my current position. TIA.  \n\n\nTLDR: What is \"make many old apps talk to many new apps\" subject called within the cs world so that I can youtube it or find a course about it?",
    "title": "What do I need to learn in order to integrate a whole bunch of data from legacy systems with new, mobile apps?",
    "subreddit": "cscareerquestions",
    "timestamp": 1624166333,
    "score": 2,
    "keyword": "korean manager"
  },
  {
    "text": "Day in the Life of a Forensic Accountant Hi all! I posted last week about my job and got a lot of questions about working as a forensic accountant (\"FA\") and how I ended up in this profession. For the sake of brevity, rather than restating all of that, attached is the link to that post (see the comments for where I talk about how I got into FA and my job search/interview tips) - [Initial FA Post](https://www.reddit.com/r/Accounting/comments/lhw2w8/i_brought_in_my_first_case/gn0lh2f?utm_source=share&utm_medium=web2x&context=3).\n\nSince I was asked to talk more about my job, I thought I'd give a glimpse into my life of working as an associate in the private sector of FA for a small firm in a metro city.\n\n8:30 am - get to work, get settled, read the news, check email, drink my coffee.\n\n9:00 am - check in with my manager to see what the goals of the day are\n\n9:15 am - locate a new case's court docket on PACER (electronic public access service for United States federal court documents), download/print/chronologically organize in a binder the pleadings, and read the pleadings while taking notes.\n\n11:00 am - go over my notes with my manager and do additional internet research as needed.\n\n11:30 am - switch over to another case where I'm completing a parts analysis for a case involving damages. In this situation, I have a bunch of data for these parts and need to determine what price to use for the parts purchased by the plaintiff since there's different price thresholds based upon purchase quantity.\n\n12:00 pm - lunch. Usually I study for the CPA during lunch.\n\n1:00 pm - continue my parts analysis, summarize my findings, tie down my data to the source documents, and review my work with my manager.\n\n4:00 pm - switch over to another case for which we received some new documents. I'll download them to the network, add them to our document log, and note on the log a brief description of what the document is (ex. May 2019 Bank Statement Acct x1234). Some of the documents are in Korean, so I'm researching translator tools for these documents.\n\n5:30 pm - go home\n\nSorry to crush some of your naive hopes and dreams that all FAs are fighting crime all day and taking down corrupt Wallstreet CEOs. Instead, a more realistic description is that I do a lot of research, need to be detail oriented in everything I do -- even in admin tasks like describing docs received, perform analyses/tie down my work, and I get to use my intuition to follow up on leads in the case that may be helpful.  All that to say... I'm a pretty normal accountant with a sexier job title, but my job is actually pretty fun. There's tons of variety among the cases I work on, and each case is a learning experience. What I ultimately love about my job is I usually have a pretty good idea of what I'm trying to accomplish with my work, but it's up to me to figure out how to get the work done. For me, that's the fun part... problem solving... there's a lot of that!\n\nAnyways, I hope this provided some insight into what FAs do, and if you're also a FA, I'd love to hear how your experience compares/constrasts with my own!",
    "title": "Day in the Life of a Forensic Accountant",
    "subreddit": "Accounting",
    "timestamp": 1613665940,
    "score": 59,
    "keyword": "korean manager"
  },
  {
    "text": "Do you think the bamboo ceiling still exists? [https://hbr.org/2018/05/asian-americans-are-the-least-likely-group-in-the-u-s-to-be-promoted-to-management](https://hbr.org/2018/05/asian-americans-are-the-least-likely-group-in-the-u-s-to-be-promoted-to-management)\n\n&#x200B;\n\nAccording to the above article, Asian Americans are the least likely group in the US to be promoted to management. I've asked this in a Korean-American community(more than 99% of them are 1st generation immigrants who were born and raised in Korea) and they said this is not because of racism but because 1) Asian Americans prefer remaining as an engineer rather than becoming a manager 2) 1st generation immigrants tend to lack the adequate English and communication skills to climb the corporate ladder. If they try harder to assimilate by hosting parties at their houses and watch American footballs, hockey, and basketballs(instead of soccer) and go out hunting with his or her colleagues, they will not be discriminated against at all. Also, he mentioned that Asian Americans born and raised in America do not face any institutional discrimination other than affirmative action because they understand American culture and are good with English.\n\n&#x200B;\n\nDo you agree with these opinions? It's kind of interesting because Asian Americans born and raised in the States generally agree that there are some kinds of bamboo ceilings but 1st generation Asian Americans tend to argue that there is no racism in the States and the Asian Americans who face racism are either 1) lack the adequate manner 2) not fluent in English 3) very unlucky or 4) should blame their lack of adequate skills rather than racism.\n\n&#x200B;\n\nDo you think the bamboo ceiling still exists?",
    "title": "Do you think the bamboo ceiling still exists?",
    "subreddit": "asianamerican",
    "timestamp": 1632590215,
    "score": 79,
    "keyword": "korean manager"
  },
  {
    "text": "#WeArePeopleToo: A Proposal for a New Movement Hi everyone, this is my first post ever on Reddit despite being an avid Redditor. I apologize if I lack any specific Reddit-based decorum when it comes to making a post. I will definitely get better with time!\n\nMy name is Dae and I'm an NYC public school educator in my late 20s. I am a mixed race male and would like to share my story as well as establish my thoughts on a movement to better represent us as mixed-raced humans of the world.\n\n**My Story**\n\nI was born to a Trinidadian mother and a Korean father. As a result of their marriage, my father's side of the family became estranged and cut ties with us. As a result, I have only managed to forge a relationship with the Trinidadian side of my family. I grew up in a fairly Republican/Conservative area of NYC (Staten Island) in which white people were the majority.\n\nMy parents loved me but they had no idea how to deal with raising a multiracial son. They were stern and strict and did not believe in a coddling love. They did, however, believe in the merits of education and made sure that I knew to bring the best grades home. In school, other students stayed away from me. They were polite as young children but they often ostracized me and left me out of activities. At the time I didn't know it was because of how I looked but with time I began to see the relationship. I learned the power of being a fool, of being self-depreciating. As people laughed at me, I saw it as their acceptance. What I had actually done was prime them to note my difference, my mixed-race status, as being something comical, something to decry, deride, and deplore.\n\nI became the class clown and stood to make problems for the sake of other's entertainment. Teachers began to hate me and associate me as a problem child. They suggested mental and learning disabilities despite my high grades due to my parents and their iron fist approach to education. With every letter home, phone call, parent-teacher conference, I would receive a beating from my parents. Slaps in the face, beatings with belts, name calling, screaming in a child's face, bruises on my body. All done for the sake of being accepted by my peers. All for the sake of being loved by someone. I learned that people who love you are allowed to do whatever they want to your body so I let others do what they wanted to me. Friends treated me like a punching bag. At the age of 8 my 13 year-old babysitter blackmailed me into allowing her to rape me. I said nothing, scared more at the idea that I would be in trouble if people knew I had sex because I knew enough to know sex was wrong.\n\nBy the time I was 12 in middle school, I had tried to hurt myself for the first time. I was taken to the guidance counselor because I had told a friend who, doing the right thing, told an adult. In the process, I was treated like I was crazy. I was threatened to be committed because I was a danger to myself. All of this made me feel *different* and I already knew *different* was bad. I knew because of how I felt when people told me I was different. \"What are you?\" \"Who is black?\" \"How did that happen?\" \"Are you \\_\\_\\_\\_\\_\\_\\_\\_?\" The looks of confusion. Even worse was the looks of incredulity, like the fact that I existed couldn't be real. People, regardless of their own race, made me feel so ugly. Ugly because I was different, unique, and beautiful because of my uniqueness.\n\nI knew my parents' union was odd because people told me that. But I didn't know the history of miscegenation in America. I did not know that it was once a crime to be us or to engage in a union that results in the creation of one of us. What I did experience, however, was fetishization as I grew up and became sexually active again. I had a hard time finding someone who thought we had enough of a connection to date one another. When I did, I immediately agreed to date them, I was thirsty for love and affection. But this love was ugly too because it was different. This was even present in friendships. I had friends who told me they would only date black girls because they were black and wanted to have black babies. I had friends who told me I was smart because I was Asian and knew some rap and had rhythm because my mom was Black.\n\nMy girlfriends never, ever brought me home. I was a secret, forever to be hidden. I grew attached to a concept that white girls were the most beautiful. This was partially because of where I grew up but also out of jealousy. White people had such an ownership of their heritage. They knew what they were and forged relationships based on those identities. I wanted so badly to be white. I told my mother that I liked white girls and that in my next life I'd like to be white because they rule the world. My hatred of my blackness stemmed from the fact that society deemed black inferior which led me to believe that my blackness was probably why my interactions with society were so awful. If only I were fully Asian or White and had no blackness to me. I didn't realize it was just because I was mixed. The one girlfriend who took me home only told her family I was Asian. During the death of Eric Garner on Staten Island as racial tensions spilled out onto the streets, I visited her family and had to grimace as they joked about, \"Hands Up, Don't Shoot\". She said nothing. She did nothing. I didn't expect her to.\n\nMy life spiraled out of control as I got older and race became more important as a qualifier in making connections with people. I fell in deep love with a girl from a family who practiced the Islamic faith. She had difficulties accepting her role in the religion and found solace in me, a person with no ties to any culture because my culture was so shattered by my being multiracial. She would often tell me how \"cool\" it was that I was Black and Asian. How \"attractive\" it was. I didn't know what she was doing was fetishizing me, I was desperate to believe she loved me. After a few years, the relationship fell apart and, again, it was because I was different. This time, however, I knew it was because of my race. I never hated myself so much in my life. I cursed myself and my family, I wished I could be one thing.\n\nI drank a lot after the breakup. I wanted to die. I woke up face down in the gutter one night after binge-drinking. I tried to slice my wrists in my backyard, then I tried to fall on the knife. I tried to jump off the overpass by my house into traffic. I wanted my death to be certain. I gained so much weight my heartbeat became erratic. I was smoking a pack a day and developed a wheeze. I hated myself, I needed to punish myself. I fought my father, I ran away from home and became homeless. I hurt and hurt and hurt because love seemed impossible because acceptance was impossible.\n\nI became a teacher. First in Bed-Stuy, Brooklyn where my students, forever ready to curse me out and let me know when I wasn't being \"fair\", accepted me. Almost instantly. They asked what I was, were relieved when they heard \"Black\" because they knew we shared something common, and then made me one of their own. They joked with me, told me gossip, shared their fears, shared their dreams and their emotions. They asked me to share my stories and for the first time, **ever**, someone wanted to truly know me. Now I teach in the South Bronx where my students have yet to ask me what I am. Because it does not matter to them.\n\nI began a journey to heal. I lost weight though exercise, something I was so hesitant to do because I hated myself and wanted to die. I took a road trip from NY to Georgia, across to New Orleans, Louisiana then to Texas, then Cali. I got to see the Pacific Ocean and looked across to imagine my father's country. We drove back and I was refreshed with a new look on life. I educated myself on race relations in America as BLM became a massive presence following the death of George Floyd and learned to love my blackness. I attended my first protest on Staten Island with BLM and learned the importance of being outspoken. I learned to love myself and I learned how to share that love with others. I challenged my perceptions of education and decided to dedicate my life towards bringing a sense of ownership when it comes to science for BIPOC students. By providing students with a more hands-on experience, they learn that science is a gift for all humanity in the form of a community, one that it is honorable to be a part of. I have since been selected to work on a committee that brings more diversity toward l\n\n**The Movement**\n\nThrough my research, I have become extremely disillusioned with the lack of support provided to people of mixed race. I grew up with no one to turn to, no one to help me unpack the burden of being an oddity to society. I left social media, angry, vowing to never use it again because I didn't want to interact with a society that could not accept me. I likened it to being desperate, to chasing the desire to belong to something that has no desire to accept me.\n\nI fell upon Beverly Daniel Tatum's national bestseller, \"Why Are All The Black Kids Sitting Together In The Cafeteria?\" and noted that it was revised and updated. I had never had interest in reading this book before, despite it being mentioned in conversations with friends, teachers, etc. I did not belong to the black culture and so social issues of segregation were particularly damning to me. How could I sympathize with a culture that told me I wasn't black or black enough? At least they had one another in their culture to lean on. I had no one, I felt. In the revised edition, Dr. Tatum places attention to the role that Multiracial families bring to a discussion of race relations in America. Yet, in one fell swoop, she manages to disenfranchise me and other mixed-raced people, \"Given the unique historical and contemporary context, it is the biracial identity development of children of Black and White parents that I will focus on here.\" (Tatum, 304) I was not even enough to garner attention by a champion of Civil Rights and Equality in a book that was groundbreaking in its ability to unpack race relations in my country. I began to wonder how many other mixed-race people felt this way.\n\nI realized that we are under-represented and our lack of support allows us to be targets for confusion. It is this confusion to what we are, to how people treat us, that results in self-hatred, self-depreciation, self-loathing, and self-harm. And we cannot wait for others to be our voice because we are in need. As more attention is being placed towards identifying racism throughout the world, we need to be vocal, we need to stand to let people know: WE ARE THE DISENFRANCHISED TOO. WE ARE PEOPLE TOO.\n\nAnd that has been the movement I've been slowly pushing over social media. I want it to take off. I want us to unify and represent a community that has lacked a true community for so long. #wearepeopletoo\n\nAs people, we deserve to be treated like others. This means we deserve the freedom to be equals in society. We deserve to walk down the street or to make a new friendship without being asked for our race or ethnicity because #wearepeopletoo. We deserve to love and be loved not fetishized because #wearepeopletoo. We deserve to feel like we belong in our families, in our schools, in our government, in our country because #wearepeopletoo.\n\nRight now, the movement is just a hashtag. But even the largest movements begin somewhere. I will not pretend to know what I am doing. I will not pretend to be a leader or to stand as someone to look up to. I believe that this movement needs to be decentralized. No single leader, just a group of people, human beings, who see the need for a change. Right now I am using IG to push the hashtag but I want to begin moving to other platforms, putting out writing, establishing a website. I hoped we could establish [r/mixedrace](https://www.reddit.com/r/mixedrace) as a basis for a headquarters or begin to discuss a place to brainstorm. I stand with all people of the world and I want them to begin to see us as people too. #wearepeopletoo I know I need help, I need teammates and a community to support and be supported by. Even now as I tell people my idea for this movement they tell me I am being divisive, that I am causing more division in the world. But this was division that was forced on me, not one that I created. My goal is to end this division. I share that belief, that one they call utopic, that the world will be better when we see ourselves as one race: the human race.\n\nThank you for hearing me out,\n\nDae",
    "title": "#WeArePeopleToo: A Proposal for a New Movement",
    "subreddit": "asianamerican",
    "timestamp": 1614137067,
    "score": 12,
    "keyword": "korean manager"
  }
]