[
  {
    "text": "Stay at dying startup or move to a new one which hasn't even been born yet? 6 YoE latino software engineer here. Been working as principal engineer at a startup from my country for over a year, good salary, nothing too crazy but it's more than enough for my personal needs. The thing is: it's slowly dying. >90% of the company's money comes from small accelerator programs and government subsidies, the remaining 10% is from sales that came into fruition over a year ago, back when the company was born (let's just say the company benefited from the pandemic). We've been trying to pivot into new ideas that could help us make any actual sales, but our main focus is hardware related and it's honestly very hard for clients to be interested in such things. I honestly think there could be no possible product market fit which is a bummer, but yeah.\n\nMoving on. A week ago I was personally contacted by the CEO of a brand new startup that wants to hire me as engineering manager, basically the same as my current role but with a new name and better salary (20% increase). Has way better connections -the company will operate in my country but its CEO comes from the US- and according to him they'll have zero trouble at getting VC funding and making first sales because of their connections. Although I am aware that most CEOs are pretty good at lying so I'm not totally sure. Also, the current status of the new company is pretty much barebones, I would be building this from the ground up along with the current engineering team. The idea is somewhat weird too, they're trying to build a SaaS for an entire industry, which means the product will be a myriad of modules for each and every one of the stakeholders of said industry. I dunno, sounds very dotcom-ish.\n\nTo summarize, my current company is slowly dying, has made a few sales but nothing after that, and there could be no product-market fit. The new company has no product yet, its roadmap looks weird and the idea hasn't convinced me yet, but they offer a salary increase and have way better connections.\n\nWhat would you do in my shoes? thanks in advance",
    "title": "Stay at dying startup or move to a new one which hasn't even been born yet?",
    "subreddit": "cscareerquestions",
    "timestamp": 1674220018,
    "score": 0,
    "keyword": "latino principal"
  },
  {
    "text": "Feeling isolated and exhausted at teaching job where black teachers are the minority I’m currently working at a predominantly white staff school. I’d safe about 7 teachers out of 70 are people of color. The demographic of students is almost evenly spilt between blacks,whites, and Latino students. \n\nI returned to this school after I had a rough experience in a metropolitan area school district . I’m in Georgia btw. I did this because I thought my principal was reasonable and nice ( he was the previous assistant principal when I left the first time and was super kind).  Now I’m regretting coming back . I genuinely think my principal is trying but it’s getting to  me.\n\nOne day last week, one of my students broke down crying telling me that a white boy asked if could call him a n*gger and if his daddy was a slave ? “ I was livid . I told him I heard and felt him but do not ever make them make you feel bad about being black.\n\nI brought this incident up to the assistant principal and he said he “understood”. Never followed up with me. So I went to the principal about this and he told that he had the kid on his “radar” and that the kid was having a “rough time”. I was perplexed at why he was telling me this. He added that the kid could be valedictorian if he wanted to but was just not in a good situation now. But then my principal would jumped back to the fact that he wasn’t condoning his behavior and gave me a long story about how he grew up with black friends and because he was darker skin he was mistaken as Hispanic. \n\nI got more irritated as he continued and essentially let him finish off his point. What causes more pain is that I’m currently in school learning about critical race theory and just how awful American history is in regards to treating Blacks. I need health insurance and a salary but im fearful that if I move districts I’ll have another issue. I just want a space where I feel heard. I’m not sure how to proceed.",
    "title": "Feeling isolated and exhausted at teaching job where black teachers are the minority",
    "subreddit": "blackladies",
    "timestamp": 1674524140,
    "score": 15,
    "keyword": "latino principal"
  }
]