[
  {
    "text": "My principal keeps calling me the wrong name I’m a new teacher, this is my first year at a new school. I’m the only Hispanic/Latino teacher at this school. \n\n\nI’m pretty tan, but I’m half Greek on my dad’s side. So people will ethnically profile me and say my last name in their best *spicy* Spanish pronunciation/accent, and I might awkwardly comment that it’s a Greek last name. I don’t really care about that.\n\n\nIt’s a simple phonetic last name: 6 letters, 3 syllables. Not going to put my name online, but imagine a name like Nikias. It’s a rare last name so I’ll take any plausible pronunciation. I really don’t care.\n\n\nMy principal, however, keeps calling me by the same Hispanic last name. Think Lopez, Gutierrez, Flores, a very common Hispanic last name. The only thing it has in common with my name is the first letter. I’ve corrected her and she just said “sorry, English isn’t my first language. How about I call you Ms. [First Name]?” I said sure, but she never switched. She just keeps calling me the same wrong name. She calls me by the wrong name in front of students and coworkers, which causes confusion. She knows it’s wrong, I can see her pause before every time she says it.\n\n\nIt’s gotten to the point where it really pisses me off. This is the cherry on top of this stressful job. I have no union or rights at this charter school.\n\n\nI’m a very non-confrontational person, so I don’t know how to address this. I’d appreciate any advice.\n\n\nEDIT: I emailed the HR person at my school about it. She talked to my principal. I’m awaiting an apology from my principal through email.\n\n\nThe HR person also came to me and told me it wasn’t a racial thing (I stressed that it felt that way in the email) because the principal messes up the pronunciations of several other teacher’s names in the building. I’m still upset. There’s a difference between messing up pronunciation and calling someone by a completely different name.",
    "title": "My principal keeps calling me the wrong name",
    "subreddit": "Teachers",
    "timestamp": 1633553476,
    "score": 325,
    "keyword": "latino principal"
  }
]