[
  {
    "text": "Just got my assignment for 6th grade in California. Any tips for a first time teacher? So I got my assignment for 6th grade, which is outside of my preferred 4th/5th but still in the uppers. My area is mostly Latino with a high percentage of ELL students. Are there any tips on how to start off the year right? Some things I’ve gathered and done this far:\n\n1.\tI emailed both my principal and vice principal introducing myself.\n2.\tAsked about which curriculum they’ve adopted for math and ELA. Thankfully I’m familiar with one of them. Though I’m not sure if this school has teachers teach only one subject and the students rotate, prepping them for middle school.\n3.\tLooking to setting up a Donor’s Choose/ Go Fund Me for school supplies and classroom library.\n\nThe things I’m really worried about are the first day/week, behavior management for 6th grade (my co-teacher when I was student teaching just yelled at them all the time, not a tactic I want to use), as well as teaching ELA/ELD (math and science were always my strong suit), and finally *money* to set up my classroom.",
    "title": "Just got my assignment for 6th grade in California. Any tips for a first time teacher?",
    "subreddit": "Teachers",
    "timestamp": 1562033597,
    "score": 2,
    "keyword": "latino principal"
  },
  {
    "text": "NYC teachers help I'm a philadelphia art teacher hoping to get a position for the DOE in NYC. I'm in the process of transferring my cert (have taken the EAS and Visual Arts exams and will be doing the workshops soon). I'm trying to figure out what the best way to contact schools for open positions would be. In your experience, was it worth it to mail your resume to schools? I would rather email but it's also been impossible to find the emails for principals from these schools (unless there's a way for me to find their email that I'm unaware of?) I did already fill out the NYC application and can search jobs through there, but there's been only about 5 postings so far.\n\nAlso, how difficult will it be for me to find a job teaching art? I would prefer to teach in queens or brooklyn to mostly Latino population since I am Latina myself. Not really interested in working in the Bronx since the commute seems like it would be too long.\n\nWhen do NYC schools typically start their hiring process?\n\nIf anyone as any info or suggestions that could help me out, I would really appreciate it!",
    "title": "NYC teachers help",
    "subreddit": "Teachers",
    "timestamp": 1555893919,
    "score": 1,
    "keyword": "latino principal"
  }
]