[
  {
    "text": "Just got my assignment for 6th grade in California. Any tips for a first time teacher? So I got my assignment for 6th grade, which is outside of my preferred 4th/5th but still in the uppers. My area is mostly Latino with a high percentage of ELL students. Are there any tips on how to start off the year right? Some things I’ve gathered and done this far:\n\n1.\tI emailed both my principal and vice principal introducing myself.\n2.\tAsked about which curriculum they’ve adopted for math and ELA. Thankfully I’m familiar with one of them. Though I’m not sure if this school has teachers teach only one subject and the students rotate, prepping them for middle school.\n3.\tLooking to setting up a Donor’s Choose/ Go Fund Me for school supplies and classroom library.\n\nThe things I’m really worried about are the first day/week, behavior management for 6th grade (my co-teacher when I was student teaching just yelled at them all the time, not a tactic I want to use), as well as teaching ELA/ELD (math and science were always my strong suit), and finally *money* to set up my classroom.",
    "title": "Just got my assignment for 6th grade in California. Any tips for a first time teacher?",
    "subreddit": "Teachers",
    "timestamp": 1562033597,
    "score": 2,
    "keyword": "latino manager"
  },
  {
    "text": "Discrimination in Workplace? Hi guys,\n\nI'm a Latino working in London atm, I've been working for this company for the last 4 months and everything looked fine. Basically, my company recently started their business in the Spanish Market, and I have understood that Latinos are not much welcome in Spain, because they think that we detract their Spanish, I've been told that and I saw how they treat us as well.\n\n Recently, I've been point a few stuff that needs improvement (not much to worry about, things that probably everybody does, but oh yeah! You are Latino, you should be grateful that we give you a space in here) and this week a new Spanish girl has started to work with us. And my boss in the last meeting told me that I've been showing improvements but boom! Suddenly someone who looks like my replacement start with us. I don't know how to feel about, I tried to speak with my manager and I told her that new girl is nice (expecting some kind of clue of what are they thinking) and she told me just that ''We need some help''\n\nI don't know what to think, should I start to look for my next job? Should I stop worrying about? Some guidance would be grateful.\n\nThanks",
    "title": "Discrimination in Workplace?",
    "subreddit": "careerguidance",
    "timestamp": 1567102788,
    "score": 1,
    "keyword": "latino manager"
  }
]