[
  {
    "text": "A colleague-turned supervisor is retaliating and smearing me because I applied to the same promotion. I  am a math and computer science teacher at a small private school.  We  have grades 7-12 and about 120 students.  I've been working here since the Fall of 2018.\n\nI've been active in my department.  I've done a lot of things, successfully, putting in  extra hours at the request of the old and new owners.  I directed the  re-furbishing of our previously unused wet labs, created an AP Calculus  pilot program (all of our students passed despite it not being an  official AP class), created a competitive Math team which has met with success locally, participated in  recruitment drives to get new students, and even sat in on interview panels.  I have had consistently good  reviews from my students and I'm on decent terms with the President of  the Parent-Teacher Association (whose daughter said that I am her  favorite teacher).\n\nThis year, our school came under new management.  Their goal is to re-organize and expand the school.  They want to focus only on high school (9th to 12th only), and expand the enrollment.  Our school is built for about 300 students, but we currently only enroll 120.  One of the things they're doing to prepare for expansion is to hire department leads, as new teachers will have to be hired.  Currently, they only proposed three team leads: STEM, Humanities, and ESL/Foreign Languages, as or school is pretty small.\n\nI  decided to apply for the STEM department lead job.  In theory, it was open to all comers, and I figured I had nothing to lose.  I had done a lot of additional work and gotten excellent reviews from the old managers.  I was also in the process of obtaining alternative certification.\n\nInitially, the departments were allowed to choose their own leads, and initially I had been chosen by ballot.  Two weeks later, the head of HR  sent out an e-mail saying that I would not be promoted, and instead another teacher - let's call her Alice - would be.  I requested a private meeting with the head of  HR (part of the new management) to discuss why.  They claimed there was nothing against me, and that she was promoted because she worked there longer than I did.  That didn't make any sense, since new management fast-tracked one of their own into the Foreign Language lead position.  They also mentioned something about how they believed that I would not be able to execute my position \"fairly\".\n\nLater, I found through investigation of my own that she ran a Twitter campaign to get her friends and family to call in so that she could get the promotion.  She smeared me and the other people in the department as \"participating in anti-blackness and exism\"  (she's Black and Filipina, while I'm a man of Latino/Chinese ancestry).  Me simply because I accepted the promotion, and others for voting for me.  She even asked her friends if they could make fake screenshots of me saying racist things.  I then went to HR with the evidence in hand.  HR told me that they didn't receive any phone calls, and furthermore said that they could do nothing about the tweets because they were made off the clock.  They said they were going with Alice as department lead and that decision was final.\n\nAnyhow, since she got the position, Alice has been very  hostile to me.  She seems to be building a case to let me go at the end of  the year.  For instance, she has been conducting reviews of my classes  and has given me unreasonably low scores (straight 0's or 1's out of 10).  Under previous management, I have never gotten a review averaging less than a 7.  She also changed my teaching load so I'm no longer  teaching Calculus, but I'm teaching 7th grade math (a class which will be eliminated next year, thus making my job redundant).  She's asked me to prepare presentations only to not let me give them in meetings, as well as filed bogus complaints with HR.\n\nShould I start looking for a new job, or should I try to fight this and get my position back?",
    "title": "A colleague-turned supervisor is retaliating and smearing me because I applied to the same promotion.",
    "subreddit": "jobs",
    "timestamp": 1610267562,
    "score": 3,
    "keyword": "latino manager"
  },
  {
    "text": "I'm a woman in construction... This is a bit of a vent so bare with me, I have a lot to say...\n\nI'm a woman and I work in construction.  I used to be strictly in construction administration, but recently was promoted to production manager.  I was promoted to production manager because I know what I'm doing, I know the industry, I know how to talk to people, and I'm good with the crews.  Basically, I was promoted because I am, in deed, good at it.  And yes, I am a woman.  I'm also a small woman and an attractive woman and I wont make apologies for that or pretend that it isn't a factor in my day to day life.  Being a small, attractive, woman has often been an asset to me so no, I'm not going to \"hide it\" or pretend it isn't a thing.  Because goodness knows, if you're a woman in construction, you at least should have the decency to be butch enough that the men aren't attracted to you.  Sorry.  It's not my problem if you can't control yourself at work... Even if, it often becomes my problem in reality...\n\n1st vent: the white conservative men who dominate my industry are ALL racist and sexist.  This isn't y the first yard I've worked on an every single construction company I have worked for has rewarded a toxic culture of verbal abuse that is usually racially or sexually/homophobically motivated.  IF any of these men AREN'T actually racist, it is impossible to tell because they ALL laugh along with the constant jokes about race and sexuality.  There is one guy who calls all the crew members \"Mexicans\" as if that's an insult and not a country.  He knows full well that NONE of them are Mexican, but they are brown so he doesn't respect them.  So he makes a point of calling them all Mexicans basically to say without saying \"Don't come at me with that we're different cultures/countries bullshit.  You're brown so I don't respect you so you're Mexicans to me.  Try to say something about it.\"  He likes to call me \"The Jew\" because I'm Jewish.  He makes comments like \"Is that Jew speak?  Let the Jew handle the money.  Is that some weird Jew custom?  Is that Jew food?\"  Like, I'm not offended by being called a Jew, but he is obviously trying to offend me.  Lord knows what he says when I'm not around.  And they all go along with it.  The crew can't talk back to him because he's higher on the food chain and everyone with any power thinks he's hilarious.\n\n2nd vent: I went to the lumber yard to pick up a unit of CDX and some guy who recognized my company vehicle asked if I was the owners wife.\n\n\"Um... No?\"\n\n\"Then what are you doing here?\"  He actually had the nerve to ask me what I was DOING there.  As if it's a private fucking club.\n\n\"Working?\"\n\n\"This is YOUR job?\"\n\n\"Um... Yeah?\"  Cue he and his counterpart literally looking me up and down and proceeding to feel very entitled to comment on my physique and \n\n\"Well, you ARE pretty fit!  You have a GREAT body!  I bet you're stronger than you look.\"  Cue me just rolling my eyes and walking away.  Like, seriously?  Is this just a thing you do to everyone or just me?\n\n3rd vent: The only men who have crossed boundaries with me have been the white conservative men.  The latinos - who are supposedly all rapists - have been nothing but respectful.  They see me driving the big rig and think it's fucking great.  The white guys make inappropriate comments to/about me all the time and one of them actually went so far as being banned from talking to me outside of email because he was sexually harrassing me in the middle of the goddamned night.  They act completely fucking shocked to see me drive the box trucks and act like I turned into a watermelon if I correctly identify a screw.  Meanwhile they all tell me to \"watch out for the Mexicans\", who are almost all Salvadorean and most of them are married and have, like, I said, been nothing but respectful.\n\nI know I chose this.  I chose to be a feminine woman in a conservative and male dominated industry.  So, may be it's my fault.  Like, I could've been a nurse or something that is more acceptable for women to do, and still probably get sexually harrassed and have to deal with assholes and fuckwads.  But, I'm not going to apologize.  There is a toxic culture of racism and sexism in this industry and me being a small attractive woman who can drive a box truck is not the problem.  The problem was already there and I love getting out of the big rig and shocking everyone in Dunn Lumber who thinks it's a private boys club.  Get used to it motherfuckers!  Women can drive box trucks and fork lifts, too motherfuckers!  Small women are mighty!  Pretty girls can be tough!  I don't have to ugly myself up to make you comfortable, I don't have to dumb myself down to make you comfortable, and being 5\"0 has never stopped me from doing ANYTHING I wanted to do.\n\nAnyways, I don't know what the answer is.  I'm just venting and I'm done now.  Thanks.",
    "title": "I'm a woman in construction...",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1632365976,
    "score": 216,
    "keyword": "latino manager"
  },
  {
    "text": "Does this describe your school? How modern segregation works in an American school... A user in the politics sub laid out in comments a very lucid account of how his seemingly integrated school is in fact very segregated and has very different outcomes for white and PoC students. I've seen aspects of this in schools I've worked in -- although not quite as stark or severe -- and I wondered how common this from the perspective of U.S. teachers here. And what can we as educators do to address this sort of structural inequality?\n\nThis sub doesn't allow x-post links, so I'm excerpting -- you can find the post on r/bestof.\n\n>At my high school the way it worked was the school itself was a very old  and historic downtown institution. Hundreds of years old.  Big beautiful  building literally on the tallest hill.  \n>  \n>Lots of famous people graduated from it in the early 20th century, and not surprisingly it was all-white for most of that time.  \n>  \n>\\[...\\] in the  2000s the freshman class was about 30% black and 20% Latino.  \n>  \n>It was a relatively good school; so it’s not a surprise that PoC students who lived in walking distance wanted to attend.  \n>  \n>And they *really* wanted to attend, because their other options were the two all-black high schools or the one Latino high school. \\[...\\]  \n>  \n>Side  note:  those two schools were literally toxic (built on a superfund  site), and literally crumbling (walls falling down). They were sh$t  holes.   The Latino high school was a little nicer, but still seriously  underfunded and >95% Spanish speaking IIRC.  \n>  \n>None of those three schools had college admission rates over 25% or graduation rates over 75%.  \n>  \n>Anyway,  the white kids however, were mostly rich kids who were 2nd, 3rd, 4th,  or even 10th generation students! \\[...\\]  \n>  \n>“4th  generation rich white kids” don’t live near downtown in the modern American Midwest city— so most of the white students were commuting up to an hour to get to class. \\[...\\]  \n>  \n>The school actually had a  very very big waitlist for these “out of district” spots, and was  operating significantly over capacity.  We even had portable “temporary”  classrooms set up on the practice football field.  \n>  \n>But the **alumni donations**  from these rich multigeneration families made up a large portion of the  operating budget of the school.  That money was the main reason the  school was so good!  \n>  \n>I know I’m getting a little off track here, but think about that dynamic.  \n>  \n>explicit segregation is illegal  \n>  \n>more rich white kids from the suburbs want to attend than you have space for  \n>  \n>parents of the rich white kids fund the school  \n>  \n>the school is way over crowded  \n>  \n>you can’t stop local black & brown kids from attending  \n>  \n>So what do you do?  \n>  \n>1️⃣ First, you segregate the students during the school days.  \n>  \n>You do this because the rich racist parents don’t want their brats going to class with undesirable black, brown, or poor people.  \n>  \n>This  is pretty easy to do, because the rich white kids are going to 1st-8th  grade at their suburban schools in a different district.  \n>  \n>Those suburbanites get funnled straight into an all-white “honors system” of classes on the first day of freshman year.  \n>  \n>The prerequisites for those “honors” classes are conveniently only offered at the suburban schools.  \n>  \n>PoC students have no way in.  \n>  \n>(I put “honors” in quotes because these kids were NOT smarter, and there were no tests they had to pass.)  \n>  \n>2️⃣  You make the school experience for the white kids as high quality as  possible while making the experience for everyone else as bad as  possible.  \n>  \n>The white kids’ have  nicer classrooms with lots of sunlight, digital white boards, and 20  students or so.  They have better teachers, and more rigorous academics  available to them.  They get guidance counseling aimed at helping them  navigate the college admissions process, etc.  \n>  \n>The  black kids are packed 33 at a time into crappy basement classrooms with  chalk boards. Their teachers are alcoholic sports coaches, and their  “counseling” is about picking a ~~menial~~ working class career  after graduation (something that doesn’t involve college, like:  mechanic, waiter, hairstylist, taxi driver, etc).  \n>  \n>3️⃣  You segregate all the extra curriculars as much as you can.  \n>  \n>The newspaper and yearbook were white.  The debate team was white.  \n>  \n>The  only integrated extracurriculars were a few of the varsity sports  (basketball, track, and football had black kids \\[...\\]  \n>  \n>Oh, and the choir and the school musical were integrated because they had open auditions.  \n>  \n>(Although  the drama department still managed to do a second big production every  year that was, you guessed it, more exclusive, bigger budget, and all  white).  \n>  \n>\\[...\\]  \n>  \n>4️⃣ you create a system to funnel the black and brown kids you don’t want there out of the school as fast as possible.  \n>  \n>This  can be done through selective enforcement of truancy rules. It can be  done with extremely harsh grading of the “bad” classes.  \n>  \n>Lots of ways to do it.  But the end result is pretty easy to describe in numbers, because my class size was nearly 1000 exactly.  \n>  \n>On the first day of high school, me and about 999 other students showed up.  \n>  \n>About 500 white freshmen (mostly from suburbs)  \n>  \n>About 300 black freshmen  \n>  \n>About 200 Latinx freshmen\n\n\\[...\\]\n\n>Of the 500 white students, about 50 would drop out or transfer before graduation.  BUT, a new 50 would transfer *into* the school.  \n>  \n>So  the graduating white class would be about 500. Over 95% of the white  graduates went on to attend a four year colllege, many of them Ivy  Leagues.  \n>  \n>Of the 500 PoC students,  about 250 would drop out, or be forced by the academic office to change  schools by Junior year.  Another 100 would drop out or transfer before  the end of senior year.  \n>  \n>About 150  total would graduate.  About half of them would go to college, and less  than half of that group would graduate college.  \n>  \n>So final score for “preparing students for life” is:  \n>  \n>500 PoC freshmen = about 150 high school diplomas and about 40 college diplomas.  \n>  \n>500 white freshmen = about 500 high school diplomas, and about 400 college diplomas.  \n>  \n>Also,  it’s hard to even know the distinction between drop out and transfer,  as the system was designed to hide the drop out rates.  My high school **officially** listed all drop outs as transfers.  \n>  \n>And the schools they “transferred” to?  They just never listed those kids as attending.  \n>  \n>The  kids functionally just disappear from the system like they have moved  out of state.   No one looks to check if that happened, because no one  wants to know.  But everyone knows.  \n>  \n>This is still happening to this day.  \n>  \n>It’s a nice neat little system beautifully encapsulating white hegemony & how *systems* can enforce white supremacy.  \n>  \n>\\[...\\]TLDR:  the system was  & still is essentially designed so that rich white kids can go to  their parent’s alma-mater downtown, but won’t have to interact with  black or brown students. The way that is achieved is by making life as  bad for PoC students as possible.",
    "title": "Does this describe your school? How modern segregation works in an American school...",
    "subreddit": "Teachers",
    "timestamp": 1619360404,
    "score": 435,
    "keyword": "latino manager"
  },
  {
    "text": "That does it. I'm out. I've had enough.\n\nFirst it was getting screwed out of a promotion when new management came in.  I busted my ass for this time and earned my stripes with the previous management,  for which I was offered a department lead position.  I wouldn't have cared if they said \"Look, you've only been working here for two-and-a-half years and Alice has been working here for 5.  We believe the most senior person should get promoted.\"  But they went out of their way to show that Alice (not her real name) is the new golden child (she's the only member of the old staff who got promoted - they brought their own people in for other leadership/management roles).\n\nNew admin is cliquey.  They show no sign of wanting to support the teachers who are already here, who have been building the school for the last 5 years.  They've made it clear that they have no faith in certain teachers (in particular former military and industry), since they prefer the \"traditional path\" teachers.\n\nNow this:\n\nOur school is divided between students who are above-average to pretty strong academically and students who really struggle to keep up.  30% are pretty strong academically, and 50% are just average, and 20% are lagging behind.  Recently new management has decided something has to be done about the disparity.  They claim that there is a disparity among achievement among ethnic groups.  Asian, Latino and White students tend to do better than Black students.  They want to correct this.  Most teachers agree that something should be done, but we just don't agree about HOW it has to be done.\n\nNew admin suggests what essentially amounts to cooking the books.  Since we're private, we don't have IEP's.  Kids who are struggling are placed in a special \"Learning Assistance Program\".  Students in this program cannot be given lower than a 60 on any assignment as long as that assignment is turned in.  They can't be failed for a class until we've met with the parents three times, and a reams of paperwork are signed.  Electives and sports count towards GPA, and we're to make accomodations in grading as well.  Kids in the Learning Assistance Program can't be suspended.  They get special projects that basically boost their GPA.  Teachers have to bump up grades sometimes by more than an entire letter grade at the request of admin for these projects, which for whatever reason, we're not allowed to see.  Honors classes will no longer be weighted.\n\nThe result is that even less than one month in, in the Learning Assistance Program are basically starting to game the system.  In some cases I was basically requested to dictate the correct answers to students during tests, or to upload homework answers to Moodle so that the students could \"print that out and submit it\".  Literally all they're doing is printing stuff out, putting their name on it, and I'm required to give them an A because they've answered everything correctly.\n\nNot to mention that we now have kids intentionally acting up in class (e.g. dancing in the aisles  or bouncing a basketball to get on teachers' nerves), or in some instances verbally threatening teachers.  Some students have been openly defiant and admin shrugs it off because \"different cultures have different attitudes towards authority\".  These kids are acting up are either white or black American.  The \"different culture\" kids are more or less respectful.\n\nNeedless to say, some people think it's unfair.  We have a lot of first-generation Asian and Latino immigrants who came to this country with the dream of \"making something of themselves\".  These kids are driven as heck to perform well academically.  But they are not given Learning Assistance.\n\nAdmin doesn't want to backpedal on the policy and demands that we check our privilege, ignoring that our student body and current academic team is pretty diverse already.\n\nI refuse to lie just so my admins can look good and appear as some great humanitarians when they are chasing their own ego.  As soon as I've secured a job for next year, I'm out.",
    "title": "That does it. I'm out.",
    "subreddit": "Teachers",
    "timestamp": 1611819247,
    "score": 34,
    "keyword": "latino manager"
  }
]