[
  {
    "text": "This is what I'm interested now, what careers could potentially be a good fit based on this list? I'm 22 years old and took some time off from school so I haven't graduated yet. I go to a good university but I felt completely lost; I couldn't even declare a major since I was so indecisive.\n\nI've been doing a bit of soul searching and am trying to find out what interests me. Up until now I felt like I just always did my schoolwork and then hung out with friends and family, so I legitimately didn't feel like I had any interests. I wasn't particularly obsessed by any one topic either. I've been trying to read more and listen to podcasts, and open my mind a bit.\nAnyway, at this moment, I've managed to come up with a list of general topics of what I find interesting.  \n\n * **Healthcare:** The current plan is to go to medical school. But I'm interested in healthcare in a broader sense. I care about women's health in particular, so ob/gyn is a thought. I am Latina, so I care about helping bridge disparities in healthcare including language barriers for my community (others too, but I don't know enough about other communities).  \n \n * **Latino Issues:** I care about immigration policy. As I mentioned before I care about giving Latinos access to healthcare. A path to higher education. Mentoring for other Latinos to be aspiring physicians (if I decide to become a doctor). Getting more Latinos involved in politics and exercising their voting rights.    \n\n * **Education:** I've thought about becoming a teacher, but I don't know if this would be the right job for me. I'd maybe like to be involved in policy?  \n\n * **Others:** Finance, Tech, green jobs/environmentally friendly, non profits (big one), working in politics to help shape policy (maybe a think tank type of situation?).  I don't know if I would enjoy doing research, but I'm also interested in this (when I go back to school I'd be able to see if it would be something I enjoy)\n\nHopefully this post isn't too scattered. Anyway, thanks beforehand!",
    "title": "This is what I'm interested now, what careers could potentially be a good fit based on this list?",
    "subreddit": "careerguidance",
    "timestamp": 1513895599,
    "score": 1,
    "keyword": "latino manager"
  },
  {
    "text": "I work at a hotel. The cook at the restaurant in the hotel says racist shit on the reg. What can I do? The cook recently said \"there's so many Mexicans in here you all should start a mariachi band\". The restaurant manager (latino) just asked for an apology and the cook refused. The manager and 2 servers complained to our GM and HR... They both literally said that the staff made up the story together and rehearsed it. After the conversation and they thought they had hung up, the GM and HR were making fun of the restaurant manager for being Mexican. He recorded it. \n\nHe resigned shortly after and is planning to sue. \n\nWhile that goes down, I feel like I can use my white privilege in this situation. I want to go straight to corporate and tell them what's been going down. But I don't have any evidence or was even there when it happened. But I definitely believe them. \n\nI hate that I work for a company like this.\n\n\n\nA past cook has said shit to black servers about \"eating all the collards greens\". I'm sick that I'm working at a company that lets this shit go on for so long.\n\nThat same cook also handed a Latino cook a brick after the election and said \"better start building!\" which made one of the latino servers cry. They told her to calm down.\n\nI've gotta do something. I hate to bother you ladies with this, but I know if I asked any other subbreddit, it would be half assed. \n\nThank you all in advanced... \n\nedit: so appearently the CO is coming down! He'll be here all week! He lives out of town so this is a big deal from what I'm hearing... There's going to be a lot of people talking to him. Me being one of them.",
    "title": "I work at a hotel. The cook at the restaurant in the hotel says racist shit on the reg. What can I do?",
    "subreddit": "blackladies",
    "timestamp": 1499656279,
    "score": 27,
    "keyword": "latino manager"
  }
]