[
  {
    "text": "Should I focus on working at niteflirt or taco bell? I've been making a little less 2k with phone sex operator work I am getting bad reviews I don't care about these guys needs like I should. And I really am working seemingly the ones I just yell at men call them cunt bitch and pussy those are the only listings I get 5 stars and I have bad reviews there too. If I turn it around I'm pretty sure I could make 4000 I need a set schedule regular group messaging and knowledge on all the fetishes not a behavior of not caring and hanging up on people etc....\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nSo I used to work at taco Bell I got treated like really badly. My mom worked there and said they would talk about me behind my back and were like high school kids. These people were just hostile. And it got worse around the holidays. Which is why I ended up quitting. Okay so at first like I worked part-time. And I noticed there were problems but I only work there like maybe three days a week. So I didn't care. Now the amount of money that I made was like much less than phone sex operating. I make like 2000 not giving a darn about what the men want or anything. I just keep the phone on the line most of the day. I should make about 4 to 500 a week. At the old Taco bell. I made like a thousand. a month. So obviously I only make like half the amount I make and phone sex operating and I feel like phone sucks operating is more of a career for me. Considering if I cared a little bit more I could probably make like 5,000 a month. So I mean I could live very comfortably. I mean plenty of people have careers and make $60,000 a year. And if you think of it phone sex operating it's kind of like that. Because the average earner on night flirt is specifically 47,000 a year. If I was to care a little bit more about my calls because it would last longer my calls usually are one or two three four minutes. On a 70 a minute call. I just get a lot of callers because it's only 70 cents a minute. And you know the men have a bit of that understanding. That I may not care enough about their needs. But they kind of are okay with it I think to some extent some of my regulars. Because it's such a cheap call.\n\n&#x200B;\n\n&#x200B;\n\n So it does work out. But as you can tell I'm only making 2,000 a month. I could do a little bit better get good reviews instead of like how I am right now I get like five stars on my night flirt listings only on the listings I'm literally insulting people basically so like if I'm telling them they're pathetic or calling them the b word the c word things like that. Then I will make a good results good listings good reviews. I have success there. Because I do very well insulting them. And I do very well insulting them because I don't I guess like my own clients. Which is fine. Because I mean like I never meet them in person they're just people on the [p](https://phone.It)hone doesn't hurt anything I make even though I really am not putting any effort in my job as a phone sex operator at night flirt. But there are some things here. That are kind of and some of the things that are kind of beneficial are specifically things like with taco bell. That I am able to like get transportation. Into vegas. Things like that. I could get my own place. But I kind of feel like I could just move to Vegas and get a place there with my phone sex operating job. Cuz I do make about like 2,000 a month. I mean like it doesn't hurt for me to do that just save up. So that's why I'm like I'm not sure if I want to go back. Because the manager there general manager just said I got hired. At Taco bell but I don't know if I want to do it again. Because like I said it was a lot of hostility they treated me like crap it was terrible. And I get less money. And it's hard to work. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nFor one at Taco Bell I remember during the holidays the people who work there specifically were like really aggressive to each other. Like they would yell at customers curse customers out. Curs each other out. Like this happened all in one day at one time. And where it went downhill for me because during Christmas it didn't actually become   a problem I just went in like cleaned the bathroom. I didn't enguge in that behavior. I was the only one who wasn't cursing anyone out actually. And the whole store. But on New Year's Day it was really hectic. And then what happened in that situation was specifically the two co-workers tried to make it more stressful to work. Basically so they were getting aggressive and trying to basically attack me for the fact that they kept the drive-through line so long. Because I had nothing to do with that. I was doing the front at the time. But then they started blaming me for the backup in the Drive-Thru when I wasn't even working the drive-thru. And it had accumulated so much that two problems occurred at once. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nOne Brandon got put on break even though he was scheduled later than me and had a history of not working when he was there we would sit in the booths and look at his phone. He got away with a lot even calling black people the n word while at work and claiming he was white.... (He's not white he's latino he's just racist and ashamed of his race he won't admit he's Latino despite having a name godinez) He had the nerve to be complaining and disrespecting me for not being able to do two things at once being at cash register and drive thru telling the customers I wasn't good at my job and complaining about me about my job when the reason drive thru was backed up was because he was given a break and I was tired out. So what ended up happening in that situation was I ended up yelling at the general manager. Not because I was angry at the general manager. What was really occurring in that situation was I was upset that the other person had been talking crap about me to the customers. While having had taken his break. And mess everything up. And make me not have to take a break. So for those reasons I was upset at that situation not particularly at the general manager.\n\n&#x200B;\n\nSo after that point. That all that week things went downhill from there. And I ended up quitting on Friday just real quick. Oh the reason I quit like that. Was because on FridayI just felt like I didn't need to put up with all the crap I had been putting up with. Added to the fact that like because my mom worked there and she was saying that they were just talking crap about me like that. Now I knew like how they actually felt about me. And I didn't like it. Like usually when I work a job where someone doesn't like me. I don't care. Because I don't get to hear what they're saying behind that. Right but in this case I could. And then it made everything very uncomfortable in working with them. So that's why I just kind of felt like quitting was better. And I did feel like it was a distraction to working my other job as a phone sex operator.\n\n&#x200B;\n\n&#x200B;\n\nThe reason I feel that way is because I spent a lot less hours working that type of job. Because I would tire myself out. Working the other job one and not just that. It was during the weekend which is where I mainly make my money. And I also realize I actually have long sleeper syndrome. Which means that I really function better at 10 hours or more of sleep. So if I were to have a job like Taco Bell and phone sex that would be problematic. Because I don't think I would have enough time to work both jobs.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nAnd when I think of the longevity of the two jobs. I kind of feel like phone sex operator is a longer lasting job. Obviously I could do that until I'm like maybe like 80 if I wanted to. And it makes like way more money. Like I said without caring about what these people like what are their needs or whatever I make like $2,000 a month. So if I was to actually invest in how to do this right. I would probably make a lot more like if you looked at my listings it's only like one sentence. I really don't care when I make my listings. I really don't care when I'm on the phone. All I do is just make sure that I'm on the phone or have it on where someone can call me for like at least 14 to 16 hours a day. And it makes me a good amount of money where I can actually work and provide for myself. And not really even have to go out of my way. To make money. So I don't have to work hard I don't have to go anywhere to work. These are the benefits. But then there are some benefits to getting a job like Taco Bell like for example. I don't want to disclose to like snap or food benefits that I work as a telephone operator. And I don't have to. As long as I work at Taco Bell I can always put them as the place. That means I get benefits. And don't have to pay for my own food.\n\n&#x200B;\n\n&#x200B;\n\nAlso another aspect to this is specifically like I said because it went downhill after that point. And the way I left. Was generally very I guess negative against the general manager. Like for example my mother hypothesizes that he is angry at me and trying to get back at me. Though he did send me a message saying I was hired. So I don't know. The way I left some people thought that I cursed everybody out and left. That's not what happened.\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n What actually happened was I specifically posted a video to the work forum that we were on we had to work for them that we all messaged each other in. Basically it was like a crew app. The music video I linked had a curse word in it. And also I started talking about what I did at my job night flirt. And the reason I did that was because I had talked to one person after I talked to two people about what I did at night flirt there. Now one of the people I talked to was a manager about it. Like I would regularly tell that person well I think one time I told her. That I would call like men the b word and things like that. And that the drive-thru phone basically would make me want to respond basically the way I respond when I do night flirt. So anyway the video had the title my give a damn's busted Jodie Messina. And it wasn't just that. But I specifically like I said to that I made like $2,000 a month basically telling men to show things up there ass because the major part of my job is actually dominatrix work I guess you could say when it comes to phone sex work. Because I specifically am more focused on disrespecting people and then sometimes I get those other guys who they like disrespect but they like guys too they like pegging and things like that. So that's where I make my money. \n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;\n\nAnyway the system bleeped it out as if I cursed.Or said something along the lines of offensive language. But that was not what I was trying to convey I wasn't cursing anyone out. I was just saying I was done.\n\n&#x200B;\n\nThe next day I texted the general manager. Just to make sure they understood all was over with. Pretty much the same message saying my give damn busted and I was done.\n\n&#x200B;\n\n&#x200B;\n\nSo I quit. And then I at one point tried to apply. And then like it took 4 months or so it took a long period and then he finally was like he was saying that I was hired. So I still haven't responded back. I just kind of saw the text and moved along. I don't know should I say something? If I say something what should I say.? Should I say I'm done interested? Should I say I'm interested. To me it seemed like he gave that well maybe he was drunk? Cuz I mean the spelling is kind of off. So that's another thing to consider.\n\n&#x200B;\n\n&#x200B;\n\nAlso I feel like it could be a distraction from my phone sex operating work. Because I do have a situation where it last time when I worked there. My phone sucks operating work went down to 200 a month. Because I did not have it on all day like I should have. I was too tired to work. I just wasn't putting in effort. Like I should have.\n\n&#x200B;\n\n&#x200B;\n\nI kind of do feel bad. Because I have been asking for the job for about a couple months. So I kind of feel bad now to say that I don't want the job. Because I've been asking for it this long. And I kind of feel bad cuz it's like I feel bad that I left so early. When usually I don't leave for the reasons I left. It was just like I said knowing that these people did not like me. And we're very negative. And I did not like but what they were saying behind my back. When you know I didn't have to know about that. If I would not have been told by my mom I'd have never know and probably still work there now. Which is why I feel it's super hostile to try to work there again. But in this town it's probably the only place I'll get a chance to work at. So what do you think I should do?",
    "title": "Should I focus on working at niteflirt or taco bell?",
    "subreddit": "jobs",
    "timestamp": 1685284808,
    "score": 2,
    "keyword": "latino manager"
  },
  {
    "text": "Semiconductor engineering job, looking to switch for 3+ months, no success (Austin, TX). Pls advice/help. Hi, I currently work in quality for a big semiconductor company, I've been doing this for 2.5 years (out of college). I have a BS in Mechatronics Engineering from a prestigious university, great people skills and a few other niche skills that I've learned in my job (other than basic college engineering skills/knowledge). **I want to go into technical sales, support engineering, or basically anything that gets me closer to sales and a little further away from pure technical jobs**, ideally for a FAANG but I'm open to any company that will let me get my foot in the door.\n\nI've been looking for a switch for at least 1 year now, and casually been looking around, but it wasn't until last June that I seriously started dedicating strict hours of my day to job hunting online. I've been looking and applying on LinkedIn, gotten help from two friends to apply to their companies (one was a contractor job for a big tech and the recruiter just stopped replying and the other was a power engineer position for a small, private company where the recruiter just never reached back out), looked individually at the career sites of big/medium tech/semiconductor/automotive companies and unfortunately, also haven't found anything good and/or in my area.\n\nI'll add that my current job is cushy and I'm very grateful to have it, but I feel like I stagnated a while ago. I want to be challenged and I'm pretty underpaid. My manager is a very nice older man and he's very supportive but he doesn't encourage career growth/development at all, it seems like at this point he just want to ride the waves as smoothly as possible and keep everybody happy (his employees and his boss) till he retires.\n\nI'm aware that the economy in the US doesn't project anything good and the job market has been rougher this year.\n\nI'll add that I'm F25 and latino as a side note, not sure if it's relevant at this point. I beg of you, if you have ANY solid advice, leads or anything, I would GREATLY appreciate it. \n\n&#x200B;\n\n&#x200B;",
    "title": "Semiconductor engineering job, looking to switch for 3+ months, no success (Austin, TX). Pls advice/help.",
    "subreddit": "jobs",
    "timestamp": 1695745798,
    "score": 1,
    "keyword": "latino manager"
  },
  {
    "text": "Why lie to me? Some background: I started a new job, yesterday was my first training day. Now, I’m mixed( black and native) so my skin is lightish but I have dark hair. Why the description? Because my new job is mainly made of Hispanics/ Mexican Americans and Latino people. \n\n\n\n\n\nThey started speaking Spanish to me.\nWhen I said I didn’t understand they asked me if I was mixed. I told them I was and they asked why didn’t my one parent teach me Spanish and it clicked for me that they thought I was mixed with their roots. When I told them I wasn’t, they all said they thought I was Dominican. ( I get that a lot but most of the time from older white women who assume I don’t speak English for some reason) \n\n\n\n\nThe assistant manager was training me. His friend kept walking back and forth saying hi( he doesn’t know English well) and I’d say hi to be nice. Well the AM asked for my number for said friend I’ll call J. I said NO immediately and quickly explained that I don’t date, I study with Jehovah witnesses and I’m probably never going to date. As soon as I finished the AM said it’s for a work group chat, basically to cover shifts. \n\n\n\n\nSo naturally I felt (teeny tiny bit) bad for going on my lil tangent and apologized and gave him my number, to which he didn’t believe it was my number and proceeded to call me to check. (Red flag 1)  basically I get home to see he added me on Snapchat. And there is no work group chat. \nHe thought I was pretty and wanted to know if I would go out with him. \n\n\n\n\nI told him no straight up but my problem isn’t with J. I would’ve told him no anyway. It’s the fact that the AM lied to me, and either lied to J or J was secretly in on it cause he thought that if I talked to him it would change my mind. I just hope the AM doesn’t say anything to me cause I’ll call him out ( not rudely tho but definitely setting boundaries.)",
    "title": "Why lie to me?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1683766762,
    "score": 18,
    "keyword": "latino manager"
  },
  {
    "text": "Parent teacher meeting ended in me getting terminated I had a meeting with the parents of the “Extremely violent, perpetually angry student.” For context, he has been placed in my intellectual disability unit even though he only has a diagnosis of autism, and wrecks the whole classroom and attacks everyone all day, every time he shows up to school, which isn’t often. \n\nThey were toxic. They came in 5 minutes late and hadn’t even sat down when they began to yell “You are NOT expelling our son, we’ve already tried every school within an hour from home and this was our last option.” Um, no you haven’t, you just refuse to get him transferred to alternative school. (Administration was supposed to supervise but didn’t show up.)\n\nWe went straight into talking about his extremely violent behavior, and they accused us of “racially profiling” their son because he’s a black latino adoptee from the Dominican Republic. Literally nobody brought race into it except them. (Note that these parents are white people.) I also brought up how he seems to be coming to school unwashed, and that he alone makes the whole classroom smell bad. Again, I was told “That’s racist!” \n\nI told them about how restraint is considered inhumane and how we can’t give him his prescribed sedatives, and I got told “You need to have better classroom management!” I have no idea why they blamed me when they already said that he acts like this at home too. \n\nLastly, I asked them to explain how I’m meant to do that when no strategy works and they just complain about it, and they cut me off and told me “If you continue to be so reckless, we ***WILL*** be suing.” They then walked out. We had an hour booked for the meeting, and they came in 5 minutes late and were only there for 10 minutes. They remained in the building for a while after though.\n\nSchool administration backed the parents and told me that I need to do my job better, and that they will be replacing me due to my “inability to manage violence”. Um, no, I was the one who asked both school *and district* administration for help and got ignored by both. I did show them the documentation I had on him, and they didn’t even read it. Instead, it turns out that I’m going to be terminated after this semester.  Administration didn’t even tell me what happened but I bet the parents ran with the false accusations of racism they pulled out of their asses.",
    "title": "Parent teacher meeting ended in me getting terminated",
    "subreddit": "Teachers",
    "timestamp": 1676460560,
    "score": 1308,
    "keyword": "latino manager"
  },
  {
    "text": "Stay at dying startup or move to a new one which hasn't even been born yet? 6 YoE latino software engineer here. Been working as principal engineer at a startup from my country for over a year, good salary, nothing too crazy but it's more than enough for my personal needs. The thing is: it's slowly dying. >90% of the company's money comes from small accelerator programs and government subsidies, the remaining 10% is from sales that came into fruition over a year ago, back when the company was born (let's just say the company benefited from the pandemic). We've been trying to pivot into new ideas that could help us make any actual sales, but our main focus is hardware related and it's honestly very hard for clients to be interested in such things. I honestly think there could be no possible product market fit which is a bummer, but yeah.\n\nMoving on. A week ago I was personally contacted by the CEO of a brand new startup that wants to hire me as engineering manager, basically the same as my current role but with a new name and better salary (20% increase). Has way better connections -the company will operate in my country but its CEO comes from the US- and according to him they'll have zero trouble at getting VC funding and making first sales because of their connections. Although I am aware that most CEOs are pretty good at lying so I'm not totally sure. Also, the current status of the new company is pretty much barebones, I would be building this from the ground up along with the current engineering team. The idea is somewhat weird too, they're trying to build a SaaS for an entire industry, which means the product will be a myriad of modules for each and every one of the stakeholders of said industry. I dunno, sounds very dotcom-ish.\n\nTo summarize, my current company is slowly dying, has made a few sales but nothing after that, and there could be no product-market fit. The new company has no product yet, its roadmap looks weird and the idea hasn't convinced me yet, but they offer a salary increase and have way better connections.\n\nWhat would you do in my shoes? thanks in advance",
    "title": "Stay at dying startup or move to a new one which hasn't even been born yet?",
    "subreddit": "cscareerquestions",
    "timestamp": 1674220018,
    "score": 0,
    "keyword": "latino manager"
  },
  {
    "text": "Upset at work but not sure how to define it. I'm asian female  and recently at work I got promoted. One of the manager (Black female) told me that she heard this other manager (White male) complained at work about how our work is keep promoting Minority like asian and latino and its not fair. They both work under me and i'm assuming that White male manager thought he was going to get this spot that i got promoted into. \n\nIt has been bothering me for few weeks and i am trying to figure out how to define it. \n\nSo promotion is already over, i got it and he didn't. i know he is pissed b/c he wanted this position and thought he was going to get it. However i don't think it is right that he can say that kind of stuff at work infront of everyone and no one thought it was an issue. Am i over reacting ? I think it is wrong for him to say that which denies all my extra work and effort i put in to get promoted. But its not like i got any harm by him saying it so. I'm not sure how to explain this situation. like how do i explain this is wrong of him or is it even wrong of him? b/c he didn't harm anything. \n\n&#x200B;\n\nAlso why am i upset by this for so long ? i'm the one with promotion. is it ok for me to be upset over this or am i over reacting?",
    "title": "Upset at work but not sure how to define it.",
    "subreddit": "asianamerican",
    "timestamp": 1688402223,
    "score": 109,
    "keyword": "latino manager"
  }
]