[
  {
    "text": "Need help with how to bring up issues about how a class is structured I'm on mobile so I apologize in advance for the formatting. \n\nI teach Spanish in a district in Metro-Atlanta. This is my second year as a teacher and I was given a class that everyone in my department avoids like the plague, Spanish for native speakers.\nIt used to be a fantastic high level world language class until demographics began to change. In the past the school would have a good amount of students with Hispanic/Latino cultures and backgrounds who were also fluent in Spanish. That has changed. We still have a good amount of latino students, but they don't necessarily speak any Spanish. These students operate at a level one or lower fluency, but are placed in the Native Speakers class because of their background and last name.\n\nI have a huge problem with this as not only does it seems discriminatory on the basis of race and national origin, but we are also doing a disservice to the students by placing them in a high level class they are destined to fail. Not only that, there could be students with non-lstino backgrounds who could be fluent in Spanish and they are not placed in the class because their last name doesn't fit the description. \n\nI have brought up my concerns to administration and they were dismissed by telling me I am supposed to differenttiate within the varied language proficiencies. Now I am a relatively new teacher, but as far as I know, differentiation is used to challenge or support students within the same level, not to teach 4 different levels within one 50 minute class period. The school has no real requirements for this class. No proficiency test. As long as your name is Hernández you are placed in this class without a say. I have been tasked to keep the Latino students isolated in this class for the entire year and then make a determination of what level they should go to afterwards.\nAdministration's reasoning for this behavior is that it would be unfair for a fluent Spanish speaker to be at the beginners level, but many of them are truly beginners.\nI have a French last name, by this logic, my kids would be enrolled in a francophone class with complete disadvantage.\nI've decided to bring this up to my World Language director in my district since my school refuses to appropriately place students in the correct level.\nWhat should I say? Has anyone had a similar experience?",
    "title": "Need help with how to bring up issues about how a class is structured",
    "subreddit": "Teachers",
    "timestamp": 1564522018,
    "score": 4,
    "keyword": "latino director"
  }
]