[
  {
    "text": "ADVICE - 1st yr teacher swore in front of students. I have a group of students who are so defiant, I get anxiety just thinking about supervising their study hall class. They call me names in Spanish, and when I call them out on it they tell me I have no proof because I don't speak Spanish. On Friday, things were going okay. I was having students color a piece of a Latino Heritage mural we were going to put up in the hallway. I played Selena on my computer. Kids were happy. I was happy. Things started spiraling when I started calling students out on foul language. Swearing is clearly not allowed, so after a warning which fell on deaf ears, I started logging infractions. The swearing continued. I'd circle the room, talking to students and helping them with the coloring key. As I'd come up to some table groups, they would give me this stare down and start speaking in Spanish yet again. No idea what they're saying, but it feels like it's inappropriately about me. I sit back down and the swearing continues. I tell my students that phone calls will be made home and start a list with examples of inappropriate behavior. THAT'S WHEN THINGS ESCALATED. I felt an immediate shift. Walked to the call button to ask the office for help. It wasn't working. I sat back down and texted my principal asking for her to come up because I was losing control of the class. She texted back saying she wasn't in the building and to contact the VP, whose number I did not have. I sat back down and continued writing. All of a sudden, a group of 7 students all got up and walked over to my table. They circled around me and started asking if they were on my list. They took my paper from me and started yelling \"I didn't say that!\" and \"You can't prove that!\". That's when it happened. I look at my paper getting passed around and crinkled. I reach for it and under my breath I say, \"Give me my f****** paper back.\" I was looking down at the table when I said it. They got me and they knew it. As soon as those words came out of my mouth, they walked away. They won. That's when the AP came in the room (Principal must have texted her), and told me to take a break. I explained what happened after the kids were dismissed. Made phone calls home. I am afraid of coming back tomorrow. I don't know what's going to happen.",
    "title": "ADVICE - 1st yr teacher swore in front of students.",
    "subreddit": "Teachers",
    "timestamp": 1508086177,
    "score": 19,
    "keyword": "latino principal"
  }
]