[
  {
    "text": "Needed opinion - Harassment in workplace I started working for this company (not stating the name) its a big company. I worked as a CSR handling calls for a Federal government insurance program. I loved my job. I believed I was good at giving the customer service that the members requested. The office where I worked at was open 24 hours, so there was people coming in and out from working there 8 hour shift. Everyone had their supervisor within a group of 6 to 10. At first when I started working there me and my supervisor worked on different floors of the building. So we only communicate through TEAMS. I felt good being in his group. He never really bothered me, do to I felt I was doing my job right. Couple months pass by, the company sends out a email stating there letting people go. I was in shock , I stated to myself how can this be I just started this job I enjoyed. Well I was one of the lucky ones that didn't get the meeting in the conference room email. After the laid offs, the company decided to put everyone on the same floor as their supervisor. Well this is were my nightmare begins. When we finally meet in person I felt off about him. How should I start.. Okay. I know my attendance was perfect, but had my sick leave to back me up. I always felt like he picked on me. Finding something to state I was doing wrong. I don't know if I made him uncomfortable, when we had are one on ones he could never give me eye contact. Was it due to my age, the color of my skin, (Im Hispanic) my looks, my performance? I would notice  he would favorite other in the groups. And I was not the only one who saw it, others from the group would see it too. This is one of the scenarios.. It was just me and other coworker (female also) there on his team, he walks through the aisle both of us not on a call at the time. He states \"Good morning to the other coworker and walks away like I was invisible. It was like whatever at the time. I didn't need him to give me a Good morning if he did want to. But being a \"professional company you would think the supervisor would be. Others coworkers would see the tension he had with me. So I started asking other coworkers what I can do to change supervisor due to the fact I was no longer happy going to work. It was making me miserable and stressed out. I  decided to put it off to see if things would change before going to HR, but finally had to guts to write a email to my supervisor's boss., NO response, sent email to HR, after a couple of times the finally responded. All I wanted to do was get switched to a different group. And get the passion of loving my job once more. All they stated to me was \"lets see what we can do\". Then another thing happened. One day getting to work there was just one coworker there nobody else , so I went about my business, then this coworker comes to my desk and states \"can I ask you something?\" I'm like \"sure\" thinking it was work related. (it wasn't unusual that we would help one another) then he states \"I been wanting to ask you , but how big are your breasts?\" I was dumbfounded and in shock, I didn't know how to respond, the only thing that came out my mouth was \"WHAT!?\".  He saw the look on my face and said \"never mind, its just that am a breast man\". I was so uncomfortable , what can I do, this is sexual harassment! I didn't dare tell my supervisor, at this point I was just voiding him and him the same. I did tell other coworkers , with anger and tears about what happened. They're like, you need to go to HR but ASAP, that is not right. Once again sending email to HR that I needed to speak to them right away.  Im going a little higher in rank and sent email that I need to speak to her. She set up a meeting , I was like a female she will understand. I first explained my situation with supervisor, then the sexual harassment part. She seemed concerned. I was like .. \"finally someone who understands me\". She wrote everything down and stated she as going to correct this and get me moved ASAP. Next day HR calls me in office and wanted to know what was going on. I explained, but all I wanted was to get moved!! I no longer could be near this coworker. I always felt he was staring me down. HR also wrote everything down And started was going to get this resolved. I come out to find there resolved was to get ride of me!! Weeks passed we are talking, 4-5 weeks and no change!! I would see HR walking in hall ways , and would recognize me, and state \"we still working on that about moving you\". Then came the lay off again, letting people go, and I was one of them!!!. I was like in disbelief. I felt I'm getting laid off and the sexual predator gets to stay!! At the time of the meeting we were told if he finished working are two weeks we were eligible for are vacation pay and Unemployment with the opportunity to get rehired, if we decided to leave that day , non of the above opportunities were going to be available. I really wanted to get rehired and couldn't afforded to walk off. But before I completed my two weeks, the company offered me another job position (Remote) and of course I took the position. On my last day of the two weeks.. a supervisor came to walk me out of the building and handed over my badge. I started working from home. It was great.. and that position also came to an end. I was let go due to position eliminated. I applied for Unemployment, I received one check and now its in issue states. This company is denying my unemployment and also refused to rehire me stating \"I was a no call, no show\" I tried numerous of time to call HR and no return call. I need help.. Im jobless.. unemployment less. Do you guys think that this is something I can talk to a lawyer about?? (sorry so long, been wanting to state all of this).",
    "title": "Needed opinion - Harassment in workplace",
    "subreddit": "jobs",
    "timestamp": 1697958507,
    "score": 1,
    "keyword": "man lawyer"
  },
  {
    "text": "How to quit job without being financially blackmailed Like the title stated I want to quit my job, but fear my boss will come after me for financial retribution. \nBackstory is that I work as a RDA at a private practice general dentist office. I have worked there for almost a year, my current boss the dentist poached me from another office after 4 months of talking to me about getting my RDA, was only a DA at the time, he was my personal dentist before I got into the field so I thought it was an awesome opportunity to have a dentist I liked as a boss and he offered to help me pay for classes. He paid for a $400 class and I was extremely grateful and happy for the opportunity. Eventually he hired me and I was very excited my prior boss was not paying me my overtime nor even for my contract signed scrub pay which was only $40 but he refused. So I was relieved to have a new boss. (Yes I should have fought him, but my dad just died and I was not in the right mindset). So cue me starting my new job and being very taken aback that not only are the staff members rude to me right away but they all warn me that he makes everyone cry their first month at least and later he states this to me too. I’m a whole hearted team player and at this point just keep my head down and do my job, so I just try to have thick skin.  The other assistants are down right mean to me and one of the three hygienist tells me that my hair looks trashy and unprofessional so already regretting my decision but now I’m stuck because I don’t have a backup job. But the first month because the dentist is a control freak I am not allowed to assist at all, talk to patient or do anything other than observe, which I thought maybe was okay because I’m used to zero training and being thrown right in. Well in this month he offers to do Invisalign for me and says I need to practice scanning and get scanned so I know, he orders them and then says that $1,200 for lab fees is added to my account and my overtime can pay for it, at this point I already feel he is very hot and cold with everyone like an abusive bf who love bombs you and then is super mean. I immediately feel he did this right away neglecting to say he would charge me and implying it was free to trap me and I figured it out after the other assistant told me he paid $26k for her extended functions class but signed a contract that she couldn’t quite.so now I feel stuck, but I swallow this red flag because there are no other job opening and I owe money. After this the first time I assist him he literally rips instruments out of my hands smacking my hand in the process and yells at me over the patient. I get through the day after crying in the bathroom and the other assistants seem to almost revel that I’m getting yelled at. But I wait for everyone else to go home and I plainly tell him if he ever does that to me again, I will leave right then and he can mail my check. So he goes super apologetic and justifies that he is very stressed and is so sorry and he needs to work on his temper. This is when I know I am quitting, but I don’t have a backup. So I have him do all the paperwork to help me get my RDA and I start working on my resume. I get my RDA and still no openings other than peanuts jobs and elderly about to retire drs. So he doesn’t have an outburst that bad to date, but he is mean, rude, trash talks everyone and still will raise his voice in front of patients, fires numerous people out of the blue because he didn’t like them. My problem now for quitting if you have made it this far is that he made me order medical loupes, I had a sit down meeting and he said they were required for the job and I need them to stay working, I told him I cannot afford them and the best I can do is a $250 over glasses pair. He said he would pay for them and I can pay back over time, I again stated I cannot afford an 1/8th of my yearly salary for them and cannot and will not pay for them. To which he said he will pay for them, he just makes us pay so we are grateful for the things he does for us. He orders them over $3k and they are custom to only you. Now this is my fear, even if I leave them he is going to come after me for the money for “crossing” him by quitting, I haven’t even finished the Invisalign trays and my teeth are more crooked  looking now than before but at least I can have someone else remove the composite buttons off my teeth, I just have no money and don’t want him to issue a 1099c after me or have his lawyer come after me since he put the charges on my patient account I checked last week. I have an interview for a new job that pays over $6 more an hour and is 40 hours vs 32 with benefits. I make less than $1000 biweekly right now and can barely pay my bills, he promised me a raise but keeps postponing it. At this point love nor money would make me stay. This workplace is toxic and verbally abusive, I just want out. How do I quit without getting the full wrath of this crazy man? Thank you for any and all help.",
    "title": "How to quit job without being financially blackmailed",
    "subreddit": "jobs",
    "timestamp": 1703760094,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "This is a reply to u/Kitchen-Effect-7609's comment elsewhere on r/jobs. Due to malware, etc, unable to post a reply. Comment here equated the inability if his/her small business employer's inability to compete w/ Mom & Pip's inability to compete w/ Walmart& the like for the same & breaks down why! https://www.reddit.com/r/jobs/comments/14zv2ez/comment/js1vubs/?utm\\_source=share&utm\\_medium=web2x&context=3  \n\n\nWhy were you downvoted? If your company cannot dollar for dollar compete, it just cannot dollar for dollar compete!  This is no different from Acme Corp, with a bazillion chain store locations worldwide, being able to buy 5 zillion widgets, all at once, and receiving a HUGE discount per widget, because they were able to make the widget seller or widget farmer or widget producer or widget maker the offer of a lifetime: a HUGE influx of cash from an IMMEDIATE sale! Now, Ma and Pa, who own the local Mom and Pop that everyone USED to go to before Acme Corp put a chain store location (store location) into their neighborhood, within walking distance from Ma and Pa's store....  \n\n\n  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nSee, Ma and Pa can only afford to buy 20 widgets to put onto their store shelves. No discount, therefore! They paid more for the widgets at wholesale (?), so, their selling price is going to be more when I walk into their store, and then walk out of their store and walk 1/4 a block into Acme Corp's billionth chain store location!  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nI have a finite amount of money to spend, and though I WANT to (WANT to) support my local farmer, my local Mom and Pop, when Acme Corp can sell me 1 pound of string beans at 15 cents per pound (again, due to Acme Corp having the funds on hand to purchase a multitude of string beans from string bean farmers in another country, where string bean production costs WAY less, versus Mom and Pop store's $2.15/lb, then...as a person who can ONLY afford the 15 cent per pound string beans to feed my family, I am pressed to buy what I can afford!  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nSame with wages! It sucks online, when I have a higher cost of living than another job seeker, but a company is going to purchase that other job seeker's labor, because that job seeker has a COMPLETELY different economy from my personal homeland. They may live in luxury for $5.00 an hour, even able to afford personal help staff--maids, butlers, nannies, at that price point/wage, whereas, I can't afford to live indoors at that wage, afford to feed my family, afford transportation,, clothing, or even toilet paper!  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nSo, it sucks: Economies benefit when each nation works within their own, unique, financial system. When Bob lives in a national (nation) that buys and sells almost exclusively ----no wate(wait)--  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nWhen Bob's nation or country produces things more efficiently than another nation--let's say, a particular crop grows in Bob's nation, but not in others, Bob's nation can then export this unique crop to other nations, sustainably and responsibly, in a limited capacity, that yields this a great source of wealth for Bob's nation. For instance, I live in an area with ZERO natural safari vacation habitats. SO, I will save up (pretending I'm wealthy enough in this example fto (to) have the disposable income to do this every summer) and purchase a vacation to a nation that has safari settings for sale. I will purchase a boat or airplane ticket to get there, and a lot of food, once I'm there, and also, lodging. This is GREAT for that nation! They are able to use their unique resources, to attract buyers (vacationers) to them create jobs for their people! If they do well, and there are no travel restrictions preventing them from selling their unique product/service (safari vacationing spots,), then word will get out via people who have visited, and they will develop a wonderful reputation, as a reliable and wonderful brand. Their own customers will generate new customers, and their customers' children will grow up to have their own children, and trust that reliable brand, and want to revisit it with their own children.  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nThis is good! What stinks, though, is when countries, who could EASILY produce their own cars, oil, and food, STOP doing that--killing jobs within their own nations/countries, to send their production to another country/economy, to produce things cheaper. This kills jobs. Our workers in Bob's nation, cannot live on the same (cannot live on the same) wage that workers in Joseph's nation can. This is so great for Joseph's nation--when all of the countries around the world want to buy labor (tele workers, or work from homers) from Joseph and his brethren. Not so good for Bob, and the other nations, whose workers REQUIRE more money to just EXIST--not flourish! It can be a neverending slave system, if the workers in Joseph's nation are being forced to work in these jobs as dictated by their government, at wages that don't even allow them to sustain themselves, but rather, the government in Joseph's nation makes the profit! They live richly while Joseph and his brethren are oppressed, and couldn't even afford the products that they sweatshop and slave labor in to produce!  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nI didn't mean to go on a long rant, or even get into ANY of this, but it is what it is  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nI didn't mean to create an argument that shows how many lose, when they steal jobs from their own people, to produce things cheaper in slave labor, non livable wage countries. I have a different value for producing different things in my country versus the value for producing the same things in another country.   \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nIt is BEST for my countrymen and me, if my country would produce everything that we NEED, that we are ABLE to produce! And then, for things that GOD did not give us the natural (sustainable) means to produce--like a tropical climate for growing xyz crop, THEN, we export that, and buy from other countries willing to sell to us!  When EVERYONE has ABUNDANT job opportunities within his/her economy, then, we have everyone EARNING the money, and able to sell their labor to compete (when there are multiple companies to compete for workers--then--the workers of that nation can bargain and haggle.  The companies (as you saw for yourself) that can afford the best workers, will win the workers!  If I can be a personal trainer for $30/hr versus $15/hr, I will most likely choose to sell my labor for $30/hr.  MOST... LIKELY!!!  HOWEVER, there are OTHER factors that might cause me to sell my labor for $15/hr at YOUR company, versus that corporation!  Your company may treat me like a beloved member of the family!  I may ENJOY going to work everyday, because your company not only treats ME well, but ENCOURAGES me to treat our customers well, and serve them in THEIR best interests, versus maybe at the company where I can sell my labor for twice the price, I will have abusive coworkers, abusive bosses,,deal with sexual harassment that gets covered up from never firing people (like,for instance, a government job within the USA's Department of Homeland Security, or the military, or government contractors who may get contracts to do some aspect of work FOR the military) etc!  Not casting aspersion, here, just listing possible examples!  Anyway, Iay develop h  \nstress-caused health problems, and/or even cancers based on asbestos or radiation in the workplace, because, whereas, in YOUR company, your employer may be TERRIFIED of running afoul of the law, versus the USA Government isn't afraid of being sued, they can just cover it up, or, it's an individual worker thing--not a government-wide all encompassing thing, because NO ONE gets fired, EVER within the USA's Federal Government--people just have no fear of losing their livelihood, so it begets a culture in which lawbreakers and amoral persons feed off of the pleasure they get in doing as the listeth, and never getting in trouble for it, because the person aboce them never got fired for being corrupt, but rather just hired more corrupt people.   \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nSame for chains within corporations, and non chain corporations--if you have a bad hire,,never check it, it's just going to grow and metastasize into a very HARD to kill (cure) cancer!    \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nThere is a reason why people leave high-paying lawyer jobs, and open up their own flower shop (LITERAL EXAMPLE)!  Money is IMPORTANT, but people are willing to part with a percentage of it, if they see that they can earn a living without killing themselves, or selling their souls, or searing their consciences!  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nAnyway, perhaps your company can advertise the unique perks of working THERE!  Like the job candidates who haven't the best resumes, BUT are hired anyway, and end up being some of the best fits!    \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nIn The Holy Bible's first book--Genesis--and a portion of the very beginning of The Holy Bible's second book--Exodus--you will see that the number two top dog in Egypt was not even an Egyptian, but a Jew sold into slavery!  For the VERY REASON that the Christians' and the Jews' brother, Joseph, was NOT the most likely best fit for their culture... was He the VERY thing that they NEEDED!  He had something from another culture, that they just could NOT produce--a link to GOD, open communication with The Creator and Ruler of ALL creation, who prospered THEM, through the prospering of His servant--Joseph's--hands!  They saw that \"the gods\" where WITH Joseph, and prospered the works of his hands, with their OWN eyes!    \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nThey'd seen (as did King Nebuchadnezzar with Daniel, in The Holy Bible's book of the same name (the book of Daniel), that GOD gave some of those who obeyed Him knowledge that COULD...NOT...BE known, neither discerned by the magicians, the sorcerers,  or the Chaldeans! So when these two kings--Pharaoh, king of Egypt, and again, King Nebuchadnezzar--had dreams, GOD provided them consultation and answers,,but ONLY through HIS!    \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nIt is a BLESSING and a BOON to have GOD's (obedient) children living in your nation, or working for your company, at times, when GOD CHOOSES to bless and prosper you THROUGH them!  Not that it is possibly needed, it seems to me,,in my limited vision, but there were and may STILL BE, examples of GOD hearing the prayers FOR a nation,,or FOR a \\[group of\\] people, due to just ONE... righteous...man!  Even after that man has passed on, GOD, in times PAST, has STILL said things like--because of My servant, Moses; or for the sake of My servant, Abraham; or because of My servant, King David; and so on and so forth, I have not destroyed you; or have delivered this land into your hands!  So people were blessed by the righteous men who obeyed GOD, were well-pleasing to Him--men after His own Heart, etc!  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nThat said, maybe you, or someone in your company can pray that GOD would provide you with a Joseph, or anyone perfectly fit to prosper your company!  There are MANY candidates--maybe they aren't a visibly seeming, cultural fit to or for YOUR company--like Jewish Joseph in a magic or sorcery, multi-god worshipping Egypt, but that may BE the very round peg, to flawlessly fit your square hole!  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nI speak without wisdom too often, but the historical/Biblical accounts were at least correct.  Not sure what GOD wills for your company's solution to hiring, but, while a COMPLETELY high-factor, money isn't the ONLY bargaining tool!    \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \n\\_------------------------------\\_\\_------------------------------\\_\\_  \nPerhaps there is something that your company can offer outside of the hourly wage or salary, that could lure away candidates from the higher paying jobs!",
    "title": "This is a reply to u/Kitchen-Effect-7609's comment elsewhere on r/jobs. Due to malware, etc, unable to post a reply. Comment here equated the inability if his/her small business employer's inability to compete w/ Mom & Pip's inability to compete w/ Walmart& the like for the same & breaks down why!",
    "subreddit": "jobs",
    "timestamp": 1689438688,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "\"Ghosted after X years of relationship\" Just read a post on a dating sub where a man complains that his gf of X years ghosted him. So many men in the comments that say the same happened to them. Wife moved out while he was at work, gf visited parents and fell off the face if the earth, etc.pp. All the other men in the  comments commiserating how shitty it is to end a relationship like this, how the women are cowards, etc.pp.\n\nI did that too. Moved out while he was on a business trip. Kept my new address secret. Communicated only through a lawyer. Y'all know why? Because he fucking threatened to KILL ME if I leave him.\n\nYes there are probably shitty women who just ghost their great, caring and respectful partner. More likely though that in the majority of these cases there has been some abuse going on.\n\nWomen aren't cowards. Men are dangerous.\n\n**Edit** \n\nTo all the men in the comments who took offense with the last statement: I know it's \"not all men\". But let's not pretend domestic violence is not a gendered thing. Yes, I know there are abusive women too. But where I come from, every 3 days a woman is killed by a man she has a relationship with. Recently there was a survey where 30 percent of the male respondents said it's ok to hit their female partner sometimes. And when your first reflex upon hearing this and reading all the heartbreaking stories by women in the comments is not being horrified, but becoming defensive and spouting whataboutism, you're absolutely part of the problem.",
    "title": "\"Ghosted after X years of relationship\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687624789,
    "score": 15564,
    "keyword": "man lawyer"
  },
  {
    "text": "He plead guilty! 5 years ago I pressed charges against the man who drugged and raped me. I was overdosed and nearly died. He got a really good lawyer who pushed everything back as far as possible, then Covid hit which delayed things for almost two years. He was ready to go to trial because he didn't want jail time, but once we were up next and about ready to select a jury he got cold feet and decided to negotiate. \n\nWe worked out a plea agreement which included a suspended year of jail time and a 30 year criminal order of protection. If he gets arrested for any reason he will have to serve that year of time. The order of protection bars him from a firearm license, federal employment, and shows up on the most basic of background checks. They cannot be expunged and lying about having one against you in certain situations can land you 5 years in jail.\n\nFor whatever reason he decided to bring his parents to the sentencing hearing. I had spent hundreds of hours working on my victim impact statement which detailed the grittiest details of the incident. So for a half hour his mom and dad sat there listening to how their son drugged and raped a woman, then watch him plead guilty.\n\nHe was sentenced before the weekend and served with the order of protection. It's officially over. I should be happy and proud of myself but I don't feel that way, and I don't know why. Maybe it just hasn't set in yet. Once I get the copy of all the paperwork on the mail maybe that's when it will hit me.\n\nBut no matter what I feel, HE PLEAD GUILTY. The five years was worth the wait.",
    "title": "He plead guilty!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1675019545,
    "score": 6212,
    "keyword": "man lawyer"
  },
  {
    "text": "The prosecutors of Andrew Tate leaked to the Romanian press a number of transcripts of wiretapped conversations held among the victims, the Tates and the 2 women arrested. The transcripts contain admissions of criminality, manipulation, violent threats and more corroborating victim testimony It has become the most common talking point among Tate's supporters, and even his own lawyer, to say that there is actually zero proof of any of the allegations made against the Tates. It has been widely known in Romania for a week now that this is simply not the case, since the prosecution has leaked a number of snippets from wiretapped transcripts they obtained during their investigation.\n\nThese transcripts were used, along with the victim statements, expert psychological reports of the victims and Andrew Tate's own words published to social media in public videos to convince the Judge that there is at least a reasonable suspicion that the defendants committed the crimes of human trafficking and forming an organised crime group, while the judge asked for more evidence of the rape accusation (it is notoriously difficult to prove rape, especially if said rape happened a long time ago).\n\nOne of the defence strategies Tate's lawyer used was to say that Tate was simply playing a character, or persona, in his videos so the videos shouldn't be used as evidence. However, the judge disagreed with this defence as the wiretapped transcripts obtained by prosecutors showed Tate with the same attitude and personality in private messages between himself and the victims and others.\n\nI will layout all of the transcripts that have been leaked so far along with the sources for each transcript, they have been translated from Romanian using Google translate.\n\n**TRANSCRIPT 1: Andrew Tate manipulates one of the victims into flying to Romania by promising marriage, then discusses said victim as a commodity to be used for making money.**\n\nSource: [https://spynews.ro/monden/showbiz-intern/stenogramele-incendiare-dintre-andrew-tate-si-o-victima-cum-o-vrajea-prin-metoda-loverboy-vei-fi-a-mea-pentru-totdeauna-297133.html](https://spynews.ro/monden/showbiz-intern/stenogramele-incendiare-dintre-andrew-tate-si-o-victima-cum-o-vrajea-prin-metoda-loverboy-vei-fi-a-mea-pentru-totdeauna-297133.html)\n\n**Conversation 1 (promise of marriage):**\n\nEmory (Andrew Tate): You have to understand that once you're mine, you'll be mine forever. A woman never leaves her man. I will be the last man in your life.\n\nEmory: what do we do if we fall in love and I kidnap you to bring you to Bucharest?\n\nGirl: I don't think it's kidnapping, if I want to come.\n\nEmory: first I have to see in your eyes that you will never be able to live without me. And then I can trust you to show you everything\n\nGirl: Bring a ring with you when you come 😊\n\nEmory: Can you be loving enough to be a wife? To always be by my side, wherever I go? Talk to 0 men besides me? Ride or die? 😊\n\nEmory: you have to move to Romania with me, to keep an eye on you.Emory: You're mine. Do not forget that. And act like it. We will be together soon.\n\nGirl: but can I trust you?\n\nEmory: Yes. You can.\n\nEmory: You will move to Romania with me. I plan when I get there. First, I might have to go to Prague for a few days.\n\nEmory: and we meet in Romania.\n\nEmory: and I want to know that you are committedEmory: Serious about marriage.\n\nGirl: Yes. I am serious.\n\n**Conversation 2 (discussion of victim as a commodity, PI in this context is one of the women who was arrested along with Tate):**\n\nANDREW TATE: Did you tell the new one that you make a lot of money?\n\nANDREW TATE: ask her to take pictures of you\n\nPI: yes.\n\nPI: you mean me and her in the pictures?\n\nANDREW TATE: yes\n\nPI: what kind of pictures?\n\nANDREW TATE: anything for onlyfans\n\nPI: in underwear? She won't\n\nANDREW TATE: see\n\nPI: G talked to her today and will go live with B tonight to try\n\nANDREW TATE: And with Tristan's new girl you're doing a really good job\n\nANDREW TATE: Tristan wants you to bring her back and stay there\n\nANDREW TATE: I'm taking care of B and U tomorrow, we have to be alone and find a solution to to stay\".PI:. does she know about onlyfans?\n\nTRISTAN TATE: no\n\nTRISTAN TATE: and she's studying to be a lawyer, she doesn't care\n\nTRISTAN TATE: and she never would\n\nPI:. know. She asked me to show her my TikTok and I wasn't sure.\n\n**TRANSCRIPT 2: Supports the prosecutions case that Andrew Tate is the leader of the organised criminal group and there is a hierarchy with Andrew Tate at the top**\n\nSource: [https://www.gandul.ro/actualitate/cum-le-amenintau-andrew-tristan-tate-fetele-exploatate-studioul-videochat-tunari-este-ultimul-avertisment-exclusiv-19903663](https://www.gandul.ro/actualitate/cum-le-amenintau-andrew-tristan-tate-fetele-exploatate-studioul-videochat-tunari-este-ultimul-avertisment-exclusiv-19903663)\n\n**Conversation 1:**\n\nGirl: I heard you're the one running the OnlyFans and TikTok girls business.\n\nAndrew Tate: Tristan and Georgiana are there, but I lead them\n\n**Conversation 2 (Radu Luana to one of the victims demanding money and saying that the victim is accountable to her, she is accountable to Tristan and Tristan is accountable to Andrew, the hierarchy of the criminal group is demonstrated):**\n\nRadu Luana: The money from yesterday, 3 dollars\n\nRadu Luana: Give me something, I'm foaming at the mouth\n\nRadu Luana: That at the end of the month Andrew will argue with Tristan Tate, Tristan Tate with me and I with you\n\n**Conversation 3 (Andrew tells the victim not to leave the house without one of the 3 trusted employees (Tristan, and the 2 \"angels\" arrested) following and watching her, making a clear threat despite the victim pleading that she wants to leave the house alone:**\n\nAndrew Tate: You don't go anywhere without one of the three (trusted employee nos).\n\nYoung woman: Why are you so cold to me?\n\nAndrew Tate: Don't go out alone without telling me.\n\nAndrew Tate: Mall, supermarket, nowhere from now on.\n\nYoung woman: I told you I wanted to go alone\n\nAndrew Tate: It's the last warning!\n\n**TRANSCRIPT 3: Andrew Tate admits to victim that he \"has to hide\" what he is really doing and that he does money laundering, exploiting women by using them to do illegal activities for him such as moving money and illegal items/documents, he also claims \"he would never do that\" to the victim, presumably another form of manipulation to make the victim feel \"special\" and that he \"cares\" about her:**\n\nSource: [https://www.digi24.ro/stiri/actualitate/stenograme-din-dosarul-fratilor-tate-facute-publice-cei-doi-si-ar-fi-obligat-victimele-sa-isi-tatueze-numele-lor-2207105](https://www.digi24.ro/stiri/actualitate/stenograme-din-dosarul-fratilor-tate-facute-publice-cei-doi-si-ar-fi-obligat-victimele-sa-isi-tatueze-numele-lor-2207105)\n\nAndrew Tate : You're not stupid and you can probably guess how I make so much money. I have to hide what I'm really doing.\n\nVictim : Web cam?\n\nAndrew Tate : I've been doing this for a long time with a team of girls working on video chat. The company was fake, but this is how I laundered my dirty money. Some of the girls who worked for me (...) I used them to do other things. To move money or illegal things, documents, etc. I will never do that with you.\n\n&#x200B;\n\n**TRANSCRIPT 4: Tate's \"angels\", the 2 women arrested along with Tate, make violent threats including death threats to one of the victims saying that if she does not post pornographic content to Onlyfans/Tiktok she will be \"thrown off the balcony\" by Andrew Tate.**\n\nSource: [https://www.romaniatv.net/noi-stenograme-incendiare-din-dosarul-fratilor-tate-daca-se-uita-andrew-sa-vada-daca-ai-postat-tiktokuri-nu-vei-avea-timp-nici-sa-iti-faci-bagajul-zbori-de-la-balcon-direct\\_7137791.html](https://www.romaniatv.net/noi-stenograme-incendiare-din-dosarul-fratilor-tate-daca-se-uita-andrew-sa-vada-daca-ai-postat-tiktokuri-nu-vei-avea-timp-nici-sa-iti-faci-bagajul-zbori-de-la-balcon-direct_7137791.html)\n\n&#x200B;\n\nIn these conversations R.L is the policewoman arrested alongside the Tate brothers, NG is the other woman who was Tristan Tate's personal assistant who was also arrested, and PI is the victim in question\n\n**Conversation 1:**\n\nRL: You are free tonight to sleep. Do not waste time!\n\nR. L: So that you can be rested tomorrow, Saturday.\n\nR. L: And Sunday for the weekend.\n\nNG: So clearly there is no longer the problem of recovery.\n\nPI: You mean?\n\nPI: But I didn't say I'm not going in today at all.\n\nNG: Well, how much did you have to recover so far?\n\nNG: I. Don't lie to me, because you didn't do anything today.\n\nANDREW TATE: Did you tell the new hooker that you make a lot of money?\n\n&#x200B;\n\n**Conversation 2:**\n\nR. L: You see we split on Only\n\nR. L: G. takes O.R. L: I take you.\n\nR. L: Maybe you're not listening, because I will kill you\n\nR. L: If we don't make money.\n\nNG: Punch yourself in the mouth until I arrive, because then I'll give you another 10, you incurable slacker.\n\nNG: I break you when I get there.\n\nPI: What did I do?\n\nNG: You have one hour and 10 minutes to disappear.\n\nPI: But what did I do??\n\nNG: Better said, what did you do yesterday for an hour.\n\nNG: You're 20% down, four days since you posted.\n\nR. L: I'm waiting for the money yesterday.\n\nNG: Well, if Andrew looks to see if you've posted TikToks, you won't even have time to pack, you're flying off the balcony straight away.",
    "title": "The prosecutors of Andrew Tate leaked to the Romanian press a number of transcripts of wiretapped conversations held among the victims, the Tates and the 2 women arrested. The transcripts contain admissions of criminality, manipulation, violent threats and more corroborating victim testimony",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1673398429,
    "score": 5836,
    "keyword": "man lawyer"
  },
  {
    "text": "I don't know what to title this because I am so mad. TW: SA/death of a child.\n\n\n\n**EDIT** \n\nBecause so many people are in here trying to defend this lawyer and say he's \"just doing his job\" or whatever—if you had actually read the article, you would've also read that he called NO witnesses, NO experts, and practically provided NO fucking evidence to make his case. The only fucking thing he did was villainize an innocent 13 year old CHILD who was senselessly r*ped and murdered. So fuck outta here saying that he was doing his due diligence as a defense lawyer. He fucking wasn't.\n\n**ORIGINAL POST**\n\nSo, I live in Canada and today there was a conclusion to an 8 month long murder trial of a 13 year old girl in Vancouver. I had honestly never heard about this case until I saw the headlines today. \n\nTo summarize, back in 2017, a 13 year old girl was walking alone when a 28 year old man pulled her off the path and into the bushes, violently SAed her, then strangled her to death. Not only was his DNA found inside her, but his fucking lawyers tried to insinuate THAT IT WAS FUCKING CONSENSUAL. \n\nHere's some fucking quotes from the trial: \n\n*\"Ali's lawyers, meanwhile, argued that semen inside the girl's body that matched Ali's DNA could have been the result of an earlier encounter with an “innocent explanation” and Ali isn't the person who killed her and dumped her body in the park.\"*\n\nLIKE, ARE YOU FUCKING KIDDING ME?? \n\nOh, you thought that was bad? Well get a load of this: \n\n*\"McCullough (defense lawyer) said the girl was not an “innocent,” that witnesses who called her a child instead of a teenager had been trying to play on the juror's emotions, and it wasn't “outlandish” to suggest the girl may have found Ali attractive.\"*\n\nI have so many fucking thoughts on this statement alone. First things first, I understand the job of a defense lawyer is to make sure the right person is being convicted for the crime. But you can fucking do this without saying disgusting and vile shit like this. \n\nSecondly, thirteen IS considered a child in my eyes. The fact that this lawyer is trying to suggest otherwise means that he should be looked into more and probably deserves to be on a registry. \n\nAnyways, sorry for the long and angry rant. I am just so goddamn appalled and enraged by all of this. I felt sick to my stomach reading those quotes and think that lawyer deserves to be reprimanded for his vile tactics in court. \n\nIf anyone wants to read more about the trial:\nhttps://bc.ctvnews.ca/inside-ibrahim-ali-s-murder-trial-threats-hallucinations-a-dead-witness-and-delays-1.6679163",
    "title": "I don't know what to title this because I am so mad.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1702151602,
    "score": 1427,
    "keyword": "man lawyer"
  },
  {
    "text": "My soon to be ex-husband acts like he owns me because we have a child together and no one is taking me seriously, not even the police CW: stalking behavior\n\nDisclaimer: I am ***not*** asking for relationship advice because there is no relationship here, and it's against the sub rules. I'm just ranting about the unfortunately common experience of being a woman and not being taken seriously regarding my own safety.\n\n\n\nI started dating this dude when I was freshly 18 and he was 21 turning 22. I got knocked up. My Catholic family shamed me a ton for it so when he suggested eloping, I was on board. We got married and then I found out it was because his mother, a very strict Christian, convinced him to do it. We worked it out, moved on. MIL was heavily interfering and in October of last year I decided I was done.I moved out and attended a few sessions of counseling with him and then I started the divorce proceedings because he didn't seem like he wanted to cut the umbilical cord still attaching him and his mother.\n\nOur divorce is moving at a snails pace because of him being late with forms, not attending meetings etc. During the time he has bought himself by being an idiot, he's been stalking me. Before I filed for divorce in late November, I hardly saw him out in public by chance. Suddenly when divorce is filed, I'm seeing him **everywhere**. Stores, work, near my home and even outside my doctor's office. In January, I confronted him because I saw his car drive by my house twice in an hour, his response? \"I'm allowed to keep an eye on my son's mom\". He's even paid for my shopping when he 'runs into' me at the store and he'll tell the cashier that I'm his wife. I was at a cafe in their dedicated study space trying to get some college work done and I had bought a coffee that I wasn't done with, when the barista brings me another coffee and says 'your husband bought it for you'. I look around, he's not in the store. He's sitting in his car outside and he has the audacity to wave at me. One day, I was out getting coffee with a male friend, when I got home, my ex was outside in his car waiting for me and he kept asking me who my friend was. He doesn't even deny that he's following me.\n\nI've been documenting whenever I run into him by taking pictures and he knows and doesn't care. I try my best to be discreet but the few times he caught me, he **posed** for the photo. I told my family and friends and they think it's alright because I haven't been threatened. My own father who paid for my divorce lawyer actually told me to sympathize with my ex because 'he's losing his family'. My mom thinks it's sweet that he pays for my shopping or sends things to my house. I was celebrating my 20th birthday last weekend with some friends at home and guess who shows up? My ex, with a bouquet of red roses and a necklace and he shows me a tattoo he got of our son's name and he tries to convince me to get a matching on. He also says that he plans to get **my** name tattooed.\n\nHis brother who's the only decent member of his family convinces me to call the cops. An officer comes to my home on Monday, and I get told off like a child. He says things like 'you should be grateful he cares so much' and 'you're much better off than some other ladies I've spoken to'. He ends the meeting by saying that he won't punish a man for 'missing his family'. I live in a small conservative town so I'm not surprised but I'm still upset. I can't move because of my college and I'm terrified.\n\nI know he's not being threatening and I'm much luckier than some other women, but he could escalate. He's completely different from the man I fell in love with and I'm terrified and no one is taking me seriously. Everyone keeps calling me his wife and referring to me and our baby as 'his family' which yes my son is, but I'm not anymore. It seems the days of women being the property of their husbands have never left us. Why are we only listened to when we've been attacked? If the police took me seriously enough even to have a conversation with him, they could be preventing a much worse crime from taking place. I don't see why I should have to become a victim before I'm listened to and it's so frustrating. Has anyone else had an experience like this? I don't want to be alone in this.",
    "title": "My soon to be ex-husband acts like he owns me because we have a child together and no one is taking me seriously, not even the police",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678322501,
    "score": 897,
    "keyword": "man lawyer"
  },
  {
    "text": "Bad Divorce Advice I filed for divorce from my emotionally abusive high powered surgeon husband a few months ago.  I’m a SAHM to a toddler who put her life on hold five years ago to move all over the country with him to finish his training, then later to raise our baby.  In retrospect he’d been emotionally terrorizing me for a while, I often would joke that “I can’t say no to him!” But seriously I couldn’t say no to him because he had me so trained and afraid.\n\nSince filing for divorce, it’s been amicable between us - I think partly on the advice of his lawyer, and partly so he can act like I’m the crazy one - but difficult to continue to SAHM while looking for a job with this giant gap, on a shoestring budget so it doesn’t look like I’m wastefully spending, plus kid started a Mother’s Day out program two days a week and we’ve both been sick on and off the entire time.  Spent Thanksgiving quarantining with Covid.  Not the most fun but honestly I feel emotionally and even physically so much better away from him.  I never realized how much he undermined me, all the constant criticism, denial, nitpicking.  I’m tired now but man I was SO tired before, doing everything I’m doing now plus walking on eggshells.  All that to say: I’m actually doing pretty fucking great.  Most people who haven’t seen me in a while comment how good I look, how happy, how I’m more like my old self.  \n\nMost people.\n\nExcept for an old friend of mine - divorced a couple of times - who recently told me over lunch to reconcile if at all possible.  You think it’s hard now, she said, it only gets harder.  Worse.  More awful.  Run from singledom.  She wishes she was still married to her first husband - despite being in a serious relationship for the past year and a half!  Like they live together and are building a house together!  To say I was shocked is an understatement.  She doesn’t have kids, so I don’t know that she realizes how busy I am and how low a priority dating or like, ever seeing a man again even(!!) is for me.  Also I’m doing a lot of therapy to make myself as well as can be, for myself and my kid.  To unlearn/unhear the abuse.  But still, it was really jarring to have someone basically say, turn back, you’re fucking up, when the feedback I’ve gotten from my therapist, my friends, my family has all been, you’re doing great, this is hard and you’re killing it, you’re stronger than you know.\n\nI’m seriously considering ending our friendship over this.  I know it was probably more about her own issues, but it felt so draining and terrible to spend some of my precious free time with her, hearing that.  And yet…. The scared part of me, the part used to listening to him, wonders if I am making a mistake.",
    "title": "Bad Divorce Advice",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1702519605,
    "score": 657,
    "keyword": "man lawyer"
  },
  {
    "text": "My bf just told me my feelings are less important to him than other peoples’ feelings **EDIT:** thank you for all of the support and advice. It means a lot to me. I am so overwhelmed and haven’t been able to stop crying; it’s hard to think but seems like I really need to make a plan on how to get out of this situation. Thank you for the kindness and support to a complete stranger. Thank you for caring. \n\nI just can’t fucking do this anymore. This is the icing on the cake. I’m not perfect, I’m not always emotionally stable, and I have yelled and resorted to name calling before. I don’t expect anyone to be perfect in a relationship, and I know these things will happen occasionally. But I can’t tolerate being put down almost every single day of my life anymore. I don’t know if I’ll delete this post and I’m very frazzled right now so I’m sorry. \n\nDuring the time we’ve been together, he’s taken money meant to pay bills and lied about it. We shared a bank account for the longest time because he couldn’t keep his in the positives until I demanded he get his own because he kept using my credit card without asking and then accusing me of being controlling when I would get mad about it. (He has paid back some of the debt though) I’ve taken out two loans on cars for him because of bad credit and he’s wrecked both of them. I paid for half of the first one and never even used the car. He got arrested for stealing from his job and using the money to buy cocaine; I didn’t find out until I was freaking out one day because he never came home from work and wouldn’t answer his phone. He was in jail and I had to bail him out. My dad paid for a lawyer for him. My grandma helped pay the restitution and court fees. He continually lied to me about the status of his probation and I had to find out on my own that he failed to meet the plea requirements to get the charge dropped after probation. Which was the whole point of the lawyer. This is only a small fraction of the things my family and I have helped him with. \n\nI’ve watched him punch the windshield of the car and break it while he was driving with me. He’s called me pathetic and disgusting. I once demanded to be let out of the car when we were a half a mile from home because he was scaring me, and when I got home he had locked all of the doors to the house. I had to text him and ask “why did you lock me out? Why would you do that?” and he came to open the door without saying a word to me. Later he apologized and said he felt like he “wanted me to need him for something.”\n\nHe’s told me he’s unable to have empathy for me while I’m crying. He’s insulted every interest I have; “You’re so boring; all you do is sit outside and draw all day,” “All you do is make stuff in Blender,” “The only thing you care about is birdwatching.” Just anything I’m passionate about. Whats ironic is he’s taken an interest in some of these things too at some point. He was the first one to buy binoculars and get excited about birdwatching, only to tell me it’s boring later. One time during an argument, he yelled, “You can’t even properly train your own dog.” We weren’t talking about my dog. He’s apologized for insulting my interests more recently, but has continued to call me boring and not fun as recently as a few days ago. He complains that I never have anything to say. The other day, I commented, “If someone was constantly telling you how boring and not fun you are, would it make you want to be open with them and talk to them?” He admitted that no, it probably wouldn’t. \n\nIt occurred to me that he hasn’t treated the other women that he’s had sex with well. I think I realize now that he just doesn’t treat women well, and hides it behind a mask of supporting women and feminism. I snapped today and told him that maybe he’s just a shitty person who doesn’t want to change and that his next relationship won’t be any different. When he says what his “ideal partner” would be, it is literally just a list of traits I don’t have.\n\nThis is not even half of the shit I’ve been dealing with but I just needed to vent and I don’t want to keep being completely broken down as a person anymore. I keep making excuses for him and noting that he isn’t possessive or controlling, doesn’t insult my appearance, etc but I realize it doesn’t matter and it doesn’t make any of this other stuff not okay. God I’m so fucking tired. I don’t really know what to do next we still need to live together for logistical reasons. We do have separate rooms. I have dealt with gaslighting throughout this entire fucking relationship and I’ve given so much to this man. I’m just so tired and confused. I probably shouldn’t have snapped today; I probably shouldn’t have called him a shitty person but I’m just so fucking tired of being treated this way. I’m terrified to express any sort of upset for fear of his reaction. It’s getting to the point where I can feel the adrenaline flowing and my heart speeding up when he gets home or comes into the room.",
    "title": "My bf just told me my feelings are less important to him than other peoples’ feelings",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689016940,
    "score": 571,
    "keyword": "man lawyer"
  },
  {
    "text": "Is it weird that I want a baby pre-nup situation before getting married? Before I begin - let me preface with this. \n\nThis is not a reflection of my fiancee or our relationship. This is not me not trusting him, or picking the wrong guy. I think it's madness that we sign ourselves into marriage, destroy our bodies for children, and if our husband leaves - we're left holding the kids with very few prospects for ourselves and very little by way of support. Why is this not commonplace?\n\n&#x200B;\n\n**My biggest fear in life is being a poor single mother.** \n\nI know, like every other single-mother-wonder-woman out there, I would do what needs to be done. Lay down my life, work extra shifts, get sh\\*t done. However, I don't want to and don't feel like I should have to - if it were to come to that. \n\nI'm getting married next year and realized I don't fear divorce. Yes, it would be hard, heartbreaking, sad, etc but I would get through it. It's the kids. Divorce with kids would break me. \n\nI have ADHD, I can barely hold down a job, I'm the black sheep of my family who's mother is the black sheep of her and her husband's family. All this to say - I have no support.\n\nAs a family unit - yes, all the kids, let's go!! but alone? not so much. \n\nSo, for the last while I have been pondering how to navigate around this... And basically, if I have kids and get divorced, I want a lump sum on divorce and some form of maintenance going forward. \n\nToday when researching if that is something that can actually be done in my country, I was pleasantly surprised with the amount of praise I received from women. I also got a lot of misogynistic \"gold digger\" bull from the usual suspects. \n\nThe pseudo-intellectuals started shouting \"trauma\", \"childhood\", \"and anxiety\" - which of course who TF doesn't have trauma and/or anxiety? HAVE YOU SEEN THE WORLD????? But on top of that is running head first into a statistically worse situation (marriage with children) with no safety net or security other than the promise of a man to love you forever not the crazy scenario? \n\n&#x200B;\n\nMy brain is a bag of knots right now. I'm 33, my biological clock is ticking, the world at large is a mess, capitalism, and I'm newly diagnosed ADHD - so literally see the world differently. \n\n&#x200B;\n\nI have no f\\*cking clue how to proceed but know that I must proceed because life moves forward one way or another and no action is a decision in itself. So, can some of you wonderfully intelligent people advise? Am I right? Am I crazy? Is this even a thing? And what kind of lawyer would I need to speak to with this?",
    "title": "Is it weird that I want a baby pre-nup situation before getting married?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1698930301,
    "score": 412,
    "keyword": "man lawyer"
  },
  {
    "text": "A civil servant in South Korea, who secretly took pictures of a female colleague, gets caught and laments \"What a difficult world to live in as a man!\" News article:\n\n[https://www.chosun.com/national/national\\_general/2023/01/13/JKJMZWEP5RFU5GZWZYJXGE5XDQ/](https://www.chosun.com/national/national_general/2023/01/13/JKJMZWEP5RFU5GZWZYJXGE5XDQ/)\n\n&#x200B;\n\n>A civil servant in Korea made a post on Blind, an anonymous office worker forum app, complaining about being charged after getting caught while secretly taking pictures of a female colleague.  \n>  \n>You can sign up for Blind only by verifying your workplace with your company email, and your nickname and workplace are displayed in your posts/comments.  \n>  \n>**The civil servant said in his post:**  \n>  \n>**\"I got caught, secretly taking pictures of a woman I like at my workplace. Not 'porny' pictures, but just pictures of her at work. But she's pressed charges against me. Is this something to be charged for? I didn't even distribute the pictures on the internet, but just kept them for myself, but I'm now perceived as a pervert. Is what I did sexual harassment?**  \n>  \n>**Now people look at me funny at work. If I'm proven not guilty, can I press charges against her for false accusation? Lawyers, I need advice.\"**\n\n&#x200B;\n\n>He faced backlash on the forum but he didn't care and mocked people who criticized him.  \n>  \n>A user said \"It's disgusting to think a coworker is secretly taking pictures of me at work.\"  \n>  \n>And he replied \"I wouldn't take pictures of someone like you. Go make me some coffee, Miss Kim.\"  \n>  \n>**The legal advice he got is \"Secretly filming/taking pictures of someone (without permission or against their will) is a crime. If the woman feels violated, then it's sexual harassment. Since you're a public servant, you might face some disciplinary actions.\"**  \n>  \n>**He later posted \"I'll just give her 500,000 won (about $500) and ask her to settle out of court. What a difficult world to live in as a man!\"**",
    "title": "A civil servant in South Korea, who secretly took pictures of a female colleague, gets caught and laments \"What a difficult world to live in as a man!\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1673740738,
    "score": 361,
    "keyword": "man lawyer"
  },
  {
    "text": "A cop told my friend not to report sexual assault TW sexual assault. \nMy friend had been married for 5+ years. They have 2kids together. He’s always been pretty shitty imo but she’s finally done taking care of a man child and started separating. Moved into her own bedroom next to the kids room. \n\nHe snuck into room the other night while she was sleeping and sexually assaulted her.  He stopped when she woke up and said stop, but that’s irrelevant. Because she was already living in another room that she asked him not to enter. No consent! She told me the next morning what happened and she just mentioned it like you would mention that you broke a glass or something minor. She didn’t want to report it because she didn’t want to traumatize the kids. Many talks and an emergency call to her therapist convinced her to call and file a report of what happened. She ended up kicking him out of the house that next morning so he was gone. But when the police came after he’d left. The officer did clarify that what happened was considered a violent crime and sexual assault. Then he proceeded to convince her that she SHOULD NOT REPORT HIM because it “could ruin his life”. \n\nThis “officer of the law” stood in this woman’s home, looked her in the eye, and said this felony isn’t worth ruining this man’s life over. I’m fucking sick. She said he was older 60+ year old cop. He probably has a wife, kids (maybe daughters), nieces, sisters whatever women in his life and he told her not to say anything because her “husband” may never be able to get a good job again. ….. what about her life?! What about what he’s already fucking ruined?! I’m so mad. It’s all I’ve been thinking about. She’s got a lawyer whos got her thinking more clearly. but I’m so fucking pissed. She’s got resources. She’s going to report him. I drove down and changed her locks and garage remotes and installed window locks. This absolutely will be handled. But there’s been several other people (women and men) and who have made her feel dismissed or like she’s somehow the one who’s fucking her soon to be ex over!I really just cannot fucking wrap my head around any of it. This really is why women (or anyone) don’t report. They probably started the process then felt forced to give up.",
    "title": "A cop told my friend not to report sexual assault",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1681935119,
    "score": 312,
    "keyword": "man lawyer"
  },
  {
    "text": "My friends are getting divorced and I’m having a really tough time dealing with it. This may come across as rambling, and I know it’s too long, I just have BIG feelings right now. \n\nMy (32f) husband (35m) has had this best friend “Robbie” (36m) since they met in college and became roommates. They’re basically brothers, I consider him family. Robbie had been with “Lindsey” (36f) since just before I met my husband. At that time they had just moved away to a different state.\n\nDespite the distance, we all built a really close friendship through visits and regular communication. I became good friends with Lindsey, though obviously not quite like the relationship and history my husband had with Robbie. Two and a half years ago, Robbie and Lindsey got engaged. Then got pregnant a few months after that (technically a “whoops” but they weren’t exactly taking any precautions to prevent it) and had their son in January 2022 before their wedding in May 2022. My husband was the best man, I ended up the stand-in maid of honor when Lindsey’s sister caught Covid just days before the wedding (I was already a bridesmaid). \n\nAll of the backstory is to really emphasize how I feel about this couple (and their son). I love them. They’re my family. I would do anything for them. They had plans to move back to our city as soon as the housing market was better. We would all talk and laugh about all the trips we wanted to take together in the future. We even booked a new years cruise all 5 of us for this December. In my maid of honor improvised speech, I rambled about how I could see carpools and backyard birthday parties and family dinners in our future with them. Lindsey’s mom cried. It was such a happy day. \n\nLast week, my husband drops the bomb: Robbie is divorcing Lindsey. First question out of my mouth was of course WHY?!?! What happened?? The only explanation I’ve received so far is “he just doesn’t want to be married to her anymore.” \n\nIt’s been one year of marriage. They have a baby. She had to quit her job to take care of their son. He purchased their home before they were married so it’s technically his. He’s keeping the house, she has to move out with the baby (minus I guess when or if he wants any kind of shared custody). Lindsey and I have been in limited contact because her lawyers have told her she cannot discuss certain aspects of what’s happening (I don’t know why yet, she told me after papers are signed she can tell me ‘everything’) but she has shared with me that she’s accepted a new job, she’s found an apartment for herself and her son, and she’s just as surprised as the rest of us. I know with 100% certainty she is faithful and has always only had eyes for Robbie. Both she and I have serious concerns about his mental health right now, though my husband does not. \n\nI asked my husband if he was worried that not even he saw this coming. Robbie and my husband talk every single day via text (usually about unimportant stuff like gym routines or a new video game or a picture of food, not really deep and meaningful). Yet he didn’t see it coming at all. No prior mention of any issue with Lindsey. Not even a *hint* that anything was amiss. And then…. this. \n\nI feel dramatic saying that I’m devastated. But I am. I feel like my family is being torn apart. I’m finding myself thinking very negative things about Robbie, blaming him for blowing everything up without even trying to work it out, no attempt at couples’ therapy, hurting my friend Lindsey, his son never getting to experience growing up with his mom and dad living together, generally destroying this incredible thing the four (five including baby) of us had. No more backyard birthday parties, no more group vacations, no more late nights playing board games and cards and laughing till our sides hurt. No more adventures. At least not with them. \n\nRobbie was going to still go on the cruise with my husband and I but that felt weird. I knew at any given moment either myself or Robbie was going to be the third wheel. I felt like I would be betraying Lindsey by going. Today I finally reached out to Robbie to ask if we could cancel and thankfully he agreed and we’re far enough out that everyone will get a 100% refund. But I’m still feeling selfishly sad and mad that we have to cancel. I was so excited. Not for the cruise, but to have a whole 6 days to chill and party and eat and celebrate with our best friends and their son. \n\nI don’t really have a question. And if nobody reads this, I think it was still cathartic to write it all out. My feelings are just so scrambled. I feel sad and angry, surprised, helpless, deceived, protective of Lindsey, but also guilty for feeling any of these feelings when I know Lindsey’s life just got blown up with the snap of a finger and the swipe of a pen. Robbie took away his and Lindsey’s future together, but he also took away our future with them. He’s changed how I will look at him forever. I thought I knew him well enough but he feels like a total stranger to me now. His entire demeanor about the whole situation is weirdly aloof, like he’s not completely blowing his life up. The thought of having to spend time with him and some new girlfriend in the future makes me really mad. I feel like I will lose Lindsey in this divorce before we ever had a real opportunity to build a friendship independent of our husbands’. \n\nTL/DR: husband’s best friend is divorcing his wife and I’m devastated that this has blown up the friendship the four of us had together.",
    "title": "My friends are getting divorced and I’m having a really tough time dealing with it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1692993306,
    "score": 302,
    "keyword": "man lawyer"
  },
  {
    "text": "Police are corrupt and defend violent rich white men. I don’t feel safe. I’ve been threatened to not tell this story but I’m hoping I can be vague.\n\n**The event:**\nAbout a year ago, I was harassed and threatened by a rich white man while I was alone outside of my office. I think his goal was either to intimidate me from doing my job or to physically harm me. He screamed in my face for fulfilling my job duties, which are required by law. I was scared so I asked him to back away while I go inside to call the police. He got more violent and told me I was threatening him. He falsely imprisoned me / restrained me in front of my office and wouldn’t let me inside to call for help. He kept coming closer to me and I was afraid of an assault. I told him I didn’t feel safe and he was being unprofessional.\n\nOnce I made it inside and asked him to stay outside, he barged in. I was too afraid to turn my back to him to get my phone and call the police. I thought he would physically harm me if I did. He said things like, “Isn’t there a man I can speak to?” The answer was no because I’m the manager. And he couldn’t answer my question of “what does that have to do with anything?” He eventually left. \n\n**Aftermath and police corruption:**\nI was shaking and called the police. I told them I felt like I was in danger. The police assured me I would be fine, and did not care that I was illegally restrained. My employer sent him a letter saying it was unacceptable. The man’s lawyer sent us a letter back denying the occurrence and said if I talk about this, I’d be sued for defamation.\n\nI FOILed for the police report so I could start a paper trail. The police report I received did not contain my complaints or fear of my safety. It favored the man that harassed me and effectively swept the whole event under the rug. All it said was that he visited me and we had a discussion. Nothing about false imprisonment or harassment. My employer and I complained to the police. The police investigated after reviewing their body cam footage of me reporting I didn’t feel safe, and apologized. They told us that the man has an insider, and got the police report changed to cover it up. I don’t know if it was a bribe but the police told us this. \n\nBecause of this and lack of documentation of criminal activity, I am not eligible to obtain an order of protection. The police were unable to update the police report due to policy. Funny it can be changed for corruption but not for a mistake. \n\n\n**My question to you:**\nAll in all, how can we, as women, ever feel safe in a word like this with police corruption defending wealthy aggressors? Why can and do they get away with this? Can I trust if I’m assaulted that I’ll be protected by local police? Has anyone had something similar happen to them? It feels so isolating.",
    "title": "Police are corrupt and defend violent rich white men. I don’t feel safe.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1673541070,
    "score": 244,
    "keyword": "man lawyer"
  },
  {
    "text": "Promising Young Woman My husband and I just watched this movie. How did I miss this when it came out in 2020. I wonder if it was affected by the pandemic. Because I had no clue what this movie was. But wow. It is such an impactful film. It does such a great job at showing the affects and effects of sexual assault on women and those who love them. As well as how non affected and undisturbed the perpetrators are. The system that protects these men (both systemically: dean, lawyers, etc, and socially: peers, other women, bystanders witnessing an assault or seeing a vulnerable woman is a dangerous situation and turning a blind eye etc). The victim blaming. It so masterfully captures men who view themselves as “good guys” and “gentlemen” but are nothing more than rapist. It so well visually (the notebook with marks and names) and narratively (she goes out every weekend) illustrates how rampant the problem is. It makes it clear it isn’t a few bad apples. It’s the entire huge apple barrel or the whole apple field, if you will!  This movie is so well acted and structured. There is so much to discuss within it. The scene of her getting catcalled and then their reaction to her reaction to them. There is just so much there  within a 30 sec scene. Have you seen this movie? Were you just as interested and affected as I and dh were? It’s available on Amazon Prime if anyone would like to check it out (but obviously TW it is about SA, misogyny, and sexism so watch only if you’re ready). I tried not to be too explicit and give away too many details, I hope, but I was very impressed with how the movie dealt with these very serious things (especially for someone like my husband who as a man just doesn’t have our lived experience and as a truly good man really couldn’t understand some of it. We legit had a conversation about a lot of this as he’d ensure I got home safe and even tuck me in a blanket and let me sleep if I was black out drunk—neither of us drink so it’s totally hypothetical—and is so removed from the idea of assaulting someone who is incapacitated! Ie basic human decency. It also flowed into me showing him the tea/consent video which he somehow never saw before). \nNecessary disclaimer: like all fictional movies there is obviously a plot and narrative drive the movie needs and some things are debatable as to the main character’s morality or ethical degree of her choices etc. I wasn’t focusing on that as much as the movie’s dealing and basically explaining of a lot of the stuff this sub talks about a lot and a lot of incel type/not all men types seem to just not understand or are determined to be blind to. I’d love to hear what you thought if you saw the movie. I had just recently (a few days previously) watched the same actress in She Said (also on Prime) and was so struck/pleased with her seeming desire to do “feminist” content and being happy she did and did such a good job in both.",
    "title": "Promising Young Woman",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687893636,
    "score": 95,
    "keyword": "man lawyer"
  },
  {
    "text": "Talk some sense into me..I still like this guy that I know is going to do nothing but waste my time. I am grown, in my late 30s. I was ambitious in my 20s, becoming a lawyer at 24. So I did not really date until my late 20s. I was a late bloomer but learned a lot about men through my 30s. I dated all kinds of men - doctors, lawyers, a self made millionaire, and even an actor. They all had real issues, but so did I. After my last relationship ended 3 years ago, I put in some real work to figure out why I was dating the same “type” - I had commitment issues.\n\nI worked through my self esteem issues and feel more clear headed and confident than ever. But I also find the dating pool is smaller- due to my age but also due to my ability to see red flags off the bat. I actually get more male attention than ever before, but most are not up to par.\n\nLast year I met a guy, Joe, in my hobby. I thought he was the shy/dorky type. I could tell he liked me and we became friendly. Lately, I’ve been feeling him a bit and put out feelers. So he has been flirting and we have been talking more. We share mutual friends.\n\nWell, last week another girl in our hobby group told me she dated Joe a few years ago and said he “traumatized” her because he treated her terribly and gas lit her. Someone else also told me he was posted in this FB group and multiple women in our area said he would chat them up and try to talk them into coming to his home (as a first date/meeting!) despite stating on his profile that he wanted a relationship. The women said he negged them, would act belligerent, and obviously had no interest in them beyond hooking up.\n\nThis was all shocking to learn bc Joe puts on this completely different front with me, but I know charming and respectful men can have a different side to them. He acts so sweet and kind IRL, or at least with his friends and me.\n\nSo now when he talks to me, I am conflicted. My brain says stay away and I can start to pick up on his subtle manipulation. For example, he has been around me talking to my friends and heard me talking about growth and getting older. So I notice he started talking about his own growth and maturity in my presence, trying to find ways to bring it up. He also will wait around when he knows we will cross paths. \n\nBUT for some reason, there is this biological force in me that still wants him. It’s crazy bc I KNOW I will regret it. I know the evidence all shows he is an f-boi who will waste my time. I want to focus on better men but it’s so childish of me to be focused on this no good man. \n\nHow do I snap out of it? I see him like 3-4 times a week bc of our hobby (fitness related).\n\nETA: Thank you all for your feedback! You are all kind and honest, and I appreciate you all taking the time to give me a talking to :)",
    "title": "Talk some sense into me..I still like this guy that I know is going to do nothing but waste my time.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689694866,
    "score": 67,
    "keyword": "man lawyer"
  },
  {
    "text": "A story of divorce My ex and I divorced almost exactly a year ago. We had been separated for over a year before that though.\n\n\nWe split because he was jealous of my friendships and demanded I stop communicating with my friends, with one in particular he believed I was having an affair with.\n\n\nAfter the initial blow up, I needed time to decide if I wanted to make the split permanent or work on our relationship. After 2 weeks of him love bombing me and telling me to think back to when things were good between us, I decided I had to think back too far for good times and that the weeks alone were relaxing without him, not depressing. \n\n\nAt first he accepted my decision and we tried to make our split amicable but it quickly went sideways. We both moved out of our home to try and speed up some basic improvements we wanted to make to sell the home easier. He took the dogs, which breaks my heart to this day but I just couldn't afford to keep them both (plus he wanted half of their costs in order for me to be able to see them in a park for 15-30 mins once a week)\n\n\nAfter moving out things quickly went south. He changed the locks so only he had a key. He refused to give me a set and so if I wanted to go in and work on the place, it had to be on his terms and time line. He was unhappy with any work I did do. He took out the air conditioning unit so I was working in mid summer heat, pulling weeds in the yard, giving myself heatstroke with no respite from the high temps. Then he refused to leave the keys for me anymore. Said he and his buddy would do it all themselves.\n\n\nWhen it came time to sign the documents to sell, I got to see the house for the first time in months. He had gone overboard doing work on the place that I had never agreed to and that provided no additional value to the home like staining the deck and putting up new stairs outside. I steamed and stewed but didn't communicate with him as per his wishes.\n\n\nThen it came time to divorce (where we lived you had to be separated for a year before filing unless you could prove cruelty or infidelity - which he did ask me to lie about to the court in order to speed up the process). After dividing the proceeds of the sale of our home, calculating things like the cost of the car that was in our names but only he drove, splitting assets, him trying to go after my inheritance from my grandfather and being put in his place, him and trying to claim I had a pension when I didn't and me letting him keep his own pensions, him holding the entirety of our savings and me having to beg for some of it to be able to pay my rent before the inheritance cleared, it finally came down to the costs of the repairs. Now his friend did odd jobs on the side and my ex considered himself fairly handy. So when I got an itemised list of all the costs in an obviously self typed excel document as an \"itemised invoice\" with no actual receipts I became immediately suspicious. He was also trying to charge me for cleaning that I was going to do until he refused to allow me access to the home.\n\n\nInitially the cost he provided was 8000. Which my lawyer asked for clarification on being that the itemised list was less than 2000. What we then received was a VERY clearly copy pasted Microsoft word invoice for the 2k materials plus 4k for labour with the note that my ex had purchased some of the items himself and would just eat the extra cost. Clearly trying to get me to just agree quickly to the now lower cost. The problem is that I'm an admin for a living, I know what the office templates look like and what legally needs to appear on an invoice for it to be valid. So I went back to my lawyer to ask for proof of payment and since her spidey sense was also on full tingle, she already had the email ready to go.\n\n\nWell turns out my ex had \"paid the contractor mostly in cash\" and couldn't provide receipts but did send over his bank statement to prove he had withdrawn some cash (that didn't match with the amounts listed in the invoice). I'm sure he thought he was smart, but after being with someone for 15 years you should know how they think a lot of the time. I also knew that my ex was renting a house from this same contractor friend. Now that I had his bank statement, nowhere did I see a rent payment but funnily enough I noted that the amount that wasn't paid cash and was transferred directly would be about what someone might pay for a deposit and first months rent. He was trying to get me to pay for his new place by disguising it as a renovation cost!\n\n\nWell after my lawyer pointed this out and asked for documentation of his rent and deposit he decided to call/text me for the first time in a year. What would it take for me to sign. As much as I wanted to be vindictive and retaliate, I didn't, I was the bigger person and agreed that if he signed over halfway between what each of our lawyers agreed was the appropriate amount, I would sign and he'd never have to talk to me again. He agreed and things progressed smoothly after that.\n\n\nThat was until I decided to move back to my home country. See I had moved continents to be with him and after being alone in the city I'd lived in for a decade, I decided that I needed familial support. So I handed in my notice and told everyone that I was heading home. I sent the ex a two line email stating that I was leaving and he'd never have to worry about bumping into me ever again as I'd already booked movers and a flight.\n\n\nNow remember that guy friend from the start who my ex believed I was having an affair with? The person he'd had no contact with for almost 2 years at this point. Well he decided to track her down at the school she worked at and called her office to tell her about her husband's supposed affair... To this day I don't know if it was about him needing to regain control, me leaving permanently or something else but luckily this wonderful lady was fully aware of my ex's bullshit and I got to send him a follow up email stating that if he contacted her again, she would be going to the police.\n\n\nNow why am I telling you this story? Well today I redownloaded the kindle app on my phone and had to start by deleting the dozens of porn books he had downloaded to my account while we were together. It made me morbidly curious and so I checked his reddit account. Worst decision ever. Apparently since we split he's been fully indulging in fantasies I had no idea he was into and one of his posts made me throw up in my mouth (no exaggeration). It made me wonder if I really ever knew who he was or if our split just made him stop caring about hiding it. \n\n\nI loved this man for over a decade and now, all that remains are a few pictures of me and my family on our wedding day. It got better, it got worse and then it got way better. Now I have my family close by, my nieces and nephews are amazing kids and I get to be the cool auntie, my friends from before I left have welcomed me back with open arms and I've found a wonderful man who I'm enjoying getting to know and love. My only regret is having to leave the dogs and I console myself that the international move would've been stressful and scary for them if I had kept them.\n\n\nLife moves on, things change, your rock bottom will not last forever and your highs should be celebrated when they happen.",
    "title": "A story of divorce",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1694617450,
    "score": 48,
    "keyword": "man lawyer"
  },
  {
    "text": "Putting in effort for patients who aren't fully invested in their own well-being or don't respect my time I thought I could do it, you guys, but it's kind of wearing me down. Recently got a string of frustrating patient encounters. I'm an outpatient psychiatrist (2 years out of residency) and I do a mix of medication management and therapy. \n\nI feel ashamed about it because I feel I shouldn't let these things bother me, but it's been tough. I'm pretty worried I might be getting burned out because of these things and that makes me feel resentful because I have a full panel of other patients. \n\nI try to set boundaries but each time I'm putting in effort and thought into it because I want to be professional and healing and this is extra draining. It'd be easier in the moment if I can just say what I think without all the empathy and the compassion but I also know it's not helpful and obviously unprofessional. \n\nI think maybe I feel resentful for all the effort I put into patients who aren't fully invested in their own well-being or don't respect my time. \n\nExamples:\n\n1. A young woman who decided she wanted to go \"natural\" and stop her mood stabilizer, but then later emails me and asks about getting a prescription for Adderall because she took one of her boyfriend's and felt better. And when I tell her we need to meet and discuss, she says, \"why? We just met. What else do you need to know?\"\n\n2. A young tech guy who literally told me \"I haven't had vacation in like 6 months and it's really hard for me to ask for it because I'm so junior on the team. Can I get a medical leave? I've called out of work and I feel less anxious when I do that.\" We ended up negotiating starting a medication and he'll consider therapy while he gets on leave but this also makes me feel frustrated because on the one hand I feel I should meet patients where they are and I do believe this will net help him, but on the other hand I feel my goodwill is being taken advantage of.\n\n3. An elderly guy who keeps making sexist comments and downplays his drug use. He is a recent transfer from a colleague moving away and he's only on Vyvanse (low dose). I feel maybe it's worth the not ideal stimulant use to work on the therapeutic rapport and explore his substance use without alienating him now, but I also feel he's not that invested in getting better and I don't feel good about this.\n\n4. A young man (very wealthy) who recently got into a fight with a server because they had a bad attitude. This led to verbal confrontations and ultimately a physical fight. The one that made first physical contact, according to patient, is the server; police were called. This patient expresses a lot of frustration over being disrespected, and uses his usual coping mechanisms of buying things, but tells me he went and bought a luxury car but still feels way too angry. He's decided the only way to feel better is to hire the best lawyer and \"ruin them financially\". He says he doesn't care about the money but he bets this server and this restaurant would because apparently it's a small business. I'm trying to talk him down / see this as an opportunity to work on emotional regulation in ways that will benefit him, but like, it's so gross and sad. I'm trying to remember I'm this guy's psychiatrist and not like a judge, and life is unfair, but it's hard for me to keep the empathy. \n\nI think about taking some personal time off but there's so many patients and needs... and I also feel I shouldn't be struggling with this because I should be better somehow.\n\nOh, and in addition I feel like 150% Mom guilt so in addition to all of this I feel I'm abandoning my own family for this job.",
    "title": "Putting in effort for patients who aren't fully invested in their own well-being or don't respect my time",
    "subreddit": "medicine",
    "timestamp": 1682448694,
    "score": 379,
    "keyword": "man lawyer"
  },
  {
    "text": "Reporting a Student I have a difficult situation. There is a nursing student that works as a CNA at my hospital. His previous career was as a lawyer but for some reason is trying to become a nurse. (I heard this is because he wasn't a terribly successful lawyer)  \n\n\nThis guy has some concerning behaviors that honestly scare me. He's been found a number of times operating out of his scope of practice as a CNA. I once caught him taking report on a patient because there wasn't a nurse around. He's apparently done this before on other units but they entertain it or they don't care. I gave him a pretty stern talking to about this and he played the fool saying, \"Oh, I just picked up the phone and they started talking.\" I know this isn't true because I called that nurse back and she was given the impression that she was talking to an RN. That nurse was pissed, I was pissed and he lied to my face about it.\n\nMore recently, our night shift charge was having difficulty getting an IV on a patient. When we're out of options at night, we call down to the ED and ask for a nurse that's skilled in IV placement to come help out. Guess who showed up. Obviously, the night charge nurse put the kibosh on that. But when that charge nurse called down to the ED for answers, the charge nurse said, \"I didn't know he wasn't a nurse.\" My guess is that our friend doesn't seem to fucking know either.\n\nSo I'm very concerned about this. I brought it up to him again and he again played the hapless fool. \"Oh, I just walked up and the charge stopped me.\" I started nice, but by the end I was shouting at him. He's arrogant, dangerous and (most concerning) DISHONEST. When I brought up these things to him, he said it was hearsay. \n\n\\*\\*I'd like to mention that I and others have brought up this issue to management but because it falls under plausible deniability it's not something they're going to pursue. This hospital is a sinking ship and things like this fall through the cracks. I've even put in my two-weeks just recently.\n\n&#x200B;\n\nHere's where I'd like some advice. I've got the contact information for the director of his nursing program. I'm torn if I should tell her about these issues. I don't think this man should ever be a nurse. On the other hand, his background in law is concerning because I don't want a defamation lawsuit on my hands. I have such a deep concern for the patients that may be under his care in the future based on his behavior.",
    "title": "Reporting a Student",
    "subreddit": "nursing",
    "timestamp": 1676164105,
    "score": 197,
    "keyword": "man lawyer"
  },
  {
    "text": "Why do people feel the need to project their anger towards bad nurses onto me in public, everyday situations Nursing student here. Does anyone else have this experience. I’ll be making small talk with a stranger in public, they ask what I do, and I tell them I’m in nursing school. Suddenly the tone shifts. Suddenly it’s “Well, let me tell you about this TERRIBLE nurse I had. I hope you’re not like her.” It’s uncomfortable. When I’m out and about in my everyday life I don’t want to randomly start defending myself or the nursing profession to strangers. \n\nIt happened today. I was at the beach and was talking to a middle-aged man sitting near me. He asked me if I was in school, and I told him I’m about to start my senior year of nursing school. Immediately he launches into this long story about how this horrible nurse who “mangled” his father’s death (Essentially, patient who was sound-minded wanted pain medication, family didn’t want to give him medication, nurse gave it anyway). He was going on that he’s never been able to recover from his father’s death and it’s all that nurses fault. \n\nIt’s essentially trauma-dumping on a complete stranger. I’m sorry but when I’m sitting at the beach trying to have a relaxing day, I don’t want to start comforting some random adult man about his father’s death. And it’s a really uncomfortable position to be in because what am I even supposed to say? Apologize on behalf of all nurses? And the thing is this isn’t even an uncommon occurrence. I’ve had this exact scenario happen so many times now since starting nursing school. I get it, the general public is divided between thinking nurses are “mean girls” and “healthcare heroes,” but it’s exhausting. \n\nI just don’t know any other profession that’s treated like this. It feels inherently tied to the fact that nursing is a female-dominated field. Women are supposed to be caretakers. Therefore nurses are supposed to be caretakers, even off the clock to random people. It’s our calling I guess. I’m a 21-year-old stranger just sitting at the beach, but because I’m enrolled in nursing school there’s apparently no boundaries. \n\nSometimes I just want to say to people, this is a conversation for a therapist or a lawyer. Not me, the random nursing student exchanging pleasantries with you. Maybe I should have more compassion about it, but it makes me feel very uncomfortable sometimes",
    "title": "Why do people feel the need to project their anger towards bad nurses onto me in public, everyday situations",
    "subreddit": "nursing",
    "timestamp": 1688443148,
    "score": 159,
    "keyword": "man lawyer"
  },
  {
    "text": "Cumulative stress kicking my ass for the first time in my 22 year career…wtf…. Like most of us, Covid just changed everything, how we work, and I don’t think I’ve even processed the last 3 years. \nI was working in public health when Covid hit…and I don’t think I’ve taken  a deep breath since 3/12/20.\n\nI lost 3 family members, one to a PE and the other two to Covid. \nI was isolated a lot as to not transmit anything to my family. \n\nI was working on my MSN when Covid hit and suddenly my 40 hours a week jumped to 60/70 and it was chaotic and scary,  but I did not hesitate, but it was pure insanity! \n\nMy mom had a cervical fusion surgery in late ‘20 and almost died, had her vocal cords/nerves cut and that was pre Pfizer. She’s made such progress but has been diagnosed with dementia and Parkinson’s and because of work I have only see her once back home. \n\nMy husband of 20+ years cheated on me, found out around last Thanksgiving and he exposed me to possible std’s since he did not wear a rain jacket. 😡I retained a lawyer for separation before Christmas.. and my girls, dogs, and I moved out after new years. \n\nThe girls are sad, depressed, pissed, but grateful that we left. \n\nI had interviewed for an outpatient psych day program nurse job in Nov  and was offered the job the week before I moved out. I got movers quickly, my friends were amazing and helped us get settled in our new place in like a weekend. It’s cozy and not man baby to be found. \n\nI am experiencing a cumulative effect of the stress and pain stbx has caused me and our daughters. We are doing the best we can, the youngest has anxiety, but she’s improving. The older one had a rough 2 years, but she’s in college now and I’m optimistic she will stay the course.. \n\nNow, to me…\nI thought I was coping well, I have a therapist, I’ve been to the dentist, eating well, lost weight, getting my kids health needs addressed  doing all the stuff I did before because stbx was not helpful. I have no regrets leaving stbx… I will not live a lie with him. I think the last 3 years has kicked my ass and I’m just now seeing it and feeling it! \n\nI’ve been in an SSNRI for many years, but since March I have had intermittent skin rashes, increasing insomnia, I rarely if ever cry/shed tears, but I’ve had a lump in my throat for over 10 days. I’ve missed a few days, but they were for my kids appts and to assess the rash… \nI have not been there a year, but I need a few days to rest, restore, hydrate, journal, and I see my therapist virtually today. \n\nIn 22 years of being a nurse, mom, wife, now soon to be ex wife…I have never been so spent, so tired, anxious, exhausted, pissed, but also so grateful at the same time. \n\nI’m asking my boss for the remainder of the week off to get my head right. \n\nI have never needed to use PTO for my mental health, but I really have some serious ptsd from my past, Covid, deaths, and the implosion of my family life. \n\nI’ve been at my new position 5 months.. in psych…so I’m hoping I’m not going to be seen as weak, but I cannot help anyone right now…nursing has never been so hard for me…I just have nothing left to give. \n\nCan anyone relate with feeling ok and then bam 💥 wacked by so much shit you can’t even unpack it ??? \n\nI feel like my biggest task today will be feeding my dogs… and I’m a short, fast, 5’1” nurse who is typically,  a happy, joking, powerhouse…Fucking stress buckets man. 🙄",
    "title": "Cumulative stress kicking my ass for the first time in my 22 year career…wtf….",
    "subreddit": "nursing",
    "timestamp": 1686743299,
    "score": 29,
    "keyword": "man lawyer"
  },
  {
    "text": "Charged misdemeanor assault pled down to 4th degree misdemeanor aggravated disorderly conduct Hi, over a year ago I was at a bar with friends. I noticed a man being physical with a woman and me being the person I am, always trying to make sure everyone is okay, checked to see if the girl was alright. The man got angry, told me to mind my business, pushed and spit on me. I open hand hit him off me. This happened as a police officer was approaching. I was never arrested. I was wrote a ticket for M1assault. Later in court, they gave me a plea deal and said they would let me off with M4 aggravated disorderly conduct if I plead guilty to that. I did, to avoid going to trial. I had no jail time, just a small fine and an anger management course. I’ve never been in trouble before. I have a bachelors degree from a competitive university and have worked hard to get to where I am, however it seems as if one mistake has ruined my life. The past year, I’ve done a lot of reflection and have decided that I care for others health and safety deeply. I want to make an impact on someone’s life. I want to be a nurse…. Will my misdemeanor aggravated disorderly conduct stop me? I’m in Ohio. I contacted the board and they told me they can’t give me an answer until I submit an application. I’m just so drained because of this. I feel like my life is ruined. I have the opportunity for expungement soon with a lawyer, however I know it will still show up on my background check. Can someone give me advice or has anyone been able to become a nurse with something similar? Please give it to me straight. Also, I wouldn’t say I have ever had an alcohol problem but I was definitely drinking that night. I haven’t drank since because I’m terrified from that night. I am over a year sober. Please give me your thoughts. Thank you so much",
    "title": "Charged misdemeanor assault pled down to 4th degree misdemeanor aggravated disorderly conduct",
    "subreddit": "nursing",
    "timestamp": 1696043349,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "My Old Districts Being Sued Because Of Me! So this is the last school district I worked in as an administrator, some of you remember the horror stories of me getting out of that place. Well, it turns out that they are now being sued by the family member of one of the students.\n\nSo one of the students at my school had a uncle who is a registered sex offender. Literally the guy is a child diddler that did a couple years in jail for it. In my state, sex offenders are not allowed on school grounds unless they're there for official reasons involving their child and they informed the school in advance that they're coming on to school grounds. It's there to protect the children. \n\nThis child's uncle is not his legal guardian and having  met the person once, he's also a \"Ken\" or whatever you call a male Karen. He tried to come on to the campus one day because his nephew was giving a presentation at our school exhibition. \n\nI found out that he was a registered sex offender when somebody reported to the office that a strange man was wondering around the outside of the campus. The police were called and I met them at one of the outside gates where the guy was hanging out smoking. He said he was there to see his nephew perform. The cops ran his ID and it popped up that he was a sex offender. They let me know this.\n\nI let him know that he would not be allowed on the campus because we don't have him as a parent or guardian and he didn't give us advanced notice that he was going to be coming to the campus. He went nuts. A full Karen meltdown about how he has the right to visit his nephew's school and that his tax dollars fund the school. He also said that he pays the police officers and my salary. I told him that this was non-negotiable and the loss of that he had to inform us in advance that he wanted to visit the school. I then just turned around and walked back towards the campus. I don't get paid enough to deal with Karen's.\n\nI informed my principal and the district of this. They all approved of my action.\n\nApparently he felt like his rights were violated. He's currently suing the school district because we wouldn't allow him to see his nephews presentation and that has traumatized him emotionally and mentally. Also, apparently he's trying to sue the police by saying that they violated his rights by informing the school that he is a registered sex offender.\n\nNote: the guy was arrested and convicted of having sex with a child under the age of 15 when he was in his mid-20s. He also had violations of him failing to properly register as a sex offender. This was all in the last 10 years.\n\nSo now, I have to go ahead and meet with people from my old school district to get my story straight about what happened and why wouldn't let him all the campus. Thankfully, I'm not the one being sued. He issuing the school district and the police department. I asked my lawyer what his odds of winning were and she said slim to none.",
    "title": "My Old Districts Being Sued Because Of Me!",
    "subreddit": "Teachers",
    "timestamp": 1690146298,
    "score": 1482,
    "keyword": "man lawyer"
  },
  {
    "text": "Scream into the void Hello people!\n\nI am Mr Walter (not my actual name, but a rough translation).\n\nI am 25 years of age and have been teaching for 3 years now. I started 2 months after graduating from University. I live in Romania and I teach Mathematics and Computer Science (2 subjects).\n\nBefore finishing Uni I worked as a Mentor for young children, teaching them computer science in a fun way (CoderDojo if you're interested).\n\nIn my 3 years as an official teacher, I have passed all the required \"entry-level exams\", to obtain my qualifications, with flying colours.\n\nAll that being said, I have found myself sad, mad, frustrated and many more. Why you might ask? Well, here goes:\n\n1. I worked in a school with a corrupt Principal (and equally unprofessional and not at all gifted - brain-wise) who continuously shouted and tried to intimidate me if I did not grade the students with the highest possible marks. I endured this thing for 2 years.\n2. The Principal's Child was in the 6th, later 7th grade and he constantly insulted the staff, threw things all over the place and threatened us. He kept telling me that he could make it so that I would no longer teach there if he wished. I told him that I can do it myself after he pissed me off for an hour. His mom (the principal) came to me during recess and kept shouting at me because of the response I gave her son.\n3. At some point, I was serving in the yard (in Romania, teachers have to \"serve\" every recess by watching the children in the hallway or in the yard) and saw a tabletop fall from the 2nd floor, in front of me. I got scared and went up to see what was going on. I regretted that. In one of the rooms, where a class happened to be, the worst of the worst, there was a flaming desk.\n4. When my grandfather died, the man who effectively raised me for years, I was entitled to 4 free days. I decided to exercise my right and got threatened because of it yet again.\n5. There was a girl in the school who was the daughter of a lawyer. I think I saw the girl 3 times in a whole year (at most). I was legally not allowed to pass her. I got threatened by the Lawyer and the Principal that if I dared not pass her, I would face \"severe consequences\".\n6. One of my colleague's sons was my student. He scored an 80% on a test and his parents started shouting at me and threatening me on the phone. They wanted him to have a perfect 100%\n7. Certain favourites of the principal felt entitled to call me at 9-10 PM to tell me that I had to solve their problems regarding Google Classroom on the spot (at 9-10 PM).\n\nObviously, I decided to switch schools.\n\nIn the second school, I encountered a more meritocratic environment, alas, problems arose here too.\n\n1. Parents kept calling if their children did not get a 100% on a test. They kept threatening and insulting me.\n2. Certain teachers, who had children there, tried to intimidate me into giving their children good grades, even though, their children did absolutely f-all.\n3. One girl came to me the other day demanding that I pass her, even though she came to class 3 times in total. Her mother kept waving a paper in my face telling me that she was excused for medical reasons and that I should give her the highest grade possible because she was clinically depressed.\n4. I started teaching mathematics and the parents from those 2 classes kept sending me emails and calling me or demanding that I stayed over my working schedule to talk to them (there were 59 or 60 students, so u can imagine).\n5. I kept giving students easier and easier tests and they still messed them up. I can count those who actually studied on the fingers of my hands (I taught over 500 students this year).\n6. I started giving them monkey-see-monkey-do homework and nothing has been turned in in over 3 months. I was threatened by the parents with being sued if I dared to fail or give them a bad grade (1 out of 4 grades).\n7. When it came to mathematics, I kept finding new ways to teach. Ways that were interactive. The students kept watching their phones (even though we had a no-phone policy). Bad grades soon followed and I got shouted at again by the parents.\n\nBecause of the stress acquired, I developed colon and liver problems...\n\nI honestly feel like today's generation is truly lost. No effort, no f's given, nothing. Just threats and intimidation. As such I decided to leave this profession (I wanted to be a teacher since I was 7). I like kids, don't get me wrong. I had students who actually made my day, over and over again, but the vast majority (85-90%) are simply being raised by lunatics who have the IQ and morals of a freshwater clam. At the same time, the phones they are constantly on turn them into zombies that want to make no effort in life and enjoy being weak mentally, morally and in every way possible. They are also more and more animalistic in behaviour, disrespecting those around them or public property (not that private property was any different in their eyes).\n\nThey enjoy making gossip and sending fake news to electronic newspapers accusing teachers of being paedophiles (3 of my colleagues were victims of such behaviour) and/or fake religious discrimination claims (happened 5 weeks ago). They know that nothing bad will happen to them because the schools are getting weaker and weaker. They keep telling us that we are worthless because we are poor (yes, we are poorly paid). I am seriously tired of being surrounded by little animals who take delight in being pricks in the shape of a child.\n\n&#x200B;\n\nEDIT:\n\nAll that being said, there were things that I will remember with joy. Instances where some of my classes surprised me. They were dumb as sand, but their behaviour and perhaps the small age difference between us (8-9 years) made them be kind towards me. They loved coming to my classes and I loved teaching them. We had fun. I will always miss those people.\n\nLeaving this profession gives me pain (physical pain, akin to grief). I feel like I am killing something inside me, but alas, I can not continue in these circumstances. My health is far more important to me. I could forego my morals and not give a damn about them, giving the students 100% on every test and not having a care in the world, not teaching them anything, just letting them play games on their phones, but that sort of behaviour is NOT why I became a teacher.",
    "title": "Scream into the void",
    "subreddit": "Teachers",
    "timestamp": 1686942363,
    "score": 8,
    "keyword": "man lawyer"
  },
  {
    "text": "A Union victory Ok, so after a previous comment, /u/misguidedsadist1 , /u/HotDamn18v, and /u/alltheway-upp asked me to write up my story of 1) unionizing my previous school 2) being fired for it in retaliation, and 3) winning a lawsuit against the school for an illegal firing. It's long, and I'm not even sorry!\n\nWhen I moved back to California after a stint in Arizona, I need a job quickly, so I took the first one I could find, at a charter school in Silicon Valley. It was one of a chain of 8 or so in the Bay Area, for privacy's sake, I'll call the organization Pinnacle schools. Pinnacle was (Is, I guess? they're still around) highly focused on project based learning and skills mastery. So much so, that content learning was done in more of a study hall setting with students working on their own, and in regular classes, teachers were facilitators, and guided students in applying content knowledge in projects. \n\n&#x200B;\n\nThis place was extremely hard on teachers, because A) the lack of structure made classroom management a nightmare (Imagine 90 minute blocks trying to make kids sit quietly, and focus on teaching themselves by reading off their Chromebook!) , B) teachers were constantly expected to be in meetings until at least 5pm, C) teachers also functioned as \"mentors\" who filled the role of both college/career guidance counselor and mental/emotional counselor to an assigned group of 12 or so kids (we did NOT have training in either area) and D) Severe lack of discipline meant kids felt they owned the place, and ran roughshod over teachers. Any time I tried sending a kid to the office, I was talked to about what I did to upset the kid. Not to mention, a vague and unclear leave policy, and teachers worked 2 weeks longer than a standard school year. Plus crap pay, naturally. \n\n&#x200B;\n\nObviously, something had to change. One day, a colleague asked me cryptically if I was interested in improving the school community. Sure?  He asked for my personal email, and that evening, he wrote to me explaining that a group of teachers across this chain of charters was in contact with with organizers from CTA (California Teacher's Association). He asked if I wanted to help in the unionization effort and I said hell yeah! So, I became one of three teachers on the organizing committee at my campus site. \n\n&#x200B;\n\nStep One: gather signatures. By having one on one conversations, we got 75% of teachers at my site to sign a petition agreeing that they wished to organize as a union/bargaining unit. I spent most of January 2019 doing that, being very careful to have these conversations off the clock, and away from where admin/management could overhear. It was scary, because this was a place where a subset of teachers had really drunk the kool-aid, and could've ratted us out before we officially filed. \n\n&#x200B;\n\nStep 2: A success! By late February, we filed the petition to organize as \"Pinnacle United\", an affiliate of CTA, with 80% of teachers agreeing not just at my school site, but across the whole charter chain. Early that morning, myself and the other two on the organizing committee met with our principal, and informed him that across Pinnacle schools, staff had voted overwhelmingly to officially organize. We emphasized our desire to work with management, and not to have a combative attitude. \n\n&#x200B;\n\nStep 3: Recognition. Pinnacle initially declined to recognize our petition, but CTA filed an unfair labor practice with the Pubic Employees Relation Board, who sided with us and ruled that Pinnacle was required to play ball and come to the negotiating table with us. \n\n&#x200B;\n\nStep 4: We elected Union leaders at each site, and a negotiating committee. We also spent time holding town halls, hearing what staff wanted to negotiate for. Overwhelmingly, A) better pay B) better work/life balance C) Not to have to act as college/career or mental health professionals. \n\n&#x200B;\n\nAs of the end of the school year, things were looking good! Pinnacle was still not going to make things easy on us, but now we could flex our collective muscles and make some change! The last day of school, we finished our last meeting. I went to my classroom to finish gathering my things, overjoyed to be starting my summer, and that I was due to be married in just 8 short days. The principal came in, asked if I could see him in his office. As I walked in, I saw an HR rep there, as well as another one on Zoom. I knew instantly from their serious faces what was about to happen. Principal read a short prepared statement \"Pinnacle schools has decided it is no longer in our interest to employ you, and are terminating your employment immediately.\" I asked why, or for any further information, and got zilch. I was told to collect my things and leave campus, so I did. \n\n&#x200B;\n\nSpent that evening sobbing to my fiancée, and to the Slack we union organizers were using to communicate.  Turns out, two others had been fired at the same time (both union leaders like me). The next day, a large group (20 or so) came out in solidarity to help us finish packing up our personal belongings, and then to speak with the CEO at head offices of Pinnacle schools. The principal had stated that it was an org-level decision to fire the three of us, but the CEO said it was a site-level decision. Her right hand man, the superintendent, was there to, and began aggressively screaming at one point, prompting us all to walk out. \n\nThe next week was a blur of last minute wedding prep, polishing my resume, and applying for new jobs, and explaining what had happened to the lawyer (hired & paid for by CTA). The wedding went off without a hitch, and I had a new job within a month. \n\n&#x200B;\n\nOver the next few months, I met several times with the lawyer to go over all the details of what had happened, provide as much documentation as possible, etc. This wasn't Pinnacles first time dealing with lawsuits, surprise surprise, and they are experts at dragging things out. \n\n&#x200B;\n\nAfter several false starts, we finally went to mediation in September 2020. I had to take a day off work, go to PERB HQ in Oakland, where we were in one room, Pinnacle's folks in another, and a mediator shuttled between us. We gave our first offer (reinstatement, back pay), Pinnacle said it was a non starter, and walked out 15 minutes after we began. So, to trial! Trial prep was brutal, as I had to go over Pinnacle's \"documentation\" against me, and hear over and over the awful things they said about me. \n\n&#x200B;\n\nIn December 2020, I testified in person, and then. . . crickets. The lawyer said I did great, but legal wheels were still turning. \n\n&#x200B;\n\nMid January this year, I hear that we finally won! Pinnacle didn't even appeal! I was sent an offer of reinstatement which, lol no. I now get to gather financial documents from the past few years, so my lawyer can hash out with Pinnacle's how much, if anything, I'm owed in back pay.  My understanding is that they'll take what I would have made had I stayed at Pinnacle, and subtract anything I've earned in the meantime. Since my new gig at a great school pays better than at Pinnacle, I'm not likely to get much if any money, but I'll take the moral victory! Plus, I still get Pinnacle United's newsletters, and they're doing great things improving life over at Pinnacle, so take that!",
    "title": "A Union victory",
    "subreddit": "Teachers",
    "timestamp": 1675745994,
    "score": 7,
    "keyword": "man lawyer"
  },
  {
    "text": "Louisiana House Republicans Cut Education Funding to Pay Off Retirement Debt – Who Needs Teachers Anyway? In a move that would make the Smoking Man proud, House Republicans in Louisiana have decided that the best way to save money is to cut funding for education and pay off public employee retirement debt instead.\n\nIf you were wondering why Louisiana ranks 50th in education, wonder no more. House Republicans have finally found a solution to the state's education woes – just get rid of the teachers! Who needs qualified educators when you can have unqualified volunteers running the classrooms? It's like they say, if you can read this, thank a teacher. If you can't, thank a Louisiana House Republican.\n\nBut why stop at eliminating teacher pay raises? Why not just eliminate teachers altogether? After all, it's not like we need educated citizens to run our state or anything. Who needs critical thinking skills, scientific literacy, or an understanding of history when you can just Google everything, right?\n\nOf course, we can't forget about the children. They may not be old enough to vote or make campaign contributions, but they can sure be a nuisance with all their learning and growing and stuff. So why not just cut early childhood education programs too? Who needs to invest in our future when we can just pay off debt?\n\nBut don't worry, it's not all doom and gloom. House Republicans have graciously decided to retain university faculty pay raises. Because, you know, it's not like we need educated college graduates to enter the workforce or anything. Who needs doctors, lawyers, engineers, or scientists when you can just have uneducated politicians running the show?\n\nIn conclusion, the Louisiana House budget plan is a perfect example of why we need to elect officials who prioritize education and invest in our future. Unless, of course, we want to continue living in a world where ignorance is bliss and the truth is out there, but no one knows what it is.",
    "title": "Louisiana House Republicans Cut Education Funding to Pay Off Retirement Debt – Who Needs Teachers Anyway?",
    "subreddit": "Teachers",
    "timestamp": 1683250782,
    "score": 5,
    "keyword": "man lawyer"
  },
  {
    "text": "Student Safety Concerns \nI’m a High school art teacher who has concerns for a student with mental health issues. Student was recently suspended for a violent outburst where he hit himself and threw objects at another teacher.  He has made comments about wanting to harm himself in very drastic ways. I was just in a safety meeting with his caseworker and other professionals involved with him.  \n\nHe was in foster care, but the family after this outburst has decided to no longer house him. He is being placed back in the home with his mother and their biggest concern is for him to graduate high school. He is a senior and has been in the foster care system for a year and I’m very concerned for him to return to that environment.\n\nOur principal has said when he comes back to school. If he has another violent outburst, they are going to call the police because he is 18.  The only people in the meeting who are advocating for this young man to be placed in a residential care facility were myself and another teacher.  A child advocacy lawyer also recommended that, but the rest of the individual seem to think that it was OK for him to return to school.\n\nWe are in a rural community where there is very limited access to healthcare in general, let alone facilities that would be able to help him.  I just don’t know what to do and see the situation ending poorly for him unfortunately. Any advice or suggestions are very welcomed.",
    "title": "Student Safety Concerns",
    "subreddit": "Teachers",
    "timestamp": 1698851626,
    "score": 4,
    "keyword": "man lawyer"
  },
  {
    "text": "Toxic workplace environment Before I start my story I would like to note that this story of my place working at this company has been amended so that only the first name of the workers given are named so that the full identity is not revealed. Also the business name is not revealed as this is a true story of my time working at the business as I worked at the business for around 7 months in the finance department before I left.\n\nI start working at the business in early January 2023 and am trained by a person called Morgan who is a few years younger than me. There is also my boss who is a woman called who has been working at the business for quite a while as well. I start working there and my boss tells me that Morgan will be leaving the business at the end of January 2023 and Morgan and his girlfriend will be doing a world tour covering various different countries located in east Asia as well as also travelling to parts of Oceania like Australia and New Zealand and are planning on doing this trip for approximately 3 months then returning back to the home country. That gave me approximately 3 weeks to spend with him before he left the business to go on his travels. At the end of my first day I was about to leave the office however Morgan tells me that before I leave the office I need to send a email to the CEO (Paul) to let Paul know all the tasks that I have completed today. I was confused by this but Morgan tells me that it is a mandatory procedure that everyone in the business is required to do (there is approximately 75 people who work in the business). Then I kept forgetting for the next few days after that to send the email to Paul about this which Nicola tells me to do. I quickly figured out that most of the job could be simplified and automated away given that it was all in excel and functions such as (COUNTIF, SUMIF, IF and VLOOKUP) could be used to simplify my job. Then around a week before Morgan was due to leave a woman called Catherine started working at the business and stated that she previously worked at her previous company for over 20 years but was forced to leave her previous job after it was announced that her job was being moved to Canada which she was not willing to relocate to. I got along with her well and it got to the end of the day and I asked her that I will see her tomorrow and she then looked at me and said “I think that I will see you tomorrow”. This left me confused as she was implying that she wasn’t sure if she was or wasn’t going to go to work the next day. The next day she arrived to work and Nicola told me to show her Sales Invoices and I provided a detailed explanation of how to do them and she stated that it is too complicated for her. Nicola then called Catherine into her office and they were in the office for over a hour which confused me and then Catherine announced that she was leaving the business and got her stuff and said that it was nice meeting me and Morgan and she left. I asked Nicola why she left given she only worked there for around 10 hours and she stated that the job was too complicated for her to do however a few days later Morgan told me that she got “bad vibes from the office” which caused her to leave. Then a few days before Morgan left the business he looked at me and told me that Nicola was also planning on leaving the business. I then asked him when Nicola was planning on leaving the business and he shrugged his shoulders and stated that he didn’t know when she was planning on leaving the business. It got to Morgan’s final day in the office and I said my fair wells and wished him the best of luck in whatever he decides to do in life. I then looked at Nicola and told her that I would see her tomorrow. I arrive to work the next day and walk over to my desk only to discover that my computer has disappeared which confuses me and I look around the office trying to find my computer. Then Paul the CEO asks me to go into the boardroom which is a separate room from where everyone else sits and another person called Andrew who is second in command is also in the room. I sit down and Paul tells me that not only did Morgan leave the business yesterday but also my boss Nicola also left the business on the same day even though she was meant to leave at the end of April 3 months after her original departure as she left at the end of January. He told me that I was the only person in the finance department for now and I would have to report directly to Paul if I got stuck. I was then moved to sitting near a woman called Tina who was the head of HR (Human Resources) and was also personal assistant to the CEO. I then started implementing the formulas that were required shortly after I sat at my new desk to simplify my job. \n\nAround a month after I started, I started doing IM’s which are Profit and Loss statements where you have your gross and net profits and then you have addbacks once the business is sold as our business is basically the business equivalent of selling houses and we earn between 2% to 5% commission per sale based on the business sale price. The IM’s are used in brochures which we send to the clients who might potentially buy a business. I start doing it alongside 2 other people who are new to it and then one day Paul the CEO sends a email stating that I won’t be doing that job and it will instead be done by 2 other people exporting some of my job out to others which normally takes me 5-6 hours per week to complete as when Morgan worked at the business he did briefly show me it but didn’t have much training in the task and it was instead going to be done by James and Daniel as Daniel was partially doing it anyone alongside Morgan before Morgan left. Paul then had a quick meeting with me and stated that there was no better place to work than here and he was more than happy to invest in me for my Accounting studies. Also Paul was in the process of hiring someone to replace Nicola for the position of management accountant. Also around mid February a new person called Kevin had started working for the business as he is the COO (Chief Operating Officer) and is the 3rd most important person in the business as his job is to be the go between person between the regular workers and the CEO as the regular workers go to him for any questions / problems / concerns and he then reports to the CEO so that the CEO Paul has a good grasp of the day to day running’s of the individual departments delivered by Kevin as well as Kevin also performing other tasks.\n\nThen at the start of March 2023 the business had successfully hired someone new to replace Nicola as the head of Finance which was a woman called Hiba. She started working at the business and I was impressed with her knowledge as she was born in Morocco and was fluent in 3 different languages which was (English, French and Arabic) and also had a degree in something medical related (can’t remember the exact degree name) and was now training to become a accountant and had also read multiple religious texts of the (Qua-ran, Bible, Torah and Talmud) as well as other texts and was well educated on religious beliefs from different religions. I was then moved away from where I was sitting with Tina after having a few laughs with her as the funniest was when I asked her how her weekend was and she said it was good as she states that she played a water fight with her kids in the garden where she was spraying her kids with a hose and they were running away. She asks me if I did that when I was younger with my parents and I said no I don’t think so but stated that we did have a pond. She then asked me if my parents took me down to the pond and looked at me and said “get in the pond you fuck” and then push me in which I couldn’t stop laughing at. My new boss Hiba was very calm and relaxed and we had a good working relationship and got along with her well. (Apologies if the story has been a bit boring up to this point as it will get good now). Then a woman called Jenna who was the head of one of the departments and had no prior knowledge or experience in finance advised me that the way I was doing a part of my job was wrong. I queried it with her and stated that I was following a series of notes to do this task which was typed up by Morgan before he left the business and was following them. She stated that the notes that he had typed up were wrong and stated that the breached company policy even though I had never been advised this prior to this point and also my previous worker never made any mention of this and Jenna also provided no proof or evidence to prove that what I was doing was breaching the company contract. I spoke to Hiba about this but she stated that she didn’t know much about it and I told the IT department to make this change even though as I stated I was sceptical of this claim and he changed it and it caused some changes on the system which I corrected. Then a few days later the changes that I made a few days prior due to this amendment caused over 4 million emails to be generated and I had to attend a meeting with Kevin and Andrew about this. I provided my evidence as I had email evidence from Jenna to me confirming me to make this change and also provided other evidence with regards to this and I didn’t face any consequences and Andrew had a chat with Jenna as I don’t know what was discussed. \n\nThen one day I was in the office and Kevin who as I stated was the 3rd most important person in the company was overseeing the development of Daniel and James who as I stated were working on the Profit and Loss statements for the IM’s and wanted to have a meeting with them to discuss there progress and performance. Kevin’s office was a single square office that was separate from the open planned office were me and everyone else sat. Part of the way through the meeting Kevin told Daniel to leave the meeting as Daniel got up from his seat and walked out of the office and sat at his desk and Kevin and James were sat in the office with the door closed. I was sitting there doing my work and was literally maximum of 4 walking steps between were I was sat and the office door to Kevin’s office. Then all of a sudden I heard this super loud shout from Kevin that was so loud that me and multiple other workers in the office could all hear it were Kevin shouted at James stating that “if James was not happy with his job then you should Fuck off yes you should Fuck Off”. Then shortly after this event James launched a complaint to the new head of HR named Janine as Tina who was the previous head of HR left the business due to her having a feud with Paul. Janine got Kevin and James around a table and James launched the complaint that Kevin was engaging in bullying in the workplace and Janine asked Kevin if this was true. Kevin then sat there and paused and then stated that these allegations were not true as Kevin would never swear at any of his workers or engage in bullying at the workplace and denied all allegations. Kevin faced no consequences for this and as far as I know didn’t receive any disciplinary action for his behaviour.\n\nThen on a different day in the office I received a letter from the post which I opened and read and was a bit unsure on what to do with it and was not sure who to give it to. I then looked over to see if my boss Hiba was there which she wasn’t and continued working (which was spent implementing excel formulas because I had completed all my work for that week). She then arrived back around 10-15 minutes later as prior to this she took a few random days off work and had a few meetings with the CEO Paul. I gave her the letter and explained that I didn’t know what to do with it and she advised on what to do with it and I was about to go back to my desk but she stated that she had an additional comment to make. She told me that she was leaving the business around 10 weeks into the job and I asked her why she was leaving and was a bit shocked by this announcement. She stated that she was told that it was going to be a management account position but she viewed the job as being more like admin work and that you don’t need to have any prior knowledge or experience in finance in order to do her job as they could drag anyone to do the job and they would be capable of doing it. She also stated that she doesn’t have much work available to do and she has quite a lot of free time in her job and gets a bit bored and stated that I was capable of doing my job and her job and that would also benefit the company so instead of hiring 2 workers they hire 1 worker saving money on wages. I then put a email to Paul the CEO for this which he denied due to the fact that I make a few mistakes which I get Paul to correct which literally is just amending a 4 digit number to fix. Then the next day I had a meeting with Paul and Kevin and Paul told me that Hiba had left the business and stated that due to the minor mistakes that I had made and also due to the fact that I was on my probation Paul was in the position to fire me at any given time if he wished to do so if I continued to make mistakes. He then looked at Kevin and stated that as of now Kevin would be my go to person if I had any questions or queries and to not contact Paul directly even though Kevin has no prior knowledge or experience in Finance as only Paul had knowledge in finance alongside me. I was at this point a bit unhappy about the decision to put Kevin in charge of me if I got stuck on anything given how he acted towards James and his behaviour and also thought that it was rude for Paul to potentially threaten to fire me at any point even though that is part of the job position that you have. \n\nThen shortly after this there was a amendment made in my “Daily Report” emails so instead of sending a email to the CEO Paul at the end of the day specifying what tasks I had completed on a daily basis I had to specify the tasks that I had completed on a daily basis and also specify the amount of time spent completing the tasks that I completed in my email for a day to day basis which I wouldn’t of usually had to do on a daily basis in terms of specifying the time it takes. I then start sending my daily emails at the end of the day giving the honest amount of time that it took for me to complete the amount of time that it takes for me to complete my tasks and there is easily over 100 minutes every day as a minimum that I had of free time that I had available in my emails which I didn’t specify what I was doing as I was implementing formulas in excel to simplify my job in the spare time but as I stated I didn’t specify this in the emails. Then after a week or so Paul notices this pattern and sends me a email if I didn’t have enough work to do which I tell him that I don’t have enough work to do and have a few hours per day for free time as he knew from the “Daily report” emails. He then tells me that he wishes that I told him this earlier and he sends me a email for a report on a website and then on that day Kevin then organises a meeting with him in the boardroom. I attend and Kevin states that I don’t have much work to do and I have been given the log in details to the website that I am required to do the report and I have been tasked with investigating over 400 different business that deal in various different investment companies and I have to put the business names, address, business occupation type and business investments and general business info about the business into a excel file for each individual business. I then start this process and start working through the list and continue sending the “Daily reports” with a full days worth of work to complete with the report I was tasked with completing factored in. Shortly after I start working on this task I receive a email from Paul stating that I will be training a worker called Emma who works downstairs training her on how to do sales invoices which is a task that I usually complete but is given to her before I continue doing the report as this meant that around 70% of the sales invoices task that I complete will now be exported out to Emma to complete which would normally take me 3-4 hours per week to complete. I then continue working on the report and after around 4 weeks I complete the report and tell Kevin this as I briefly interrupt him in a meeting with a woman called Corelia in a meeting. I apologise afterwards for interrupting which they state that they are okay with and I email the excel spreadsheet to Kevin and he opens the spreadsheet and asks if I had completed the task and I say yes I have and he then says that there is not that much info on the spreadsheet. He then scrolls to the top of the spreadsheet and I quickly realise that there was a filter applied on the spreadsheet which therefore explains why the full list is not shown and ask him that if he wants to view the full list then he has to clear the filter. He then tells me that he can do it and he highlights all of the rows on the spreadsheet and then right clicks after that and then clicks on find and replace and starts typing into the find box and then in the replace box and then clicks on replace all and it comes up with a error message. He then sits there and tells me that he doesn’t know what to do and I say to him “click on the banner at the top that has the word data” he clicks on that then I say to him “next to where it says the word filter click on where it says clear” he clicks on that and I say to him “you now have your full list of businesses on the spreadsheet.” Then the next day at work he then sits there in his office and asks me if he can borrow me and I walk into his office and he sits there and says that yesterday I showed him how to clear the excel filter however he has since forgotten on how to clear the filter and wants me to tell him how to clear the filter again which I tell him. He then puts the occupation in alphabetical order and then manually scrolls down the list to find the list that starts with the letter “H” and then tells me that if he wanted to read the list of businesses that have the name of healthcare then he knows that because it starts with “H”. I then advise him that this is a false claim to make as not all of the businesses for occupation are in alphabetical order in the list and when you filter in excel by alphabetical order it only does the order for the first word and ignores the rest meaning that they are not all in alphabetical order. I instead ask him to click on the drop down and type in the word “Health” which he does and then press enter and that gives him the full list of businesses that have the word “Health” in the list which he thanks me for. Then a few days later Paul the CEO then sends me a email asking me where I am up to with the report and I send him the spreadsheet with the info in it which indicates that Kevin did not complete his job of sending the report to Paul which is one of his tasks for his job title.\n\nThen after this I go back to having less work to do and as I briefly stated the sales invoices tasks had been exported out to Emma with no reason specified why this was the case and giving me less time now to complete my tasks and I continue to send my “Daily reports” emails with even less time now available to complete my job. Also as I stated earlier the IM task for Profit and Loss was also exported out to James and Daniel reducing my workload further as well. Also another task that I do is the AKS and the AML reports which I put together every Monday which I put together on excel and usually takes around 10 minutes to complete however that task is given to the other people due to the simple nature of the task and how quickly it takes to complete meaning that this task is also exported out to the other workers just before I completed the report task. I then continue sending the “Daily reports” emails and I again start to have a significant decrease in the amount of time that I have available to complete my job which is stated in the emails at the end of the day by the amount of minutes specified. Then after over a week after having little work to complete I have a meeting with Kevin towards the end of the day specifying what tasks I have completed and is shocked that I have several hours per day of no work to do. Also Paul the CEO also starts sending me emails saying that it is very frustrating about what I am doing on a daily basis and not specifying the full time of what I do. I then have daily meetings with Kevin giving a list at the end of each day asking me what I do and I state that I do other excel tasks. Then one day I go into work and Kevin taps me on the shoulder and asks to have a short meeting with me. I sit down and he closes the door and gives me a letter. He then tells me that in 2 days time on Wednesday (he tells me this on Monday) that I will be attending a disciplinary meeting on the basis that I have several hours free time per day and my time and communication skills and wants to know what I am doing and not stating earlier that I don’t have anything to do. I then walk out of the office room in shock that I am attending a disciplinary meeting over my productivity given the fact that I complete all of the tasks that I am scheduled to complete with several hours to spare. I then start thinking to myself that when I attend the meeting I need to prepare evidence which proves that they had foreknowledge that this was going to happen and start making plans to do this as I complete all the work that I need to complete on Monday and on Tuesday morning start preparing the documentation for my meeting on Wednesday. \n\nThen I go into the disciplinary meeting and point out these points about parts of my my job being exported and state that by default when you do that you reduce your workload giving yourself less stuff to do. I also state that when I did the requested report when I put information together for over 400 businesses during that time the amount of time spends doing my finance job is minimal when the required report is factored out and use my daily reports as evidence as proof of this fact and ask why plans were not put forward to increase my workload whilst I am doing it. I ask Kevin why the decision was made to reduce my workload and he stated that he will ask Paul this and get back to me (he never specified why this was the case). Kevin then asks me what I spend the rest of my day doing and I state that I implement formulas in excel to help simplify my job to reduce the amount of data that I put in excel. He then sits there and says that he thinks that I am lying and that I haven’t done the things that I have said. He doesn’t ask for any proof or evidence of this and then he asks me to leave as in the meeting Janine who works in HR is making notes of the conversation. I then leave the meeting room and he stated that he will discuss with Janine and I am then called back around 30 minutes later and go in the meeting room and Kevin states that I have received a first disciplinary warning which will remain on my system for 6 months because of the fact that I complete my work before the end of the day and didn’t request additional work. I then continue my job and state that the remains time I have free is implementing formulas in excel to simplify my job in my daily report emails. Kevin then again calls me into his office early next week and talks that since the meeting he has spoken to a woman called Vicki and a man called Greg and told me that if I run out of work I should speak to Vickie first and then Greg second asking for additional work which they will provide to me and that my probation period has been extended by an additional 5 to 6 months and I will have a monthly meeting to access my performance (which never happened a month after he specified this). I then continue doing my job and 1 of the 2 reports which took 10 minutes has now been given back to me to complete and have been given some additional work to complete which generates a extra 4-5 hours of extra work per week which is good but still not enough additional hours to fill the total gap of work available. Also after I received the disciplinary warning I was very annoyed and also mind blown that they thought that there is significant downsides to being a productive worker and thought to myself if these people lived in an alternative reality whereby according to them there is almost a universal consensus from experts that being productive is a bad thing.\n\nI then start doing tasks set out by Vickie and quickly complete them them and ask her for additional work but she states that there isn’t any additional work available for me to do. Then I go and see Greg and ask him for additional work and he gives me a task of doing research for Photography companies based in 2 different parts of the country and I put together a spreadsheet and put this information together which he is happy about. I then ask for additional work and a girl called Hannah gives me a excel file task which she states will take 2-3 hours to complete. She gives me the task and within 5 minutes I walk over to her desk and tell her the task that she asked me to do has been completed. She acts surprised and opens up the excel file to find it completed and is left speechless and I state that I used VLookups to complete the task and give her a set of detailed instructions of how to complete the tasks as she stated that she does this task on a weekly basis and it takes her several hours and thanks to me it will now take her a few minutes. She then gives me another task for whether businesses have or haven’t signed a NDA (Non disclosure agreement) which I complete in around a hour which she says that it takes a few hours to do. Then later on in that day I state I have spare capacity and another worker called Bradley states that all of the businesses that have a NDA need a email sent out to them and the format of the email is largely the same the only thing that changes is the business ID number. He gives me the task and within a few minutes I complete it and send out all 200+ emails. He then looks at me and asks me if I did it which I said yes and he tells Hannah this and everyone in the office is left speechless and James who I am friends with says that I am more intelligent than the CEO. I then send a email out to multiple people telling them all how to do mail merge and they all said that this will be hugely beneficial as it will help to simplify multiple people’s jobs.\n\nThen on this Monday a new girl called Maria worked for the company and I showed her how to do my job and showed her the stuff and she wrote a series of notes on how to do the tasks that she is required to do. I then showed her a excel file which had formulas in it and simplified the job and showed her how to do it which left her speechless. Then the day before I am due to leave the business I arrived to work and tried to log into my computer but came up with incorrect password. I tried again and nothing happened and then asked IT to update my password. Then Kevin tapped me on the shoulder and I went into his office and sat down and he said that he found out from someone in the business that I had implemented formulas to simplify my job and that I was planning on selling the formulas and deleting them. I tell him that I had no plans to sell them (as what is another business going to do with a bunch of data that has no relevance to there business anyway) but was thinking about deleting them because of how badly I have been treated. Kevin then tells me that he has no intention of telling the CEO Paul about this but if I delete the formulas I could be financially nuked and have a lawsuit filed against me but I state that even if I did delete them they are backed up onto a server anyway meaning that they can be re retrieved even if they are deleted of which he has no response. He asks me if I plan on deleting them of which I say no and then my password is reset and he again has a second meeting with me and he states that he has spoken to Paul and Paul has contacted his lawyers in case I do delete them to threaten legal action as Paul was on holiday at this time. He also stated that he understands what I have gone through and states that he has been in a similar situation in jobs where he has simplified and automated processes in his working life (none of which I believe). I have kept the formulas in place. Then on the final day that I work there on the Monday I again try to log into my computer and am again locked out of my computer as the password on my computer has been changed again over the weekend and I ask IT why I was locked out of my computer and he asks me to speak to Kevin which I don’t do as I get the impression that he doesn’t like me and finish my final day not being able to send a goodbye email to people I was friends with and keep in touch. Then after I finished my final day at the office I went on Linked In and posted a message on my account basically stating that I had automated away large parts of my job for the next few years and am looking forward to starting working at my next company.\n\nAlso I started looking for other jobs and have got a new job working for a different company and start my job in early August 2023 with towards the end of July 2023 being my final working day at the current company I am talking about and the remaining time is extra holidays I have left over to take. I again gave the business 24 hours notice given the short time span I had between finding out that I had a interview and when the interview takes place and it got later on into the day before I was having the interview as I booked Friday of work first thing on a Thursday and Kevin again asked me at my desk why I wanted Friday off as what my valid reason for this was and I stated that it was for a dentist appointment as I have to have braces fitted in a few weeks time due to a large gap in between the bottom of my teeth and he stood there and said that was a valid reason and authorised it.\n\nAlso another thing is that I had a leaving event a few days before I left on Monday and sent a email out to a series of people to see if anyone wanted to attend and shortly after I sent the email a person forwarded the email to the CEO Paul (as I didn’t include him in the email) and he responded stating that I had to get direct approval from him first before I should of announced the leaving event even though I finish work at 17:15 and the leaving event was going to start at 17:30 which is outside of work hours. I spoke to a local pub for the leaving event and a series of people attended the event and I had a chat with James who was the person who Kevin repeatedly swore at. James was giving me his opinion on the business as he stated that he recorded a video with audio of Kevin repeatedly swearing at James during a meeting and stated that the event where I heard Kevin swear at James was not the first time that has happened and he could of brought this up in his meeting when he accused Kevin of bullying in the workplace but decided against it due to fears he would get fired from his job. He also stated that the new person who works as the head of one of the departments who is a guy called Sunil was not a good boss as he spends most of his day on his phone and whenever he does get work to do he instead shifts the work from himself and instead gives it to a worker below him to complete so that he can do as little work as possible. He also stated that the workers who work in the sales department don’t receive any commission from any sales that they complete in the sales department as they only receive bonuses however the CEO Paul deliberately sets unrealistic targets so that as few workers as possible receive any bonuses from there work. The only person in the business who does receive commission from sales is Nathan and the reason why he receives commission on the sales of the businesses is because his dad is the CEO of the business. Also he stated that Nathan use to work in 1 of the businesses but has recently been transferred to a different department for a different business. James stated that the reason why this is, is because of the fact that there is more completion sales in the new department he works in than there is in the other company and also if another worker in the new department he works in is getting close to completing a deal the CEO Paul will contact this worker and will state that his son Nathan can handle it from here and Nathan would get the deal across the finishing line and complete the sale and earn commission from it. Also James stated that 2 of the 3 businesses were significantly underperforming and were no where near hitting there quarterly sales targets as the goal was to achieve a target in sales in 3 months but they only achieved 60% of the total amount required in sales and in a different department Paul got angry at Sunil as his department were less than 0.1% short of hitting there quarterly target which Paul was furious about. He also stated that he thinks that I was a great worker and I could easily do the same amount of work as 10 regular workers due to my productivity and also my simplifying of jobs to reduce tasks that are required to be completed to a fraction of the time that it usually takes to complete the task. I then spoke about the researchers jobs which is carried out by 4 different works at the company and asked James if he has heard of “web scraping”? He stated that he hasn’t heard of it and I say to him that web scraping is where you do a search result on a website and then you use the web scraping tool to pick out what pieces of data that you want to pick out and then select scrape and it gets the pieces of data that you need and compiles it in a excel file in a matter of minutes and also contact one of the researchers about this before I leave the business. Also on my final day I state this to a different worker and state that this would be beneficial to the business as it would require less workers to do that job in less time to complete saving the business money on wages and then after that you can then send this excel file to the workers in the sales group and they can then use mail merge to these businesses therefore allowing you to contact more businesses in a shorter period of time and then some of these businesses then might offer viewings and then a smaller amount will put down potential offers and then these offers might potentially lead to sales which would then lead to increased sales and a higher profit. \n\nApologies about the length of this text as it took me a while to type up as hope that you enjoyed it as it was a very toxic place to work and had a high turnover of staff in general and look forward to reading anyone’s comments.",
    "title": "Toxic workplace environment",
    "subreddit": "WorkReform",
    "timestamp": 1696187160,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "How do you long-term recover from a botched FBI investigation that ruined your career and your reputation? I’m 57 y.o. male, empty nester living in a fairly typical American metro area. My wife and I currently make right at $200K a year, with my salary around $130K and my wife's at 70K. We have two grown daughters and two grandkids, each of our daughters married with one child. I am the oldest of four siblings, one of of whom live nearby. I have an earned doctorate in a field I no longer am involved with.\n\nTen years ago, I was forcefully removed from my dream career by a botched multi-year FBI investigation that was widely publicized and ruined my name in my industry. At the time it occurred, I was on a rocket ship upward, making $220K a year, about to be able to name my own price and become a true leader in my small, but active field. As a result of the investigation (which played out in the media) I was fired and also headed to prison before the authorities realized it wasn’t correct and quit it with me, dropping all charges. But the reputational damage was done (Google is not my friend) and I had to completely start over. My wife and I lost our savings through the process and went into deep debt, borrowing a bunch of money from family to pay attorneys fees and to relocate. It's now been ten years and although, between the two of us, we've made up 80% to 90% of the annual income we used to make, we still have very little in savings. Our debt load is still right around $100K in federal student loans (about $150K in consumer debt and lawyer's fees paid off) and we are long-term renters, having completely missed the real estate boom during Covid due to lack of funds for a down payment. Ironically, I will get a somewhat solid pension from my former life, but it doesn't kick in for another three years and we already realize all we'll be able to do with it is keep working, continue to pay down debt and save, save, save for multiple years after that.\n\nAfter bumbling and stumbling through the first couple of years after the immediate crisis passed (relocating to a different region, getting help from my extended family), I had dropped so far down the ladder that I was doing door-to-door sales. I had applied for 500+ jobs, to no avail (see above about google). Finally, a good guy I'd met offered me a junior sales position at his small pest control company, which had me doing cold calls and door-to-door sales. I got lucky one day and knocked on the door of a man who was an executive for a light manufacturing company (eight factories across US) and he was looking for a corporate purchaser/buyer. It was a private company - no board to impress, and - after getting to know me - he was able to convince the owner to hire me. I was grateful for the position, even though the person I replaced didn't even have an associate's degree and the pay was $65,000 a year. I was just thrilled to find a \"spot.\" I was determined to make it work. \n\nI've now been with that company seven years and have been able to show my boss (now the CEO) and the owner that I have a lot to offer. My salary has doubled and they've given me wider responsibility over the years (I am now in charge of much of the HR function for the company - the hiring and onboarding, along with the purchasing). The problem is, bluntly speaking, I find little value in my job and don't enjoy it. It's a terrible fit for me - the only reason I do well in it is because it's extremely easy. I'm a people person but all I do most days is answer email and fill out purchase orders. I do enjoy the HR function, but it's probably only 20% of my position. 80% is doing a job that - if they posted it on Indeed - would require only a HS diploma. I don't enjoy going to work, and liken it to getting grounded to my room to do homework all day, every day. I literally go into my office, shut my door and do paperwork until it's time to go home. I used to have a staff of hundreds of folks, now zero people report to me and I do paperwork all day. I know it sounds like whining, but the reality of it for me is quite difficult.\n\nBut, as they now pay me a solid salary and, as I have no significant savings and a ton of debt, I just keep getting up and going to work. And this has been going on for YEARS. I’m 57 now and have basically sleep-walked through my professional life the past seven years - ever since I turned 50. All of my younger siblings (I'm the oldest of four) have now zoomed past me financially and professionally and just shake their head about my sleep-walking - \"get your shit together, bro\" is a line I hear fairly regularly.  I’d love to quit and do a “third” career, but very gun shy and probably suffering a lot of PTSD (and depression) regarding professional risk.\n\n\nI feel I have so much more to offer. I don't want to continue sleep walking. I want to WAKE UP and get into a professional endeavor that I enjoy, contributes to the community and pays well - I want to utilize my skills the way I'd spent 25 years preparing and then accomplishing. I know a big piece of the advice coming is \"life sucks, just keep going\" and also \"well, if it's that bad, quit everything and trust yourself to try starting over again.\" I guess what I am looking for is something in the middle (aren't we all?)  **I’d love some advice.** Thanks.",
    "title": "How do you long-term recover from a botched FBI investigation that ruined your career and your reputation?",
    "subreddit": "careerguidance",
    "timestamp": 1702399892,
    "score": 178,
    "keyword": "man lawyer"
  },
  {
    "text": "Best careers and degree for someone with high visual spatial intelligence? Best career and degrees for someone with high spatial intelligence?\n\nHello, I am a lost 30 year old(feeling time is flying) man looking for guidance.\n\nCurrently I am unemployed, but have a little hope(because I know that I can get in to university thanks to my countrys SAT-test.) so there is a little light in the tunnel. But, I don’t know which degree and career to choose?!\n\nI want to make the most out of my abilities(talents) which is:\n- Spatial intelligence/abstract thinking(strongest).\n- Organization.\n- Teaching ability.\n- Communication.\n- Absorb and remember large amount of information.\n- Long term memory.\n- Make people laugh (relationship building).\n- Leadership.\n- Determination, if intrested in subject.\n\nThe degrees and careers I asume would be a nice fit is:\n- Computer and system science, specialization on enterprise systems(ERP) = Solutions architect/IT consultant.\n\n- Business administration, major in finance = Investment banker/management consultant.\n\n- Master of law = Corporate lawyer.\n\nMain goal: get rich!",
    "title": "Best careers and degree for someone with high visual spatial intelligence?",
    "subreddit": "careerguidance",
    "timestamp": 1692790273,
    "score": 3,
    "keyword": "man lawyer"
  },
  {
    "text": "How do I deal with my violent boss? \nI am 28f and the boss in question is 45m. He got extremely angry, abusive and even violent toward me the day before New Years break. This is a family business so his father is the owner, and his younger brother helps his father run the business. 45m is rarely there.\n\nIt all started with a call from a customer saying \"hi, we bought a machine from there last year after Thanksgiving, here it's New Year the next year and I'm STILL missing the light bar\". I tell the customer I'll look for it and to call me back at her leisure. A few hours later she calls, and I answer \"hi ma'am, unfortunately I wasn't able to find the light bar, let me speak to my boss (45m), who sold you the machine and I'll find out if he put it somewhere special for you\". This of course didn't sit well with the woman and she started making threats about lawyers. I put her on speaker for another boss and the secretary to hear both sides so that there could be no accusations or issues. We decided that I'd speak to my boss about a refund for the lights instead. However upon hanging up I remembered I had previously done inventory on small whole goods and it may be on that list with a location. Thankfully it was. I found it and called her back but got no answer. \n\n3 minutes later my boss (45m) calls. I answer the phone and he begins by saying \"I got a call from a Mrs.____, who says she hasn't got her light bar she bought from there LAST YEAR!\" I say \"yeah I actually just found one, I tried calling back but got no answer, she's being a bit of a c***, but I put her on speaker for others to listen and remained professional\" he says \"well she has been perfectly nice to me and YOU DO REALIZE SHE HAS HAD TO GO TO ANOTHER DEALER TO GET STUFF BECAUSE SHE CANT GET IT FROM US\" I respond \"yes, but you realize this wasn't my sale right? It was yours, you sold it to them\". This of course makes him even more irate and he yells loud enough for his brother and the secretary to hear thru the phone \"DONT START YOUR FUCKING SHIT WITH ME DONT START BEING RUDE DO NOT MAKE ME COME UP THERE!!\" to which I respond \"Well I mean.. come up here (insert name of 45m), but I didn't even do anything..\" he screams \"OKAY!\" and proceeds to hang up on me. \n\n15 minutes later he comes FLYING into the parking lot in his company truck, jumps out with his chest puffed out, fists clenched and teeth gritting together - ready to physically fight it appears. He BURSTS through the showroom door and in doing so nudges the Christmas tree and decides to go ahead and punch it over, then gets in my face screaming \"YOU WANTED ME UP HERE? NOW HERE I FUCKING AM!\" I said \"(45m name) what?? I didn't even do anything!\" He screams \"YOU GET YOUR GOD DAMN ASS INTO THE OFFICE IN HERE RIGHT FUCKING NOW\". Of course after the violent outburst, I'm not about to go ANYWHERE alone with this man so I say \"what? No! Why?\" He yells \"BECAUSE IM YOUR FUCKING BOSS AND YOU DO WHAT I GOD DAMN TELL YOU TO DO!!\" Being scared to death at what this man will do, again I said \"NO! I am NOT doing that!\", keep in mind, my 7y/o son is hearing ALL of this, along with his brother, the secretary and customers at the parts counter just outside the showroom. He then proceeds to walk aggressively toward me again, getting in my face and screaming \"IVE HAD E FUCKING NOUGH OF YOUR GOD DAMN BULL SHIT, YOU WILL DO WHAT I TELL YOU TO DO\" I respond \"NO, (45m name) I didn't even do anything, this was your sale, how was I supposed to even know she needed a light..\" before I can finish he continues screaming profanities and insults, all the while his younger brother just stands there with his head down allowing the violent interaction to continue. The secretary has left the room scared and uncomfortable and my son is nearby at the parts counter. My 45m boss then continues screaming saying something about how I'm fired, I better be getting my shit and leaving (which I do, although his father, the owner, later rescinds because the son does not have this authority, especially when the father realized how bad this was and how wrong his son was). As I'm gathering my things he starts screaming again saying something along the lines of \"99% OF THE TIME WHEN I GET THESE CALLS IT IS YOUR SALE AND YOU DID FUCK SOMETHING UP\" I respond with \"(45m name) that's not true! My customers don't even know you, IF they ever had a complaint they'd call up HERE and speak to your father!\" His response seems to be an attempt to cover his a** when he says \"WHEN I FUCKING TELL YOU TO SHUT UP AND LET ME TALK, THATS WHAT YOU DO! WHEN I CALLED YOU GOT SMART ASS AND DECIDED TO SAY \"HA FUCK YOU GO AHEAD AND COME UP HERE!\" to which I responded \"THATS A LIE! YOUR OWN BROTHER AND SECRETARY HEARD THE WHOLE DAMN THING!\" He says \"WHATEVER, FUCK YOU. I SAID GET YOUR SHIT AND GET OUT\". So I yell for my son to come on, and we leave. \n\nThis family has ALWAYS been good to me. The father is an older, very wonderful man, the younger brother is the same, they are both family men and love their wives and children more than I think I've ever seen. Even 45m is generally a pretty good man, has loaned me money, let me borrow his farm truck to haul things, etc. I do not want to cause them ANY legal harm. However, I do need to do something. I need to feel safe working there and I currently do not. I had to work a few hours Saturday and spent the whole time panicking about whether he would show up being crazy for something again. I should add, this is NOT the first time he has had violent outbursts, its just the first time he has actually come at me aggressively, the man literally \"flinched\" on me twice as if he would hit me. Previously he has kicked a hole in my office door while screaming at me over selling a tractor at a price his father set because he intended to sell it for more and personally profit. As I said, I don't want to cause them any legal harm, I'm not even sure I could, but I do know that I want something SERIOUS done this time,  dealing with these violent outbursts is NOT okay, especially when he acts as though he is going to hit me. If something isn't done about it, I guess I'll explore legal options, but I'd prefer to keep my job and find some sort of solution. \n\nAny thoughts or advice?",
    "title": "How do I deal with my violent boss?",
    "subreddit": "careerguidance",
    "timestamp": 1672637109,
    "score": 3,
    "keyword": "man lawyer"
  },
  {
    "text": "How to switch from law to technology? So, I am trying to break into Tech. I have a bachelors of science in legal studies, worked at some firms in personal injury and wrongful death, went to law school and did well, but after 8 years in the field decided that I liked law, but not being a lawyer. \n\nI've done some limited coding that I taught myself and have some knowledge with Python, Docker, A.I., Large Language Models, and enjoy this, but also enjoy the hands-on systems and hardware support as I was my I.T. guys, right-hand man at the firm.\n\nI'm in my 30's and I don't want to go back to school, but I am looking for certifications and have no idea where to start. Maybe in DevOps?!\n\nAny help is appreciated!",
    "title": "How to switch from law to technology?",
    "subreddit": "careerguidance",
    "timestamp": 1693441024,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "Is it foolish to quit and reset? 10 years ago I set out to be a lawyer for a nonprofit organization that advocates for a cause I care about.  I managed to do that: I have the exact job I went to law school to get.  I’ve been doing it for several years and have been reasonably successful, including getting a promotion and multiple pay raises.\n\nTrouble is, I don’t like it.  Since day one of law school, it quickly became clear to me that the culture—the ethos—of this profession are not for me, and sitting inside at a computer all day is really, really, really terrible.  I want to spend my days outside, moving around, interacting with people and the world instead of staring at a screen.  Even though I LOVE and care deeply about my organization’s mission, I end every day feeling like another 8-9 hours of my life was wasted.  I have lots of non-work hobbies (various outdoor activities), which is great, but the 40+ hours/week spent working at a computer is just miserable.\n\nI’ve almost quit to pursue something else countless times, but I never have.  I think there are two reasons for that.  \n\nFirst, other jobs I think I might like doing—ecology or wildlife biology, agriculture, outdoor education—involve hurdles like returning to school, and they’d be significant steps backward in terms of earning potential, timeline to buy a house, etc.\n\nSecond, and perhaps more importantly, sitting inside all day makes me feel anxious, frustrated, restless, and generally crazy, so I’m constantly in a negative headspace when I think about what I want to do instead of my current career.  It’s like asking a starving man what he wants to eat for the rest of his life: his intense hunger makes him an untrustworthy judge of food.\n\nFor years now, I’ve been looping through this cycle of wanting desperately to quit and do something else, then feeling like the alternatives would not actually be a real improvement, then feeling grateful for the amazing things I have like stability, an income, and the mission I support…which quickly wears off and returns to me desperately wanting to get away from the computer and do something else.\n\nIn short, I’m stuck.  I’m now considering just ripping the bandaid off and quitting my job with no plan for what’s next.  I’d probably take a trip, spend lots of time outside, do some soul searching, then think about jobs in a few months.  (That’s doable financially.)  On the one hand, it feels utterly foolish.  On the other hand, I don’t know how else to get off the train.\n\nWhat do I do?",
    "title": "Is it foolish to quit and reset?",
    "subreddit": "careerguidance",
    "timestamp": 1681339339,
    "score": 1,
    "keyword": "man lawyer"
  },
  {
    "text": "How to quit job after boss purchases things he expects you to pay him back for? Like the title stated I want to quit my job, but fear my boss will come after me for financial retribution. \nBackstory is that I work as a RDA at a private practice general dentist office. I have worked there for almost a year, my current boss the dentist poached me from another office after 4 months of talking to me about getting my RDA, was only a DA at the time, he was my personal dentist before I got into the field so I thought it was an awesome opportunity to have a dentist I liked as a boss and he offered to help me pay for classes. He paid for a $400 class and I was extremely grateful and happy for the opportunity. Eventually he hired me and I was very excited my prior boss was not paying me my overtime nor even for my contract signed scrub pay which was only $40 but he refused. So I was relieved to have a new boss. (Yes I should have fought him, but my dad just died and I was not in the right mindset). So cue me starting my new job and being very taken aback that not only are the staff members rude to me right away but they all warn me that he makes everyone cry their first month at least and later he states this to me too. I’m a whole hearted team player and at this point just keep my head down and do my job, so I just try to have thick skin.  The other assistants are down right mean to me and one of the three hygienist tells me that my hair looks trashy and unprofessional so already regretting my decision but now I’m stuck because I don’t have a backup job. But the first month because the dentist is a control freak I am not allowed to assist at all, talk to patient or do anything other than observe, which I thought maybe was okay because I’m used to zero training and being thrown right in. Well in this month he offers to do Invisalign for me and says I need to practice scanning and get scanned so I know, he orders them and then says that $1,200 for lab fees is added to my account and my overtime can pay for it, at this point I already feel he is very hot and cold with everyone like an abusive bf who love bombs you and then is super mean. I immediately feel he did this right away neglecting to say he would charge me and implying it was free to trap me and I figured it out after the other assistant told me he paid $26k for her extended functions class but signed a contract that she couldn’t quite.so now I feel stuck, but I swallow this red flag because there are no other job opening and I owe money. After this the first time I assist him he literally rips instruments out of my hands smacking my hand in the process and yells at me over the patient. I get through the day after crying in the bathroom and the other assistants seem to almost revel that I’m getting yelled at. But I wait for everyone else to go home and I plainly tell him if he ever does that to me again, I will leave right then and he can mail my check. So he goes super apologetic and justifies that he is very stressed and is so sorry and he needs to work on his temper. This is when I know I am quitting, but I don’t have a backup. So I have him do all the paperwork to help me get my RDA and I start working on my resume. I get my RDA and still no openings other than peanuts jobs and elderly about to retire drs. So he doesn’t have an outburst that bad to date, but he is mean, rude, trash talks everyone and still will raise his voice in front of patients, fires numerous people out of the blue because he didn’t like them. My problem now for quitting if you have made it this far is that he made me order medical loupes, I had a sit down meeting and he said they were required for the job and I need them to stay working, I told him I cannot afford them and the best I can do is a $250 over glasses pair. He said he would pay for them and I can pay back over time, I again stated I cannot afford an 1/8th of my yearly salary for them and cannot and will not pay for them. To which he said he will pay for them, he just makes us pay so we are grateful for the things he does for us. He orders them over $3k and they are custom to only you. Now this is my fear, even if I leave them he is going to come after me for the money for “crossing” him by quitting, I haven’t even finished the Invisalign trays and my teeth are more crooked  looking now than before but at least I can have someone else remove the composite buttons off my teeth, I just have no money and don’t want him to issue a 1099c after me or have his lawyer come after me since he put the charges on my patient account I checked last week. I have an interview for a new job that pays over $6 more an hour and is 40 hours vs 32 with benefits. I make less than $1000 biweekly right now and can barely pay my bills, he promised me a raise but keeps postponing it. At this point love nor money would make me stay. This workplace is toxic and verbally abusive, I just want out. How do I quit without getting the full wrath of this crazy man? Thank you for any and all help.",
    "title": "How to quit job after boss purchases things he expects you to pay him back for?",
    "subreddit": "careerguidance",
    "timestamp": 1703760005,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "The fall out of my sexual harassment complaint Hi Everyone,\n\nA year ago, (December 2021) I posted on this page asking for advice around my boss sexually harassing me. I had contemplated writing up a follow up on this multiple times as I had further questions from others who were experiencing the same thing. I originally wrote an article the below to be an Article that I was going to submit to news agencies in my home country not the same country where the incident occurred. I for some reason decided against it, so I am posting some information here . It is quite raw and not my best writing as I struggled reading it due to the emotions behind it. \n\nLegally I am not allowed to say his name, so I will call him Perp (short for perpetrator). However, I am able to share my experience.\n\nPerp was not my direct manager but he was my senior, in a position of power and he had requested for myself to work on his future projects. My sexual harassment happened over a month. It started out with minor things. Perp would stop me mid-sentence to tell me how beautiful my eyes were. He would tell me how incredible and smart I was. He even asked me to go shopping with him to pick out jewellery for his daughter’s 21st  birthday, which I did not accept.\n\nIn hindsight, perhaps I should have noticed the signs and should have stopped him then to tell him he was being inappropriate. However, I was young, only 25, working in a male-dominated industry. My years of study and earlier work experience had conditioned me to this sort of behaviour. Perhaps, I also expected that if I had reported the matter or talked to my colleagues about it, I would have been told I was overreacting. So instead, I ignored the inappropriate behaviour and it continued. Until one day it went too far, and I ended up calling my mum at 1am crying over the phone.\n\nThe final trigger was that Perp, a 60 year old man, sexually propositioned me, (cornering me) a 25 year old women. I told him to stop. A co-worker who overheard the conversation also told him to stop and pointed out in clear words ‘this is sexual harassment’. But Perp in a drunken state waved them off and continued the verbal harassment getting closer to me.\n\nIt happened over a year ago and I still think about the incident and the resulting fallout.\n\nImmediately after the incident, I requested a meeting with my manager. But because it happened at the start of the Christmas summer holidays there was no urgency to hold the meeting, so nothing happened. \n\nAs an easy answer, I thought about leaving the company I worked for and applied successfully for another job. But advice from a trusted colleague convinced me to remain at work as there were great opportunities within the team that I was being pushed for.\n\nSo, I did what I thought was best and I confronted Perp. I decided this was the best approach as we had to continue working together and it was probable that Perp would become my direct manager soon and would be responsible for my career advancement and promotions.\n\nMore senior people in the company who had witnessed the incident supported this approach telling me I was brave and that they were happy because if I reported him I could ruin his life. During my confrontation with Perp, he apologised for his behaviour. He looked like he was going to cry and mentioned his wife many times. \n\nI may seem cold and unkind for eventually reporting Perp. Many people including family and friends have provided opinions and passed judgements on my reactions. I was and continue to be my strongest critic. I have learnt there was no right way to react to this, but walking away was not something I could do without feeling bitter. I was the victim so why should it impact my career?\n\nMy decision to report Perp for his actions came quickly and was not well thought out. I had been feeling guilty about what had happened. I was doing my best to avoid many people that were involved or aware of the incident, as though it was all my fault.\n\nPerp had previously self-appointed himself as my mentor and I stupidly continued with this agreement thinking it was a way forward. It was during our private mentor-mentee meetings when I realised I couldn’t continue to pretend nothing had happened. I was informed during this meeting that the promotion, I had discussed with my previous manager was no longer on the table as I would be working on Perp’s project and there was no budget for the promised promotion. I realised that I had been misled and that “this opportunity” was not what I expected it to be. It had already taken a lot of mental preparation to even enter a meeting that I was supposed to have regularly with him and the thought of working “closely” with him made me ill so I handed in my notice immediately. At the same time, I also reported the incident to HR.\n\nFrom the beginning, many friends (with no experience of sexual harassment) had suggested I report Perp to HR. Their reasons were, what if he did this to someone else or what if he did something worse to another girl? This reasoning angered me. It felt like I had been handed the responsibility for his actions. I really just wanted to just run away, which I did by resigning.\n\nWhen I reported the incident to HR I made it clear that it was only on the agreement that I did not want to be interviewed or asked any questions. I was reporting it only for their information especially as the company prided itself on its programmes to prevent and manage sexual harassment and discrimination.\n\nWhat followed was not what I expected nor what I thought we had agreed to. I wanted to quietly work out my notice period and move on. Instead, the company decided, after talking to head office, that due to the nature of the incident, they were proceeding with an investigation. There was no longer anonymity for myself as Perp was advised of the complaint and as were many of my colleagues who would need to be interviewed. I begged HR to wait until I had left the company or at least until I had found another job. Instead, I was told that due to the gravity of the situation, they could not wait. Initially, I refused to be formally interviewed and participate in any investigation. I requested that at the very they leave me alone and let me work my notice period in peace. I received phone calls and emails from HR every day. I decided to work from home as much as possible as I was still working with Perp on a project where he was my senior. We were often sitting in the same small site office, even sometimes on our own. Working from home only isolated me further. When I did go into the office, colleagues I used to have good relationships with were now strained and some even ghosted me.\n\nWhen the contact from HR got too persistent and bordered on harassment, I hired a lawyer to send a letter to demand they do not contact me except through my lawyer. The peace was a relief.\n\nTo rub salt into the wound, I then received a company announcement advising that Perp had been promoted for hisgreat work! This was despite the “active” investigation that was still ongoing. This angered me. I felt that my name was just getting dragged through the mud while Perp was being celebrated. \n\nWith my lawyers, we began drafting a Letter of Intent that detailed everything that had happened. The Letter of Intent was delivered, and we waited. Despite the company professing that sexual harassment and discrimination were important issues that will be dealt with promptly the process was slow and lasted over 6 months. I could not move on until things were finally resolved.\n\nDuring these 6 months, the company completed internal investigations which my lawyers and I refused to participate in. The company was finally convinced to engage an independent organisation to conduct the investigation. It was only after this that I agreed to be interviewed by anindependent organisation. The interview process was difficult. I insisted on receiving a prepared list of questions but even then, the interview did deviate. I felt like I was being interrogated and that my integrity was in question. \n\nPerp had the opportunity to deny anything happened. This was even though I provided texts of him apologising to me and asking me to forgive him. This was deemed not sufficient. He was not apologising for sexual harassment only for his behaviour it was decided. He accused me of being a flirt.\n\nWitnesses who were working under Perp were interviewed, but to protect their careers they were not as honest as they could have been.\n\nIn the end, we settled and did not need to go to court. The whole process lasted for more than 8 months, during which time my career was in limbo and I could not work. When it appeared, I may have to go to court I felt it was all too much and almost withdrew my complaint. However, my brother called me and convinced me to stick with it. He said he wanted me to be someone his young daughter could be proud of, someone who stood up for what was right. I am proud that I stood my ground, but the fallout was hard. I have allowed myself to move on and I have been able to speak to many friends about my experience. During this process, I have discovered harassment is not rare but speaking up is. \n\nWhat would I have done differently? Don’t trust Human Resources, but also don’t put up with little things. Stop the little things, and make it clear that these comments made you uncomfortable and that they are inappropriate. Record every little incident and ensure you send dated emails/texts to friends identifying when these have happened. If a large incident does happen talk to a lawyer first before HR, they can provide advice for free. Sexual Harassment is a lot more common than we think but we always laugh it off, and if we keep doing this, then it can escalate further.",
    "title": "The fall out of my sexual harassment complaint",
    "subreddit": "consulting",
    "timestamp": 1679166152,
    "score": 377,
    "keyword": "man lawyer"
  },
  {
    "text": "Lessons learned in 3 years of consulting I never really wanted to be a consultant so going to a big 4 company  was a huge step for me which I don’t regret at all and I count the 3 years I was there as some of the most impactful of my career. Just like many of you I learn by doing not book learning. Being ADHD and Dyslexic I see the world a little different than others. As a Solution Architect and Security information and Event Management lead it was a natural role for me as it utilized how I see Data as it ingresses, egress and moves lateral in a modern Ecosystem and how to implement it into some of the largest Data Networks in the world which was amazing and truly fulfilling. Like I told them when they hired me “My oath did not have a expiration date, even though I retired I still want to serve!” And they let me do that.\n\nBeing a data guy and a Vet I am a copious Note taker and wanted to share some rules I learned over the last 3 years.\n\n**Character is important:** We live in a world where every word is recorded, misinterpreted and lawyers go over every legal agreement and statement of work to make sure both parties are protected. To me I took a simpler approach “I give you my word that my team and I will help you” and so I did. I did not care about the white noise of the world but focused on keeping my word as that was their expectation of our services. At a certain point all the consultanting companies are the same so the clients just wanted to have confidence that we will do what we say and keep our word. Honor and Integrity are not concepts to be pulled out when they need something to be negotiated but are core to who we are as people and the company we represent. Do what you say and say what you do. Keep it simple. \n\n**Listen First, Talk Last:** The people I met were some of the best in the world. Day in and day out they are in the thick of the storm fighting the good fight. When they want to employ a consultant usually they have already figured out the solution but just needs us to validate or execute it as they are still in the storm fighting. I always told my folks “we are like the Coast Guard and they are the leaky boat in the hurricane. We fly in and help them patch their boats, give them a new motor, help them with their navigation to realign them to a true North Framework then we head to the beach for Mai Tais and volleyball until called again but they stay in the storm hopefully with a better boat then when we arrived.” They are always in the storm so listening first and understanding their challenges will help us integrate and help them with their challenges as we bring industry insight to them to hopefully stop them from bailing water all the time.\n\n**Lead, Don’t Manage:** This is ingrained in every NCO (Noncommissioned Officer) from day one. We are only as good as the people we work with. In a world where loyalty is based on the Fiscal year and the greener, shiner object across the street by leading your people and truly showing them that you are there for them they will work for you and stay with you and not be tempted by the grass is greener on the other side of the street. I am truly proud that I had one of the lowest attrition rates and a huge success rate while I was at EY but very little was me but my team pulling together as a team. Forgetting the normal politics and focusing on being part of the solution. Harry Truman once said “You can get a lot of things done if you don’t try to take credit.” They emphasized this on a grand scheme, and they all knew I was available 24/7 if they needed me and if need be I would jump in front of the bus for them over and over again as that is what a leader does. Managers just look at the team as assets and resources to be discarded when done. A leader Drives the team to become a team and think beyond themselves and protects each and everyone of them so they can accomplish their goals and live their passion in their chosen profession.\n\n**It takes a Village, Not a villager:** One of the earliest and most heartfelt lessons I ever learned was EGO is the destroyer. I can truthfully say there was not one day I did not learn something from my team and the people I came into contact with. When I look at a global Ecosystem / network it is a like a symphony to me. I can hear if the drums are to loud or the horns are out of tune or if there is a rogue soloist trying to make a name for themselves. They all come together in my brain but the crux is there is order in the chaos and you cannot have a symphony / great work of music if everyone is not doing what they are supposed to be doing. Very quickly as people align to the same page the music comes from being discordant to a thing of beauty and amazement. No single person can do it alone. The maestro is nothing without the orchestra. Everyday you can learn something new and everyone has a place in the digital symphony we call a data network.\n\n**Remove Fear:** Frank Herbert really nailed how to deal with Fear in dune; it is the “mind-killer” and in a modern organization it can be disastrous to the enterprise. Fear has no place when data is the truth. In the military we used to say “We trust but we validate” When lives are on the line we don’t guess and we don’t make decisions in fear as it will cost lives. In the modern world remove fear and focus on character and data. Data is truth and character will guide you. There can neve be a situation where you fear for your job or not telling the client or boss “Truth”. The world around us deals in “fake News” we don’t. We focus on the data and we “KNOW” before we elevate or recommend. We never shirk from our roles as the data gods as truth is our watch word and the foundation of who we are. Fear is the mind-killer and in a job where we are paid to think, fear is nothing more than an anchor that will weigh you down and prevent you from being the best you are able, when ever you are able. \n\n**The right Skillset to the right role to the right outcome**: The world of a modern Ecosystem is a diverse as the stars in the sky and everyone has a different skillset supporting their roles to drive revenue for the business. We should always strive to understand the skills to accomplish a task and never try to shove a person into a role that that they don’t have the skills to accomplish the outcome or the role assigned. In SOCOM we are surgical when we build a team and understand every skillset and the strengths that guide those skillsets to the mission outcome. Everyone has a role to play and every skillset feeds that to the ultimate outcome. In the modern ecosystem we should learn these skillsets and roles to support. \n\n**Be Honest and Authentic at all times:** So many times people told me I was known for being “authentic and honest” and I enjoyed that but it ultimately led me down the thought pattern “well what are others doing.” So many people put on a face for a client or change who they are for the company they support. Stop it! The clients don’t want that and you don’t want that. What is the point of reaching the end of the race if you lost yourself in the race. Be you. You are knowledgeable and know right from wrong just speak your truth and it will work out. Usually people will respect you more for it than just being another person on a call. I remember one time I got feedback from a client “I don’t remember everyone else on the call, but I remember the guy with the hat and the swords, He really got it and understood our challenges.” (for those who don’t know I have a collection of swords on my office wall and I always wear a ballcap, it is me.) Never be afraid to be yourself (unless you are narcissistic Asshat than maybe you should get into another line of work and a different viewpoint of the world.)\n\nI have other lessons but these were the ones on top of my mind. A very long time ago a great friend of mine (was my XO at the time and now 30+ years later still my friend) gave me a book “About Face, The Odssey of an American Warrior” written by Col David Hackworth. I was a young man when I read it and one of the biggest lessons I learned from that book was he used to carry a green book and in it he would write things are good that he saw in leadership and things that were bad. I did that for 20 years of military service and I continue today in the private sector. These are my lessons that I learned and are not meant for any individual or company but life lessons that I reflected on as I continue my Journey outside of consulting (went Vendor specific). They are not meant to change anyone’s mind or call anyone out (legal disclaimer in the world we live in) but merely sharing my wisdom on my journey. Remember it takes a village and my village is the world as we all have a part to play in it and we are better together, being alone only finds you wandering in the dark screaming for help. (alone does not mean not being a individual for those who choose to pick apart my words.",
    "title": "Lessons learned in 3 years of consulting",
    "subreddit": "consulting",
    "timestamp": 1678677773,
    "score": 288,
    "keyword": "man lawyer"
  },
  {
    "text": "How the hell does this profession deal with all the different bar exams/jurisdictions... I just don't understand how lawyers deal with the amount of immobility the bar exams impose on you. Moved out to Texas to go to law school. And even though that degree's got portability outside the state, my main job opportunities are in Texas rn.\n\nBut my entire family is back home in Florida. My mom and the rest of them want me to move back to Florida, but I've tried explaining to them that, with my grades (mid) and resume (pretty empty), I'd be a fool not to take the job opportunity I have in Texas.\n\nSo I'm thinking we'll maybe I'll work for two or three years, then move back home. But Florida's got no UBE, no reciprocity, nothing. Seems like the only option is to take the Florida Bar along with the Texas Bar in the same year (which, honestly, just... no lol I can't do that), OR just take one and say oh well and just limit my job hunt after law school??? Even if I get an offer in hand for a Texas firm, I can't even shop around in Florida just for comparison because nobody wants to look at a 3L / recent graduate unlicensed from another state. \n\nHow does any of this make any sense, how do people deal with the uncertainty? I jump through about 50 hoops to get here, and it seems like once I start practicing I'll just have to jump through even more. Do I just say fuck it, take Texas, and if I ever get the opportunity to move back, take the FL bar exam then? Sounds like an insanely huge pain to have to go back and relearn all of the useless subjects that I probably won't be using in practice. \n\nLike, damn, I just wanna be a lawyer, man.",
    "title": "How the hell does this profession deal with all the different bar exams/jurisdictions...",
    "subreddit": "LawSchool",
    "timestamp": 1690225839,
    "score": 198,
    "keyword": "man lawyer"
  },
  {
    "text": "Was law school worth it for you? Hey y'all,\n\nIt's that time of year to be going through horrible burnout and questioning your life decisions!\n\nI'm in my final year of school and have had a particularly horrible experience at a particularly predatory law school. I have never been so abused, manipulated, and backstabbed. I made big strides this past semester by distancing myself from students.\n\nHowever, the workload, the toxicity, the politics, and the debt still bother me greatly. I have to keep doing work I don't want to do that doesn't apply to my career. I have to keep giving money to an institution I loathe with a passion. The issue isn't whether I'm capable of finishing out (I've done pretty well in the face of immense trauma to be honest), it's whether I even want to anymore.\n\nAnd my big question is: is any of this worth it? Did anyone here have a truly awful time at law school that now has a job that pays decently without giving up your entire life? I don't need $200k a year here. I'm fine starting out at $75k and moving up. But if the profession is anything like the education, I imagine I will end my career with a revolver in my mouth.\n\nHow do some people feel now that they're in the working world? Did the bar ruin you life? Do you have a social life outside of law? Cause man, hanging with people whose entirely personality is that they are a lawyer is exhausting. \n\nAlso, sorry in advance if this post isn't written well or is confusing. I'm running on fumes here. \n\n&#x200B;",
    "title": "Was law school worth it for you?",
    "subreddit": "LawSchool",
    "timestamp": 1700257203,
    "score": 43,
    "keyword": "man lawyer"
  },
  {
    "text": "Civ Pro 2 Riddle Hey guys!\n\nMy civil procedure professor sent us all a riddle as a \"hint\" to one of our essay questions on our final. Wanted to see if anyone had any ideas? Here's the riddle (and thank you in advance):\n\n \n\nIn the dusty old west,  \nThree miners had a quest,  \nTo find gold in a mountain,  \nThat's what they did count on.\n\nThe first miner struck gold,  \nFilled with joy, he filed and told,  \nThe sheriff came and declared,  \n\"No one will mine this mountain, I have aired.\"\n\nThe first miner said, \"I'll sue,\"  \nHis words were bold, and he followed through,  \nBut the other two miners had a plan,  \nTo barge right in and show the court who's the man.\n\nThey hired a lawyer, with a cunning mind,  \nTo fight for their cause, and not be confined,  \nTo let the first miner take it all,  \nAnd leave them with nothing, no gold at all.",
    "title": "Civ Pro 2 Riddle",
    "subreddit": "LawSchool",
    "timestamp": 1682895170,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "Question for a criminal attorney? Hypothetically, let’s say a man was being investigated for missing people; his wife and his child. This man decides to lawyer up immediately, and confesses to his attorney that he had killed and disposed of their dead bodies, as well as their location. \n\nIf there is an active missing persons investigation and his lawyer knows where to find the bodies, would he/she still be bound to confidentiality? And if so, can/would they work their legal defense around this knowledge?",
    "title": "Question for a criminal attorney?",
    "subreddit": "LawSchool",
    "timestamp": 1677882280,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "Any CA non ABAers out there? And you feel like Saul Goodman could be your bff?\nI want to start a group so we have a pack when we graduate and are trying to pass the bar. All nonABA grads. We will wear American Samoa Law School sweatshirts and drink cucumber water in our huge firm. A law firm of 500 or so-\nAnd we get Kim Kardashian to fund us and put her on billboards with our law firm name- one of us will have to get a legal name change to match a name in big law, of course. We will be the baddest street wise kickass…Oh- I’ll bet we can find some parking booth ex hit man to be our official “investigator”. “If there’s not a loophole we will make one” -that’s our mission statement- because we clawed our way through law school with jobs, kids, sick parents, and no Socratic dialogue. We know law office tech because we don’t have books or a law library, so all the Boomer lawyers who never used GPT and Judges who don’t know why they can’t order illegal pics to be taken down from SnapChat because they have flip phones the same color as the Davenport in their office- will HATE us when we come to court because we don’t know where to stand—BUT when we get going we are like Rocky against that big Russian, clean cut, tech trained, rich genetic mutation in Rocky IV. Tough, smart, give-no-shits- lawyers, who haven’t slept in 4 years and hate the word reasonable! But we’ll defend all the outcasts, poor, underprivileged, didn’t go to Yale, good folks and Kim K. can subsidize their retainers. You in?\nWhat’s Latin for \nGo LandCrabs!!!",
    "title": "Any CA non ABAers out there?",
    "subreddit": "LawSchool",
    "timestamp": 1682842118,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "Some tips for aspiring stay-at-home wives I know that the two ppl in this video are white but the woman is a marriage and family lawyer and I’ve had black women friends get married and fall into this trap of not working and getting stuck in a bad marriage. I think they could’ve benefited from this advice. One woman had actually been holding her husband down through his SoundCloud rapper career and the minute he started making $125k, he told her she didn’t have to work, she stopped and a year later, he started being abusive, cheating, spending their money on other women and himself. Another friend has not had any problems yet but she just married a man who makes $80k as a paralegal and she thinks that’s going to be enough to sustain the both of them and her child while she just takes dance classes. I just don’t see that in this economy but go for it. She did kinda get stuck like this in her first marriage. Her ex made her quit college to take care of his girlfriend’s child. Just have a plan.\n\nBasically, the lawyer recommends a prenup or a way to save alimony while you’re married. I personally think it’s a good idea to find a passive form of income if you want to be a stay-at-home wife/mom.",
    "title": "Some tips for aspiring stay-at-home wives",
    "subreddit": "blackladies",
    "timestamp": 1703214983,
    "score": 346,
    "keyword": "man lawyer"
  },
  {
    "text": "Am I overthinking this or is this something you’ve experienced as well? Yesterday my mom met with a lawyer (an older white man) and she told me that at one point she corrected him on the price of one of her properties and he let out a loud sigh and rubbed his face with his hands the was someone who’s frustrated would. My mom called him out on the fact that he appeared to be impatient with her, to which he replied that he is patient. She also said he was acting as though she was trying to argue when she corrected him on the price of her property when she wasn’t at all and she didn’t say that to be combative in anyway. My mom was recommended this lawyer by the husband of a a former coworker (both white) and they’re very nice to her, so she was disappointed that she didn’t have the same good experience they had with this lawyer.\n\nAs she was telling me this, I was thinking that maybe his blatant expression of impatience and the fact that my mom’s white friends had a better experience than she did might’ve been due to some unconscious bias the lawyer had. As I’ve noticed in many scenarios some white people have a tendency to be less patient with people of color, and when I brought this up to my mom, she immediately understood and mentioned how this especially happens to poc who have an accent that isn’t native to the US. My mom does have a Filipino accent but it is more suppressed. I also noted that with him acting like she was trying to argue that I’ve noticed that sometimes white people may overexaggerate the actions of a poc, as I had a math teacher in high school who’s Filipina and I remember one of my white classmates acting like she was yelling when she was just talking at a higher volume.\n\nMaybe I’m overreacting or overthinking this but I have noticed many times throughout my life where white people were less patient when interacting with a poc (especially if they speak with an accent) than they are when interacting with other white people. My mom was thinking that maybe he just wanted to speak without being interrupted - which I get but I feel like the way he loudly sighed and covered his face was unprofessional and rude, so I feel like that was an overreaction to a small interjection as there are nicer ways to ask not to be interrupted.\n\nHave any of y’all had similar experiences or observations?",
    "title": "Am I overthinking this or is this something you’ve experienced as well?",
    "subreddit": "asianamerican",
    "timestamp": 1699571584,
    "score": 96,
    "keyword": "man lawyer"
  },
  {
    "text": "Chris Avellone receives 7-figure settlement win after deceitful sexual assault allegations made against him EDIT: The post title should read \"sexual **misconduct** allegations\", not \"sexual assault allegations\".\n\nEDIT 2: I originally wrote that the settlement included money for the lawyer fees that Chris incurred, but as pointed out to me, it appears that it was the lawyer fee reimbursement *awarded* to his accusers that they are actually paying back to Chris, and that are included in the seven-figure amount.\n\nAnother day, [another false accusation exposed](https://chrisavellone.medium.com/joint-statement-from-karissa-barrows-kelly-bristol-and-chris-avellone-3b2138e5837f).\n\nThis time it's Chris Avellone, a fairly well known game developer (Fallout 2, KOTOR 2, Fallout: New Vegas, Prey (2017), Planescape: Torment, and others), who was falsely accused, and has finally won the battle to prove his innocence. The seven-figure settlement in this case unfortunately includes the lawyer fee reimbursement from a previous decision, ordering Chris to pay for the lawyer fees of his false accusers, that they are now having to pay back to him, so he likely didn't get much – if anything – on top of paying his own significant legal expenses. He probably would have been better off financially if he had spent the time working minimum wage at a fast food restaurant. Still, it's good that those who wronged him experience *some* accountability for their crimes.\n\nFor those who aren't aware, Chris got fired from every game project he was working on at the time the allegations were made public three years ago. The gaming media (PCGaming, Kotaku, etc) ran with the headlines non-stop, and signal boosted the lies without any compunction. Yet I'm sure we won't see more than a peep from any of them with a correction, and fat chance of an apology or any self-reflection on their part regarding how they destroyed an innocent man's career.\n\nNow here's the part everyone absolutely needs to read in the statement issued by the admitted liars:\n\n> We wanted to support women in the industry. [...] We are passionate about the safety, security and agency of women, minorities, LGBTQIA+ persons, and every other community that has seen persecution in the video game industry.\n\nLOL. We're good people, honest! We made up deceitful, fraudulent claims to destroy an innocent man, but please believe us now when we say that we only did it because we're just too caring and altruistic!\n\nYeah, no. How about you have no more credibility, and I don't believe a single thing you're saying, now, or in the future. Seriously, how these awful people can show no remorse for their crimes is insane.",
    "title": "Chris Avellone receives 7-figure settlement win after deceitful sexual assault allegations made against him",
    "subreddit": "MensRights",
    "timestamp": 1679752210,
    "score": 1096,
    "keyword": "man lawyer"
  },
  {
    "text": "Supreme Court Sides With Woman After DNA Test Shows Husband Isn't Father Here is the full link : [https://www.ntv.com.tr/turkiye/yargitaydan-emsal-karar-10-yil-sonra-cocugu-olan-adam-dna-testiyle-gercegi-ogrendi,jvWtgqaJx0iP4TRG\\_72OyA](https://www.ntv.com.tr/turkiye/yargitaydan-emsal-karar-10-yil-sonra-cocugu-olan-adam-dna-testiyle-gercegi-ogrendi,jvWtgqaJx0iP4TRG_72OyA)\n\nMustafa Y., who lived in Taşkent district of Konya, Türkiye married A.Y. (38), through an arranged marriage in 2005. Before getting married, Mustafa Y. had a health issue and underwent a surgery that doctors told him was necessary but could make him unable to have children.\n\nMustafa Y. and A.Y. did not have a child for 10 years. He started an herbal medicine treatment that he saw on TV. During this time, his wife A.Y. said she was pregnant. Mustafa Y. was very happy to have a child and even bought a  car on loan for his wife's comfort during pregnancy. A.Y. gave birth to a girl in a private hospital in July 2015 after the pregnancy period.\n\nLater, the arguing couple decided to divorce. When A.Y. filed for divorce, Mustafa Y., on the advice of his lawyer, asked for a DNA test for the child, saying he couldn't be the father due to his health issues. The DNA test and forensic report in September 2019 showed he was not the father. In January 2020, Mustafa Y. filed for divorce and cancellation of paternity.\n\nThe lawsuits were combined. The court granted divorce but ordered A.Y. to pay 40,000 TL in material and moral damages to Mustafa Y. A.Y. The appellate court canceled the compensation order but  ordered Mustafa Y. to pay A.Y. monthly interim alimony of 400 TL until divorce finalization, and a one-time poverty alimony of 12,000 TL in favor of the woman.\n\nMustafa Y. appealed this decision to the Supreme Court. The Supreme Court reversed the lower court's decision, saying Mustafa Y.'s  adultery-based divorce lawsuit  was filed outside the 5-year statute of limitations, so the woman cannot be found at fault for adultery. Considering the case file, the man could not prove any other faulty behavior by the woman, so she should have been awarded appropriate material and moral damages, which the lower court failed to do.\n\nMustafa Y. said that he suffered trauma when he learned the child was not his. \"I had a stroke. I was in the ICU  for 20 days during the  pandemic period. During this time, doctors told my relatives that I only  had a 20% chance of surviving. After getting  out of the ICU, I couldn't speak for a while, and I still have weakness  in my right hand. This has become permanent after the illness.\" This incident caused him  about 1 million lira in financial loss. \"I still can't accept this, I can't sleep at nights. I don't know at all who the father of the child  is, but I'm curious. Let this person come forward and serve the  punishment for the torment they have caused me. They can't restore my  health but they should face the consequences.\"\n\n&#x200B;\n\n&#x200B;",
    "title": "Supreme Court Sides With Woman After DNA Test Shows Husband Isn't Father",
    "subreddit": "MensRights",
    "timestamp": 1689433562,
    "score": 415,
    "keyword": "man lawyer"
  },
  {
    "text": "Friend's been married for 8 years but since the 2 toddlers, wife became insufferable to live with. He filed for divorce and she went MORE NUTS and made a FALSE domestic violence report. He lawyered up but can use all the help he can get at this point to see his kids. This is not just my friend but a close relative who I grew up with and have witnessed this situation unfold over the years. I am just going to call him Jim. This is in the state of California for those wondering.\n\nBackstory: Jim is a self-made man, has an online business with about a $4 million net-worth best I can estimate. He is the nicest and most self-less person you will ever meet. He does anything and everything for everybody, *definitely to a fault.* (This is his biggest problem, which he realizes, he doesn't yell, he says yes to anything and doesn't put his foot down.)\n\n* Everybody warned Jim not to marry this person 8 years ago because she seemed extremely conniving, calculating and controlling. She is a legal assistant and paralegal for a powerful law firm and is surrounded by sharks and is definitely a shark herself.\n\n* In their first year of married, she manipulated him to break-up his business-relationship with his own brother (who was a partner). Our suspicions were that she did that to have access to more money in case of a divorce (so she wouldn't have to split up any money with the brother).\n\n* Years passed and their relationship was stable and he was consistently building his business (on his own) and making a lot of money. \n\n* The wifes family is full of dead beats who DO NOT WORK WHATSOEVER. The wife convinced Jim to help support them. **He bought them a town house.** Now the wifes parents and deadbeat brother (who is a heroin addict) all live in that house, *rent free, all expenses paid.* Jim pays the mortgage for his own house and their house (as well as the mortgage for his warehouse.)\n\n* Fast forward some years and they have a child with IVF. One year after the child is born, she finds out she is pregnant. They thought this wasn't possible because the natural route wasn't working (hence the IVF).\n\n* The kids are difficult. Not just needy (naturally) but very likely to do tantrums and just be very extra (they're covid babies, not socialized well and spoiled to hell). The pressure builds up to obscene levels for everybody. Jim begs the wife to quit her job so she can just focus on the kids because he can support everyone financially. She refuses because she doesn't want to lose her place in that firm she's built over the years.\n\n* Wife asks her mom to help take care of the kids as well and she does it *begrudgingly* (she's not a sweet \"grandma\" archetype). (Note, both mom and grandma are both extremely controlling people, so they butt heads A LOT in the house and cause more drama.)\n\n* The situation continues to spiral out of control. The mother in law is a bitch and is ordering Jim around. The kids are very difficult and the wife is losing her mind unable to handle them. The husband hires a therapist for her AND himself. The therapist prescribes her medication (she is taking Lexapro, Lorazepam, Adderall). And, she has started smoking weed nonstop throughout the day as well which is extremely easy to get in California legally.\n\n* She says she can't handle the situation and we need a nanny. Jim says no problem. **Wife says we need TWO nanny's.** Jim says WTF but again, says OK. She gets two nanny's.\n\n* The wife told him to find a *psychiatrist* because \"you need to be on medications.\" For the record, Jim has never taken drugs (even recreationally). Jim disagrees but to prove her wrong, finds a psychiatrist and explains the situation. Psychiatrist concludes, \"Jim, I see no reason for you to be on medications. You're doing everything properly for your family and handling things all right despite the stress.\" This infuriated the wife.\n\n* Jim is absolutely loathing his wife but is doing all this because he loves his kids. Even with the help of nanny's *and* the mother in law, he gets home from work everyday at **230pm** to be with the kids and take care of the house, he even washes the dishes and vacuums and all that shit.\n\n* He can't take it anymore. The wife is absolutely bat-shit crazy and extremely controlling over *everything.*\n\nJim says he is going to file for divorce. \n\n* Wife goes fucking crazy. She becomes more of a shark and her insane lawyer-side kicks in. Starts purposely doing everything she can to push his buttons, make him angry, make him yell, make him lose his cool and always **immediately whips out her phone and start video-recording him** to see if she can catch him doing something wrong. (To make him look like a bad father to get full custody of the kids and all the money she can, presumably.) \n\nThe situation continues to worsen. He wants to speed up the divorce but it's complicated (there are multiple properties in their name, one of which the wifes family freeloads and lives in and a fuck load of money in the bank accounts).\n\n* So a few nights ago he is taking care of 1 of the kids upstairs and she is supposed to be taking care of the other downstairs. He goes downstairs to find the kid is alone, unsupervised and she is in the garage. He texts her \"what are you doing\"... she says \"working\"... He opens the door to find her smoking weed. And he is at his wits end. He says where is the weed give it to me. He tries to grab the bag of weed and she puts her hand on his arm to stop him and he says let go of my arm and pushes her away (NOT VIOLENTLY) and she goes fucking CRAZY and Jim starts audio recording her going hysterical. You could hear her screaming \"I finally have evidence, fucking finally, wow, wow wow THANK GOD, AFTER ALL THESE WEEKS\" and she calls the cops to say her husband tried to strangle her. (I heard the audio recording, to say hysterical is an understatement, the women is beyond unhinged.)\n\n* Cops arrive (it's 9pm). Cops interview them in separate rooms and jot down their stories individually. She says she doesn't want to press charges. Cops tell them it doesn't matter, California law dictates we have to remove the man in these situations. He is sent to the local jail and spends most of the night in a holding cell in his undershirt and flip flops. After a few hours, family scrounges up the cash to pay the $25k bail to get him out of there. He is battered and destroyed emotionally, and of course, with no sleep.\n\n**He lawyers up with a criminal defense lawyer. Lawyer says do not go back home for the weekend and do not contact her.** So now he is staying at his own mothers house. He doesn't have access to his car, clothes, kids, nothing. He has access to the home-cameras outside the house. He saw child protective services come in their house from outside and after a few hours left and he thought they were going to take the kids away but didn't. \n\nThis morning he can hear the kids screaming since 7am until 1pm on *FATHERS DAY* and he knows they are missing him and he knows what he needs to do to make them chill (take them out to the park or get ice cream) and it's absolutely the saddest thing that he can't do anything about it. He sees the deadbeats family is over, outside in the backyard smoking cigarettes and using his BBQ to cook shit, while he is ordered to stay away. **(The wife hasn't even texted her once or contacted anyone else to even know his status! His lawyer said that is very strange.)** He heard the wife saying I feel so guilty\" (in regards to him going to jail) to the family, not sure if that means anything but he feels powerless and is feeling beyond shitty. He can't speed up the divorce until this stupid hearing for a \"trial\" (which is now the DA's decision whether he is going to pursue it for a potential misdemeanor or felony) goes through. \n\nWhat the hell can he do!? How can he have the upper hand in the long run with this bitch? This is insanity!!\n\ntl;dr: Nice guy who works hard married a manipulative cunt with conniving lawyer-level skills. Even bought the wifes deadbeat family a house for them. They have 2 kids. She can't handle them. Got 2 nanny's. He works only until 2pm and does everything physically and materially to raise them but wife is insufferable and absolutely nuts and became 10x more insane when he filed for divorce and started purposely to get him angry to catch it on camera and build a case against him. Few nights ago she made a fake report for domestic violence when he was trying to grab her weed because she wasn't watching the kid properly. He spent a night in jail and now can't go back home to his kids while the deadbeat family gets to just vacation there.",
    "title": "Friend's been married for 8 years but since the 2 toddlers, wife became insufferable to live with. He filed for divorce and she went MORE NUTS and made a FALSE domestic violence report. He lawyered up but can use all the help he can get at this point to see his kids.",
    "subreddit": "MensRights",
    "timestamp": 1687132092,
    "score": 275,
    "keyword": "man lawyer"
  },
  {
    "text": "Debunking the myth that women cheat because they \"weren't feeling loved\" or because he's a \"bad boyfriend\". This is a big myth that many people promote, including feminists. If a man cheats, he's a shitty person and a womanizer, but if a woman cheats, she wasn't feeling loved and was dealing with a bad relationship.\n\n[Contrary to popular belief](https://www.researchgate.net/publication/265950325_The_Opposite_of_the_Double_Standard_Gender_Marriage_and_Adultery_Prosecution_in_Late_Medieval_France), society never had a double standard giving male cheaters a pass. In fact, historically, they punished them just as often, if not more than female cheaters. [You also weren't historically allowed to kill your cheating wife](https://www.jstor.org/stable/24771507#metadata_info_tab_contents), and if you were, you had to catch them right in the act, react in a fit of passion right away and kill even the cuckolder. You could never kill only her or kill her premeditatedly. Many societies didn't allow you to kill her, period, even if you killed the cuckolder.\n\n[A lot](https://www.psychologytoday.com/us/blog/after-service/201910/are-women-and-men-more-likely-punish-male-cheaters) [of evidence](https://www.americansurveycenter.org/a-moral-double-standard-on-marital-infidelity/) has shown people are more lenient towards female cheaters. Many people believe she wasn't feeling loved or he must've been a bad boyfriend. Some surveys show this is the case, but this is often self-report and many women could experience a social desirability bias. They often could lie to get sympathy. Also, many women might feel their reason has to be an emotional reason so they aren't a \"whore\". [According to the New York Times](https://www.nytimes.com/1997/10/12/magazine/adultery-s-double-standard.html), Eleanor Alter, a prominent New York divorce lawyer, says of her 30 years' worth of clients: ''Women are more likely to use the word love to justify adultery to themselves. You have to be in love. Otherwise you're a whore.'' Raoul Felder, another prominent divorce lawyer, says after 39 years of watching people who have committed adultery: ''**Women are motivated by the same forces as men** \\-- loneliness, hostility, boredom, the need to feel younger and attractive, the need to be worshiped.''\n\nThis one [study](https://www.dailymail.co.uk/sciencetech/article-11417879/amp/Affairs-boost-self-esteem-life-satisfaction-youre-woman.html) found that women who cheat have a boost in self esteem after cheating but men who cheat feel worse after cheating. They concluded it could be because women who cheat felt dissatisfied with the relationship. It sound that couples who cheat usually had more relationship conflict as the relationship went by, but it didn't clarify who was causing the conflict, which could've been the cheater. The reason why women had an ego boost after cheating was probably because studies show women are more likely than men to be sexually bored after a while in a relationship, not because \"men bad at sex\", but because women crave novelty and usually need to have sperms from multiple men in case they're with one who has bad quality for offspring. Because women eventually get bored more than men being with the same person whereas society is harsh towards male cheaters, that's why women become better in self-esteem after cheating but men become less so. It's not because women were dealing with bad boyfriends. One 2011 [study](https://kinseyinstitute.org/pdf/Infidelity%20in%20hetero%20couples.pdf) found that women who were dissatisfied were more likely to cheat, but aside from possible social desirability bias, they found this was more true for male cheaters, but swept that under the rug.\n\nIn fact, many relationship experts will say that many cheaters still love their significant other and aren't always dissatisfied with the relationship. They aren't usually sexually dissatisfied either, maybe sexually bored but not sexually dissatisfied. [In fact](https://andreameltzer.com/wp-content/uploads/2019/09/JPSP-2018-McNulty-et-al..pdf), the most sexually satisfied couples cheat the most, and they then found that marital satisfaction was positively associated with infidelity among women (although marginally), but negatively associated with infidelity among men.\n\n**The conclusion is:** many people actually have a double standard favoring female cheaters. People never really had a double standard favoring male cheaters and viewed them as disloyal cads. Women and men cheat for similar reasons. Although some might feel a lack of love in the relationship or dissatisfied, they usually both cheat due to loneliness (which can happen in satisfactory relationships), boredom, hostility, the need to feel worshipped, craving novelty, or to feel young or attractive. Women usually will say they cheated to feel loved or due to a bad boyfriend to feel less like a \"whore\" or to get sympathy from society. People just think women cannot be antagonists and can only be victims, and people tend to view male cheating victims are unmanly, so people tend to defend female cheaters over male cheaters.",
    "title": "Debunking the myth that women cheat because they \"weren't feeling loved\" or because he's a \"bad boyfriend\".",
    "subreddit": "MensRights",
    "timestamp": 1678740854,
    "score": 271,
    "keyword": "man lawyer"
  },
  {
    "text": "Having to seriously consider selling my house because of property taxes and child support Before I start this, I just want to say that I've already talked to 2-3 different lawyers in recent months about my situation and they all agree I got a bad deal, but there's nothing I can do about it for at least a year, or until something major happens... like if I lost my job or something else like that. I can't seek a reduction for the time being, so just putting that out there... I'm coming here because I am seeking a safe place to vent and share since no one wants to hear a man complain anywhere else. \n\nOver the winter, my property taxes doubled and then in May, I was hit with a $7,000 escrow shortage. That was the same month that my kid's mom and I finally \"settled\" our custody and child support case and I was essentially coerced into having to pay $1,300 per month starting June, even though she knew and the lawyers knew that it was going to be very challenging for me. \n\nI say \"coerced\" because I was told that if it went in front of a judge, that her lawyer was going to seek lawyer fees and basically throw the book at me and ruin my life entirely. This would have been on top of my own lawyer fees and costs. Before all of this, I was paying between $850-$950 per month, voluntarily. \n\nFast forward just five months and I've gotten to the point where I feel so much financial stress and anxiety that I lose sleep nearly every night. I have gained weight. I have allowed my house and yard to become messy and unkept. It's almost worse than depression because in this situation, there is nothing that you can do to change it. And the irony is that the extra $300-$500 I'm paying my kid's mom has no impact on her lifestyle: she is making $150K per year between salary and bonus. \n\nI've been talking with some people (agents and friends) about selling my house, and either buying something smaller or just squirreling the money away in a high-yield savings. The hopeless is so hard to live with though. I honestly hate working and have had a very bumpy career and had hoped to \"retire\" in 3-4 years, or do something like /r/baristafire where I work just part time, but now it feels like I'll never be able to retire. It feels like I need to sell my house just to pay off my growing credit card debt, tax debt, and child support. \n\nI don't know what to do... I've been freelancing on the side and started doing a cash-only side hustle recently, but now I just feel totally burned out and drained. It's affecting my sleep and my performance in my primary job. How does burning out the child's father, putting unnecessary financial stress and emotional stress on him help the child? None of this makes any sense or seems just or right at all.",
    "title": "Having to seriously consider selling my house because of property taxes and child support",
    "subreddit": "MensRights",
    "timestamp": 1697114082,
    "score": 237,
    "keyword": "man lawyer"
  },
  {
    "text": "Lawyer argues that it should okay for CPS to lie and fabricate evidence to take children away So, this is kinda tangent to [my last post](https://www.reddit.com/r/MensRights/comments/11ryojy/police_and_cps_illegally_enter_home_and_remove/) where cops and a CPS agent showed up at a mans door without a warrant or any kind of order and took away his kids.\n\nWe've all heard stories and seen video of State agents and their shenanigans regarding custody and accusations of abuse and bias, pre-judging based on sex and how the court system regularly goes above and beyond to screw people over.\n\nWell, [HERE YA GO](https://www.youtube.com/watch?v=twnLK5uMz4o&list=WL&index=1). An actual lawyer arguing before a panel of 3 judges that the State agents should be able to lie, COMMIT PERJURY, in order to seize someone's children.\n\nBut fortunately the judges are having NONE of it.\n\nIt leaves one to wonder though, how often do they lie and get away with it? How often are they caught and punished for it? How many lives are ruined because of it? How many judges think it's actually okay to lie to people as long as they work for the government and \"have peoples best interests at heart\"/s?",
    "title": "Lawyer argues that it should okay for CPS to lie and fabricate evidence to take children away",
    "subreddit": "MensRights",
    "timestamp": 1678982736,
    "score": 189,
    "keyword": "man lawyer"
  },
  {
    "text": "Woman assaults me in the testicles, and there are no consequences? I’m posting here looking to see if anyone has any legal advice for me, because I’m pretty fed up with having been injured in the testicles by a woman being seen as funny and not being taken seriously.\n\ntl;dr: Woman assaults me(male) with a groin attack unprovoked, police refuse to do anything, injuries sustained have caused me serious pain and impacted my life, lawyers don’t seem interested in offering me any counsel.\n\nBackground:\n\nLast month while staying over at my girlfriend’s house and enjoying a bottle of wine together, she had me go to the kitchen for her to get a cup of ice. As I was doing that, her female roommate (who had been drinking vodka all evening with her boyfriend) stormed out into the kitchen. The roommate and my girlfriend were on bad terms and said roommate had apparently previously screamed at my girlfriend that same day. Roommate began drunkenly screaming in my face to “get the f%#+ out of her house.” I calmly told her that because I was a guest of my girlfriend (co-lease) she had no right to tell me to leave. Not wanting to be yelled at, I turned to go tell my girlfriend about it— but before I could walk away the roommate ran up behind me and kicked me between the legs as hard as she could.\n\nAfter that, I called the police as an entire scene broke out with my girlfriend defending me and roommate and roommate’s boyfriend began screaming in her face. While I was still on the phone with dispatch, roommates boyfriend pushed my girlfriend and was looking over her like he was about to hit her. I pushed him away from her, and told dispatch I needed first responders. \n\nWithin ten minutes two sheriffs deputies arrive and take our accounts, but weren’t interested in filing any police report— apparently because I’m a male calling them to report an assault by a female. In fact, they seemed more interested in possibly arresting *me* even though I’d done nothing criminal and was the one who had called them. I went to the sheriffs department the next day and had a sheriffs sergeant tell me, in essence, that I “should walk it off, at least it wasn’t a 6-foot Samoan man who had kicked (me).” Seeing the sexist attitude for what it was I asked him if I had done exactly what she had would I have been arrested? His answer, in plausible deniability fashion, was a condescending metaphor using my current job that “every situation is different and depends on the circumstances.” He refused to take a police report and to file a TRO.\n\nAfter that, in excruciating pain and barely able to drive or walk, I went to Urgent Care and waited for 3 hours only to be told I needed to go to the ER. After having a CT scan and an ultrasound on my scrotum, they told me that luckily I didn’t appear to have a shattered testicle or any testicular torsion. However, I did have a varicocele, hydrocele and inflamed epididymus due to the assault. After this, I waited a few weeks using ice packs and was unable to work or maintain my daily activities, not to mention have any form of sexual activity because of the pain. I then got a referral to see a urologist who ordered another ultrasound, and I am waiting for his office to set up an appointment with him because currently I am still in pain over a month later. \n\nI’ve tried calling attorneys but no criminal attorneys will take my case because I don’t have the cooperation of the sheriffs department to file a report. Personal injury attorneys haven’t been interested either because they’d probably prefer to handle $100k car accident cases. I’m at a loss of what to do to get any justice here for my loss of income, medical costs, and pain and suffering. Meanwhile the woman who assaulted me has been doing everything in her power to fuck with my girlfriend and otherwise enjoying her life feeling free of any consequences (especially because her career as a WFH therapist would be over if she had been charged with any type of assault and battery, which would be for the best as she makes fun of her male clients and talks about their personal info).\n\nCan anyone here advise me what I should do in these circumstances? I would truly appreciate some guidance.",
    "title": "Woman assaults me in the testicles, and there are no consequences?",
    "subreddit": "MensRights",
    "timestamp": 1682047804,
    "score": 164,
    "keyword": "man lawyer"
  },
  {
    "text": "Being Empathetic in This Society is a Burden I M(27), am a very introspective dude, who has a knack for overanalyzing situations often to a fault on a social level. Professionally, that is a different story, I am a first year attorney, and my job is to pick holes in arguments therefore my over-active mind works well for me in that department. Yet this bipolarity between my personal and professional life has really taken a toll on me. I have come to the conclusion, that I have been given a gift, and a curse in some respects, by being able to sense people's sentiments very easily. Some might say I am an \"empath\" and the more I look into it, I probably am. Empath is likely related to the word empathetic, and my whole life, I have been that way. I resonate with the downtrodden, and I almost always listen to those who are suffering with ears wide open. I am in other words, a good friend.\n\nHowever, I do not feel like my sentiments are reciprocated. Few people ever text me, and ask me how I am, or what I am up to. People very rarely ask me, in person, how things are going. The only people who do, are my mom and my dad, and in her own way, my dog. All I do, is work and workout. That is it.\n\nI don't have a lot of luck with women in relationships, and I know it is not because I am ugly or uninteresting. Like I said I will be frank. I am a handsome man, I know this. Women have on a relatively high number of instances have told me I am attractive. Also, I am a lawyer, and when I do tell people about my profession, they usually find my work to be fascinating. However, women almost always ignore me. They seldom look at my direction, and they seem to avoid eye-contact with me, which is pretty disconcerting, as it has me feel like there is something really wrong with me.\n\nGuys on the other hand, I tend to feel for them. I see that many men are suffering. I have actually found that most men, are searching for happiness but are isolated. They are actually the oppressed sex in general, especially in a large metropolitan American city. The expectations of men are over the roof, but no-one wants to hear about it.\n\nI am going to start being more aloof, if that is possible. I have no other choice, it seems like, but to harden my heart. The world has much beauty, but humanity is unsettling. People do not care for one another, and for those who do, they will often be ignored and taken for granted.",
    "title": "Being Empathetic in This Society is a Burden",
    "subreddit": "MensRights",
    "timestamp": 1694290998,
    "score": 108,
    "keyword": "man lawyer"
  },
  {
    "text": "Mistreatment of women in my country  \n\nHello girls, I'm Moroccan and I just want to let my thoughts about because I'm frustrated, I have observed that a significant number of Moroccan Muslim( my default assumption) men, and men from other Muslim-majority countries like Egypt and Algeria, treat women unfairly and disrespectfully. Some women also exhibit this behavior, but it is unclear what else these individuals have in common other than the religion, I'm trying to understand what is the common ground that they share. although it mostly has nothing to do with what Islam preaches. For instance, I have come across a Facebook group with over 200K members that refers to women in derogatory terms such as \" lmra hashak\" which is kind of hard to translate correctly but it means something along the lines of \" women are something disgusting, something you're sorry to see\" because the term \" hashak\" is mostly used while talking about donkeys or dogs  ,and \" 9hwya\" which literally means \" the brown girl\" but in a very offensive manner, obviously both racist and degrading because that's what their intention is while using it. Other Arabic groups share similar content, including pictures that are demeaning to women. Additionally, there was a post mentioning a national team competing in mathematics with only one girl and four boys, people left derogatory comments, calling women stupid. because there aren't more girls there, and because in my country it's known that girls mostly get higher grades and pass more exams than men, such as exam to become a lawyer teacher etc., so when there is any post about any team that contains more men than women they immediately make everything girls did worthless,  And It happens with any post where there is anything about women sadly. I always check the comments hoping I'm wrong, just to be let down. They also do not acknowledge women's achievements throughout history or recognize the success of many women who did not get the recognition they deserved due to historical discrimination.\n\nIt is disheartening to see that many individuals in these communities blame the victim in rape cases and even defend pedophilia. In my high school, I witnessed four teachers who slept with 13-15-year-old girls or even younger. I want to understand why such mistreatment of women is prevalent in these societies and why some individuals think it is acceptable. I had hoped that in other environments such as university, things would be better, but unfortunately, I was once again disappointed. Even my professors speak about women in a derogatory manner, giving examples of them being stupid, crazy, and so on, even when the material they're teaching is unrelated to such topics. When they ask my mostly male classmates if they agree, they laugh and make even more offensive remarks. Some even go as far as to suggest that they would do worse things themselves.\n\nI once even tried to stop the professor and all he did was telling me \"you'll understand why men are better when you get married\". \n\nI just want to know if it's okay for me to have hatred for men in my country, and all the ones with similar mentality, or am I wrong? because I don't know why even the girls agree with them, if there is a rape case, it's women's fault, if there's assault case, it's women's fault. etc.\n\nThere is also a whole group that has the hashtag \"#NoToMarryingWorkingWomen\" where they say they won't marry any woman who works, because she gets exploited by her director and she isn't only his, but his and the director's too, and that they don't cook, and won't find time to take care of the children and him, and because she will start to go out with friends etc.\n\nAnd the list goes on obviously. \n\nI just don't get the hatred, is this also this common in your countries?\n\n Examples of such posts that they share, I provided translation :\n\n[https://ibb.co/c8Rn9ZM](https://ibb.co/c8Rn9ZM) \\- this photo was taken from a video where a girl was walking with a skirt and some man lifted her skirt and obviously sexually harassed her and slapped her bottom. they call him king for doing so. and when this happen most men were saying the girl deserved it for going out like that.\n\n[https://ibb.co/wQwzDm3](https://ibb.co/wQwzDm3) : insulting an inventor, and the comments kept saying she didn't help them make WIFI, she just opened her legs.\n\n> [https://ibb.co/jwM9Cjh](https://ibb.co/jwM9Cjh) : as for this one, the post says \" does women deserve to and the answers are \" she does \" \"she doesn't\" and everyone picked she doesn't, meaning they stopped at \" she doesn't deserve \" referring to she doesn't deserve anything. \"",
    "title": "Mistreatment of women in my country",
    "subreddit": "Feminism",
    "timestamp": 1683878025,
    "score": 545,
    "keyword": "man lawyer"
  }
]