[
  {
    "text": "Ashamed of the industry I work in, and don't know how to fix it. Throwaway because I don't want this associated with my main account. \n\nI am a graphic design and successfully manage all of the marketing for a large start up in the vapor/e-cigarette industry. I had originally planned on leaving in May of this year, but decided I would ask for a raise and extend my lease one extra year so I can work on paying off all of my debt and building a better nest egg before I move. \n\nI can't stand the city I live in, and further, I am legitimately ashamed of the industry for which I work (Further compounded, I'm in the early stages of dating a nurse, and *man* do I feel scummy). To top it off, I'm just feeling lost. I can't explain this feeling of hopelessness as best as I would like to, but I'm so worried there won't be another design job when I go to look in 8 months time. Did I choose the wrong field? How do I escape?\n\nI know I'm being irrational, there will be other jobs out there and I'll be able to get interviews. I can't help my thoughts, though, and it all stems from this feeling of being dirty because of a dumb industry. I mean, shouldn't you be proud of your job?\n\nThis is a half rant, half looking-for-answers post. The logical answer to all of this is I take my new raise and work it for the next 8 months and save everything then move on with my life. But I'm so emotionally drained and I don't know how to fix this all. \n\nThanks for reading.",
    "title": "Ashamed of the industry I work in, and don't know how to fix it.",
    "subreddit": "jobs",
    "timestamp": 1490005150,
    "score": 1,
    "keyword": "man nurse"
  },
  {
    "text": "[Serious] What is your \"Man, doctors and nurses are heroes\" story?",
    "title": "[Serious] What is your \"Man, doctors and nurses are heroes\" story?",
    "subreddit": "AskReddit",
    "timestamp": 1493707916,
    "score": 2,
    "keyword": "man nurse"
  },
  {
    "text": "To the milk crate stranger at 7-11: Thank you I'm not sure if this is the right place to put this but I just really need to get this out there.\n\nI've been working my current job as a housekeeper at a private nursing facility for about a year and a half now. And I know this may seem weird but I love my job. My bosses couldn't be nicer. My coworkers are so loving and funny and supportive. And the job itself is really not that bad. I'm learning a lot and feeling like I'm actually making a difference.\n\nIn the time that I've been working there, I've never once had to call out sick. Sure there's been a few times where I've felt like calling out because of a bad headache or 'that time of the month' cramps. But I always had this sort of guilt, like, I finally have this job that I love and treats me right. To call out, I felt, that they would be disappointed in me. Also, as this not-yet-30 female who's only 4'8\", most of the time I feel like I constantly need to do more and prove myself. That I'm not just so kid who is constantly getting asked how old she 'really' is.\n\nAnyway, so yesterday morning, I woke up and found myself feeling not so well. I was feverish, lightheaded, and had zero appetite. But still, that little voice in my head said 'Don't let your bosses down. They've done so much for you.' So I pushed onward, driving into work and also stopping at the local 7-11, thinking that I might find something there that might appeal to my appetite.\n\nHowever, as soon as I got back to the refrigerated wall near the back of the store, I started feeling so much worse. I had one of the refrigerated doors open, thinking the cold air would help. It only emphasized my current state. And that just made me so upset and frustrated, wondering why I couldn't just push through this for 8 hours. Why couldn't I be stronger? I started crying, which only fueled my frustration and shame more. Here's this not-yet-30 'adult' crying in public, what a disappointment.\n\nSuddenly I felt a hand on my shoulder and a voice beside me saying, \"It's okay, you can sit down.\" My current state overrode whatever confusion I had right then and I allowed myself to be sat down on what I later found out was one of those plastic packing crates for milk and such.\n\nThe owner of the voice was a man, probably in his late 40's, wearing a blue button down shirt and khaki pants. He crouched down beside me, hand never leaving my shoulder. That and his unwavering smile, and all that built up emotion just finally broke. \n\nI cried hard. Not that dainty Arwen-pretty crying but full out Robert-Downey-Jr-in-Tropic-Thunder crying, snot and all. And I was like that for a good 10 minutes, unable to talk or anything. And the whole time, he just crouched there, rubbing my shoulder, not saying a thing.\n\nFinally, the wave of emotions ebbed and I was able to calm down. \"So I'm not going to ask if you're okay, because clearly you're not,\" he said. \"And I'm pretty sure you probably don't feel like talking, much less to a complete stranger. But if you need someone to just shut up and listen to you, I could do that. My wife says I'm a great listener.\"\n\nAnd I don't know what it was because I'm usually such an introvert and have such a difficult time talking to other people. But the fact that this random guy was sitting there on the floor of a 7-11 at 5:30 in the morning, taking the time out of his probably busy schedule to help someone he didn't know. It just made me feel so cared for and that I could open up to him.\n\nSo I told him my story in a nutshell, having to stop a few times to collect myself. And he was right, he was a good listener. Never interrupted me once. And when I was done, he just sort of sat there quietly for a minute or two before saying anything. (And I'm going to try and recall everything he said but I might not get it word for word):\n\n\"Well, it seems like you really hit the jackpot. You have a job you love and bosses that treat you fairly and respectfully. And you have coworkers who you wouldn't mind seeing outside of work. That's quite an accomplishment right there.\" He pauses there. \n\"I have a daughter who's just about to finish up her freshman year of high school this May. And she just started her first job about a week ago at this clothing store at the mall. And she tells me she couldn't be happier. She gets to work with a lot of her friends from school, has a nice boss, and the work is not so hard where it starts to interfere with her studying. And I was actually at the mall just yesterday, so I stopped in to see how she was doing. Of course, I didn't let her see me as I didn't want to be one of those dads who embarrasses their daughters in front of their friends. And for the brief few minutes that I saw her, as she organized this table of shirts and laughed with one of her coworkers, I knew that she was really happy. And I know that her boss really appreciates the work that she's doing there, as I'm sure yours does. And I'm sure that, if your bosses really love and appreciate and respect you, that they wouldn't want you pushing yourself so hard that you make yourself sick. They would want you to take care of yourself. Because with all the care and dedication you put into your job, sometimes you need to put a little bit care back into yourself.\"\n\nHis words really hit home right then. So much so that I started tearing up again (happy tears this time). He then helped me to stand up and we made our way to the checkout line where he proceeded to talk about his current job (as a middle school science teacher) and how he had had a slew of other past jobs which he had never truly felt happy or appreciated in. And he told me that even though there are the not-so-great days at his work, he still feels like he's making a difference. \n\nOutside of the 7-11, he stops me before I go to my car. \"Now I'm going to need you to promise me that you're going to go straight home, curl up with as many blankets as you can find, and get a good sleep. You need to take care of you right now and that's all that matters.\"\n\nI made the promise and thanked him again and again. Then we parted ways.\n\nAnd even though I never got his name, I feel like I will never forget him. His quiet understanding or his kind encouragement. To know that there are still people out there, with the world in its current state, who are just so selfless and caring. It just makes me think there is hope after all. \n\nEdit: HOLY COW! I am just now getting home and finding this absolute plethora of messages, comments, and even a Gold (thank you most kindly Reedit_girl!)\n\nThank you all for your loving messages and support! \n\nAnd yes, I am feeling so SO much better now and was able to go back to work today.",
    "title": "To the milk crate stranger at 7-11: Thank you",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1486819431,
    "score": 9880,
    "keyword": "man nurse"
  },
  {
    "text": "My OBGYN just told me Plan B is 'an abortifacient' and that they 'don't do that' at his practice. So I just got back from an appointment with my gynecologist. I'm confused and ANGRY. \n\nFor some background,  I live in a very Mormon-y part of Utah, and my gynecologist is an older man who my mom knows and who is a bishop in the church. I'm 24 and have been slowly drifting away from Mormonism. \n\nAaaaaanyway, I've been having my annual exam with this guy for years. I just became sexually active this year, which goes against everything I was told growing up and was already pretty dang emotional for me. I had a slip-up with a condom a few days ago and immediately ran out and got Plan B.\n\nSo I go in to my appointment today, and when he sees Plan B on the list of medications I told the nurse about, he freezes, turns around, and asks me what happened with this disappointed look on his face. I blush and stammer out something, and then he tells me that it's an abortifacient (which I think I misheard as an 'abortive'?) and that they don't do that kind of thing at his practice (which, I mean, you don't need to. I already kind of took care of it! What the hell?!).\n\nHe asks if that means I'm sexually active, looking even more disapproving.\nHe tells me that I could very likely be pregnant, that they'll do a pregnancy test here but I should keep doing them at home for the next month, and that I should be bleeding from the Plan B pill already, but since I'm not it should really start soon (which isn't something I saw in any of the research I did. I know it can be a side effect, but I never saw anything that said it SHOULD happen).\n\nThrough the whole thing, he kept patting my shoulder or leg and saying, \"Be careful, dear\".\n\nI just feel like there was so much wrong with how that appointment went, but then I second guess myself because I'm not super well-educated on this. I never ever thought it would be something I would need to think about. If you have any insight, I'd love to hear it! Thank you.\n\nEDIT: Thanks to all of you who took the time to leave informed, compassionate responses. You're awesome :) \n\nA few notes:\n\nI DIDN'T ASK THIS DUDE FOR PLAN B. I JUST TOLD HIM I TOOK IT.\n\nHE'S NOT MY BISHOP, HE'S MY MOM'S DOCTOR. I'M JUST AWARE HE'S A BISHOP. \n\nIF YOU'RE CONCERNED THAT NO ONE'S MESSAGED ME TELLING ME I'M A HO, PLEASE DON'T WORRY, IT'S BEEN COVERED. \n\nI AM GETTING A NEW OBGYN.",
    "title": "My OBGYN just told me Plan B is 'an abortifacient' and that they 'don't do that' at his practice.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1495740284,
    "score": 682,
    "keyword": "man nurse"
  },
  {
    "text": "Your cervix is INSIDE I made an account just to post this because I thought some of you would get a tickle out of my experience at the OBGYN yesterday.\n\nSo I went in for my yearly PAP but I also wanted to ask the doctor about a small bump I felt on my cervix. I wasn't super concerned about the bump because for once everything online told me I was almost certainly NOT dying from cancer but still, I wanted to ask my doctor to check it. \n\nI get to the doctor and the nurse checks my blood pressure etc. and then asks me if it's okay if a student comes in with the doctor. I say sure! I always do because they gotta learn somehow. Then she asks me \"if the doctor gets caught up with another patient, are you comfortable letting the PA perform your exam?\" I think for a moment and say no, because of the bump, I'd rather it be the doctor. \n\nOff she goes and the PA comes in to go over medical history. She was a very nice young woman, but clearly nervous. Everything I said she replied \"that's wonderful\" while furiously taking notes. The conversation went like this:\n\nME: I've been feeling a lump on my cervix for a few months now but as of last week, it actually seems to have gone away on its own. I can still feel a small rough spot where it was, though.\n\nPA: ...so the lump was on your vagina and-\n\nME: No, on my cervix. \n\nPA: Okay....the cervix is INSIDE....\n\nME: Right, I can actually touch my cervix. I've always been able to, and the lump was on the cervix, just next to the opening and now there's just a small rough spot there. \n\nQueue her looking shocked before laughing and commenting that I was \"very in tune with my body.\" I laughed too but I just couldn't get over that she didn't believe I could touch my cervix! No big deal, of course, but pretty funny. \n\nThe PA leaves to get the doctor, then comes back in with her and I realize I hadn't made the connection that she's also the student. With the doctor watching, she performs the World's Most Timid breast exam. I tell the doctor about the bump in full description (pea sized, hard, unmoving, painless) and without missing a beat she tells me it's 99% likely a harmless nabothian cyst. \n\nThe actual exam starts and the doctor asks if I'm comfortable letting the student perform the exam. At this point, I'm like please do!! You have to learn this! And she performs the World's Most Timid pelvic exam with the doctor talking her through it.\n\nThis was the kicker for me: she removes the speculum and the doctor tells her to put her fingers in to feel my cervix and try to find the rough spot. Let me tell you - this woman was close to putting her whole hand inside me! She went in as far as her hand could possibly go with more gusto than I ever could have anticipated. Again, I wasn't bothered at all because this is how she has to learn, but man, I was laughing inside. She finally felt my cervix after some intense wriggling and said she couldn't feel the spot where the bump was. The doctor has a go and immediately says she feels the dent and she's sure it was a nabothian cyst (unless PAP results say otherwise).\n\nSo that was that. I was really glad I hadn't agreed to see the PA without the doctor because clearly she still has some learning to do, but in the end, I guess I'm glad I was able to help!",
    "title": "Your cervix is INSIDE",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1496922020,
    "score": 348,
    "keyword": "man nurse"
  },
  {
    "text": "I wanted to share a reminder of our humanity in medicine (OC) The man - A fugue\n\n&nbsp;\n\nA single wail\n\nMy guts twisted\n\nI saw the girl grasping her mother\n\nIn shock\n\nTheir eyes spoke the truth\n\nHer mother, brothers, the nurses too\n\nThe only one missing from all this was he - The man.\n\nHis body brittle, riddled with tumors\n\nJust barely past his 5th decade\n\nThe haughty halfway mark for those who have years in spades\n\nBut yet his body lay still on the blood-stained bed\n\nIn silent parade.\n\n&nbsp;\n\nA slow grave was all he could hope for\n\nSurrounded by family and friends in peace and quiet\n\nFor the rest of his days;\n\nBut even that he was denied\n\nInstead the cheap substitute death. Chaotic death. Inescapable death.\n\nExsanguinating with every last breath \n\nOn the flimsy trolley.\n\nAnd even as all this transpired next door\n\nI met the antithesis of this morbid story\n\nA woman, not too much younger than he\n\nFound unresponsive in a stranger's driveway\n\nGCS 8, responding to pain, vitals stable\n\nA history of alcoholism and borderline personality\n\nSo her files say\n\nAnd in that moment I couldn't control it -\n\nThe feeling, the rage. Unbridled fury.\n\nThis was not me!\n\nI started jumping straight to the point\n\nShe MUST be drunk! my own rage retorted\n\nA waste of space, a cruel injustice of life's great race\n\nWhy couldn't it be..\n\n..her?\n\n&nbsp;\n\nI stopped. Reflected.\n\nPaused briefly and meditated.\n\nTwo people died, on that one grim night;\n\nOne was he, the man in bed five,\n\nThe other person was the man inside me.",
    "title": "I wanted to share a reminder of our humanity in medicine (OC)",
    "subreddit": "medicine",
    "timestamp": 1486916434,
    "score": 31,
    "keyword": "man nurse"
  },
  {
    "text": "Code status Clearly, these discussions should be had for all hospital admissions.  But they're not. \n\nSo what do you do when it's the middle of the night and a bored night nurse pages you to ask you to assign a code status on a patient who's been in the hospital for a few days and never had one entered? \n\nI don't *think* this < 50 y/o man with an uncomplicated lap choley is going to decompensate overnight but you never know. Regardless, I'm not waking him up in the middle of the night to ask him what he wants in the event of a cardiac arrest. \n\nWWYD?",
    "title": "Code status",
    "subreddit": "medicine",
    "timestamp": 1487314365,
    "score": 23,
    "keyword": "man nurse"
  },
  {
    "text": "Student emailed me about her step dad leaving her mom - need advice on how to progress Hey all,\n\nI have a student in 8th grade (maturity of a high schooler) who is really struggling. Her dad passed away when she was a child, and now her step dad has left her mom. \n\nShe has confided in me in person about her fear that they were going to divorce, but last night was when he finally left. \n\nShe emailed me and told me as such. I think she just wants an adult to hear her and validate her feelings, but she also doesn't trust many adults. I've tried to convince her to talk to our guidance counselor, but he's a man and I don't think she feels comfortable with that. It's not his fault at all. She just doesn't connect. \n\nBut I'm a little worried about the repercussions that could follow. You always hear that it's not your job to be the guidance counselor and if something does happen then you're responsible. But then you're also told to handle everything in your classroom. \n\nI think my goal should be to get her to agree to talking to our school psychologist, but I also know she is really hesitant to tell anyone anything (she is so sweet and just silently suffers because she doesn't want to burden anyone else). \n\nDo you guys have any experiences that could give me some insight on the best way to handle this? I don't want her to feel like I'm pushing her off onto someone else as she already feels so alone. She said she can't talk to her mom about it. She also won't talk to a friend (she feels she doesn't have any). \n\nI just want to make sure I'm doing the right thing for her and also for me. I hope this doesn't sound selfish. Her future is more important in my heart, but I'm also logically making sure not to endanger my career or her since I'm not certified to be a counselor. \n\n\nEdit: thank you to all that responded. I contacted the female guidance counselor. She's going to talk with the school nurse (who is good friends with the child's mom and the child hangs out with her at lunch at lot) to see if she would be open to talk with our psychologist. I also told the child to write some poetry about how she's feeling to help her get her emotions out.",
    "title": "Student emailed me about her step dad leaving her mom - need advice on how to progress",
    "subreddit": "Teachers",
    "timestamp": 1513440202,
    "score": 10,
    "keyword": "man nurse"
  },
  {
    "text": "26, had my CS degree since 21, been freelance coding since 13, sr software engineer at a multinational tech company, but considering a 180 in careers; or a career path change. WWYD? I feel like I need to change things up, like I'm stuck in a job that doesn't mean much, and doesn't help people who need it. I feel as if I'm just stuck here with everyone else, making fat cats who don't pay taxes in my country richer than ever. I feel I had my career path and degree chosen for me by people surrounding me simply because I enjoyed programming as a hobby, and was making a fair wage out of freelancing by 15 while still in high school.\n\n\n\n\nall this being said, the company I work for has been nothing but fantastic to me. my bosses are fantastic, everyone I work with is fun, we have a blast when we go on site and I get to see a lot of cool new shit that's yet to be released, or will never be released. I get to travel to see cool things the layman will likely never see for at least 20 years, I'm sub-contracted to places I'd never dream I'd see the inner-workings of, quite often, placed on projects that're time critical/sensitive and my brain's pushed to the max, and the euphoria of figuring something out that has been pondered over by the entire team for what feels like centuries can't be matched by any drug; it's the feeling I bet Edison felt once he figured out how to create light without fire after years of experimentation... that \"eureka!\" moment which I'm willing to bet all of you have experienced before.\n\n\n\n\nbut... I still feel unfulfilled. I'm contracted for another 6 months once I return (my bosses were kind enough to grant me 6 month leave from work to deal with my mental health and drug issues... how rad is that? that's why it's so hard to even think about leaving. I know I'll never score a job that's this *caring* about its employees, despite their image of being the big boogie man to outsiders) which lines up with the approx time I can start thinking about going back to Uni for a different subject in a whole new area.\n\n\n\n\nthat being said, is that what I really want to do? start from scratch, start from being a novice at something I've never done before? and Uni, well gosh... my first time at Uni wasn't a great experience... I actually hated it. I can barely read/write, maths/IT are my only strong points that carried me to even Uni entrance, and I have no idea how I passed my CS degree because I couldn't read my own handwriting, let alone the professors. I don't even think I needed the CS degree to land the job where I'm at, the only net positive I got from it was that I social-networked with a lot of people in the field, and one of the professors is the person who helped me fill in my resume for where I'm at currently, a couple years after I left Uni. \n\n\nI actually dread going back to uni, thinking about it, but if I changed careers and wanted to continue to live on more than minimum wage it's basically required since programming/IT has really been the only thing I've excelled at. I suspect I have ADHD, which I'm going to seek treatment for (can't on the NHS, thanks to my personal problems they'd think I just wanted legal meth. but I struggle even in the painting class I'm taking right now to relieve some stress while off of work. hell, speaking of work, I struggle there too sometimes. I really have to force myself to go into a zone it feels like or else I'll buzz around the room doing different things. I have to look into getting it treated privately, which I think I have insurance for from work, but I'm going to go the true private route and paying out of pocket so nobody knows I'm even looking into it, incase I don't have it. haha)\n\n\nI don't even know what I'd go back to uni for, honestly. I'd likely go for something to do with medicine/healthcare or science... be it a nurse, biologist, pharmacist or maybe surgeon (unlikely due to the amount of work vs pay ratio in the UK, and I don't want to spend my entire life savings going to the US to study. but surgeon has always been my dream job... I just sadly never had the confidence when I was younger, and now I suffer from poor vision that's corrected by RGP lens', mild tremors (I take beta blockers for them when needed, but I couldn't take them 24/7) and finally the biggie that all good CS peeps who're too lazy to fix their bad computer habits have: carpel tunnel!\n\n\n\n\nthis feels like therapy, writing my life story. but I would love some advice from others... maybe people who've been in similar situations and are out, or in, the field still.",
    "title": "26, had my CS degree since 21, been freelance coding since 13, sr software engineer at a multinational tech company, but considering a 180 in careers; or a career path change. WWYD?",
    "subreddit": "cscareerquestions",
    "timestamp": 1512137835,
    "score": 1,
    "keyword": "man nurse"
  },
  {
    "text": "Denver nurses suspended for opening body bag to admire man’s genitals",
    "title": "Denver nurses suspended for opening body bag to admire man’s genitals",
    "subreddit": "MensRights",
    "timestamp": 1504726522,
    "score": 1009,
    "keyword": "man nurse"
  },
  {
    "text": "Why can women trick men in false fatherhood without repercussion? Why can a woman sue a hospital if the doctors or nurses mix up the children and give her the wrong baby but a man can't sue a woman for tricking him in paternity if he isn't the biological father?\n\nIt's is obvious that in the first case it was a simple mistake with no ill intent but in the second case the woman at least knew of the possibility and deceived the man so he wouldn't leave her.\n\nHonestly I think both should be possible but how is it possible that the act that happened without purpose is punishable but the one that was obviously with ill intent not?",
    "title": "Why can women trick men in false fatherhood without repercussion?",
    "subreddit": "MensRights",
    "timestamp": 1499529365,
    "score": 61,
    "keyword": "man nurse"
  },
  {
    "text": "How can society be so hypocritical? How can people be so uncaring? Ah, need to get this off my chest, and honestly you guys seem to be the only ones capable of sympathy.\n\nThis is a burner account because I'd rather not have either my political account or my personal account associated with this, just a clean veil of anonymity.\n\nAnyways, I like, 80% of men in the U.S., was circumcised----I was left with just enough of my body to show me what I'm missing, but not enough to actually function.\n\nAnd it eats me alive, every day.\n\nI feel like I'm not whole, I feel like I'm not human.\n\nI feel like my body isn't my own.\n\nMy penis... it constantly feels like something's missing.\n\n24/7, I get the feeling like there is something more there.... or at least like there should be something more there, ... but there isn't. And there never has been, but it still feels like it.\n\nI can't find much pleasure in sex, in masturbation, in anything.\n\nI have a more than ample drive but... it's mechanical.\n\nIt takes a long time to get myself stiff as when I'm flaccid my shaft does absolutely nothing for me, and my head isn't engorged enough to be easy to stimulate.\n\nAnd once I get hard, if I'm masturbating the only way to find any sense of pleasure is to continuously scrape my palm across my tip----Rub your finger across your lip, and it's marginally more pleasurable at that.\n\nIt isn't very pleasurable, and it can take quite awhile before I'm able to finish.\n\nAnd when i do finish, it's not very pleasurable either.\n\nA little, there's definitely something there to enjoy, but it's so god damned fleeting and it's only enough to make me wish for more.\n\nJust disappointment and a sticky mess.\n\nAnd mind you, this is once I'm actually able to get over the sensation of wrongness, the momentary shock of missing what so clearly feels like it should be there.\n\n*if* I'm able to get over that shock. Sometimes, I can't.\n\nAnd sex? It's... eugh. I hardly feel anything, when inside a vagina. Anal is a little better, as it's tighter, but it's still lacking.\n\nI have a loving and devoted girlfriend who is absolutely selfless in her desire to please me, but no matter what, she can't really do so.\n\nShe doesn't know this, because it would crush her if she knew.\n\nI am extraordinarily lucky to have found someone like her, and even more so to have been able to make her mine.\n\nBut I constantly have to cover up my own dissatisfaction... to keep her from feeling bad.\n\nI mean, she's so amazing and any guy would be lucky to have her, all she wants from me is affection, love, and cuddles. She doesn't want money, she doesn't care about marriage---She only wants to be with me.\n\nShe stayed with me when I was laid off and mooching for six months---She was just glad to be in my arms.\n\nShe's so eager to please me that at any moment, at the slightest whim, I can tell her I want a blowjob and within a minute she'll be naked and kneeling before me.\n\nAnd while it's definitely enjoyable---Thanks in no small part to her own eagerness to do anything and everything she can for me---it's still ultimately shallow.\n\nBut god damnit I feel horrible for lying to her, and I feel like her devotion is wasted on me.\n\nI swear to whatever deity actually gives a shit, she's a god damned unicorn\n\nBut I don't feel like I deserve her.\n\nI don't understand.\n\nWhy is this legal?\n\nWhy is it okay---standard, even---to mutilate young boys?\n\nTo deny them the sanctity of their own body?\n\nTo deny them their basic humanity?\n\nAnd why? Because doctors want to milk more money out?\n\nShit, my mother... she had my circumcised for \"cleanliness\"\n\nThat sociopath didn't even value me enough to clean me as an infant.\n\nShe'd rather mutilate me than be a fucking mom for a few years.\n\nAnd to add insult to injury, you've got the god damn feminist movement calling me privileged.\n\nHow can you dare to call me privileged because of my gender and my skin tone?\n\nAt least you weren't denied your basic human rights.\n\nRights which were standard for you before my birth, but when anyone even suggests entertaining extending them to men, they're laughed at and called sexist.\n\nAt least you were allowed to keep your body intact.\n\nAt least you weren't harvested like some animal so some rich bitch could buy a luxury skin cream.\n\nBut no, you tell me all my life that I should feel guilty because some 12 year old girl from a savage culture living in a mud hut half way around the world is getting pressured by her mother to have her labia removed\n\nYet, I, in a so called civilized society, have never experienced what it's like to be whole?\n\nI've been laughed at for suggesting that it's cruel and unethical to circumcize young boys.\n\nBut no, women in the U.S. are totally oppressed because they chose to become nurses and teachers instead of lawyers and accountants.\n\nAnd yes, those totally subjective and entirely anecdotal forms of sexism feminists keep pulling out their ass... yeah, they're so god damned valid they totally invalidate the numerous objective, observable, and quantifiable forms of discrimination and civil and human rights violations that men are subjected to.\n\nOne of which, most horrifyingly, is that not even months after we're born, we're treated like livestock whose very body exists to be bought and sold.\n\nAnyone who sees genital mutilation as okay... who suggests for even a moment that it should be legal to carve a child open like that, to traumatize him, to permanently alter his body without any regard for his own happiness, desires, wants and needs.\n\nTell me, how do you justify your complete lack of basic human empathy toward your fellow man? \n\nHell, sometimes, I get the urge to kill myself, in those moments it feels like... what's the point in living if I can't live as a complete, intact human being?",
    "title": "How can society be so hypocritical? How can people be so uncaring?",
    "subreddit": "MensRights",
    "timestamp": 1492678746,
    "score": 17,
    "keyword": "man nurse"
  },
  {
    "text": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things) Hey everybody. I haven't posted here before but I thought this recollection is relevant, both in an alarming way and as an example of the kinds of anti-feminist rhetoric making waves not only on r/Men'sRights, r/the_donald and the alt-reich pits of 4chan, but also on nationwide daily conservative talk radio.\n\nAs a fiction writer intrigued by the depths of conspiratorial thinking, conservative talk radio is like a nightmare paradise. I started tuning in pre-election to try and comprehend some of the right's perspective, principally the stuff the right is being told by their media. Aside from a constant stream of slant and innuendo, and general fear-mongering, this segment from a few weeks back really stuck out.\n\nSavage's topic: \"an epidemic of false rape allegations perpetrated by radical feminists.\" Fitting neatly with the \"Look at what's happening to our poor boys!\" trope, he asked for callers to relay experiences of faked accusations for the purpose of slander and character assassination. His first caller was a woman in tears. She was barely able to speak about experiencing a rape in her youth that she was never able to get herself to publicly admit before. It was very hard to hear, particularly when Savage was less than accepting at first, asking her why she never came forward, asking what she hoped to get out of admitting it now. Eventually he relented and wound the conservation toward some notion of an older, better America where \"your brothers would take care of it.\" \n\nThe next caller was a guy who was utterly on board with Savage's thesis. He said that his sister-in-law cooked up a story about him molesting her kids, even coaching them to lie to lawyers, in order to discredit him and get him fired from his job (which was successful.) When asked why she would do this, he said \"she just didn't like me\" (the most suspect sentence I've ever heard, BTW). Regardless, this fakery, while manipulative and wrong, had nothing to do with feminism and/or sexual assault of feminists. So Savage was 0 for 2 on his big evil topic. \n\nThe third was a guy who was raped while attending a christian monastery. It was another sobering discussion of sexual assault and the effects it has on the body and mind, denial, acceptance, the unstable road to recovery, etc. \n\nCaller after caller...zero examples of false rape allegations. The segment concluded with a nurse who specialized in processing rape victims, she laid out all the gory details of examination, while Savage tried to derail her data and facts with ideas like \"Well if there's no clear DNA evidence, the claim must not be believed, right?\" He didn't get far on this tract. Strangely, they ended up on mutual terms when ascribing a rise in rape incidents and rape culture to violent video games, violence in films and, both inherently racist and lazy, on rap music like Kanye West. The segment trailed off into Savage basically thanking his audience for a frank discussion of a very hard topic, and then the station was barraged by ads. \n\nConsidering where things ended up, it was easy to forget how it began-- Savage wanted to hear about devious man-hating and man-destruction by means of what he sees as a pivotal radical feminist tool, the pointed finger of accusation and the presumed guilt of the men being accused. But when exposed to real people in the audience, with real experiences, there was a near unanimous 180 degree turn. As brutal and frightening as his initial topic was, and how horrific it is that such concepts are preached to the masses as being some epidemic feminazi plot, he totally failed. It was heartening in a grim way. \n\nAnyway, thought I would share this attempt to demonize feminism, particularly because the response was not only lackluster but such a reversal. Other such BS, particularly online, gets hateful and vile very quickly.",
    "title": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things)",
    "subreddit": "Feminism",
    "timestamp": 1483351001,
    "score": 1,
    "keyword": "man nurse"
  }
]