[
  {
    "text": "Suspended from school job pending an investigation I work as an IT coordinator at a local secondary school. Have done since aged 16 when I joined initially as an apprentice. My record is impeccable. From the UK.\n\nTuesday we had a new apprentice staff member be suspended for gross misconduct as she had a party which involved several of our students (a big no no). Because of this several rumours have been floating around accusing her of malpractice and safeguarding issues , between students and staff. We were told Wednesday morning about her suspension from the school.\n\nToday the head of the school said he may/may not need to speak to me later on. Turns out he did so he phoned me and I went to his office. Several allegations have been made against me by a staff member who knows the girl and a student at the college at the school, stating I'd been making up inappropriate lies about what went on and why she had been suspended from her job. This got back to the apprentice girls mother who emailed in.\n\nAs I know a boy from the school he approached me with some story, which I told him they were rumours I had heard and just rumours, so he's told some friends (stupid move from me). I did play them down as rumours and nothing more. The student claims I made claims of what went on. When telling his friends this has gotten back to the girls mother who has been suspended. \n\nThey now have been up on a charge of misconduct.\n\nI have stated in a meeting with the head, numerous students have come up to me themselves telling me a rumoured version of events and I have replied with they are rumours and not to be said. These students have heard these rumours from other teachers as I asked where they overheard the story from. Surely these teachers should be disciplined too?\n\nThe girls parents aren't happy we've been told she's been suspended and the head asked how I even knew. I replied that my boss told me so he shook his head.\n\nThe meeting concluded with him stating he hated his position on the matter and he wanted me to take care and he wanted the discussion to be man to man as he likes me but he can't comment further. He did say he'd like to be in my corner but can't as it's an independent investigation. He seemed relieved when he said he has to make a recommendation to the school governors but again that it was ultimately up to them.\n\nI am having an investigatory meeting soon. I have a union representative.\n\n\nI love my job massively and feel depressive and losing it will ruin me. What chance do I currently have?",
    "title": "Suspended from school job pending an investigation",
    "subreddit": "jobs",
    "timestamp": 1490504293,
    "score": 7,
    "keyword": "man teacher"
  },
  {
    "text": "About to be unemployed. Appreciate your help! Hey everyone,\n\nI am again at a crossroads. I have had my current job for 4 years and now it seems I am going to have to look for a new one due to internal reasons that has nothing whatsoever to do with me or my performance. \n\nI have been an ESL/EFL teacher for 6 years in total and before that, I have worked in and out of many jobs that required manual labor. \n\nI am a native Turk, all my job experiences have been in the country. I have no other qualifications besides my Bachelor's in linguistics, which I haven't practiced or pursued. \n\nI am looking for a steady paying, full-time job since I have a wife and preferably, I would rather work somewhere with a corporate/governmental background. \n\nI am 32 years old, if it helps in anyway. I am open to learning new things but not that open to venturing into a new business with no job security/insurance and jobs that require me putting a large sum of capital into.\n\nThe reason I am writing here is because I've checked google/news sites for jobs abroad and frankly, most of them seem either under/overqualified for a man of my position or too adventurous to begin with.\n\nI am glad for any kind of help or pointing of a finger in the right direction.",
    "title": "About to be unemployed. Appreciate your help!",
    "subreddit": "jobs",
    "timestamp": 1495885821,
    "score": 6,
    "keyword": "man teacher"
  },
  {
    "text": "I finally called a man out on the bus for touching me So I've always been a somewhat shy girl. I live in a big city where buses can get pretty crowded because of either rush hour or just nearby schools getting let out. Cool. I understand crowded buses; we all gotta get where we're going after all. But what I can't understand is why some men feel the need to take advantage of crowds to feel up other people's bodies.\n\nThe first time I was inappropriately touched was in 8th grade.  \n\nIt was a really crowded bus as the middle school I went to was near other schools that happened to get out at the same time. The bus stopped at one of the main bus station so naturally, many people got off and there was a lot of bustling as half the bus fought their way to the door. I thought nothing of it until I felt someone's fingers roughly shove their way into my crotch from behind. By the time I had turned around, the person was lost in the wave of people getting off. I was literally the shyest I have ever been in my life at that time (was voted the shyest girl in the school that year actually) and so I never said anything to anyone.\n\nThe second time was on yet another crowded bus, a couple years into high school. This old Chinese man was holding onto my upper arm from behind which I was using to hold onto a strap above for balance and I thought it was a little weird but just assumed that he had nothing else to hold onto for balance so I shrugged it off as nothing. At least, until his hand reached down and started grasping at my right boob. Luckily, I was with my best friend this time who had gotten a hold of a seat and squeezed me in with her. The man got off at the next stop. We said nothing except for a few comments of disgust.\n\nThe third time, which happened a year later, didn't really involve me being touched sexually but was more creepy than anything. I was boarding a the bus with the same friend and as I stepped on, I could feel a guy pressed up close behind me. I thought this was very strange as the bus wasn't anywhere near crowded enough to justify that and the man kept this up as we got on until my friend and I were standing holding onto straps for support as we chatted. Now at this point the man had backed off a little, just enough that he was still there but not enough for anyone to go wtf at him. My friend and I were talking quietly about something about which stop to get off at, the man swaying with the bus to casually make contact with my back the whole time. Keep in mind this bus is not crowded by any means; my friend and I had chosen to stand because our stop was nearby. As we got off, the man made a remark, breaking into our conversation about something we were discussing. I later complained about this to another friend and halfway into describing the man, she quickly cut me off and finished the description for me. Apparently the man was hanging out near a mall next to a highschool and had been coming up to highschool girls and trying to give them his number. This was a young blond male in his 20s(?).\n\nA couple hours ago, I was riding the bus home from my old highschool where I was visiting a retiring teacher. It was an extremely crowded bus because the same line ran though at least a couple schools and a few stops away from where I was supposed to get off, I gave up my seat for an elderly man and started standing by the rear exit. Not a minute later, I felt fingers stroking my left butt cheek. I thought it was my imagination at first so I shrugged slightly away only to feel the fingers return. I was 100% sure those weren't some stray bag at that point; those were human fingers stroking from my lower to upper butt. \n\nI was done. I'd gained confidence in highschool thanks to mentioned teacher and I was sick and tired of being touched. I've gotten nothing but trouble from guys in college who just can't take a damn hint. I was called a bitch for not giving them a chance (I have a boyfriend) so I did what I felt was right. I called him out on it.\n\nI turned to him, looked the middle age blond man straight in those sky blue eyes of his and said in the loudest voice I could manage, \"Touch my butt one more time and I will report you.\" I knew I had the right man. He met my gaze unblinkingly and slowly nodded. No one seemed to have paid attention or cared. But at that moment, I was relieved.\n\nWhen I got off, I found out that my sister was on the same bus and had squeezed onto the front of the bus. If she had gotten on the back door, my little sister could have been in my position instead. She could have been the one touched instead of me. And I know she wouldn't have said a thing.\n\nI know this isn't a big deal to many people but I had to get it out somewhere. Thank you for reading.\n\nTL;DR Guy kept stroking my butt, I called him out on it, and my little sister could have been his victim instead of me if she had gotten on the back door instead of front.\n\nEdit: Ahh thank you! I honestly only expected a few upvotes and a comment or two perhaps so I was honestly surprised when I came back... And only one nasty PM to boot! Thank you so much! \n\nEdit 2: Holy...thank you for the gold! I had to refresh twice because I couldn't believe my eyes... Thank you!\n\nEdit 3: To those wondering, seeing something like this happen and speaking up to either the culprit or just getting attention to that happening would be amazing. Silence is not golden in this case.",
    "title": "I finally called a man out on the bus for touching me",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1495577927,
    "score": 27527,
    "keyword": "man teacher"
  },
  {
    "text": "To the milk crate stranger at 7-11: Thank you I'm not sure if this is the right place to put this but I just really need to get this out there.\n\nI've been working my current job as a housekeeper at a private nursing facility for about a year and a half now. And I know this may seem weird but I love my job. My bosses couldn't be nicer. My coworkers are so loving and funny and supportive. And the job itself is really not that bad. I'm learning a lot and feeling like I'm actually making a difference.\n\nIn the time that I've been working there, I've never once had to call out sick. Sure there's been a few times where I've felt like calling out because of a bad headache or 'that time of the month' cramps. But I always had this sort of guilt, like, I finally have this job that I love and treats me right. To call out, I felt, that they would be disappointed in me. Also, as this not-yet-30 female who's only 4'8\", most of the time I feel like I constantly need to do more and prove myself. That I'm not just so kid who is constantly getting asked how old she 'really' is.\n\nAnyway, so yesterday morning, I woke up and found myself feeling not so well. I was feverish, lightheaded, and had zero appetite. But still, that little voice in my head said 'Don't let your bosses down. They've done so much for you.' So I pushed onward, driving into work and also stopping at the local 7-11, thinking that I might find something there that might appeal to my appetite.\n\nHowever, as soon as I got back to the refrigerated wall near the back of the store, I started feeling so much worse. I had one of the refrigerated doors open, thinking the cold air would help. It only emphasized my current state. And that just made me so upset and frustrated, wondering why I couldn't just push through this for 8 hours. Why couldn't I be stronger? I started crying, which only fueled my frustration and shame more. Here's this not-yet-30 'adult' crying in public, what a disappointment.\n\nSuddenly I felt a hand on my shoulder and a voice beside me saying, \"It's okay, you can sit down.\" My current state overrode whatever confusion I had right then and I allowed myself to be sat down on what I later found out was one of those plastic packing crates for milk and such.\n\nThe owner of the voice was a man, probably in his late 40's, wearing a blue button down shirt and khaki pants. He crouched down beside me, hand never leaving my shoulder. That and his unwavering smile, and all that built up emotion just finally broke. \n\nI cried hard. Not that dainty Arwen-pretty crying but full out Robert-Downey-Jr-in-Tropic-Thunder crying, snot and all. And I was like that for a good 10 minutes, unable to talk or anything. And the whole time, he just crouched there, rubbing my shoulder, not saying a thing.\n\nFinally, the wave of emotions ebbed and I was able to calm down. \"So I'm not going to ask if you're okay, because clearly you're not,\" he said. \"And I'm pretty sure you probably don't feel like talking, much less to a complete stranger. But if you need someone to just shut up and listen to you, I could do that. My wife says I'm a great listener.\"\n\nAnd I don't know what it was because I'm usually such an introvert and have such a difficult time talking to other people. But the fact that this random guy was sitting there on the floor of a 7-11 at 5:30 in the morning, taking the time out of his probably busy schedule to help someone he didn't know. It just made me feel so cared for and that I could open up to him.\n\nSo I told him my story in a nutshell, having to stop a few times to collect myself. And he was right, he was a good listener. Never interrupted me once. And when I was done, he just sort of sat there quietly for a minute or two before saying anything. (And I'm going to try and recall everything he said but I might not get it word for word):\n\n\"Well, it seems like you really hit the jackpot. You have a job you love and bosses that treat you fairly and respectfully. And you have coworkers who you wouldn't mind seeing outside of work. That's quite an accomplishment right there.\" He pauses there. \n\"I have a daughter who's just about to finish up her freshman year of high school this May. And she just started her first job about a week ago at this clothing store at the mall. And she tells me she couldn't be happier. She gets to work with a lot of her friends from school, has a nice boss, and the work is not so hard where it starts to interfere with her studying. And I was actually at the mall just yesterday, so I stopped in to see how she was doing. Of course, I didn't let her see me as I didn't want to be one of those dads who embarrasses their daughters in front of their friends. And for the brief few minutes that I saw her, as she organized this table of shirts and laughed with one of her coworkers, I knew that she was really happy. And I know that her boss really appreciates the work that she's doing there, as I'm sure yours does. And I'm sure that, if your bosses really love and appreciate and respect you, that they wouldn't want you pushing yourself so hard that you make yourself sick. They would want you to take care of yourself. Because with all the care and dedication you put into your job, sometimes you need to put a little bit care back into yourself.\"\n\nHis words really hit home right then. So much so that I started tearing up again (happy tears this time). He then helped me to stand up and we made our way to the checkout line where he proceeded to talk about his current job (as a middle school science teacher) and how he had had a slew of other past jobs which he had never truly felt happy or appreciated in. And he told me that even though there are the not-so-great days at his work, he still feels like he's making a difference. \n\nOutside of the 7-11, he stops me before I go to my car. \"Now I'm going to need you to promise me that you're going to go straight home, curl up with as many blankets as you can find, and get a good sleep. You need to take care of you right now and that's all that matters.\"\n\nI made the promise and thanked him again and again. Then we parted ways.\n\nAnd even though I never got his name, I feel like I will never forget him. His quiet understanding or his kind encouragement. To know that there are still people out there, with the world in its current state, who are just so selfless and caring. It just makes me think there is hope after all. \n\nEdit: HOLY COW! I am just now getting home and finding this absolute plethora of messages, comments, and even a Gold (thank you most kindly Reedit_girl!)\n\nThank you all for your loving messages and support! \n\nAnd yes, I am feeling so SO much better now and was able to go back to work today.",
    "title": "To the milk crate stranger at 7-11: Thank you",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1486819431,
    "score": 9873,
    "keyword": "man teacher"
  },
  {
    "text": "Thank you for raising beautiful daughters - Father's perspective. I want to thank the amazing woman who raised two beautiful daughters.  \n\nThis happened yesterday while my wife, my 2 year old daughter and I were at LegoLand Discovery just north of Toronto.  The mall was packed as it was Family Day so all the families were there shopping just as we were.  My toddler is tall for her age so she was allowed entry to play in the indoor jungle gym.  She was having an amazing time and my wife and I were so happy for her as we try to let her experiment and try new things, until she reached a point where she was stuck. She was stuck on a platform that she couldn't get down from as her feet didn't quite touch the ground and she was scared of falling - understandably so nor could she go back up because it was too high.  The nice attendant asked if we wanted to go get her because she was doing that cry that isn't really a cry but more of a cry for help and my wife and I decided to say \"no.\" We wanted to encourage her to make the \"leap\" (maybe 6 inches) onto the platform.  This is where your daughters came in.  They were about 5-6 years old and started to cheer on my daughter. When other children were just going around my daughter they were saying \"you can do it, look at mommy and daddy. They think you can do it\" and with a little bit of help, she was able to put her feet on the platform.  We were both so happy for my daughter, as was she.  Your daughters didn't stop there.  They held her hand through other parts of the gym that my daughter couldn't get to on her own. My daughter followed your kids through tubes, rope ladders and slides which she never would have done on her own.  The expression on her face makes me smile just typing it.  When it was time to leave, my daughter looked up to your 2 girls with a smile bright enough to light up a room and said \"tank you\" and our hearts just melt.  We wanted to thank you ourselves but when I did, it was kind of awkward and creepy. Like here is this grown man thanking me for my daughters helping his daughter, kind of thing.  I wish there was a way to express my gratitude to you now so here's my best attempt:\n\nThank you for giving my wife and I hope that there are children who were raised to help others and do the right thing.  That your daughters will be there to comfort and console the girl being bullied in high school.  That you instilled a sense of \"treat others the way you want to be treated\" in them. That they saw my little girl and felt that being her friend was better than her being alone. I sincerely hope your daughters grow up to do amazing things because this world needs people like them to lead us places that we are too scared to go on our own; to go down the scary \"tube\" or climb the tall \"rope ladder\"; to lend a hand and a voice of encouragement when someone's afraid of falling; to make someone smile instead of crying because they said \"you can do it\" instead of \"do it on your own.\"\n\nI like think my wife and I are good parents, but I will strive to be the kind of parent you are.  You are a great parent and teacher to your daughters.  From our melted hearts to you...Thank You.",
    "title": "Thank you for raising beautiful daughters - Father's perspective.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1487735006,
    "score": 2157,
    "keyword": "man teacher"
  },
  {
    "text": "Jostens Yearbooks scammed Our High School for Years.. Edit #2: This blew up, so I wanted to put at the top if they ever see this: THANK YOU YEARBOOK CREW! Deadline is tomorrow and they are still working as we speak (12:00 AM EST). Your hard work is why it's worth it!\n\nI wrote this as a comment in a post today but I feel like it needs to stand on it's own as well. To start: I don't work for Treering, but this all came out of a post about potentially switching to Treering for yearbooks. I think it's really important to understand how Jostens did the smoke and mirrors routine for years until they finally got caught. Here it goes:\n\nAs technology teacher, I took over yearbook advising last year to raise funds for our tech department. Immediately upon taking over I was sent invoices from Jostens in the amount of ~~$5,000~~ $4,748.34. What? How do we OWE for a yearbook that costs $78 (price goes from $55 to $78 by the end)? Where is the money going? That question led me down the biggest and shadiest rabbit hole I have ever seen. \n\nFirst, when asked to send an itemized invoice, Jostens was hesitant. Finally, after persistence, I got it, and low and behold the numbers just didn't add up.\n\nWhy? Well first off I had nothing to go off of because they had not sent a contract IN THREE YEARS, so I could not even refute pieces of any agreement. Secondly, a line item showed up in the top right in small print on our invoice saying \"production fee\". What was this? After pressing again, Jostens was making us pay $100 FOR THE FIRST 50 BOOKS, AND WE WERE SELLING THEM FOR $55 a piece! That's right; our kids were buying books for negative fundraiser profit. No mention of this in any contract. No mention of this even on the line items in the itemized invoice. Nothing.\n\nSo I go down the lines and - oh hey! - we are getting charged ~~$1500~~ $860 for \"advertising materials\", . Sweet. I never asked for this, you just sent a box of posters. If we made them ourselves it would have cost us maybe $50. But tack on another ~~$1500~~$860, awesome.\n\nSo I'm already at our wits end by the time the books arrive, and things get even better. I count the books and while we ordered 320, we received ~~375~~365. Why do we have so many extras? JOSTENS SENT US THEM WITHOUT OUR PERMISSION, AND CHARGED US! They claimed it was for kids who forgot to order them so we could sell them, but if you look at the numbers of books it conveniently brought the small amount of profit we made to zero. They then want you to return the books by a certain date (usually in the summer) for a credit refund. JOSTENS ZEROS YOU OUT WITH EXTRA BOOKS AND HOPES YOU DON'T SEND THEM BACK.\n\nYou think that's the end? Oh boy, not even close.\n\nSo after months of being pushed around, I made it one of my absolute priorities to get these kids the most money I could back. I nit-picked every little detail, knowing full well that Jostens had no legal ground on things because no contract was signed and our students had paid a lot of money to this shady company. I argued about advertising, I contested them about the extra books, everything. In all, Jostens waived around $5000 in money owed. Think about that for a second. Jostened erased ~~$5,000~~ $4,748.34. at the wave of a wand. If you can magically erase ~~$5,000~~ $4,748.34 out of nowhere, what does that mean for the charge to begin with?\n\nSo finally satisfied that I could be rid of the plague that is Jostens for ~~$1,400~~ $1,475.82, we sent paperwork to our downtown financials to pay our balance and move one. That should be the end of the story right?\n\nWrong. Downtown gets back to us and notices that JOSTENS IS CHARGING US TAX ON OUR YEARBOOKS. They collected taxes that never existed, to the tune of ~~$1600~~ $1,614.79. So, livid, I send an email to JOSTENS demanding our payment record for the entirety of our relationship with them and find THEY DID THIS FOR FOUR YEARS. They claimed that they needed a new tax exempt sheet from us but we never sent it in. They had the old one, which is THE SAME NUMBER as a new one, but that's what the problem was. They are supposed to be cutting a check to us now for around $6000 (5/11 update: they cut one for $2,737, trying to figure out that now). Now think about how many schools use Jostens and how many schools they potentially did that to. That's a class action lawsuit in the millions of dollars right there.\n\nMy blood pressure is up just writing this. They have basically robbed our students for years, and it happens all the time because advisors come and go and rarely have time like I did to catch them and call them on their crap.\n\nSo we went with Treering this year. First off, I came in with fangs and demands from the get go because I was so pissed off and jaded from Jostens. I started mentioning everything to the guy and listed all my needs in what I wanted contract wise and he was like \"yeah our contract is one page long.\" It's literally one page long (front and back). The next thing I asked was the base price, which came out to $35.62 (140 pages, estimated 300 books sold). JOSTENS BASE PRICE WITH ALL THE HIDDEN FEES WAS $58. They were going to bump it down to $40 (so generous!) when I told them we were firing them.\n\nSo our Jostens ones sold for $78, and now we sell them at $60. So that's $18 LESS per book and $25 MORE in fundraising money. We went from owing Jostens $3k last year to [raising over $7000 this year](http://imgur.com/a/WYUgM). I have learned that we can do discounts for students with free and reduced lunch, so our goal is to make the books equitable for all students. I think you can do this with Jostens as well, but I didn't have the time during my battle to find out.\n\nI love my students and defend them rabidly, and seeing how Jostens treated our school makes me sick. Go do the math on how much Jostens (or ANY yearbook company for that matter) is making on your school and you will be too. I would be upset about any swindling, but public school kids? Our free and reduced kids could never afford even discounted books because prices got out of hand, and all because of shifty tactics and corporate greed.\n\nSo on the technical side, Treering is not a big improvement from Jostens software, but I do like the linking with social media and especially Flickr. We post all of our pictures to Flickr for the kids to view, print and share during the year for free, then we can automatically grab from albums and place. The themes are good, a lot to choose from too.\n\nI could go on, and if you want to talk more please PM me, I try to tell anyone that will listen this story because it really is an injustice. \n\n*********\nEdit: Admins banned post for \"self promotion\", so link removed. \n*********\n\nOh man that felt therapeutic getting out!\n\nEdit #1: thank you to u/behemothpanzer for submitting to r/bestof , I have put so many hours into fighting this small battle that no one knew about or cared about and it really means a lot to me to see such support. I also wanted to add that I don't just have problems with Jostens, other yearbook companies have done shady things too and I don't even know them. This was from a post at the bottom of the comments about a yearbook company essentially trying to bribe me:\n\nAnother thing I didn't point out is that other companies try to lure you in with free gifts. A company told me they would [give me a free $50 gift card just for meeting with them.](http://imgur.com/dAwATtz) Like ME a gift card. I'm pretty sure that's illegal, and if not that's immoral as all hell! Greasing teachers with gift cards... unbelievable.\n\nEdit #3: Thank you everyone for reaching out, it means a lot to me. I tried to respond to everyone, and if I missed you I'm sorry I will try tomorrow. It's late hear but I was too pumped about your support! Goodnight and thank you!\n\nEdit #4: In a poetic moment, I went to my school mailbox this morning [and found this!](http://imgur.com/rrlRRL9) Haha\n\nEdit #5: I fixed up some language here and went back to get some exact numbers from invoices.",
    "title": "Jostens Yearbooks scammed Our High School for Years..",
    "subreddit": "Teachers",
    "timestamp": 1493865347,
    "score": 7419,
    "keyword": "man teacher"
  },
  {
    "text": "Which career path should I choose for 2017? **Preface:**\nI am currently 30 years old and 13k in credit card debt. After I ended an unhealthy relationship with my ex-girl friend towards the end of 2015, I moved into a small studio apartment by myself and spent 90% of 2016 working 7 days a week (one full-time office job during the week and a part-time job doing food deliveries on the weekends.) I didn’t really go out much, barely focused on dating, and pretty much kept myself in isolation. \n\nI have been living in Florida for over 10 years now, but I don’t feel as accomplished I think I should be at my age. I have an entrepreneurial spirit and my dream is to become a digital nomad traveling the world while working remotely as a freelancer, business owner, or even working for a company that permits location independence. \n\nI have been teaching myself front-end development, but I barely have the energy or the time to learn effectively due to the limited hours in my day along with the mental exhaustion and laziness from working 2 jobs. I have told myself that I do not want 2017 to be a replica of the past year where I’m just working dead-end jobs, overexerting myself, and not truly focusing on my passion. Below are the following paths and opportunities I have currently.\n\n**1.) Remain in Florida:**\nI literally just paid off my car this month. That’s $278 extra I will have available. I could continue working both my full-time and part-time jobs and apply that surplus of income towards my credit card payment. Subsequently, if I choose this route I will remain “comfortable” in the sense that I enjoy living and being in Florida, but I will still feel as if I haven’t progressed much and will continue learning code at a slower pace. \n\n**2.) Teach in Vietnam:**\nThis option has been extremely heavy on my mind and I have been doing the most research on this path. I have watched many vlogs, joined FB groups, and read Reddit posts pertaining to teaching in Vietnam. My overall plan was to get TEFL certificate by flying over to VN and doing an in-class TEFL course while there, where you get experience working directly with the students. After you receive your certification the school guarantees you a job. \n\nThis option seems very appealing to me for multiple reasons: I have always wanted to travel to Asia, I enjoy working with kids, I’d work part-time hours (15-25 per week), and I can supposedly can make anywhere from $1,500-$2,000 per month. I would use the additional hours off (that I’d normally spend working at my full-time job) to immerse myself in studying code. I would also be to focus on productive activities as a whole to help clear my mind and help refine my skill set so that I will be able to be employable to work for a web development company or freelance on my own. \n\nAs much as I want to take this option I have been weighing the pros and cons. First, I do not have a bachelor's degree (or any college degree for that matter.) In order to get work visa in Vietnam, this is a requirement. I have read about and “interviewed” a few people who claim there are people without degrees who are still able to teach English in Vietnam, but they have to do “visa runs” and exit the country and come back every 3 months.\n\nThe program I’m trying to go through (which guarantees me a job at the end of the course), claims they shouldn’t have a problem finding me a job, but they cannot confirm exactly how much money I will be making and stated I most likely will be working in the rural parts of VN and not in the city such as Ho Chi Minh or Hanoi which I’d much prefer.\n\nThis presents a problem to me in a financial sense. If I were to quit my job, break my lease, sell my furniture, and go to Vietnam, I would still have a $300mo credit card payment, my $111mo cellphone bill, and pay a monthly storage fee of over $100 to keep my car in Florida (I do want to keep my vehicle--just in case.) Without a concrete idea of how much I’ll be making as a TEFL certified, college degree-less teacher on a tourist visa, I’m understandably apprehensive as I might be going from a bad situation to worse if I cannot sustain myself in Vietnam while paying any bills back home in the states.\n\n**3.) Move to Texas:**\n\nThe “safest” and most logical option would be to move to Texas. I have a cousin who is very intelligent and connected with the right people who has the ability to get me a scholarship for free at any college in TX (and possibly here in Florida). She emphasizes the importance of a college degree and understands the rut that I am in. Her offer is for me to move to Dallas Fort Worth, live with her in her house with her husband rent-free, work for her business part-time for 15-20 per week, and the rest of the time go to college to get my bachelor degree in any major I want.\n\nI know the majority will say this is the obvious way to go, but as a 30 year old man who values his independence and prefers to teach himself code (I have seen many instances where people have landed web development jobs by learning on their own or attending short-term bootcamps and without a CS degree--although the CS degrees helps a lot!) I prefer not to invest the next 4-5 years studying in college not doing what I’m passionate about. This opportunity will allow me to save money and help me get out of debt, but I have this overwhelming sense of unfulfillment by living under someone else’s roof in Texas (where I’m not quite sure I would even enjoy living).\n\nMy heart is set on Vietnam the most because I am still young, no kids, no girlfriend, and have no attachments other than my “debt.”  I feel as if I don’t travel now, I won’t do it as I get older. I would like to see the world and wouldn’t mind isolating myself away from the distractions and hustle and bustle of Western life to focus on myself and gain mental clarity.",
    "title": "Which career path should I choose for 2017?",
    "subreddit": "careerguidance",
    "timestamp": 1484842582,
    "score": 9,
    "keyword": "man teacher"
  },
  {
    "text": "I am a high school teacher who no longer wants to teach high school. What masters degree complements my skill set? The question: I have skills in education, history, and technology. What would be a marketable masters degree that would complement my skills?\n\n\n\n\n\nHello all, I am 25, I have a bachelor’s degree in history education, and I have hit that stage of \"What the hell do I do with my life.\" \n\nMy goal is probably naïve but bear with me. I want to make a 90k-130k a year, I want the opportunity to travel, and when I end up with gray hair I want to be a professor of history. \n\nMy family privileges include having a good financial background (my late grandfather owned a company and my father refuses to spend any of the money so he lives like a mountain man) and we own some large tracts of land in places that are being slowly developed. \n\nI long term substitute taught for a little while and I liked it, but I don’t know if I could deal with the students and my want of making the perfect lesson plan (I was working until 6-7pm on the average night.) I got constant reviews (staff and students) in student teaching and in my stay as a sub that I am a great teacher; I was even applauded by the students at one point during a public presentation.\n\nI am currently teaching \"EPIC\" (an electronic medical records system) to health care professionals. I am good at it, I am a nerd so I understand the computer system and I have my teaching background so I can translate it into terms basic-level users can understand. I make alright money ($21/hr) and there is room for advancement. But I do not see myself working there as a career. \n\nI know I should start getting to work on my masters, but I am at a road block deciding a major that is marketable and involves my skills. I also am part of the belief that I should not pay for my graduate schooling, so I am on the lookout for assistantships. \n\ntl;dr: I have skills in education and technology, trying to find a master’s program that is decent. \n\n\n[Here is a previous and naive post I made in /r/DreamCareerHelp](https://www.reddit.com/r/DreamCareerHelp/comments/42j0lb/my_dream_job_is_a_history_professor_who_travels/)",
    "title": "I am a high school teacher who no longer wants to teach high school. What masters degree complements my skill set?",
    "subreddit": "careerguidance",
    "timestamp": 1483386913,
    "score": 3,
    "keyword": "man teacher"
  },
  {
    "text": "What to do with my Career considering Dyscalculia, Job Options and College? OK, this will be a little long so bare with me.\n\nI feel like I've hit a roadblock in life and don't know how to get over it. First off Let me explain, I have Dyscalculia and I just recently found out about it. For those of you not familiar with this disorder, it depends on the person, it varies, but generally, you cant do math properly, no fault of the teacher or tutor, its essentially your brain just can't get certain aspects of it down, ranging from the very basics, to time to advanced math etc. I was always a B and A student with occasional C's thrown in the mix. But I was always horrible at math. I sometimes lose place counting in my head and even have to use my fingers at times and I give pause even to addinging and subtracting, but i can do it, it just takes me a few extra seconds to process it at first. I start to struggle a bit with Decimals and Fractions unless I have a calculator to help. And Algebra or Geometry? Might as well tell me to try my chances at highway robbery, I'd have more of a shot at succeeding in that. I cannot get it. I can't absorb the formulas or understand how to solve the equations to save my life, if i do, its only for a brief moment then they leave my head. I only ever passed High School math (for my school it was basic algebra and geometry that were required) due to massive amounts of Homework in extra credit sections and tutoring, of which I failed the extra credit homework as well, but the teacher felt bad for me, so he passed me.\n\nI graduated from HS years ago in 08 (27 now) and decided \"Hmmm, sure, Ill give college a try!\" I went part time for the next 4 years while working to pay for it at first then my parents chipped in latter on. I've done a number of odd jobs during that time, everything from Fast Food, to Waitressing, Retail for a number of years, and warehouse work. Went for a few years to Community, got great grades in everything except, you guessed it, math! Same Situation, had an understanding teacher \"Don't worry no one fails my class!\". He literally let me go and ask him almost every question on the tests and I did.\n\nI had thought to go into teaching but I have bad anxiety speaking when its a room bigger than about a dozen, I almost fainted in college speech class when I got up in front of a room of about 30-something students. I thought briefly of pursuing Social Work but not long after that, my mom had a stroke, then cancer, shes still alive and made a phenomenal recovery tho on both accounts. I stopped going to college around that time and got fired from the warehouse job (only job I ever was fired from in case that's relevant).\n\nSo this is where the roadblock comes in. I had to move back home after my roommate and her boyfriend got a condo (a little after I was fired). I found a job, that was my first priority. Its working leather, its a nice environment, small business that's less than 15 people, great product and employees, nothing stressful most days either....but it pays crap (only 10$ an hour) and the boss is a man child. I've been there for almost 3 years in a few months and NEVER have gotten a raise, and some of the employees who were there longer, they stopped getting raises as well. Everytime we ask him it was \"oh well I can't because taxes are coming up\" *Comes in with a new boat, \"Oh I cant because we just got new equipment you guys needed to make the product quicker\" *Comes in with not 1 but 2 motorcycles....yeah you guys get this picture. Now hes going thru a divorce, went back to being an alcoholic and is neglecting getting us supplies at times, and his wife owns half the company...we all decided we might as well not even ask for a raise this year lol. to top it off we have been slow for 3,4 months now, its like Im essentially making minimum wage with paychecks.\n\nIdk what to do, at all. I've been applying everywhere, for something on this level or better, I cant afford less than 10$ an hour its impossible to survive on that, I'm struggling like mad now with my current pay cuts, like if my car broke down, sure i have great credit but I don't think I could afford another, Id be screwed. I have applied at better quality retail like Aldi's and Costco due to having 3 years of experience and considered for Front End Supervisor at Sam's Club in the past, I would have to work my way back up but that's fine with me, but no one has gotten back to me. I applied at Walgreens as an assistant manager trainee, Really sold myself well in a video interview....no follow up. I looked into trades like Plumbing and Carpentry and...hey what do ya know? My old enemy, advanced math and formula's strikes back. I failed the 2 entry tests to get in. I tried getting a waitressing job again, no call backs from my local Olive Garden (I hated waitressing, so kind of a relief), I even applied to be a service tech to Spectrum and....yes, even a person who removes \"remnants\" at Crime Scenes since it doesnt require a degree (just finished that one today). At this point I'm starting to feel desperate and trapped, Unless the bosses wife gets the company, which who knows if she even is interested in it, then I'm screwed working here and I'm not going to sit on my bubbly butt to find out what happens with that! I'm now thinking of doing what my dad does and go for the post office, or even as a custodian as they make decent pay after a time if they are union. Garbage person too has crossed my mind... but beyond that, with no degree, my options seem to be narrowing down. Especially since Jobs don't seem to train but want someone with full experience.\n\nNow, since my credits are still good, I was thinking of going back to college. I even took a few classes on and off the last few years to finish up my science aspects for my Associates. But idk what to do. I like helping people so I was thinking of getting a social working degree or looking into something with Technology that does not require in depth, advanced, calculations-does anything like that exist in the tech area? But Idk what to do about the Math, that seems to be my main obstacle in, well, getting out of being poor lol :( and I have a stupid disability in it along with ADHD, go figure. No matter how hard I try, i cant pass Algebra or Geometry on my own or with help. Idk if Colleges can wave math if they see Im going to follow a career that has no use for it, because I feel, unless I can substitute classes, thats my only option. Even then, there is another problem-my parents cant afford to send me to a 4 year college, my sister is in her program for physical therapy and that's A LOT of money for my parents, especially since my mom cant work long hours anymore. Taking out loans seems scary too, I already cant afford dirt, barely enough for my car payments and cell phone with anything left over and I've read the countless horror stories online of people with tens of thousands of dollars worth of debt and no one hiring you out of college, sometimes up to multiple years if you have no experience in the field. I can probly pay to finish community College at least but I need a better job...but I cant get a better job without math or someone calling back.\n\nI feel like such a loser, having to move back in my mid-late 20's, no decent paying job, not having a totally clear idea of what to do, cant save up and cant afford much. Im just so beaten down and overwhelmed, I sometimes cry to myself, punch a wall, and even feel like just jumping off the bridge. Like, I hate this, it feels like its soooo difficult nowadays just to get by, or Im I just so broken down its just me and a few others at this point?\nWhat would you guys suggest? College again? try for an outside job with little math skills and keep searching in that arena, highway robbery lol?\n\nEdit: Paragraph breaks",
    "title": "What to do with my Career considering Dyscalculia, Job Options and College?",
    "subreddit": "careerguidance",
    "timestamp": 1508604114,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "I'm an actor and comedian losing my day job; What should I do before the clock runs out? I've been working as a full time caregiver for my elderly grandmother for the past 5 years, and I only have about a year before she goes into a home, and I'm struggling to figure out what to do, since I have a 4 year old son to support.\n\nMy life goal is to be a working comedian, but it's unstable and I need something consistent(for my son's sake) that will allow me to work on comedy and transition into a full time career.\n\nHere's a brief summary of my resume:\n\nWork:\n\n-Caregiver (5 years)\n\n-Resident Actor at a musical theatre company (1.5 years)\n\n-Youth Theatre Assistant, working with kids 6-18 years old (since April 2017)\n\n-Stand Up Comedian; active for about 2 years. Currently inactive.\n\n-Improv Performer with a performance troupe for 2 years.\n\n-Independent Music Producer\n\n-Costume Character for a character company, doing birthdays and special events as Spider-Man, Disney Prince, etc. (1 year)\n\nEducation:\n\n-Associate's Degree: Instrumental Music \n\n-Associate's Degree: Vocal Music.\n\n-100+ hours of improv training from Endgames Improv in San Francisco\n\n\nInterests:\n\n-*LOVE* reading and writing. I was a very gifted reader and writer as a child. I was reading at a college level in elementary school\n\n-Performance, obviously.\n\n-Music Production. I've been at it for several years and have gotten really serious about it in the past year, but I'm completely self taught.\n\n-Psychology is SUPER interesting.\n\n-I LOVE to learn. I audit lots of online classes on Coursera.\n\nUltimately, I want to be a performing comedian who also runs a YouTube channel.\n\nI'm considering going back to school and earning a BA in English. A Music BA is not possible, because the nearest colleges are too far away, but an English degree can be earned online, and it would only take me one semester to get the required lower division English units, since I have so many GE units already. From there an English degree would qualify me for a lot of business jobs (copywriting, marketing, PR, etc.) I could become an English teacher if I got my credential, which would be a pretty sweet day job for a comic, and it'd be decently fulfilling.\n\nThe only degrees that interest me are English(creative writing), Theatre, Communication, and Psychology.\n\nAnother option is the entrepreneurial route. Perform comedy, start my YouTube channel, and go hardcore learning about business and marketing through online resources so I can apply it to my business. Monetize my videos and sell merchandise. While doing that I could work a shitty day job.\n\nI have 1 year to get my shit together.\n\n1. What sounds like my best option?\n2. Are there any job or career options I'm overlooking?",
    "title": "I'm an actor and comedian losing my day job; What should I do before the clock runs out?",
    "subreddit": "careerguidance",
    "timestamp": 1499047138,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "Should I Become a Programmer or an Electrician? I'm in a dark spot at the moment to get my life together, but since I'm only 20 (turning 21 in a couple months), I'm in a good place to have said crisis. Here are my two options:\n\n1: Software Engineer\n\nThis is the job I want. I'm an indoors person. I don't mind sitting in one place using all my brainpower to solve problems as long as there's aircon and free shitty coffee. I like solving problems. I genuinely enjoy tackling complex problems and rearranging them into simple solutions. I've only just started taking up programming in python (at 20, I know. Bit of a late age) since yesterday and I'm surprised at how much I've gotten the hang of it. I'm also a fast typer, and I pride myself on my spelling and grammar skills. If I could be a programmer in a big city with a good source of income, I'd be happy. So happy, I tell ya. If I were somehow offered an $80k programming job, I'd weep like the day I was born.\n\nProblem is... I didn't do too well at math in school. I had the misfortune of going to one of those nowhere schools with depressed teachers that only showed up for a paycheck. I coasted through the math courses by pattern recognition alone. I didn't learn the intricacies of math and learn from previous formulas to create my own. Now that I'm 20, I'm willing to re-learn math from scratch and have an open mind about mathematics and make it a passion of mine. And to get my best foot in the door and not be automatically turned away by any of the more snobbish businesses (and hopefully not to be stuck at dead-end jobs), I'd have to undertake a computer science degree. I know. I know what you're thinking. I know I shouldn't do it if I suck at math, but I'm willing to unlearn and relearn, man. With enough discipline and devotion to study... can I do it? I don't know. At least not now. Before I forget to mention, I've actually got two computer science graduates in my family. One of them graduated with first-class honours and is currently undertaking a PhD. They'd be more than willing to help me. Well, at least the one without the PhD would at the moment. I know that slogging through a degree just to get a job isn't an amazing idea, but... whatever. I guess I'd better learn to love to study.\n\n2: Electrician\n\nThis is my safe route. As long as they know how to do the work, show up on time and slog through the hours, electricians get paid well. In fact, most skilled labourer types of jobs will. They're also pretty easy to learn all the insides and outs. Thing is, though, I have zero interest in manual labour. Not really a fan of it. If I start an apprenticeship, my heart won't be into it. I'd grow weary of the work fast. But it's a stable job that pays well. Long hours, but good pay. One thing that rubs me the wrong way with blue-collar work is the culture, especially here in Australia. I know that everybody's different, but the vast majority of labourers I'll run into are the bloke-ish fellas, whom I don't mesh well with.\n\nI'm in a battle between following my passion and hoping the money will come or following the money and tolerating what I'll put most of my living hours into. In short, I just want a job that challenges me, makes me excited (or at least tolerant) to challenges, jobs where I use my brain instead of my hands and feet, a job where I solve problems, a good salary, good work/life balance and a job where I'm surrounded by smart people dedicated to their work and enjoy what they do.\n\nThanks for reading. You can go get a drink of water now.",
    "title": "Should I Become a Programmer or an Electrician?",
    "subreddit": "careerguidance",
    "timestamp": 1488048071,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "Can you give me some ideas as of which possibilities I have with my current skills? I have finished a bachelor in arts and design, this included in the following: Fine arts, 3D design, filming, adobe photoshop, premiere pro, Illustrator and Dreamweaver. I have been the boss of a two man student enterprise which basically was carried by only me, even though forms and paperwork is my biggest weakness. I had character development and design, story design, design thinking, product design, professional practice as a comic artist, some caricature work, logo and banner designs.\n\nOther I have a one associate in teaching directed at arts and crafts, with some art history.\n\nCurrently I am having a course in webdesign, some extra 3D design and such.\n\nAs due to my studies taking a lot of time, I havent had much chance to do any part time jobs, though Ive learned I can do bartending pretty well, I know how to operate a cash register, and I can do some librarian duties.\n\nWith this in mind, what sorts of jobs, or further education would you recommend me? Im kinda tired of school, but I dont mind doing more if its more focused towards a certain career.\n\nI started late with my studies due to stuff happening in my early twenties, so I am not that young currently.\n\nAll I want is some thoughts and suggestions you can come up with based on what I have written, other than teacher or freelancer.\n\nPersonal hobbies and interests are gaming like Magic, D&D (DM'ing), youtube, cooking, helping others in their creative endavours with counselling or design ideas, thinking of new possibilities design vise for a product or project.\n\nMy weakness is that I have Adult Inattentive ADHD, which is both a strength and weakness, sometimes I finish a project in a day, while others I cant for the life of me concentrate on.\n\nRealistically, I want anything that plays on my ADHD strengths and doesnt care about my weaknesses, but that is a wild card most of the time.\n\nThank you for reading this long post, and thank you for your suggestions.",
    "title": "Can you give me some ideas as of which possibilities I have with my current skills?",
    "subreddit": "careerguidance",
    "timestamp": 1489331035,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "Semi-complicated question about getting into a CS career without a typical HS diploma This question is going to have to involve a lot of background, so prepare for quite a bit of text.\n\n**TL;DR: Life keeps throwing me curveballs, and despite stellar grades I'm two years behind for graduation. Is it possible/feasible to get a career in software development without a formal high school diploma? If so, how would I go about pursuing that?**\n\nI'm 18 years old, and I want to go into a tech job. While I'm not entirely picky on what specifically I go into, I know I am both good at and genuinely enjoy programming- my stepdad raised me, and seeing as he's a software developer I grew up with exposure to it, at age 10 or so I was already studying Python to learn some basic logic.\n\nUnfortunately, around age 12 my parents separated, and since then my life has seemed determined to screw itself up as much as universally possible. I'm now considering dropping out- not to give up and work a minimum wage job, but as a genuine option.\n\nBasically, I have had issues with public schools and the general American education system since 1st grade. I have ASD (autism spectrum disorder), and while I am plenty intelligent and capable, my brain doesn't do well with environments that most kids would've flourished in, and until I learned how to successfully imitate normal socialization, the other kids thought I was a bit odd. I switched schools at the end of 2nd grade. Then again at the end of 3rd. Then again, at the end of 4th, and 5th, and 7th, and 8th. Keep in mind, my issues have never been grades. I'm a straight-A, honor roll student. The issue for me was bullying and the general school environment- in 5th grade, I threatened suicide if my parents made me go back, and to this day I have nightmares about the bullying I went through and the way the administration handled it. (I didn't go back, incidentally- I finished 5th grade through independent study, and then 6th and 7th were completed through online homeschooling.)\n\nIn high school, I was doing okay for a record amount of time- 9th grade went amazingly, and about half of 10th did as well. Then, of course, because I was doing so well emotionally, my physical health had to fail. I spent the remainder of 10th grade in and out of the hospital, and was held back. It took about 2-3 years to figure out what was wrong with me and fix it- the anti-depressants I was on were making my body sick from serotonin overdose, and of course coming off of them gave me suicidal depression due to some major chemical issues in my brain.\n\nDuring that time, the school administration sucked. They tried suing me for truancy- yes, I was definitely skipping school so I could go hang in the hospital with IV lines. Super fun time, 2 kool 4 skool man!! Eventually, when we got a legal letter from the doctor saying I was NOT skipping school (Apparently, the dozens of doctor's notes were not good enough), they funneled me into the Florida Virtual School program. Uh, yeah, even kids who aren't chronically ill can't pass that program- the curriculum is notoriously horrible. I was in all AP classes prior to getting sick, and even I could not handle that workload. So, I got held back. I was now 1 year behind.\n\nNext year. We finally pulled enough teeth from the school board to get me into the Hospital Homebound program. This is supposed to be an independent study program like the one I did in 5th grade- but oh, no. This was just virtual school again, but with a tutor sent once a week to assist me. I worked like crazy, and managed to pass the year after working through weekends, breaks, holidays, and the summer. I didn't even finish all the material- the school board just gave me credits after the tutor attested to exactly how hard I was working.\n\nThe school board continued to give me issues repeatedly, the meanwhile I was working on how to combat my depression without Zoloft- to date, I've been on at least 5 different medications, have been hospitalized so many times that people raise their eyebrows at me when I can't remember the exact number, and have been seeing a therapist for a VERY long time. I'm considered a 10th grader by the school system, however I am in 11th grade classes, and am set to graduate in 2019... my original graduation date should've already happened, in this past May. All my friends from freshman year are now in college.\n\nI have tried every single option the district has offered. Partial schedule, where I go in for a few classes a day. Virtual school. They won't provide Hospital Homebound to me since I'm not considered incapacitated enough for it anymore, even if I wanted to go through that again.\n\nCurrently I'm about halfway through the equivalent of my junior year, and it's miserable. I sit through 5 classes a day, and every single one of them feels useless. I'm in honors, but I still finish about 30-40 minutes before everyone else does, leaving me to sit there and stew in my thoughts, not being allowed out of class to do anything more productive. Due to diagnosed PTSD from all the crap I went through with school as a kid and my autism-related anxiety when I don't have anything to do, over half of every day I'm in school ends in a meltdown. You know that meme, autistic screeching? Well, I don't scream, but I end up leaving class and sit in a guidance office for about half of every day crying and unable to physically get myself to speak more than a couple sentences out loud.\n\nTeachers refuse to read my 504, guidance refuses to listen when I say no, I can't go to class right now unless you do want me literally screaming under a desk. I was sent to a mental hospital during one of these incidents- they literally dropped me in with a bunch of suicidal kids, and I was there for 24 hours in living hell (Florida youth mental healthcare is NOT beneficial- it's more like a prison) before a psychiatrist finally realized I didn't need to be there.\n\nI do not think I'll be able to continue like this for another year and a half. I'm not learning anything, I'm sitting there listening to a teacher lecture me on things for an hour that'd take me 15 minutes to learn on my own on places like khanacademy. If I dropped out today, I am completely confident I would be able to study for and pass a GED test by the end of the 2017-2018 school year.\n\nI've done lots of research, but unfortunately most of what I find focuses more on a lack of a college degree than a high school diploma- from what I have gathered, it is entirely feasible to get hired without a degree if you build a portfolio, which is what I am currently working on. But next to nothing has any real information on dropping out of high school.\n\nI want to do something with my life, and that's not happening right now. I'm taking mindless tests and writing mindless essays that don't feel like they're benefiting me aside from getting me baby-steps closer to a piece of paper. I want a job, I want to get to doing what I have a passion for. The only reason I'm still in school is for that piece of paper, but if I don't truly, absolutely need it, then I am wasting my time and going through hell for nothing.\n\nSo- is dropping out a real option for me? Does anyone have any recommendations on how to move forward and get a career, if so?",
    "title": "Semi-complicated question about getting into a CS career without a typical HS diploma",
    "subreddit": "cscareerquestions",
    "timestamp": 1513199255,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "[US] PwC Flex Talent Network - AMA What's up /r/Accounting -- I've spent the past 3 busy seasons working at PwC audit as part of their Flexible Talent Network. I get a lot of questions about the program, and how it works so let's chat.\n\n**What is the Flexible Talent Network (FTN)?**\n\nIt's their way of bringing on supplemental staff for busy season. Most of you are familiar with seasonal staff from firms like Siegfried Group. This is similar, but PwC cuts out the middle man and employs you directly.\n\n**Is it for Audit or Tax?**\n\nI only have experience with Audit, but it looks like they have the program to Tax folks, too.\n\n**Who is it a good fit for?**\n\nI've met a really diverse group of people in the program over the years. Personally, I first joined because I wanted to spend half the year traveling. Now I spend my off months working on *The Abacus Show*, and building a business. I've met parents who want to keep their skills sharp, but still want to spend summer with the kids. Stay at home parents who spent the last 15 years raising the kids and want to get back in the workforce. One year there was even a 65-70 year old accounting professor who said he wanted to get some real-world audit experience to be a better teacher.\n\n**How is it different from working at the Big 4 through a third party temp agency?**\n\nBesides who signs your paychecks, I have no clue since I've never worked at one of the other firms. Maybe someone with more experience can chime in?\n\n*Obligatory disclosure - I've been doing this program for a few years, but I'm not currently employed by PwC, or speaking for the firm. Just sharing my personal experiences. Ask away!*",
    "title": "[US] PwC Flex Talent Network - AMA",
    "subreddit": "Accounting",
    "timestamp": 1500389813,
    "score": 8,
    "keyword": "man teacher"
  },
  {
    "text": "An AP Student's Issue Hi all! So I've witnessed a predicament. I'm an AP English student, and also one of two black gals in my class. As expected, I bonded with my fellow black sista, and we became friends. Then the class was notified on an upcoming year long project. We were to pick an inquiry (a topic of interest), and write a proposal to our teacher, who happens to be a white male. Of course we both wanted to pick poc related topics. I picked homophobia in the black community, and she picked colorism in the black community. We both received feedback the next week. Mine was positive, but hers was not. He explained to her how he thought colorism was the same as racism, and how that had been completely overdone. I saw the anger in her face, and wanted to scream at her for him. So now I want to tell him all about himself when I see his face. And I have about five months left with this man. Ugh.",
    "title": "An AP Student's Issue",
    "subreddit": "blackladies",
    "timestamp": 1514603926,
    "score": 23,
    "keyword": "man teacher"
  },
  {
    "text": "My teacher said men can't be raped... I'm going to be very vague and not give many details because I don't want my identity to be figured out. My female teacher, teaches a core 10th grade subject, recently went on a rant for about two whole periods about how men cannot be raped. Her initial argument was that if a man is raped by another man, it's considered sodomy. She said a man cannot be raped by a woman because its biologically impossible. She said if a women grabs a mans genitals with out consent, it's sexual assault. When I confronted her about this, she got very defensive, I pointed out the blatant sexism that her definition of rape has. She argued that it's not sexist because women have more \"fragile\" organs that can be damaged during rape. When I said that the mental damage is the same with women and men if not even worse with the people like her that put rape victims down, she said that the definition of rape she used is the current definition of rape used by the FBI. She stumped me because I did not know if it was true or not and I couldn't fact check it at the time. Later, I did some digging and found that the FBI did at one point use that definition of rape, but later changed it so that all sodomy can be classified as rape or something along those lines. I'm just at awe at the amount of kids that don't really know what being skeptical is and just retain all the information that a teacher gives them with out questioning it. I'm positive that there are now ATLEAST 30+ kids who now have the mindset that male rape isn't possible. More than half of them are male themselves.",
    "title": "My teacher said men can't be raped...",
    "subreddit": "MensRights",
    "timestamp": 1489635109,
    "score": 130,
    "keyword": "man teacher"
  },
  {
    "text": "I couldn't say no. A feminist piece. When I was five I started Kindergarten in Philadelphia. I was one of only a handful of girls in the class. At recess the boys would trip me and push me and call me names. I was small and not a fighter but to keep myself safe I would bite them. Everyday my parents would come pick me up and find me in the time out chair. The teacher would approach me and say, “Harley, aren't you sorry for what you did?” \n\nI said yes because I couldn't say no. \n\nWhen I was in fifth grade I was the only girl to join mathletes. I competed and won. I was the best person on the team. My teammates would tell me that if I were captain boys would feel intimidated by my success. They assured me that they would still let me have a voice but asked if I would be willing to not join the executive board and instead let four male peers run the team. \n\nI said yes because I couldn't say no. \n\nIn middle school I wanted to join the golf team. There wasn’t a girls team and a girl had never competed with boys before. They told me I had to drive a ball 100 meters which I could successfully do. They told me that as a girl, I could only join practice but not actually compete. They said I should be thankful they were even letting me do that. \n\nI said thank you and nodded my head because I couldn't say no. \n\nIn high school I started dating a boy. He was popular and well known in a city I was new to. He was funny and charming and smart. A few months into our relationship he confessed to a locker room of boys that we had had sex despite it not being true. It was important to him that people thought we had and my persistent protest didn't matter. He reminded me how much he cared about me and that I could depend on him for support at my new school. His friends would excitedly ask me if it had happened. I swallowed my pride and the truth. \n\nI said yes because I couldn't say no. \n\nMy first year of college I met a boy that lived close to my dorm. We hung out many nights and became close friends. He was interesting and made me happy but never seemed too interested in me. My roommates assured me that if I gave up my modest fashion sense I could attract him. They dressed me in a skin tight red dress. They smeared dark makeup on my eyelids. They pulled and straightened my hair and put me in heels I could hardly walk in. When they were done they took me to a mirror and proudly said, “You look beautiful. He's going to love it. Don't you?” \n\nThrough tears and disbelief in how different I looked I said yes because I couldn't say no. \n\nIn my second year of college I was out late studying. I didn't want to walk home in the dark so I called a taxi. I made clear to the driver that I had a credit card and no cash. He said that was fine and started the meter. 4 dollars later I tried to hand him my card. He complained that the card company would take a percentage and that this was too low a fee. I again explained that I had no cash. He locked the doors and became aggressive and angry. I paid him fifteen dollars. An eleven dollar tip to make sure I could get out of the car unharmed. As I left he said, “See that was easy wasn't it?”\n\nI said yes because I couldn't say no. \n\nIn my third year of college I was walking down a back road in broad daylight. There were other students on the street and I felt very safe. I was wearing a summer dress and flats. An intoxicated homeless man grabbed me in places I did not consent to. I ran, crying, home and contacted the police. After several months of meeting with detectives and correctly identifying my assailant he spent one night in jail. My case worker called and proudly told me, “I told you, that if you are honest and diligent, the justice system does not fail. Aren't you proud of what we've done?”\n\nI said yes because I couldn't say no. \n\nNow it is my last year of college. I have become loud and to many people annoying. I call out the blatant sexism most of our society is willing to ignore. I worked hard to put a competent woman in the white house and had to watch her say yes too many times. I marched with thousands of women to protest an encourager of rape culture from sitting in the oval office. \n\nFor 22 years of my life I have been conditioned to say yes. Today I start to say no.",
    "title": "I couldn't say no. A feminist piece.",
    "subreddit": "Feminism",
    "timestamp": 1492797835,
    "score": 27,
    "keyword": "man teacher"
  },
  {
    "text": "My Harvey Weinstein was my high school teacher. This is my story. It happened in a small, wealthy, Catholic high school--run by Catholic brothers, fairly conservative, extremely sexist, extremely homophobic, extremely white, highest position held by a woman was guidance counselor. As a senior, I chose psychology as my second semester elective. The instructor was an alumni, been teaching a few years after 20+ years in law, and well regarded in the school/entire community because he was also the football coach. His son was a student in my year. To the football team, he was not only Coach, he was also their best friend's/teammate's dad. People hung out at this guy's house. This teacher was also my home room teacher all year. He knew exactly what rules to break to make him popular as a teacher--never marked you late no matter what time you strolled in, let you do homework, and didn't care if your shirt was tucked in. Every female was \"sweetheart\". He gave every male a personal nickname. He was very dad-like. \n\nSecond semester, day one of his class, he shut the door and it started. Basically, we were told that what happened in that class, stayed in that class. We were going to talk about things that the \"boss\" wouldn't like--sex, drugs, rock and roll type things. He set up an \"us\" against \"them\" mentality really early. He told us we were going to get really close. He made it clear that if you weren't going to be cool about it, you needed to drop the class. Then, he specifically stated: \"if i ever make you uncomfortable, come to me and we'll work it out, don't get an administrator involved and ruin it for everyone else\". He started slow: making stupid sex jokes, telling us about his glory days as a lawyer in the 80s, making comments here and there about women's bodies in general. Then the \"jokes\" got a little more graphic--throwing in lewd hand gestures. When we got to a lesson that included sexual harassment, he told us that sexual harassment doesn't happen anymore. Women routinely lie or exaggerate and it ruins men's careers. And when men do cross a line, it's because they don't know any better and women need to lighten up. In his unit on abnormal psychology, he thought it was important for us to know that \"some doctors\" say that homosexuality fits the criteria of a mental illness. About this time in the semester, his style of dress started to became more relaxed. He started wearing basketball shorts with no underwear rather than his usual khakis. This was a very small classroom so he was less than a foot away from you if you sat in front, which I did. He told us that he had \"friends\" that commented on how hot the girls were at our school. \n\nOne day at lunch, sitting with 3 girls from my class, I worked up the courage to say, \"so Coach is like...a creep, right?\" The response was essentially \"yeah, you didn't know?\" He only taught 2 classes each semester. All seniors. He was a guaranteed A. That's how he got away with this shit. Nobody is going to rock the boat a few months before graduation and he knew it. Right before final exams we played his version of \"Girls ask Guys\". We were encouraged to ask ANYTHING, without embarrassment, because questions were going to go in a hat. What happens in class, stays in class, remember? We were graded on our discussion participation but we could say \"pass\". A lot of sex questions came up because we were all 17/18yr olds trying to play this demented man's game. We went around the room and were pressured to talk about sexual fantasies, masturbation habits, penis size etc. There was several days of this. Looking back, I think he humiliated us for his entertainment. This was in 2010. Last I checked, he is still teaching. Every word of this is true and I would testify in court if his day ever comes.",
    "title": "My Harvey Weinstein was my high school teacher. This is my story.",
    "subreddit": "Feminism",
    "timestamp": 1508369435,
    "score": 8,
    "keyword": "man teacher"
  },
  {
    "text": "People making you feel bad for your right to choose I have ben dealing with a creepy dude leering/borderline stalking me in school for 2 years, and when I finally mustered up the courage to tell my English teacher (I have anxiety, makes everything harder lol) she had sympathy for HIM, but not the person who has been constantly feeling victimized, uncomfortable, and upset for 2 years. \nWell this morning, I was bored and browsing the Social Anxiety Support Forum, and I was kind of appalled. Every time a woman talked about feeling uncomfortable around a man, calling them creepy or anything of the likes, everybody attacked her. It was all these \"niceguys\" who were saying she should be lucky to have the attention. Lucky to have the attention from somebody that robbed her of her feelings of safety. Just go on Google. Search \"creepy man\" for Social Anxiety Support Forum. And watch before your eyes, as people tear down uncomfortable women for being creeped out by somebody making them feel unsafe, even though they have a right to safety. For choosing who and who they don't want to date. Making them feel bad for turning down somebody who clearly was sending the wrong vibes. Smh. Hate to break it to them, but we won't bang every sleaze that comes up to us and says \"heeeyy pretty girl.\"  It makes me so upset that they expect us to want to do that in the first place. They're creepy because they reek of entitlement. Nobody's entitled to my vagina. I choose who I let in very carefully. We have a right to choose.",
    "title": "People making you feel bad for your right to choose",
    "subreddit": "Feminism",
    "timestamp": 1490475525,
    "score": 8,
    "keyword": "man teacher"
  },
  {
    "text": "the effectiveness of the female perspective in podcasting I am a comedian, and I host a podcast with my girlfriend about the complexities of dating, and understanding the opposite sex. I want to tell a quick story about how I changed perspectives on the issues that women face on the day to day grind.\n\n'The Sex Actually Podcast ' is equal parts stories of sexual experiences, both successes and failures, and also cautionary tales of where past relationships have gone wrong. We talk about what drives us, improving communication in our dating lives, and how our family upbringing molded us into who we are today. One thing I've learned spending countless hours chatting with Tasha, my live-in partner and cohost, is that women don't always have the luxury of sharing stories of the freedom of a drunken night gallivanting around town. Too often the story ends with a man fucking up a woman's trust and freedom to be present.\n\nI guess this post is a 'feminist teacher appreciation post', which I look forward to doing more often. Instead of shaming me for not walking a mile in her shoes, or shunning me for not being able to relate, Tasha takes the time to explain to me her day to day experiences. I've learned to listen. Just last week, an innocent trip to the grocery store ended with her being followed around several aisles because a man decided it was the appropriate market to be hitting on women. He didn't accept her social cues and commented on her boobs by telling her 'looks like your girls are out to play'. Ya dude, Frozen Food aisle is the new tinder. And the thing about men is, he would have never made her feel uncomfortable if I was shopping with her. We respect women in the presence of other men, but then when alone, cowards like frozen food guy emerge with their witty pickup lines.\n\nTasha will never know the freedom that I have to get drunk with friends, stumble home on the subway, interview for a job solely based on merit, and so many other countless basic rights. I am a comedian, it is a privilege to speak my opinions. Tasha works as a model. She's a brilliant thinker, very well read and a major advocate for the feminist movement. Yet, she is encouraged to not show emotions, never mind take a stance on social issues. Some men want to look at models, not hear them think. It makes the models human, and that ruins their experience. Can't keep that boner hard if these models keep yapping about ways to improve humanity. Yuck.\n\nThis past election season Tasha posted an instagram pic in support of Bernie Sanders. She was nervous to share her opinion, as most of her photos are lifestyle images, showing off a carefree and opinion less side of her. Most of Tasha's following was supportive, but it only takes one asshole to highlight the issues women face. “You're not pretty enough to offer thoughts on politics. UNFOLLOW”. Quick research showed us that this comment was written by a dude who is a college football coach and father to a teenage girl. THIS opened my eyes to the shame and control of thoughts that men put on women. Now clearly this man has issues, but he said what a lot of men think. 'Not now honey, the men are talking...'. A quick attempt at doing something meaningful that doesn't exactly fit into the confines of her job description was swatted down effortlessly by a stranger online. I was there to comfort her, but the helpless feeling of not being able to confront this dude face to face helped me realize that women feel that feeling everyday. Not being able to fight a fare fight. Unfortunately it took the ignorance of another man to show me which side I want to be on. Tasha and I bonded that day.\n\nWhat I love about our show and our relationship in general, is that we challenge each other's point of view. We are fortunate enough to be having a dialogue together that I've never had with women before. We don't always agree on every issue, but I hope other couples are having similar discussions. Understanding each other will help us resolve the issues that come from a lack of empathy. Respect isn't something owned only to our mothers, sisters and wives, but also to the stranger at the grocery store, or woman walking alone on the street. Men, we aren't losing our seat at the table, we're just finally letting women enjoy the meal with us. Lets listen.\n\nThanks for reading my 'appreciation post'. If you want to listen to our podcast, here's the link. Thanks so much for the love! -Dave Neal\n\nhttps://itunes.apple.com/us/podcast/sex-actually-with-dave-neal-and-tasha-courtney/id744156889?mt=2",
    "title": "the effectiveness of the female perspective in podcasting",
    "subreddit": "Feminism",
    "timestamp": 1512500477,
    "score": 4,
    "keyword": "man teacher"
  }
]