[
  {
    "text": "Cover letter advice on a pretty unique situation Hi I would appreciate any advice on this issue as I'm not experienced enough in the job market  and this is a pretty unique situation I got into\nVery long post, long but true story\n\nI completed my PhD and some months after applied for a great job in another European country (I'm from a southern European country) and was offered the job to start 2.5 months after (which is standard at that company)\n\nA few months before that interview I started dating a girl and things evolved quickly and we fell in love, which during the months between the interview and the date I had to go grew even more and we knew we want to be together. But there was a big issue, she was an ilegal immigrant in my country (she came with her father and overstayed). This means that she was unable to go with me. She could go back to her country and come meet me after 3 months (which would make her legal in her return) but she would be unable to work during the entire period I would be working there which could be many years.\n\nThe second option, which was what we took, involved trying to make her legal in my country by entering in a stable union (like a marriage) which would allow her to then be legal and work when we went together. The manager (would be boss) was very generous and allowed me to delay the start of the job for 4 months later to attempt to solve the situation this way. We tried to do it and were unable to make it work due to the stable union not being recognized due to her being ilegal (even though our lawyers said it should be), and the same when we tried to marry. So she went back to her country and came back a bit over 3 months after. \n\nThe day of my departure came and I had everything ready to go. On the morning of the flight my documents were stolen so I was unable to travel and since it was during the vacations period the bureaucratic procedures in my country work very slowly so my entry was delayed, first for 2 weeks and then the human resources told me it was for a month for their own internal procedures. \n\nBack to the girlfriend situation. She had gone to her country and after a few weeks we found out she was pregnant. We decided to keep the pregnancy as she would have a lot of difficulty having a kid later on as she has PCOS. She came back to my country 2 days before my departure date and, it could be from the stress of changing countries, she had a miscarriage. It affected her brutally due to the high probability of not being able to have kids later on, she went out of her mind and made up her mind that she would be unable to feel ok if we went due to what happened as she would be deeply depressed and be very isolated due to my job involving many hours out of home. \n\nGoing alone would mean she could not stay in my country either and wait until she felt better, as she came with a visa to marry and the marriage process would take long. If I went she would have to go with me against her will or go back to her country. At the time the situation was such that I had to decide between breaking the relationship, or staying.\n\nWith all the drama and my family pressure (they never wanted me to go) I panicked and sent an email explaining briefly the situation saying I couldnt go at the time and couldnt ask for another delay as it was a third one and it didnt feel right to ask for that reason (huge mistake, should have asked of course but was not thinking clearly). A few days later I sent an email asking for a delay of 2 months to try to solve the situation. I received a reply a week after saying the job was cancelled. After around a week I sent an email to the manager apologising again and explaining the situation with a bit more detail because I felt it was the least I could do.\n\nNow after around 3 months they opened a job slot that is very similar to what I had applied. I want it, a lot, and I'm a good fit for it. What I fear is that (understandably) they view me as unprofessional, that Im not trustworthy and that they doubt my commitment. I understand that, as the whole story is very complicated and the fact is that I gave my word that I would go (despite no contract being signed), and 3 times on the date that I was supposed to go I had to ask for a delay. I feel ashamed of that and I have always been a man of word, but the situation involving my family affected me too much emotionally that I didnt think clearly. I have learned my lesson now, at great cost due to the opportunities missed.\n\nWhat could I do to try to restore my credibility and make them believe I'm commited?\n\nAt the time of the interview I was asked about my commitment and I gave my word that if they offered me the job I would go. I kept my word up to the point of the family issues. Between the time of the interview and the first starting date I was called for interviews for two jobs at a great international organization that offered even better pay and was at a better location, and for another job in switzerland that offered even better pay. I refused on the spot to keep my word. After a few months I was offered a teaching job in my city and refused for the same reason. Now I'm unemployed and with a high probability of remaining so as the job market for phds is seasonal, most job are to start in September next year.\n\nI will apply for the position, but I'm not sure on the following:\nShould I mention any of this even briefly in the cover letter?\nShould I try to show them I keep my word and this was an exception because it impacted my personal life tremendously? Should I contact the manager (would be boss) directly and mention any of this? For example by mentioning I refused the other job interviews\n\nTL DR: got a great job offer a year ago, for 3 times had to ask for delay (months) in the starting work date for family reasons (and one time for documents stolen) and the job was cancelled. Now a similar job opened and I want to apply. What could I do to try to restore my credibility and make them believe I'm commited? In terms of the cover letter and potentially contacting the manager (would be boss) directly",
    "title": "Cover letter advice on a pretty unique situation",
    "subreddit": "jobs",
    "timestamp": 1512352558,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "My new manager made me get on my knees.. Sexist treatment and advice needed. ***Edit: UPDATE!!!!! I emailed a very detailed email to HR last night. I had my previous manager proof read it first to make sure it was very professional and informative. We settled on a final copy and I sent it in. The only reply I've received so far today was along the lines of \"We got the email. We are going to discuss it. You'll hear from us soon.\" So HOPEFULLY they take me seriously and fix the issue. If anything negative occurs, I will be contacting a lawyer. Thank you for all the kind words of encouragement!***\n\n\n\nHello! First I want to apologize for any formatting issues, I am on mobile. \n\nI finally got a job in December 2016 after nine months of unemployment due to a car accident. I thought I had struck gold with this job. I had a fantastic (female) manager and a friendly coworker (male). I'm going to call the coworker Jimmy. \n\nI work for a very high quality shoe store. At the end of December, my amazing manager told me she was quitting for a better job opportunity. I was happy for her, and excited to have another manager that was rumored to be a great guy. \n\nWhen the day came for the new manager to come (Let's call him Greg), I was welcoming and friendly to him. He seemed nice, but things have quickly gone down hill. \n\nAfter a week here he changed the schedule (we usually do it monthly) so that I almost always work with him. I am well trained and used to working on my own, but suddenly I'm stuck with him daily. He started calling me to his desk for me to lick his envelopes for him. Jimmy would be sitting right there, but he would make me come over and do it. It made me very uncomfortable. \n\nThen one night, he and I are alone at the store. With it being a high end store, it isn't very busy usually. He tells me I need to practice because I'm not doing very good at my job. I was very confused because my customer reviews are fantastic and my sales are good. He made me go out onto the sales floor, get on my knees and take off his shoes. He then made me measure his feet. Measuring feet is not a complicated thing! He throws in a few pointers and I politely thank him for the advice and explain I've already been trained on measuring. He ignores me and makes me go get shoes for him. I try to hand him the shoes, but once again, he makes me get on my knees and put them on him. He went on to grab my pants later in the evening and pull up my pant leg to show all the way up my calf to \"look at the way I tie my shoes\". \n\nI felt like he was trying to prove his dominance or something. I felt uncomfortable and creeped out. I asked Jimmy the next day if Greg had made him do the same thing, but Jimmy hadn't had to do it. It's been weeks and he still hasn't had to do it. \n\nGreg has gone on to make it my job to do all the store cleaning. Him and Jimmy do the \"manly\" things like shoe repairs and fixing things. I feel incredibly discriminated due to my gender and sexually harassed. \n\nAny advice or opinions would be greatly appreciated. Once again, I apologize for any grammar or editing mistakes. Have a wonderful day!",
    "title": "My new manager made me get on my knees.. Sexist treatment and advice needed.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1487690235,
    "score": 243,
    "keyword": "man lawyer"
  },
  {
    "text": "It could have been me. When I was 12 my mother remarried. He was a very large man who had the ability to spin shit into gold. Some might say sociopath, others would say charismatic. I will tell you what many other girls will tell you. He was a predator.\n\n\nWhen I knew him he cheated on my mother and was violent with me. I didn't know at the time but he was sexually abusing girls my age. It has come to light that he has a laundry list of victims. His most recent was his last. He was caught, indicted, and looking at a minimum of 25 years without parole.\n\nAfter my mother divorced him, he remarried and had children. He told my mom that he would rather be miserable than divorced. His first wife left him, his second wife drove into a tree. He preyed on 14 year old girls. Girls so small and young, they didn't have many options for self defense.\n\n\nHe was always a coward. In highschool he would throw up before a football game because he was afraid of getting injured. Instead of accepting his fate in prison (he was a former prison guard and lawyer so he wasn't going to have many friends), he decided to eat a gun.\n\n\nWhen I heard the news that he was no longer in possession of his skull, I laughed. I told him he would eventually kill himself, just a matter of time. It was quite possibly the happiest day of my life.\n\n\nBut now it's all starting to sink in. He became violent with me because I wouldn't play his games. He wasn't going to be able to do anything sexually with me because I always met him with hostility. My instincts knew what he was, I just wasn't aware of how bad it could have been if I didn't fight.\n\n\nI was abused by my own father, I was sexually assaulted by someone I once called a friend, and I was raped later in life. The only reason I didn't become one of my stepfather's victims is because I fought back.\n\n\nThis is my message to everyone. Fight. It doesn't matter the outcome. But you fight with every ounce of strength you have. You fight for your life. If someone is determined to hurt you, then you make them earn it. Don't ever stop fighting, until one of you can't get back up.\n\n\nBecause I chose to fight him, I was injured multiple times. His favorite thing to do was to slam my head into the granite foyer or brick kitchen floor. He ended up giving me three concussions. But he was never able to get my clothes off. In turn, would stand over him with a baseball bat while he slept. When he would wake up I would tell him to go back to sleep or I would crush his skull. He always chose to go back to sleep.\n\n\nIf you ever find yourself in a situation where someone is trying to hurt you, fight back. Yes, you will likely be hurt in the process, but don't give them an easy win. That sack of shit was 6'3 and 325 pounds. I was 5'2 and only 130 pounds. But I was able to fight back enough from being abused in far worse ways.\n\n\nAs for the coward, he's no longer able to spin his shit into gold. And neither god nor satan can save his sorry ass. The truth is now known. He can't hurt anyone else again. And the only ones left to defend him are his mother and sister.\n\n\nFor all of the young girls he abused after he left my life, I am truly sorry I didn't crush his skull with that bat.",
    "title": "It could have been me.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1495680466,
    "score": 117,
    "keyword": "man lawyer"
  },
  {
    "text": "[Support] I need this off my chest TW: Child Abuse and Molestation\n\nThere's so much on my mind, this is going to be very scattered. There's a lot more to all of this too, but I need something off my chest. \n\n4 Years ago on mothers day, at age 14, my maternal great uncle molested me. A man I had never felt comfortable around, a man my family always pushed me to hug when I saw him and get close to because we 'were just so similar!' A man who tried to buy my silence after it all but 'forgot his wallet.' The next day at school I immideatly went to my principal, I confessed it all to her, talked to the counsellor, found myself at the local advocacy centre within hours. I made my case, he was arrested, I continued the process. He luckily pleaded guilty, but got not jail time (because you know what they do to child molestors in jail... and he was too old to handle it). I had a restraining order, thearpy, but only half a supportive family.\n\nMy unlces assured me that my great aunt would be divorcing him, and my aunts offered all their support. But my mom simply couldn't believe it. Turns out, my great aunt did not want to divorce him, may even believe I made it all up (I simply don't understand, her husband pleaded guilty). My grandmother was torn between her sister and her granddaughter. But my older family had silently decided that things like this should stay within the family, in fact never even brought up. And that my speaking out had runied the family name and their reputation (He had been a lawyer, happily retired and big in the community). I feared that my great aunt staying with him meant that not all parts of my case would be respected; I had mentioned in this case that I feared for his grandaughter, a girl who was about 4 at the time (the age I remember starting to get weird vibes from him). The judges order was that he could not drink (He had been drinking at the time of the abuse), he couldn't see me, but he also could not see his grandaughter more than once a week and definiltey not without another adult present. But who was going to enforce that when his whole family was against me? And I was powerless to do anything.\n\nIt took my mom a couple years to come to terms with the situation, realise that I was the one who was wronged and how to respect me now. It put a strain on our relationship but it's nice to have my mom back. My paternal grandmother couldn't respect my privacy following it all, and I still can't talk to her. \n\nA few months after it all when I went to confess to my friends about the situation, my best friend got mad. Said I should have told them sooner, that they would have done something, they were so angry. I bawled, I had no intention of hurting anyone and had done nothing wrong. \n\nThe other day my mother and I saw my great aunt at the grocery store and she stopped in her tracks and had the most sour look on her face before turning away. I coudln't believe it and it sat so unwell with me for the rest of the week. \n\nMy point is that the only person allowed to be mad in this situation is me. I'm the one that got abused. I'm the one who has to live with this now. I can't celebrate mothers day anymore. Oh I ruined your husbands reputation? I don't care, you have no right. I didn't want to talk to you about the most awful moment of my life right after it happened? You wern't the victim, I was, you don't get to be upset. It's been almost 5 years and I am sick of always being apologetic over this. I never got to be angry. I want to get angry, I want to yell. I'm tired of everyone else getting angry at me because of how much this has messed up stuff for them when it should be me that is mad with him.\n\nThanks for listening. I just am getting so tired of all this and I needed to get it out. I'm hoping this helps.",
    "title": "[Support] I need this off my chest",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1504587978,
    "score": 78,
    "keyword": "man lawyer"
  },
  {
    "text": "My (19F) experience with my abusive father, and new information that has come to my attention that I don't know what to do about. **TW: ABUSE** sorry I know this is going to be a very long post but if you bear through the whole thing, I commend your efforts. haha!\n\n Ive been hiding this new information for almost a year and I dont know what to do. I've seen this thread help many people just get things off their chest so I thought i'd give it a try. 4 years ago I discovered my father was sexually abusing me without my knowledge. not physically, but by placing hidden cameras in my room and shower and recording me having sex, changing, showering, and sleeping. He saved the videos and photos with very pornographic titles. I was 15. I took him to jail and he stayed there for a year and a half. and that's on top of a bunch of company theft charges (over 50k worth of theft from his company where he was a theft prevention investigator for a shipping conpany.) They came across tje theft in the police raid of my house. He had a good lawyer. surprisingly enough, this is not the secret. this is just background info. \n\nBasically last year, my cousin who I consider my brother who is about 10 years older than me and lived in my house when I was 3-6 came to me with his own history with my father. he flew out from across the country to visit his own parents and to talk to me in person. turns out when he was living at my house, amd even before then, my dad was very sexually forward with my cousin. never PYSICALLY did anything,  but my cousin would walk in on him while my dad was supposed to be working in the back office of my grandmother's family buisness where he would find my dad sitting there, masturbating to porn amd he would grab a stool and tell my cousin to sit down. he would then talk to him about what he was doing and what he was watching, and he would keep going while talking to him. this happened on a few occasions when my cousin was only 10, he never told anyone. \n\nlater when he was forced to move in with us, my dad would consider him like a \"guy friend\" now that he was a young teenager.  he would take him on long car rides and brag about his sexual endeavors before my mother, AND about sexual endeavors WITH my mother. Bragged about how she was a \"little christian virgin\" when he met her but he was persuasive. My dad also set up a camera system so he could send live feed video of what was happening in my parents room (him having sex with my mother) to downstairs in my cousins room right to my cousins tv with some wiring.  my cousin OBVIOUSLY never used it and tried to pretend it wasnt there. When my cousin was still young he moved out of our house the moment he could and moved across the country and started working. I remember being oblivious and sad about it that I was losing my brother so abruptly but now I'm just so terrorized by the fact that he lived through all that against his will for so long. \n\nI'd like to add that my mother was never aware of the videos being taken, as my cousin recounted in some of the videos my dad forced him to watch, my mother said something like \"is that camera thing on?\" concerned, to which my dad replied \"no, the red light means it's off\". I believe she had nothing to do with any of this as she is a sweet woman who had to deal with this man's terrorizing emotional and sexual abuse her whole life.\n\n She is also aware of the fact that she might suffer from a learning disability as she never did well in school outside of music class despite her many efforts, and she had to repeat many early grades. I believe this because of her maneurisms now, her language barriers and overall difficulty understanding concepts. I love her to death, I just know she does struggle with these things. My dad knew this too and constantly took advantage of her and controlled her.\n\nMy cousin has given me full rights to tell anyone I wish about what happened to him, primarily my older sister who is heavily still connected to my father and backs him a lot. My dad is a VERY controlling man and my sister has always been extremely close to him. he never abused her. He treated her better than he treated anyone. spoiled her, let her do anything she wanted, which was sports, which made him love her even more. He did not love me. I for some reason was a resilient and smart child and I didn't conform, which made him abuse me mentally as a child even more, amd spank me profusely. I grew up to be a bit more of a sexual person than my sister, which made him want to control me even more. My sister was luckily asexual and my dad loved that about her. \n\nI want my sister to see more evidence to what a truly terrible man he is. I also want my mother to know because it is her right to know she was abused more than she knows, but I don't want to upset her if she doesn't need to know. I also feel like this isn't my information to share even though I have permission. I'd rather it come from my brother, but perhaps him talking about it is harder than he made it seem when he opened up to me about it.\n\nMy cousin does not wish to press charges because it is so far in the past, and he feels guilty for not saying anything because he could have potentially prevented what happened to me. Also the only evidence he has at this point is his word. I don't know what to do or who to tell or if I should tell anyone, and to be honest just getting this off my chest is more helpful than I thought it'd be.\n\nI don't really know what I'm asking for here. maybe some guidance. maybe just some moral support. Ive never seen psychological help outside of my school social worker who was admittedly extremely helpful but that was only for about 6 months after the initial incident. Maybe that's something I should seek. \n\nI don't know. has anyone been through anything similar? I think I just need someone to open up to about this, so thank you for being that someone.",
    "title": "My (19F) experience with my abusive father, and new information that has come to my attention that I don't know what to do about.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488540311,
    "score": 43,
    "keyword": "man lawyer"
  },
  {
    "text": "Advice dealing with A-hole doctors My mother-in-law is a surgery tech (forgive me as I do not know the breakdown of nursing hierarchy) in a cardio hospital. She is also non-union. She is coming up on retirement in the next few years and is at the end of her rope.\n\nShe called me in tears today asking what she should do about the doctors that she works with. Apparently in the OR they constantly make sexual remarks, recite vulgar rap lyrics, make sexual gestures (IE humping the table), etc.\n\nShe's not a prude by any means but she feels very disgusted by their antics. I was surprised when she told me these guys are in their late 40's to early 50's! I know surgeons have egos but it sounds like a jackass of man-boys...\n\nMy advice to her was to speak with the other nurses she knows feel the same way she does and have each of them start documenting privately what these dipshits are doing. When enough becomes enough, and I am sure it will, they can go to hospital admin with what they have documented. \n\nIf that falls short then a lawyer or even going to the news is an option....I think. I told her that she is probably in the best position to challenge them since she is close to retirement. Shes close to the take it or leave it stage but isn't ready to pull the pin yet.\n\nDoes anyone out there have experience with this???",
    "title": "Advice dealing with A-hole doctors",
    "subreddit": "nursing",
    "timestamp": 1486678962,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "What do I do with my life? I feel like I'm enduring a crisis right now because I'm an 18 year-old Canadian male, graduating next year, and I have no clue what I want in life in terms of a career. Throughout my time in high school, I've always worked hard for good grades and took higher level courses to keep my options open. However, it never occurred to me that I don't even know what I want to do; not even the slightest idea. I've always been into music, and I've become an experienced musician over the years. I'm very interested in music production, and I've been making beats for some time. You'd think I'd just do something with music, but based on conducted research, I've come to the conclusion that most jobs related to this kind of hobby make fuck nothing. \n\nMy uncle is one of the most prestigious lawyers in the GTA, and owns a firm. He's assured me that I have a spot at his firm if I decide to study law. He makes close to $600,000/year. I've always been dedicated to my studies, and no different in the workplace. Despite this, I do not believe money is entirely happiness. I believe it plays a critical part, but I believe that loving your job is as equally important to the salary. Unfortunately, my uncle and I both become very stressed when working at the firm.\n\nI'm not sure if I should man up, suck it up, and study law or to pursue something I actually want to do. I'm not very interested in anything other than music, and do not stand a chance in the competition for my other interest (medicine). I've concluded that if I do not figure my shit out sooner or later, I'm going to apply to the Canadian Forces as an infantry unit. I'd rather fight to protect others than be a loser.\n\nI'm asking for your input because honestly, I've got no idea myself and my career counsellors are pretty rubbish. I'm also very open to any criticism so if you've got shit to say, I'd like to hear it. Thanks in advance guys.",
    "title": "What do I do with my life?",
    "subreddit": "careerguidance",
    "timestamp": 1500618814,
    "score": 5,
    "keyword": "man lawyer"
  },
  {
    "text": "What could I do to try to restore my credibility and make the company believe I'm commited? Hi I would appreciate any advice on this issue as I'm not experienced enough in the job market  and this is a pretty unique situation I got into\nVery long post, long but true story\n\nI completed my PhD and some months after applied for a great job in another European country (I'm from a southern European country) and was offered the job to start 2.5 months after (which is standard at that company)\n\nA few months before that interview I started dating a girl and things evolved quickly and we fell in love, which during the months between the interview and the date I had to go grew even more and we knew we want to be together. But there was a big issue, she was an ilegal immigrant in my country (she came with her father and overstayed). This means that she was unable to go with me. She could go back to her country and come meet me after 3 months (which would make her legal in her return) but she would be unable to work during the entire period I would be working there which could be many years.\n\nThe second option, which was what we took, involved trying to make her legal in my country by entering in a stable union (like a marriage) which would allow her to then be legal and work when we went together. The manager (would be boss) was very generous and allowed me to delay the start of the job for 4 months later to attempt to solve the situation this way. We tried to do it and were unable to make it work due to the stable union not being recognized due to her being ilegal (even though our lawyers said it should be), and the same when we tried to marry. So she went back to her country and came back a bit over 3 months after. \n\nThe day of my departure came and I had everything ready to go. On the morning of the flight my documents were stolen so I was unable to travel and since it was during the vacations period the bureaucratic procedures in my country work very slowly so my entry was delayed, first for 2 weeks and then the human resources told me it was for a month for their own internal procedures. \n\nBack to the girlfriend situation. She had gone to her country and after a few weeks we found out she was pregnant. We decided to keep the pregnancy as she would have a lot of difficulty having a kid later on as she has PCOS. She came back to my country 2 days before my departure date and, it could be from the stress of changing countries, she had a miscarriage. It affected her brutally due to the high probability of not being able to have kids later on, she went out of her mind and made up her mind that she would be unable to feel ok if we went due to what happened as she would be deeply depressed and be very isolated due to my job involving many hours out of home. \n\nGoing alone would mean she could not stay in my country either and wait until she felt better, as she came with a visa to marry and the marriage process would take long. If I went she would have to go with me against her will or go back to her country. At the time the situation was such that I had to decide between breaking the relationship, or staying.\n\nWith all the drama and my family pressure (they never wanted me to go) I panicked and sent an email explaining briefly the situation saying I couldnt go at the time and couldnt ask for another delay as it was a third one and it didnt feel right to ask for that reason (huge mistake, should have asked of course but was not thinking clearly). A few days later I sent an email asking for a delay of 2 months to try to solve the situation. I received a reply a week after saying the job was cancelled. After around a week I sent an email to the manager apologising again and explaining the situation with a bit more detail because I felt it was the least I could do.\n\nNow after around 3 months they opened a job slot that is very similar to what I had applied. I want it, a lot, and I'm a good fit for it. What I fear is that (understandably) they view me as unprofessional, that Im not trustworthy and that they doubt my commitment. I understand that, as the whole story is very complicated and the fact is that I gave my word that I would go (despite no contract being signed), and 3 times on the date that I was supposed to go I had to ask for a delay. I feel ashamed of that and I have always been a man of word, but the situation involving my family affected me too much emotionally that I didnt think clearly. I have learned my lesson now, at great cost due to the opportunities missed.\n\nWhat could I do to try to restore my credibility and make them believe I'm commited?\n\nAt the time of the interview I was asked about my commitment and I gave my word that if they offered me the job I would go. I kept my word up to the point of the family issues. Between the time of the interview and the first starting date I was called for interviews for two jobs at a great international organization that offered even better pay and was at a better location, and for another job in switzerland that offered even better pay. I refused on the spot to keep my word. After a few months I was offered a teaching job in my city and refused for the same reason. Now I'm unemployed and with a high probability of remaining so as the job market for phds is seasonal, most job are to start in September next year.\n\nI will apply for the position, but I'm not sure on the following:\nShould I mention any of this even briefly in the cover letter?\nShould I try to show them I keep my word and this was an exception because it impacted my personal life tremendously? Should I contact the manager (would be boss) directly and mention any of this? For example by mentioning I refused the other job interviews\n\nTL DR: got a great job offer a year ago, for 3 times had to ask for delay (months) in the starting work date for family reasons (and one time for documents stolen) and the job was cancelled. Now a similar job opened and I want to apply. What could I do to try to restore my credibility and make them believe I'm commited? In terms of the cover letter and potentially contacting the manager (would be boss) directly",
    "title": "What could I do to try to restore my credibility and make the company believe I'm commited?",
    "subreddit": "careerguidance",
    "timestamp": 1512390187,
    "score": 1,
    "keyword": "man lawyer"
  },
  {
    "text": "I Hate Being a Lawyer. I've casually browsed Reddit for years, ever since my first job after law school in the Los Angeles office of a Boston-based firm.  This is my first post.  I write it in the middle of the night, unable to sleep, and dreading the fact that tomorrow (technically, today as it is after midnight) is yet another Monday at the office.\n\nI hate being a lawyer.  A lot.  Frankly, I'm not even sure what the point of this post is other than to just...get it off my chest I suppose.  I have not shared this fact with anyone, and I imagine that most people I associate with don't have any idea.  I guess that relative anonymity of Reddit is helpful in that regard.\n\nSo, why make this post now?  On some level, I have just had enough.  I couldn't sleep tonight due to extraordinary anxiety about my caseload of what I estimate to be hundreds of ongoing, complex cases.  Yes, I have associates, paralegals, and support staff helping but at the end of the day, the proverbial \"buck stops here.\"  I took my increasingly regular daily does of Xanax to try to sleep tonight, but it didn't help.  As sad as it may sound, the only thing that seems to help is literally doing more legal work.  Sick, right?\n\nAnyway, on one level I just feel trapped.  I become a lawyer about 6 years ago.  I miss the lifestyle I had before I did so; renting a room in Somerville (a suburb of Boston); driving an old Toyota when I wasn't riding on the T; having no real bills (other than law school loans, of course); and just enjoying life.  I was responsible for nobody other than myself.  Things have changed.  I have a wife and a daughter; a mortgage; my wife and I each drive luxury cars, save for our daughter's college fund, and live a relatively expensive lifestyle.  Sometimes when days get really bad I've casually looked around for other careers paths, but nothing even comes close to what I'm earning now (Base of $300k per year).\n\nAnyway, like I said, this post doesn't really have much of a point to it.  I just felt a need to vent I guess.  I work god damn near eighty hours per week 6-7 days per week, for fucking rude, demeaning, pain-in-the-ass clients; deal with ungrateful, incompetent staff; and, maybe worse yet, have to put up with quite often condescending and entirely unimpressive judicial officers.  The level of anxiety I feel these days is off the fucking charts.\n\nPlease, for whoever reads this, do not go to law school.  If you are there, leave.  Now.  Run, and run fast.  Even if you finish and join a decent firm, you will become a slave to a lockstep system that will literally own you.  It's terrible, but you will build a lifestyle around it.  And then, there you are.  Stuck, litigating with asshole lawyers over minutiae, only because you know that fill-in-the-blank bill needs to be paid.\n\nFuck this profession.  Oh my god, just fuck it.  I want out.  I went in to this profession for the money, and not any other reason.  I think that is typical of many lawyers.  Even putting aside the fact that law generally pays shit outside of Biglaw and some specialized midlaw, once you \"succeed\" in getting into one of these firms you become addicted to the money.  It simply does not fix it anymore.    \n\nMan, it's just so shitty.  I want out so badly.  Has anyone out there successfully done so?",
    "title": "I Hate Being a Lawyer.",
    "subreddit": "LawSchool",
    "timestamp": 1488189232,
    "score": 137,
    "keyword": "man lawyer"
  },
  {
    "text": "Law school starts in a month.. Am I the only one chillin? Hey everyone long time lurker first time poster here. I'm an 0L excited to start my law school  journey next month. Aside from flipping through law school confidential I haven't really started preparing anything else. I thought this was the best course of action under the advisement of recent law school grads and close friends who are lawyers themselves.\n\nTo my surprise, when I asked a fellow 0L if he  wanted to catch Spider-Man in theaters before school started he replied he was too busy as he was getting ready for his SECOND prep course and had immense amounts of work. \n\nWtf? I'm Uber competitive and am hell bent on crushing 1L..  So am I doing myself a huge disservice not taking the intro to legal writing/prep classes offered by my law school this summer ?  I'm a non-traditional student at 30 but I still feel pretty good about my academic abilities and writing skills. Thanks in advance for your input \n\nEDIT: more background: full ride at a tier 2",
    "title": "Law school starts in a month.. Am I the only one chillin?",
    "subreddit": "LawSchool",
    "timestamp": 1499821028,
    "score": 20,
    "keyword": "man lawyer"
  },
  {
    "text": "Just finished my 1L, question about post law school life For those who survived law school, how is your dating life? Are you married and do you have kids ?\n\nI'm a 22 year old man, and I really want to get married and have kids. I also wish to have a successful career. How have the other male JDs done this ? Do you think being a lawyer made it damn near impossible?",
    "title": "Just finished my 1L, question about post law school life",
    "subreddit": "LawSchool",
    "timestamp": 1496073474,
    "score": 3,
    "keyword": "man lawyer"
  },
  {
    "text": "Nathan Bruemmer, a transgender man, graduated from law school and now faces complications in his quest to become a lawyer",
    "title": "Nathan Bruemmer, a transgender man, graduated from law school and now faces complications in his quest to become a lawyer",
    "subreddit": "LawSchool",
    "timestamp": 1504336567,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "If women shouldn't have to explain anything when getting an abortion, and can get an abortion whenever they want, men should have the right to disown an unwanted child if the woman doesn't wants to have an abortion. Children should not be used as one sex's financial shackle to the other. After seeing a post on the front page about women never having to justify abortion, and worse, to be able to use it as a form of birth control, I feel this should also be mentioned.\n\nStory time! Sorry for the grammar and everything, English isn’t my first language.\n\nThis happened to a family member of mine. He and a girl he met slept together without using a condom. Alright, up until now I'd say screw them both, they knew what they were risking; however, they seemed mature about it. The man (Family member) couldn't financially support a child without dropping out of university. The woman wanted to keep the child for whatever reason (I think it was about morals or something along those lines), but accepted to take care of the child and sever ties with him.\n\nAlright, great yeah!? Mature, reasonable decision on both sides. The man would stay in university and the woman would take care of the child she wanted to keep with the help of her family. That should have been the end of it right? Wrong. Fast forward a couple of years. Yes, YEARS! The man is contacted again by the woman. She wants him to meet her child. I say “her” because it was decided they would sever ties years ago.\n\nAlright, I get news of this. And I'm rather a huge jerk and always assume people will act towards me as I act towards them. They want the upper hand and never do anything out of the kindness of their heart, but we’re not here to judge my character people, it’s just relevant to the story.\n\nSo I tell him not to respond, I tell him NEVER to reply to anything she sends. I explain to him that she just wants money out of this, that it’s not worth it. She’ll fuck him over because she lives in a shit town in a shit part of the country with no jobs and failed relationships and she’s seeking easy money to feed herself because she’s probably a failure.\n\nDid I tell you this family member is sentimental? Well, he is. So the woman beats me by showing him picture of that kid to him and telling him that since she told him stories of his dad the kid wants to meet him. He gets emotional and suddenly he wants to meet the kid and talks to him on skype. I knew where this was leading, he was being manipulated, but I couldn’t reach his guilt tripping mind about how this was only a ploy to get him to get more involved in the life of this kid until she would demand money. \n\nAfter a while, what do I learn about this fuckass woman from nowhere? Just before contacting the family member she had broken up with her loser junky/pusher boyfriend. It didn’t matter though, because he already went to meet that kid and see them in person (kid and woman). They live really fucking far away too. I’ll also mention that he has a good job, north of 45k a year, I just *know* where this is going. So I tell my family to somehow convince him. It fails.\n\nA couple of weeks later what does she asks? That’s right! MONEY. SHE WANTS ZE MONEY. I’m not fucking rejoicing here. This was a failure on my part, but this is only the beginning folks. So the family member says he can take care of them if they move into his town and he’ll visit often. Fair, right? He’s got a heart of gold that guy. He does all this while being married to another woman who’s understanding enough to support him through all this.\n\nWhat’s the response from fuckass woman up in nowhere city? She doesn’t want the kid to meet family member’s wife, and wants him to only have supervised visits at her own place in nowhere. She also wants the money, of course, but the kid is only a tool to get that at this point.\n\nFamily member really fucking wants the best for this kid, so he tells her he’ll accept to have the kid during the summer and pay child support. That’s not enough, she wants more money than that, so she uses the kid again, denying him visits altogether and telling the kid his father doesn’t want to help.\n\nNow, family member paid over $10 000 in lawyers’ fees getting the ball rolling to get full custody of the kid. He and his wife live in one of the big city of the province, making north of 65k a year together. They are married, have a stable life with a lot of relatives living near them. Meanwhile, fuckass hoe has no job, a string of junkie exes trying to get (fuck) her back, live in nowhere town, can’t pay the bills, and is using the kid as an emotional weapon to get money out of him. \n\nFamily court is heavily stacked against men here. You know what his lawyers told him? He has less than 50% chance of even getting custody let alone full custody. Because women, for no good reason, are heavily favored in the courts. It takes child abuse to even nudge the court towards taking the men’s side in most cases. Short of child abuse or a really strong argument by them that would blow the judge away, he’ll only get to see the kid once every two weeks and have to pay out his ass in child support while junkie woman sleeps around and never works a day in her life.\n\nThis is why men should have the right to disown a child before birth up until the time a woman cannot get an abortion anymore. Never having to pay a dime to the woman. Right now, children can be used as financial shackles on men and often are used that way. If a woman can abort a child because of financial reasons, without asking the permission of the father who might want to keep it, that father should be able to disown that child for the same reason and never be bothered by the woman again.",
    "title": "If women shouldn't have to explain anything when getting an abortion, and can get an abortion whenever they want, men should have the right to disown an unwanted child if the woman doesn't wants to have an abortion. Children should not be used as one sex's financial shackle to the other.",
    "subreddit": "MensRights",
    "timestamp": 1487205451,
    "score": 223,
    "keyword": "man lawyer"
  },
  {
    "text": "My Harvey Weinstein was my high school teacher. This is my story. It happened in a small, wealthy, Catholic high school--run by Catholic brothers, fairly conservative, extremely sexist, extremely homophobic, extremely white, highest position held by a woman was guidance counselor. As a senior, I chose psychology as my second semester elective. The instructor was an alumni, been teaching a few years after 20+ years in law, and well regarded in the school/entire community because he was also the football coach. His son was a student in my year. To the football team, he was not only Coach, he was also their best friend's/teammate's dad. People hung out at this guy's house. This teacher was also my home room teacher all year. He knew exactly what rules to break to make him popular as a teacher--never marked you late no matter what time you strolled in, let you do homework, and didn't care if your shirt was tucked in. Every female was \"sweetheart\". He gave every male a personal nickname. He was very dad-like. \n\nSecond semester, day one of his class, he shut the door and it started. Basically, we were told that what happened in that class, stayed in that class. We were going to talk about things that the \"boss\" wouldn't like--sex, drugs, rock and roll type things. He set up an \"us\" against \"them\" mentality really early. He told us we were going to get really close. He made it clear that if you weren't going to be cool about it, you needed to drop the class. Then, he specifically stated: \"if i ever make you uncomfortable, come to me and we'll work it out, don't get an administrator involved and ruin it for everyone else\". He started slow: making stupid sex jokes, telling us about his glory days as a lawyer in the 80s, making comments here and there about women's bodies in general. Then the \"jokes\" got a little more graphic--throwing in lewd hand gestures. When we got to a lesson that included sexual harassment, he told us that sexual harassment doesn't happen anymore. Women routinely lie or exaggerate and it ruins men's careers. And when men do cross a line, it's because they don't know any better and women need to lighten up. In his unit on abnormal psychology, he thought it was important for us to know that \"some doctors\" say that homosexuality fits the criteria of a mental illness. About this time in the semester, his style of dress started to became more relaxed. He started wearing basketball shorts with no underwear rather than his usual khakis. This was a very small classroom so he was less than a foot away from you if you sat in front, which I did. He told us that he had \"friends\" that commented on how hot the girls were at our school. \n\nOne day at lunch, sitting with 3 girls from my class, I worked up the courage to say, \"so Coach is like...a creep, right?\" The response was essentially \"yeah, you didn't know?\" He only taught 2 classes each semester. All seniors. He was a guaranteed A. That's how he got away with this shit. Nobody is going to rock the boat a few months before graduation and he knew it. Right before final exams we played his version of \"Girls ask Guys\". We were encouraged to ask ANYTHING, without embarrassment, because questions were going to go in a hat. What happens in class, stays in class, remember? We were graded on our discussion participation but we could say \"pass\". A lot of sex questions came up because we were all 17/18yr olds trying to play this demented man's game. We went around the room and were pressured to talk about sexual fantasies, masturbation habits, penis size etc. There was several days of this. Looking back, I think he humiliated us for his entertainment. This was in 2010. Last I checked, he is still teaching. Every word of this is true and I would testify in court if his day ever comes.",
    "title": "My Harvey Weinstein was my high school teacher. This is my story.",
    "subreddit": "Feminism",
    "timestamp": 1508369435,
    "score": 9,
    "keyword": "man lawyer"
  },
  {
    "text": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things) Hey everybody. I haven't posted here before but I thought this recollection is relevant, both in an alarming way and as an example of the kinds of anti-feminist rhetoric making waves not only on r/Men'sRights, r/the_donald and the alt-reich pits of 4chan, but also on nationwide daily conservative talk radio.\n\nAs a fiction writer intrigued by the depths of conspiratorial thinking, conservative talk radio is like a nightmare paradise. I started tuning in pre-election to try and comprehend some of the right's perspective, principally the stuff the right is being told by their media. Aside from a constant stream of slant and innuendo, and general fear-mongering, this segment from a few weeks back really stuck out.\n\nSavage's topic: \"an epidemic of false rape allegations perpetrated by radical feminists.\" Fitting neatly with the \"Look at what's happening to our poor boys!\" trope, he asked for callers to relay experiences of faked accusations for the purpose of slander and character assassination. His first caller was a woman in tears. She was barely able to speak about experiencing a rape in her youth that she was never able to get herself to publicly admit before. It was very hard to hear, particularly when Savage was less than accepting at first, asking her why she never came forward, asking what she hoped to get out of admitting it now. Eventually he relented and wound the conservation toward some notion of an older, better America where \"your brothers would take care of it.\" \n\nThe next caller was a guy who was utterly on board with Savage's thesis. He said that his sister-in-law cooked up a story about him molesting her kids, even coaching them to lie to lawyers, in order to discredit him and get him fired from his job (which was successful.) When asked why she would do this, he said \"she just didn't like me\" (the most suspect sentence I've ever heard, BTW). Regardless, this fakery, while manipulative and wrong, had nothing to do with feminism and/or sexual assault of feminists. So Savage was 0 for 2 on his big evil topic. \n\nThe third was a guy who was raped while attending a christian monastery. It was another sobering discussion of sexual assault and the effects it has on the body and mind, denial, acceptance, the unstable road to recovery, etc. \n\nCaller after caller...zero examples of false rape allegations. The segment concluded with a nurse who specialized in processing rape victims, she laid out all the gory details of examination, while Savage tried to derail her data and facts with ideas like \"Well if there's no clear DNA evidence, the claim must not be believed, right?\" He didn't get far on this tract. Strangely, they ended up on mutual terms when ascribing a rise in rape incidents and rape culture to violent video games, violence in films and, both inherently racist and lazy, on rap music like Kanye West. The segment trailed off into Savage basically thanking his audience for a frank discussion of a very hard topic, and then the station was barraged by ads. \n\nConsidering where things ended up, it was easy to forget how it began-- Savage wanted to hear about devious man-hating and man-destruction by means of what he sees as a pivotal radical feminist tool, the pointed finger of accusation and the presumed guilt of the men being accused. But when exposed to real people in the audience, with real experiences, there was a near unanimous 180 degree turn. As brutal and frightening as his initial topic was, and how horrific it is that such concepts are preached to the masses as being some epidemic feminazi plot, he totally failed. It was heartening in a grim way. \n\nAnyway, thought I would share this attempt to demonize feminism, particularly because the response was not only lackluster but such a reversal. Other such BS, particularly online, gets hateful and vile very quickly.",
    "title": "Talk radio host Michael Savage's Depressing Attempts to Demonize Feminism (Among Other Things)",
    "subreddit": "Feminism",
    "timestamp": 1483351001,
    "score": 1,
    "keyword": "man lawyer"
  }
]