[
  {
    "text": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2] Hey r/jobs, it's me again, coming at you with all of the resume advice you could ever need, and more! I posted all of my resume tips and tricks a couple of months back, which led me to receiving an amazingly overwhelming amount of comments (THANK YOU!) and I wanted to clear up some things, and include some things I missed in my last post. I've put all of this advice in order so it's easy to find the info you need when you need it.\n\nTo introduce myself, my name is Holly, and I am an experienced resume writer and editor located in North America. Essentially, I love helping people make their resume the best it can be, and I often help out in the r/jobs discord, and a tech workers slack channel, giving free advice as often as I am able to.\n\nResume writing and editing has been a part time hobby/job for me since 2017. I work full time as a senior account manager in tech, plus I have a bunch of hobbies outside of work, so I give my time where I can, which is unfortunately not as much as it used to be. I guess that's why I've written these posts, because I can no longer help as many people as I used to, and hopefully this way it can assist hundreds or even thousands of people!\n\n***DISCLAIMER: Many of these tips are North America specific,*** ***and some/many don't apply to creative fields like designers/marketing resumes.*** *Also some of these are for people working in the corporate world and don't apply to food service or retail jobs.* ***Of course, some of these won't apply to you specifically, so use your common sense to take what is useful to you.***\n\n~\n\n# CONTACT INFORMATION AND TOP OF PAGE\n\n* **Contact details** \\- at the top when of your resume under or next to your name, you need to include the following things: your location (if you're willing to relocate to the area the job is in, put the jobs city in and not your current location) email address, and your LinkedIn profile. Phone number isn't essential, so include it or don't, it's fine. Other optional things to include - if you have a portfolio or GitHub, definitely include them. Don't paste them as a messy link, instead write \"GitHub\" and turn it into a hyperlink.\n* **Location:** Are you located in San Francisco, California, applying to jobs in your city, and/or remote? Write \"San Francisco, CA\".\n* **Location:** Are you in San Fran, but open to relocation, AT THEIR EXPENSE? Write \"San Francisco, CA (open to relocation)\".\n* **Location:** Are you in San Francisco currently, but you're willing to move **before** starting a new job to New York AT YOUR OWN EXPENSE, where your dream job is located? Or you've already planned to move to New York and you're only applying to roles there? Put your location as \"New York, NY\". Why? Because you're moving there on your own cost prior to starting work, at your own expense.  If it comes up in the interview, tell them the truth. \"This is my dream job and I'm planning to move prior to starting if I'm successful\", or \"I'm moving to New York on X-date - which is prior to the start date of this job - and everything is already organized, which is why I have my location listed as New York rather than San Francisco.\"\n   * If you want them to pay for your relocation fees, then use the (open to relocation) that I wrote above.\n* **DO NOT INCLUDE YOUR FULL ADDRESS IF YOU'RE IN NORTH AMERICA** \\- only include your City and State/Province, and use one of the above depending on your circumstances.\n* **Contact details (what not to include)** \\- don't include the word PHONE before your phone number, or EMAIL before your email address. They are not necessary. People know what a phone and email look like. You're just taking up space for no reason. Also don't include your social media accounts except for LinkedIn (unless they are professional accounts for marketing/design/media positions of course, etc.).\n* **LinkedIn link and info:** Make sure your LinkedIn profile link is customized. You can get a custom LinkedIn link from your LinkedIn profile on the right hand side at the top right, click on \"Edit public profile and URL\". Make sure your custom LI link includes your name and not just a bunch of random numbers. Be creative. Are you a John Smith and you're located in Texas? Maybe your custom link could be smith.john.tx or johnsmith.tx, or include your middle initial. Play around with it until you get the perfect LI custom link. When including your LinkedIn link on your profile, instead of including the whole URL, only include the last bit (for example, **in/johnsmith**) - and lastly, make sure you include the hyperlink on your resume so that people can click it while viewing your resume.\n* Do the same as above with GitHub or any other professional links you're including on your resume. Make it a hyperlink so you're not including some messy link that's killing the \"feng shui\" of your resume.\n* **DO NOT INCLUDE A PHOTO OF YOURSELF IF YOU'RE APPLYING TO JOBS IN NORTH AMERICA.** Companies have to prove that their hiring processes isn't based on race, gender, age, appearance, etc. Including a picture in NA can actually get your resume thrown out entirely. I know LinkedIn profiles include your profile picture, which is weird that we're just okay with this, but not with pictures on resumes, but here we are. Hey, I don't make up the rules, I merely abide by them and am here to ensure your resume is, *\\*chefs kiss\\**, perfectly formatted.\n* **Summary/Objective - to add or not to add?** I only recommend adding one if you're making a career move/change, and applying for jobs that aren't in your career ladder. The other alternative is if you've been out of your industry for a while, either studying or working in a completely different field, or if you took a break and need to explain the gap in work. I believe a summary should be no longer than 5 lines of the page maximum, which is typically around 3-4 sentences. You don't need a summary if you're looking for jobs on your current career ladder and don't have any gaps on your resume.\n\n# HOW TO ORGANIZE YOUR RESUME (IN ORDER)\n\n* If you HAVE had relevant experience since your education, then put your professional experience first. DO NOT INCLUDE YOUR HIGH SCHOOL EDUCATION (unless you're still in high school, or are looking for your first or second job out of highschool, or if you don't have university to add to it and you have less than 2 years of work experience). So it would go like:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it) 3. Experience 4. Education & Certifications 5. Projects (if you have any you want to add, and the space to add them, or simply link to your GitHub or LinkedIn and list them there) 6. Skills 7. Volunteering - if it's going to assist with your current career, or if you have the space for it 8. Languages spoken (only add this if you speak more than one language fluently) 9. Interests (if you have the space and want to add them)\n* If you HAVEN'T had relevant experience and your education was in the past 1-3 years and it's relevant to your job, then:\n   * (1.) Name and contact info, LinkedIn, GitHub etc. 2. Summary/objective (if adding it - I do recommend it here to explain the direction you're heading) 3. Education & Certifications 4. Projects (if you have any) 5. Skills 6. Volunteering (if you have any) 7. Languages spoken (only add this if you speak more than one language fluently) 8. Interests\n* Basically, just put the best most recent and relevant info at the top that relates to the jobs you're applying to, and mark it in order from there.\n\n# ONE PAGE OR TWO?\n\nAh I love this question, people get so heated about it haha! There's a lot of variables and a lot of opinions on this, so let's get into it...\n\n* FIRST THINGS FIRST - If you're going to go to 2 pages, for the love of the flying spaghetti monster, DO NOT, I REPEAT DO NOT have it as less than 1.5 pages. If you're commiting to 2 pages, USE THE SECOND PAGE. Beef up some bullet points, make some of the text or the lines larger, whatever you need to do if you're absolutely convinced it will not fit on one page. Otherwise, REDUCE that bad boy to 1 page. Nothing quite grinds my gears as much as seeing an 8th of the second page being used. IT LOOKS AWFUL, REALLY REALLY AWFUL. Thanks for letting me get that off my chest.\n* Unless you're in senior management, your resume (for North American applicants anyway) should be one page ideally, two pages max if you have over 10 years of RELEVANT experience, but in saying that...\n* Do you have LESS than 10 years of university and work experience combined, and you're NOT in a high up VP/Director position? You are likely best to go with one page.\n* No education after highschool, but you've got 10 years or less of really amazing experience, but not in a higher up position? You are likely best to go with one page.\n* Do you have LESS than 10 years of university and work experience combined but you also have a few AMAZING projects you worked on separately, and you've done relevant volunteer work, and your resume is actually kind of incredible? Then hell yeah, go for 2 pages! Brag all you want and show them why they need to hire you!\n* I could go on. Just one page or two, either way, ensure you use the full page if you've got it, I hate seeing only 1.5 pages or less. Either bring it closer to 2, or bring it down to 1.\n* **\"What about 3 pages, or 4, or 5? I have so many jobs and I'm awesome and want to show them!\" In North America, NO, GET OUT OF HERE, ABSOLUTELY NOT!** They won't see it as \"Wow this person is amazing\", they will see it as \"Oh wow this person doesn't know how to write a resume, and this is way too long for me to bother to read\" and they'll delete it. In other parts of the world? Sure. I know some countries like the UK for instance that want a full CV (they are different from resumes, as they list every single job, achievement, certification, volunteer experience, and more) that are often 3+ pages long. Well, my advice isn't for UK resumes, because that's not my specialty. I'm just saying that 2 is the max for North America.\n* Need to find extra space on your resume to reduce it down to 1 or 2 pages? **Use narrow margins.**\n* **SO ONE PAGE OR TWO?** Honestly, either is fine if you're using the space efficiently, and aren't writing giant bullet points and paragraphs. ***If you're unsure, go for one page.***\n\n# GENERAL FORMATTING\n\n* **Make sure EVERYTHING is uniform**. If most of your dates are 3 letters only, like Jun 2016 - Oct 2020, then they ALL need to be the same. Yes, even the months of June and July with just one more letter. It looks much neater. Ensure you double check the spacing is correct too, for example, the most common error I see on resumes is some dates having a space and then a hyphen, and then no space before the next date (example Jan 2019 -Jun 2020 and then Jul 2020-Feb 2022, then Apr 2022 - Present) - this is a very small issue, but it shows you do not have attention to detail. Whichever format you choose for one, ensure they ALL follow the same format.\n* Double check if something is bolded, or underlined (like a title or date or company name), ensure that all the others are in the same format.\n* Is the font the same for each section? It's fine if you're using different fonts on your resume, but ensure that each section is the same. For example, if one job with all the bullet points are Times New Roman, then all jobs needs to be in Times New Roman. If one section header is Garamond, and the next section header is Times New Roman, it shows you don't have the attention to detail.\n* **Remember, your resume needs to be PERFECT. You seriously need to go through each line by line with a fine tooth comb.** Imagine not securing an interview with your dream job because of a few silly spelling mistakes or poor formatting. \"Well I didn't want that job anyway\"... yeah you did. It can be a hard pill to swallow and it's easy to make light of it, but you never know who is the one deciding on the yes or no pile and where yours will land.\n* **Ensure all line breaks are the same size**. If one blank line in between 2 paragraphs is size 7, and then the next blank line between paragraphs is size 11, it's a very noticeable detail to those looking at your resume.\n* **For your paragraphs and bullet points, use the \"justify\" align**. It removes a bit of the white space and brings your text fully to the right of the page. It's much neater and removes the jagged look of left align. The exception to this (as there usually are) is if none of your bullet points are longer than one line. I like justify align on a summary/objective if you're adding one, and on bullet points or any paragraphs that are 2 lines or longer. Play around with it and see what works best for your resume.\n* **DON'T WASTE AN ENTIRE LINE ON A HANDFUL OF WORDS!** I often see people when writing their bullet points taking up less than half a line, or only a couple of words on the 2nd or 3rd line. Not only does this create a lot of white space, but it's also selling yourself short. You have one, maybe two pages to sell the sh!t out of yourself. Make every single line of your page count. Make sure every single line of your bullet points is at least halfway across the page or more. Either beef up that bullet point, or condense it.\n* **5 bullet points max per job** (of course there are exceptions, but this is as a general rule). The older the job, the less bullet points. A job from 10 years ago will only require 1-3 bullet points (and only if it's relevant to your current career. Really think hard about whether to include it on your resume or not. Remember, all your jobs are on LinkedIn, not everything needs to go on your resume... again, North American advice).\n* **Use a different verb at the start of each bullet point.** I roll my eyes when I see the same word repeated multiple times as the first word in bullet points. Instead of just using the word managed, use words like Coordinated / Directed / Orchestrated / Oversaw / Spearheaded. There's a great article written by the Muse, you can find it here: [https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome](https://www.themuse.com/advice/185-powerful-verbs-that-will-make-your-resume-awesome). If you work in a field with specific wording, like Nursing for example, then google \"Nursing resume verbs\" or something like that. Put the work in to your research for your resume wording and you'll reap the rewards.\n* **DO NOT USE COLUMNS** (unless you're in a creative field like a designer, or your resume is being handed to someone in person) - Columns do not play nicely with ATS (AI resume reading software) and as the majority of companies now rely on ATS to quickly read resumes, you're shooting yourself in the foot by using columns or any other weird formatting.\n* Each bullet point should not be paragraphs long. Each bullet point should be 1-2 lines long only on the page, 3 maximum.\n* Each job should take up no more than 1/4 of the page, unless you've only had one or two jobs, or are more senior. Or in another unit of measurement, no more than 11 or 12 lines of the page. The more recent the role, and the more impressive the tasks, the more bullet points there should be, but don't just include the job description which leads me onto my next point...\n* Reiterating that each job should only include the achievements from that job, and only the most impressive things you achieved should be listed. Include KPIs, processes you implemented, articles you wrote, dollar amounts of your biggest sales or averages, include numbers of accounts you managed, or how many calls you took each day, if you went over your OTE what was the percentage, etc. It shouldn't read as a job description, you need to sell yourself and show them what you're capable of! (disclaimer - unless your jobs are more entry level or food service etc, then job descriptions are likely the norm).\n* Don't include irrelevant jobs/projects. If you worked at Starbucks for 6 months 5 years back, and you've had relevant experience in your field after that, then remove the Starbucks (or whatever other unrelated jobs you have) from your resume. Your resume should be tailored to the jobs you're applying for! To give you some more reference, I have been working since 2003, and my resume only has jobs from 2014 onwards.\n* **Try to have your dates on the right hand side of the page, and your position and company on the left (list the position first, then the company next to it or below it).** It's the standard, and makes the person reading your resume find the info much more quickly. Trying to make your resume too unique (again, unless you have a creative job then ignore this) will only hurt your chances of it being taken seriously. Of course you want to make it look nice, but try to follow the standard format where possible so it's easy to read.\n\n# SKILLS & INTERESTS\n\n* **Put your technical/software/program skills in one line**, separated by commas or | lines | like | these. Putting a single skill on each line is a waste of space, and will create too much white space. Your resume should be concise, to the point and get everything across in as little space as possible.\n* **Don't use the \"slider\" scales for your proficiency in various skills.** Why? Well, firstly, if the hiring manager wants to know your level in each, they will ask. And secondly, the dots or slider scales aren't measurable and take up extra wasted space that again is not going work well with ATS. Instead, as I mentioned above, list your skills and programs/software etc. in a line separated by commas | or | these | lines. Don't include software that you used 10 years ago and never progressed past a beginner level, but list pretty much everything else within reason. Most things you'll pick back up quickly even if it was 5 years ago, provided you were semi-decent with your knowledge of it.\n* What about interpersonal skills? Should you add them? I highly recommend adding them into your bullet points, rather than listing them separately. In saying that, though, there's going to be some industries, or some skills, that require them listed separately. If you're listing them separately, first ensure that you actually need them on the resume, and which ones are necessary and which ones can be removed if any. If you're still adament you want to list them separately, then put them in the same format as your technical/software skills as I listed above, either separating each with the | lines | like | these, or with commas, one on line. And that line needs to go below the hard/tech/software skills, not before, and ideally not together.\n* **Languages:** In North America, only list a languages section if you speak more than one language. Always list English first as this is a job requirement every time, and then other languages after that. If you're fluent in English, a native in Spanish, fluent in French, and have intermediate German, I would list it as such:\n   * \"Languages: Fluent in English, Spanish and French, intermediate in German.\"\n* **Interests - should you add them or not?** It's a highly debated topic and everyone will have a different view on this. I personally believe that you should include them. For example, I ride motorcycles and love stand up comedy shows, am coffee obsessed and love my local lacrosse team. Almost every single interview I land, my interests are brought up, with the interviewer connecting with one or more of my interests, or asking me more about them. It's a great conversation starter, and it makes you more than just an applicant, they will remember you as the person who they discussed their favourite sports team with, or the person who recommended them an amazing cafe that they've now added to their list. INTERESTS WILL MAKE YOU STAND OUT, I guarantee it. **Obviously, it can be negative depending on what you write, so be REALLY selective of what you include in your interests** (for example, don't include things like Anime or Manga, or the shooting range, or reading Holocaust novels, or your weapons collection, or anything political or religious, or anything you don't want to discuss during an interview - KEEP IT LIGHTHEARTED). I would make your interests 1 or 2 lines maximum on your resume, and don't go into detail (just list them out - for example, my interests on my resume are listed as \"Interests: Motorcycles, Warriors lacrosse, console and PC games, comedy shows, arcades, & searching for the perfect espresso.\") So basically, include them if you want, but if you do include them, make sure they aren't negative or controversial topics if it's brought up in an interview.\n\n# AVOID COMMON MISTAKES\n\n* \"References available upon request\" or adding references to your resume, is a BIG no no for North American resumes. Why? Because 1. it's assumed that you have references available on request, so including that is unnecessary, and 2. You don't want the company contacting your references if you've listed them, PRIOR to letting your bosses know, which is usually after you've received an offer, and 3. You don't want your references, whom have so kindly agreed to be one for you, getting inundated with calls or emails from the companies you're applying to, prior to the offer stage. Imagine applying to 50 companies, and all 50 call your references. Ouch. They won't be your reference for much longer.\n* Is your job across two pages? Nope, that's not going to work! I hate when I see a jobs bullet points going onto the next page. In my opinion, it's messy and just says \"poor formatting\".\n* **DO NOT MAKE YOUR RESUME TOO FLASHY! STOP WITH THE COLOURED TEXT!!** (this applies to non-design resumes only) Black text ONLY, with the exception of your name, contact information and section headers. You can put those in a colour other than black for a tiny bit of a \"pop\", but nothing overly in your face like red or bright pink. I personally use a dark blue, or dark green, or dark purple for the contact info and headers - DO NOT USE LIGHT COLOURS if you're going to use any at all. But objective/experience/skills/education etc, all the actual sections (not section headers) must be black text ONLY.\n* You absolutely should not have any images, and there should NOT be any background colour or background images whatsoever.\n* Do not use tables on your resume. That won't pass ATS and it looks pretty bad honestly.\n* Don't include a paragraph at the end along the lines of \"thanks for your time, please call me on 555-123-4567 if you have any questions or would like to set up an interview\". This isn't a cover letter. And even if it was, don't include your phone numebr or email in the cover letter body, that should be included with your contact details at the top of your cover letter, which should match the same format of your resume.\n* If you're going onto a second page, include the exact same name and contact information format as you have on your first (and other pages if outside of the US where more than 2 pages is common).\n\n# FINAL STEPS - SENDING YOUR RESUME\n\n* **NAMING YOUR RESUME:** And I'm not talking about naming him Resume McResumeface. Your resume name should be \"Firstname Lastname Resume\". Don't include the job title on there, or any periods, underscores, or any other information. \"J\\_Smith Customer Support Rep. Resume V2 Final\" is everything wrong with a resume title. I hear you asking, \"But holly948, how do I have multiple resumes then for the different jobs I'm applying to?\".\n* **ALWAYS SEND YOUR RESUME AS A PDF DOCUMENT!!** If you send it through as a Word document, their computer could mess with the formatting and it could ruin the perfect look of your resume. PDF will ensure they view it exactly how you have designed it to look. Sending through as a Word doc could ruin all of the hard work you put into the formatting. Devastating!\n\n# COVER LETTERS\n\nI'm sorry that's not my area, and I loath cover letters with a passion. Write them or don't, whatever. I personally never write cover letters as I find they are a waste of my time.\n\n# AKSHUALLY...\n\nLastly, I hear many of you about to furiously get into the comments with \"but my experience was...\" and \"in my opinion, you should...\", and \"actually, I think...\" and I get it! There is no \"one perfect way\" and everyone has different opinions. **This entire write up is in MY opinion and MY experience.** I'm not saying don't comment, just, please take this post as my opinion rather than \"it must be done exactly how I say or else you're never getting a job and your resume sucks\". Do whatever you want, man. Different things work for different companies and industries. This is my own general advice, and I know with resumes there is no \"one size fits all\". No two resumes I do are the same, because it comes down to the individuals experience, education, interests, what they're applying to and so many other factors. I'm just giving free advice from my own experience, in my own opinion, to serve the majority of people updating their resumes (primarily in North America).\n\n\\~\n\n**TL;DR** \\- **if you want to improve your resume, then I've given you everything you need minus the template.** **However, I'm doing up a template at the moment, and will share with you all, hopefully this weekend.** I want to give you all of the tools you need to succeed.\n\n*Enjoyed my advice from this post and/or the last? You can buy me a coffee!* [*https://www.buymeacoffee.com/holly948*](https://www.buymeacoffee.com/holly948)\n\nI sincerely hope this has helped, and I wish you all the best of luck in your job searches!",
    "title": "I am an experienced resume writer and editor, and wanted to share some pointers on how to best format your resume [PART 2]",
    "subreddit": "jobs",
    "timestamp": 1676641102,
    "score": 21,
    "keyword": "man nurse"
  },
  {
    "text": "My wife who is an RN was fired from her job, what should she say to prospective employers? My wife was targeted and buried under paperwork until the manager that she didn't get along with had enough to terminate her. She wishes she would have started looking when she was placed on a PIP but thought that she could work through it with her ex boss.\n\nWhat can she say to prospective employers about her departure from that job other than \"I was terminated\". She can't really say that she was laid off because lay offs of that nature would be well known in the local healthcare community.\n\nMy wife and I go out for dinner and I come back to some meanness in the comments. So...in response to the overly cynical and impatient person in the comments. I guess in this person's view, healthcare is immune to interpersonal conflicts and inappropriate behavior of management.\n\n\\#1 My wife worked for this hospital for 4 years and had no issues until the end of last summer when she (a sexual assault survivor) finally got up the courage to tell her touchy feely boss that she didn't like to be constantly touched, hugged, and sometimes forcibly hugged because her boss felt like she needed it. If her boss was a man, it would have been an open and shut case of sexual harassment and hostile work environment. She thought it was unreasonable to even address it with her boss until I pointed out that if it was a man that we'd be having an entirely different conversation. \n\n\\#2 Nothing in her PIP or write ups had anything to do with her clinical skills or the nursing care that she provided. So your statement about how a nurse in her situation should never be providing care to patients is just downright ignorant and hateful.\n\n\\#3 Her write ups mainly consisted of things like a patient who literally complained about every single staff member but somehow my wife was the only one that was written up miraculously. If you work in healthcare, you know the kind of patients I'm talking about. Most of the time, the complaints were refuted by other employees, charge nurses and house supervisors but that didn't stop her boss from writing her up.\n\n\\#4 The best write up was when she was in the room with a patient in restraints and had removed the restraints prior to the time they were due to be checked and charted on, wrote a detailed narrative note during the patient interaction and then was written up for finalizing her note 6 minutes after the restraints were due to be charted on. Now for those of you who don't work in healthcare, restraints are something that require a lot of documentation, and that documentation needs to be timely. But my wife documented all of the times and checks appropriately in her narrative note, and then was written up because she saved the note 8:06pm and not at 8:00pm.",
    "title": "My wife who is an RN was fired from her job, what should she say to prospective employers?",
    "subreddit": "jobs",
    "timestamp": 1682716431,
    "score": 5,
    "keyword": "man nurse"
  },
  {
    "text": "Help me consider careers that match my skills and interests that do not require further education \n43F who is autistic with ADHD, Alberta Canada. I tried to give comprehensive background but summarized most info in category TLDRs.\n\nIntro: \nI aced University but I generally suck at real life. I am lost trying to think of a job that will allow me to live without eventual burnout from masking as an autistic.  I need something that gives me flexibility for my waxing and waning energy and requires very little hustling in person or on the phone. Email is fine because communicate much more effectively in writing than verbally. I would consider related self employment ideas too.\n\nIdeal job characteristics: \nFocus on creativity,  problem solving in Science & Arts. Importance placed on ideation and planning for implementation, and then delegate to others to actually finish. Maybe project based? No cold calling or selling and prefer remote or hybrid work. Ideas which help others is very appealing.  \n\nStruggles with typical employment: TLDR: mostly Communication / Sensory\n\n- Just getting employment. I am terrible at interviews. \n- work at 200% 3 days a week and 10% the last 2 days when I am recovering. \n- Asking too many questions and wanting to know more about stuff outside of my job description. \n- Meetings leave me confused and unclear about priorities and what was brainstorming vs actionable ideas.\n- Treating everyone as my peer to have intelligent conversations and brainstorming with regardless if speaking with a 7 year old or my CEO. \n- Subjective language and unclear expectations/ directions\n- Feeling like an outsider- the loneliness of not really wanting to do outside of work social activities but also feeling hurt when everyone is closer or they stop bothering to invite you. \n- Oversharing\n- Environment: I need a quiet minimally stimulating area with few human interactions. \n- I tend to have SO MUCH STUFF because I hate not having what I need in the moment. This means I am messy in the wrong environment. \n\nWhat I enjoy: TLDR: mostly creating and finding solutions. \n\n- Thinking about the “big ideas and issues” such as  climate crisis, consciousness, cognitive development, sources and solutions for inequality, longtermism, ethics, modelling human development of cognition to facilitate research. \n- Learning!!!! I am a slow processor at times especially if requires visualization to understand the lecture but once it clicks I am on my way. \n- Visually designing something\n- Creating systems/ organizing ideas for others \n- Editing photos (but just the editing part- I know little about the actual in-person taking photos) \n- Communicating about science \n- Graphic Design in Canva / Easy (little coding) web design in drag/drop programs like wix\n- Writing\n- designing and building things BUT I never like building or creating the same major idea twice. \n- Hobbies : Video Microscopy, drawing, water colour portraits,\n- \nWhat I am good at: \nTLDR: skills: Researching, Ideation, problem-solving, areas: Psychology, Cognitive Science, Medicine , Education, visual Arts. \n\n- Researching, tracking down info- I swear my persistence means I can find anything. I am so happy and hyperfocused when working on a problem/ question. \n- Learning new skills \n- Prompt generation, I just seem to be able to keep shaping a prompt until I get what I need. I do think that Prompt engineering as a career will soon be obsolete as technology makes the middle man no longer needed.  \n- Mentoring, I am very good at researching and offering resources and solutions. As an older student (43) I had many younger classmates come for advice which always surprises me. \n- Finding the best deals on things (I guess this fits into researching) \n- Aesthetics and styling. I have always had a good sense of what is visually pleasing. \n- Finding creative ways to educate that uses project and experiential learning to help people remember and apply their knowledge\n- Writing: I love to write both academically and to write personal but informative papers to help break down the gate keeping of knowledge. We all deserve the opportunity to have complex ideas broken down into meaningful communication. \n- Providing strategies for interacting with ND kiddos\n- Weird and  not a job possibility but medical/ psych diagnosing. Don’t worry I do not go around giving people diagnoses I just have the background and I see patterns in symptoms . I don’t always have the greatest memory but I remember everything medical. 🤷‍♀️\n- Developing Teaching materials and lessons. (I wish I could just do this and not do the teaching 😉) \n\n\nEducation:\nTLDR: certificate: family engagement in medical research diplomas: Nursing, audio engineering Degrees: BSc, BEd\n\n\n-Audio Engineering post-production diploma (obsolete now, but the foundations like layering and signal flow  have helped me a lot with editing music, video, photos, and graphic design) \n\n-Practical Nursing Diploma (license now lapsed) taught me how much I love science and medicine. Worked as a pediatric nurse but hated that curiosity and thirst for knowledge  was frowned upon (aka: “why does the rationale for the order matter? Just do it.”)\n\n- BSc Life Science with a focus on Physiology, Pharmacology, Biology, Neuroscience. This was supposed to be my pre-med once I realized I wanted to be a pathologist not nurse but my family responsibilities made it obvious towards the end that med school + residency was not a possibility \n\nBEd focus Science. My BSc was useless as I had planned it as a stepping stone to med school. My Uni offered a 2 year after degree bachelor of Education program. I thought I could work as a science teacher but despite graduating with a 4.0 I realized the level of masking required to teach K-12 would break me down in less than a year. Love teaching small groups and adults. Also was hired as a research assistant and received funding to do my own educational research which I LOVE. \n\nIf I could I would love to be in grad school doing research into developing a methodology to analyze and model curriculum to develop longtermism thinking in k-12 school but that is not a possibility because my husband isn’t keen after 6 years studying to have 5+ more for my doctorate and I need to make some kind of financial contribution to our family.",
    "title": "Help me consider careers that match my skills and interests that do not require further education",
    "subreddit": "jobs",
    "timestamp": 1702220636,
    "score": 0,
    "keyword": "man nurse"
  },
  {
    "text": "Husband cleared a private space for a nursing friend Had some friends over for brunch today. They have a 3mth baby. As I was flipping pancakes my husband comes in and says \"I cleaned LO's room and cleared the couch [in our child's room] in case she wants a private space to feed the baby.\" \n\nI said that was a thoughtful thing to do. He said he's learned a lot about women from me & it doesn't matter if HE knows he's a \"safe\" man to nurse in front of, what matters is how the WOMAN feels about it.",
    "title": "Husband cleared a private space for a nursing friend",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1672729787,
    "score": 11256,
    "keyword": "man nurse"
  },
  {
    "text": "I'm a weaponized incompetence survoior. Here's how. Here’s how you end up apologizing for his weaponized incompetence\n\nTo start with, today I am a badass who takes no shit, who is professionally exactly who I wanted to be when I grew up. I’m 45, make six figures, and have two amazing teen sons who are thoughtful and aware.\n\nThis wasn’t always the case. I’ve heard you all ask so many times, “how does this happen? How do women end up being servants to lackluster men?” Here’s my story, and it would do my heart good if you’d read it, because I’ve never been brave enough to tell it before.\n\nI was raised in a deeply abusive and controlling household. My mom wasn’t allowed to work or have her own money. She had been groomed by a pedophile, and was a 20-year-old married to a 36-year-old. I was an only child. As a teen, my dad ghosted, but my mom never acknowledged the abuse and remarried very quickly after my dad left.\n\nI had a series of power imbalance relationships as a young person. I wasn’t good at choosing partners, and they weren’t good at loving me. One sprained my neck. Another changed the locks and denied me my possessions. But outwardly I was pretty successful. I paid for my own college degree and never was jobless.\n\nJust short of my 25th birthday, I met the dreamiest guy, John. He was calm. He never yelled. He was quiet but played in a rock band. For me, it was a delicious combination. I ignored the fact he’d never had a girlfriend, he didn’t know how to cook, nor owned nail clippers. I thought these things were quirky. I met his family and his dad was a typical abuser: he dominated the women in the family and was medium-tolerant to his only son, my beloved John. I was thankful that John and I were eschewing the abuse-ridden dynamic from our parents' generations.\n\nI wanted to have a family, badly. We became pregnant just after our second wedding anniversary. We had squabbles, but often they were easily overcome. I was the only one with a real job, but I did all the cleaning and house upkeep. At the time it still felt like playing house. I felt like I’d won the lottery by marrying a man who didn’t beat me or yell at me.\n\nThe day my first son arrived, it was traumatic. John watched me lose half my blood volume in delivery. He then asked if he could go home to “pick up some things.” I sent him with a list, including comfort items, such as hair conditioner. He left me alone in the birthing suite for 6 hours and returned without anything I needed. I could see the sympathy in the nurse's eyes. One combed my hair for me because he said he didn’t know how.\n\nDuring my maternity leave he didn’t support me or the baby. It wasn’t egregious, like some stories you see on here, so I didn’t notice. He would get up with the baby to bring him to me to nurse. But he wouldn’t do anything I didn’t ask him to. I had to give him a roadmap every day– I need food and water, the baby needs a dry diaper etc. I quit my job at the end of maternity leave because I was overwhelmed by my house’s needs and fully aware that he wasn’t going to meet them. We were in poverty.\n\nI worked a night job. I left dinner on the table each night before I left. I’d come home to the plates exactly where I left them. I’d ask why he didn’t put them up and he’d say I didn’t tell him to, or he was busy and tired. I’d ask why he left piles of toddler food on the floor and he’d say, “I’m just not particular about those things like you are.” I believed him. That it was my mania for cleanliness that was the problem. I was not pleasant always when I encountered these things. I’d yell and have tantrums. I was exhausted from working, nursing, and caring for a house. He refused to learn to cook, so I made batches of food he could feed himself and our child in my absence. I was thankful he would use the microwave.\n\nWe had a second child, two years apart from the first. Things were chaos. I started a business editing and copywriting so I could do my evening work at naps and at bedtime. Our household income was $55,000, $40K of which was earned by my husband, the rest by me. I couponed, got the kids on Medicaid, and did everything I could to make it work. My husband assured me he could make no more money than that and could do nothing more for the house than he was doing. He was just tapped out. I increased my efforts to make our home a happy and clean place. Childcare in my region would have been $2400/month for our two, so I just plugged along as their care.\n\nHe went back to college, to get a Masters Degree. For two years he could not contribute anything to our home, even company and love for me. He would pop out of his office and bathe the kids at night, but otherwise no cooking or cleaning. I asked him if he could have some segment of the home he claimed as his own. The yard, the upstairs, anything. He said, “no, I’m not like you. I don’t have interest in those things.” I mowed the lawn, did home repairs, and cooked dinner. I found playgroups for our kids and joined non-profit boards to keep my resume current. I was exhausted.\n\nWe fought about chores constantly at this point. I begged him to be in charge of anything. He said, “I have ADHD. I don’t see mess like you do.” I believed him. He said he could clean the bathroom weekly because it was an understandable job. He did not, and would yell at me when I reminded him. I got into verbal habits of trying to soft pedal that he hadn’t done something. “Hey, I noticed a lot of poop stains in the toilet. Were you thinking that was something you wanted to address or did you have an alternative plan?”\n\nI put SO. MUCH. WORK. into making room for his incompetence. I was deeply ashamed about the times I had yelled or snarked or complained. The one thing I could not bring myself to do was have sex with him. He was personally very anti-abortion and that extended to me. He said repeatedly he’d divorce me if I had an abortion. Between mothering him and his lack of respect for my autonomy, I couldn’t make myself have sex.\n\nSex became the main narrative. We went to couples counseling and I’d cry about needing a partner and he’d grumble about not wanting to partner with someone who wouldn’t fuck him. I thought I was asexual. We were at an impasse.\n\nAfter 10 years of marriage he walked downstairs one day and said he was leaving me. That he couldn’t be with a wife who wouldn’t fuck. He said all our other issues were surmountable, but not this one. I begged on my hands and knees for him to stay. I wanted my boys to have a family, I wanted me to have a family, and I was willing to break my back to make it happen. He was not. (And as a sidenote, as awful as he was, I now agree that a marriage that’s been sexless for 5 years is not actually working.)\n\nHe left and had half custody of the kids. He didn’t pay me a cent of child support or alimony. I asked him for something that honored the 7 years I stayed home caring for our kids. 7 years in which he never had to take a sick day for the kids or miss dinner. He said no, those things were easy; I had had the easy end of the deal.\n\nAs I mentioned, I’m thriving, and getting rid of that 200-pound weight was really good for me. But in six years I’ve never had a long-term partner. I’ve had options, but I just can't see why I’d do all that work for someone again. I have a new understanding for all the amazing single older ladies I’ve met who I mistakenly thought were crones or horrible people bc they were unpartnered. I carry all the work in my divorce: my ex has to this day never scheduled a dentist appointment or bought clothes for our kids.\n\nI’m a feminist, and I always have been one. But for so many years, my body was the exception. I thought I deserved every ounce of the patriarchy right on me. I thought I should bear it. I now have the freedom not to, and to support the women I love, and to love my community, and give what I have. But every time I look around yet another school volunteer event and see zero fathers I’m reminded that I’m not the only one who sufferers. Sorry this was so long. <3",
    "title": "I'm a weaponized incompetence survoior. Here's how.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1681300636,
    "score": 3171,
    "keyword": "man nurse"
  },
  {
    "text": "Are you comfortable going to a male OBGYN? To preface this, I don't think men who choose gynecology do so with any hidden agenda. That's never the issue.\n\nI've been going to the same OBGYN lady doctor for over a decade, but she retired this year. In my hunt for a new doc who accepts my insurance I was recommended one in my area by a women's clinic. The doctor's name was foreign but they said \"she sends us a lot of patients\", so I assumed it was a woman. \n\nI went in for my PAP and to get my IUD replaced. A lovely female nurse practitioner did my exam, and she scheduled me for two weeks later to get the IUD sorted since they had to order in my brand. When I came in she wasn't able to get the old one out.  I was a little freaked out but she scheduled me with the doctor for the next morning, and then I found out it was a man. \n\nI was already anxious over my stuck IUD and the possibility of it being embedded. I got very uncomfortable with him being a man, him not understanding the pain of IUD removal/ insertion. Now, he did it all very quickly but with such a lack of empathy. I'm used to women who handle my business down there being very communicative; this is my finger, this is the speculum, you'll feel cold, you will feel a cramp. This guy just went in there saying nothing and ripped the damn thing out of me. I felt like my insides were being pulled out of my vagina. I asked for a break before inserting the new one but he kept preping for insertion and saying \"I'm not doing anything yet, just cleaning\". When I said I'm ready he just went for it without telling me what's happening, and I just started tearing up between the pain and feeling so anxious and distraught. \n\nI can't help but to think had it been a woman she'd have more empathy and understand the level of pain, albeit for a short time, I was in. It would have made the process a little bit easier. The female nurse stayed in the room with me after he walked out like it was nothing to make sure I was ok. Her patience and kindness helped. He got the job done quickly, sure, but I felt dismissed in a way, and I really don't want to be in his care again. This has been my experience with every male doctor I've ever been to. \n\nHas anyone had positive experiences with male OBGYN?",
    "title": "Are you comfortable going to a male OBGYN?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1690400162,
    "score": 2916,
    "keyword": "man nurse"
  },
  {
    "text": "This guy I’ve been seeing just revealed his true colours and I’m a little shook This is our 4th date and I had him sleep over last night. We knew each other in high school but recently reconnected last year. We normally go on walks and eat out but because of all of the forest fires, neither of us can do much with our bad lungs. I have asthma and he is bouncing back from being pretty sick. \n\nThis is where things got interesting… he said that was his first time in a hospital in his life, was appalled by the way he was treated, and declared that white privilege doesn’t exist because he had one bad experience in life. \n\nI was APPALLED. I wanted to kick him out of my house in that instant but I was scared. Then—THEN he starts going off about vaccines giving masses of children heart attacks and his mom (who works in a hospital) can confirm it. \n\nMy granny, an indigenous woman who survived the horrific residential schools, has been a nurse her entire life and still is. The office she works in deals with children and she hasn’t said a word about kids getting heart attacks recently. I didn’t tell him any of this, I just let him keep talking.\n\nHe said there’s NASA footage from the 70’s about chemtrails being real, and I finally spoke up and asked him “do you thing the moon landing was real?”\n\nThis caught him off guard. He thought about for a second and says “yes” and I could just see in his face that he might blow a fuse by saying it’s real. \n\nHe has all sorts of conspiracies that he dumped on me and I’m mentally exhausted from today. From sex trafficking, vaccines, white supremacy, pedophile this and pedophile that, the government “gets or dna through our phones” and I couldn’t even do my makeup I was shaking so hard. I put on baggy jeans and a tshirt because I felt dirty after having him sleep in my bed.\n\nIn my fucking house… the way he hugged me before, he can snap me like a twig if he really wanted to. I admit, I was scared. I had to bite my tongue for hours until his ride home was arranged and pretend to listen without getting visibly angry. A part of me wants to address the white privilege part very badly over text, and another part of just wants to ghost him forever. I wish I was more assertive.\n\nI don’t know. I’m just venting. I think I’m shocked because I actually liked him, I started feeling sympathy for this guy. Now I know he’s a very bitter and afraid man.\n\nEdit: I would like to thank everyone for the affirmations and thoughtful responses, this is not easy for me since I have very little experience with dating 😢 I feel invested, I feel tricked, I feel disrespected, and I don’t feel safe. All of you have helped immensely with that, especially after a good nap with some sweet dreams… I feel good now",
    "title": "This guy I’ve been seeing just revealed his true colours and I’m a little shook",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1687657724,
    "score": 2092,
    "keyword": "man nurse"
  },
  {
    "text": "\"You're becoming my work wife.\" Said the creepy boss I've been working with this man for 7 days, 7 whole days, and he thinks I'm comfortable with that shit. Actually I could work with him for 1,000 days and I still wouldn't  be comfortable with it. \n\nI'm a grown woman, a nurse, actual wife, and professional. One more comment and I'm gonna scream for the whole world to hear. I will not pretend it didn't happen, I will not shy from a confrontation, but I will get your old ass fired and blacklisted from the industry. Try me.\n\nEdit because this post became more than just a rant:\n\nI hope to god that no one has to be in a situation that makes them comfortable like this. But if you are and you reach out for support, i hope you are met with empathy and support. And no one asks you to justify your reaction.",
    "title": "\"You're becoming my work wife.\" Said the creepy boss",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1694225886,
    "score": 712,
    "keyword": "man nurse"
  },
  {
    "text": "Stop trying to minimize our safety concerns I'm a hospice nurse. I mainly see home patients. I work in a major city but also go to small towns on the outskirts an hour away. Five months ago I was assaulted by a patients son. Long story short, he was arrested. Being a rich white man in a small town, he got off with community service. Was even allowed to make a \"donation\" instead of actually doing community service. Made a boohoo speech about how his dad having days to live made him snap. I literally went to see this patient for a UTI and months later, dad is still alive. \nI ended up staying at my job on the terms that I will never see this patient again. Shocker they still kept the patient because you know, money. They reassigned him to a male nurse, who i met for the first time this week. He proceeds to tell me that he doesn't think I'm necessarily wrong but the patients son has been a great guy to him with no issues. Had even invited him to a basketball game! And that maybe, just maybe I was mistaken on severity of the situation. I was speechless, this man left bruises on my body and I must be mistaken? He then tells me that no one else has issues with the family and I should rethink the situation. I proceed to tell him this is not about him, that I'm not safe, nor will I ever go back there. Until he's a women and has been in our shoes, his opinion is irrelevant. Men will NEVER know what women go through and I wish they would stop trying to downplay it. I reported him, he meets with HR tomorrow. I love being a hospice nurse, been doing it for 10 years but between assault and dumb coworkers, I don't know how much more I can take.",
    "title": "Stop trying to minimize our safety concerns",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1701638318,
    "score": 497,
    "keyword": "man nurse"
  },
  {
    "text": "The Chen 2023 Paper Raises Serious Concerns About Pediatric Gender Medicine Outcomes When I started my Child and Adolescent Psychiatry training in the 2010s, the diagnosis and treatment of gender dysphoria were rapidly becoming controversial in the field. Doctors and nurses who had spent decades on inpatient adolescent units, usually seeing one gender dysphoric child every 4-5 years, now saw multiple transgender-identifying kids in every inpatient cohort. It was a rare patient list that did not include at least one teenager with pronouns not matching their sex.\r  \n \r  \nViewpoints about this differed, with every student, resident, fellow, and attending having their own perspective. All of us wanted what was best for patients, and these discussions were always productive and collegial. While I am not naive about how heated this topic can be online, I have only ever had good experiences discussing it with my colleagues. Some of my attendings thought that this was merely a social fad, similar to Multiple Personality Disorder or other trendy diagnoses, like the rise in Tourette's and other tic disorders seen during the early pandemic and widely attributed to social media. Others, including myself early on, thought we were merely seeing psychological education doing what it is supposed to do: patients who would, in earlier decades, not realize they were transgender until middle age were now gaining better psychological insight during their teen years. This was due to a combination of increased tolerance and awareness of transgender people and was a positive good that shouldn't necessarily raise any red flags or undue skepticism.\r  \n \r  \nDuring my outpatient fellowship year, I began to suspect a combination of both theories could be true, similar to ADHD or autism, where increasing rates of diagnosis likely reflected some combination of better cultural awareness (good) and confirmation bias leading to dubious diagnoses (bad). Confirmation bias is always a problem in psychiatric diagnosis, because almost all psychiatric diagnoses describe symptoms that exist along a spectrum, so almost anyone could meet the DSM5TR criteria for any condition, so long as you ignored the severity of the symptom, and people are often not good at judging the severity of their own symptoms, as they do not know what is \"normal\" in the broader population.\r  \n \r  \nI considered myself moderate on these issues. Every field of medicine faces a tradeoff between overtreatment and undertreatment, and I shared the worries of some of my more trans-affirming colleagues that many of these kids were at high risk for suicide if not given the treatment they wanted. Even if you attribute the increase in trans-identification among teens to merely a social fad, it was a social fad with real dangers. If an influencer or spiritual guru on social media was convincing teens that evil spirits could reside in their left ring finger, and they needed to amputate this finger or consider suicide, the ethical argument could be made that providing these finger amputations was a medically appropriate trade of morbidity for mortality. \"How many regretted hormonal treatments, breast surgeries, or (in our hypothetical) lost ring fingers are worth one life saved from suicide?\" is a reasonable question, even if you are skeptical of the underlying diagnosis.\r  \n \r  \nAnd I was always skeptical of the legitimacy of most teenagers' claims to be transgender, if for no other reason than because gender dysphoria was historically a rare diagnosis, and the symptoms they described could be better explained by other diagnoses. As the old medical proverb says, \"when you hear hoofbeats, think horses and not zebras.\" The DSM5 estimated the prevalence of gender dysphoria in males as a range from 0.005% to 0.014%, and in females as a range of 0.002% to 0.003%, although the newer DSM5TR rightly notes the methodological limitations of such estimates.\r  \n \r  \nRegardless, most of the symptoms these teens described could be explained as identity disturbance (as in borderline personality disorder and some trauma responses), social relationship problems (perhaps due to being on the autism spectrum), body image problems (similar to and sometimes comorbid with eating disorders), rigid thinking about gender roles (perhaps due to OCD or autism), unspecified depression and anxiety, or just gender nonconforming behavior that fell within the normal range of human variation. It seems highly implausible that the entire field of psychiatry had overlooked or missed such high rates of gender dysphoria for so long. Some of my colleagues tried to explain this as being due to the stigma of being transgender, but I do not think it is historically accurate to say that psychiatry as a field has been particularly prudish or hesitant to discuss sex and gender. In 1909 Sigmund Freud published a case report about \"Little Hans,\" which postulated that a 5-year-old boy was secretly fixated on horse penis because of the size of the organ. I do not find it plausible that the next century of psychoanalysis somehow underestimated the true rate of gender dysphoria by multiple orders of magnitude because they were squeamish about the topic. In fact, the concept that young girls secretly wanted a penis was so well known that the term \"penis envy\" entered common English vocabulary! Of course, the psychoanalytic concept of penis envy is not gender dysphoria per se, but it is adjacent enough to demonstrate the implausibility of the notion that generations of psychoanalysts downplayed or ignored the true rate of gender dysphoria due to personal bigotry or cultural taboo.\r  \n \r  \nTherefore, for most of my career I have been in the odd position of doubting my gender-affirming colleagues, who would say \"trans kids know who they are\" and talk about saving lives from suicide, but also believing that they were making the best of a difficult situation. In the absence of any hard outcome data, all we had to argue about was theory and priors. I routinely saw adverse outcomes from these treatments, both people who regretted transitioning and those whose dysphoria and depression kept getting worse the more they altered their bodies, but I had to admit this might be selection bias, as presumably the success cases didn't go on to see other psychiatrists. I could be privately skeptical, but without any hard data there was no public argument to make. The gender affirming clinicians claimed that they could correctly identify which kinds of gender dysphoria required aggressive treatment (from DSMIV-TR to DSM5 the diagnosis was changed to emphasize and require identification with the opposite gender, rather than other kinds of gendered distress and nonconformity), and even when they were wrong they were appropriately trading a risk of long term morbidity for short term mortality. There was nothing to be done except wait for the eventual long term outcomes data.\r  \n \r  \nThe waiting ended when I read the paper \"Psychosocial Functioning in Transgender Youth after 2 Years of Hormones\" by Chen et al in the NEJM. This is the second major study of gender affirming hormones (GAH) in modern pediatric populations, after Tordoff 2022, and it concluded \"GAH improved appearance congruence and psychosocial functioning.\" The authors report the outcomes as positive: \"appearance congruence, positive affect, and life satisfaction increased, and depression and anxiety symptoms decreased.\" To a first approximation, this study would seem to support gender affirming care. Some other writers have criticized the unwarranted causal language of the conclusion, as there was no control group and so it would have been more accurate to say \"GAH was associated with improvements\" rather than \"GAH improved,\" but this is a secondary issue.\r  \n \r  \nThe problem with Chen 2023 isn't its methodological limitations. The problem is its methodological strength. Properly interpreted, it is a negative study of outcomes for youth gender medicine, and its methodology is reasonably strong for this purpose (most of the limitations tilt in favor of a positive finding, not a negative one). Despite the authors' conclusions, an in-depth look at the data they collected reveals this as a failed trial. The authors gave 315 teenagers cross-sex hormones, with lifelong implications for reproductive and sexual health, and by their own outcome measures there was no evidence of meaningful clinical benefit.\r  \n \r  \n315 subjects, ages 12-20, were observed for 2 years, completing 5 scales (one each for appearance, depression, and anxiety, and then two components of an NIH battery for positive affect and life satisfaction) every 6 months including at baseline. The participants were recruited at 4 academic sites as part of the Trans Youth Care in United States (TYCUS) study. Despite the paper's abstract claiming positive results, with no exceptions mentioned, the paper itself admits that life satisfaction, anxiety and depression scores did not improve in male-to-female cases. The authors suggest this may be due to the physical appearance of transwomen, writing \"estrogen mediated phenotypic changes can take between 2 and 5 years to reach their maximum effect,\" but this is in tension with the data they just presented, showing that the male-to-female cases improved in appearance congruence significantly. The rating scale they used is reported as an average of a Likert scale (1 for strong disagreement, 3 for neutral, and 5 for strong agreement) for statements like \"My physical body represents my gender identity\" and so a change from 3 (neutral) to 4 (positive) is a large effect.\r  \n \r  \nIf a change from 3 out of 5 to 4 out of 5 is not enough to change someone's anxiety and depression, this is problematic both because the final point on the scale may not make a difference and because it may not be achievable. Other studies using the Transgender Congruence Scale, such as Ascha 2022 (\"Top Surgery and Chest Dysphoria Among Transmasculine and Nonbinary Adolescents and Young Adults\") show a score of only 3.72 for female-to-male patients 3 months after chest masculinization. (The authors report sums instead of averages, but it is trivial to convert the 33.50 given in Table 2 because we know TCS-AC has 9 items.) The paper that developed this scale, Kozee 2012, administered it to over 300 transgender adults and only 1 item (the first) had a mean over 3.\r  \n \r  \nThese numbers raise the possibility that the male-to-female cases in Chen 2023 may already be at their point of maximal improvement on the TCS-AC scale. A 4/5 score for satisfaction with personal appearance may be the best we can hope for in any population. While non-trans people score a 4.89 on this scale (according to Iliadis 2020), that doesn't mean that a similar score is realistically possible for trans people. When a trans person responds to this scale, they are essentially reporting their satisfaction with their appearance, while a non-trans person is answering questions about a construct (gender identity) they probably don't care about, which means you can't make an apples-to-apples comparison of the scores. If this is counter-intuitive to you, consider that a polling question like \"Are you satisfied with your knowledge of Japanese?\" would result in near-perfect satisfaction scores for those in the general public who have no interest in Japanese (knowledge and desire are matched near zero), but lower scores in students of the Japanese language. Even the best student will probably never reach the 5/5 satisfaction-due-to-apathy of the non-student.\r  \n \r  \nI am frustrated by the authors' decision not to be candid about the negative male-to-female results in the abstract, which is all most people (including news reporters) will be able to read. I have seen gender distressed teenagers with their parents in the psychiatric ER, and many of them are high functioning enough to read and be aware of these studies. While some teens want to transition for personal reasons, regardless of the outcomes data, in much the same way that an Orthodox Jew might want to be circumcised regardless of health benefits, others are in distress and are looking for an evidence-based answer. In the spring of 2023, I had a male-to-female teen in my ER for suicidal ideation, and patient and mother both expressed hopefulness about recently started hormonal treatment, citing news coverage of the paper. This teen had complicated concerns about gender identity, but was explicitly starting hormones to treat depression, and it is unclear whether they would have wanted such treatment without news reporting on Chen 2023.\r  \n \r  \nMoving on to the general results, the authors quantify mental health outcomes as: \"positive affect \\[had an\\] annual increase on a 100-point scale \\[of\\] 0.80 points...life satisfaction \\[had an\\] annual increase on a 100-point scale \\[of\\] 2.32 points...We observed decreased scores for depression \\[with an\\] annual change on a 63-point scale \\[of\\] −1.27 points...and decreased \\[anxiety scores\\] annual change on a 100-point scale \\[of\\] −1.46 points...over a period of 2 years of GAH treatment.\" These appear to be small effects, but interpreting quantitative results on mental health scales can be tricky, so I will not say that these results are necessarily too small to be clinically meaningful, but because there is no control group these results are small enough to raise concerns about whether GAH outperforms placebo. It is unfortunate that it is not always straightforward to compare depression treatments due to several scales being in common use, but we can see the power of the placebo effect in other clinical trials on depression. In the original clinical trials for Trintellix, a scale called MADRS was used for depression, which is scored out of 60 points, and most enrolled patients had an average depression score from 31-34. Placebo reduced this score by 10.8 to 14.5 points within 8 weeks (see Table 4, page 21 of FDA label). For Auvelity, another newer antidepressant, the placebo group's depression on the same scale fell from 33.2 to 21.1 after 6 weeks (see Figure 3 of page 21 of FDA label).\r  \n \r  \nI won't belabor the point, but anyone familiar with psychiatric research will be aware that placebo effects can be very large, and they occur across multiple diagnoses, including surprising ones like schizophrenia (see Figure 3 of the FDA label for Caplyta). I am genuinely surprised and confused by how minimal this cohort's response to treatment was. Early in my career I thought we were trading the risk of transition regret for great short-term benefit, and I was confused when I noticed how patients given GAH didn't seem to get better. This data confirms my experience is not a fluke. I could go in depth about their anxiety results, which on a hundred-point scale fell by less than 3 points after two years, but this would read nearly identically to the paragraph above.\r  \n \r  \nA more formal analysis of this paper might try to estimate the effects of psychotherapy and subtract them away from the reported benefits of GAH, and an even more sophisticated analysis might try to tease apart the benefits of testosterone for gender dysphoria per se from its more general impact on mood, but I think this is unnecessary given the very small effects reported and the placebo concerns documented above. Putting biological girls on testosterone is conceptually similar to giving men anabolic steroids, and I remain genuinely surprised that it wasn't more beneficial for their mood in the short term. Some men on high doses of male steroids are euphoric to the point of mania.\r  \n \r  \nBut my biggest concerns with this paper are in the protocol. This paper was part of TYCUS, the Trans Youth Care in United States study, and the attached protocol document, containing original (2016) and revised (2021) versions explains that acute suicidality was an exclusion criterion for this study (see section 4.6.4). There were two deaths by suicide in this study, and 11 reports of suicidal ideation, out of 315 participants, and these patients showed no evidence of being suicidal when the study began. This raises the possibility of iatrogenic harm. It would be beneficial to have more data on the suicidality of this cohort, but the next problem is that the authors did not report this data, despite collecting it according to their protocol document.\r  \n \r  \nThe 5 reported outcome measures in Chen 2023 are only a small fraction of the original data collected. The authors also assessed suicidality, Gender Dysphoria per se (not merely appearance congruence), body esteem and body image (two separate scales), service utilization, resiliency and other measures. This data is missing from the paper. I do not fully understand why the NEJM allowed such a selective reporting of the data, especially regarding the adverse suicide events. A Suicidal Ideation Scale with 8 questions was administered according to both the original and revised protocol. In a political climate where these kinds of treatments are increasingly viewed with hostility and new regulatory burdens, why would authors, who often make media appearances on this topic, hide positive results? It seems far more plausible that they are hiding evidence of harm.\r  \n \r  \nOf course, Chen 2023 is not the only paper ever published on gender medicine, but aside from Tordoff 2022 it is nearly the only paper in modern teens to attempt to measure mental health outcomes. The Ascha 2022 paper on chest masculinization surgery I mentioned above uses as its primary outcome a rating scale called the Chest Dysphoria Measure (CDM), a scale that almost any person without breasts would have a low score on (with the possible exception of the rare woman who specifically wants to have prominent and large breasts that others will notice and comment on in non-sexual contexts), even if they experienced no mental health benefits from the breast removal surgery and regretted it. Only the first item (\"I like looking at my chest in the mirror\") measures personal satisfaction. Other items, such as \"Physical intimacy/sexual activity is difficult because of my chest\" may be able to detect harm in a patient who strongly regrets the surgery but is worded in such a way as not to detect actual benefit. They should have left it at \"Physical intimacy/sexual activity is difficult\" because a person without breasts can't experience dysphoria or functional impairment as a result of having breasts, even if their overall functionality and gender dysphoria are unchanged. Gender dysphoria that is focused on breasts may simply move to hips or waist after the breasts are removed.\r  \n \r  \nTordoff 2022 was an observational cohort study of 104 teens, with 7 on some kind of hormonal treatment for gender dysphoria at the beginning of the study and 69 being on such treatment by the end. The authors measured depression on the PHQ-9 scale at 3, 6, and 12 months, and reported \"60% lower odds of depression and 73% lower odds of suicidality among youths who had initiated PBs or GAHs compared with youths who had not.\" This paper is widely cited as evidence for GAH, but the problem is that the treatment group did not actually improve. The authors are making a statistical argument that relies on the \"no treatment\" group getting worse. This would be bad enough by itself, but the deeper problem is that the apparent worsening of the non-GAH group can be explained by dropout effects. There were 35 teens not on GAH at the end of the study, but only 7 completed the final depression scale.\r  \n \r  \nThe data in eTable 3 of the supplement is helpful. At the beginning the 7 teens on GAH and the 93 not on GAH have similar scores: 57-59% meeting depression criteria and 43-45% positive for self-harming or suicidal thoughts. There is some evidence of a temporary benefit from GAH at 3 months, when the 43 GAH teens were at 56% and 28% for depression and suicidality respectively, and the 38 non-GAH teens at 76% and 58%. At 6 months the 59 GAH teens and 24 non-GAH teens are both around 56-58% and 42-46% for depression and suicidality. At 12 months there appears to be a stark worsening of the non-GAH group, with 86% meeting both depression and suicidality criteria. However, this is because 6/7 = 86% and there are only 7 subjects reporting data out of the 35 not on GAH from the original 104 subject cohort. The actual depression rate for the GAH group remains stable around 56% throughout the study, and the rate of suicidality actually worsens from Month 3 to Month 12.\r  \n \r  \nWe cannot assume that the remaining 7 are representative of the entire untreated 35. I suspect teens dropped out of this study because their gender dysphoria improved in its natural course, as many adolescent symptoms, identities and other concerns do. However, even if you disagree with me on this point, the question you have to ask about the Tordoff study is why these 7 teens would go to a gender clinic for a year and not receive GAH. Whatever the reason was, it makes them non-representative of gender dysphoric teens at a gender clinic.\r  \n \r  \nThe short-term effect of GAH is no longer an unanswered question. Its theoretical basis was strong in the absence of data, but like many strong theories it has failed in the face of data. Now that two studies have failed to report meaningful benefit we can no longer say, as we could as recently as 2021, that the short-term benefits are so strong that they outweigh the potential long-term risks inherent in permanent body modification. Some non-trivial number of patients come to regret these body modifications, and we can no longer claim in good faith that there are enormous short term benefits that outweigh this risk. The gender affirming clinicians had two bites at the apple to find the benefit that they claimed would justify these dramatic interventions, and their failure to find it is much greater than I could have imagined two years ago.\r  \n \r  \nI am not unaware of how fraught and politicized this topic has become, but the time has come to admit that we, even the moderates like me, were wrong. When a teenager is distressed by their gender or gendered traits, altering their body with hormones does not help their distress. I suspect, but cannot yet prove, that the gender affirming model is actively harmful, and this is why these gender studies do not have the same methodological problem of large placebo effect size that plagues so much research in psychiatry. When I do in depth chart reviews of suicidal twenty-something trans adults on my inpatient unit, I often see a pattern of a teenager who was uncomfortable with their body, \"affirmed\" in the belief that they were born in the wrong body (which is an idea that, whether right or wrong, is much harder to cope with than merely accepting that you are a masculine woman, or that you must learn to cope with disliking a specific aspect of your body), and their mental health gets worse and worse the more gender affirming treatments they receive. First, they are uncomfortable being traditionally feminine, then they feel \"fake\" after a social transition and masculine haircut, then they take testosterone and feel extremely depressed about \"being a man with breasts,\" then they have their breasts removed and feel suicidal about not having a penis. The belief that \"there is something wrong with my body\" is a cognitive distortion that has been affirmed instead of Socratically questioned with CBT, and the iatrogenic harm can be extreme.\r  \n \r  \nIf we say we care about trans kids, that must mean caring about them enough to hold their treatments to the same standard of evidence we use for everything else. No one thinks that the way we \"care about Alzheimer's patients\" is allowing Biogen to have free rein marketing Aduhelm. The entire edifice of modern medical science is premised on the idea that we cannot assume we are helping people merely because we have good intentions and a good theory. If researchers from Harvard and UCSF could follow over 300 affirmed trans teens for 2 years, measure them with dozens of scales, and publish what they did, then the notion that GAH is helpful should be considered dubious until proven otherwise. Proving a negative is always tricky, but if half a dozen elite researchers scour my house looking for a cat and can't find one, then it is reasonable to conclude no cat exists. And it may no longer reasonable to consider the medicalization of vulnerable teenagers due to a theory that this cat might exist despite our best efforts to find it.\r  \n \r  \n\\-An ABPN Board Certified Child and Adolescent Psychiatrist\r  \n \r  \nPS - To be clear, I support the civil rights of the trans community, even as I criticize their ideas. I see no more contradiction here than, for example, an atheist supporting religious freedom and being opposed to antisemitism. If an atheist can critique both the teachings and practices of hyper-Orthodox Hasidic Judaism, while being opposed to antisemitism at the same time, I believe that I can criticize the ideas of the trans community (\"born in the wrong body\") while still supporting their civil rights and opposing transphobia in all forms.",
    "title": "The Chen 2023 Paper Raises Serious Concerns About Pediatric Gender Medicine Outcomes",
    "subreddit": "medicine",
    "timestamp": 1691100364,
    "score": 2010,
    "keyword": "man nurse"
  },
  {
    "text": "Please help with a case of geriatric anxiety I have a problem with the patient. She's an elderly woman who became my patient last year after her previous PCP fired her. She's been fired by multiple PCPs in her area due to what I am about to describe. She's now driving 2.5 hrs to see me..\n\nShe's severely hypertensive. She is allergic to all anti-hypertensives that exist. In fact, she is allergic to pretty much every medication with an allergy list over 80 medications long, and she refuses to start new medications.\n\nShe constantly has symptoms. Chest pain, short of breath, can't sleep, stomach pain etc. They will last a week then something new. You name it. She calls the office every day and often uses the emergency nurse line and ends up taking up about 30 minutes of my nurse's day every day. To visit the ER multiple times a week. To the point where ED attendings are reaching out to complain to me. Her husband and her daughter are convinced that there is something wrong with her that nobody else can find it.\n\nBetween her multiple ER visits, she's had every amount of imaging known to man. Every blood test you can think of. Truly outside of her elevated BP, there are no objective findings of illness. She has been on benzodiazepines for over 30 years and recently changed psychiatric providers when her current ones started to taper her. I have got her in with geriatric psychiatry at my hospital, and they are also now weaning her Xanax. All of her symptomology is worsening during this Xanax wean and during this, no new anxiety medications because she refuses to start any of them.\n\nI'm at a loss with her as she's tying up my clinics time my time and the ER's time substantially but I also cannot think of any more interventions to help her. I'm afraid I'm going to end up discharging her from the practice, but then I would just be doing what every other PCP has done for her. My clinic management is asking to start the discharge process. \n\nMy current solutions are:\n\n1. Do as my clinic manager asks and discharge her from the clinic, thus perpetuating the cycle\n\n2. Have her stop seeing psychiatry, and myself take her back up on her xanax to a level that controlled her anxiety better. \n\nPrevious solution attempts by myself:\n- having an appointment every 2 weeks scheduled to talk about her symptoms\n\n- I convinced her to start trazadone for sleep at one point which she developed side effects to and now cites this as a reason why she can never try any new psychiatric medication\n\n- have geriatric medicine consult on her case( they had no suggestions other than to have receive geriatric psychiatry which has worsened the issue).\n\n- having a discussion with her and the family about a more palliative approach. They are only interested in diagnostic approach at this time.\n\n- setting boundaries on how many times she may call the clinic. (She has not been able to follow this)",
    "title": "Please help with a case of geriatric anxiety",
    "subreddit": "medicine",
    "timestamp": 1696305124,
    "score": 302,
    "keyword": "man nurse"
  },
  {
    "text": "In Which OP and Crew Didn't Call a Trauma Alert Grandpa fall down intra-cranial artery go boom. You see, kiddo, when an old man and his Pradaxa love each other very much...\n\nPatient was with it long enough to be driven by his wife to Totally Not a Trauma Center Memorial Hospital (TNATCMH) shamble into the ED waiting room, share the high points of his story, and pass out at the triage desk, whereupon he was duly tubed, vented, and the Annular Oracle consulted.\n\nI'm on my usual CCT shift with a nurse I've worked with for over a year and another EMT and we're headed back to the barn for end of shift. BuuuUUUUuuuttt... we got the call to take him to Definitely a Trauma Center Medical Center (DATCMC), code 3 response. Fine. You call, we haul. We get there and my nurse partner gets the story from the sending MD while my EMT partner and I set up the ventilator and IV pump for his meds (nicardipine and precedex).\\*\n\nMy EMT partner that day is... special. They will do *anything* you ask them to do, and with a great attitude, but they have *no* initiative and no capability for independent thought. If you want them to do something, you have to describe it in excruciating detail, and if you don't ask them, it doesn't happen. So getting him ready to go is pretty much me doing everything by myself, occasionally asking my EMT partner to go get this or that from our bag.\n\nAnyhow, we get him packaged up, double check all of the things, switch O2 supply from the wall to our gurney tank, and we boogie out to the rig.\n\nWe didn't call a trauma report to DATCMC before we got there. The sending MD had called ahead, they knew he was coming in *at some point,* and were holding a bed for him, but we didn't call ahead to let them know exactly *when.*\n\nCharge and the UA there were *heated*. I get it; I don't blame them. But there's only time for so many things. It was not even a ten minute drive. My nurse is, for all intents and purposes, alone back there and she's got to get a BP on this dude who is fighting every aspect of this (not that I blame him). We're giving him enough precedex for, let's say, a cranky toddler who needs a nap, and not, rather, an adult male with a tube in his throat, being accosted by gang of rude strangers comitting a very circumscribed assault against him by pulling him around in a hammock and squeezing the ever-loving shit out of his limbs, one at a time.\n\nBy the time she's finished that fight, decided whether that number warrants a titration of the nicardipine, and has made a quick note on, like, ***A*** thing, boom, we're there. I couldn't call the report because I was busy driving code 3 in stealth mode (see previous statement about the precedex), and the other EMT couldn't call because as helpful as they are, they lack the initiative required to execute the complex and interconnected series of tasks required to call a trauma report without significant and repeated prompting.\n\nSo it didn't happen. Despite the conditions, it *should* have happened. Probably while we were still on the wall at TNATC Memorial.\n\nSorry, guys. We learned.\n\n---\n\\* Anticipating certain objections, the nurse checks everything before we actually connect it to the patient.",
    "title": "In Which OP and Crew Didn't Call a Trauma Alert",
    "subreddit": "medicine",
    "timestamp": 1681095953,
    "score": 143,
    "keyword": "man nurse"
  },
  {
    "text": "Thursday                                   Had an interesting Thursday, felt like sharing a journal entry. Apologies for the formatting\n\n Thursday\n\n\tI hurriedly knock, apologize for the wait, pull up my stool and sit down. Bob sits in his chair; I sit on mine. His hands are shaky today, clasping a hand written note with five items on it. “I’m tired.” Bob is an engineer by training, long since retired. He’s often understated, but always organized. “I just don’t seem to have any energy and I get short winded these days.” These are items one and two. He doesn’t look at me, just peers over his rimmed glasses at his note, neatly penned on fancy stationery with geese at the top. His wife was fond of geese, and used to be his focus during visits with me. \n\nMy mind drifts a bit. I’ve read about Bob before I stepped in the room. It’s my job, you see. I’m to fix his problems, ease his dis-ease. Set things right. But in Bob’s case, I already know he’s full of cancer. I’ve been walking with him, starting 2 years ago at diagnosis. I have been there through his cryoablation of kidney cancer. Clear cell renal carcinoma. The procedure nearly killed him, and he recovered very poorly and slowly. Bob became very confused, as is common with people with mild cognitive impairment after a large insult to their body. It looks a lot like Alzheimer’s, and is similar, in a way. The disorientation, confusion, frailty. Family was concerned he didn’t know who he was, where he was, when it was. That he was so weak and unbalanced, falling all the time. He used to lead his family, a strong patriarch. Daughters and son in laws would tell me that something just wasn’t right, that he seemed a mere shell of himself. A wraith, faded away and unable to take care of Mabel. It had been my idea to put them both in the nursing home, and a bit of paternalistic nudging saw it done. \n\nHe eventually recovered after spending many unhappy months in long term nursing care. During his stay, Mabel withered away from a myriad of conditions including paralysis of a leg, a stroke and too many birthdays. She’s been buried more than a year now. I remember signing her card from the clinic. “It was a privilege to have played a small part in Mabel’s care. Thank you for the opportunity to be a part of your lives, and my sincere condolences at your loss.” I’m sure I wrote some such platitude. I sign a few of these cards each week. Some I know better, some less well. \n\nNow it’s Bob’s turn. He is telling me that sometimes he has such terrible pain in the right flank that he cannot stay standing up to shave, and has to sit in a chair. He’s stoic, quiet, and understated, the way many octogenarian men of his generation are. I’m sure he is minimizing his pain. “I see you saw the oncologist last month. What did they tell you?” I ask. “The spot in my lung is smaller. We’re going to do another CT in a few months. Looks like it is going well,” he tells me. I’m already running behind, about 10 minutes. I have a choice, I can have him follow – up with oncology, and do a standard fatigue workup. Check some blood, some iron, talk about sleep, depression and send him on his way. I mean, he’s already seeing the oncologist for his cancer, right? They’re taking care of things. \n\n“Did they tell you that you that this cancer is going to kill you? That this is a terminal disease, and will likely be the cause of your death?” There’s a loud silence. Deafening. Bob stares at me. I look back and him and sit, perched with my legs crossed, peering back over my glasses and waiting with open body language for his response. Seconds pass. Tens of seconds. His hand shakes, and squeezes his list, crinkling the paper audibly. He knew, or at least I suspect he knew, that something was very wrong. I had read the consult notes, full of euphemisms such as “conservative approach” and “longitudinal monitoring.” I don’t like these words. Die, death, kill, fatal. These words are better. These are not nice words, but there is no mistaking their meaning. If I think a patient is going to die, I tell them “I think you are going to die.” It’s too easy to weasel out of the discomfort and couch things in medical jargon and pleasant euphemisms. \n\nThese situations often put me in mind of an apocryphal story I was told in my training. A Mexican immigrant had been at the hospital, admitted after some terrible injury. He was whisked from the emergency department to the operating room by the trauma team. As often happens, despite the best efforts of the team, this poor man succumbs to his injuries and dies. A resident, a doctor in training, is dispatched to the waiting room to break the news to family. No one in the family speaks English except the 14-year-old son. “I’m sorry to give you this news, but we’ve lost your father,” the resident solemnly intones. After the deceased’s son translates the news, the family is appropriately shocked, grieving wife, daughters and sister begin crying. The resident withdraws to give them time to grieve as a family, but when he returns in a few minutes with the attending physician and ancillary staff, the family is nowhere to be found. A harried search ensures, and the family is found wandering the hospital grounds in the parking lot and surrounding park, calling out their father’s name. He was lost, and now they have desperately gone to find him. \n\nQueue morbid laughter. The lesson here was supposed to be – always used a licensed hospital interpreter and never family members. Also use plain language and not euphemisms or expressions. “Your son is dead.” “Your wife died.” It seemed silly at the time, and I’ve never been able to verify if it was actually a true story. But I’ve had occasion to tell so many people “your baby is dead” that I can’t remember them all. But my teachers were right, because I’ve seen what happens when it isn’t said that way. \n\n After the long silence, Bob clears his throat. “Oh. I didn’t realize that it was that serious. I thought it was no big deal.” “I think your body is wearing out. This isn’t good news, and you have uncurable cancer. That’s why you’ve been so tired. That’s why you’re getting more short of breath.” \n\nBefore walking into the room, I spent 10 minutes between patients hurriedly pouring over prior testing that I had ordered and specialists had done. Normal Echocardiogram 6 months ago, EF 55%, grade 1 diastolic dysfunction, blood pressure normotensive, no significant weight gain, mild weight loss of 3 lbs in 2 months, physical exam is euvolemic today, no conversational dyspnea; my medical assistant tells me he had mild exertional dyspnea with normal Sp02 from his walk in from the waiting room. Physical exam unremarkable. Bronchoscopy with endobronchial ultrasound done 3 months ago for hilar adenopathy with 2.8x2.1cm subpleural right mass with no evidence of lymphatic spread, surgical path of subpleural lesion consistent with renal oligometastatic disease, not a lung cancer. Suboptimal sampling of the lymph nodes. Cannot exclude regional metastasis with persistent right hilar lymphadenopathy on repeat CT chest. No clear evidence of regional recurrence in right kidney, changes consistent with post-ablation therapy, clinically correlate. New 1.8x1.6cm mass at upper pole of left kidney, concerning for renal malignancy; recommend MRI and/or tissue sampling/excision for further evaluation. No evidence of abdominal or pelvic metastasis. \n\nI am not a cancer doctor. I don’t want to be wrong. Can’t be wrong. I’m giving a terminal diagnosis. He asks me “Well, what do we do next? Can we beat this thing?” I already know the answer is no. I tell him a rehearsed script about how doctors like to fix problems, but some things cannot be fixed. That we can actually do more harm than good trying our very best. I broach the topic of hospice. He wants to know how long he has. They usually ask me this. I tell Bob that I will give a call to his oncologist, because these things are unpredictable, but that I think I would hurt him more than help by doing more tests, more needles, more tubes, more tests. I tell him that patient’s on hospice actually live longer than patients receiving aggressive care. (I doubt myself, and look up the study again for probably the 40th time, per AAFP review from 2007 showing that patients with a terminal diagnosis of cancer had a median survival that was statistically significantly longer in lung, pancreatic or metastatic melanoma by up to three months but not in colon, prostate or breast cancer. This is likely not generalizable to my patient. Evidence based medicine is a bitch). \n\nTime’s up. Time to send Bob out the door. He came here with a list of 5 things, and his chief complaint is he wants to be less tired. Instead of making him feel better, I told him he’s dying, so long and thanks for all the fish. I am now 35 minutes behind. I have 4 patients waiting. An infected butt abscess, a cold that needs a work note, a well-known-to-me patient who is a demanding hypochondriac and someone who has been waiting to get their child vaccinated so they can get back to work. I give Bob an after visit summary (what a fucking joke), some promises that I will talk to his cancer doctor, to his daughter and that I will call him later. \nTime for the next patient. I put on a smile, open the door and ask a 13 year old if he’s decided what he’s going to be when he grows up. “Did you do anything fun this summer?”\n\nSomewhere in the middle of my day I call the oncologist. He agrees it’s recurrent, metastatic and now with a probable new primary malignancy in the left kidney. Bob is not a curative treatment candidate, and a poor candidate even for palliative immunotherapy. They agree hospice is “reasonable.” “These kidney cancers are weird. Could be weeks or years. You never know.” Thanks. The oncologist asks how my father is doing, and to say hi. He’s worked with him for decades. “Still chugging along. Go “local sports team” I say.” \n\nI finish my day early somehow. I have 27 phone messages, 32 lab and imaging results, 8 cc’d notes, 14 MyChart™ messages to address. One of these is a phone call from Bob’s daughter. Bob called her and told her he “doesn’t have long,” – Provider please address, the copied message says. I call and talk with her, tell her that I talked to oncology, they agree that he’s terminal. Yes, it’s serious. No I don’t know why this wasn’t more explicit at their last visits. Yes, he has a new cancer in the left kidney. I talk about hospice. Bob and his wife Mabel and daughter had a great experience with hospice care during the end of her life (go me for early referral? #selfcare). Yes, they’d be open to visiting with hospice for admission. I call Bob and repeat everything. I call my hospice coordinator. He’s to be admitted tomorrow. Not every nurse saves lives. God made some to give out angel wings. \n\nTomorrow is Friday. TGIF.\n\n\nI stare at my computer for a bit at the end of the day. I picture Bob sitting alone in his assisted living apartment, clutching his stationery with the fabulous geese on top. Five problems. In the dark. I cry for a little while by myself, then pack up to go home. \n\n\nThursday.",
    "title": "Thursday",
    "subreddit": "medicine",
    "timestamp": 1694753414,
    "score": 131,
    "keyword": "man nurse"
  },
  {
    "text": "dealing with death Dealing with death\n\nHello everyone,\n\nPlease note, this is not a bash on medical staff, my family are doctors and I have the utmost respect and love.\n\nI am a clinical nurse consultant. I normally work in the emergency department as a clinical nurse and have for 10 years.\n\nI recently joined a team of nurses whom bring critical care knowledge to the ward and review and keep and eye on patients whom have risk of deteriorating.\n\nWorking within an emergency environment I see death all the time but I'm not the one making the calls with life and death. \n\nI am struggling months later to deal with a death of a patient. The clinical nurse consultant role is also expanded to respond to medical emergency calls secondary to deterioration. \n\nI had a page to a MET call for a patient who was in mild/mod respiratory distress. Two doctors were present, both looking at the computer trying to figure out this man's history. He had nasal prongs on and hypoxia. The doctors asked for a face mask oxygen and I told them to change to a non rebreather mask as hypoxia was worsening. By the time I had arrived no one had done an ECG. Whilst they gathered the ECG machine I had to get a nurse to me his history. I also asked for an acute resus plan - he was not for CPR. His condition worsened and I had PE (no risk factors) or STEMI on my list of differentials. ECG was not overtly concerning initially, during this time the doctors were trying to get in contact with their consultant.\n\nMy next plan was to call a code however he lost cardiac output and a code team (emergency department team) would be of little benefit as he was not for CPR. \n\nI have played the scenario around in my head for weeks. The gentleman deteriorated so quickly, thrombolysis went through my head but time was not on our side.\n\nDue to the doctors virtually saying nothing in the MET call I feel his death burden is on me.\n\nOne thing I have learnt is that I have a new found respect for our medical profession whom have to have this weight on their shoulders day in and day out and I hope you know that you're so appreciated.",
    "title": "dealing with death",
    "subreddit": "medicine",
    "timestamp": 1676710938,
    "score": 1,
    "keyword": "man nurse"
  },
  {
    "text": "My patients mom complained because I called her newborn “lil bug”, “Mr. Man”, and “sir”. I just… have a hard time talking to a newborn baby and saying “ok Thomas I’m gonna change your diaper now” instead of “ok Mr. Man gotta change those pants”\n\nAt least my managers were dying laughing and all I ended up doing was make a nurse to nurse note that “MOC refuses unauthorized use of nicknames”",
    "title": "My patients mom complained because I called her newborn “lil bug”, “Mr. Man”, and “sir”.",
    "subreddit": "nursing",
    "timestamp": 1683473021,
    "score": 3335,
    "keyword": "man nurse"
  },
  {
    "text": "We just got the absolute worst new grad nurse and I just have to share This girl did her clinicals at my hospital in the ED, and she was eventually hired on after she applied. During her clinical rotations, she was awful. We begged management not to hire her, and to our surprise she was hired. Now she’s here orienting and I can’t make this shit up. \n\nShe tried to teach us about “proper IV insertion” as if I haven’t been doing this shit for three fucking years now. She also misses constantly and her “technique” is garbage.  \n\nShe specified why a patient coming for detox had a bottle of “narcotics” that needed to be locked away with security and not in the patients belongings. It was their blood pressure medication. \n\nWhenever you tell a story about some crazy patient you had, she has to chime in with “oh that’s nothing, I had this one patient…” bro you just graduated, chill. \n\nA facility called asking about a patients glucose and was charted as 200 when they first arrived. She blatantly tells the nurse at the facility “I don’t know where you’re coming up with that number but that’s not on their chart.” It was charted. She didn’t look back and only went off one the last glucose check that was recently done.\n\nA younger patient (early 20’s) was suicidal and she was obviously scared to be baker acted. When the girl questioned why she had to change into a gown, the nurse said “if you don’t we will chemically restrain you and we will all force you down and tie you to the bed.” As if this wasn’t already at the lowest point in her life, this asshat just ruined any chance of getting on the patients side to get her help. \n\nI checked a patients vitals. She immediately went and rechecked them after I did them AND charted it. \n\nShe missed on a straight stick for blood on a patient and said “yeah they’re definitely gonna be ultrasound, she has a ton of scar tissue and clearly is an IV drug user so I mean you can check if you want but I couldn’t get it so I know she won’t be easy.” The patient had great veins and was in fact not an IV drug user. Got blood with no issues. \n\nShe tried to show me how to properly send blood up to the lab. I’m not joking. The one role I have as a tech with drawing blood is sending it in the tube station. I’m always sending and calling for more. She showed me how to “properly” send them, and how to request more tubes without calling for them, a feature that doesn’t work on our stations. She said “no no here let me show you” and wow would you fucking believe it when I tell you I did not receive a single tube and lost two minutes off my life waiting for this dummy to accept she was wrong. \n\nI’ve been in healthcare for almost six years now and I know I don’t want to be a nurse. Nothing against it, just not what I want to do. She asked why I want to get into PA school and don’t want to go to become a nurse. She followed that with how incredible being a nurse is and explained what she can do as one. Homie I don’t know if you are aware of this, but you literally JUST FUCKING GRADUATED\n\nLastly not related but she just pisses me off. She saw my tattoos and said she couldn’t imagine being like me and just putting stuff on my body and if she ever decided to her a tattoo, it HAS to be meaningful in some way. Sounds dope dude, the eagle globe and anchor I have clearly means nothing and I feel more enlightened about my tattoo decision based on that twelve second conversation.\n\nAnyways all of this occurred in a single twelve hour shift. I don’t even know how she managed to get hired but man it’s like they’ll just take anyone with a pulse at this point and she is living, breathing proof of it. \n\nEnd rant",
    "title": "We just got the absolute worst new grad nurse and I just have to share",
    "subreddit": "nursing",
    "timestamp": 1691840134,
    "score": 2047,
    "keyword": "man nurse"
  },
  {
    "text": "Loosen your butthole a bit, sheesh. Floated. Gave report to a nurse from a different ICU that also got floated here. \n\nMy patients had similar stuff happening. I confused the HR ranges on them during report. I corrected myself after she had already written it down. \n\nShe rolled her eyes and sighed.\n\nGave her the BP ranges and she goes: \"and this is for 8 and not 9? Right?\" In a condescending tone. She proceeded to check the chart to double check me. Same for UOP.\n\nBoth patients are floor boarders. All I did was say one was NSR when they were actually tachycardic and I immediately corrected myself. \n\nIt. Is. Not. That. Deep.\n\nI know our job is hard. But I don't know, man, some of us truly do it to ourselves.\n\nLoosen your butthole.",
    "title": "Loosen your butthole a bit, sheesh.",
    "subreddit": "nursing",
    "timestamp": 1689691762,
    "score": 1695,
    "keyword": "man nurse"
  },
  {
    "text": "“suicidal” “wonderful” Psych nurse. Was admitting a new patient today and first thing I said was “I know you’ve already been asked this by 3 people before me, but I have to write down why you’re here in your own words”. A lot of times this question brings on a long drawn out story and way more than I really need. Dude answers with one word “suicidal”. Instead of responding with something appropriate, I was just glad he only said one word so I responded, “wonderful! 😀”. Y’all. I wanted to just disappear. Felt horrible and quickly began trying to explain that I was just meaning it was “wonderful” bc he was making my job easier by giving me a one-word answer. Which doesn’t make it any better. Luckily, this man has been my patient in the past and we have a good rapport. He understood what I meant but I still feel bad about it. \n\nWhat fucked up things have you said that you immediately thought “why tf did I just say that?!?”.",
    "title": "“suicidal” “wonderful”",
    "subreddit": "nursing",
    "timestamp": 1689997340,
    "score": 1253,
    "keyword": "man nurse"
  },
  {
    "text": "PSA: if you’re taking care of a confused, forgetful, easily agitated patient…PLEASE STOP CORRECTING THEM! This week I worked 3 days in a row with an extremely confused patient who would repeat the same exact conversation topics to every person who entered his room. These topics included an invitation to his wedding in the Bahamas, jokes that were oftentimes inappropriate, his twin brother who passed years ago from organ failure, an offer of a million dollars because he was a “billionaire,” and many more. \n\nI work on a Neuro med-surg unit. This patient (who was a frequent flyer and at his baseline) was supposed to be rotated out but because he had much happier, calmer days with me, I ended up getting him 3 days in a row. Several people were really impressed with how well he was behaving with me compared to other nurses/pcas. The reason? I wasn’t constantly trying to correct him. I noticed immediately that other staff members (not all but a majority) continued to scold him for his inappropriate jokes, tell him they would NOT attend his destination wedding because it was “unprofessional”, or they would just straight up ignore him while they were in the room. \nYou know what happened each time? He would start cursing, yelling, refusing care, and ultimately require security. \n\nWhy was it so necessary to correct this man?! What exactly was “achieved” when the man became so irate he refused care?!\nLiterally all I did was laugh at the repeated jokes, accept his wedding invitation each time as though he it were the first, give him my condolences that he lost his twin, and tell him I would gladly accept his million dollar offer as soon as he took his meds. \n\nAnd in case you’re wondering “well maybe he was just improving cognitively.” He wasn’t. In fact, during night shift (between my back-to-back shifts) a nurse took it upon herself to correct the patient and tell him he was being inappropriate (when I TOLD her not to!) Patient ended up agitated and angry all night long, hardly sleeping, and refusing all meds and brief changes…\n\nSo again, what purpose does “being right” actually serve when taking care of a confused, agitated patient??\n\n\nTldr: confused patient took all his meds and accepted all patient care for the three days I had him I because I wasn’t trying to deliberately upset him.",
    "title": "PSA: if you’re taking care of a confused, forgetful, easily agitated patient…PLEASE STOP CORRECTING THEM!",
    "subreddit": "nursing",
    "timestamp": 1682867782,
    "score": 1244,
    "keyword": "man nurse"
  },
  {
    "text": "What has been the most profound moment in your nursing career? Mine was as a student nurse on the ENT ward. A man was admitted who had been born Deaf, used Sign Language his whole life, then became blind later in life from a degenerative disease. His interpreter had been called urgently away from the hospital and as the only person on the ward who could sign, I was given the task of trying to communicate with him until she returned. When we first met, I fingerspelled my name into the palm of his hand, and he reached out and touched my face to create a mental map of the landmarks and contours (e.g. my glasses, the shape of my chin, my cheekbones). Then he fingerspelled my name back to me. The rest of the night, each time I went to his room I would tap his shoulder, he would reach out for my face and confirm it was me then sign my name. Whenever I explained our interventions or asked him a question, he would have his hands over mine so he could feel the shapes my hands made.\n\nIt was truly the most profound moment of human connection I've ever experienced, and something I think about a lot. I'm not gonna lie, at one point I just cried because it just felt like such an enormous privilege to be able to connect with another human being in such a vulnerable state. I was thinking about it today and it got me wondering what other experiences people may have had that have just made you stop and marvel at what is happening! Would love to hear yours :)\n\nEdit: I am on night shift right now (3am here in New Zealand) and just sitting down for a break - I'm so happy to see so many lovely stories and I'm looking forward to reading them all thoroughly when I'm home! Thank you all for sharing. It's a nice reminder that amongst the absolute shitshow that nursing can be, there are moments where we realise that we really do make a difference ❤️",
    "title": "What has been the most profound moment in your nursing career?",
    "subreddit": "nursing",
    "timestamp": 1686042514,
    "score": 1108,
    "keyword": "man nurse"
  },
  {
    "text": "Patient grabbed my vagina I am not technically a nurse just yet, I am a nurse extern. Anyway today I had a male patient about 66 years old, I am not even really sure what he was in for. However the point is this man was very unsteady on his feet and had trouble standing up and needed a walker. He was probably a 2 assist but we were short staffed. Now this patient was creepy to begin with the past 2 days asking weird personal questions, making weird comments, staring at my butt/boobs. Whatever, I can honestly say I’m used to it doesn’t phase me and I ignore it\n\nThe problem began when he called out for assistance to get to the bathroom. Fine, I go in there and getting him to stand up was difficult enough already especially considering he never listens to anything I say regarding getting up safely. I am 5’2 and built like a noodle so it was already hard enough getting him up. Once we start walking, I am not sure what the fuck he was doing, whether he was just trying to get a better grip on his walker or what but suddenly he grabs me between my legs. Doesn’t even acknowledge anything, no apology and the cherry on top—he shit himself the whole way to the toilet.\n\nTo make things worse I thought I was fine but then I started ugly crying in the bathroom, I think I was just triggered and angry d/t past personal events. Security was called and I was asked if I wanted to press charges and I said no but I’m reconsidering. Has anyone been in a similar situation? Does anyone have any advice for how to deal with creepy male patients? I’m so fed up of being made to feel uncomfy. I’ve only been doing this about 6 months, I know I need to be more assertive early on w/ men like this….lesson learned \n\nI was just stunned, I didn’t even say anything but I reported it immediately and everyone flipped out. Security was called and no female can be alone in the room with him and he only has male nurses now. FYI, this guy was totally alert and I oriented",
    "title": "Patient grabbed my vagina",
    "subreddit": "nursing",
    "timestamp": 1688863848,
    "score": 1108,
    "keyword": "man nurse"
  },
  {
    "text": "Male nurse told to 'man up' by his female boss in front of a room full of women wins sex discrimination case [https://www.dailymail.co.uk/news/article-12437145/Male-nurse-told-man-female-boss-room-women-wins-sex-discrimination-case.html](https://www.dailymail.co.uk/news/article-12437145/Male-nurse-told-man-female-boss-room-women-wins-sex-discrimination-case.html)",
    "title": "Male nurse told to 'man up' by his female boss in front of a room full of women wins sex discrimination case",
    "subreddit": "nursing",
    "timestamp": 1692894663,
    "score": 1103,
    "keyword": "man nurse"
  },
  {
    "text": "Just a reminder for New Nightshift nurses who haven’t done shift work before. Night shift might be killing you, and it’s ok to talk about it. I just got done giving report to a night shift nurse. She passively mentioned she’s only been doing night shift a year and a half and it’s a bit of a struggle, and I immediately triggered back to my time in night shift and I looked at her and said, “listen, night shift isn’t for everyone, and if it isn’t for you you need to get out, cuz it does dark things to you mind.” And she got quiet for a moment and responded “I’m trying to get away from night shift as soon as possible.” \n\nNight shift gave me full blown suicidal ideations for months. I couldn’t look at a bottle of insulin without vividly imagining injecting the entire thing into my neck. I didn’t want to die, quite the opposite, but man I could not stop fantasizing about offing myself. I was scared I’d eventually do it. \n\nWithin weeks of moving to days I was perfectly fine and haven’t struggled with those kinda thoughts since. \n\nI just wanna make sure you know that if you are dealing with this kinda shit that you aren’t crazy, working nights is doing this to you.",
    "title": "Just a reminder for New Nightshift nurses who haven’t done shift work before. Night shift might be killing you, and it’s ok to talk about it.",
    "subreddit": "nursing",
    "timestamp": 1682732701,
    "score": 1093,
    "keyword": "man nurse"
  },
  {
    "text": "Worst Baby Daddy? I work in L&D as a Nurse Extern, mostly manning the front desk when I’m working a shift at the hospital. It is absolutely appalling the amount of baby daddies who shamelessly flirt with me while their partner has just given birth to their literal child down the hall. I’m interested in the stories experienced nurses have to provide;\n\nWhat’s the worst baby daddy interaction you’ve had?",
    "title": "Worst Baby Daddy?",
    "subreddit": "nursing",
    "timestamp": 1703622672,
    "score": 1078,
    "keyword": "man nurse"
  },
  {
    "text": "A man got kicked out of our ER, has made a series of YouTube videos disparaging and making false allegations against the hospital, and has been calling up here saying he will be coming back. Admin’s solution is to post pics of him around the hospital and telling us to call 911 if we see him. He had brought his spouse into the ER and filmed a YouTube video of them checking in and demanding to know the first and last names of everyone working. He was belligerent and hostile from the jump and there were a few red flags for DV (husband refused to leave the exam room even after spouse asked him to, didn’t let her speak for herself, etc)\n\nHe was kicked out by the ER doc after he became physically aggressive. He stuck around for a bit to sneakily record from behind the vending machine but then went outside to film the hospital and talk shit and play the victim.\n\nWe are a small primarily surgical hospital and do not have a security guard. Our ER requires people to be buzzed in but we have no way of verifying who someone is until they’re actually inside. Admin sent out an email with a screenshot from one of their videos telling us to call 911 if they show back up. Also posted signs in the break room and at the nurses station saying the same. Guy has called numerous times saying that he’s going to come back up here. Apparently since he’s not making any overt threats there’s nothing that can be done. \n\nAdmin is discouraging employees from talking about it. Any questions are met with platitudes or lip service or are just ignored. I am afraid and angry. It feels like admin is doing nothing to keep us safe.\n\nEDIT: Wow, I am overwhelmed by all of the support. You guys make me so proud to be a part of this community. I thought that everyone in the hospital who knows what happened, esp the people who work on the unit where this all went down, were on edge already, but today it got so much worse because THE MF COPS SHOWED UP TO THE ER WITH GUNS DRAWN D/T REPORT OF A HOMICIDAL MAN WITH A WEAPON. Everyone was freaking out thinking it must be the guy coming back like he said he would (my work bestie wasted no time making her choice and bolted for the exit lmao) but it turns out THEY WERE AT THE WRONG HOSPITAL. To be fair, my hospital has a very similar name to a larger one about 10mins away and it’s not uncommon for people to mistake our hospital for theirs, but I would have hoped that the *police* would do better. Sooo now everybody’s anxiety is through the roof. \n\nI guess admin heard people talking about what happened because the president of the hospital sent out a passive aggressive email that read like one of those boomer comics that you see on Facebook about how people need to quit gossiping. 🙂🙂🙂",
    "title": "A man got kicked out of our ER, has made a series of YouTube videos disparaging and making false allegations against the hospital, and has been calling up here saying he will be coming back. Admin’s solution is to post pics of him around the hospital and telling us to call 911 if we see him.",
    "subreddit": "nursing",
    "timestamp": 1681478564,
    "score": 1079,
    "keyword": "man nurse"
  },
  {
    "text": "Am I being petty for being mad about this? For nurses day, some of us got a T shirt...but our raises are \"not in the budget\".\n\nI love our physicians man, they're great,but I can't help but be a tad salty about this, especially when most of us here are working OT to pay for the ever increasing costs of basic necessities",
    "title": "Am I being petty for being mad about this?",
    "subreddit": "nursing",
    "timestamp": 1692733377,
    "score": 976,
    "keyword": "man nurse"
  },
  {
    "text": "The problem with driving down graduation standards, literacy rates and numeracy rates in Western public schools A lot of people are saying politicians are doing this to get people to be easier to control and manipulate. And that's valid.\n\nBut you need workers who can read properly. A few people here and there who have a genuine reading problem or a numeracy problem - they can generally have accommodations made for them and still be able to lead successful lives.\n\nA whole generation of people who were never taught to read or write or do basic maths properly - this is a problem. You need these skills for even our most basic jobs.\n\nA cashier needs basic literacy and numeracy skills. So does a waiter. So does a hotel worker. A Starbucks barista needs to know these skills to be able to measure how much coffee they're putting in your order among other numerous ingredients. A kitchenhand needs to be able to read and measure. A CCA in a nursing home needs to be able to read instructions on medicine and issue correct dosages and read how to operate equipment properly. A nanny or para or teacher aide in a school or ECE centre definitely needs to know how to read. A cleaner needs to know how to read labels on cleaning products. A garbage man needs to be able to drive well, you need to be able to read to drive and have proper judgement. \n\nA construction worker or truck driver needs to be able to measure properly and have proper judgement and be able to watch out for safety. A mechanic needs to be good at math to know how to fix a car and make it safe. Even a lifty or a ride operator at a ski or tourist resort needs to be able to read and have good enough judgement to watch out for safety. Hairdressers and nail salon workers need to be able to read to understand what they're putting on your hair or nails and when. A flight attendant isn't just a 'sky waitress', she is literally the person who is last off the plane in an emergency - without proper literacy skills and numeracy skills she would literally not pass the test.\n\nEven a stripper or an onlyfans worker needs to know how to count tips and pay taxes and get along with customers and other workers.\n\nPoliticians may have an easier to manipulate class of poor people, but they'll also have no working class left - as they'll have a generation of poor people with no marketable skills. Then what?",
    "title": "The problem with driving down graduation standards, literacy rates and numeracy rates in Western public schools",
    "subreddit": "Teachers",
    "timestamp": 1681524649,
    "score": 39,
    "keyword": "man nurse"
  },
  {
    "text": "Software Engineering or Stick it Out as a Nurse? I've been a psych nurse for about 7 months now.\r  \n\r  \nI went in with a really big heart. I wanted to help. I wanted to be able to change people's perspectives and make people realize their life was worth living. To help them make choices that better themselves.\r  \n\r  \n**This job has sucked every single ounce of compassion I have out of me**. I've been told to fuck off by patients who are suicidal, \"Why do you keep fucking with me?\" from detoxers who need their vitals checked to make sure they don't seize. Patients who are so psychotic their screams are ear-splitting and want to die because the voices just won't stop. Patients who are manic and rolled themselves in their own shit. Patients who have went to jail for assault, rape, domestic violence, etc. Patients who've expressed how they wanted to hurt/kill me.\r  \n\r  \nI understand these people are sick and lack the coping mechanisms to function or there's a biological component that makes that difficult. I'm **very** sympathetic to that. It's just that...I don't know if I'm walking on a unit that's chill for the day with patients who will be cooperative, or a patient who is trying to escape where I have to stand by the door before I even come in for my shift.\r  \n\r  \nI'm tired of continuous never ending anxiety. I'm tired of helping people that don't want to be helped, try to manipulate me, use me, or hurt me. I'd almost rather slit my wrists and sit on a bridge than go to work.\r  \n\r  \nEvery interview I go on for a better specialty and don't get, completely wrecks me. Every email I get telling me they have \"more qualified candidates\" makes me want to sink to the bottom of a lake with cinder blocks around my ankles.\r  \n\r  \nI don't want to be a ER, ED, ICU nurse or med-surg. That's trading one burn out for another. Every clinic job or chill position I want, I get denied. And man...it's fucking killing me inside. I'm considering even a job in tech, but software engineering doesn't seem like it's \"coding boot camp = peaches and rainbows\"\n\nA nice, derm clinic in a upscale community with patients who actually want to be there, sounds amazing. It seems almost fucking impossible to get there. \n\n\r\rI just want to be **fucking free**. And I can't even get that.",
    "title": "Software Engineering or Stick it Out as a Nurse?",
    "subreddit": "careerguidance",
    "timestamp": 1694057337,
    "score": 11,
    "keyword": "man nurse"
  },
  {
    "text": "When did \"Dear\" become acceptable in business writing? I would consider myself old, but not ancient. Over the hill certainly. When did the world decide that \"dear\" was an acceptable opener for business communications? \n\nBack when I was in school, it was drilled into us that it was NEVER acceptable in business writing and why should it be? The CFO isn't dear to me, I don't know him. It's patronizing and inappropriate at best. I was always taught \"Mrs. Smith:\" was the accepted style.\n\nOld man yells at cloud aside, am I coming across as brusque or rude if I submit a cover letter not calling the hiring manager \"dear\"? I'd love to get some takes from the younger folks as well as my peers that are likely to end up in the nursing home with me.",
    "title": "When did \"Dear\" become acceptable in business writing?",
    "subreddit": "careerguidance",
    "timestamp": 1691459546,
    "score": 5,
    "keyword": "man nurse"
  },
  {
    "text": "Lost my one chance at a good career and am now totally adrift. ¿Wat do? Apologies in advance if this gets long.\n\nI'm almost 32, graduated in 2013 with a bullshit degree not worth the paper its printed on. For the sake of brevity, suffice it to say I never really entered my field of study and can't really do it now (again, useless degree) and have no desire to (any jobs I'd get, which don't really exist to begin with, I'd be lucky to make $40k/yr). \n\nI wound up being self employed for many of the intervening years, only broke $20k once. Then out of the blue due to a networking connection, I was plucked from obscurity after losing half my annual revenue in accounts in the span of two weeks and started a real estate-adjacent job making a $30k salary which felt like becoming a  millionaire overnight. Fast forward a few years, my boss left to start his own company and took me with him as his second in command after quickly becoming very good at the work we did. I went from $30k to $70k inclusive of bonuses/commissions, again, overnight. Then the inflation/interest rate hike started at the beginning of last year and got progressively worse to the point where, because of those things combined with a severe lack of housing inventory in my area, I got laid off late October of last year. My boss is now living off of credit cards and a HELOC, the company we left closed completely, and every other company in my area that does what I did is also hemorrhaging money and laying off people left and right. \n\nI am at a complete loss for what to do next. Fortunately my wife is a nurse and can pick up overtime, but 1, I don't feel right asking that of her and 2, she is borderline disabled and can barely survive her three shifts a week as it is. I feel like I have absolutely no marketable skills due to useless degree that I have no experience using after 10 years and my industry being unlikely to recover until the end of next year at the soonest.\n\nMy one strength is that I learn very quickly, but besides that I have no real skills to offer. I am to the point where I am considering doing what I should have done out of high school and going to school for engineering like my old man, but the thought of going back to school with recently diagnosed ADD, into a field I was awful at in high school (I suck at math beyond explanation), after the experience of being sold a false bill of goods by my first college, AND not being able to make an income for several years makes me ill to even think about. \n\nI am painfully awkward around the general public and have too many ethics to get into sales. I am very technically minded and have a knack for the trades, but after several injuries in my 20s I fear I don't have the body for it anymore. My area has fatal accidents daily, so I am not looking to do much commuting. PLUS I have a $70k/yr salary worth of expenses, an almost 3yo daughter, a house so small my wife and I are constantly at each other's throats, and as I said, no reasonable path out of my situation that I can see. My unemployment runs out literally this week and then my ass is flapping in the breeze.\n\nTLDR- for all intents and purposes, no degree. Only solid skills are in a career that the current economy has decimated, and an income level I see no way of replacing. \n\nLocated in Lehigh Valley PA if that helps anyone. Thanks for whatever advice you can give.",
    "title": "Lost my one chance at a good career and am now totally adrift. ¿Wat do?",
    "subreddit": "careerguidance",
    "timestamp": 1684805000,
    "score": 3,
    "keyword": "man nurse"
  },
  {
    "text": "I'm lots at choosing my career what should I do? Thanks in advance to those who read So as the title says I (am 21) male and have been struggling to find the right career for me and don't know what to do, a little background when I was in high school I wanted to go to med school but people told me that I wouldn't be able to make it and I panicked and picked engineering since I was good with maths and as silly as it is I was doing great but felt miserable cause I didn't want to be there so after 2y I changed career tried music as a full career but got cold feet and quit then I decided to choose something related to my original dream of med school I got on a pre-med school course and I loved it. but here's when things got sour you see I wanted to get my degree as quickly as possible because I come from a household of poor income and med school wasn't and option for that since getting the degree in my country takes 6 y plus 2 years of residency so I decided to go to radiology but ended up getting scared of the x rays and it's side effects on the body so the college put xme on nursery school at the beginning I thought i could do it since it was also health related but I realize the hard way that nursing and med school are to different things completely I've also learned that I have a big ego I want to have a job were not only I will be important but were I can have financial security and more specifically we're I can make a good amount of money, which is hard to do on nursing either in my own country Venezuela or the country I want to move to Argentina apparently nurses there are heavily underpaid not only the career my teachers and classmates are straight up awfull with me I'm the only man and you would think is a plus, wrong woman's are hard to deal when they are in group. Most of them are old angry women who want to get they're degrees for only personal satisfaction ( I have no issue with that) so here I am without any idea of what to do quitting or staying and manning up. for those who may ask I live with my mom and eat her food while I'm in this mess, I had a job for two years before the career change but I'm currently unemployed any advice you can give me about my career drama would be greatly appreciated also thanks to everybody who takes the time to read you are gold.",
    "title": "I'm lots at choosing my career what should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1697713277,
    "score": 1,
    "keyword": "man nurse"
  },
  {
    "text": "What is a career I am not considering that requires no further education? 43F who is autistic with ADHD, Alberta Canada. I tried to give comprehensive background but summarized most info in category TLDRs.\n\nIntro: \nI aced University but I generally suck at real life. I am lost trying to think of a job that will allow me to live without eventual burnout from masking as an autistic.  I need something that gives me flexibility for my waxing and waning energy and requires very little hustling in person or on the phone. Email is fine because communicate much more effectively in writing than verbally. I would consider related self employment ideas too.\n\nIdeal job characteristics: \nFocus on creativity,  problem solving in Science & Arts. Importance placed on ideation and planning for implementation, and then delegate to others to actually finish. Maybe project based? No cold calling or selling and prefer remote or hybrid work. Ideas which help others is very appealing.  \n\nStruggles with typical employment: TLDR: mostly Communication / Sensory\n\n- Just getting employment. I am terrible at interviews. \n- work at 200% 3 days a week and 10% the last 2 days when I am recovering. \n- Asking too many questions and wanting to know more about stuff outside of my job description. \n- Meetings leave me confused and unclear about priorities and what was brainstorming vs actionable ideas.\n- Treating everyone as my peer to have intelligent conversations and brainstorming with regardless if speaking with a 7 year old or my CEO. \n- Subjective language and unclear expectations/ directions\n- Feeling like an outsider- the loneliness of not really wanting to do outside of work social activities but also feeling hurt when everyone is closer or they stop bothering to invite you. \n- Oversharing\n- Environment: I need a quiet minimally stimulating area with few human interactions. \n- I tend to have SO MUCH STUFF because I hate not having what I need in the moment. This means I am messy in the wrong environment. \n\nWhat I enjoy: TLDR: mostly creating and finding solutions. \n\n- Thinking about the “big ideas and issues” such as  climate crisis, consciousness, cognitive development, sources and solutions for inequality, longtermism, ethics, modelling human development of cognition to facilitate research. \n- Learning!!!! I am a slow processor at times especially if requires visualization to understand the lecture but once it clicks I am on my way. \n- Visually designing something\n- Creating systems/ organizing ideas for others \n- Editing photos (but just the editing part- I know little about the actual in-person taking photos) \n- Communicating about science \n- Graphic Design in Canva / Easy (little coding) web design in drag/drop programs like wix\n- Writing\n- designing and building things BUT I never like building or creating the same major idea twice. \n- Hobbies : Video Microscopy, drawing, water colour portraits,\n- \nWhat I am good at: \nTLDR: skills: Researching, Ideation, problem-solving, areas: Psychology, Cognitive Science, Medicine , Education, visual Arts. \n\n- Researching, tracking down info- I swear my persistence means I can find anything. I am so happy and hyperfocused when working on a problem/ question. \n- Learning new skills \n- Prompt generation, I just seem to be able to keep shaping a prompt until I get what I need. I do think that Prompt engineering as a career will soon be obsolete as technology makes the middle man no longer needed.  \n- Mentoring, I am very good at researching and offering resources and solutions. As an older student (43) I had many younger classmates come for advice which always surprises me. \n- Finding the best deals on things (I guess this fits into researching) \n- Aesthetics and styling. I have always had a good sense of what is visually pleasing. \n- Finding creative ways to educate that uses project and experiential learning to help people remember and apply their knowledge\n- Writing: I love to write both academically and to write personal but informative papers to help break down the gate keeping of knowledge. We all deserve the opportunity to have complex ideas broken down into meaningful communication. \n- Providing strategies for interacting with ND kiddos\n- Weird and  not a job possibility but medical/ psych diagnosing. Don’t worry I do not go around giving people diagnoses I just have the background and I see patterns in symptoms . I don’t always have the greatest memory but I remember everything medical. 🤷‍♀️\n- Developing Teaching materials and lessons. (I wish I could just do this and not do the teaching 😉) \n\n\nEducation:\nTLDR: certificate: family engagement in medical research diplomas: Nursing, audio engineering Degrees: BSc, BEd\n\n\n-Audio Engineering post-production diploma (obsolete now, but the foundations like layering and signal flow  have helped me a lot with editing music, video, photos, and graphic design) \n\n-Practical Nursing Diploma (license now lapsed) taught me how much I love science and medicine. Worked as a pediatric nurse but hated that curiosity and thirst for knowledge  was frowned upon (aka: “why does the rationale for the order matter? Just do it.”)\n\n- BSc Life Science with a focus on Physiology, Pharmacology, Biology, Neuroscience. This was supposed to be my pre-med once I realized I wanted to be a pathologist not nurse but my family responsibilities made it obvious towards the end that med school + residency was not a possibility \n\nBEd focus Science. My BSc was useless as I had planned it as a stepping stone to med school. My Uni offered a 2 year after degree bachelor of Education program. I thought I could work as a science teacher but despite graduating with a 4.0 I realized the level of masking required to teach K-12 would break me down in less than a year. Love teaching small groups and adults. Also was hired as a research assistant and received funding to do my own educational research which I LOVE. \n\nIf I could I would love to be in grad school doing research into developing a methodology to analyze and model curriculum to develop longtermism thinking in k-12 school but that is not a possibility because I cannot get an application together, my husband isn’t keen after 6 years studying to have 5+ more for my doctorate and I need to make some kind of financial contribution to our family.",
    "title": "What is a career I am not considering that requires no further education?",
    "subreddit": "careerguidance",
    "timestamp": 1702220197,
    "score": 1,
    "keyword": "man nurse"
  },
  {
    "text": "MEDICAL NEGLECT but what can I do? ELDER NEGLECT IGNORED BY DON\n\nNursing home neglect by CNA. The CNA is the DON'S family member. EVERY nurse (LPN, RN) and all the CNA's, as well as multiple residents have reported the obvious neglect being done to these elders by this CNA.  He (CNA) doesn't change anyone, often times comes up missing or is caught sleeping or on Snapchat with a woman. Refuses to help other CNA'S. Refuses to ask for help. Lies about the residents, is rough with the residents to the point of making one 100yr old woman scream out in pain. When I tell him to do something, he doesn't do it. Refuses to do rounds and speaks hateful to my residents. I have found my residents soaked out and even with dried BM on them every time this CNA works. This CNA has been written up and we have directly spoken with our DON about our concerns. The other CNAs are having to pull double duty to go backtrack and change this mans residents as often as they can...they are overworked at 28:1 ratio most being total cares and X2 and X3 assists. I try to stay on him, but our DON told us that we need to be \"nice\" to him (if we correct his behavior nicely or tell him to do something the CNA says we are bullying him based on his dwarfism) we're also told to \"let him work as fast or slow as he feels necessary\"...which, AGAIN is doing nothing. Sometimes he will watch my other CNA'S do his job for him. He refuses to provide care. Everyone has complained but somehow the DON says she hasn't heard any complaints. I've seen emails from my coworkers where they have had conversations with the DON. I've seen the write ups. Our DON is throwing them in the shred box. I'm afraid to call adult protective services or go above his head as I know I'll be retaliated against and likely lose my job. In fact, everyone feels the same way and someone has already lost their job just after going above his head to try and speak with administration. We can't keep CNA'S as our CNA turn over rate is high because they're not fairly compensated for the work they have to do. I wouldn't do what they do for their pay rate as fast food workers get paid more than they do. How can we resolve this issue without our DON finding out it was us? Do we also need to report the DON for failure to correct this man and failure to file the neglect write ups?",
    "title": "MEDICAL NEGLECT but what can I do?",
    "subreddit": "careerguidance",
    "timestamp": 1693902704,
    "score": 0,
    "keyword": "man nurse"
  },
  {
    "text": "Just casually thinking about the time my doctors almost let my appendix rupture during my pregnancy. Black women get the worse care. Hmm.  Going down memory lane today.  Very traumatizing experience. I have endometriosis and the doctors knew. For months while I was pregnant I was having this random, severe right flank pains.  It was horrible. I would be absolutely disabled and unable to breathe. To the ER I would go and they would run the same tests over and over again then pump me full of morphine and send me home. At some point I was afraid to go back to the dr because I felt like they assumed I was drug seeking.  It finally hit a head at 9 months when the pain was so bad I was projectile vomiting. I went to the ER and told the dr about my pain. She didn't even touch me. Immediately dismissed me as having sciatica, sent me home with tylenol and left the room.  I went home and cried all night, I even popped a vicodin and it didn't touch the pain.  I called the dr line and she yelled at me over the phone. I eventually went back to L&D where they made me wait overnight in pain for a doctor even though they had doctors on the floor.  I cried all night and all but one nurse was so rude to me.  My temperature was rising, my baby was in distress and I was starting to dilate. I rolled around in pain, a nurse came in and yelled at me for moving the band, she slammed my hand down to my side when I reached up to touch my belly.   Finally in the early am the doctor comes in saying it's appendicitis and they need to do a caesarian and appendectomy. I was terrified.  Turns out I had a rare condition called decidualized endometriosis.\n\nMy baby was ok. When I finally came to, the same doctor that dismissed me tried to come in and check on me. I just stared at her and she backed out of the room.  They all downplayed what really went on. They knew they fucked up but I was too wounded to fight back. I just wanted my baby. \n\nI believe my abuse came from me being in a relationship with an older white man.  What should have been a joyous birth is marred by the abuse at the hands of the ones that are supposed to heal and nurture. Even the lactation nurses were not kind. \n\nI have an appointment next week to talk to a doctor on that performed my hysto two years later. I asked for pictures and more detailed and got none. I have so many questions and got no answers, no apologies. I feel stronger and more confident now. \n\nI guess this a vent post honestly. I did eventually report the way I was treated but it was just a we'll do training type message and that was it. \n\nMoving to Kentucky was the worse mistake I could have made. Kentucky has not been kind to me since I've been here. \n\n&#x200B;",
    "title": "Just casually thinking about the time my doctors almost let my appendix rupture during my pregnancy. Black women get the worse care.",
    "subreddit": "blackladies",
    "timestamp": 1689604721,
    "score": 324,
    "keyword": "man nurse"
  },
  {
    "text": "Should I hurry up and have kids and settle down? Hi! I’m nearing my 30’s and I’ve been feeling pressure from society and social media(I’m embarrassed, but I’m honest), that I need to hurry up and find a man and have kids with him.\n\nHowever, idk about anyone else but it’s not that easy to find a decent man, especially one that I would want to bear children for. And also, I’m not against having children, but I don’t want to because I felt like I was forced.\n\nAlso, I have a friend who is married with a child and she’s been kinda annoyingly pressuring me to find a man and have kids because that’s a woman’s true purpose in life, but she doesn’t seem or sound happy in her situation.\n\nAnd, I’ve heard stories from nursing home nurses who say that the elderly women who were childless were incredibly miserable and they had an intense look of loneliness in their eyes.\n\nFinally,here is my question: is it necessary for a woman to have kids or is it possible to live a happy child free life?\n\nAlso: if you’ve worked in a nursing home or been around older women could share some stories or advice from them?",
    "title": "Should I hurry up and have kids and settle down?",
    "subreddit": "blackladies",
    "timestamp": 1677403666,
    "score": 6,
    "keyword": "man nurse"
  },
  {
    "text": "UK: Male nurse told to 'man up' by his female boss in front of a room full of women wins sex discrimination case",
    "title": "UK: Male nurse told to 'man up' by his female boss in front of a room full of women wins sex discrimination case",
    "subreddit": "MensRights",
    "timestamp": 1692803924,
    "score": 1502,
    "keyword": "man nurse"
  },
  {
    "text": "The 'gender pay gap' is a myth. It should be called the 'gender earnings gap'. The so-called ‘gender pay gap’ is one of the central tenets of feminist doctrine. Of course, in one sense, it is a fact. Estimates vary, but on average, women will earn about 75-85% of what men earn over their lifetimes. We might more accurately refer to this as a gender earnings gap than a gender pay gap, but whatever you call it, I won’t argue. It seems pretty clear to me, and I don’t doubt the statistics. The question is whether or not it matters. If one can reasonably extrapolate from those figures that women earn less than men purely because of workplace discrimination, then that’s an issue. But the correlation between gender and lifetime earnings is nowhere near as simple a picture as feminists make out.\n\nThe idea most frequently conflated with the gender earnings gap is that of unequal pay. The notion that women are paid less than men for doing the same work is often—implicitly or explicitly—touted as the reason women earn less. But paying one gender less than the other for the same job is illegal, and it has been for over fifty years. Indeed, if it were possible to pay women less than men for the same work, one would expect businesses to reduce their labour costs by employing more women. But that’s the opposite of what happens. \n\nOn average, even the women who work 'full time' work far fewer hours than men, and this is just one of the many reasons they may earn less over a lifetime. They also choose different careers from men, are less likely to do dangerous jobs or relocate for a higher salary, and tend to prioritise other things, like children and family. None of this has anything to do with the relative amounts men and women might be paid for doing the same work. The difference between equal pay and the gender pay gap is important and seems straightforward enough, but the deliberate conflation of the two concepts is ongoing, and many feminists are desperate to keep it alive.\n\nTake the Fawcett Society’s ‘Equal Pay Day’. This is described as “a national campaign led by Fawcett Society in the UK. It marks the day where women effectively on average, stop earning relative to men because of the gender pay gap.” In the US, the Whitehouse itself is in on the act, which it does to highlight “how far into a new year a woman must work, on average, to earn what a man did in the previous year.” In 2023, it was March 14th. The justification for this is that “women working full-time, year-round are paid an average 84 cents for every dollar paid to men.” \n\nThe implication is that throughout the workforce, and with consistent and predictable regularity, employers are breaking the law by paying women 84% of what they pay men for the same work. But is that really what’s happening? How could such a flagrant disregard for employment legislation be taking place on such an enormous scale, and all through the relatively quantifiable, traceable conduits of taxable salary payments? The answer is that it’s not. Women are not being paid 84% of what men get paid for the same work. They can’t be, because they’re not doing the same work. \n\nAmongst the top female-dominated jobs in the US and the UK are nursing, childcare, and secretarial work; amongst the top male-dominated jobs are construction, plumbing, and vehicle maintenance. In the US, the annual mean wage for all occupations is $58,260. Out of the top ten female-dominated professions, all but three pay an annual mean wage which is lower than that, and the annual mean wage for the top ten female-dominated professions combined ($50,581) is almost ten thousand dollars lower than the national mean. On the other hand, five of the top ten male-dominated fields pay higher than the overall mean, and the average for the top ten male-dominated jobs comes in at $59,643, or in other words, $1,383 higher than the overall average.\n\nThe average annual pay in the UK is £31,285. Again, only three of the top ten female-dominated professions pay more than that, compared to five of the top ten male-dominated professions. The top ten female-dominated professions in the UK pay an average of £26,925 for 35 hours of work; the top ten male-dominated professions pay an average of £30,451 for 48 hours of work. The Fawcett Society takes care not to highlight facts like this on Equal Pay Day, but it’s worth noting that in the UK, not only are men working longer hours, they are actually getting paid a *lower* average hourly rate than their female counterparts.\n\nSo what does all that tell us? Men and women pick their careers with some predictability along gender lines. Men work longer hours and get paid more overall, although their hourly rates aren’t always better. They also do some of the more dirty, dangerous jobs that women don’t like. Similarly, women tend to do things men don’t like. These jobs often require fewer working hours and offer more flexibility. That’s hardly a fashionable thing to say, and I am by no means advocating for adherence to traditional gender roles, but the statistics reflect a freely exercised choice, and remain true whether you like them or not. \n\nThis element of choice is crucial when discussing the gender earnings gap with any nuance. Another key element is age. When you bring age into the equation, you realise how much of a blunt instrument those much-touted ‘gender pay gap’ statistics are. Longitudinal studies tracking the trajectories of professional men’s and women’s careers over time have shown a negligible earnings gap for the first ten years after university. Around ten years in—which coincides with the time most graduates start having families—a divergence between average male and female earnings starts to set in. Feminists waste no time in concluding that this is due to sexism. But could it be that women at that stage in their careers just have different priorities in life?\n\nIn a recent Yale study of management-track employees from a large retail chain, researchers lamented the failure of higher-ups to promote female employees. In their abstract, the study's authors rush to conclude that this is due to hiring managers' inability to recognise women's leadership potential. Yet the researchers also found that female employees were less likely to accept promotions when they were offered, citing longer hours, less flexible working patterns, and potential relocation as barriers to acceptance. Indeed, when isolating promotions requiring relocation, the ‘gender promotion gap’ was significantly more pronounced. The researchers’ data also showed that men were more likely to leave the firm to look for promotion elsewhere if they were passed over internally. In other words, more men than women were prepared to secure a higher salary by committing to work longer hours, enjoy less flexibility, and undergo the upheaval of leaving the company or moving home. \n\nIt may reasonably be deduced that not only do women tend to choose different careers from men, but they may also exercise greater freedom of choice when navigating those careers. Should work and family issue competing claims for their attention, they at least have the option of picking between the two. The element of female choice is often missing from the gender earnings gap debate, presumably because it might make the gap look like a good thing for women.\n\nAnother frequently absent point of discussion is the financial pressure upon men starting a family. Whilst it is perfectly obvious why a new mother might want to work less, it is equally logical, although less commonly talked about, that a new father might feel he needs to work *more*. The financial anxiety that comes with children can be terrifying for men, not least in a society where high-earning careers are touted as a birth right attendant upon ‘male privilege’. However, when men do pursue advancements in seniority and salary, their actions are often attributed to an ugly desire for power and domination. \n\nYet the average man is not an individual economic entity; he exists as part of a household structure which commonly includes a woman, and she benefits as much as he does from any advancements in his career. This particular elephant in the room is often ignored, but cohabiting heterosexual couples are the norm, particularly amongst those who have children. As such, the amount of money a woman earns and the amount she can access are not the same. The average married woman is hardly likely to oppose her husband seeking a pay rise so he can provide for their children. In doing so, rather than embodying the stereotypically selfish, domineering corporate pig, he may be seeking greater financial reward out of a sense of responsibility, duty, and love. And it so happens that the time this becomes most pressing for him is the time that many women are pulling back from their careers. It will be an unpalatably congenial thing for a feminist to admit, but when viewed this way, the divergence in male and female earnings after a decade of work seems to be less about female subjugation than it is about female choice, male sacrifice, and familial cooperation.",
    "title": "The 'gender pay gap' is a myth. It should be called the 'gender earnings gap'.",
    "subreddit": "MensRights",
    "timestamp": 1682969563,
    "score": 496,
    "keyword": "man nurse"
  },
  {
    "text": "Male nurse who was bullied and told to 'man up' by his female boss wins sex discrimination case This man is a true MRA.\n\nSuicide is the biggest killer of men under the age of 45, the last thing that men and boys need to hear is ''man up'', especially coming from females who have no idea what it's like to be a man.\n\nI've noticed a trend of men, especially within the MRM, telling other men that there's no point in complaining about female colleagues because ''HR will side with them and nothing will be done''.\n\nI've worked for five large companies in the UK and I've seen women being sacked or disciplined for being disgusting, but people actually raised complaints against them or threatened the HR departments with legal action. How about start doing that instead of going ''bRoOO wHAt iF tHE gEnDErS wERe reVErSed bROo''?\n\nSeriously, if you experience discrimination or harassment from female bosses/colleagues, please do something about it. This is how we make progress.\n\n&#x200B;\n\n[https://www.dailymail.co.uk/news/article-12437145/Male-nurse-told-man-female-boss-room-women-wins-sex-discrimination-case.html](https://www.dailymail.co.uk/news/article-12437145/Male-nurse-told-man-female-boss-room-women-wins-sex-discrimination-case.html)\n\n&#x200B;\n\n&#x200B;",
    "title": "Male nurse who was bullied and told to 'man up' by his female boss wins sex discrimination case",
    "subreddit": "MensRights",
    "timestamp": 1695380529,
    "score": 338,
    "keyword": "man nurse"
  },
  {
    "text": "When one man does wrong it’s all men, when one woman does wrong… Frustration mainly here without needing any explanation or any real response. Living in the UK as a man and a father of a son after the Sarah Everard murder was awful. It was suddenly my fault that a “trusted” person would use his position of power to murder a vulnerable person. “#allmen” was trending on social media. Now we have a female nurse just found guilty of murdering not one, not two but 7 defenceless newborns, is #allwomen trending yet??? Of course it isn’t. There’s no media outcry for mothers and fathers to teach their daughters to respect children or babies. The incessant need to blame all men for the actions of one is never felt for blaming all women for the actions of one.",
    "title": "When one man does wrong it’s all men, when one woman does wrong…",
    "subreddit": "MensRights",
    "timestamp": 1692367782,
    "score": 311,
    "keyword": "man nurse"
  },
  {
    "text": "Debunking the \"Gender Pay Gap\" Copied from the [original post here](https://www.reddit.com/r/TraditionalMuslims/comments/14p3dwq/debunking_the_gender_pay_gap/).\n\nSo I didn't think I needed to debunk this as it's been done a million times before. However, it's come to my attention that apparently some still believe it. So, just to have an easy-to-reference, codified treatise on the issue, I'm writing this piece to utterly decimate this commonly propagated liberal trope.\n\nMainstream media presents [articles like this](https://www.businessinsider.com/gender-wage-pay-gap-charts-2017-3) that claim there is a pay gap between men and women, and that it's on the sole basis of gender. While it is true that men tend to earn more money than women, it is absolutely false that it's due to gender bias in favor of men (if anything, it's actually in favor of women). The problem with the statistics shown is that they only take into account median yearly salaries without accounting for any other confounding variables that may be skewing the data. For example, if I told you that the more people drown the more often ice cream is sold, would you take that to mean that ice cream causes people to drown? No, you'd probably say that it's because of ice cream sales increasing in the summer when it's hot, which is simultaneously when people go swimming more, thereby increasing the likelihood of drownings to happen; this shared commonality (i.e. the heat) is a confounding variable.\n\nFor the so-called \"gender pay gap\", here are the confounding variables:\n\n1. This statistic does not account for what types of jobs are being worked, as **men choose higher-paying jobs**.\n   * [*Source 1.*](https://pubsonline.informs.org/doi/10.1287/orsc.1120.0757) *Demonstrates how women choose different jobs than men because they value and/or prioritize different things than men (e.g. better work-life balance). Because of this, the jobs they prefer tend to be lower-paying.*\n   * [*Source 2.*](https://academic.oup.com/oep/article-abstract/57/3/479/2361925?redirectedFrom=fulltext) *Same as Source 1, but also found that \"job satisfaction of men increases with additional earnings while that of women does not\" (p. 486).*\n   * [*Source 3.*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *Landmark study; displays evidence that men choose higher-paying jobs. The more egalitarian/feminist a country is, the fewer women choose careers in science, technology, engineering, and mathematics (i.e. traditionally male-dominated roles). Giving greater career choice to women increases (apparent) gender disparities within the workforce.*\n   * [*Source 4.*](https://www.jstor.org/stable/2525981) *Cited over 11,600 times. Demonstrated very directly that women choose jobs that are lower-paying, and that women are NOT being paid less to do equal work; and this was in 1973, almost 50 years ago. Please note that any discrimination found thereafter is really just residual unaccounted variability rather than actual discrimination per se, as detailed in the conclusion.*\n   * [*Source 5.*](https://journals.sagepub.com/doi/abs/10.1177/0891243210361475) *So ignoring the ideological bullshit that's indirectly being pushed, it demonstrates clearly that women choose different jobs than men and that it is solely due to their own choice; and that the only time women don't choose traditionally female jobs over male jobs is when they're essentially forced to take the male job.*\n      * *Interestingly enough, this supports the findings of* [*this study here*](https://journals.sagepub.com/doi/abs/10.1177/0956797617741719) *(which was a MASSIVE, catastrophic blow to the \"men and women are equal but female oppression and gender discrimination are the only reason why we aren't\" narrative); the researchers found that the more egalitarian/feministic a society is, the greater the gender differences will be (regarding what people will choose to pursue). In other words, when you give women free choice to pursue whatever they want, they will willfully choose occupations/education/life goals that will only increase the gender gap between men and women.*\n2. The statistic does not account for **different positions within a respective field** (e.g. head/lead developer vs senior developer vs junior developer; they're all developers, but different rankings/positions). We know this because it's not possible to know the relative rankings/positions of people's careers if they don't even know what those careers are in the first place.\n   * [*Source 6.*](https://www.jstor.org/stable/1808858) *Looked at a company from the years 1966 and 1969-1971; found no gender discrimination when accounting for all variables. States that at most, there may be gender discrimination with regards to promotion, but even this is speculative as it is not explained why this may be the case (and truth be told, we already know why this is; I will explain later on). If the concept of a gender wage gap was already being debunked/disproved back then, it definitely doesn't exist now (at least, not in favor of men anyway...).*\n   * [*Source 7.*](https://www.jstor.org/stable/30038574) *Studies a company that was sued for ACTUALLY discriminating against women with regards to promotion, and found that there wasn't any pay differences between men and women who were given the same job/assignment. In other words, even when discriminating against women, they were still being fair about the pay.*\n3. The statistic does not account for **age** (e.g. a young person may make more money than an older person in a physically-taxing field, older people in fields that would require more knowledge/wisdom to handle, etc.).\n   * [*Source 8.*](https://www.nber.org/papers/w26623) *Generally speaking, workers over age 40 are only about half as likely to get a job offer as younger workers if employers know their age*\n4. The statistic does not account for **job tenure** (i.e. how long someone has been working for their respective employer for).\n   * [*Source 9.*](https://journals.sagepub.com/doi/abs/10.1177/0003122413514584) *Shows men in general have greater job tenure than women. It's decreasing overall (particularly for men) but there are various reasons for it, many of which are oftentimes advantageous from a career/monetary standpoint, which men are going to be more receptive towards since men typically prioritize money more than other aspects of a career (see Source 1).*\n   * [*Source 10.*](https://www.jstor.org/stable/1831432) *It's in the title; job tenure typically entails higher wages. In recent times, this has been changing within certain fields (hence why it's been decreasing as shown in Source 8 above), but the point still stands overall.*\n5. **Men work more than women**, which implicates in the previous 2 points with men being able to develop greater job tenure and work experience. More men work full-time than women. Moreover, the term 'full-time\" means anyone working 35 hours or more (with some lowering it to 30 hours or more to further skew the stats in favor of their social agenda); this could mean anywhere from 35 hours to 135 hours per week, and I can tell you right now that the vast majority of people who are working an exorbitantly high number of hours are men, NOT women.\n   * [*Source 11.*](https://www.bls.gov/opub/ted/2015/time-spent-working-by-full-and-part-time-status-gender-and-location-in-2014.htm) *Statistics from the US government. Men simply work more than women, even when comparing men who work full-time to women who work full-time, and men who work part-time to women who work part-time.*\n   * [*Source 12.*](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) *More statistics from the US government for 2019.*\n      * *\"Among full-time workers, those usually working at a job 35 hours or more per week, men are more likely than women to work more than 40 hours per week. In 2019, 25 percent of men who usually work full time worked 41 or more hours per week, compared with 14 percent of women. Women were more likely than men to work 35 to 39 hours per week: 10 percent of women worked such hours in 2019, while 4 percent of men did\" (p. 8).*\n      * *Women were more likely to be working a part-time job than men.*\n      * *\"Women who worked part time made up 23 percent of all female wage and salary workers in 2019. In comparison, 11 percent of men in wage and salary jobs worked part time.\"*\n   * [*Source 13.*](https://www.bls.gov/opub/reports/womens-earnings/2020/pdf/home.pdf) *Even more statistics from the US government for 2020.*\n      * *19.6% of men working full-time worked 41 or more hours per week, compared to only 10.2% of women who were working full-time. This means that men working full-time were nearly twice as likely as women to work 41 hours per work or more (Table 5). This coincides with* [data discussed at the 2019 G20 Summit](https://www.ilo.org/wcmsp5/groups/public/---dgreports/---cabinet/documents/publication/wcms_713376.pdf)*.*\n      * *Men working full-time were also 2.3 times more likely than women to work 60+ hour weeks: 4.3% of men worked 60 hours per week or more compared to only 1.9% of women.*\n      * *Women working full-time were more than twice as likely as men to work shorter workweeks of 35 to 39 hours per week: 7.7% of full-time women worked those hours, compared to only 3.6% of men who did so.*\n      * *Men working 35-39 hours per week earned only 92.4% of what women earned working those same hours ($600 median weekly earnings for men vs. $649 for women). This means there was a 7.6% gender earnings gap in favor of female workers (for that cohort), and this is BEFORE accounting for any confounding variables!!!*\n      * *Women were more likely to be working a part-time job than men.*\n      * *Although not reported by the BLS, it can be estimated using its data that the average workweek for full-time workers (in 2020) was 41.3 hours for women and 42.8 hours for men, meaning the average man employed full-time worked 1.5 more hours per week compared to the average woman. This adds up to men, on average, having worked an additional 78 hours per year compared to the average full-time female worker.*\n      * *Some of the raw earnings gap naturally disappears by simply controlling for some of the variables. For example, women technically earned 82.3% of median male earnings for all workers working 35+ hours per week (i.e. full-time). But for those workers with a 40-hour workweek (more than three-quarters of all full-time female workers), women earned 87.4% of median male earnings, and that's after accounting for just one variable: hours worked.*\n      * *For young, full-time workers aged 16-24, women earned 94.7% of the median earnings of their male counterparts. Once again, controlling for just a single important variable—age—we find that more than two-thirds of the \"gender pay gap\" disappears. There are tons of other factors like these that go unaccounted for when you hear people/the media talk about the gender pay gap. Keep this in mind from now on.*\n   * [*Source 14.*](https://www.bls.gov/opub/mlr/2008/02/art5full.pdf) *Conducted by the US government. Looks at 12 European nations and shows that men work more than women in all of the countries studied, among many other things.*\n   * [*Source 15.*](https://www.bls.gov/news.release/atus.t04.htm) *Government statistics for 2021. Men clearly work more than women.*\n   * [*Source 16.*](https://journals.sagepub.com/doi/abs/10.1177/00197939211045376) *Some people may not think that men work more than women enough to help warrant the pay gap, but this paper explains otherwise (they basically accounted for the jobs being worked and how men and women vary in the number of hours worked within these specific jobs rather than ignoring the types of jobs worked).*\n6. Building off the previous point, **men work more overtime**, and the gender pay gap statistic does not account for overtime pay. And if men are working more hours than women, that means that men are going to make more money from overtime which is higher than your standard base rate.\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *This is one of my favorite studies ever. It's just so well-done and is, in my opinion, the epitome of what research is supposed to look like. It was conducted by Harvard University, and one of the authors is literally a woman (meaning there isn't any bias caused by sexism or misogyny on behalf of the authors). It demonstrates a multitude of things, but as it relates to this specific point, it shows clearly that men work more overtime than women (p. 2–3; Figure A.16, p. 85).*\n7. **Men are more likely to accept overtime, and especially when presented without prior notice** (e.g. if someone had an emergency and couldn't come in, and employees are asked if they can stay, men are more likely to accept it). This means men tend to be more reliable workers overall. It's technically a separate point from the one above because the frequency of accepting overtime is different from actually working it (e.g. someone could work a lot of overtime one week and not work it at all for the next 12 weeks, vs someone who works only a few hours of overtime every week).\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Also shows how men are more likely to accept overtime when it's presented to them and that men in general are especially more likely to accept overtime without prior notice (p. 3; Figure 6, p. 49; Figure A.17, p. 86).*\n8. **Men are less likely to have unexcused absences.**\n   * [*Source 17.*](https://scholar.harvard.edu/files/bolotnyy/files/be_gendergap.pdf) *Women have more unexcused leave of absences than men (Figure 22, p. 65). This further implicates men as being more reliable workers. What's ironic is that men face harsher penalties/disciplinary measures than women (Figure 21, p. 64), contrary to popular belief.*\n9. The statistic does not account for **work experience** (i.e. how long someone has been working in their respective field).\n   * [*Source 18.*](https://www.jstor.org/stable/2535309) *In general, men have greater work experience than women (courtesy of working more than women); the timing of work experience and overall work matters a lot as well, and since men are simply working more than women, the advantages of this timing will be more apparent in men than women. This study has data directly showing that men have greater actual work experience, potential work experience, and job tenure than women (the last of which relates back to the previous numbered point).*\n10. **Men do not get pregnant and are less likely to leave work for kids** (e.g. paternity leave); pregnancy forces women to stop working, which relates back to points 4, 5, 8, and 9, and men being less likely to leave work for kids also shows more dedication to work.\n      * [*Source 19.*](https://onlinelibrary.wiley.com/doi/full/10.1111/gwao.12506) *The abstract alone states \"mothers with young children have reduced their work hours four to five times more than fathers\". Some of you may say that this therefore nullifies Source 12 as supporting evidence for point 5, but it actually strengthens it because it exemplifies the gender differences that can cause a skew in the gender wage gap myth and highlights the behavioral dimorphism between the sexes. At most, it would only nullify SOME of its generalizability on a year-to-year basis, but even then, it still showcases how statistics can be skewed/misrepresented to provide a false narrative about gender discrimination that doesn't actually exist with regards to pay. Anyway, Source 13 also states similar as well due to the Family Medical Leave Act (FMLA) where women are far more likely to leave work/not come in, but I don't want to be redundant and keep using the same source even though it's a fantastic study.*\n11. **Men are less likely to take sick days.**\n      * [*Source 20.*](https://academic.oup.com/occmed/article/68/5/320/4973626) *Women take more sick leave than men, even after accounting for many variables.*\n      * [*Source 21.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6070205/) *The introduction alone is enough to show that women take more sick leave than men, this is undisputed and has been for decades. This study sought to determine whether there were differences in attitudes towards sick leave based on gender, and whether this contributes to women's absenteeism. They did not find much support for this, indicating that women take more sick leave regardless of societal norms and expectations.*\n      * [*Source 22.*](https://journals.lww.com/joem/Abstract/2015/08000/High_Job_Demands,_Job_Strain,_and_Iso_Strain_Are.5.aspx) *Women take more sick leave due to mental health reasons than men (p. 860), with 90% of \"mental health\" reasons being either stress, mood, and/or anxiety-related.*\n12. **Men are less likely to take vacation days.**\n      * [*Source 23.*](https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.1019.5400&rep=rep1&type=pdf) *Great study that shows how women take more vacation days than men, while also discussing why it is the case. Has several other findings/key points that showcase male-female dimorphism as it relates to work and the family, and they are very interesting; they essentially prove what is already self-evident with regards to gender roles, despite what mainstream society is trying to push today.*\n13. **Men are more likely to move for a job.**\n      * [*Source 24.*](https://www.demographic-research.org/volumes/vol40/53/40-53.pdf) *Shows conclusively that men are more willing to move for a job. They try to say that single women are just as likely as single men to move for a job after accounting for confounding variables, but that's nonsense because one of the variables was essentially how well they like the job (i.e. \"job characteristics\"), when the location of a job doesn't have an impact on how much the job itself should or should not be liked (and if any of you researchers disagree, you will need to account for the Halo Effect to fully make sure that distance isn't what's making them view those same \"job characteristics\" as distasteful enough for them to not want to move). It's as if they're trying to say that jobs should cater to women by changing how they operate so women will like them better, rather than simply just acknowledge that women do not want to move for work as much as men. In fact, it's not even as if they're saying that, they literally suggest it lmao! It's very gynocentric when you look at it. The reason why they say this is because they do not want to admit that the gender gap is literally caused by women's own personal preferences, because then that would mean that the gender gap is normal, natural, and that women willfully make the choices that cause the gender gap, essentially nullifying any narrative that women are victims of oppression and that the gender differences that exist between men and women are caused by men and women ACTUALLY being different. This last point really irks the ideologues. In addition, it would place accountability over the gender gap on women, and women absolutely cannot handle having accountability.*\n      * [*Source 25.*](https://www.glassdoor.com/research/app/uploads/sites/2/2018/05/GD_ResearchReport_MetroMovers_Draft4-1.pdf) *Literally the same thing as the previous source (including all of the progressive diatribes that I dismantled) but with a massive online job search website.*\n      * [*Source 26.*](https://web.stanford.edu/~niederle/CEN_discrimination.pdf) *This one has some progressivism within it as well, but ignoring that, we find that any discrimination against women isn't due to them on the sole basis of them being women, but rather because of beliefs over how well they would do the job. In fact, it shows that people are MORE likely to favor women as job candidates when a negative belief is ascribed to a woman rather than when it is ascribed without the gender being stated. In other words, gender discrimination isn't gender discrimination at all but rather performance discrimination, which is the definition of a meritocracy (i.e. a system in which people are judged based on their merit/how good they are at their job, rather than characteristics unrelated to said job/merit).*\n14. **Men are more likely to work night shifts.**\n      * [*Source 26.*](https://www.bls.gov/opub/mlr/2021/article/nonstandard-work-schedules-in-29-european-countries-2005-15-differences-by-education-gender-and-parental-status.htm) *Government study looking at data across 29 European nations from 2005-2015. It shows that in every region, save for Scandinavia, men are more likely than women to work hours outside the standard 9-5. This coincides with data from Source 14 and Source 17, which showed similar findings.*\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Shows definitively that men are more likely to work night shifts than women.*\n15. **Men are more likely to work weekends.**\n      * [*Source 27.*](https://ojs.aaai.org//index.php/ICWSM/article/view/3216/3084) *Also shows that men are more likely to work weekends than women.*\n      * [*Source 28.*](https://www.bls.gov/opub/mlr/2011/07/art1full.pdf) *While also showing that men are more likely to work nonstandard work shifts, it also shows that men are more likely to work weekends as well, which Source 11, Source 14, Source 15, and Source 17 also demonstrated.*\n16. **Men are more likely to work holidays.**\n      * *Yet again, this was already shown by Source 11, Source 14, and Source 15.*\n17. **Men are far more likely to work dangerous jobs** such as oil riggers, underwater welders, etc. These male-dominated jobs pay higher than nurses and hair stylists on the basis of danger, hence why it's separate from the first point.\n      * [*Source 29.*](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4880472/) *Men are more likely to work dangerous jobs and are simply more willing to accept risks that jobs may have in general. This is represented by the fact that men make up most workplace deaths.*\n         * [*Source 30.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2004_chart11.pdf) *US government data for 2004; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 31.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi2006_14.pdf) *US government data for 2006; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 32.*](https://www.bls.gov/iif/oshwc/osh/os/oshs2008_33.pdf) *US government data for 2008; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 33.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0009.pdf) *US government data for 2010; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 34.*](https://www.bls.gov/iif/oshwc/cfoi/cfch0011.pdf) *US government data for 2012; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 35.*](https://www.bls.gov/iif/oshwc/cfoi/cftb0292.pdf) *US government data from 2014; shows that men make up the overwhelming majority (92%) of workplace deaths.*\n         * [*Source 36.*](https://www.bls.gov/iif/oshwc/cfoi/cfoi-chart-data-2017.htm) *US government data from 2017; shows that men make up the overwhelming majority (93%) of workplace deaths.*\n         * [*Source 37.*](https://www.bls.gov/news.release/pdf/cfoi.pdf) *US government data from 2016-2020; shows that men make up the overwhelming majority (93%, 93%, 92%, 92%, 92% for each consecutive year, respectively) of workplace deaths.*\n         * [*Source 38.*](https://www.ualberta.ca/anesthesiology-pain-medicine/media-library/eliassons-wellness-docs/mens-mental-health/a-roadmap-to-mens-health.pdf) *97% of workplace deaths in Canada between 1993 and 2005 were men.*\n         * [*Source 39.*](https://www.safeworkaustralia.gov.au/sites/default/files/2020-11/Work-related%20traumatic%20injury%20fatalities%20Australia%202019.pdf) *97% of workplace deaths in Australia were men in 2019, with similar trends from 2003-2018 as well. These are the things feminists will never, ever talk about.*\n18. **Men are more interested in jobs that are scalable**; men are more interested in physical things, while women are more interested in jobs that deal with people. The former is scalable, the latter is not; that means Elon Musk is able to service millions of people with Tesla whereas Mrs. Johnson is only able to teach a class of 30 students per year. This point is separate from the first point because scalability relates to potential growth/earning, and based on the laws of chance, you're more likely to find some major hit successes in professions that are scalable rather than unscalable.\n      * [*Source 40.*](https://pubmed.ncbi.nlm.nih.gov/19883140/) *Meta-analysis showing men are interested in things, and that women are interested in people.*\n      * [*Source 41.*](https://www.frontiersin.org/articles/10.3389/fpsyg.2015.00189/full) *Another meta-analysis that supports the previous one above; \"patterns of gender differences in interests and the actual gender composition in STEM fields were explained by the people-orientation and things-orientation of work environments\". Basically, even in male-dominated fields, women are overrepresented in service-based and people-oriented STEM fields such as the health sciences, with the trend being found on a multinational level. This also acts as evidence for the very first point about men choosing higher-paying jobs.*\n         * [*Source 42.*](https://www.bls.gov/cps/cps_aa2018.htm) *Evidence from the US showing this trend with women.*\n         * [*Source 43.*](https://afmc.ca/sites/default/files/pdf/CMES/CMES2018-Complete_EN.pdf) *Evidence from Canada showing this trend with women.*\n         * [*Source 44.*](https://www.oecd-ilibrary.org/social-issues-migration-health/health-at-a-glance-2017/doctors-by-age-sex-and-category_health_glance-2017-53-en) *Evidence from OECD countries (38 in total, with another 10 non-OECD countries included throughout in some data).*\n19. **Men are more likely to ask for a raise.**\n      * [*Source 45.*](https://crl.acrl.org/index.php/crl/article/view/16689) *Men are more likely to ask for a raise; the only exception is when women enter managerial positions (i.e. are put in male roles, basically). It also shows that women are basically worse at negotiating than men (\"less successful\" = euphemism for being worse at).*\n      * [*Source 46.*](https://pubsonline.informs.org/doi/abs/10.1287/mnsc.2014.1994) *Women are only as likely as men to ask for a raise when they are explicitly told they can negotiate for one. I can tell you right now that most jobs rarely ever directly tell its employees that they can freely ask for a raise lol.*\n      * [*Source 47.*](https://escholarship.org/content/qt9978v172/qt9978v172.pdf?t=omys3w) *Women are less comfortable engaging in salary negotiations, they're less likely to negotiate salaries overall, and they're not as good at it as men (the researchers don't word this last point this way because it angers feminists, but that's the gist of it). There are many other reasons that they go into as well.*\n20. **Men are typically more aggressive/competitive in their mindset and attitudes regarding work** which helps them climb the corporate ladder more (e.g. you make more off commission in sales because you close more sales due to being more competitive).\n      * [*Source 48.*](https://archive.bio.org/sites/default/files/docs/toolkit/Why%20Men%20Still%20Get%20More%20Promotions%20than%20Women_HBR%20article.pdf) *Upon reading this, you find that women are essentially not as willing to do what it takes to climb the corporate ladder; the report says that therefore the entire civilizational structure should change to favor women, but that's just ridiculous. Why not just admit that women are not as willing to hyperfocus on their careers in the same way as men? Why not just admit that women don't do it because they simply don't want to sacrifice other areas of their life for a career? Why not just finally admit that women are different from men? They can't. And that's a problem for BOTH genders.*\n21. **The top people are always going to be men due to the variability hypothesis.**\n      * [*Source 49.*](https://www.journals.uchicago.edu/doi/abs/10.1086/493921) *Men vary greater than women; when seeing any of the extremes, men are more likely to be represented on both ends. That means the most successful people in the world are going to overwhelmingly be men, and the most unsuccessful dregs of society will also be men. This represents a problem with feminist thinking because they want \"equality\" when it comes to powerful, important, and successful positions in society and say that a lack thereof in these top positions are due to sexism and discrimination (and that therefore all of men and society need to just give women these positions to \"make it fair\"), but they will never talk about the men at the lowest ends of society or talk about equalizing that. I'm not saying they should become homeless criminals and whatnot either (rather they should focus on decreasing the amount of men that are disenfranchised here; but they'll never do that since they would have to admit that men aren't oppressors and would have to actually acknowledge the plights of men), I'm just saying there's a double standard here whereby women want the rights and privileges of both sexes with the responsibilities of neither, all the while blaming men for any (and all) of their own shortcomings and faults.*\n      * [*Source 50.*](https://www.sciencedirect.com/science/article/abs/pii/S0191886913003036) *Men vary more than women yet also tend to be better on average on measures of creativity.*\n      * [*Source 51.*](https://en.wikipedia.org/wiki/Variability_hypothesis#:~:text=The%20variability%20hypothesis%2C%20also%20known,most%20traits%20than%20females%20do.) *For those who still don't get it, here's a Wikipedia article since they tend to describe things fairly simply and succinctly.*\n\nJust to really drive home the point, I quote the official statement of the US Department of Labor after having a massive [study](https://www.bls.gov/opub/reports/womens-earnings/2019/pdf/home.pdf) conducted for them:\n\n>**This study leads to the unambiguous conclusion that the differences in the compensation of men and women are the result of a multitude of factors and that the raw wage gap should not be used as the basis to justify corrective action. Indeed, there may be nothing to correct. The differences in raw wages may be almost entirely the result of the individual choices being made by both male and female workers.**\n\nAnd even ignoring the technical research aspects, just think about it like this: If a woman were to do the same job as a man for less pay, only women would get hired because that would be CHEAP LABOR. And for those who don't know, there's a whole sexism argument that claims men get hired more easily than men (which also isn't necessarily true either, but that's a separate discussion).\n\nThere isn't a single statistician who isn't braindead, let alone competent, who takes the statistics presented about the gender pay gap myth at face value when drawing conclusions. It's only after you account for all the variables available can you really begin to extrapolate true causality, and even then it is still weak with these types of statistical analyses anyway since it's virtually impossible to account for every variable that exists *and* have a full consensus for data rather than a statistic that has a much smaller sample size. Plus, when it comes to statistical analyses like this, you're ultimately seeing how things relate to one another (i.e. correlated) rather than seeing how they directly influence/cause something. The only way to truly test for causality is by running actual experiments with strong controls in place (which is nigh on impossible to do in situations like these). If you take a statistics class or two, you'll learn about this stuff more in-depth. Multivariate analyses are pretty much always better than univariate ones (when drawing final conclusions from, anyway), and it's due to reasons like this where society perpetuates the gender pay gap myth as a social dogma.\n\nIf women can do anything men can do (and \"do it better\"), then why are they still supposedly \"oppressed\"? Why are they still the victims? And why do they need government legislation to mandate \"gender equality\" in order to achieve it? If they were really the same as men (i.e. \"equal\") in all these regards, wouldn't perfect equality naturally occur based on merit alone? It doesn't make sense, and it's simply because it's just not true. Men and women aren't the same, and we won't ever be the same. That doesn't mean we shouldn't be treated fairly—equity over equality, always—but this myth needs to die once and for all.\n\n﷽\n\nوَلَا تَتَمَنَّوْا۟ مَا فَضَّلَ ٱللَّهُ بِهِۦ بَعْضَكُمْ عَلَىٰ بَعْضٍ ۚ لِّلرِّجَالِ نَصِيبٌ مِّمَّا ٱكْتَسَبُوا۟ ۖ وَلِلنِّسَآءِ نَصِيبٌ مِّمَّا ٱكْتَسَبْنَ ۚ وَسْـَٔلُوا۟ ٱللَّهَ مِن فَضْلِهِۦٓ ۗ إِنَّ ٱللَّهَ كَانَ بِكُلِّ شَىْءٍ عَلِيمًا",
    "title": "Debunking the \"Gender Pay Gap\"",
    "subreddit": "MensRights",
    "timestamp": 1688347611,
    "score": 198,
    "keyword": "man nurse"
  },
  {
    "text": "Single motherhoods and its effects are exactly why traditional gender roles in marriage existed (i.e.: biology), not \"patriarchy\". Normalizing single parenting and changes in gender roles were due to advancements in medicine and plentiful human population, not feminism. **Introduction**\n\nFeminists often complain that traditional gender roles in marriage were a result of patriarchy and women having no rights, but they looked at it through a presentist point of view. Yes, single parenthood was taboo historically, but it wasn't realistic. As a woman, you had to get pregnant with several kids to populate the Earth and even make up for all the kids who died due to high infant mortality rates. We didn't have prenatal care, medicines, baby formula, child support, birth control pills, etc. Pregnancy was very dangerous and maternal mortality rates were high, and you had become pregnant constantly back then to populate Earth and compensate for all the children who died. People didn't even name kids until they were a few years old. You didn't have baby formula and unless you had someone to be a wet nurse, you had to breastfeed the babies yourself. Women couldn't be incapacitated by childbirth and take care of kids with potential infant mortality to nurture them to make sure they safe and then provide for the kids all by herself. Some tribal societies and other communities may have had women rely on non-spouses, but overall, having two parents was crucial. Men had to provide for children, and even women worked all the time back then and so did children to support the family because one parent wasn't enough given that we needed to nurture children and make sure they wouldn't die and become pregnant several times. Women weren't forbidden from working historically, and men weren't the sole breadwinners. That's just a 1950s America thing. It's a myth women didn't work to support the family with him, because everyone in the family needed to work, and single parenting was rare and difficult.\n\n**Changes in traditional gender roles and family was caused by now-sufficient human populations, medicine and technology advancements, not feminism.**\n\nInfant mortality and maternal mortality rates declined in the 20th century, which is why in the 2nd half of the decade, single parenthood became more normalized. The reason wasn't due to feminism, but because the invention of prenatal care, baby formula, medicines and more knowledge on how to handle a pregnancy safely alongside a now populated-enough Earth made it convenient to safely take care of children by oneself. Funny thing is, even now, it's still often difficult for many parents to do by themself. Most people raised by single moms fare quite well, but there is an increased risk of issues. In non-Western countries, these gender roles still exist not because they're backwards, but because they still live in these harsh environments where these inconveniences exist. Just look at Africa.\n\nIt's still an issue in the West, too. Although the evidence is mixed, [quite a lot](https://www.tandfonline.com/doi/full/10.1080/1068316X.2020.1774589?fbclid=IwAR3LdQCK5jhuU1qOCfwfgSCUfx4NxHXQKccQ3u_8RTGl68VOBg2yZJc1TRQ) [of evidence](https://www.civitas.org.uk/pdf/Experiments.pdf?fbclid=IwAR232YpHqPKT--eQwm4ngH43sq-3HMC6H9-c6tdJjjkhwUAvqEAcOS_6B3o) [shows](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3904543/?fbclid=IwAR0wk37MHF12JoiKMXTtdGWztP6u8yYLwlvomjYLXD9LRth7KlRAdznvPzQ) that being raised by a single parent can increase the risk of kids dealing with delinquency and crime or emotional and behavioral issues, even when controlling for income, family history, and many other factors. Some stats show that it has to do with socioeconomic problems, which is why single parenting isn't good if you can't make the money to provide for kids all by yourself, but some studies show even when controlling for socioeconomic factors, single parenting does increase the risk of problems. The evidence is mixed, but some evidence shows children fare worse without a father, and some studies show this isn't a causation and some research shows it is. Even having stepdads didn't improve it. I don't mind gay couples raising kids, because they are two-parents and one can use the gender roles fathers normally had for supporting kids, but single parenting, although often okay in our more convenient environment, can in many other cases, do harm. [Even in egalitarian countries](https://link.springer.com/content/pdf/10.1007/s40865-021-00183-7.pdf?pdf=button%20sticky&fbclid=IwAR2amf8juqnV-NoHB6mphZD8-NuXy79SK7e4IoIiPVt-x9WQ3rbw13NIMxo) and many European countries, (see: link https://www.europarl.europa.eu/RegData/etudes/STUD/2020/659870/IPOL_STU(2020)659870_EN.pdf) even when controlling for many factors, single motherhood increased risk of problems to children but not single fatherhood. Typically, having a close relationship with a father lowered these risks. A well-written *Slate* [article](https://slate.com/human-interest/2012/07/single-motherhood-worse-for-children.html) clarifies everything:\n\n>Single mothers, even from wealthier families, have less time. They are less likely to be able to monitor their kids. They do not have a partner who can relieve them when they are tired or frustrated or angry with their kids. This isn’t just a question of taking kids to the array of pampered extracurricular activities that many affluent, two-parent families turn to; it’s about the ways in which two sets of hands, ears, and eyes generally make parenting easier. \n\nObviously, many children raised by a single mom do just fine, but there is an increased risk of problems caused by single motherhood or growing up without a father. Obviously, gay couples who raise kids usually did really well, but they were two parents, and they played their roles that fathers could've played. Single parenthood, on the other hand, can be risky. See? Even to this very day, although single parenthood is much more achievable thanks to advances in medicine and technology to handle safer pregnancies and the need to have several children for species survival no longer being necessary, it can still potentially cause issues. In other countries, we still have the inconveniences of the past though, which is why they don't adapt to the times, not backwardness.\n\nNow, [contrary to popular belief](https://www.jstor.org/stable/pdf/44735319.pdf?refreqid=excelsior%3A199b367927cb82179fca2b1fa966b2a2&ab_segments=&origin=&initiator=&acceptTC=1&fbclid=IwAR3Izbwy3N8InfXYjQZ9fdwtwquMiS0UaozFpqLC310nsMfMe1WDK3J3bms), it wasn't just men historically who had jobs and made money. Women had jobs and shared these gender roles, making money. Even children had jobs and made money because everyone needed to support the family because people would have several kids and we needed as much resources as possible to support several kids with high infant mortality rates. The male breadwinner/female housewife concept is a 20th century Anglosphere thing. Men did marry later than women and women did rely on men's income because women had to marry and reproduce at a young age to populate the Earth when her reproductive value was at its peak, and men didn't have to begin reproductive careers young as much because they don't have the tendency to carry the baby and only carry one at a time, 9 months each. Because very young women did not have the wealth/resources to support a child all on her own, aside from working to make that wealth, she needed an older, wealthy man to help support her, too, and who had enough money to pay a sufficient dower in case he died or divorced from her and she needed enough wealth to support herself and her kids (that's why dowers existed). This is why age gaps of older men and younger women were evolutionarily beneficial. It wasn't usually a 30 year difference, but a 5 to 10 year difference. [In fact](https://www.cold-takes.com/hunter-gatherer-gender-relations-seem-bad/amp/?fbclid=IwAR2q6EuRLvxnyqEhopbTrayV9Cm2xAbGcINrs9c7gDFl-zKoeSpr2PxVvwI), mainstream researchers were incorrect when they made headlines claiming that the pre-agricultural Stone Age societies were generally egalitarian about gender. [In fact, in the Stone Age, age gaps in sexual relationships were very common, and have been common for 250,000+ years](https://www.sciencealert.com/fathers-have-been-older-than-mothers-for-250000-years-study-finds).\n\nThis is why having premarital sex wasn't good, because birth control wasn't as effective as now and so unwanted pregnancies were very high. Child support didn't exist as much either. A woman could not have a pregnancy without a husband, and thus, shotgun weddings existed for premarital pregnancies.  Otherwise, you'd have no choice to get an abortion because you couldn't bring a child into this world if you couldn't care for it enough or it'd die or suffer. Men could only have sex with escorts, and escorts were not expected to become mothers and often engaged in infanticides or sterilized themselves. Men could never have sex with any unmarried woman, contrary to what feminists say. The invention of the birth control, which is 99.7% effective, is what started the sexual revolution because people could now easily deter illegitimate children from being born. Feminism didn't start the sexual revolution. The pill's invention did.\n\nIn fact, a [study](https://pubmed.ncbi.nlm.nih.gov/27804061/) found shotgun marriages weren't necessarily more likely to divorce. They only divorced more if they were white or wealthy. Black and poor couples were not more likely to divorce because they probably felt a commitment to this marriage. [In fact](https://slate.com/human-interest/2012/08/myths-about-single-mothers-what-bloggers-and-pundits-are-getting-wrong-about-them.html), most unwanted pregnancies were from men the woman had relationship with, and many times, lived with. However, it wasn't unusual for the relationship to have began not that long ago, and they potentially didn't relate or were emotionally distant. Nonetheless, these weren't just mere one-night stands. Most unwanted pregnancies came from women who didn't use enough birth control, if at all, and most simply said they didn't mind getting pregnant or thought they wouldn't. Just 2% said they couldn't afford birth control. They often refused to use birth control. These people should've used birth control consistently, and if they can't take care of the baby, unless they can deal with a shotgun wedding or unless the man can provide enough child support and the mother can feel she can make her kids grow up prosperous, an abortion shouldn't be viewed as a mere choice, but necessary.\n\n[Already, many changes such as later-age marriages and decline of age gaps already happened in Western and Northern Europe in the early 20th century](https://www.un.org/development/desa/pd/sites/www.un.org.development.desa.pd/files/files/documents/2020/Jan/un_1990_patterns_of_first_marriage_-_timing_and_prevalence.pdf?fbclid=IwAR1VmUDAChQvwsR8s4rkRnAQo15VaSOnBF0dGBwI1fJMm-2-DjD5fV1WKHQ) (but not as much in the US) because of their advancements already happening at the time more compared to outside Europe), with the typical marriage age being higher and average age gap being smaller in European countries compared to other countries, including the U.S. at the time. Europe was becoming more modernized early. This is due to European countries having a larger drop than the U.S. in [maternal](https://www.gapminder.org/documentation/documentation/gapdoc010.pdf) and [child](https://ourworldindata.org/child-mortality) mortality rates at the time. Compare the infant mortality rate [in the US](https://www.statista.com/statistics/1041693/united-states-all-time-child-mortality-rate/) to [European countries](https://www.researchgate.net/publication/26465837_Rural_Infant_Mortality_in_Nineteenth_Century_Norway) in the 1800s, too, and you'll see it was much more common in the US. These changes happened earlier in Europe than the US way before second wave feminism, yet people think second wave feminists caused this change. They didn't. Maternal and infant mortality rates declined dramatically in the 20th century, prenatal care and baby formula were invented, the Earth began to have billions of people, etc., and that's why nuclear families and traditional gender roles in marriage became less normalized, not because of feminism.\n\n**Discrimination against men leads to more problems in families, and** **most deadbeat dads aren't selfish men who don't care for their kids**\\*\\*.\\*\\*\n\nSo now we can see that this concept that nuclear families or having two parents are outdated isn't yet completely true. Women are told they can handle single parenting but many still have to rely on a husband to co-parent with her these days. Some of them could handle single parenting a child successfully, but it can be a difficult task sometimes. Having a positive male role model is what helps boys and girls prosper and actually deters \"toxic masculinity\" when you have more masculinity, but in a positive way, shown to them as children. [Most deadbeat dads aren't refusing to support a child, but often are poor, unemployed or paid a low wage](https://www.fatherly.com/love-money/deadbeat-dad-the-myth-and-reality-of-americas-feckless-fathers). Most child support pays are done by men with little to no money, and some of them deal with women **who don't file for support because they don't want their child to see their father**. In fact, research on deadbeat dads found that they usually did try to pay child support, and the ones who didn't were unable to due to poverty, but they often still tried their hardest to contribute in some way. Although just 61% of child support payments were made by men to the mothers of their children, [the percentage of mothers who didn't live with their kids who did not pay child support was equal to that of the percentage of fathers who did not pay](https://time.com/3921605/deadbeat-dads/). This means dads who didn't live with a child paid more often than mothers who didn't live with a child! [Unfortunately though, the court system has a bias favoring women in custody battles](http://www.breakingthescience.org/SJC_GBC_analysis_intro.php) and women initiate most divorces. Fathers now are seen as secondary parents.\n\nAs you can see, people don't seem to realize why nuclear families, men being wealthy, age gaps of older men and younger women, etc. were normalized and why single parenthood, unwanted pregnancies, fornication before the invention of the pill, etc. were stigmatized because people are presentists. Many countries still have the inconveniences of the past, which is why they haven't changed their gender roles, not due to backwardness, and the Western countries force them all to be like us, and call these countries \"developing\", even if they're a country like China or Saudi Arabia, which are richer or powerful countries for not being copycats of the West. Even now, some parents have to rely on traditional gender roles, and although single parenthood can work out, having a father and having two parents, at the very least, is ideal. I don't mind gay couples adopting kids though. In fact, the wage gap is mostly explained by women becoming mothers, not discrimination. [In any country (even egalitarian ones)](https://www.henrikkleven.com/uploads/3/7/3/1/37310663/kleven-landais-sogaard_nber-w24219_jan2018.pdf), the pay gap didn't exist until a woman became a mother. This is an example of how hard it can be to work and be a mother concurrently. It's able to be done, but not necessarily.\n\n**Men vs. women's reproductive rights**\n\nIf child support doesn't work for you and the man because he's poor and can't provide, then you better go get an abortion if you aren't financially stable enough or capable of taking care of the kids all on your own, which is already a hard task, even in \"egalitarian\" countries. Most unwanted pregnancies were found to be from a complete absence, or at the very least, inconsistent, use of birth control. The pill is 99.7% effective when used correctly, and there's no evidence that factors like weight necessarily deter it from working effectively. Most women with unwanted pregnancies due to no birth control usually were able to afford it and were simply found to be making foolish reasoning with their behaviors (cited above). Although birth control should be free, women who are unable to have a baby right now should be using birth control consistently in order to stop unwanted pregnancies.",
    "title": "Single motherhoods and its effects are exactly why traditional gender roles in marriage existed (i.e.: biology), not \"patriarchy\". Normalizing single parenting and changes in gender roles were due to advancements in medicine and plentiful human population, not feminism.",
    "subreddit": "MensRights",
    "timestamp": 1685627801,
    "score": 130,
    "keyword": "man nurse"
  },
  {
    "text": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed. A feminist from the 1940s named Mary Beard wrote a book called *Woman as a Force in History*. It critiques the myth that women were historically treated as subordinate to men and they were restricted from contributing to society or having basic human rights. Her book only includes just a portion of what women contributed to in society, and she says there's so much more. She has no idea how it got erased from history, but critiques the idea that women were historically oppressed compared to men.\n\n**Women did have an education in medieval times.**\n\nFeminists like to think that women were denied an education historically because people hated them and wanted them to suffer, but that's false. In fact, in medieval times, women were being educated all the time, and were as literate as men. G. G. Coulton, the life-long student of mediaeval history, gives a cautious answer: “Though very few women arrived at anything like the university stage in education, it seems probable that more of them could read and write than the men,” especially in the upper classes “at the period when romances of adventure were offered in profusion.” Interestingly, going to university was less common back then.\n\nThis [chapter](https://www.marxists.org/archive/beard/woman-force/ch11.htm) from her book elaborates on all the education women had back long ago in medieval Europe. It was very normal for them to have an education. Italian and German women especially had the most education of the Middle Ages. You can see that women had education and high literacy rates, and were more literate than men. They succeeded a lot in education. Maybe there were some societies that normalized education for boys, but that's because in those societies, education taught discipline, not facts, and people believed girls were more well-behaved than boys and thus didn't need it. Moreover, corporal punishment was used on boys much more, and boys were subjected to forced labor. This was meant for build character and discipline in children. Women weren't educated because it was believed they were less prone to bad behavior and didn't need to be educated. There was only a small overlap between education becoming useful for learning things, and women not being allowed to be educated. Later on, corporal punishment and forced labor declined in schools. It was actually seen as unmanly for boys to be willing to learn.\n\nEven in the later 19th century, girls performed better than boys in elementary schools and outnumbered them, and even in the early 1900s, when high school became more common, girls went to high school more often. Girls even had free education whereas boys in high school had to have their parents pay a fee. You can read more about this from the book *The Privileged Sex*.\n\n**Women did build society and contribute to the social and economic realm of society.**\n\nIn [Chapter 10](https://www.marxists.org/archive/beard/woman-force/ch10.htm), Beard wrote:\n\n>AFTER the dissolution of the Roman Empire, nearly all the economic activities connected with the production of food, clothing, and shelter were carried on in rural villages and their outlying fields everywhere in Western Europe. Whether the village was a free community or property belonging to the estate of a great feudal lord or lady, it was largely self-sufficing; its inhabitants supplied nearly all their needs for the maintenance of life. Furthermore, the industries of households and fields were not like the modern “heavy industries.” Women could handle nearly all of them alone or with some aid from men.  \n>  \n>Thus there was no sharp division of labor as a rule. Men and women worked together for the most part. If the major responsibilities for spinning, weaving, and cooking were women’s tasks, if wood-cutting and ditching were generally men’s tasks, men and women commonly worked side by side in the fields and to a considerable extent in all the processes of transforming raw materials into commodities for use. Whether the toilers on the land were bond or free, men and women labored under similar conditions and enjoyed similar liberties of choice such as they were. Though women gave birth to the children, both parents had the services of children to help them in their work. In the records of mediaeval rural life that are available in our age, no specially onerous burdens are found to have been laid on women as women by men as men. On the contrary the records show a sharing of the toilsome tasks on about the same terms.\n\nWomen were also, even in the Indian and Middle Eastern regions, just as involved in gilds as men. Beard writes:\n\n>While in some of the records the details are lacking, Smith’s *English* Gilds contains accounts of the structure, membership, functions, and proceedings of about eighty-five gilds. In at least seventy-two of them women were members on an equal basis with men. That is surely a large proportion. In some of the other gilds a slight qualification was placed on widows; they were accepted if their husbands had been gild men. Lest the idea of sheer generosity or friendship for the deceased be adjudged the reason for admitting widows to gilds, let it be remembered that, in innumerable cases, widows carried on the craft in which their husbands had been active, being directly familiar with it as a household industry at which they had themselves labored or in connection with which they had borne responsibilities for training and directing apprentices.\n\nWomen were not in a segregated gild, and mixed gilds were common. Some men didn't approve of women in some gilds, but it wasn't due to hatred of women, but because they believed women weren't strong enough for things like bread-kneading and bread-baking. Nonetheless, these men didn't get the monopoly they looked for:\n\n>But a French Parlement refused to prohibit the customary baking by women and declined to back up the men’s opposition to the women. A French parliamentary decree even accorded some gild women rights frequently denied to English widows; it ruled that a widow could retain her membership in a gild even if she took as her second husband a man who did not work in her craft.\n\nWomen also were involved in all kinds of parts of society:\n\n>Just as women took part and carried full loads of work in agriculture, domestic industries, and trading, just as they participated in the activities of craft, trade, and social gilds or corporations, so they shared and expressed themselves in all the forms of social life in town and country. In everything human their qualities and force were expressed – from religious and secular festivities, sports, games, and riots to the **discussion of religious and moral questions and the management of charitable undertakings**. In castles and cottages, in fields and in gild halls, on village greens and in churchyards, in towns and on city streets, in taverns and at market fairs they sought release from the rigors of earning a livelihood, from burdens of domesticity, or responsibilities belonging to the status of their class, whatever it was.\n\nWhen knights even had tournaments to display prowess, it was often done to impress female spectators. **Women's cheers brought outlets in arguments over public, private or religious matters, and in disputes about property, trade, marriage arrangements, family problems, tastes, habits and good or bad manners**. In fact, in medieval times, women were very fierce in many cases, and they would steal husbands' money and run with monks, get in violent fights with women in arguments, smash knights with swords, drinking and singing in taverns, etc. One woman even bloodied a priest's nose after he tried to rape her. When the priest ordered to her to become a pilgrim to Rome, Thomas of Cantimpre laughed and advised to the woman that if a priest sexually assaults or inappropriately pursues her:\n\n>then thou smite him sore with thy clenched fist, even to the striking out, if possible, of his eye; and in this matter thou shalt spare no order of men, for it is as lawful for thee to strike in defense of thy chastity as to fight for thy life.\n\nIn medieval times, women were seen as sinful or wicked, resorting to magic, or the originators of sin, and in need to obey priests or obedient to their husbands, but men were seen as brutal or vulgar, and he had to love his wife, help her support the family and never harm her, and charivaris were done against him or even family intervention if he abused his wife. This was all a reaction to the aggression women engaged in then that people thought women would never do and that only men would do (and feminists reinforce this gender role by portraying all violent women as victims):\n\n>Also, repeated again and again and again in mediaeval documents was the idea that women had been better, if not ideal, “in the good old days,” but were now given to luxury, assertiveness, display, love of worldly goods and pleasures. Hence it would appear that the newest clichés are not so new after all.\n\nMen fought at wars more than women and committed crime more, but women who had power waged wars. Women assembled soldiers. Women fought side by side with men. Women were guilty of many cruelties, and women aided and approved the worst. Women conformed to no type, and they weren't \"tame\" in a \"man's world\". \n\n**Women had a lot of power in marriage and family that men had.**\n\nAccording to the same chapter, Beard wrote:\n\n>Beyond all question the weight of documentary evidence is against any simple conclusion that men handed women around like chattels; that boys were free to make their own choices of mates, while girls were helpless creatures at the disposition of men. After the rise of the centralized state, no one, male or female, was actually “free,” save perhaps the king or queen as highest lord, and even members of royal families had to be on guard against actions likely to stir up revolt among underlings. As a matter of fact, fathers and mothers of the middle and lower classes, as well as lords and ladies, took part in arranging the marriages of both boys and girls under the almost universal rule of “convenience.” The boy apparently had no more choice than the girl. There are records indicating that boys and girls sometimes made vigorous protests without avail; other records show that their protests were effective. But the general rule of marriage for convenience long prevailed.  \n>  \n>Whether fathers or mothers , men or women, usually dominated in the making of matches is a matter buried in the silence of unrecorded history, but there is abundant proof that women were active in the business and were no less circumspect or ruthless than men at the business. Women looked about for marriageable boys and girls to be convenient mates for girls and boys in their own families. Maidens were inclined to be shrewd and insistent – that is, “practical” – in marrying men with property, when they had any chance of selection, as they often did. Mothers were zealous in procuring for their daughters men who had property and in making sure that the property was good, and carefully guarded by proper legal titles. In other words, the marriage of convenience was no one-sided affair in which fathers and sons “had their own way” with the women concerned in it.\n\nAnd women still owned property. It's a myth they couldn't historically. They always were allowed to even back in antiquity. \n\n**Women were involved in warfare and building antiquity.**\n\n[According to chapter 12](https://www.marxists.org/archive/beard/woman-force/ch12.htm), German writer Sir Galahad described the ways of aggressive women long ago. Proof of armed women was found in European ancient ruins, proving that Amazons, the Greek female warriors, were real. Some people think early human years were peaceful, but fights broke out and disrupted it, and women were active in these conflicts in every way men were:\n\n>Where they had power as rulers or in ruling families they often instigated and proclaimed wars and even marshaled their troops as they went into battle. They incited men to ferocity at the fighting fronts. They accompanied men on marauding expeditions. They fought in the ranks. They took up arms to defend their homes. They nursed men on battle fronts or kept households going while men were at battle, and they looked after the wounded on their return to civilian life.  \n>  \n>There was not a type of war in which women did not participate. They were among the primitive hordes which went on looting expeditions against their neighbors or stood fast on their own ground in defense of their lives, herds, and fields. Old Roman records testify to the savagery of women in the Cimbrian tribes that swept down from the north into Rome. Among the Cimbrians, priestesses took charge of war captives. Standing on ladders which they carried with them to battle, they cut off the heads of prisoners, caught the blood in pots, and gave it to their men to drink, in the belief that it would double their strength.\n\nAncient women also initiated or inspired military efforts to subjugate others. Alexander the Great's militant Epirote mother, \"a priestess to whom his father, Philip, had been attracted when he saw her as a maiden prancing to or from a temple with a snake, a god symbol, held high in her arms, and attended by a procession of other maidens\", drove Alexander to become the master of the world. In most of Europe in antiquity and even during Arabia when Islam spread and people declared war against the Muslims, women fought at war. Even Muhammad had his female warriors who teamed up with him.\n\n**Women did influence politics, economics and social change historically.**\n\nFeminists argue women were forbidden from politics. Not exactly. While people were serving in the government were men in many societies, it's because they believed those who fought for our country were the ones allowed to form the government, but not all societies only sent women to war. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), in almost all countries, originally, neither men nor women could vote, and they usually granted suffrage to both concurrently. In some countries, they originally granted it men, then later women. In the US and UK, men originally could only vote if they owned property, and only 3% of British men and 6% of American men did (women were never property). In 1828 during the presidential election, the vast majority of states gave all men the right to vote, but it wasn't in all states until universal white male suffrage was given to men in North Carolina in 1856. Later on, women were given the right to vote more and more. It was simply because men served in the military in the US back then, not because women were considered inferior.\n\nNonetheless, women DID influence politics historically. Not voting didn't stop this, [and many women were originally against the right to vote](https://www.societyforhistoryeducation.org/pdfs/M15_Miller.pdf) because they worried it'd take away their soft power in influencing politics. In fact, many men supported their right to vote for equality, and while people who supported women's suffrage thought it was unfair they couldn't vote, people who opposed it worried that women had more power influencing politics than men because the government responded to women's needs more while men just cast in a vote that only wins if it's the majority opinion. Susan B. Anthony said women's suffrage laws \"probably never would have passed if it had been up to women to vote on them,\" and that men were actually more progressive about women’s suffrage than women were (1902). This [thread](https://www.reddit.com/r/MensRights/comments/15ac3xy/women_did_influence_politics_before_suffrage_and/) of mine elaborates on how women influenced politics easily before voting.\n\nContrary to what feminists think, laws weren't created based strictly on the opinions of men. Only 1% of men worked for the government, and they usually made laws based on what they thought was best for the land or its people, but not for men. Totalitarian leaders might be all about themselves, but certainly not men either. Women's opinions mattered a lot to men. [In fact](https://presidentlincoln.illinois.gov/Blog/Posts/141/Abraham-Lincoln/2021/8/Lincolns-avoided-duel/blog-post/), [Abraham Lincoln](https://www.battlefields.org/learn/articles/abraham-lincolns-duel) even used female pen names pretending to be a woman to attack political rivals, including James Shields.\n\nAlongside speaking against recent policy decisions made by Shields, Lincoln implied that his opponent was weird and unpopular with women.\n\n>*\"His very features, in the ecstatic agony of his soul, spoke audibly and distinctly – 'Dear girls, it is distressing, but I cannot marry you all. Too well I know how much you suffer; but do, do remember, it is not my fault that I am so handsome and so interesting.’”* \\-- Rebecca (Abraham Lincoln)\n\nLincoln's wife also wrote several letters against Shield under a female penname. Lincoln apparently consulted with her about his letters to make them sound like a woman wrote them. What does this mean? Women were seen as pure and moral compared to men, so their voices mattered a lot in politics, and because they couldn't vote, they were seen as fair and reasonable. **This is why women often opposed the right to vote, because they worried it would prevent them from being influential in politics.** If the 1800s were so patriarchal, why would he have used a female penname to pretend that a man was unpopular with women to destroy that man's career?\n\n[Moreover](https://daily.jstor.org/women-against-womens-suffrage/), Catharine Beecher, an advocate for women’s education and economic advancement, argued that women were most effective when they united to press their fathers, brothers, and husbands for reforms in terms that rose above intense partisan politics. Using anecdotal evidence, she pointed to her sister, Harriet Beecher Stowe, whose [*Uncle Tom’s Cabin*](https://daily.jstor.org/frederick-douglass-feud-over-uncle-toms-cabin/) had contributed to anti-slavery sentiment in the country, selling quickly before the Civil War and humanizing enslaved black people. It changed American's views of enslavement at the time, especially in the North. Another example was the women’s clubs that fought for pure food laws, [compulsory schooling](https://daily.jstor.org/why-would-parents-oppose-compulsory-education/), and other reforms that were easily framed in terms of maternal care.\n\n[Women influenced politics in many other ways, too](https://americanhistory.si.edu/blog/5-ways-women-influenced-politics-they-got-vote). In the 1800s, men and women flirted at political rallies and met their potential spouse. Politically-charged women charmed men into supporting certain political views, especially first-time male voters. In his new book *The Virgin Vote*, Smithsonian political history curator Jon Grinspan explains that women even \"turned down marriage proposals specifically because of a young man's political affiliations.\" These actions pressured husbands and suitors to vote in favor of a woman's views.\n\nCarry Nation, a female leader in the Temperance movement, used to use hatchets to smash saloons. Churches and theaters paid her to against alcohol. In the Victorian era, if a man smashed alcohols, he'd be stabbed, but men were chivalrous towards women and refused to harm her. Many people laughed at her, but respected her integrity for her beliefs anyway. Carry's radical approach helped launch the Temperance movement into mainstream American politics.\n\nEven in medieval times, women teamed up with Prophet Muhammad to fight off aggressors against Muslims and helped spread the message of Islam. Women in medieval Europe brought discussions and disputes about moral, societal, or religious issues.\n\nWhen wars happened over the centuries, wars of conquest, defense, crusades, or self-defense did not exclude women. As long as the Eastern Empire lasted, women were involved in situations that led to war. As the empire declined and feudal wars happened for imperialism, women in aristocracies and royal families inspired and initiated wars, and sometimes used their own weapons. They built the state of Western worlds which turned local conflicts into global wars, assisted by women. For centuries in the West and East, imperial power only was ostensibly (but not exactly so) bestowed to men who were head of a family. In reality, official or not, his power was shared by women. Imperial power was often exercised by one or more women. Even in Ancient Rome, the state had lots of power among its women. Beard cited:\n\n>Among such studies of ancient Rome are the 1,124 pages of the old work by J. R. de Serviez, *Roman Empresses ... Wives of the Twelve Caesars,* first published in the eighteenth century – an age of despotism in Europe; and G. Ferrero’s *Women of the Caesars,* published in 1911 when the power of European family clans was rapidly dissolving.\n\nOther wars/conflicts, like the Renaissance, the restoration of the Bourbons, War of the Spanish Succession, War of the Austrian Succession. As medieval Europe was developing, in rural families, men and women worked together almost consistently, and the woman kept the family and its land and house economy going while husbands went to war in England. In royal and aristocratic families in England, women used force in the state of affairs and in the management of the economy helping the monarchy. It wasn't until the the 18th century in England during revolutions destroying the royal/aristocratic families founded on wealth did women and their families in these groups lose power and the parliament and government became solely men. As time went by men, men were the ones serving in military, and they decided men thus would be the ones allowed in the government, but women had soft power in influencing politics as mentioned earlier, which is why people worried giving them the right to vote would get rid of that subtle power. This change happened especially in the French Revolution. In the 1800s, more and more women suffragists were appearing, but men also struggled with the right to vote beside the low minority who had property and thus qualified. In the most progressive societies, women received the right to vote before men's universal suffrage appeared in other societies. Before this point, there were women were highly involved in royal/aristocratic power over influencing politics and society. \n\n[Up until a couple centuries ago](https://www.cracked.com/article_20186_6-ridiculous-myths-about-middle-ages-everyone-believes.html), Europe was agricultural. In medieval Europe, if a father was owning a shop or tavern, his daughters were the ones helping. If her dad became unable to, she sometimes took over the business herself if he was now unable to, which didn't really happen until later in modern times. Women also generally ran taverns in medieval Europe, and [women in England ran the entire beer industry back then](https://books.google.com/books?id=c6MQJ-pdbwAC&lpg=PP1&pg=PA3#v=onepage&q&f=false). Women who didn't run taverns or grow crops often joined convents, and when education was rare at the time, it gave these women access to education. Thus, nuns could read or write in an era where the most powerful kings couldn't. [If women could eventually rule of a house of nuns, they could reach position of power very similar to a male lord, or even slightly higher, seeing as how they technically reported directly to the King of Kings and whatnot](https://web.archive.org/web/20100215224014/http://www.bl.uk/learning/histcitizen/medieval/women2/medievalwomen.html). Sometimes, in monasteries, the abbess had seniority over monks. Outside monastic walls, women could wield political power, especially as queens and regents who exercised royal authority when their husband or underage son was unavailable. A number of powerful queens can be noted in English history, of whom one of the most remarkable was Queen Isabella (1295-1358), who (in collaboration with her lover, Sir Robert Mortimer) ended the rule of her husband, Edward II (1284-1327).\n\n[Even in the Middle East](https://anthrosource.onlinelibrary.wiley.com/doi/pdf/10.1525/ae.1974.1.3.02a00100), women DO influence politics and society. They do it from private positions, and exercise influence over men, by being mediators in natal or affinal groups in marriage alliances, wielders of authority in the domestic sphere, educating their children, or controlling products or property. Women form kinship groups, act as \"data brokers\", mediating social relations in family and society. Women also notify men in their household about what happens in other homes and in extended family. Women also, despite being segregated by sex at times, join with other women in forming solidarity groups and spreading social influence. It helps cause political influence and raises her social status. Women also can influence men's behavior by spreading rumors or gossip, writing mock songs, and spreading social influence to boost or ruin his reputation, especially in social and political issues. Women there might not be in the government, but men rarely make it in the government, and women have so much widely ignored soft power in influencing society and politics, but feminists don't realize in some countries where dictatorships occur, they won't always get what they want, but some of the women's opinions there ARE socially conservative. Women there do influence how people think there and eventually these countries will lose their social norms if people figure their way around their countries' domineering government.\n\nWe have laws pandering to women, including battered women's shelters, campaigns and organizations for women's health, laws against violence against women, etc, but while these politicians are men, they don't make these laws for men. People have always responded to women's soft power historically and politicians' success depended on his support from women more than from men. Men weren't always able to vote historically, but when men served in the military more, they were given the right to vote, but women were still granted soft power that made more changes than mere marks on ballots that only won if a majority. That's why suffragists were originally a minority, but still managed to spread enough influence to become a majority.\n\n**Women were not excluded from history from men, but by feminists.**\n\nIn Chapter 12, Mary Beard wrote:\n\n>Certainly the original sources, which scholars use for the study of men in long and universal history, often mention and even recount stories or give elaborate data of many kinds about women. For example, Herodotus, whom historians of the modern age have called “the father of history,” deliberately included women in his history. Tacitus, the Roman, also observed and commented on the women of his time. Indeed ancient writers in various societies often thought it necessary to consider women and among their works are to be found statements respecting women’s force of character, learning, physical energy, military and political power, and creative intelligence – statements made by the contemporaries of such women.\n\nSo obviously, writers and historians didn't exclude women and even wanted them included. Mary Beard wrote in her book that the idea that women were men's subordinates and were forbidden from contributing to society is one of the biggest myths told in history. Feminists have erased the fact that 40% of slave owners in the US were white women and that women had soft power or even before the 1700s, had royal and aristocratic power, and promoted myths that women were property, were expected to be asexual beings even in marriage, were allowed to be beaten/raped by their husband, or were violently hated. Feminists probably originally removed women's contributions to society from history. Then decades later, feminists wanted to educate society about women's contributions to society they claimed were erased by men because they are clueless about what the first wave feminists did.",
    "title": "Women did make lots of contributions to society, and it is feminists, not men, who erased that from historical records. In fact, people have always thought women before their period were oppressed.",
    "subreddit": "MensRights",
    "timestamp": 1700510201,
    "score": 128,
    "keyword": "man nurse"
  },
  {
    "text": "An Irish Times article which I found surprisingly good, highlighting various issues rarely highlighted in the mainstream media here. \"What’s it like [for a man] to work in a women-dominated profession? A nurse, SNA, drama teacher, childcare worker and occupational therapist share their experiences\"",
    "title": "An Irish Times article which I found surprisingly good, highlighting various issues rarely highlighted in the mainstream media here. \"What’s it like [for a man] to work in a women-dominated profession? A nurse, SNA, drama teacher, childcare worker and occupational therapist share their experiences\"",
    "subreddit": "MensRights",
    "timestamp": 1676948248,
    "score": 68,
    "keyword": "man nurse"
  },
  {
    "text": "Nurse pleads not guilty to amputating dying man's foot without his OK or doctors' orders",
    "title": "Nurse pleads not guilty to amputating dying man's foot without his OK or doctors' orders",
    "subreddit": "MensRights",
    "timestamp": 1676688646,
    "score": 50,
    "keyword": "man nurse"
  },
  {
    "text": "What do I do? This is probably on the wrong sub but I don’t know where to turn. \n\nMy wife of 16 years just told me she has feelings for someone else. One of my gaming buddies online. She says she loves me, but not in the same way as before. We have 4 kids: 2 bio and 2 adopted (her brothers kids.) 1 bio is autistic and my adopted son has a global delay due to being born with heroin in his system. \n\nI want to push thru this, I can’t even imagine a life without her beside me. We’ve been through Hell. We were homeless at one point, we’ve moved away from home (Texas) to help family, at one point we had to pawn her wedding ring just to put gas in the car to go to work (we got it back). I feel like it’s my fault. That I should have been a better husband. Bear with me, just too on my first double shot of Jack in 13 years. I want to fight for her, but part of me says “walk on home”.  Matter of fact, I know I should have been better. I’ve been Pushing 60-70 hours a week to pay the bills. Should have stayed home more. Shouldn’t have games so much. I don’t know what I’m going to do for these kids.  \n\nI keep thinking I should finish off the Norco I have for my shoulder. Make it easy for them. But it would destroy my kids.  Guess I just need someone to tell me it’s worth fighting for.\n\n*Update* Thank you guys. I see some arguments back and forth on here and even tho y’all are arguing, at least you care enough to argue. The hardest part is the “Grin and bear it”. Trying to maintain in front of my kids, acting like everything isn’t falling apart around me takes it toll. I am looking for a therapist, but it’s a small town so pickings are slim. Yes, my mental health is breaking down quickly,  I recognize that.  I’m really worried about what this will do to me kids\n\n**Another Update** it’s official. She’s leaving. It honestly feels like someone is driving an icicle thru my heart right now. But, for some reason, I cannot seem to be able to break down and cry. God knows I want to, just won’t happen. I did seek help, and that was a fiasco in and of itself. I couldn’t find anyone around that was qualified for “Crisis Care” and no therapist would talk to me without it. Ended up going to my family doctor’s office. Since my doctor was busy, they had another look at me. I told him what happened and the first thing he did was laugh. No lie, the fucker laughed. I got told to “man up”. He then prescribed me hydroxyline. I called the Behavioral Health department at the local hospital, and they told me to go to the ER, that way I could talk to one of their counselors now. Went in, got seen and sent to the back room immediately. Then nobody came. For an hour and 45 minutes, no one stuck their head in the room the only way I could get someone to acknowledge me was to stand in the blind spot of the security camera in the room. Yes, I realize they were watching thru the cam, but why leave a guy (who’s in mental distress) to his own devices for that long? That’s when I found out that I wasn’t going to actually see a therapist, I was waiting on a zoom call. They were going to wheel in a monitor and deal with me via Zoom. So another hour and a half rolls by before the nurses decide that I wasn’t a threat to myself and told me to go home and call someone on the list of therapists they had. Needless to say, they weren’t much help. Right now, I’m just concentrating on my kids.",
    "title": "What do I do?",
    "subreddit": "MensRights",
    "timestamp": 1681268805,
    "score": 31,
    "keyword": "man nurse"
  },
  {
    "text": "Domestic Violence: Who Speaks For Men Abused By Wives?  Everyday men abuse women. Until in recent years, such abuses went unreported. Nowadays, due to advocacies by gender activists, violence against women and girls now feature more prominently in the media.  \nEven with the level of publicity that it receives, gender activists insist that gender-based violence remain largely under-reported.  \nIn a twist of fate violence against men by their spouses are rarely reported nor even mentioned in public.  \nIn some instances, women are known to have murdered their husbands due to one grievance or another. Infidelity features frequently in such cases.  \nFor instance, in January 2020, a High Court of the Federal Capital Territory, Abuja, on convicted and sentenced Maryam Sanda to death by hanging for killing her husband, Bilyaminu Bello.  \nDelivering judgment, Justice Yusuf Halilu said every available evidence had proved that Maryam ‘fatally‘ stabbed her husband to death in Abuja on Nov. 19, 2017.  \nSimilarly, Symphorosa Otike-Odibi, a Lagos-based lawyer, was in 2018 murdered by his lawyer wife, Udeme for having extra-marital affairs.  \nUdeme on May 3, 2018 allegedly stabbed Symphorosa, to death and mutilated his corpse by cutting off his genitals at their Diamond Estate, Sangotedo, Lekki, Lagos home.  \nShe claimed that whenever she raised the issue infidelity with him his responses were not satisfactory and nonchalant.  \n“When I returned to where the deceased was, I hit him on the head with the frying pan and continued to hit him on the head and used the knife to stab him in his abdomen”, she said.  \nAlso in 2018, Rachael Adetsav, killed her husband and three children, she was said to have been having issues with her husband, which culminated into killing him and the children.  \nAdetsav was said to have killed her husband and immediately rushed out of their apartment to smash the victim’s car before she committing suicide.  \nIn February 2019, a 19-year-old girl, Mary Adeniyi, was arrested by police in Lagos for allegedly stabbing her husband to death.  \nAdeniyi, a nursing mother and her husband, Solomon Nduka, 30 had a fight over alleged infidelity.  \nHe allegedly stabbed him on the neck region with a knife which prompted neighbours to rush him to a nearby hospital. He later died.  \nAlso, in 2012, Hadezia Abutu (nee Afegbua), was accused of killing her husband, Ibrahim, just two days after a new wife was welcomed into the family in December 2011.  \nShe was said to have allegedly shot her husband, Ibrahim, in their Wuse II, Abuja residence just two days after Ibrahim married another wife.  \nBefore he died he informed his younger brother, Obotu, that he had been shot by his wife, Hadezia.  \nMrs Titilola Vivour-Adeniyi, Coordinator, Lagos State, Domestic and Sexual Violence Response Team said men have difficulty reporting incidents of assault by their partners, a situation she attributes to cultural norms.  \nAccording to her, patriarchy is an enemy of everybody because it keeps people in silence.  \n“From a young age, males are not allowed to express themselves when they are experiencing trauma and that lingers on to adulthood”, she said.  \nShe said between January and June 2021 there were about 194 reported assaults by wives against their men in Lagos state alone.  \nFagbohungbe Oni, a professor of psychology, University of Lagos, said that one of the most common attributes displayed by a potential killer-woman display is destructive tendency.  \nMr David Aloysius, a psychologist said domestic violence is committed mainly against the women but recent events show that women as also perpetrate violence against their husbands.  \nAloysius said some men are daily being beaten, subjugated and traumatised by their wives, adding that most of the abuses go unreported.  \nThis according to him is because of the notion that the man is always superior to the woman in terms of physical strength.  \nHe said while the ‘norm’ was men abusing their spouses, the table seems to be turning against men as they now face regular abuse in the hands of their women.  \nHe called on gender right advocates to beam their searchlight on the plight of men who are under the subjugation of women.  \nAloysius said that domestic violence involving wives physically assaulting their husbands was assuming a dangerous dimension.  \nHe said some wives not only beat up their husbands to stupor but kill them in some cases.  \nAccording to him, though men are naturally perceived as being mentally stronger in some instances the reverse is the case.  \nDr Kehinde Samuel, a psychiatrist, said domestic violence could be drastically curtailed through counsel and mental evaluation of potential couples.  \nIt is gladdening to note that the law has not spared women brought before it for abusing their spouses.  \nHowever, analysts say it is necessary for stakeholders to make conscious efforts to bring to the front burner that plight of thousands of men suffering in silence from abuse by their partners.",
    "title": "Domestic Violence: Who Speaks For Men Abused By Wives?",
    "subreddit": "MensRights",
    "timestamp": 1688347941,
    "score": 30,
    "keyword": "man nurse"
  },
  {
    "text": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones Historically men have always been the problem-solvers for most of human existence. Men have always been counted onto to be problem-solvers because for the most part because we are hardwired to detect what is wrong with our environment or location. So I feel like when the industrial revolution came about to be, society counted on us to be not only problem-solvers, but also example-setters, the role models, the innovators, in other words, historically men fought tooth to the nail to try to make the world a safer, healthier and more stable place\n\nSo when the Industrial Revolution came to be, this put more pressure on men to be even more ''advancing'' and ponderous on to the grid and infrastructure of society, so we naturally have inclined to depend on men not only for advancing society, but to be the prime example-settlers for people to follow. I think that might be part of why we put so much pressure on men to be established and groomed by a certain age, where as women don't face those very same productivity pressures. I mean sure obviously people will judge a woman if she's being what they call a ''leech'' on the system, but for the most part what I am saying is they don't really get hit with the memo of hustle culture to the same degree men do, no one is going to judge a woman for working at McDonald's more than her being a nurse, but for a man that implies lack of intrinsic worth and respect and a good work ethic.\n\nI noticed this also disturbingly amongst ethnic minority male groups, whether it is the ''trabajador'' culture in the Hispanic community or the ''Be a baller'' mentality in the black community or the Silicone Valley Techie trope in the Indian community, I think those pressures are even more pronounced among men of color, but gonna try to refrain from over-emphasizing, I think you get my point though.\n\nBut this is also mostly used against working-class men, for example no top CEO in a fortune 500 company is gonna be told that their hard work doesn't pay off, even if they ended exploiting the resources along the way.\n\n&#x200B;\n\nI believe this to be a men's rights issue because since the working class consists mostly of men, this keeps the average man in the trenches",
    "title": "The bubble of male productivity pressure and how it is used against us: A medium-sized essay-like post on male over-productivity and how hustle culture grooms young men into being worker drones",
    "subreddit": "MensRights",
    "timestamp": 1682608588,
    "score": 20,
    "keyword": "man nurse"
  },
  {
    "text": "Parenting Is this unsanitary and is it normal that a mother who is a nurse does things like this to the younger daughter and not the older son? As a Father/Step Father is it wrong to feel Enraged because you observe your  daughter(3yrs) gets treated differently. Btw the Mother never takes accountability and ⛽️ 💡, and points finger whenever it’s time to say I screwed up? Btw Im not perfect but things like this is only the tip of the iceberg. She also tries to let the step son who’s 8 and I’ve raised since 2 be the Man of the house with no recourse for bad behavior. Literally will physically attack you if she doesn’t like how he’s chastised but will yell and scream at the 3 yr old who’s copied her brother and parents  to a T(which Dad tried to stop). Dad can’t leave out of fear for lack of care, and attention to detail to his child.She won’t “mean” for anything to happen but it always will as usual.  Dad is also on the brink of sincerely losing his mind in said woman….please advise Sn:I said nothing and just fixed it, no need for arguments first thing(been there but try not to)",
    "title": "Parenting",
    "subreddit": "MensRights",
    "timestamp": 1696941913,
    "score": 18,
    "keyword": "man nurse"
  },
  {
    "text": "Am I wrong to be annoyed with something our couples therapist said? **Update**\nWe will be finding a new therapist. We have already started reaching out to some female therapists our age/younger. Thank you everyone for your kind words and support. \n\nSide note: If anyone has recommendations for someone in NC that would be great. \n\nMy husband read through everyone’s comments and when we talked more he now understands what I was trying to say and that it isn’t that I was trying to keep him from getting recognized for his contributions to our family but rather that it isn’t right in general for only men to get praise for parenting, but even moreso in the context of a marriage counselor for a couple that is intentional about having an equitable distribution of labor in all areas of our relationship. \n******\n\nMy husband and I, both 32, started seeing a couple's therapist, (m, \\~60 yo) about 2 months ago. For some general background, my husband and I have been together since we were 16 and married for 6 years. We have a 3 yo and a 6 month old. We are overall very happy, we are best friends and are committed to breaking generational trauma for ourselves and our kids' sakes. The reason we started seeing a therapist was more of a maintenance/care thing than for any huge glaring issue.\n\nSo the comment in question was when I was telling our therapist about our overnight routine with the baby. Baby is breastfed so I wake up to nurse him as needed overnight. My husband sleeps while I nurse and then I let him know when I'm done nursing and he does diaper change and puts baby back in his crib. For some context that will be relevant in a bit, I nursed our first for 2 years and my husband didn't do this with him, this is something I asked him to do with this new baby because it seemed more fair than how things were the first time around. \n\nSo, back to me telling the therapist how I hand off baby to husband to change his diaper and get him back to sleep after I nurse him. His jaw dropped and he was offering all kinds of praise to my husband. He then asked me \"have you thanked your husband for how he helps you at night?\" I said I do, and that I'm grateful to have a husband who helps share the load of taking care of our children. Which is true, I am grateful. But the more I think about it the more his comment rubs me the wrong way. Why is it only me that needs to be grateful for my husband's contributions in caring for our baby overnight? I am also waking up and taking care of the baby. How come he didn't ask my husband if he has thanked me for what I do? It just seems so taken for granted when I do it, but when a man helps all of a sudden I need to jump for joy. After therapy, I shared how I feel about this with my husband I really thought he'd agree with me and see how sexist the therapist's reaction was, but he doesn't see it?! He agrees with the therapist and is now mad at me for making it all about me and feels like I'm trying to steal his spotlight. My thing is, we either both deserve praise for the way we take care of our baby overnight or neither of us deserve praise because we're just doing what is our responsibility. But it can't be praise for him, and none for me because I'm just doing what I'm supposed to.\n\nAm I wrong to think our therapist's reaction was rooted in sexism and traditional gender expectations? Does it not highlight the way a woman's contributions to her family are undervalued? It's become an ongoing argument between us, I am starting to feel like it's the therapist and my husband against me since this is not the only comment of this type he's made.",
    "title": "Am I wrong to be annoyed with something our couples therapist said?",
    "subreddit": "Feminism",
    "timestamp": 1692177908,
    "score": 1614,
    "keyword": "man nurse"
  },
  {
    "text": "Need some encouragement, currently feeling hopeless as a woman It seems to me like in every career, even those with predominantly women, men hold the positions of power. I cry a lot about this. \n\nI am a 25 y.o nurse working on a unit. Most of my peers are women, I'd say a solid 10:1 ratio. Nursing actually started out as a career only for women. I love all nurses regardless of gender, don't get me wrong. But I can't help but notice all the head nurses throughout my career were men, those who make decisions about our profession are men, etc. Even the most famous tiktok nurse is a man (who impersonates women). The first \"celebrity\" social media nurse was also a man. I can't help but notice they always make fun of \"Becky\" and \"Karen\".\n\nAgain, I have no problem with anyone regardless of gender in nursing. We need all we can get. \n\nIn every profession, all I hear about are the men. Chefs, scientists, you name it. \n\nI'm just feeling really discouraged and thinking horrible thoughts like, maybe they are smarter? Maybe they are better? \n\nIt's difficult to write this post as I realize I'm not being very inclusive in my language and I apologize in advance. I feel stupid writing this but maybe someone out there feels the same and can point me in the right direction",
    "title": "Need some encouragement, currently feeling hopeless as a woman",
    "subreddit": "Feminism",
    "timestamp": 1698189523,
    "score": 192,
    "keyword": "man nurse"
  },
  {
    "text": "Tales of a queer woman: IUD and endometriosis A woman got her first IUD; not to prevent pregnancy. She does not plan on having intercourse with a man anytime soon as she has branded herself as queer. She didn’t start birth control for her boyfriend or significant other, or start it in her teens to regulate her period. She was alone in this decision. What reason did she undergo this notoriously painful procedure? She did it because of her endometriosis diagnosis. The pain of her periods has been debilitating and has landed her in the ER two times. The most recent episode left her collapsed in the woods, hiking on a particularly hot day. She felt that her body betrayed her in her favorite place in the world. Of course, the first time she went to the ER she was left with nothing, but debt and little to no answers other than a possible kidney stone. This time around, she was determined to have a solid answer to what the hell was wrong with her. Based on her symptoms, endometriosis was the likely diagnosis. Although there is no easy treatment for this disease, birth control was screaming loudly and waving vigorously from the back row like a proud and boisterous mom at a high school graduation. It was something she was trying to avoid all of her life because of the countless horror stories of weight gain and women feeling out of control of their bodies and minds. Also, is it an anti-feminist decision to start birth control? As a developing feminist, she supposed it was… depending on the context. She has always been against medications and unnatural things. Now, she had to consider if it was worth having another endo episode or ending her ongoing avoidance of birth control. There is peace of mind that if she were to be r\\*\\*\\*d, the likelihood of an unwanted pregnancy has been significantly reduced. The world she lives in and the men she lives amongst might make any conscious woman consider these thoughts. \n\nWhen she initially sat down with her gyno, he mentioned that there is no actual cure for this disease other than contraception or pretty invasive surgery that might help for a short time. She was hesitant to start any contraception and wanted to do more independent research. This led her to the Planned Parenthood website where she concluded an IUD would be best. She made the decision to schedule an appointment within a week. Falling down the Reddit rabbit hole, she divulged in the horror stories about how painful it is to have an IUD inserted. Not only is the insertion expected to be painful, but the pain and discomfort that follows are expected to linger for 3 to 6 months. Periods might or might not happen. Who is to say, what is she to expect since it seems everything is on a case-by-case basis?\n\nThe day of her appointment arrived, and dread sank. Her overactive stomach began to churn. The kind female nurse whom she had met once before prompted her to pee in a cup to run a quick pregnancy test since it is their policy. After peeing in a cup, she entered the examination room stripped down her lower half, and covered herself with a blue paper sheet. Staring at the tools that lay before her, nausea resonated throughout her body. Her male gyno, which she had seen once before, although she was hesitant to have a male associated in any way with her womaness, entered the room. He discussed the possible malfunctions of having an IUD, which made her sick to her stomach. She asked how long the procedure would take. “It should take about 3 minutes, he said.” “That’s it? I thought it would be ten minutes or so,” she felt some sort of relief. “It might feel like ten minutes,” the gyno said jokingly. He mentioned that there was a numbing agent available that might help to alleviate pain during the insertion. She decided against it because of her finances and the likelihood of it even working or being worth it since the injection of the numbing agent is painful in itself. The time had come to lay down on the table with her feet in the stirrups. She felt like she was submitting her body to a medieval torture device to have her insides ripped out. Her male gynecologist and female nurse had a kind demeanor and made casual conversation while preparing their instruments, which she knew was a way to comfort her. Within minutes, blood-curdling screams came from her in the exam room. She liked to use the word “f\\*\\*k” to exclaim her pain. She didn’t think she was saying those words, since she had dissociated into the black flecks on the drop ceiling above her. She thought of how it would be with her mom there, holding her hand. While it was some of the worst and most violating cramping she had felt, she compared it to the cramps of that time she fell in the woods. “This is nothing compared to how I felt before,” “This is worth it,” she kept telling herself. She was comparing pain levels to justify a procedure that she had never been on board with fully because she felt like this was the only option. No one should feel this much pain, with such little preparation as taking 800 mg of ibuprofen, in addition to the pain that would follow months after. She felt the room spinning and lay down for a bit in the same position on her back. The room was still spinning. The gyno asked if she would like anything to nibble on or anything to drink. She opted for water since her lips and mouth were dry as sand. The kind nurse came in with a plate of saltines and a large cup of ice water. She slowly sat herself up on the table, cloth on her lap, and pain surging through her stomach and lower back. After some small talk with the nurse, she was free to go. Standing up, she felt a change in her balance and equilibrium, like a small weight had been put inside of her.\n\nShe knew so many women who had undergone this procedure. So many women have felt this pain and had the same experience. She hoped that the other women were taken care of kindly and were listened to when they experienced their pain because this could easily be a traumatic experience. She wished that their workplaces were supportive through their healing process. She also wished that others were more on board with this process, particularly those who were also diagnosed with endometriosis, and told that BC is the only realistic solution. Not only is endometriosis traumatizing and excruciating, but so is the IUD and the stigma surrounding birth control. She waits to see how BC will impact her image and mind.",
    "title": "Tales of a queer woman: IUD and endometriosis",
    "subreddit": "Feminism",
    "timestamp": 1697386101,
    "score": 15,
    "keyword": "man nurse"
  }
]