[
  {
    "text": "Need advice Hi, I am just entering my 30's and am currently at a crossroads in my life. I took a somewhat unconventional path that has now lead me to needing employment advice. TLDR at the end.  \n\n\nI became a low level cannabis dealer in highschool and found it an easy way to have more than a bit of pocket change and still have freedom. When it was time to graduate i planned on moving to a large  city for college. Before moving i worked at a family business for >6mo doing odd jobs. I intended to find employment after moving but time after time I didnt get past the interview process and with college loans and some money saved up from graduation money wasnt a pressing issue.   \n\n\nEventually I made friends, sold cannabis to make ends meet and everything was fine. I eventually found a job at a pizza restaurant, around 2010 and worked there for around 6 months then took an opportunity for lab work through a program at my college. During and after this time my cannabis business became more profitable and I was learning the skills and meeting the people necessary to be a successful cannabis purveyor.  After the lab work program ended I focused on college and my cannabis hustle while looking for other lab work. I found a job working at a friends shop for a while but it wasnt sustainable and went out of business shortly after. I graduated 2013 with a BS.   \n\n\nI became quite successful with cannabis and continued with that while still (not-enthusiastically) looking for regular employment. I was also looking into further schooling looking at PHD or masters programs. I started to save more and more money and around 2016 I began looking into buying a home and starting or investing in a business. I had a little over 130k at that point. Then of course some friend of a friend found themselves in trouble and decided to snitch on me to save himself at an very bad time for me. Great timing for him though.  I lost everything but about 5k after lawyers, fines, costs for assessments etc and got a 2nd degree felony. The felony will be reduced to a misdemeanor in one year and my probation will be complete. I had to spend some time in jail and was forced to move back in with a parent in my small home town.   \n\n\nNow I am pretty much broke, with a felony and a 6 year gap in an already spotty work history. I've tried looking around for jobs for the last 1.5 years and got a few interviews but was rejected when they saw the results of my background check. Two places even offered me a job then retracted their offer after the criminal history. It isnt specific either so 2nd degree felony could mean rape, murder, theft or actually dangerous drug use.  \n\n\n I do have excellent skills to offer, im good with communication, organization, attention to detail, product purchasing, marketing, leadership and delegating tasks, etc. and I have a BS from a great university but I am uncertain as to how to proceed.  I dont really have family I am close to besides my parent who lives at the poverty line. I am a generally positive person and have always cared deeply for others but lately Im feeling a real sense of hopelessness. Any advice is genuinely appreciated. Ill try to answer any questions you may have, I tried to keep it brief and I've probably left some  details out.  \n\n\nThank you so much for taking the time to read and any guidance/advice, anything, is sincerely appreciated.    \n\n\nTLDR; sold the devils lettuce, went to college, graduated, made money, got busted down badly, now broke, living with a parent, have a 2nd degree felony and a 6 year  gap in work history, and now im sad man.",
    "title": "Need advice",
    "subreddit": "jobs",
    "timestamp": 1565198666,
    "score": 1,
    "keyword": "man lawyer"
  },
  {
    "text": "Need helpful advice/guidance to get my life on track I'm going to be 22 soon, with little to no direction. Right now working as data entry in Hungary for low wage that I can't really save. Standing before going to collage, which my Mom (since father left us) wants, but not me. \n\nAs I have seen, read and have thought, I do not really see the worth of a paper which wastes like 3-4 years of my time and getting into huge debt. \nPlus Hungarian education is very low quality.\nOf course, I will leave this country as I can't see my future here.\n\nAs far as I know, the valuable thing about collage ONLY the connections I could get. I am bit introverted, so I see it less likely for myself to go to collage. \n\nIf I could, I would do some courses(which doesn't takes too much of a time) which gives me valuable skill/s but wouldn't want it to take more than 2 years, it could be courses, trade school or smh like that. I need possibilities or any paths to take. \n\nThat's why I'm here, asking for advice.\n\nLittle bit about circumstances;\n\nFamily (immediate and father's side of family) is narcissistic and toxic, so there is the additional motivation for me to get away.\nFather left us(with all the money, even sold the house), therefore no one will help me, so I must get out this myself. \n\nI think as I'm and y'all too, have been just drifting with the waves of circumstances and doing what others told you. Go to this school go there, bla bla bla. This scheme has been going on since the early/mid 20th century. Go to school, go to collage, get a job, get married, get a family, grow old, and die. \n\nThis is not life. You are not happy! This is a scheme for the government to stay in power and let the mass, the little man, stay on a conveyor belt, in a modern slavery.\nA rat race. If you go in, it's very hard to come out. I always reminded of this: Make a choice which you will NOT regret. We make choices everyday, it may be consciously or unconsciously, we make a choice.  I am too, stand before a choice, as you do.\nAs I have decided and actually writing this post and not playing is a choice. \nYou getting drunk is a choice. \nYou not exercising is a choice.\nSpending time with friends or family is a choice.\nHoling yourself up in your room is a choice.\nGetting a side hustle and getting financially independent or closer to it is a choice.\n\nLife is too short, only to be unhappy and later regret \nLife is the consequences of your choices made today. It could lead you anywhere. \nYou might be love doing something but if you can't get financially independent and free, it might not bring you the happiness you need. \nI know I don't care about power, I want to be happy and free. To be free, you need money as a tool to do what you want. \n\nRight now I stand where I know what I don't want to do or be. Like I know I don't want to be holed up in an office and be miserable, hoping for the work shift to end and just get rest.\nThis is how you get old. By not enjoying life and wait for the clock to move. Living paycheck to paycheck, working for someone else's dream, while You (or me) staying a cog which could be replaced anytime.\n\nI have read and thought a lot about financial independence, and the way for to be living like that you need to have passive income. An income which does not require your presence or time(that much). Such as business, stocks even Real Estate(basically investing). \nSo MONEY works for YOU, and not YOU working for MONEY.\nYour most valuable thing you have is time. So don't waste it.\n\nRight now I was thinking to exchange my time for money but also not to do work which would make me miserable(such as office work and coding, as I have been in front of computer my whole life) and later invest it.\n\nAbout myself a some things;\n\nMy social skill is alright, but I don't really like to put up that fake smile and that facade, plus had some bad share of people for me to not like people in general, (also been betrayed couple of times). I also know that sales skill is very important today, so I could work on that.\n\nI have a bit of confidence issue which stems from; \n* Introverted nature, but getting to ambiverted\n* not having fit body(working on that), \n* Acnes\n* have gaps between my teeth and not the whitest\nsince I haven't been really taken care of since I was little. \n\nMy Interests:\n* Playing games - Logical problem solving \n*   Being healthy and Natural health\n*   Animals - Nature \n*   Plants - Gardening - Landscaping \n*   Photography - Travel - blogging/Stock photos\n*   Financial knowledge - Stock market\n*   Freedom\n*   Spirituality - Occult - Astrology\n*   Psychology - Mental health - Subconscious\n*   Music (specially trance)\n*   Science - Technology \n*   Space(Universe)\n*   Cooking healthy\n* Herbalism\n* Giving helpful advice to people\n* Always liked new things, getting new skills, getting to know about abstract and philosophical things, and things that makes me go into deep thinking and pondering.\n\nPersonality:\n* Introverted ambivert\n* Likes peace and avoids drama, trouble\n* INTP\n* I listen a lot, and speak if needed or if I'm adding any value to the conversation \n* Analytical and logical\n* Value knowledge and intelligence\n* Likes planning\n* Independent \n* Likes to be alone more than be in a big crowd\n* Friendly\n* Good secret-keeper\n* Emphatic \n* Open-minded\n* Patient\n* Difficult to get to know \n* Sometimes getting into self-doubt\n* Also Self-conscious \n* Cares about what others think of me\n* Can't spout a lot of nonsense like some people do and talk about nothing just to keep the conversation going\n* Don't like gossiping\n* Need a push to start smh\n* Hate making small talk and fake smiling\n* Hate memorizing(won't be lawyer\n* Don't like(but closer to hate) monotonous work\n\nLong term Goals(like bucket list):\n*   Be financially independent and attain freedom \n*   Travel and experience lot of things, food and cultures\n*   Have big orchard, beautiful garden \n*   Blueberry or Berry farm \n*   Be completely healthy and free of sickness\n*   Have enough passive income or a business that's need less of my time\n*   Own House\n\nAbout job: \n\nIt's important for me to make +60k usd annually and future of that type of work, how stabile it is, also can I make my own business as I would love to be entrepreneurial in the future, but know the ins and outs of said business or industry to make my own.\n\nJobs, hobbies I have looked into the surface and might be okay for me:\n* Copywriting, blogging, content writing \n* Life coach or some sort of coach or advisor\n* Home designer, maybe smh about Real Estates\n* Smh about natural health and products\n* Gardener\n* Electrician\n* Green engineer\n* Flipping\n* Photographer\n* Tutor\n* Day-Swing trader\nThese are jobs that I haven't looked deeply into and seems fine on the surface. Please also suggest ones I did not mentioned as I have limited knowledge about jobs, and mention maybe some that could be suitable to my personality or interests.\n\nI would love to get helpful and serious advices since I am very serious about this, and would love to find my way to be happy and even make the world a better place.",
    "title": "Need helpful advice/guidance to get my life on track",
    "subreddit": "jobs",
    "timestamp": 1563130063,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "Lawyers, what is your \"the man should have got the kids\" moment and what happened after the case?",
    "title": "Lawyers, what is your \"the man should have got the kids\" moment and what happened after the case?",
    "subreddit": "AskReddit",
    "timestamp": 1576550533,
    "score": 7,
    "keyword": "man lawyer"
  },
  {
    "text": "[Update] My ob/gyn tried to force me to have an unwanted baby, I'm having an abortion at 16w tomorrow, **And I just got a call from the local women's shelter. I was referred to them by my ob/gyn for their \"new mothers\" program!** Original Post: https://www.reddit.com/r/TwoXChromosomes/comments/atwfyl/all_the_steps_my_obgyn_made_me_take_to_have_an/?utm_source=reddit-android\n\n2nd Update: https://www.reddit.com/r/TwoXChromosomes/comments/av6f30/update_2_my_obgyn_tried_forcing_me_into_having_a/\n\nConclusion: https://www.reddit.com/r/TwoXChromosomes/comments/avdzo8/conclusion_my_obgyn_tried_forcing_me_into_having/\n\n---\nI am so livid right now. These people just DON'T STOP! \n\nEarlier today I cancelled my next appointment and happily told them about my abortion tomorrow. And just a few hours later, the woman from the shelter called me. \n\nHearing the name, I'm thinking *wtf, my husband doesn't abuse me*. The woman started her spiel and I was very curious to hear her out. Apparently the program is to have in-home counseling, information about fetus development, etc. Basically counseling for women keeping an unwanted pregnancy. \n\nI got very scared for tomorrow reading about the abortion, so I told my husband about it. He got really disgusted and, \"didn't want me to tell him about the actual procedure, it's barbaric.\" So now I'm back, telling it to all of you. And I don't think he meant to sound so insensitive, this obviously affects him, too. \n\nTo any women out there who are pregnant and unsure: if your dr tells you to go to *x*, *y*, *z* appointment first to have the abortion, try calling an actual abortion clinic or other ob/gyn and see what they say. Don't get tricked like I did. \n\n**Edit: Thanks again to everyone for your support!** I'm honestly so scared that I've been vomiting constantly all day, and have a wicked headache (no aspirin 24 hours prior to the procedure). So I may not respond right away, but I am reading every comment and you guys have really helped me to get through these past 4 days!💗  \n\nI will likely be posting an update tomorrow or the day after to let you all know how it went :) \n\n**And as for my husband,** I think I inaccurately portrayed him in a very negative way, and he's not that guy at all. He is a very supporting man; he found me at rock bottom, helped me out of the dirt and abusive relationship, and brush myself off (as a friend). If things didn't work out so well now, he would have signed off on an adoption and not shown me how much it broke his heart. This started as a wanted pregnancy, we had been trying for over a year and even went through a miscarriage last March, so I know he's as upset as I am. I'm not trying to excuse his behavior, he reacted very poorly.  This is just really stressful for both of us, and I hope that in the upcoming days he can compartmentalize what happened for a bit and just *be there* for me. \n\n**Edit 2: As for everyone encouraging me to see a lawyer,** I actually have one for a separate lawsuit. I have a meeting set for ~1 week from now and will be discussing it with him then and see where we can go from there. \n\nI also never considered the social worker calling me to be a HIPAA violation! Thank you for pointing that out to me! I definitely never signed any consent to share info forms, and I'm one of those people that reads/skims before signing anything.",
    "title": "[Update] My ob/gyn tried to force me to have an unwanted baby, I'm having an abortion at 16w tomorrow, **And I just got a call from the local women's shelter. I was referred to them by my ob/gyn for their \"new mothers\" program!**",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1551121737,
    "score": 14799,
    "keyword": "man lawyer"
  },
  {
    "text": "I’m so tired of seeing people claim that rape is rare. Despite the statistics.  \nDespite # metoo. \nDespite millions of women making themselves publicly vulnerable to criticism and backlash by posting about their sexual assault/harassment.  \nDespite most women I know having experienced some form of harassment or sexual violence.  \n  \nI’m so tired of having an act at epidemic proportions be called “fake”.  \n  \n“Rape is rare but a lot of women lie about rape”  \n  \nOh yeah?  \n  \nI didn’t post my # metoo story. I have a legitimate fear of violent backlash if I did. I didn’t want to deal with the emotional toll it would take on me, and I didn’t want to upset my friends and family.  \n  \nMany women feel the same way, and so we stay silent.  \n  \nI didn’t report my rape. I felt obligated to report it unofficially to social services when my ex sexually and physically abused our child, but I didn’t press charges.   \n  \nFighting for justice for my child was like having a full time job that costs money to do. It was emotionally horrendous. The justice system was essentially useless and years later I am still fighting for the continued safety of my child.   \n  \nTaking on another legal battle would have potentially taken away from that fight, and it would have very likely resulted in nothing, except more legal fees, court dates, and emotional trauma.   \n  \nDo you know what it’s like to relay events to a law enforcement official/lawyer/social services worker who looks dubiously at you? To discuss the worst moments of your life to somehow who is crossing their arms and leaning back in their chair because they don’t believe you?   \n  \nThis is what we are talking about when we say BELIEVE WOMEN.   \n  \nMy rape was in the grey area. It was marital, it was non-violent. I had clearly and repeatedly told my husband I did not consent to a certain act, it was painful for me and I didn’t want to do it. He’d whine, say “it’s the only way I can finish” but I stuck to my guns, after months of enduring it. Then he’d begrudgingly agree not to do it. And the next time we were intimate, he would do it anyway. I was afraid to say something in the moment, so I’d repeat how I felt after the act was done. I should have been more assertive, but he was twice my size and so good at manipulating me.  \n  \nIt’s all in the grey area. The law doesn’t care about rape unless you have concrete evidence, and evidence you fought back. And even then....   \n  \nAnd years before this, he had sex with me without a condom despite me telling him he had to have one on. He came in from behind. I was afraid to say anything. Afraid he would leave me if I said “no”. He was so against the condom in the first place. I was so young and naive and stupid.   \n   \n  \nThis man is a psychopath who has a new girlfriend and a pretty quiet life, leaving me and my child is the aftermath. He lost nothing, we lost so much. I have good reason to believe that he drugged me with roofies as well, and drugged my child later on. I don’t want to go into details, but the evidence is solid enough for me to believe it, but not concrete enough to press charges. It’s been years, anyway.  \n  \n\nRape is not rare. Rape is not rare. Many of us will not speak publicly about our rapes. Many of us are afraid because of physical, emotional, and/or legal backlash.   \n  \nI don’t know how to make people believe how common rape is. I don’t know if it’s possible at this point. I just wanted to tell *someone*. My rape, my repeated rape, was real. My child’s sexual abuse is real. The justice system is useless.  \n  \nPlease believe us.  \n \nEdit: all of the people coming here to say “but it is rare!!” and to play semantics about rape/sexual assault are deliberately missing the point. Just fucking believe women. You know more sexual assault and sexual harassment victims than you realize. We don’t talk about it. Nobody knows about it for most of us. That’s the fucking point of the post.",
    "title": "I’m so tired of seeing people claim that rape is rare.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1565793122,
    "score": 686,
    "keyword": "man lawyer"
  },
  {
    "text": "The man who sexually assaulted me FINALLY plead guilty TW: Sexual assault\n\n&#x200B;\n\nLongtime lurker, first time poster. I saw that a lot of people in this community are posting about reporting their sexual assault. While I have never posted here or had a reddit account, I would come here to read your stories for support and encouragement. I'm hoping that my story will encourage others who are going through the process or thinking about going through the process of formally reporting their assault. \n\n&#x200B;\n\nOne year ago this month I was sexually assaulted by a co-worker (let's call him A). I attended a group event in which we were all out celebrating his promotion. After a few drinks, the rest of the group left and A insisted that I go with him to his apartment to help him pick up something before we went back out to another bar. Once we arrived at his apartment I started feeling very sick and weak. At first he ignored me and was watching TV but after about 30 minutes he took my phone and moved me to his bedroom. It wasn't until after I threw up that he proceeded to try to take my clothes off and rub and kiss me for several hours. He told me he'd been fantasizing about having sex with me since my first day at work. I kept pushing him away, saying stop and asking to leave over and over again during that time but I was too weak to stop him and escape. The next day he drove me back to my apartment and told me not to tell anyone what he did or he would get me fired.\n\n&#x200B;\n\nI was terrified that he would make good on the threat because he was in a much higher position than I was. A few friends from my lunch group at work noticed that something was up with me and I confided in them that A had sexually assaulted me. All of them believed me and wanted to report it to HR. After about a week, I got up the nerve to report him to the police as well. While I didn't hear anything from HR, the police laid charges on him two weeks after my report.\n\n&#x200B;\n\nWhen HR found out A had pending criminal charges for sexual assault, they put him on unpaid suspension. Eventually, he was fired as well. After he lost his job, I received a letter from A's lawyer stating that I was going to be sued for defamation for \"making up the assault.\" I was shocked and horrified because I didn't know how to prove I was telling the truth. His lawyer never actually sued me but it was an intimidation tactic to get me to disappear in the criminal case. \n\n&#x200B;\n\nTwo months later, I was called to testify at A's preliminary examination. It was supposed to last one hour but I was questioned by A's lawyer for 7+ hours on just about anything you could think of (e.g., what were you wearing?). As I was being questioned, A smiled at me from the defense table. It was creepy af. From my testimony alone, the judge decided that there was enough evidence to go to trial. Months later, on the first day of trial, A plead guilty to lesser charges but he now has a criminal conviction and was ordered to pay me restitution. Everyone at work (and at several other competing firms) knows what he did so he's been unofficially blacklisted in the industry as well.\n\n&#x200B;\n\nAs I was going through this process I often felt like there weren't a lot of stories out there about a perpetrator being held accountable. I hope that my story becomes less unique over time and that police, prosecutors, judges...anyone with the power to punish these people actually does so.\n\n&#x200B;\n\nTL;DR: Despite threats and intimidation tactics, the man who sexually assaulted me now has a criminal record and can't get a job in my field anymore.",
    "title": "The man who sexually assaulted me FINALLY plead guilty",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1556494215,
    "score": 671,
    "keyword": "man lawyer"
  },
  {
    "text": "My nephew's girlfriend just called me \"Aunt\" for the first time. I'm so happy! Okay, I just want to brag. I changed a few details to hide her identity and made a new account since she knows mine. \n\nMy 18 year old nephew has an 18 year old girlfriend. They've been dating about a year now. She's had a rough life. Given up for adoption at birth, countless foster homes, forced child labor by some of them, and so on. She's got a tough outer shell that I respect and let her come out of in her own time. \n\nAlright, so it's Christmas morning and she asks if I need help in the kitchen. I didn't, but she wanted to help so I told her she can roll out cookie dough to make cookies. She asks me where the cookie sheets are, I hand her one and she goes \"thanks Aunt Jane.\" I froze for half a second but figured I must have heard wrong. Nope, because she called me that a few more times. I went to bed so happy and grateful that she thinks of me as permanent family and wants to call me that ♥️\n\nI love this girl and I'm so proud of her! Thanks for letting me brag!\n\nEdit: a few more details. I'm 28, married, with a house. It's older so I'm talking porch swing and old looking fireplace. Very \"homey,\" which is probably why she let her guard down.  It's also where we hosted Christmas. I talked to my nephew and he said she's been working up courage to do this. I'm so proud of her! She's going to be a family practice lawyer when she finishes college to help kids in the foster system. Im so honored to be a part of her life and journey ♥️\n\nAlso, I don't see them breaking up. She's made him into a man more than I've ever seen. He was raised by a single mom (my sister) so he's incredibly sympathetic. \n\nHappy new year to everyone reading this! Enjoy your family, blood related or otherwise ♥️",
    "title": "My nephew's girlfriend just called me \"Aunt\" for the first time. I'm so happy!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1577638545,
    "score": 419,
    "keyword": "man lawyer"
  },
  {
    "text": "Thwarting my step mom's plans for \"revenge\". \nMy relationship with my step mom began going down hill when I hit my teens. She began to emotionally bully me , mostly just for not thinking what she thinks and not wanting to be exactly like her. She had a lot of internalized misogyny and thinks that even if a woman has a career she should be a housewife first and a doctor/lawyer/executive next. And the man must ALWAYS be the main bread earner. In her moments of anger she would often say to me \"I'll be there to laugh at you when your kids disappoint you and act like they're better than you.\"\n\nI knew even then that I didn't want kids, but knew better than to voice this opinion, given the time and place in my life. Then when I reached financial independence, I was able to tell people I didn't want kids when they asked me when I would \"settle down\" and start a family. The reactions I got ranged from understanding to anger.\n\nWhen step mom found out about my plans she lost her ever loving shit! She told me I *had* to have kids. I *had* to go through what she went through. My dad tried to calm her down but she angrily told him to \"talk some sense into his daughter\". She then turned to me and asked what I would do when my future husband demands kids. I told her I don't want to get married either. (I'm open to the idea of marriage, if it's something my partner wants , but this was just too much fun!) On hearing this she walked into the kitchen and we could hear her throwing around pots and pans. My dad looked at me accusingly, as if to say \"thanks a lot, now I'll be dealing with this for a whole week. Goodbye peace of mind ,it was nice knowing you! \"\n\nThis happened nearly a decade ago and still makes me smile with satisfaction when I think about it.",
    "title": "Thwarting my step mom's plans for \"revenge\".",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1574196709,
    "score": 160,
    "keyword": "man lawyer"
  },
  {
    "text": "[Trigger Warning] Tomorrow, I'm facing him in court again. I'm doing it for her. Standard-- FTP, sorry for any formatting issues.  Also, this is a repost because I didn't use the TW tag correctly the first time, sorry again!\n\n\nI dated a guy for about a year that was emotionally, mentally, physically, and sexually abusive. He broke up with me (I know it’s horrible that I didn’t break up with him, but the domestic violence cycle for victims is a hell of a thing) around the time I got into my first choice doctoral program. So, I moved away to attend that program, excited for a new life. Before I moved, I started therapy because of what my ex did to me, and with my therapist’s and parents’ encouragement and support, I reported to local police what my ex did to me and moved away the literal next day. I moved about 6 hours away from where home is and started a new life. I spent so long working full time to put myself through school, and finally school got to be my job. It was really my dream.\n\n\nSo imagine my horror when, that following December, Satan (my pet name for my ex) started contacting me again. I was in a new relationship that suffered greatly because of his contact, and I want to be clear that I told him many times, in no uncertain terms, that I did not want him to contact me ever under any circumstances. He told me that he moved, and now lived within half an hour of me. This is terrifying for (hopefully) obvious reasons. I had no idea if he knew I had reported him to the police, and he is hard to predict, so it felt feasible to me that he would contact me knowing that I reported him. This started a year of unwanted contact that included phone calls, voicemails (both lewd and normal ones), and messages over various texting apps. Regardless of how many times I told him very plainly to leave me alone, he would respond with things like: 1) “Just block me.” But that wouldn’t work, because he would make fake accounts to message me from. 2) “Just stop responding.” But that wouldn’t work, because he would continue to message me regardless of whether I answered. 3) “You love this, you love the attention, don’t deny it.” ---this one disgusted me more than the other 2.\n\n\nAround this time, my mother contacted the police department that I reported the DV and sexual assault to. According to the police, they couldn’t find him to ever question him, despite having his full name, birthdate, phone number, employer, Facebook page, and parents’ address. Their response to him having moved close to me? “We don’t have the manpower to send anyone down there, sorry.” I think it’s worth mentioning that his family is prominent in that town/county, and also that after I made the report that was never investigated, the officer that took my statement was promoted. I am in no way making any causal claims here, but chronologically, this is what happened.\n\n\nNow, many people may wonder why I didn’t just block him. The reason may not make sense to people who haven’t been in an abusive relationship, but it’s the only answer I have to that question. I didn’t block him because if he was going to contact me, I wanted to know about it. I didn’t want the contact in the first place, but he knew where I worked, so he could have just walked up to my office any time. Blocking his number/accounts wouldn’t stop him from seeing me against my will, and he would make fake accounts anyway, so blocking was ineffective. He terrifies me. There are times that I did block him, but I ended up unblocking him every time because…. I mean, just imagine that the person who put you through hell and forcibly stripped away your humanity (it was a fairly violent and fully penetrative rape that I fought verbally and physically against) and who has physical access to you is trying to contact you…. wouldn’t you want to know what they were saying? I wanted to be able to know…. that’s the only explanation I have. I am scared of him, and I didn’t want to be in the dark.\n\n\nHe would call me incessantly until I answered. At one point, he called me so many times in a row that I finally just answered the call, left the call running, and put my phone in the corner of the living room while I continued my conversation with my roommate (who was and has always been aware of this entire situation). After around 15 minutes, I went to pick up my phone, assuming he would have hung up and called 30 more times. But, again to my horror, he had stayed on the line the whole time, just quietly saying my name over and over. He would leave me voicemails about what he wanted to do to me sexually. He would message me asking to get back together, which honestly baffled me that he would even think I would be open to that idea. But no matter how mean I was in my responses, or how emphatic I was that I literally did not want to hear from him ever again, he would persist.\n\n\nIt escalated when, over 2 days, he messaged me between 60-70 times without me responding whatsoever. These messages said things like, “I’d rather hurt than feel nothing at all,” and, “Can I buy some cookies from you?” This may sound innocuous, but I had just baked cookies earlier that day. I don’t know how to explain this message from him, because I don’t bake cookies frequently enough to just assume I should always have some around, but I also had no reason to think he knew where I lived. However, a Google search of my name and university (which he knew) would turn out my literal office number, and this concerned me because I didn’t want him putting my labmates, research assistants, and participants at risk by showing up to my office. Additionally, he told me in these messages that he would be moving away in 5 months, and he knew he would see me soon. I feel like these messages are disturbing for obvious reasons. So, I went to campus police.\n\n\nThey immediately took my concerns seriously and had me speak with a security specialist. Both the officer and the specialist said to me (almost a direct quote), “Some of these message are disturbing. We don’t think he’s a danger to anyone else, but he is a danger to your physical safety. Do not go anywhere by yourself, even during the day. Notify the head of your academic department and take yourself off your lab’s website.” This is devastating to my future aspirations, and I already know that I have lost out on professional collaborative opportunities because people have been confused about not seeing me on our website.\n\n\nI left the station, and within an hour, the officer that took my statement called me back to say, “I just wanted you to know that he does in fact live in XCity like he said; we found an address for him there.” (Please contrast this information with the police department near my hometown, who told me that despite having much more concrete information on Satan than the campus police, they could not locate him to question him.)\n\n\nFast forward to about 7-8 months later, and I am notified through mail that the DA where I currently live has decided to press charges again Satan based on some of the evidence I provided. I had been planning a trip home, which I still followed through with. I made another visit to the original police department to make a supplemental report. Since my original report with them, Satan had admitted guilt to me regarding sexually assaulting me through a texting app, so I provided that to police. After returning to the city I currently live in, the court proceedings started. I had a court-appointed advocate accompany me, as well as 3 close friends. Satan did not expect me to be there, and I can’t tell you how satisfying it was to roll into the courtroom that deep and see him so unsettled.\n\n\nI want to just sum up what has happened so far in court. I’ve been granted a no contact order for the duration of this case. However, due to either Satan or his lawyers either showing up late or not at all to certain hearings, we still do not have a guilty plea. At this point, we have been in court since last September and he still has not officially submitted a plea of any kind. Two absolutely fabulous DAs have been working on this case, and they have been so kind to me. They made sure I met with an investigator about a month or so ago, who collected every shred of evidence I possess of Satan contacting me. Based on this evidence, the DA’s offered plea deal is: he pleads guilty to misdemeanor harassment charges, I get an official 3-year no contact order, and we all move on. However, since he and his team have been difficult this whole time, the DAs will consider changing the plea to disturbance of the peace, which is still a misdemeanor. But somehow doesn’t feel nearly as satisfying as a harassment charge.\n\n\nRemember that supplemental report I made when I visited home? According to the DA on the current case, that police department has no record of that report being made. Cool.\n\n\nBut anyway, this has taken such an emotional and mental toll on me. It’s constant dread for weeks leading up to a court hearing, not knowing if today is the day I have to see him, be in the same room as him, get up in front of strangers and talk about the day my humanity was forcibly stripped away from me. Tomorrow seems to be that day.\n\n\nI’m sad that he took away my opportunity to enjoy graduate school. I worked so hard to get here, and I can barely function through it because immense stress starts to affect other things like your immune system, digestive functioning, working memory, and so on. I feel those effects everyday, and everyday it feels like he robbed me all over again, because I can’t enjoy the dream I worked so hard for.\n\n\nAnd every time the DA asks me if I’m ok with a change to the charges, the plea deal, am I available to come to court on Xday, and Xday, and Xday…. I want to say, “No, just forget everything, I can’t handle this anymore.” But then I have to take a deep breath and remember, I’m not doing this for me. I’m doing it for her.\n\n\nHer = the next woman he abuses. I’m not the first, and I won’t be the last, but I promise you, wherever and whoever you are, I have done everything in my power to leave a paper trail. There wasn’t one for me, but there will be for you, and I hope you push through the crippling stress, anxiety, and trauma, and know that I did what I could to make your case more credible. I believe in you.\n\n\nHer = my future daughter/children. Don’t let anyone use and abuse you. You can stand up to them, and you can ask for help, and you can be brave. If I could be brave, anyone can, and I hope my future daughter can see that in me, even though I feel like the biggest coward on the face of the planet.\n\n\nHer = my mother, who was raped by a stranger when she was 16 but was too scared to tell her parents. She never got justice. Am I getting justice? I don’t know how to answer that question, but it’s better than she ever got, and she deserves to have seen that horrible excuse for a man be put in prison. But she didn’t get to. I have to do this for her.\n\n\nHer = every single other woman who has experienced harassment and abuse at the hands of a man and they were too afraid to speak up. I understand you. I see you. It’s never too late to speak out. Believe me when I say this is by far the scariest thing I have ever done, and I dread it constantly. I’m not special, I just asked for help from the police and finally got it. You can do it too. But if you feel like you can’t, please draw strength from me, because I believe in you.\n\n\n\nEDIT: for anyone who cared, he pled guilty to disturbance of the peace, I read my victim impact statement (which I cried the entire way through), and I was granted a 3 year NCO. It’s not harassment charges, but it’s also not a trial so I’m grateful. I’m relieved. It’s over. Thank you for your encouraging comments. I’m still processing my emotions, but I am so relieved. The judge took me seriously and said to Satan, “I hope you understand completely the terms of the no contact order, because if you violate that, given what I just heard, it will be taken very seriously.”  I was finally listened to, and that is invaluable.",
    "title": "[Trigger Warning] Tomorrow, I'm facing him in court again. I'm doing it for her.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1554782068,
    "score": 146,
    "keyword": "man lawyer"
  },
  {
    "text": "Rejected a man in a position of power. Can't shake anxiety regarding possible fallout Title says it all. \n\n\nAsked out by older man I work tangentially with and who is in a position on power (ie: police officer, lawyer, CEO). I turned him down firmly and clearly but respectfully and, I have to admit, have pretty much been doing my best to avoid him since. \n\n\nHe's sent me messages that vary between hostile, abusive, and threatening and some that are apologetic and saccharine. I haven't responded because I don't think there is a good response. Anything I respond runs the risk of being interpreted as 'leading him on' or could make him angry which, considering the threatening nature of some of his messages, terrifies me. \n\n\nHe has money, I have none. He has power, I have none. I don't know how to protect myself. \n\n\nFor the sake of those who would become collateral damage as well as for my own safety, I don't feel as though I can report his behavior and I wouldn't even know who to. I just want to be left alone and for this to go away. The best case is that we politely ignore one another's existence but I doubt that outcome. \n\n\nIs there anyone who has experienced a similar situation who can offer some advice? How can I protect myself? How can I shake off the anxiety I feel about this sword of damocles? Am I massively over reacting? \n\n\nAny advice or suggestions appreciated.",
    "title": "Rejected a man in a position of power. Can't shake anxiety regarding possible fallout",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1566374055,
    "score": 39,
    "keyword": "man lawyer"
  },
  {
    "text": "Do you ever check in on your grandparents or parents records? I decided to check on mine after a long demise My grandfather passed away approximately a year ago.\n\nToday I decided to go through some of his items. I decided to thumb through some of his previous medical records in a file I found.  \n\nHe is always been pretty private about his medical conditions. Didn't ask for much in terms of advise and....well I didn't want to ask too much since he didn't want to talk about it. He would always want to drink a Lone Star when I would come visit him and bullshit with me. So, we drank beer, ate some cheese, and talked about life / women / guns / cattle / religion (The Texas pentad as we can call it) .  He was 87 when he passed away, had COPD on 4 L of home O2, A. fib, CAD with previous stents.\n\n\nWhen I entered medical school and throughout my training his COPD really started advancing.  He spent the last 3 to 4 years of his life more or less bedbound and could only walk between the couch and the bed without significant shortness of breath.\n\n\nThumbing through the records were a bit eye-opening.  It looks like his primary care doctor was more or less giving him monthly to semi-monthly methylprednisolone injections, he had a sleep study done, he had 5 echoes outpatient, an MRI brain for tremors in his last year, he had for stress test EVERY YEAR in the last 4 years of his life, and had a few CT scans of the chest when he had bronchitis.  Keep in mind, he could not walk more than 50 yards.\n\nSo with this I couldn't help but think of how everything could have went so wrong.\n\nI remember having end of life discussions briefly while talking about religion with him and he would always tell me, he is ready when it is his time to go. But looking at the advanced directives portion of the primary cares note.....this part is left blank. \n\nEven at the end of life this man was ready to go but had only talked about end of life care with my mother and my grandmother. My mother happened to have MPOA. \n\nHe fell, broke his hip and you all know the rest of the story. He was then intubated, was hard to get off the vent, sent to a LTAC and for weeks my family argued over how things would go while the brothers and sisters of my mother filed lawsuits against my mother since she was MPOA and my grandmother did not want to make a decision since they claim they never heard those wishes and that he was on benzos when he filled out any legal paperwork. Some of them kept leaning on data like his stress test looked good a year ago or his MRi brain was perfect a year ago.\n\nIn the end, my grandfather died of pneumonia, never woke up, and it ripped a family apart. Not to mention about 2 months worth of ICU stay.\n\nI tried to speak up during this but only got pushed away and eventually legal contacts from their lawyers to basically stay out of this or else risk being sued and even a phone call where he threatened to report me to the board for offering medical advise without being the attending physician. \n\nLooking through the bills from the hospital stay that medicare paid for, it totaled well over 200k for the last month of his life. That doesn't include the stress tests that were done and all the other Rxs he had prior to his death.\n\nThis whole situation has really hit home for me for my elderly patients. Now I don't wait to their annual physical to ask about advanced directives. I have seen first hand how it ripped an extended family apart and caused the slow painful death of a man who for years would tell me and my mother that he didn't want that.\n\nI don't blame any particular individual in this case. Everyone including myself could have done better and in a way contributed to the eventual outcome. I just wanted to share my story for you fellow docs can put a bit of realness to what happens when shit isn't documented and hopefully it might make us all take a second look rather than clicking that button (discussed advanced directives with patient to hit those medicare metrics).",
    "title": "Do you ever check in on your grandparents or parents records? I decided to check on mine after a long demise",
    "subreddit": "medicine",
    "timestamp": 1568685836,
    "score": 593,
    "keyword": "man lawyer"
  },
  {
    "text": "No OnE eVeR tAuGhT mE tHiS!!! Man, I swear I love what I do and wouldn’t trade it for anything.  In fact, I would probably attribute this rant to the fact that we’re in the final 45 days of the school year because at least 135 of 180 days I feel the opposite of how I’m feeling. However, today I was absolutely pissed at our seniors.\n\n&#x200B;\n\nEvery year our school board president, who happens to be a lawyer, gives a presentation to the seniors class that will be graduating in a few weeks about life after high school. Namely, their rights as an 18-year-old with due process of the law to both seemingly small things like getting a tattoo to huge things like DUIs, etc. He also provides major information regarding the legal components some of the first contracts that they’ll enter including apartments, cars, etc. Stuff that I truly wish I would have had the opportunity to just hear somebody other than my mother discuss with me.\n\n&#x200B;\n\nAs anyone who works at the secondary level can guess, however, I would wager that at least 1/3rd of the students couldn’t give the man the respect he deserved and were on their phones with their earpods/ air pods in laughing at videos in the back, etc. What’s sad is many of the students doing so where the same ones I know will likely be seeking an apartment to get out of mom and dad’s house right after graduation or will want a car in their name now, but skipped over that valuable information. I also know that as these seniors complete their requisite survey on feedback about high school next month they will also write things like “No one ever taught me about things like this.”\n\n&#x200B;\n\nI know it's not all of them, and I know that I am moreso largely venting on what is moreover a singular event that happens less than the positives, but I just needed to vent about this today.\n\n&#x200B;\n\nEDIT: I woke up this morning to a kind soul giving me my first ever Reddit Silver. Thank you kind educator! It helped get me through my day of planning state testing for my building!",
    "title": "No OnE eVeR tAuGhT mE tHiS!!!",
    "subreddit": "Teachers",
    "timestamp": 1554940878,
    "score": 593,
    "keyword": "man lawyer"
  },
  {
    "text": "People who look down on teachers  \n\nI did a Master of Arts in Teaching several years ago but decided not to pursue the profession after realizing I wasn't really cut out for it. But something that surprised me was a certain amount of disdain for the profession in some quarters, including my family. I did the degree after a five year enlistment in the Army. In my mind I was upgrading from a working class job (enlisted soldier) to a middle class job. Turns out my father did not see it at all the same way. He and my stepmother intimated that they thought I would fall in love with graduate school and switch to a PhD in history. And I'm pretty sure he told people I was in grad school for history (I took a couple of undergrad history courses as part of the M.A.T. Social Studies degree).\n\nMy dad is not a jerk in general, but I realized that he has been upper middle class his whole life. In his social set, many men married women who were teachers, but becoming a public school teacher was really unacceptable for a man. Another time I met an acquaintance of my father's, a retired lawyer. I mentioned I was going back to school and he said, \"oh, for business or law?\" I said, \"Education.\" His face dropped. The next time I saw him he treated me with a subtle disdain.\n\nSo it seems upper middle class people really tend to look down on teachers, but I suspect plenty of others who make average-ish salaries (no more than some veteran teachers) do as well. For me gender was a big part of it. When I mentioned my plans, women tended to say, \"That's wonderful.\" Men would say, \"Huh.\" Any other personal experiences with this attitude?",
    "title": "People who look down on teachers",
    "subreddit": "Teachers",
    "timestamp": 1558818124,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "[USA] [advisory] - salvaging Prince Ea's \"What is School For\"? Ok. I have a rather... unusual student in advisory (middle school). We've had a hit and miss relationship. He's reached out to me and wants me to show advisory the viral \"[What Is School For](https://www.youtube.com/watch?v=07mK-Wb2WJQ&t)\" video as well as \"[I Just Sued the School System](https://www.youtube.com/watch?v=dqTTojTija8)\". (The former is more problematic than the latter, if you only want a taste.) \n\nUgh. While I'm a fan of spoken word, and while I know and absolutely agree that the school system fails a lot of students by pushing them all to college rather than honoring their vocational choices (and let's not even talk about testing, testing, testing)... I'm concerned that a few students in the room are going to latch on to all the wrong messages in the videos. I'm not worried about the students who are driven to success. They'll see the good messages, and they'll also see how the valid points made against the school system are simultaneously valid and flawed. (Correct - you don't need to know the pythagorean theorem when you're a lawyer. But you need to know it to do higher math, which you'll need to be able to do in order to get to and through college, and you need that to become a lawyer. Also: math isn't about learning the formulas; it's about learning to *think*.) \n\nAnyway. I don't want to completely shut down this young man. I'm glad he found something to engage with, and I want him to know that I'm *listening* and respect his opinions. And again, there *are* valid points in the videos. I'm just not sure that I can use advisory time to show students videos to convince them that school is failing them. \n\nSo, how can I use these videos in a way that's actually beneficial for all my students and not just an excuse for some of them to check out of school even more?",
    "title": "[USA] [advisory] - salvaging Prince Ea's \"What is School For\"?",
    "subreddit": "Teachers",
    "timestamp": 1551929317,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "Massive gap in employment/felony? Hi, I am just entering my 30's and am currently at a crossroads in my life. I took a somewhat unconventional path that has now lead me to needing employment advice. TLDR at the end.\n\nI became a low level cannabis dealer in highschool and found it an easy way to have more than a bit of pocket change and still have freedom. When it was time to graduate i planned on moving to a large city for college. Before moving i worked at a family business for >6mo doing odd jobs. I intended to find employment after moving but time after time I didnt get past the interview process and with college loans and some money saved up from graduation money wasnt a pressing issue.\n\nEventually I made friends, sold cannabis to make ends meet and everything was fine. I eventually found a job at a pizza restaurant, around 2010 and worked there for around 6 months then took an opportunity for lab work through a program at my college. During and after this time my cannabis business became more profitable and I was learning the skills and meeting the people necessary to be a successful cannabis purveyor. After the lab work program ended I focused on college and my cannabis hustle while looking for other lab work. I found a job working at a friends shop for a while but it wasnt sustainable and went out of business shortly after. I graduated 2013 with a BS.\n\nI became quite successful with cannabis and continued with that while still (not-enthusiastically) looking for regular employment. I was also looking into further schooling looking at PHD or masters programs. I started to save more and more money and around 2016 I began looking into buying a home and starting or investing in a business. I had a little over 130k at that point. Then of course some friend of a friend found themselves in trouble and decided to snitch on me to save himself at an very bad time for me. Great timing for him though. I lost everything but about 5k after lawyers, fines, costs for assessments etc and got a 2nd degree felony. The felony will be reduced to a misdemeanor in one year and my probation will be complete. I had to spend some time in jail and was forced to move back in with a parent in my small home town.\n\nNow I am pretty much broke, with a felony and a 6 year gap in an already spotty work history. I've tried looking around for jobs for the last 1.5 years and got a few interviews but was rejected when they saw the results of my background check. Two places even offered me a job then retracted their offer after the criminal history. It isnt specific either so 2nd degree felony could mean rape, murder, theft or actually dangerous drug use.\n\nI do have excellent skills to offer, im good with communication, organization, attention to detail, product purchasing, marketing, leadership and delegating tasks, etc. and I have a BS from a great university but I am uncertain as to how to proceed. I dont really have family I am close to besides my parent who lives at the poverty line. I am a generally positive person and have always cared deeply for others but lately Im feeling a real sense of hopelessness. Any advice is genuinely appreciated. Ill try to answer any questions you may have, I tried to keep it brief and I've probably left some details out.\n\nThank you so much for taking the time to read and any guidance/advice, anything, is sincerely appreciated.\n\nTLDR; sold the devils lettuce, went to college, graduated, made money, got busted down badly, now broke, living with a parent, have a 2nd degree felony and a 6 year gap in work history, and now im sad man.",
    "title": "Massive gap in employment/felony?",
    "subreddit": "careerguidance",
    "timestamp": 1565200914,
    "score": 14,
    "keyword": "man lawyer"
  },
  {
    "text": "28 years old student almost a BA in Human Resources but don't like the work field. Feeling lost. What options do I have? Hi everyone,\n\nThis is going to be a bit longer writeup with a few personal details added to the mix; I hope to create a better picture of the situation by doing this.\n\nI am a 28 years old man from West-Europe in need of some career guidance. I live with my gf in a middle sized city with relatively high rent. I've been trying to get my bachelor degree in HR since 2013. I've worked a bit in the work field, but I'm quite sure I don't want to work in HR after I receive my degree.\n\n**Study:** Started Law school in 2011, dropped out in 2013 and started a bachelor in HR (takes 4 years). Still doing this in 2019 and will be in 2020. In 2017 I almost graduated, but I had some issues with writing my thesis and I've had some additional personal issues related to depression, anxiety, family and alcohol, so haven't done any work from 2017 to 2018, except some volunteer work.\n\n**Jobs:** from 2014 tot 2017 I've worked parttime as an advisor at a HR department (administration, advising management, some side projects), but my heart wasn't in it. When I didn't complete my thesis on time in 2017 I lost my job, because they reserved a fulltime job for me and they weren't too happy they had to find someone else because I didn't finish my bachelor on time.\n\nIn 2018 I got a job at a bank as an entry financial advisor/customer service representative with decent hours but a low income. A few months ago in September I decided to write a new thesis and continue my work at the bank, albeit in parttime now.\n\n**Personal:** There are some personal issues. Financial problems (crippling student loans, low income, high rent), my scarred resumé and my mental health. My friends are mostly successful (a handful are doctors, consultants or lawyers) and I notice that my connection to these friends is fading quickly since they're entering such a different phase in their lives, while I'm stuck, thus falling behind.\n\nI do speak with a psychologist about my problems, yet at the end of the day I'm the one who needs to take steps in the right direction. It can often feel like I'm 'too late' and have failed, yet this mindset doesn't get me an inch forward so I try to stay positive.\n\nThe other side is my complete indecision in what kind of work I want to do. The problem I see with HR is the (perceived) lack of added value to a company. I find myself unable to explain why HR is really necessary; companies often see the operational/administrative/law part of HR as a necessity, yet the advising part as superfluous since it's so hard to make the added value measurable and most of the tasks are picked up by the (middle)management.\n\n**So what do I want?**\n\nI'm trying to find out what my options are with a degree in HR. What are my chances on the market? What are my other escape options? I'm interested in the tech sector (but don't think I'm fit for coding and I miss the math fundament) and the subject of sustainability, but mostly with 'adding value', how abstract that sounds. Recruitment and sales are no options.\n\nDoes anyone of you have seen a similar situation or have suggestions to find a way to a different career?\n\nIf you've made it this far: thank you for reading and I hope to find some constructive suggestions :)",
    "title": "28 years old student almost a BA in Human Resources but don't like the work field. Feeling lost. What options do I have?",
    "subreddit": "careerguidance",
    "timestamp": 1573564736,
    "score": 4,
    "keyword": "man lawyer"
  },
  {
    "text": "Summer Internships at BigLaw (Joke) I don't take credit for this joke, as it was told to me by a senior associate at the firm where I did my 2L internship (the firm I will be joining after graduation this May).  \n\n&#x200B;\n\n&#x200B;\n\nJoke:  \n\nA lawyer dies and he goes straight to Hell (naturally).  Hell is not what he expected.  It's full of margaritas, volleyball, bikinis, and good times.  The lawyer has a blast.  \n\nHe's revived by the docs, and goes on living his life and practicing law.  \n\nHe later dies at the ripe old age of 80, and goes straight back to Hell.  This time, Hell is biblical.  It's fire, brimstone, torture, pain, and unending despair.  The lawyer goes up to Satan and asks \"Hey man, last time I was here it was fantastic.  What the Hell?\" (pun intended)\n\nSatan replies: \"Oh yea, that was just our Summer program.\"\n\n&#x200B;\n\nHave fun everyone!!! Take this joke in good taste.  Learn a lot, and get those offers!",
    "title": "Summer Internships at BigLaw (Joke)",
    "subreddit": "LawSchool",
    "timestamp": 1552617457,
    "score": 437,
    "keyword": "man lawyer"
  },
  {
    "text": "On Public Interest: A Message to Rising 1Ls Hello! This is a post for people starting law school who are interested in/committed to public interest legal careers. Lengthy, but I will let the masses decide if it's worth the read or not.\n\nA lot of you are going to law school because you want to save the world. [Maybe it's Trump](http://www.abajournal.com/news/article/the_trump_bump_for_law_school_applicants_is_real_and_significant_survey_say). Maybe it's a personal, pet cause. [Maybe it's something in your own life that led you to this place](https://ctmirror.org/2019/08/02/from-prison-to-practice-connecticut-man-hopes-to-start-bar-association-for-formerly-incarcerated-lawyers/?utm_source=The+Marshall+Project+Newsletter&utm_campaign=8c7a234b2d-EMAIL_CAMPAIGN_2019_08_05_12_15&utm_medium=email&utm_term=0_5e02cdad9d-8c7a234b2d-174468977). Whatever it is, please take a moment to read this, not because I'm some glorious prophet/orator, but because it's something that everyone should hear when they embark on this journey, and because I wish someone had taken the time to tell this to me and my classmates.\n\nYou have made the right choice and are doing the right thing. That might sound like simplistic back-patting, but I'm telling you that because you may not hear it much over the next several years. You are going into an environment that is going to be a very quick and sudden shock to your system. You will learn all about firm culture very quickly, because it's what so many stories, and so much instruction, revolve around. Salaries, partner demands, professionalism pep talks, stories about client interaction -- these will all trickle down to you from professors and professional speakers and mentors. Most of your classmates will not feel like you do.\n\nSure, your school will at least nominally recognize public interest work. However, over time, you're going to face either the unconscious or conscious effort of the collective legal world to turn you away from that. So many of your case readings will be about classic civil money disputes. People will start murmuring about something called \"OCI\" -- I have finished law school and been practicing for many years, and I still have no idea what OCI is. Your first year writing professors will always talk about writing in the context of memos/conversations between a \"first year associate\" and \"partner.\"\n\nIt will be very easy to get sucked into that world. It will seem prestigious, and -- who knows? -- it probably is. It will seem like it's well-paying, and indeed it is! Even if you're not interested in this world at all right now, you're going to find yourself mentally putting yourself in that setting and environment at some point, and wondering what it would look like. This will start with basic first year projects, it will increase with internship searches, and probably get even stronger when the time comes to think about jobs.\n\nSo, the reason I'm telling you that you've made the right choice and are doing the right thing is because you will struggle with whether that's actually true. People will, at least lightly, mock you at various points. The legal world will steer you away. Don't let it happen unless it turns out that's what you really want. Only you can say whether the salary and work type is worth it when you think about family, loans, job availability, and all sorts of other wrinkles in your life. But, the way you feel now is what should dictate what you do. You know that confident, purposeful way that you feel now about helping people in need? If you picture yourself in that classical firm world in a couple of years and don't get that same confident, purposeful feeling, stay strong. Whether its indigent people accused of crimes, poor people who need civil help, consumers, the environment, immigrants, animal rights, all sorts of things -- the world needs you too much. Maybe more importantly, if that's what you need to feel happy, you need that too much.\n\nThere are two things you can do with a law degree: help people who have something get more, or help people who have nothing get something. Many of you have made that choice already. Stay strong.",
    "title": "On Public Interest: A Message to Rising 1Ls",
    "subreddit": "LawSchool",
    "timestamp": 1565292246,
    "score": 119,
    "keyword": "man lawyer"
  },
  {
    "text": "LSAT will change for all would-be lawyers as a result of blind man's lawsuit settlement",
    "title": "LSAT will change for all would-be lawyers as a result of blind man's lawsuit settlement",
    "subreddit": "LawSchool",
    "timestamp": 1570801039,
    "score": 5,
    "keyword": "man lawyer"
  },
  {
    "text": "Need big time help with character and fitness- felony I was innocent of My limited license application is due today and I need some serious help explaining an event \n\n5 years ago I was living with my boyfriend and police came in with a warrant. They tore our apartment  apartment. At the time I was 4 months pregnant and in my last semester of college. They suspected he had been trafficking narcotics. I was not named on the warrant at all, or even on their radar. \n\nAfter conducting a lengthy search, with about 10 officers (for a 500 sq ft apartment) and canines they found 2 “incriminating ” things: 1. A single pain pill 2. A small amount of white powder. \n\nI want to make clear that I had NO indication what so ever of any illegal activity going on on his end, or in our apartment. I do not and have never use drugs. I do not like drugs. I never saw him doing anything suspicious. I knew I was innocent and I had serious doubts about the accusations against him as well. There were no red flags suggesting he was involved in drug related activity.  However, I realize they had a valid watch warrant so I now question what he was doing outside of our apartment. \n\nThe police charged both of us with possession of narcotics and trafficking. They did not arrest me. My lawyer told me that they only charged me to ensure I would not try to say anything belonged to me- he was the target. \n\nI was not indicted on the trafficking charge, and I don’t think he was either (this was 5 years ago so it’s hard to remember ) After the grand jury proceeding it was revealed what I had known to be true  all along- that there were NO illegal drugs found in the apartment. The single pill found was for a valid and active prescription he had after suffering a serious injury at his job, which resulted in surgery (his hand was smashed between a printing press). The small amount of loose white powder came back also as NOT being a drug. I honestly think it was roach poison that the maintenance man put in our apartment (that’s embarrassing  but the truth.  we were extremely clean - I’m a neat freak- but our neighbors on the other side of the wall were filthy and eventually evicted for the condition of their apartment) the possession charge was eventually dismissed by motion of the prosecutor.   End of day, both of us were cleared of any drug involvement. \n\n(Him and I are no longer together although we have a beautiful child together! ) \n\nWith all of that being said, I’m not sure how to discuss this on character and fitness. I wrote an explanation when applying to law school, but everything I’ve read online  for character and fitness said take full responsibility and don’t make excuses. But the thing  is I TRULY did not do ANYTHING wrong here.  I honestly feel like the victim here. The police treated me horribly (I had had my blood drawn day before at doctor since I was pregnant and they insinuated I was shooting up drugs because I had a single needle mark in my arm! I don’t even smoke weed!!! They also used racial slurs and were extremely hateful when they didn’t find what they had anticipated.)  It is very hard for me to take responsibility for this incident because I was innocent of it. But I don’t want to fuck up my application. Any suggestions?",
    "title": "Need big time help with character and fitness- felony I was innocent of",
    "subreddit": "LawSchool",
    "timestamp": 1555687765,
    "score": 3,
    "keyword": "man lawyer"
  },
  {
    "text": "Should I stay or should I go? (Queue the music ladies and gents) Hey guys, long time lurker here!!!\n\nSo I need advice. Im at a T100 school (very close to T50) with an 80% scholarship (about 70k in loans a year-- I know. Yikes), that I came to specifically for its great program in my interest area, and the fact that its so close to relatives that I've never lived near before. This involved me uprooting my life, moving across the country, and now living in honestly a horrible city I have no interest in staying in. Its been rough since I have started. I hate the amount of readings, hate the other law students (I have solid friends here), and hate the city. I figured this out pretty quickly on, but decided that I needed to take classes more in my field to really decide.\n\nAs the semester went on.. I really just hate it here. I dont think its worth the amount of debt, I dont want to live on this side of the country (which is where my jobs are guaranteed), and im pretty confident that my grades will be VERY on the median. I did horrific on my first memo (which I know is pretty standard- but man did it shake me a bit). At this point, I am ready to cut my losses. I went straight from undergrad to law school, and I don't think I seriously considered what being a lawyer meant. I dont think I want this career path of being surrounded by lawyers or even working a law job.  \n\nI guess my question is, do you think I should quit? If so, should I stick it out the full year or leave now?\n\nI have some financial issues, since I am running out of student loans and this requires re-uprooting my life and moving back home. I dont think my parents can afford to assist me much, and I am nervous about trying to make this move before Christmas (I already have flights home and then back to school- so I would just need to purchase one more flight back home). This means Ill have to return in January to move my things. This will probably cost me around 6k, and I haven't spoken to my apartment complex about their policy on ending leases early. If I hold out till May, I could have more time to figure out this financial burden, and more money in general from money I got from both of these loans to manufacture this move. It also means ill have more loans to pay off in the future.\n\nI guess im mad at myself, and frustrated with this process, and just need tips about what to do next. I'm not a quitter, and this has been really tough on my pride admitting that I really despise this place. Please throw your worst at me-- Im ready!",
    "title": "Should I stay or should I go? (Queue the music ladies and gents)",
    "subreddit": "LawSchool",
    "timestamp": 1573455590,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "Feminists say that there is no sexism against men, because men don't suffer institutional discrimination. In fact is males, rather than females, who suffer the vast majority of institutional discrimination. This post was originally submitted by u/Vwar. For new subscribers, here it is again. Indeed, the fact of institutional discrimination against men must be repeated again and again until it is realised by all.\n\n---\n\nI don't believe that males have ever been \\[privileged\\]([https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122](https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122)) in the way feminists claim.   But we are now at the point where the deck is stacked against males at every stage of their lives and in almost every major institution.   \n\nWhen a male is born he can have his genitals mutilated. Hundreds of baby boys die from this procedure every year.\n\nThen comes primary school, where boys are often punished and even drugged for displaying natural boyish behavior. Recent studies have also revealed that female teachers mark down boys by an average of 20 percent for the same work.\n\nHuge numbers of boys are now being raised without fathers (including about 99 percent of school shooters, funny how we never talk about that), and since pedo hysteria has chased male teachers out of primary school, boys often don't have any male role models until much later in life.\n\nBoys only clubs (eg the Boy Scouts) are being eliminated while girl only clubs remain.\n\nTeenage boys are being introduced to blatantly misandrist concepts like \"toxic masculinity,\" with narry a word about toxic femininity and nothing about the positive aspects of masculinity.\n\nNext it's off to University, where there are a range of female-specific scholarships and programs even though women make up the majority of college students and young women are now out-earning young men. They are also portrayed as rapists in waiting, and there are entire departments (gender studies) devoted to demonizing their sex. If a young man pisses off a young woman (eg dumps her after a one night stand) he faces the possibility of being subjected to a false accusation and a feminist Kangaroo court. Then it's bye bye academic career and social reputation.\n\nIf he wants to vote he will have to sign over his body to the state (selective service).\n\nIf he gets a woman pregnant he will not have the option of legal parental surrender. While a woman can just drop off the baby at a safe haven, the man is on the hook for 18 years of child support and will be locked up if he loses his job and can't pay.\n\nIn the workplace things are just as bad. Men perform almost all of the dirty and dangerous jobs and make up 95 percent of workplace injuries and deaths. If a white man wants to pursue a more respected career he faces racial and sexual discrimination in hiring due to corporate \"diversity\" measures and quotas. A recent study in...I think it was Australia found that \"blind hiring\" practices (where the employer doesn't know the race or sex of the applicant) result in more straight white males being hired; this means that it is straight white men who are now suffering discrimination in the workplace.\n\nWith MeToo, a man can be fired from his job simply for making a woman uncomfortable. There have even been cases of men being fired for telling a naughty joke.\n\nIf he gets married and the wife divorces him through no fault of his own he will likely be treated like shit by the family courts unless he can afford a high priced lawyer. There are countless stories of men effectively being turned into indentured servants by their ex-wives; they live in poverty and seldom see their kids while the wife gets a new \"baby daddy\" and lives high on the hog. NOW, the largest feminist organization in the world, continues to oppose shared parenting even though every single study shows it to be in the best interests of the children, the father and even the mother.\n\nHe will receive less social support, less health care spending, and be relentlessly demonized in the media. \n\nIf a male is sexually assaulted by a woman he will probably not receive justice; the perp will likely get a slap on the wrist even if the victim is a boy.  \n\nIf he commits a crime or is falsely accused of a crime he will be treated much, much more harshly by the criminal justice system.\n\nI could go on.\n\nIt is a myth that feminists think the sexes are equal. Their MO goes like this: if men are ahead in some area, that means women are being oppressed because the sexes are identical except for genitalia; however, if women are ahead in some area that's because women are superior. You can find this sentiment going back to the first wave. Elizabeth Cady Stanton claimed that women are \"infinitely superior\" to men.\n\nThe prison thing is perhaps the most glaring example of feminists not practicing what they preach. If they were serious about equality they would be demanding either that men be treated with more compassion/leniency or that women be treated more harshly (or some combination of the two). Instead, they want women to be treated even \\*more\\* leniently, and some are even advocating for the complete abolition of female prisons.\n\nMen are increasingly second class citizens not only in a social but legal sense. A study in the UK determined that if women were treated like men by the criminal justice system, fully half of all prisoners would be female. Women do NOT commit less crimes than men (though they do commit less homicides), they just don't get punished to anywhere near the same extent.\n\nIf feminism were an \"equality\" movement they would not be trying to privilege females in every single institution.    They would be looking with a keen eye at areas in which males are disadvantaged and/or subject to institutional discrimination.   They certainly wouldn't blame everything on some nebulous all-encompassing \"patriarchy\" that hasn't even been proven to exist.  \n\nAdvocates of gender equality must reject feminism, and support men's rights.",
    "title": "Feminists say that there is no sexism against men, because men don't suffer institutional discrimination. In fact is males, rather than females, who suffer the vast majority of institutional discrimination.",
    "subreddit": "MensRights",
    "timestamp": 1551253860,
    "score": 517,
    "keyword": "man lawyer"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 509,
    "keyword": "man lawyer"
  },
  {
    "text": "People constantly overstate the extent to which women were \"oppressed\" in the past. People constantly quote that \"women didn't have the right to own property\", \"women were chattel\", \"women were allowed to be abused, beaten and raped by men\", \"women didn't have the right to vote\", \"women were kept out of male-dominated industries\", \"women were oppressed by men\", etc.\n\nAll this is bullshit.\n\nUnder coverture, single women otherwise known as \"femme sole\" did have the right to own property, had the right to enter into contracts, and overall had the same rights as single men. It was only when they married that they sacrificed some of their rights to own property and enter into contracts on their own.\n\nWhen a woman got married she was considered a \"femme covert\" and her existence was consolidated into that of the man's. People constantly take this to mean that she was chattel, owned by men but this was not the case. Once they were married, women were entitled to be supported and to have the portion that she brought into the marriage managed by their husbands, to the best of their ability. Women had the right to buy necessaries on their husband's credit as their husband's agent. Women could not be prosecuted for most crimes and their husbands would be prosecuted in their stead. Women were immune from liability for debt. They were not in any way chattel, they definitely had less agency, but at the same time they were entitled to protections and privileges and it was considered the man's duty to provide said protections and privileges for them. Women have very frequently sought redress in common law and equity courts when husbands failed in their duties.\n\nMarried women were also not allowed to be abused unlike what people think. The laws allowed for mild correction such as spanking the way you would a child at the time but husbands were not allowed to beat their wives black and blue. A woman could obtain a surety of the peace bond to ensure her safety from a violent husband.\n\n[https://lonang.com/library/reference/blackstone-commentaries-law-england/bla-115/](https://lonang.com/library/reference/blackstone-commentaries-law-england/bla-115/)\n\n[https://www.legalgenealogist.com/2019/02/12/the-defense-of-coverture/](https://www.legalgenealogist.com/2019/02/12/the-defense-of-coverture/)\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nYes, women didn't have the right to vote for most of history, but neither did men. Property owners had the vote, the vast majority of men did not. Male suffrage was something that was fought for, and when men did end up getting the vote before women it wasn't necessarily because of discrimination against women. It was because the vote at the time was seen as a direct extension of men's obligation to be conscripted and fight in war, something which women were not obligated to do.\n\nSomething that makes this even more muddy than it already is is that: the reason why votes for women took so long to be implemented was that the majority of women did not want the vote. There were many anti-suffragette societies, and a fair amount of them were led by women.\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\n[https://www.npr.org/sections/npr-history-dept/2015/10/22/450221328/american-women-who-were-anti-suffragettes](https://www.npr.org/sections/npr-history-dept/2015/10/22/450221328/american-women-who-were-anti-suffragettes)\n\n[http://nationalhumanitiescenter.org/pds/gilded/power/text12/antisuffrageassoc.pdf](http://nationalhumanitiescenter.org/pds/gilded/power/text12/antisuffrageassoc.pdf)\n\nWomen were allowed to work in a lot of male-dominated industries. Guild-type work was always open to single women and windows. In fact there is a lack of evidence of anything preventing women from working. An article (which I've linked below) says:\n\n\"For most girls, becoming a blacksmith was probably not a dream. Husband, family, home: those were the pursuits of a young woman of the eighteenth century. Finding a woman or women working at all outside the home, much less in a male-dominated trade, most likely meant the dream wasn't shaping up the way they'd hoped. Some women worked because they had no choice.\"\n\n\"Though there was no system of standards governing the trades in the colonies, the method of learning a trade generally followed the apprenticeship guidelines established by the guilds in medieval England and Europe. Women were not excluded from membership in any of the earlier guilds. The Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\"\n\nThe paragraph below is a quote from a redditor \"w1g2\" who made a really good point regarding work, and women's involvement in it.\n\nWas it a social norm that most women did not seek out careers as they do now? Sure, I don't doubt it. But women did not have access to reliable birth control (because it hadn't been invented) so unless they wanted to spend the entirety of their life chaste, would have to plan for many of their years being filled with pregnancy, childbirth, breastfeeding, etc. Not to mention, quite a lot of the jobs available weren't in nice air- conditioned offices but involved hard labor or danger like becoming a doctor (working with the near dead, sometimes even people with a plague) or a lawyer (working with criminals, especially when prisons did not have as nice standards for living). Maybe it's the case that in different environments, people, including women, will have to react accordingly to different things and maybe it's understandable that in an environment that used to have far more risk and danger and death and with little knowledge or control over fertility, women wanted different things than they do now.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nSo. Women were not nearly as \"oppressed\" as people seem to think they were. There was never a patriarchy holding women down. Were there burdens, obligations and disadvantages? At times, yes. But these usually did not run one way - men too had their own set of burdens. And whenever I mention this to people it's met with handwaving or sometimes outright denial of the evidence.\n\nIt seems to be very hard for a lot of people I've seen to believe that women had a lot more privilege and social power than previously believed, and that men had obligations imposed on them.",
    "title": "People constantly overstate the extent to which women were \"oppressed\" in the past.",
    "subreddit": "MensRights",
    "timestamp": 1553409291,
    "score": 408,
    "keyword": "man lawyer"
  },
  {
    "text": "A compilation of evidence debunking feminist historical revisionism. I have made a post somewhat similar to this before but I've since collected a lot more information about these topics and so I believe warrants yet another post.\n\n*Myth #1: Women weren't allowed to work.*\n\nMost documentation from the past heavily implies that people attempted to avoid working as much as possible. Even so, many women did work (mostly because they had no choice but to) and there has never been a law restricting women from working.\n\n\"Though creative research has produced evidence of women working at male-dominated occupations in the eighteenth century and before, there is undoubtedly more documentation out there, in newspapers, diaries, legal proceedings, and prints. What is more compelling is the lack of documentation that women were not allowed to work. Although religious practices and social norms might have restricted certain activities in some parts of the world, there were no laws prohibiting women from working a trade.\"\n\nAt the time, only members of a trade guild (associations of producers that trained craft people, maintained control over production, regulated competition and prices) were allowed to sell their goods or practice their skill within the city. Non-guild members were prohibited from selling competitive products. An aspiring master would have to pass through the career chain from apprentice to journeyman before they could be elected to become a master tradesman. They would then have to produce a sum of money and a masterpiece before they could actually join the guild. If the masterpiece was not accepted by the masters, they were not allowed to join the guild, possibly remaining a journeyman for the rest of their life.\n\nWomen were not barred from any of the trade guilds in Britain at least as far back as the 1400s. Apprentice forms for guildwork had spaces left blank to insert 'he' or 'she', though girls who chose this traditional route to mastery of a trade (which was extremely long and arduous) were usually orphaned and had low prospects for marriage, thus they were going to need to work.\n\nMarried women, though, had the privilege of circumventing the long, onerous, arduous process of trade certification as they could receive the master tradesman status from their husbands and thereby continue his work, even take on apprentices to train (which suggests that the social assumption was that wives would learn enough about their husband's business and trade to be able to at least continue to oversee it after he died). Lots of widows continued to run their husbands' businesses long after their death.\n\nThe Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\n\nA 1770 publication called *The Tradesman's True Guide or a Universal Directory for the Towns of Birmingham, Wolverhampton, Walsal, Dudley and the manufacturing village in the neighborhood of Birmingham* carried exhaustive lists of tradesmen and tradeswomen alphabetically by name and by trade, and there are women listed in every trade from butcher to wire drawer.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nReally, very little I've seen shows that women were maliciously \"kept out\" from trades or professions that they wanted to enter into. It may have been a social norm that most women did not seek out careers as they do now, but looking at the histories of the first women to enter into medicine, law, etc, show that they hardly faced any resistance in doing so.\n\nIn 1847, Elizabeth Blackwell became the first woman to attend medical school in the US and was the first woman on the Medical Register of the General Medical Council. She sent applications for admission to twelve of the most promising institutions in the northern states, and her application was accepted by the medical department of Geneva University. Feminist revisionist history \"explains\" that she was only admitted to the college by the evil men as a joke, but as will be amply demonstrated this is the opposite of what actually happened.\n\nIn fact, the student body sent her a letter to welcome her:\n\n>At a meeting of the entire medical class of Geneva Medical College, held this day, October 20, 1847, the following resolutions were unanimously adopted:–  \n>  \n>Resolved – That one of the radical principles of a Republican Government is the universal education of both sexes; that to every branch of scientific education the door should be open equally to all; that the application of Elizabeth Blackwell to become a member of our class meets our entire approbation; and in extending our unanimous invitation we pledge ourselves that no conduct of ours shall cause her to regret her attendance at this institution.  \n>  \n>2. Resolved – That a copy of these proceedings be signed by the chairman and transmitted to Elizabeth Blackwell.\n\nShe describes this letter as one of her most valued possessions, and in her autobiography she states that the men of the college supported her 100% and beyond.\n\n\"The behaviour of the medical class during the two years that I was with them was admirable. It was that of true Christian gentlemen. I learned later that some of them had been inclined to think my application for admission a hoax, perpetrated at their expense by a rival college. But when the *bona-fide* student actually appeared they gave her a manly welcome, and fulfilled to the letter the promise contained in their invitation.\"\n\nShe also notes that the general public also had a favourable view of a woman entering into medicine.\n\n\"The admission of a woman for the first time to a complete medical education and full equality in the privileges and the responsibilities of the profession produced a widespread effect in America. The public press very generally recorded the event, and expressed a favourable opinion of it. Even in Europe some notice of it was taken, and 'Punch' showed his cordial appreciation by his amusing but friendly verses.\"\n\n[http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III](http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III)\n\nThere are also other examples of women entering into \"male\" fields and encountering little resistance. There's the example of Arabella Mansfield, the first female lawyer in the United States. Although by Iowa law the bar exam was restricted to \"males over 21,\" Arabella Mansfield took the exam in 1869, passing it with high scores. Mansfield challenged the state law excluding her, and the Court ruled that women may not be denied the right to practice law in Iowa, admitting Mansfield to the bar.\n\nOr Ada Lovelace, who was encouraged in her mathematical ability from a young age by her parents and received the best of tutors to increase her ability. She worked with Charles Babbage on his Analytical Machine, though they both \"fell into historical obscurity, and the Analytical Engine was unknown to builders of electro-mechanical and electronic computing machines in the 1930s and 1940s when they began their work, resulting in the need to re-invent many of the architectural innovations Babbage had proposed.\"\n\nOr Amelia Earhart, who was flown \"like a sack of potatoes\" by pilot Wilmer Stultz across the Atlantic in her 1928 transatlantic flight, and immediately became a celebrity, wrote a book about the experience, was used to endorse products, and dubbed 'Lady Lindy'. There is a plaque that marks where the plane landed in Wales. All the fervour over it was solely because she was a woman who crossed the Atlantic regardless of the fact that she didn't do any flying at all in her 1928 flight (She did, however, go on to complete a transatlantic solo flight later on in 1932).\n\n[https://en.m.wikipedia.org/wiki/Amelia\\_Earhart](https://en.m.wikipedia.org/wiki/Amelia_Earhart)\n\nOr, for a very long-ago example of this, Murasaki Shikibu from Japan around the year 1000, who listened at the door while her brother received lessons in Chinese writing and through that learned it herself. She was far from reviled for being a woman who knew Chinese and was commissioned by the Empress to write the Tale of Genji, a classic work of Japanese literature often called the world's first novel.\n\nOh, the o p p r e s s i o n .\n\n*Myth #2: Marriage was an institution created by men to oppress women. Men were disproportionately given privilege and power and women were treated like his property in marriage.*\n\nAgain this is a bastardisation of the past. Feminism has to stop treating men as the enemy and as the source of all women's (and also men's) problems. They need to realise that things weren't always as they are now, and realise that it was not Patriarchy or men that restricted the choices of both genders and forced them into strictly defined roles, but that these roles came about because it was the best way of arranging societies in the past - a past that was much harsher and more unforgiving than it is now. A past in which there was more work to do than there were hours in a day. A past where men spent most of their short lives working like mules to support themselves and their families and women spent most of their short lives incapacitated by childbirth and child-rearing. A past in which we sent children into coal mines that ruined their lungs and into factories which lost them limbs. Things sucked, and the reason it was bearable at all back then was *because* of the gender roles.\n\nMen were not the ones who relegated women to the domestic sphere or kept them dependent on men. Biology did. A woman at that time could not simply strike out on her own and do whatever she wanted. For most of history we had no reliable birth control, no safe abortion, no maternity leave, or social security, and most public sphere work back then involved hard labour. And if you were a woman back then who wanted to be able to have sex, then you would have had to plan your life around the idea that you would be getting pregnant, giving birth, and breastfeeding for most of your adult life - and that would have meant you could not be a reliable enough worker to support even yourself, let alone a child, and it would inherently have made you dependent on other people to help you. Until the last 100 years or so, most women could not have lived a life of children and public sphere work, independent of a man (and not all can today, realistically).\n\nEven with support, most women in poor and middle class families had to work because that was the only way to make enough money to live.\n\nSo in a time when single motherhood was a one-way trip to the gutter, marriage was a practical arrangement. The function of marriage was not to oppress women, but to positively assign paternity inasmuch as possible, and then obligate the men so assigned to their children and the mothers of their children. For life.\n\nThe taboo on sex outside of marriage (which was applied to men no less than women) made it difficult for an unscrupulous man to cheat the system. These rules surrounding marriage also mitigated the problem of paternity uncertainty, which maximised men's willingness to invest in their kids. \"I know these are my kids, so I will work hard to feed and shelter them.\" And the reason why we kept lifelong monogamous marriage for so long is because it increased the resources which would have been available to offspring, providing a healthier environment for children to grow up in.\n\nSo when a man married a woman, he was legally obligated to feed, clothe and shelter her and any children produced in the marriage to the best of his ability. Unlike what feminists seem to think, he could not sell her. He could not return her for his money back. He could not drop her at the local midden heap. He could not destroy her the way he could his actual chattels. He could not trade her for a better one. He could not legally neglect her.\n\nJust to make things crystal clear, here is a summary list of entitlements that women enjoyed in marriage (and after marriage) during the old \"patriarchal\" system of the past.\n\n1. When a woman married, she had to hand over her property to her husband's care (again, NOT because she herself was property, but because he was administrator of the family), but he OWED her not just a living, but the best living he was financially capable of providing for her. A wife was entitled to be maintained by her husband.\n2. Though women did not have the right to enter into contracts in their own name in marriage, women had the privilege of the Law of Agency, giving them the legal right to purchase goods on their husbands' credit as their agent. If the wife racked up debts that the husband couldn't pay, she was immune from liability for the debts she racked up - that liability fell to the husband instead.\n3. Women had the entitlement of being protected from prosecution for any number of crimes if they could prove their husbands were aware of said crimes. In which case, he would be prosecuted in her stead--not just held AS responsible as she was, but held solely responsible for her actions. This allowed married women to displace accountability for a large number of offences onto their husbands. \"She's out of control and does what she wants, regardless of my wishes,\" was not a valid legal defence for those men.\n4. Women were exempt from paying taxes, and there was an entire female underground economy of barter and trade that was not subject to taxation or government interference. Even when married women gained the right to hold property within marriage, it was their husbands who were responsible for the taxes owing on it, and it was their husbands who were held 100% financially liable for providing all necessaries to the family, including the wife, even if she made more money than he did.\n5. After divorce, men were held fully financially responsible under the law for the ex-wife and kids. Divorced women were entitled to be supported by their ex-husbands to a level commensurate with the husband's for potentially the rest of their lives unless she remarried.\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nThat doesn't sound at all like women were treated like property to me.\n\nI'm sorry, but if I have property, I have no legal duty of care toward the actual property I own, nor any obligation to commit to own it until death. I can smash my property on the ground and treat it however I want and it would be my right to do so. Men could not do any of that to the women they were married to. They had obligations towards them to provide for them - even after divorce, and to protect them - even from the consequences of their own actions. Wives had no such obligation towards their husbands - they were entitled to be the ones who were supported. Because the purpose of marriage in the past was not to oppress women and make them the property of men, but to ensure that women and their children could be provided for and protected, and to place the responsibility for that provision and protection on the man even at cost to his own wellbeing, health, and even life. This has been the case since time immemorial.\n\n\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"\n\nEphesians 5.\n\n[https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV](https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV)\n\nIn fact, many of the supposed \"privileges\" men had in marriage in the past were to help them carry out their obligations and to prevent them from becoming wholly onerous.\n\nIf a man had an obligation to be accountable for provision for his wife and children and to maintain family finances, it stood to reason that he also should have the entitlement of having control over any assets of his marriage, including those his wife brought into the marriage, because he was the one who had a responsibility to keep the entire family afloat and to increase their holdings.\n\nIf a man was responsible for the protection of his wife and children to the point where he could be legally required to stand between his wife and the law within numerous contexts, and be punished in her stead (whether she contracted debts he couldn't pay or committed a crime he would have to answer for), it makes sense why he would be considered head of household and why his family would need to obey him as well as abide by the restrictions he placed on them.\n\nIf, upon divorce, a man would be held solely responsible for the maintenance of his wife and child, it makes sense why he would get custody of the child that he was supporting, as well as ownership of assets so he could satisfy that obligation.\n\nWe gave men these rights and privileges because they were the tools that he needed to satisfy his responsibilities. And in that way there was a balance. \"Women \"got less\" because their obligations and accountability were less, their responsibility was less. Men \"got more\" because the buck stopped with them, whether that buck consisted of a sack of coins or his blood.\"\n\n*Myth #3: Men were allowed to beat their wives with impunity.*\n\nIn the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\n*Myth #4: Husbands were owed sex with their wives. Marital rape was not illegal, and marriage as an institution was based around rape of women.*\n\nThe idea at the time was that there could not be such a thing as marital rape because as a married person you are owed sex from your spouse, i.e. conjugal rights. This applied to both men and women. People who believe that conjugal rights \"allowed husbands to rape wives\" and not the other way around haven't actually done any research.\n\nIt was based on the idea that **both parties** had a right to sex in the relationship, and this was exercisable in law by each partner in a marriage.\n\nThe Bible said:\n\n\"*It is* good for a man not to touch a woman. **2** Nevertheless, because of sexual immorality, let each man have his own wife, and let each woman have her own husband. **3** Let the husband render to his wife the affection due her, and likewise also the wife to her husband. **4** The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.* **5** Do not deprive one another except with consent for a time, that you may give yourselves to fasting and prayer; and come together again so that Satan does not tempt you because of your lack of self-control.\"\n\n[https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV](https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV)\n\nDo note the specific passage where it says \"The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.\"*\n\nAnd here's a quote from an article detailing the history of sex and marriage.\n\n\"A hundred years ago or so, if you took the statute books literally, the only people entitled to have sex with each other were people who were legally married. All other sex was against the law. Fornication (sex with unmarried people) was illegal; so was adultery (sex with a married person—but not the person you yourself were married to). Cohabitation—living with someone in a sexual relationship—was against the law, except for people who were legally married. Enforcement was, shall we say, something less than perfect. At times, it was almost nonexistent. And the rules were riddled with exceptions. Sodomy, on the other hand, was quite a serious crime; and the full weight of the law sometimes came down heavily on people who had gay or lesbian sex.\"\n\n\"Married people were not only *entitled* to have sex; they were, in a way, *required* to have sex. Of course, nobody checked on whether John and Mary were having sex every night, or once a week, or once a month, or never. But if either John or Mary did not perform at all, for whatever reason, the frustrated partner had grounds for divorce; or even perhaps an annulment.\n\n[https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking](https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking)\n\nHusbands faced divorce if they were impotent and unable to consummate the marriage, though charges were usually made years after the wedding day. There was a similar charge of frigidity for wives, but it seems that wives charging their husbands for impotency was far more common. Husbands had to show an erection to a court audience and sometimes attempt to perform sex with their wives as well.\n\n[Source 1](http://www.bu.edu/law/journals-archive/bulr/volume89n5/documents/HOFFMAN.pdf) [Source 2](https://www.theparisreview.org/blog/2016/05/18/the-hard-on-on-trial/)\n\nBeing incapable of performing sex for your wife could merit corporal punishment. One medieval husband wrote about his unhappy marriage and his impotence in a book called The Lamentations of Little Matheus.\n\n\"My wife wants it, but I can’t. She petitions for her right. I say no. I just can’t pay.\"\n\n\"Even given his sexual incapacity, Matheolus was subject to corporal punishment:\n\n\"Acting as her own advocate, Petra {Matheolus’s wife} puts forward the law that if a shriveled purse {scrotum} can’t pay because it’s empty, under statute recompense for that injury is corporal punishment.\"\n\n[https://www.purplemotes.net/2015/05/03/matheolus-church-wife/](https://www.purplemotes.net/2015/05/03/matheolus-church-wife/)\n\nSo what does this show? It shows that both parties had an obligation to provide the other partner with sex during the marriage, and could not deprive their spouse of it. If it was an issue, it was not an issue that solely affected women.\n\n*Myth #5: \"Men had the vote and women did not. Women's suffrage was a matter of women as a united group fighting for their rights against the evil men that kept it from them. Suffragettes were champions of equality who got women the vote. Etc, etc.\"*\n\nReally, I'm very tired of hearing this one.\n\nIn Britain, the right to vote was not only restricted by gender, but also by class. Property owners had the vote, the vast majority of men did not. In 1830, just 3% of the population had the right to vote.\n\nDuring this time, there were a few groups who were fighting for the vote to be extended to them, and one of these groups were the Chartists, who were active from 1830 to 1868. They were fighting for broad electoral reforms including:\n\n* a vote for all men (over 21)\n* the secret ballot\n* no property qualification to become an MP\n* payment for MPs\n* electoral districts of equal size\n* annual elections for Parliament.\n\nThey presented three huge demonstrations to Parliament, and their requests were denied every time. The restrictions were relaxed but not abolished. Benjamin Disraeli said when introducing the Second Reform Act of 1867: \"We do not live – and I trust it will never be the fate of this country to live – under a democracy. The propositions which I am going to make tonight certainly have no tendency in that direction.\"\n\nThere were also the suffragists and the suffragettes, who were fighting for the vote to be extended to women. Suffragists emerged in the mid-19th century and believed in peaceful, constitutional campaign methods. In the early 20th century, after the suffragists failed to make significant progress, a new generation of activists emerged. These women became known as the suffragettes, and they were willing to take direct, militant action for the cause.\n\nHowever, a huge amount of women disagreed with women's suffrage. So many women objected to the franchise being imposed on them that in the mere 18 months leading up to a 1910 parliamentary debate on women's suffrage, anti-suffragettes had managed to collect 300,000 signatures from women who objected to the franchise being imposed on them. Meanwhile, in the 16 years leading up to that debate, suffragettes only managed to collect 193,000 signatures of women who wanted the vote.\n\nA segment from the transcript of the debate:\n\n\"Still, for what it is worth, one finds that from 1890–1906 only 193,000 women signed Petitions to this House in favour of female suffrage, and that during the last eighteen months, a period in which a strong anti-suffrage association has been in existence, 300,000 women, some of them eminent women, have signed petitions against it, and to the effect that these proposals shall not be forced upon them.\"\n\nAnd...\n\n\"A rather interesting illustration was furnished by an inquiry which was instituted by \"The Sheffield Independent,\" a newspaper which I think itself is sympathetic with these proposals. This inquiry was addressed to the women householders of Sheffield. Twenty-three thousand papers were sent out, and of the replies 9,000 were in favour of woman suffrage and 14,000 were against it. The representatives of this paper reported that in many cases their emissaries were chased with violence from the houses by the female inhabitants under the impression that they were collecting statistical matter as the emissaries of the suffragist party.\"\n\nIt may be difficult to understand why so many women would reject the vote so vehemently, but this was an era where full citizenship rights like the right to vote were granted only to those with citizenship responsibilities like conscription (and sometimes not even then). In that historical context, the vote was actually viewed not just as a right, but also an obligation. So it was never really about men in power shutting women out of the franchise. It was about government having to decide whether to impose a responsibility on women that women as a whole *clearly did not want.*\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\nRegardless of the lack of support for women's suffrage among women, suffragettes became extremely militant in their activism. In 1903 Emmeline Pankhurst founded the Women's Social and Political Union (WSPU) with her daughters Christabel and Sylvia, and the WSPU carried out a nationwide bombing and arson campaign. Between 1912 and 1915, hundreds of bombs were left on trains, in theatres, post offices, churches, even outside the Bank of England; while arson attacks on timber yards, railway stations and private houses inflicted an untold amount of damage.\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nInstead of being beneficial in supporting the vote for women, it was disastrous. Lloyd George said: \"The action of the militants is ruinous. The feeling amongst the sympathisers of the cause in the House is one of panic. I am frankly not very hopeful of success if these tactics are persisted in.\"\n\nTerrorism aside, Emmeline Pankhurst was also resistant to acquiring the vote for working class men, realising that this would be much tougher than winning the vote for \"respectable\" AKA upper-class women, and underlying the resistance appears to have been her contempt for working-class men. According to Sean Lang in his book on Parliamentary reform: \"The Pankhursts became stridently anti-male, ruthlessly dropping even the most loyal of their male supporters from the WSPU, and claiming, as Christabel did in her 1913 book *The Great Scourge*, that men were “little more than carriers of venereal disease”.\"\n\n[https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/](https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/)\n\nWhen WW1 came around in 1914, suffragettes also threw their support behind the White Feather campaign with the aim of shaming men into enlisting. Those young women went in for the kill, striking men at the very heart of their masculine identities, the bestowing of a feather telling them, \"If you don't go off to be maimed or die, you are no longer a man in the eyes of some brassy chit you've never even met before and will probably never see again.\" And many men went, because a woman's censure - ANY woman's censure - had the power to drive them straight into the teeth of death.\n\nBy mid 1915, it was clear that not enough men were signing up to replace the fatalities on the front line, and the Military Service Act was introduced in January 1916. By March 1916 compulsory conscription for all single men aged 18-41 was in place. In May 1916, the Act was extended to include conscription for married men.\n\n[http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html](http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html)\n\nIt was only at that point that the British government considered extending the vote to all men, as most of the propertyless, working class men that were conscripted into war during WW1 did not have the right to vote, and this was finally starting to be seen as the injustice that it was. In the trenches class divisions were eroded to the extent that class no longer had any real meaning and every man was the equal of each other in terms of sacrifice and service to one's country.\n\nMen got universal suffrage in 1918 with the Representation of the People Act, which enfranchised more than five million men over the age of 21 without regard to property or class. Women of all classes were piggybacked onto the Act, with an age restriction temporarily in place to prevent women from becoming a supermajority voting bloc, given that about 1 million British men had died in the war. Regardless, this brought more than eight million women over 30 into the electorate. And just ten years later, the 1928 Act (the act which gave women electoral equality) gave the vote to women at age 21, which added another five million women to the electorate.\n\n[https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/](https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/)\n\nIntroducing the 1918 Bill, the Home Secretary George Cave said: \"War by all classes of our countrymen has brought us nearer together, has opened men's eyes, and removed misunderstandings on all sides. It has made it, I think, impossible that ever again, at all events in the lifetime of the present generation, there should be a revival of the old class feeling which was responsible for so much, and, among other things, for the exclusion for a period, of so many of our population from the class of electors. I think I need say no more to justify this extension of the franchise.\"\n\nThe Act was achieved not by the suffragettes’ terrorist tactics, but by fighting of men in WW1, when thousands of men from their many different backgrounds came together to fight the common enemy. This finally achieved what the Chartists, the Levellers and the peasants before them had struggled for in terms of eroding barriers of class. Without the sacrifice of men who endured the horror of trench warfare in WW1, class barriers would have persisted and at most the vote would have been extended only to elite, wealthy, propertied women.\n\nIn a later study of attitudes to conscription in 1939, one woman responded: \"In the last war \\[(WW1)\\] I never told one man that he ought to go. I tried to put myself in their place. If I’d been them I wouldn’t have gone. When I saw them going through the streets – all the young men – I used to think that they were being driven like cattle to the slaughter house. And they were, weren’t they? Fodder for the guns.\"\n\nThe common idea that all men had the vote, and that women did not, and that women's suffrage was a fight of women who were united against men working as an oppressive force to keep them down is an affront to these men who died in a literal war that secured universal suffrage for everyone (many of which, in fact, did not have the vote). It also ignores and erases the will and sentiment of many, many, *many* anti-suffragette women who actively rejected the vote and protested vehemently against it being imposed on them.\n\nFurthermore, the view that suffragettes were a valiant, fair-minded, equality-oriented group who got women the vote and whose activism merely amounted to firecrackers in barrels is an affront to any right-thinking person. The real violence and extremism of the suffragettes is barely, if at all, recognised by the general public, and this is partly due to attempts by suffragettes to sanitise their history.\n\n\"Laura E. Nym Mayhall, in her work on the militant suffrage movement, identified the importance of \"a small group of former suffragettes\" in the 1920s and 1930s, who created a highly stylised story of the WSPU and the history of suffrage in England, which emphasised \"women’s martyrdom and passivity\". The group set about compiling the documents, memoirs and memorabilia that now form the basis of the Suffragette Fellowship Collection held by the Museum of London.\"\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nAnd here we are now, in crazy world. According to the dominant narrative, all men always had the vote since the dawn of recorded human history, and they refused to give it to women because penis. The demonstrations of the Chartists, and the dead bodies of these men that were sacrificed to the unpopular idea of male suffrage (and who got votes for women in the process), have gone down the memory hole. The terroristic actions of the suffragettes, engaged in for the benefit of wealthy and privileged women only and for which they were barely punished, are the noblest of acts for the noblest of causes. And of course, the only reason anyone could EVER have opposed them was because of misogyny.\n\nedit: wording\n\nedit 2: Added some extracts from [w1g2's comment](https://www.reddit.com/r/MensRights/comments/edyrf5/a_compilation_of_evidence_debunking_feminist/fbtays6?utm_source=share&utm_medium=web2x).",
    "title": "A compilation of evidence debunking feminist historical revisionism.",
    "subreddit": "MensRights",
    "timestamp": 1576979536,
    "score": 345,
    "keyword": "man lawyer"
  },
  {
    "text": "It is now males, rather than females, who suffer the vast majority of institutional discrimination This post was originally submitted by u/Vwar. For new subscribers, here it is again.\n\n---\n\nI don't believe that males have ever been [privileged](https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122) in the way feminists claim.   But we are now at the point where the deck is stacked against males at every stage of their lives and in almost every major institution.   \n\nWhen a male is born he can have his genitals mutilated. Hundreds of baby boys die from this procedure every year.\n\nThen comes primary school, where boys are often punished and even drugged for displaying natural boyish behavior. Recent studies have also revealed that female teachers mark down boys by an average of 20 percent for the same work.\n\nHuge numbers of boys are now being raised without fathers (including about 99 percent of school shooters, funny how we never talk about that), and since pedo hysteria has chased male teachers out of primary school, boys often don't have any male role models until much later in life.\n\nBoys only clubs (eg the Boy Scouts) are being eliminated while girl only clubs remain.\n\nTeenage boys are being introduced to blatantly misandrist concepts like \"toxic masculinity,\" with narry a word about toxic femininity and nothing about the positive aspects of masculinity.\n\nNext it's off to University, where there are a range of female-specific scholarships and programs even though women make up the majority of college students and young women are now out-earning young men. They are also portrayed as rapists in waiting, and there are entire departments (gender studies) devoted to demonizing their sex. If a young man pisses off a young woman (eg dumps her after a one night stand) he faces the possibility of being subjected to a false accusation and a feminist Kangaroo court. Then it's bye bye academic career and social reputation.\n\nIf he wants to vote he will have to sign over his body to the state (selective service).\n\nIf he gets a woman pregnant he will not have the option of legal parental surrender. While a woman can just drop off the baby at a safe haven, the man is on the hook for 18 years of child support and will be locked up if he loses his job and can't pay.\n\nIn the workplace things are just as bad. Men perform almost all of the dirty and dangerous jobs and make up 95 percent of workplace injuries and deaths. If a white man wants to pursue a more respected career he faces racial and sexual discrimination in hiring due to corporate \"diversity\" measures and quotas. A recent study in...I think it was Australia found that \"blind hiring\" practices (where the employer doesn't know the race or sex of the applicant) result in more straight white males being hired; this means that it is straight white men who are now suffering discrimination in the workplace.\n\nWith MeToo, a man can be fired from his job simply for making a woman uncomfortable. There have even been cases of men being fired for telling a naughty joke.\n\nIf he gets married and the wife divorces him through no fault of his own he will likely be treated like shit by the family courts unless he can afford a high priced lawyer. There are countless stories of men effectively being turned into indentured servants by their ex-wives; they live in poverty and seldom see their kids while the wife gets a new \"baby daddy\" and lives high on the hog. NOW, the largest feminist organization in the world, continues to oppose shared parenting even though every single study shows it to be in the best interests of the children, the father and even the mother.\n\nHe will receive less social support, less health care spending, and be relentlessly demonized in the media. \n\nIf a male is sexually assaulted by a woman he will probably not receive justice; the perp will likely get a slap on the wrist even if the victim is a boy.  \n\nIf he commits a crime or is falsely accused of a crime he will be treated much, much more harshly by the criminal justice system.\n\nI could go on.\n\nIt is a myth that feminists think the sexes are equal. Their MO goes like this: if men are ahead in some area, that means women are being oppressed because the sexes are identical except for genitalia; however, if women are ahead in some area that's because women are superior. You can find this sentiment going back to the first wave. Elizabeth Cady Stanton claimed that women are \"infinitely superior\" to men.\n\nThe prison thing is perhaps the most glaring example of feminists not practicing what they preach. If they were serious about equality they would be demanding either that men be treated with more compassion/leniency or that women be treated more harshly (or some combination of the two). Instead, they want women to be treated even *more* leniently, and some are even advocating for the complete abolition of female prisons.\n\nMen are increasingly second class citizens not only in a social but legal sense. A study in the UK determined that if women were treated like men by the criminal justice system, fully half of all prisoners would be female. Women do NOT commit less crimes than men (though they do commit less homicides), they just don't get punished to anywhere near the same extent.\n\nIf feminism were an \"equality\" movement they would not be trying to privilege females in every single institution.    They would be looking with a keen eye at areas in which males are disadvantaged and/or subject to institutional discrimination.   They certainly wouldn't blame everything on some nebulous all-encompassing \"patriarchy\" that hasn't even been proven to exist.  \n\nAdvocates of gender equality must reject feminism, and support men's rights.",
    "title": "It is now males, rather than females, who suffer the vast majority of institutional discrimination",
    "subreddit": "MensRights",
    "timestamp": 1548320409,
    "score": 290,
    "keyword": "man lawyer"
  },
  {
    "text": "I was stabbed then spent 6 months detention for domestic violence just found this sub, I think its right for what I have to say. im writing this because of the ozuna story right now, and the accusations of domestic violence against him. exactly the same thing happened to me, and i believe he is innocent . over the past year ive been dealing with a domestic violence case. ive spent 6 months detention and am currently unable to go to school. \n\nmy ex stabbed me, I had to get stitches, but I was charged and sent to 'youth school' (which is juvie). its how the law works in Canada, in any DV case the man is automatically blamed and considered guilty. the entire system is automatically against men.  my lawyer said i had a 99% chance of prison if if went to trial, male defendants literally cant present evidence in DV trials if the defense doesnt approve it. its crazy but it's true\n\nI ended up taking the same deal he did, the 1 year restraining sentence. apparently this is normal and happens all the time, I met many guys in juvie who had the same thing happen to them. its actually happening a lot.\n\nI tried posting it on the baseball subs but I was attacked and called an abuser.",
    "title": "I was stabbed then spent 6 months detention for domestic violence",
    "subreddit": "MensRights",
    "timestamp": 1571810191,
    "score": 218,
    "keyword": "man lawyer"
  },
  {
    "text": "One brave young man takes on gender inequality at USC  \n\nMisandry—the hatred of men—has been a staple of my polemical writing  for more than fifteen years. I felt a special obligation to hammer away  at gender myths such as intimate partner violence (women are about [as likely as men](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) to initiate violence against their partners as men), false sexual allegations (a [disturbing percentage](https://medium.com/t/@jimpreston_36730/how-many-rape-accusations-are-false-f52e4c675f2a) of such allegations) and demonstrable [bias against fathers](https://theccf.ca/ideology-and-dysfunction-in-family-law/)  in family court, because male journalists who dared to write  sympathetically about men and/or critically about women put their  careers in jeopardy (no exaggeration), and most had learned to keep *shtumm* in this domain.\n\nThat  situation has been changing slowly but steadily. Some men have decided  they aren’t going to spend their lives in rhetorical purdah on the  subject of their own cultural dhimmitude, and have been stepping up to  the plate, whatever the personal cost. The university campus is home to  the feminist commissariat—and it’s a brave man who dares to stick his  head above that formidable parapet. Because the cost of doing so can be  high.\n\nThis is the story of one such activist who paid a price,  which only fueled his resistance efforts, and which in turn inspired  others, in reversing a decades-long erosion of men’s rights on campus.\n\nIn  a meeting held in June, 2017, Kursat Christoff Pekgoz was pressured by  his academic director at the University of Southern California into  terminating his PhD degree in English Literature on what Pekgoz  considered spurious and unprecedented grounds, accompanied by “many  threats and irrational exaggerations” (the meeting was recorded).  His  contract was not renewed and his funding was cut off. This is extremely  uncommon. In fact, Pekgoz is unaware of any other PhD student being  denied a doctoral degree in English Literature \\[at USC\\].\n\nThe real  reason for his PhD termination, Pekgoz alleges, is his history of gender  activism via a series of Title IX complaints against a number of  universities, such as Rutgers, [Northeastern](http://ncfm.org/wp-content/uploads/2018/08/NCFM-Title-IX-complaint-Northeastern-University.pdf) and Georgetown, to which he added [one against USC](https://docs.wixstatic.com/ugd/ea7b71_0c223159779e4beaaea809873f2504a7.pdf) at the end of May. As he [told a PJ Media reporter](https://pjmedia.com/trending/ph-d-student-files-federal-complaint-says-usc-retaliated-against-his-pro-men-title-ix-activism/), “They all know that I am a Title IX activist for men, with strong libertarian/conservative views.” \n\nTitle  IX’s language is very plain. It prohibits any institution from funding,  sponsoring, or listing gender-discriminatory programs and initiatives,  so for example, even listing a woman-only scholarship or placing an  employment ad specifying only women need apply runs counter to Title IX,  though such breaches happen all the time. Title IX also prohibits  discrimination in terms of counselling or health benefits. That should  mean that both men and women are treated with equal objectivity and  respect when, say, sexual-assault allegations come up for assessment.  But universities have [not covered themselves in glory](https://helpsaveoursons.com/category/fighting-back/), to say the least, on that front. \n\nIndeed,  motivation for Pekgoz’s robust activism arose in part from a Title IX  complaint against him for sexual harassment. In response, he went on  offence with a forceful and persuasive [counter-charge](https://docs.wixstatic.com/ugd/ea7b71_16c1692eab8844218afdb2b419622827.pdf)  that his accuser had in fact sexually assaulted him (it’s worth  reading, because it offers a formidable sample of the kind of meticulous  research and annotation Pekgoz applies to every single thing he says  and writes. It does not seem to leave much wriggle room for his accuser,  and I think any objective reader would come away from it with,  minimally, doubts as to the accuser’s credibility.) \n\nIn 2018  Pekgoz complained to the Department of Education’s Office of Civil  Rights (OCR) about both USC and Yale University, prompting an  investigation into both schools’ women-only scholarships and programs,  such as a USC Women in Science and engineering group that excludes  males.\n\nLast January, Pekgoz and two former lawyers (not affiliated with Harvard University) filed a Title IX [complaint with the OCR against Harvard](https://docs.wixstatic.com/ugd/ea7b71_85533d99ee0748ac813ca937735a4f94.pdf),  in which they rebut the received wisdom of female victimhood with an  abundance of impeccably-sourced evidence demonstrating the various ways  in which men are discriminated against in society and on campus.  Notably, “the overwhelming majority of all persons sanctioned under  Title IX theory are male. However, there is good evidence that men and  women experience sexual victimization at equal rates and the majority of  male victims [report female perpetrators](https://www.sciencedirect.com/science/article/abs/pii/S1752928X11001569). The majority of Title IX administrators are women.”\n\nAlso in the Harvard complaint is a reference to Supreme Court prohibitions against male-gender discrimination. In [*Mississippi University for Women v. Hogan*,](https://www.britannica.com/topic/Mississippi-University-for-Women-v-Hogan)  for example, the Supreme Court held that denying male admission to  nursing courses was impermissible under the Equal Protection Clause of  the Fourteenth Amendment. They wrote that a sex classification must be  “…determined through reasoned analysis rather than through the  mechanical application of traditional, often inaccurate, assumptions  about the proper roles of men and women. … Thus, if the statutory  objective is to exclude or ‘protect’ members of one gender because they  are presumed to suffer from an inherent handicap or to be innately  inferior, the objective itself is illegitimate.” This statement would  seem to undermine the reflexive argument adduced by feminists that  affirmative action for women is still necessary because of historic  disadvantage or because there are more *Fortune 500* male CEOs than women.\n\nThe  most interesting complaint to the OCR, because it reveals the distance  the men’s rights movement has come from its first tentative and atomized  beginnings two decades ago, is the one led by Pekgoz [against Cornell University](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed) in February, which Pekgoz described in an  [interview with *Campus Reform*](https://www.campusreform.org/?ID=11853) as “one of the worst in the nation” for anti-male bias. \n\nThe  document contains a “list of exclusionary programs” at Cornell, such as  the lack of a Men’s Resource Center to balance the women’s Center, or a  Men’s Health Center to balance the Iris Cantor Women’s Health Center.  Likewise – even though “men are twice as likely to have heart attacks  through life than women” – there is a women’s Heart Program, but none  for men.\n\nBut the list itself, while interesting, is not what is  most significant about the Cornell complaint. Rather it is the public  support for the complaint amongst Pekgoz’s colleagues and from many  respected public intellectuals, such as American Enterprise Institute  scholar and feminist critic [Christina Hoff Summers](https://www.aei.org/author/christina-hoff-sommers/),  that lend unusual moral weight to its claims. More than 185 professors,  scholars and activists signed on to it, including Canada’s own Jordan  B. Peterson, arguably the most recognizable and inspirational spokesman  for gender equality in the world today. Peterson referenced Title IX’s  long association with women’s rights succinctly: “what’s sauce for the  goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*  that he had signed the complaint because it “addresses a fundamental  unfairness in contemporary America, centred in our colleges and  universities” and because “it shows that exclusionary practices create a  hostile environment” for men, some caused by an “animus against males  perpetrated by feminist ideology.” Lawrence Alexander, a law professor  at the University of San Diego, told *Campus Reform* that he signed because “its allegations are true and even understated.”\n\nSuch  public affirmation on men’s behalf by high-status academics in  prestigious institutions represents something like a tipping point in  the gender wars, it seems to me. Margaret C. Valois, a Virginia-based  Title IX attorney who specializes in defending accused male students  filed a similar Title IX complaint against Tulane University and [obtained a win](http://www.aei.org/publication/successful-title-ix-complaint-forces-tulane-university-to-end-gender-discrimination/)  recently. Valois, Pekgoz and another aggressive veteran in the battle  for gender equality, Professor Mark Perry of the University of  Michigan-Flint, are profiled by anti-feminist Canadian vlogger Janice  Fiamengo, a signatory to the Cornell complaint, in [Episode 94 of her popular Fiamengo File](https://inclip.top/studiobrule/aLDRY3qCkmjIuoI/will-2019-be-the-year-of-mra-lawsuits-tff-episode-94.html) series, titled “Will 2019 Be the Year of MRA Lawsuits?”\n\nWill  it? It does seem that we are at a pivotal moment—that there is a  powerful current of social unease, running just below the still  hegemonically feminist surface, with the unfettered misandry that  pervades our culture. In Pekgoz’s Harvard complaint, for example, he  notes that whenever the Department of education investigates an  institution for anti-male discrimination, public attitudes on the issue  are on the side of men: “\\[A\\]ccording to a recent poll conducted by  YouGov, 69% of all Americans believe that men face discrimination to  some extent. 74% of men believe that such discrimination occurs, while  63% of women agree that men face some degree of discrimination.”\n\nFiamengo points to what she ([and I](http://www.barbarakay.ca/articles/view/1297)) consider radical feminism’s shark-jumping moment, the publication in the *Washington Post* of Northeastern University academic Suzanna Danuta Walters’s odiously misandric June, 2018 article, “[Why can’t we hate men](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html)?” which earned her a [Title IX complaint](https://www.campusreform.org/?ID=11249) filed by the National Coalition for Men [(NCFM).](https://ncfm.org/)  Walters doubtless expected her screed would find the passive acceptance  such anti-male rants often have done in the past, but was clearly  startled by the fierce blowback she received.\n\nA final word about  Kursat Christoff Pekgoz. I don’t know him personally, but from his  history, I would say that the USC Literature department picked the wrong  guy to tangle with when they forced him out of his PhD program. This is  a young man, now 30-something, who comes from Turkey, a land where they  play political hardball, and backing the wrong horse can earn you  something worse than a Twitter mobbing. He learned about activism in  what we might call an “unsafe space.”\n\nPekgoz’s [*curriculum vitae*](https://www.kursatchristoffpekgoz.com/)  informs us that In Turkey Pekgoz went out on potentially dangerous  political limbs. He took part in the Republic protests of 2007 against  fundamentalist Islam, as well as a protest against Islamist hate speech  targeting Armenian and Jewish minorities in 2009, amongst other forays.  He advocated against electoral fraud by the Islamist regime. He taught *pro bono* for an anti-Islamist organization that seeks to eliminate illiteracy among young women in Ankara (real feminism in action). \n\nAll  this speaks to character. For relentless discipline and determination  in achieving goals, add this salient fact: As a long-distance swimmer,  Pekgoz has covered 11,000 m in the open sea, with the best speed of  5,000 m in 130 minutes. This is in seawater with a temperature of 17C.  Don’t look to such a man to truckle to latte-sipping ideologues  trafficking in gender injustice. Ever.\n\nAccording to his bio,  Pekgoz has “perfect pitch.” He means musically, of course. But it may be  the case that he has perfect cultural pitch as well.\n\n&#x200B;\n\n[https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/](https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/)",
    "title": "One brave young man takes on gender inequality at USC",
    "subreddit": "MensRights",
    "timestamp": 1569207365,
    "score": 189,
    "keyword": "man lawyer"
  },
  {
    "text": "List of Men's Rights Issues Just what I see as important, with a few sources.\n\n###Labor, work / life balance\n* Men work longer hours than women\n* Men work more difficult jobs than women\n* Men suffer from greater rates of occupational health problems (black lung disease, mesotheleoma, etc)\n* Men are more likely to die on the job\n* Men receive fewer benefits like paid time off, paid medical leave, and health insurance\n* Men have less free time to see a doctor, and often do not have medical coverage to pay for a doctor\n* As a result of many of the above, men live shorter, disease ridden lives, but retirement age is the same as (and sometimes higher than) women\n\n###Household responsibilities\n* Men do most of the dangerous, dirty, and difficult work around the home\n* Men get nagged, harassed, and bossed around inside their home ([source 1](https://public.psych.iastate.edu/ccutrona/psych592a/articles/Vogel%202007.pdf), [source 2](https://www.pewsocialtrends.org/2008/09/25/women-call-the-shots-at-home-public-mixed-on-gender-roles-in-jobs/), [source 3](https://www.scotsman.com/lifestyle-2-15039/women-decide-to-rule-the-roost-1-1503380))\n* The total amount of time men spend at work and at home doing chores and child care is more than the amount of time women spend on these activities ([source 1 (Pew)](https://www.pewresearch.org/fact-tank/2019/06/12/fathers-day-facts/ft_18-05-01_fathersday_time/), [source 2 (US BLS)](https://cdn0.vox-cdn.com/assets/4635193/Screen_Shot_2014-06-18_at_12.56.18_PM.png), [source 3](https://ifstudies.org/blog/the-myth-of-the-lazy-father))\n* Men have less time to themselves for leisure, self care, napping, and sleeping, compared to women (source: same as above)\n* The way society views all of the above is completely backwards: women complain about men and about the amount of work that men do, often portraying men as lazy or incompetent (see [source 3](https://ifstudies.org/blog/the-myth-of-the-lazy-father) from above), despite the fact that, if anyone has room to complain, it's men, not women\n\n###Masculinity and Misandry\n* Men are attacked for behaving like men.  Husbands are attacked for behaving like husbands.  Fathers are attacked for behaving like fathers.  And boys are attacked (and often medicated, shamed, and disciplined) for behaving like boys.\n* The vast majority of media representations of men in TV, movies, and commercials, are negative ([source (from rbomi)](https://archive.is/NHC61))\n* Even when men are portrayed positively in the media, it's usually because they have abandoned masculine traits and embraced feminine traits instead (so a man is seen as a bad guy when he was acting like a man, and later a good guy when he \"connects with his feminine side\") (source: same as above)\n* Misandry is widespread throughout all of society and is widely accepted.  Many people do not know when they are being misandrist, or that it's even possible to be misandrist.\n* Men are shamed and attacked with words like *creep*, *pervert*, *incel*, *deadbeat*,and *rapist*\n* These types of slurs should be considered equally sexist / bigoted as words like \"thug\" for black people or \"wetback\" for hispanics\n* Men's behavior is highly regulated by women and female shaming behavior\n* The clothing that men are allowed to wear is highly regulated by women and female shaming behavior\n* It is not uncommon to hear comments about the size of a man's penis, or for women to threaten to cut off a man's penis\n* Genital mutilation is commonly used to \"fix\" behavioral \"problems\" in young boys\n\n###Education\n* Our school systems are increasingly hostile towards boys\n* Boys are treated like defective girls and their behaviors are \"corrected\" through discipline, and through medication, so that they will behave more like girls\n* Boys make worse grades than girls, and graduate at lower rates than girls (despite, in the past, doing better than girls)\n* Our education system went through several reforms to help out girls, and these reforms are responsponsible for making things worse for boys ([source](https://www.theatlantic.com/magazine/archive/2000/05/the-war-against-boys/304659/))\n* Society is hesitant to address or fix any of these issues, despite the fact that we were willing to fix these issues when they first effected girls\n\n###Wealth gap\n* Single women make more money than single men\n* Millennial women make more money than millennial men\n* Women as a whole own more wealth than men do -- most \"money\" in society belongs to women ([source 1](https://www.marketwatch.com/press-release/bmo-report-despite-controlling-14-trillion-in-wealth-american-women-still-have-challenges-to-overcome-2015-04-02-13173119), [source 2](https://www.forbes.com/sites/work-in-progress/2010/07/28/women-making-economic-strides-and-not-slowing-down/)).\n* The expectation is for men to spend money on women, not the reverse\n* Women spend their boyfriend's and husband's money, often even when they make more than their boyfriend / husband\n* Women very often receive large portions of a man's assets and future income in a divorce, which contributes significantly to the wealth gap\n\n###Divorce and child custody\n* Courts have an obvious anti-male bias when it comes to divorce settlmenets, child custody cases, and awarding child support\n* Laws concerning marriage, divorce, child custody, and child support, are sexist, and often times name \"husband / wife\" and \"father / mother\" directly in the legal language\n* Even when this is not the case, the effect of these laws are still sexist, in much the same way that drug laws and drug enforcement have been acused of being racist ([source](https://en.m.wikipedia.org/wiki/The_New_Jim_Crow))\n* Women should not be allowed to walk away with a substantial amount of the man's money and assets from a divorce\n* Women should be forced to work a job instead of receiving child support, alimony, and welfare\n* Men should receive default 50 / 50 custody without having to pay child support.  Men should not have to go to court, pay court fees, hire lawyers, and argue their case in court.\n* It is not fair for a man to work full time, take 50% of the child rearing responsibilities, and still pay child support.  If a man can work and still put in his fair share, then so can a woman.\n\n###Police brutality and legal discrimination\n* Men are discriminated against in almost every aspect of the legal system.  In many cases this discrimination is *worse* than it is for minorities.\n\n###Domestic abuse, rape, and violence against men\n* The Deluth model of domestic abuse is overtly sexist against men\n* Women physically assault men at equal and sometimes greater rates than the reverse\n* Domestic abuse that includes yelling, gaslighting, and emotional abuse, are probably much higher than what's reported, and men likely make up a majority of the victims\n* Nagging, harassing, henpecking, and bossy behavior from wives and SOs should be counted as domestic abuse\n* Taking advantage of a man for his money should be considered a form of \"financial abuse\"\n* Men are raped at equal rates as women but there is very little awareness for this.  Most men are raped by women, not by other men ([source 1](https://www.scientificamerican.com/article/sexual-victimization-by-women-is-more-common-than-previously-known/), [source 2](http://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf)).\n* Men are viewed as being more dangerous or violent than women, despite there being clear gender parity when it comes to domestic abuse and sexual assault\n* As a result, men receive less support and there is less awareness for these problems in comparison to women\n* Men who are raped suffer from greater rates of emotional trauma than women do\n* Women who rape men tend to be more violent and are more likely to use force than men.\n* There is a widespread and rampant \"rape culture\" against men: many women do not believe that it is possible to rape a man, and as a result women are more likely to step over boundaries in ways that men don't.\n* Many people do not view abusive behaviors from women in the same light as those same behaviors from men ([source](https://www.researchgate.net/publication/8006596_Psychologists'_Judgments_of_Psychologically_Aggressive_Actions_When_Perpetrated_by_a_Husband_Versus_a_Wife))\n* Men are often viewed as the more responsible party than women\n\n###Men and Minorities\n* Many areas of men's rights and minority rights intersect, with minority men facing problems from both racism and sexism\n* Examples include police profiling, police brutality, and racist / sexist comments and behaviors\n* Men are often treated like criminals, and this treatment is even worse for minority men\n* White men perform worse than white women in almost every single aspect of life, with the exception of job earnings (which is largely the result of men working more hours, more difficult jobs, and having a worse work/life balance compared to women)\n* Minority men perform worse than minority women in every single metric you can look at, including job earnings\n* Minority women perform better than white men in some areas, like when it comes to police brutality, police profiling, and discrimination in the court system\n* Who has it worse: Men, or minorities?  Obviously it is minority men.  It is not true that minority women have things worse.\n* Joking about minority women somehow having things worse has created a culture of denial over men's issues and the problems that minority men face.",
    "title": "List of Men's Rights Issues",
    "subreddit": "MensRights",
    "timestamp": 1571168087,
    "score": 139,
    "keyword": "man lawyer"
  },
  {
    "text": "Deep dive into the weaponization of the 5% false rape allegations statistic, AKA trolling SJWs epic-style with their own citations Heya, MR. Throwaway because don't want to get SJW anger and bans on my main account since free speech is dead apparently. Posting this in a few places it'll make the most impact, and was told to drop this off here as well. Feel free to steal, claim and cross-post any and all of this. All I really care about is being heard.\n\n​\n\nAnyways, this is a discussion of false rape allegations in the US, more specifically the commonly-cited statistic that 5% of rape allegations are false, and thus the other 95% are true. Disclaimer #1: I am a scientist wishing to remain anonymous. If there’s one thing scientists are trained to be very, very good at is performing reviews of empiric literature, but I am not a politician or lawyer, and I am but one man. Thus, potentially all of this is dumb drivel. Disclaimer #2: I am what you would traditionally classify as libertarian-center (that’s on the line between the green and the purple boxes for all you memers). Thus, my views are currently more congruent with the US right rather than left.\n\n​\n\nRegardless, when the Kavanaugh situation occurred, one thing that shocked me was the sudden prevalence of examples of false sexual assault allegations in the media with simultaneous chorus of the 5% statistic. Someone was clearly wrong here – someThing was clearly wrong here. So, scientists are going to scientist. Time to review the literature.\n\n​\n\nNow, my initial strategy is to contain my confirmation bias and thus review left-wing media first. OK, let’s start with Wikipedia then :)\n\n​\n\n[https://en.wikipedia.org/wiki/False\\_accusation\\_of\\_rape](https://en.wikipedia.org/wiki/False_accusation_of_rape)\n\n​\n\nBoom, right away a list of citations. Strangely, this article isn’t terrible. I then cross-referenced the table in this article with several of my own Google Scholar searches, and the table is actually fairly decent. Now, what do we see in the table?\n\n​\n\n\\- Most of original research into allegations is over two decades old. Literally second-wave feminism times. Clearly not useful at all for a modern discussion. The false accusation estimates (if they are actually even reported as such) ranges from 1 to 50%. Lovely…\n\n​\n\n\\- Most of the modern research is meta-analyses that uses the aforementioned old studies, tries to combine all of the clearly varied samples, and spits out some combined estimate. Also useless.\n\n​\n\n\\- Most of the modern original research comes from sources like the national registry of exonerations, which neither reports data that we want to measure false rape allegations, nor reports this in enough detail.\n\n​\n\nWell crap. However, there seems to be a few glimmers of hope. A name that keeps coming up is André De Zutter from the university of Amsterdam. He is frequently cited in left-wing analyses and literature, but looked like a decent, moderately impartial third party. And, he even wrote a paper discussing false rape allegations in the US utilizing FBI statistics (yes, the same statistics conservatives cite for minority crime disproportionality). Seems like a source that would satisfy both sides.\n\n​\n\n[https://www.researchgate.net/publication/315728247\\_The\\_Prevalence\\_of\\_False\\_Allegations\\_of\\_Rape\\_in\\_the\\_United\\_States\\_from\\_2006-2010](https://www.researchgate.net/publication/315728247_The_Prevalence_of_False_Allegations_of_Rape_in_the_United_States_from_2006-2010)\n\n​\n\nThis is where the 5% figure comes from when you ask a left-wing person to give you an original, modern study of false rape allegations. This is the ONLY such study that’s acceptable, as far as I could find. Now, time to unpack it. But first, a lesson in nomenclature.\n\n​\n\nWhen the FBI reports its crime statistics, there are three paths it can take. Either the FBI finds that there’s clear evidence that an allegation is very unlikely to be true and the case is closed “unfounded allegation.” Alternatively, the case can be “cleared,” where “clearing” essentially means the FBI done all it could. There are two flavors of clearing:\n\n​\n\n\\- Clear by arrest – when the FBI hands the case over to the courts for a trial (since an FBI investigation is NOT sufficient to refute presumed innocence and a trial is still needed re: the constitution of the US)\n\n​\n\n\\- Cleared by exceptional means – when there’s not enough evidence to arrest, and the FBI finds that it really isn’t possible to gain such evidence (for whatever reason). Essentially, FBI saying “we did all we could; arrest is functionally impossible.”\n\n​\n\nThe third path is neither clearing nor declaring the allegation unfounded. Essentially, it’s ongoing cases, tabled cases, etc. Typically details beyond this are not reported for a number of reasons, but this category makes up the MAJORITY of cases. Notice NOWHERE did we find where the FBI proves someone guilty. The data are simply not designed to report this. It clearly reports cases the FBI finds most likely false allegations, but the rest of the cases are more complicated, and contain people who are “in reality” “guilty,” “not guilty,” and “it’s more complicated.”\n\n​\n\nThe De Zutter paper cites the 5% statistic as the rate of the “unfounded” cases versus LITERALLY ALL THE REST, not versus “guilty.” Essentially, it states that “at least 5% of rape allegations are almost certainly unfounded, per FBI.” Now, why would a relatively decent investigator like De Zutter use this statistic?\n\n​\n\nProportionality.\n\n​\n\nThe study was NEVER designed to give a percentage value of false rape allegations. It was designed to produce a metric for rape (the 5% figure) as well as similar metrics for MANY OTHER serious offenses (incl. murder, manslaughter, assault, robbery, and theft), and then compare them. Notice how when conservatives use FBI statistics they typically cite proportionality, because this is what the data CAN produce. Not absolute percentage but proportionality. So, what DID the data show?\n\n​\n\n“False and baseless allegations of rape constitute about 5% of all rape allegations; it is at least five times the proportion of some other crimes.”\n\n​\n\nAmazing. Note several details. First, notice “at least,” admitting our above discussion of the 5% being “likely not guilty versus the REST of likely not guilty PLUS likely guilty.” Second, the data clearly showed as its goal/target finding, that RAPE ALLEGATIONS ARE DISPROPORTIONATELY MORE LIKELY TO BE FALSE COMPARED TO ALLEGATIONS FOR OTHER CRIMES, IN SOME CASES OVER FIVE TIMES MORE.\n\n​\n\nThis is the study that left-wing people cite as the herald of the rape culture and rape epidemic in the US. Now, given that it appears I’m one of the only people from either side to actually dive into the literature, let’s not assume most of the citing of the 5% figure are disingenuous. Parroting is an issue on both sides. And, like I said, I may be an idiot and misinterpreting the literature. However, here’s my work. Do with it what you will.",
    "title": "Deep dive into the weaponization of the 5% false rape allegations statistic, AKA trolling SJWs epic-style with their own citations",
    "subreddit": "MensRights",
    "timestamp": 1557706930,
    "score": 134,
    "keyword": "man lawyer"
  },
  {
    "text": "Woman broke into my home assaulted me and I was arrested..help (escuse my grammer im disabled)\n\n I was sleeping and my female neighbor who lives behind me who i was friends with. Came into my home while i was sleeping and woke me up by punching me in the head and neck and shoulder. I woke up and said hey lets go outside and talk, hoping she would follow me outside to get her to leave. She kept hitting me stopping and repeat over and over and over but i made my way out of my bedroom and into my hall and then woke up on the ground. At that point all i remember was my temple hurting and she knew im disabled and i said please stop im on blood thinners. Because i don't know how hard you have to be hit in the head to have a brain bleed. I stood up and woke up back on the floor. At that point i stood up and said get the fuck out now went from verbally asking politely to demanding..kept hitting me. So i grabbed a unloaded .22 handgun that i keep on my counter in the kitchen that was within reach after getting off the floor. \n\n(As a safety mechanism it cannot be loaded shot or anything not even pull the trigger without the magazine wich was in the other room in a safe and was in a soft padded waistband holster)\n\nI pointed it down to the ground with my bad arm and kept pointing at my door get out get out get out. Nothing still hitting me. Continued to make my way to the front door with her in front of me hitting me repeatedly as i never touched her or shoved her or pointed it at her or anything aside from the ground in the holster and finally made my way to the door. She tried kicking it open and i finally shut her out.\n\nI placed thr gun back down in the kitchen and called 911 and explained what happened. As im on the phone sherriff kicks down my door and jumps in with a Glock pointed at my head. I comply. I was arrested after he refused but another officer let me go to the hospital to get a MRI done. Was in infirmary at the jail for 2ish weeks with no phone call and none of my medicine only my blood thinners that took me 5 days to argue that they were blood thinners and not beta blockers with the nurse..and was forced to starve due to withholding my stomach medication for my post gallbladder removal that helps me eat and keep it down. Lost over 20lbs in 2 weeks from not being able to eat and withdrew fr my nerve medications i take for my disability because im immune to opiates. And they weren't even narcotics at that. After 2.5 weeks was kicked out of my solitary hell into general population and forced to sleep on the top bunk and further injury myself because in disabled from my upper extremities. I couldn't even sleep on the floor because they were already being sued for over crowding..i was arrested for misdemeanor battery, felony battery with a deadly weapon and felony intimidation. AND a violent or sexual felon with a firearm.. yeah.. apparently they thought i had a felony from a neighboring state for burglary but i didn't..and apparently here if you commit a burglary your automatically a violent or sexual felon..but i didn't..so bond set st 25k no 10%. Once i was able to make a phone call i called my mother to go to my home and get my money to hire an attorney after wasting my life saving on 5k for a retainer was able to have my lawyer prove i didn't have a felony and dismissed the most serious charge. And he was able to reduce the bond to 10k 10% and i was free the next day after spending 30 days in jail and almost dying and further injuring myself for something I didn't do slash had the right to do according to Indiana's castle doctrine. She claimed she was just standing at the foot of my bed i got up grabbed a gun jammed it into her ribs and forced her out...yeah definitely not. But im a man she's a short but apparently violently strong woman. And im disabled..yes i have a long criminal history but mainly as a kid made stupid decisions but nothing this serious o havent even had a speeding ticket in years but as a kid i stole and was an idiot sure but she has 2 felonies one for bad checks and one for stabbing one of her ex husband's with a fork in the shoulder.. and i was arrested. Also i think what happened initially is dispatch ran my name and said i was a violent felon with a handgun is my guess and it tainted everything but ironically a few days prior they did a \"recovery\" where they return and verify that a gun is yours and give it back to you one of my guns was stolen and returned days prior by the same sheriff department. But now im poorer than poor and feel like something isn't right she came into my home without my permission while i was asleep regardless of assaulting me and almost killing me..and i think its even more serious since im disabled but im not for sure. But idk what to do my attorney just wanted to drag it out and i don't comprehend why she was arrested or why i was arrested for what i thought was my right to do. I mean what the hell..if i as a man did that to a her a woman ide be arrested...im so confused and im afraid that since im so poor i cant afford to properly prove my innocence..its unjust. I cant even afford to buy a car to go to my 5 plus Drs appointments every month let alone get justice. I wish i could afford a real attorney from Indianapolis because i feel like something isn't right between my lawyer and the court here..this should have been dropped and she should have been arrested.. yet here i am living in hell..  \n\nOnce again im really sorry for the Grammer and everything) also this is hypothetical for legal reasons not saying i did that or didn't.. idk what to do..im afraid my lifes still in jeopardy because it seems like something isn't right with all of this she should be in jail and i shouldn't be worried everyday.. idk i doubt i get anyone to read this but if you do thank you i don't have slot of friends or family to talk to about this and if i ask my attorney anything he always bitches at me and tells me to let him do his job.. something isn't right about this.. and im too poor to do anything about it idk what to do anymore",
    "title": "Woman broke into my home assaulted me and I was arrested..help",
    "subreddit": "MensRights",
    "timestamp": 1569595642,
    "score": 87,
    "keyword": "man lawyer"
  },
  {
    "text": "Weaponization of sex I have attempted on several occasions to bring this up in other subs, and it always gets downvoted into oblivion.\n\n[Edit] \nHere is my take away so far.\n\n1.) I should have included there must be some sort of pre-established relationship. You can't just walk up to someone, touch them and if they don't leave it means they consent.\n\n2.) Handicapped individuals cannot consent. You have to ascertain whether or not someone is competent. This should be the case for most anything else, too. A car salesman can't sell to someone with dementia.\n\nThe theme I'm hearing over and over (and have heard, in other contexts) about fear and freezing up, I believe this  to qualify as a mental handicap. If you are someone who has this problem, you shouldn't be having sex or at least let your partner know it is an issue. From a legal standpoint, I would say it qualifies as mentally handicapped.\n\nPlease take my words in empathy. If your image of men is so fearful you freeze up and can't leave a situation, then perhaps it is the one who taught you this is what men are who abused you.\n\nI'll give you a hint who that teacher was, it was the same teacher who *tried to* teach me that this is who *I am*. I simply rejected the teachings and refuse to hold such a self image. \n\nMaybe it's not men who are the monsters. Maybe it was the image drilled into your head from all angles. \"Don't talk to strangers\", \"men are dangerous\".\n\nI don't think the government should make laws that cater to this kind of paranoia, potentially sending people who really aren't that dangerous into prison. Rather, I think this is a great way to *make* them dangerous.\n\nBy far the biggest thing I notice is how people have come to see the government as fulfilling the role if father.\n\nAt one point, the situations described here would have called for a stern talking to and maybe even a bit of a whipping from the girls father. This was one of the things dad's were supposed to do!\n\nThis, combined with this thing they used to call \"courting\" was how people learned basic human decency. The idea was, you get to know the other person a little before hopping in the sack.\n\nThe government will never serve this role because the government does not *have* human decency to offer. \n\nI think the government should lock up those who are dangerous as a security responsibility, but without a dad, people are expecting government to be what it can never fulfill.\n\nThat's my take so far.\n\n[/edit]\n\n\nWhat is wrong with the idea that rape should involve an actual assault? I've suggested that if you can leave a given situation (even if \"leaving\" simply means getting out of the same bed) then it shouldnt be called rape. If you were restrained in some way (including because you are asleep) then yea, it's rape. \n\nThis isn't to suggest there aren't emotional problems that make people uncomfortable and feelings won't get hurt. Certainly, if your partner says stop or doesn't want to, you shouldn't keep going, it wouldn't be enjoyable anyway... But I am speaking about where personal responsibility ends and the law steps in. I think it's a very reasonable boundary, leave if you don't like it. Why is this such a radical position? \n\nI've never once suggested that men be allowed to just have sex with whoever they damn well please. I never suggested that anyone be attacked. Yet this is EXACTLY how people respond when I have attempted to talk about it.\n\nThe (very few) responses I have gotten  were based solely on emotion. Talking about how this or that can make someone uncomfortable. Apparently the government is supposed to wipe away your tears and it's OK if someone serves prison time, provided it makes her feel better. Do people feel the government is supposed to be the dad they never had? Because it sure seems like it.\n\nIf a man doesn't like something, *and he does not leave* anyone with half a brain would call him a dimwit for staying. They certainly wouldn't call him a victim.\n\nI've tried the \"affirmative consent\" thing, and frankly, it was like having a threesome with a lawyer. The sense of intimacy was completely destroyed and the experience was so unpleasant I truly am happier not to engage in sex. The only dudes who would want to have sex under these conditions almost *has to* be a sex addict. It's just not worth it!\n\nBut my point is, why is my position so hostile? It really seems to piss people off, in a major way. Is there some kind of actual campaign to weaponize sex? \n\nIt's starting to seem like women want a world in which 2 things happen.\n\n1.) Affirmative consent laws let them tell who the \"bad boys\" are. It raises the bar, knowing they are \"worth more\" if a man is willing to risk jail to sleep with them. \n\n2.) Ambiguous laws allow them to have any man they'd like arrested for having sex with them. \n\nI think feminists and the \"woke\" see sex as a weapon and the massive downvotes I got were from these people, who want to preserve this weapon. \n\nPushing for common sense rape laws would be a serious threat to them. They really do want to use sex as a weapon to have men incarcerated and would prefer you kept your mouth shut about it.\n\nThat's my theory, mostly because the only feedback I ever get is \"you pig!!!!\" And nothing constructive, or relevant.\n\nAnyone else notice this?",
    "title": "Weaponization of sex",
    "subreddit": "MensRights",
    "timestamp": 1566407336,
    "score": 85,
    "keyword": "man lawyer"
  },
  {
    "text": "Russian LGBT activist Elena Grigoryeva stabbed to death after her name appeared on the list of a \"gayhunter\" group Saw. Gets officially framed as \"domestic murder\", victim slandered and blamed. Authorities lie, refuse to acknowledge the political motivation and do nothing. LGBT people are in danger [News article in English](https://www.nbcnews.com/feature/nbc-out/russian-lgbtq-activist-killed-after-being-listed-saw-inspired-site-n1032841)\n\n>According to friends' and colleagues' online posts, Grigoryeva was worried about her safety after she found her name and personal information listed on the snuff site.  \n>  \n>“I learned today that Lena asked a mutual friend to take care of her cat in the event of her death when she was threatened with murder,” [friend and fellow activist Dinar Idrisov wrote on Facebook](https://www.facebook.com/DinarSpbRu/posts/1425612460923295).  \n>  \n>“The state of Russia was obliged to guarantee her the right to life,” Idrisov wrote. **“Lena and her lawyer appealed to law enforcement agencies both on the fact of violence and on the fact of threats, but there was no noticeable reaction.”**  \n>  \n>On Tuesday, Idrisov updated his post to note that Grigoryeva's mother had identified her body and that investigators in St. Petersburg had taken over the case. Other activists said on social media that Grigoryeva's body was found near her home over the weekend with stab wounds and signs of strangulation, The Moscow Times reported.  \n>  \n>On July 18, just **days before she was killed, Grigoryeva** [**posted an alert on her Facebook page**](https://www.facebook.com/lgbtnet/photos/a.178639678924393/2295138960607777/?type=3&theater) **about the “Saw” website.**  \n>  \n>Grioryeva wrote that the site, which organizes a “hunt for homosexual, bisexual and transgender people,” went online in spring 2018 and was shut down several times but always popped back up. **The website posted the personal data of “presumably LGBT+” activists, “including photos and addresses,” and offered prizes to those who completed an attack.**  \n>  \n>**“Law enforcement agencies have still not done anything to find the creators of this ‘game’ and bring them to justice,”** Grigoryeva wrote. She called on those opposed to the website to contact the Russian prosecutor’s office and the FSB, Russia’s intelligence agency.  \n>  \n>“IMPORTANT!” Grigoryeva wrote. “The Russian LGBT network has repeatedly tried to find people affected by the actions of this group, but failed. We did not find a single attack case directly related to this group.”  \n>  \n>**Three days after her post, Grigoryeva was dead.**\n\nAnd finally,\n\n>**Police in St. Petersburg confirmed she had reported being threatened repeatedly, but said the threats had not seemed a risk to her life and were related to domestic conflicts** with people she knew, the RBC media portal reported\n\nBut *there's actually more*. An [article from the official Russian investigative committee site](https://sledcom.ru/news/item/1376526/) (Russian) also says that\n\n>...a previously convicted man from the Kyrgyz Republic,  born 1981, was detained---  \n>  \n>She lead antisocial lifestyle and often got drunk, sometimes in the company of the suspect\n\nThat's **Russian victim blaming classics**. Tell how bad and antisocial the victim was to imply that she *deserved* it and that her death is not significant anyway. Blame a foreigner who already was a criminal. A scum killed a scum during an argument, nothing to see here folks. And a big fat lie. A *social activis*t lead an *anti-social lifestyle*? Was repeatedly getting drunk with sketchy types? And he *just happened* to kill her right after her name appeared on an anti-gay website and she knew they were after her? It is not certain whether the suspect was a member of Saw (or just not said) but there are too many coincidences.\n\n&#x200B;\n\n**LGBT people are forced to leave the country.** They receive death threats and threats that their loved ones will be killed. [Here are screenshots](https://imgur.com/a/qmDQwll)  (Russian) of the threats Artyom Shitukhin, who is also on the list, received, and his story about how they tried to burn his house.\n\nIn short, after the attempt he ran to Netherlands and they told him to pay for his friend's ticket too or he'll be dead in a few days.\n\n&#x200B;\n\n**Tomorrow we may wake up to another victim.** Spread the word. How many people must die so Russian authorities acknowledge the problem? The world can't let it continue, can't let Russian LGBT people live in fear and wonder whether it's their last day alive. We need collective action to stop the gay hunting.\n\nRight now you can [sign the petition](https://www.change.org/p/%D0%B7%D0%B0%D0%BF%D1%80%D0%B5%D1%82-%D0%B2%D1%81%D0%B5%D1%80%D0%BE%D1%81%D1%81%D0%B8%D0%B9%D1%81%D0%BA%D0%BE%D0%B3%D0%BE-%D0%B4%D0%B2%D0%B8%D0%B6%D0%B5%D0%BD%D0%B8%D1%8F-%D0%BF%D0%B8%D0%BB%D0%B0-%D0%BF%D1%80%D0%BE%D1%82%D0%B8%D0%B2-%D0%BB%D0%B3%D0%B1%D1%82) \"For banning and investigation of the Russian \"Saw against LGBT\" movement\"\n\n&#x200B;\n\n**Meanwhile we're open to any help and suggestions as to what to do and whom we can contact.**",
    "title": "Russian LGBT activist Elena Grigoryeva stabbed to death after her name appeared on the list of a \"gayhunter\" group Saw. Gets officially framed as \"domestic murder\", victim slandered and blamed. Authorities lie, refuse to acknowledge the political motivation and do nothing. LGBT people are in danger",
    "subreddit": "Feminism",
    "timestamp": 1564081441,
    "score": 72,
    "keyword": "man lawyer"
  }
]