[
  {
    "text": "Job searching with mental health issues, name changes, and generally offputting work history? Hi guys. I need help regarding questions about my work history, because it's been very unstable due to some life changes and mental health issues, and I'm not sure how to go about anything anymore. I've been out of work for a few months now and it's time I start looking about getting back into the working life. My work history is a bit questionable, so I'll just start from the beginning of my professional career and go from there. \n\nI have a 2 year associates degree in electrical engineering (with a specialty in biomedical technology) and was hired at a hospital as a biomedical technician, basically someone that repairs and maintains medical equipment. I started as an entry level technician directly out of schooling, and was promoted to an intermediate level technician a couple years later. I worked for this employer for 3 years.\n\nI was fired from that job because I was caught sleeping on the job on more than one occasion. I was going through a major chronic depressive episode (I'm diagnosed major depressive disorder and bipolar 2) and was no longer able to preform the functions of the work. I was unemployed for one year following that, and found work at a small company that did field service work for the same thing (maintaining medical equipment for small doctor's offices and surgery centers around the state [Pennsylvania]). It was a small company owned by a man and his wife, and the only employees were me, one other gentleman, and the owners two daughters.\n\nI was fired from that job a year later, allegedly because I drove the company car to a Dr's appointment on my way home from work (and it was agreed that the car would never be used for personal reasons, so it is entirely my fault and I accept that).\n\nI was out of work for another year and figured I would give up on the professional side of my life for then and just find normal work. After all, being fired twice from the same position at two different companies puts a bad taste in a lot of engineer's mouths, so...\n\nI was hired a year after that job at a Sheetz here in Pennsylvania (a gas station / convenience store / restaurant, some are more familiar with Wawa which is kind of the same thing). I was with Sheetz for three years. I started as a janitor, then worked as a front house cashier/kitchen position, then promoted to Shift Manager and ran the night shift. I loved that job... almost more than my engineering positions. \n\nAnyway... During my time at Sheetz, I decided to medically transition (I'm MtF transgender, have been all my life, just never had a chance to finally transition). I went full time, changed my name and gender markers on all of my documentation, have been on hormones for nearly three years now and have been living full time as a passable woman for three years. Sheetz was incredible during my transition and I had zero issues with them as a company, nor from my coworkers and bosses.\n\nHere's where most of my problems come in. My wife and I split up and are divorcing after an 11 year marriage, and I have four children. This past June, my children moved out to live with their mother full time in Nebraska (again I'm in Pennsylvania), and this caused me to become incredibly, majorly depressed and suicidal. I began cutting and have massive scars on my left arm, and spent most of this past summer in various mental inpatient units due to being severely suicidal. \n\nI took FMLA leave and was on short term disability for a few months while all this was happening. When I got released from the hospital and finally returned to work at Sheetz, I only lasted a few days before I realized if I kept working, I was going to either wind up back in the hospital, or be dead. My mental health has been very.... shaky, and it was incredibly difficult for me to return to work, run a team, deal with customers, and just generally be around the knives that I used to try to kill myself months before. So I wound up quitting that job, after three years.\n\nI'm at the point now where I think I'm ok, I'm a bit more stable than I was, but I still have many mental health issues that are making re-entering society a difficult matter. But sitting around stewing about it all isn't going to make things better, and I need to just get back out there and force myself to get better, because sitting around doing nothing all day isn't helping.\n\nI want to get back into a semi-professional field, and there are plenty of electro-mechanical  jobs around here, like maintaining and repairing things like food manufacturing equipment and what not. My problems are these:\n\nHow do I explain to potential employers about why I was fired from my only two professional jobs? And the year long depressive gap between them both?\n\nHow do I explain that I worked those jobs as a man? I really don't want to just flat out tell the employers that I'm trans and give them my old information, but I feel it's almost impossible not to. I'll just have to accept this one and bite the pain back I think.\n\nHow do I explain that I left my last job due to mental health reasons? That I could not emotionally and mentally handle the work or the environment? How is that in ANY way not going to send up a million red flags for the employer?\n\nI also have no professional references, only a couple managerial ones from my time at Sheetz. When a prospective job contacts my previous employers, am I just going to have to grit my teeth and hope they're not told horrible information? I'm not a bad employee, I just had some troubling times. \n\nI feel like anywhere I apply is just going to look at me like a total basket case and not even want to bother giving me a chance. \n\nSorry this post is so long, I really don't know what to do, or where to go.\n\nThanks in advance for any advice you give me. \n-L",
    "title": "Job searching with mental health issues, name changes, and generally offputting work history?",
    "subreddit": "jobs",
    "timestamp": 1576529260,
    "score": 119,
    "keyword": "man engineer"
  },
  {
    "text": "Always clear you info. &#x200B;\n\nHey guys just wanted to pass off some information.\n\nWhen on your work computer it's best not too save all your login and password information to every single account you own and I mean everything netflix, reddit, facebook, twitter, etc........ seriously the list is long.\n\nI have taken over a postion and the previous engineer has done this. he did not delete any of his personal information INCLUDING HIS AMAZON and if i wasn't a nice guy I would ruin his career. the man in question was a dick and thought I would never be able to do his job.\n\nSo ya PSA don't save your personal account info to your work computer you never know whose gonna have access to it at some point. And if you do erase all the cookies and clear the cache.",
    "title": "Always clear you info.",
    "subreddit": "jobs",
    "timestamp": 1552408986,
    "score": 14,
    "keyword": "man engineer"
  },
  {
    "text": "Accepting an offer, but scared to quit current position...seeking advice. Working for a company (5 years in) that hired me to replace a man that was leaving after 25 years.  They wanted someone forever, and I appeared to be that man.\n\nBoss and job have been good to me overall.  Very happy here.\n\nI also wear many hats, as we are a 7 man show (tool shop).  I handle all engineering, fix any computer/network issues,  am the springboard for the boss on ideas, tight with customers, etc.  There is nobody within that can fill the position.  We have 1 main guy that's nearing retirement, and the boss/owner seems to be in cruise control.\n\nMy income dropped by 5k last year due to losing a major customer and not being able to land work...which killed our profit-sharing annual bonus.  Boss is responsible for sales, and made no obvious effort other than phone calls.  Literally went on 1 big sales trip that landed us a few things...but that's it.\n\nAs for my happiness, there are a few things that do still bother me.  I never get to visit customers or go to see the things that I designed in production...an annoying thing that I complained about to my boss when he hired me, as previous employer did the same.  I also am tiring of the long drive in, and having to chase the time clock (hourly).  Being a 1 man department...I am also limited as to when I can take off and for how long.\n\nI'm nearing 40, and was just offered a position at a company I left 7 years ago.  They made major changes (some of which I suggested as contributors when I left during my exit interview).  They have added machines and capability.  They have added really good people, and have been maintaining great profit margins.  The position they offered is just over 50% more than I make now, on salary...45 hrs per week.  I would get my own customers, would be able to travel and follow my projects, and would have bonus potential on any project I head up.  It truly is a position that I can grow into, and the bonus potential in addition to the base salary could yield another 10-15% on top of that.  It's also 10 miles closer to home, and not along a horrible stretch of road that I despise in the winter.\n\nAccepting the offer is the easy part.  Being such a small company, and being so heavily relied upon...what I fear the most is dropping the bomb.  I do plan on giving about a months notice to help with transition.\n\nAny suggestions on conversation starters?  Way's to maintain the bridge, rather than burn it?\n\nAlso, they sent the official offer in this morning and I won't have time to stay after tomorrow or friday to have the talk.  Do I bite the bullet and just talk to him this afternoon?  Ugh.  Dreading this.\n\n&#x200B;\n\nPS. I already typed a resignation letter, as is standard (in my opinion)  \n\n\nEdit:  Thanks for the input, guys!  It really did help ease my mind.  I dropped the bomb on Friday and gave 4 weeks notice.  He met with me on Monday and offered me a check for $4k if I stay an extra 4 weeks (8 total).  He is concerned that we won't have time to find, hire, and train someone before I'm gone.  Given that I literally handle everything from an IT and engineering standpoint, it would really hurt bad if I weren't able to at least properly pass the torch...  \n\n\nI asked the new boss if they would let me do that, and offered to start working from home for them on my dollar a few hours per week until I officially start as a 'thank you' and as a showing of good faith.  The new boss wants to discuss tomorrow...",
    "title": "Accepting an offer, but scared to quit current position...seeking advice.",
    "subreddit": "jobs",
    "timestamp": 1549479353,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "How to get a Job in USA? Hi. \nI was born in America and raised in Korea for most of my life. \nI went to Korean elementary, middle, high school and college. \nAlthough I have dual(US-S.kor) citizenship, I am actually Korean. \nI am freash man and my major is \"organic material science and engineering\". Professors said my major is sort of chemical engineering.  Sadly I think there is no major called 'organic material science and engineering' in American University. \n\nSince my school is not bad, and I am in engineering, It's not hard to get a fine jobs in here(generally my college students earn 35,000$ for first salary)\nBut these days It's tough to live in Korea. Micro dusts from China, northkorea, birthrate 0.9 Dark future etc..\nSo I'm thinking of getting job in USA. But I don't know how!!\n\n1. I know Intership is crucial to get a job in USA\nBut I think it's hard to do that while I am in Korean school. \n\n2.Transfer to American school. It's good idea but my Financial situation couldn't afford to pay school fee and living fee for two years. \n\n3. Go to graduate college in U. S \nI couldn't afford it unless I get enough scholarship and funds.. and I know It's very difficult to get it. Graduate students are cashcow of college :(\n\n4. Some people told me go to Canadian graduate school. I have few information of Canadian school. Funding and scholarship is very very important to me. \n\n5. Go for PH. D     It's easy to get funding but\nIt's way too far... I am just freashman and I don't know I am suit with it. \n\n6. I will bet my life for studying English. Because of military obligation, my age is 21(borned in 97)\n\n\n7. I really appreciate it if you give me Any ideas or suggestions/roadmaps to get a job in U. S \nThank you",
    "title": "How to get a Job in USA?",
    "subreddit": "jobs",
    "timestamp": 1555146859,
    "score": 10,
    "keyword": "man engineer"
  },
  {
    "text": "Prior to the Wright Brothers first successful flight, what did scientists/engineers etc believe about the chances of man ever building a machine that would allow them to fly?",
    "title": "Prior to the Wright Brothers first successful flight, what did scientists/engineers etc believe about the chances of man ever building a machine that would allow them to fly?",
    "subreddit": "AskReddit",
    "timestamp": 1570567705,
    "score": 4,
    "keyword": "man engineer"
  },
  {
    "text": "Engineers of Reddit, what is the most impressive man made feat of engineering you've seen, past or present?",
    "title": "Engineers of Reddit, what is the most impressive man made feat of engineering you've seen, past or present?",
    "subreddit": "AskReddit",
    "timestamp": 1551706818,
    "score": 4,
    "keyword": "man engineer"
  },
  {
    "text": "What's the closest the US army could come if it allocated all of its resources (time, money, technology, top scientists/engineers, etc.) towards creating the Iron Man armor within ten years?",
    "title": "What's the closest the US army could come if it allocated all of its resources (time, money, technology, top scientists/engineers, etc.) towards creating the Iron Man armor within ten years?",
    "subreddit": "AskReddit",
    "timestamp": 1565038342,
    "score": 4,
    "keyword": "man engineer"
  },
  {
    "text": "Engineers of Reddit, what do you find most unrealistic about Tony Stark's development of Iron Man suits?",
    "title": "Engineers of Reddit, what do you find most unrealistic about Tony Stark's development of Iron Man suits?",
    "subreddit": "AskReddit",
    "timestamp": 1557017468,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "I am a hijabi girl living in italy and today i feel so alone I was born in Italy and for 23 years this is the only reality that I lived in. Sometimes i hear mans shouting at me \"go back to you country!\" But the truth is that this is my only country. My parents moved here when they were 19 years old, they are now in their 60s. They lived a very little amount of time in the middle East compared to what they lived here and i really love Italy, i love the art, the culture, the language. I feel like an Italian but im not being seen as one. I wear a hijab and that automatically make me a foreigner, someone to fear, someone who doesn't speak Italian or, way worse, a woman that have no rights to speak up for herself and has no opinion. \nThey see me as an empty can, a submissive woman that can be mocked. \nI'm a lot of things: a feminist, an engineer, an introvert, an Italian. They see me as... Nothing. \nThis make me feel so bad and alone. I feel that everything I do, they will see it as something \"a Muslim girl do\". If i make a mistake they think \"look how Muslim behave\" and this made me develop a fear for every action I take. Sometimes i feel like I need freedom, the freedom to do anything without thinking that other people will think bad of Muslims because of me. I feel a giant weight on my shoulders and I just want to be...me. \nAn hour ago i was walking with my fiancé, we were having a good time. The weather was good, we had lunch out and did a walk in a park i like a lot.\nWhile I was going back home i was crossing the road. A bus stopped to let me pass and i thanked him. He opened the window and start yelling at me \"you are just a f---ng Muslim. Clear the road or I'll kill you!\" Then he started to swear and began to call me \"sl-t, w--e\" and such.\nThere were a lot of people but no one said anything, instead a group of boys started to laugh and yelled to the bus driver that he was the best. \nI felt so alone. I'm home now, but i fell like i don't want to get out anymore. I feel like i have no country that i can call home, no people that will stand for me, nothing, no one. \nThis isn't the first time something like this happen to me, but this time it hit me hard. \nIm an Italian just like many others, the only difference is the scarf i choose to wear.\nBut that scarf...people can't see the girl behind the scarf and that hurts so much.\n\nI just wanted to share this story to tell that sometimes it's not the hijab that make a Muslim girl oppressed. Its the people who can't understand her choice and make her feel like she is nothing but a scarf.\n\nEdit: hello! Ive read all the comments and i thank you all for the support and for stating your opinions! I didn't thought this will have so many comments, i will try to answer to all of you!\nI want to make some points clear:\n- I didn't intend in any way to insult italians.\n- I know that taking off the hijab is a solution but this will not solve the problem. I can take it off but other muslim women will be harassed. \n- I reported the bus driver. It came out that he is very famous among his colleagues for his behaviour and it's not only racist toward muslim but toward other italians too. \n- Im really grateful to the people who shared their experiences under my thread and really grateful to people who stated a different opinion in a gentle way.\n- I reported at least 23 PM of people who wish me to die or told me to leave Europe because this is not my place. I hope that this doesn't happen with woman/mans who shares their stories on this sub. My story wasn't so terrific but on this sub we have rape survivors and such and i hope they doesn't get this treatment in their PM.",
    "title": "I am a hijabi girl living in italy and today i feel so alone",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1563064967,
    "score": 553,
    "keyword": "man engineer"
  },
  {
    "text": "My family is playing Battle Of The Sexes and it’s really awkward because of so many reasons. 1. I’m the only child in the family who’s currently in college or had any interest in college. I’m a female in electrical engineering bachelors degree program. So I’m a “boy on the girls team” apparently\n\n2. My family is all very right leaning and very “women are women and men are men” \n\nThey keep acting like I should know men’s questions because of my degree then get upset when I don’t and joke that I’m “really a girl” and my lack of “mans knowledge” proves it. \n\nAlso this game is so stupid. Every question I hear I think “wait, how is this a WOMEN question?” Like for example it asked what a large roll of fabric is called (a bolt) and if dill is a spice, herb, or both (both) and it felt awful because my husband loves to cook and my brother is a fashion guy, so duh they know. How is that a “women’s” question? I know this game is old but is it THAT OLD?\n\nI didn’t realize just *how* feminist I was until I had to experience the first half of a game of Battle of the Sexes for the first time in ten years. \n\nWe’re playing Yahtzee now lol",
    "title": "My family is playing Battle Of The Sexes and it’s really awkward because of so many reasons.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1574977777,
    "score": 66,
    "keyword": "man engineer"
  },
  {
    "text": "\"Good girl\" I have an engineering internship at a large, multi-national defense and commercial firm. It's mostly male, but there are a good amount of women in the work force and sexism is largely absent from the day to day here, which is nice. Despite this, occasionally I have to roll up my sleeves and fight the feminist fight- *especially* among the older men here.\n\nSo today, I'm sitting at my desk doing whatever. I'm working next to a guy in his mid 60s. A woman (in her mid 40s, *who trained him*) who works in the section next to us grabbed something on her way over to our desk for him, and in response, he said she was a \"good girl\".\n\n....\n\nI saw red. It is not okay to call grown women \"girls\". Let me repeat this for the people in the back: IT IS NOT OKAY TO CALL GROWN ASS WOMEN \"GIRLS\". I immediately called him out on how patronizing it was to call a grown ass woman a \"girl\", and that \"good girl\" is the kind of thing you say to your *dog*. He genuinely seemed confused. He said he \"didn't think like that\" and demanded to know what the cutoff is to stop calling a woman a girl (pretty much the same moment you stop calling a man a boy, ffs). He didn't understand till I pointed out he would never, ever, not in a million years, say \"good boy\" to a fellow man unless he was being patronizing, and that changing the gender of the person addressed should not change the level of respect due.\n\nI almost said nothing. I almost kept my mouth shut and let it slide, because really, it's not a big deal, right? WRONG. These kind of microinteractions are the fuel of sexism in the everyday interactions we have with people. It's this kind of innocuous, \"innocent\" shit that keeps us down in the long term. This kind of thing, while small and seemingly meaningless, *is not okay*, and people (cough men) are not going to stop unless we start demanding basic respect. \n\nI AM NOT A GIRL. I will not be addressed as one.\n\nEdit: hell yeah, bring on the trolls! If you can't see why this kind of thing is a problem, you ARE the problem.\n\nEdit 2: since there seems to be some confusion, let me clear this up- I didn't explode on this guy. I had a conversation with him, which he was receptive to. I actually like him, and working with him (he's nice, even if he's out of touch), and didn't ruin any relationships here. Me typing about it angerly =/= the intensity of my reaction. Me \"seeing red\" = literary expression. Come on, guys.",
    "title": "\"Good girl\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1547140879,
    "score": 65,
    "keyword": "man engineer"
  },
  {
    "text": "I knew I shouldn’t have went there, but did it anyway. Heads up, this is not the most interesting incident, but I’m just sick of this shit.\n\nI’m on my way to a friends house for some pizza and beer. My job was to get the beer. \n\nI was just gonna stop at a gas station convenience store on the way there to pick up whatever they had. I see one on the way. I pull up to it. There’s your group of 5-7ish men hanging outside. Not the greatest part of town. Pretty typical sight for this area.\n\nI decide it’s too many men to risk getting out of my car and walking right by them. So I drive right through  the parking lot to find another station. They stare me down the whole time. \n\nI’m driving around for another 5 minutes and can’t find one. I decide to just go back. How many times have we dealt with a bunch of creepy gas station dudes? It’s like 8pm. It’s dark, but the gas station is brightly lit. I’m sure it’s fine.\n\nThere are cars parked in all the bays, so I can’t park right in front of the store. I park right to the side, where it is less lit. There’s an air pump in front of the spot I’m in. \n\nI go to open my car door and get out and a man is already walking over to me. He’s telling me about how he can fill the tires in my car, and some other stuff, but I couldn’t understand him. I barely have one foot out the door. He’s right next to my car by the driver’s side tire. \n\nI smile and nod and say “oh, no thanks, I’m alright!” As he’s still talking. He keeps standing there saying things at me that I can’t understand. As I said, I only had one foot out of the car and I was just standing up and he’s already at my door with his bullshit. He’s very close to me, but my door is blocking any access to my person. \n\nSo I noped right back into my seat, closed the door, locked it, turned my engine on and peeled out.\n\nHe was still standing there, looking at me and yelling through my window at me, but I couldn’t understand him. \n\nI don’t know if he wanted money or what but honestly dude what the hell. If you’re indeed just begging for cash don’t approach women like that. Anyone, really. But don’t be shocked when I need to run away from you. You way too close bruh. That shit was enough to set off my fight or flight and I fully expected to get my car window broken as I was trying to leave.",
    "title": "I knew I shouldn’t have went there, but did it anyway.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1575061899,
    "score": 60,
    "keyword": "man engineer"
  },
  {
    "text": "Oregon Unconstitutionally Fined a Man $500 for Saying ‘I am an Engineer,’ Federal Judge Rules",
    "title": "Oregon Unconstitutionally Fined a Man $500 for Saying ‘I am an Engineer,’ Federal Judge Rules",
    "subreddit": "engineering",
    "timestamp": 1546465468,
    "score": 1056,
    "keyword": "man engineer"
  },
  {
    "text": "Von Mises in Thick Walled Cylinders Hello fellow engineers,\n\nIt has been quite some time since I've last engineered a part from scratch and seem to have forgotten how to do von mises stress calculations. The part I am designing is a thick walled cylinder (no end caps), I already have gotten the maximum hoop stress at a point of interest, the shear stress, and the radial stress. I also have the minimum hoop stress calculated as well. I took a look at my textbook and my notes from college, but man it doesn't make too much sense to me right now. Like with Mohr's circle, they show sigma2 = a certain number, then they just randomly (imo) make sigma2 = 0 and sigma3 = what sigma2 was. So I don't know what's going on with that. I'd greatly appreciate it if somebody could either send a link to a tutorial for von mises in thick walled tubes or could explain it better than the textbook could.\n\nMuch appreciated!",
    "title": "Von Mises in Thick Walled Cylinders",
    "subreddit": "engineering",
    "timestamp": 1574655817,
    "score": 13,
    "keyword": "man engineer"
  },
  {
    "text": "Is there software that can make accurate measurements/drawings of objects in 2D from a regular picture? So I work in sealing solutions, and one of the main problems we encounter are reverse engineering gaskets. I don't mean copy-catting or some such nonsense- I mean a customer needs a gasket replacement from a flange that might be 20 years old. There is no drawing, no pictures, no reference- just the gasket itself as a sample. We then have to take the sample and reverse engineer it. This takes a considerable amount of time. The main problem is that simply taking a picture and then scaling it in AutoCAD doesn't work very well- even if you scale the image to a set of points, while they may be accurate (for our needs, +/- 10-15 thousandths, less if possible), they often are only accurate at your reference point- so by the time you're 12 inches away, you're an entire .250\" or more off. \n\nWe can iterate and work with this, and we do. Thing is, I just have to believe there is some software out there that will either-\n\nA) give us dimensions/geometry for complex shapes \nB)give us a file/dxf that can be imported right into AutoCAD\n\nC) something else that could be helpful that I'm not thinking of \n\nThis would save several man hours per large, complicated gasket- and maybe most crucialy- prevent us from actually needing the sample to be shipped or driven all the way to our location. They could be states away and we could produce a drawing and gasket for them asap. \n\nAny input would be greatly appreciated!",
    "title": "Is there software that can make accurate measurements/drawings of objects in 2D from a regular picture?",
    "subreddit": "engineering",
    "timestamp": 1568126423,
    "score": 7,
    "keyword": "man engineer"
  },
  {
    "text": "Dorm air conditioner idea As an engineering student living in a dorm, unfortunately there are rules we have to follow. One of them is we aren’t allowed to have an air conditioner. But what they failed to realize is I’m an up and coming engineer with a need to build things to satisfy my cravings. As an idea, so my ra won’t find out I do have a conditioned room was to build a disguised air conditioner. Here is my plan:\n\n\nSo I have a decent sized refrigerator I don’t need sitting in my basement. I was planning on taking the compressor from that and putting it outside with a line running to a box fan with aluminum tubing weaved through it as a poor mans condenser. From there I was planning on buying an orifice tube to change pressures. Again as an evaporator, I would weave the tubing between another box fan and blow it into my room and back around to the compressor. \n\nAny thoughts on this design?",
    "title": "Dorm air conditioner idea",
    "subreddit": "engineering",
    "timestamp": 1554965201,
    "score": 5,
    "keyword": "man engineer"
  },
  {
    "text": "Amazing students reflected & recovered after edTPA filming nightmare My first day of edTPA filming on Monday was a disaster. Sophomores and juniors who could not stay off their phones (despite a charging station I set up outside of camera view), could not stop having side conversations (whispering doesn’t work if EVERYONE IS DOING IT), could not focus, could not stop touching/hitting their neighbors... everything that could go wrong for this group, did. At least I didn’t have a fight break out. \n\nI tried to reassure myself that I’d just get footage from the other two lessons in the learning segment. I really, really wanted to salvage the lesson. But when I looked at their assessments and exit slips I literally cried. Most of them, my focus students included, hadn’t hit a single learning objective I had set.\n\nI decided to use that lesson as a diagnostic and just start from square one today. I reworked my next lesson to give them more inquiry/analysis time and do less explaining for them. I had a plan and I felt okay about it, but I still wondered about the implications of their behavior. Did we not have the rapport I thought we had? Did they just like me, but not respect me? \n\nOne of my advisory students this morning showed me a screenshot from Snapchat. Another student posted a message saying, to whoever had my psychology class the next day: \n\n“be respectful to her man, her recording of her teaching the class is her future just pay attention. Be quiet, and cooperate for like two or three classes. She’s done nothing wrong and y’all out here disrespecting her.” \n\nHe wrote two more short paragraphs about how they should know how to act and not to get mad when I take away the incentives I promised for their best efforts. Apparently the message had circulated throughout the school, because I had students all day coming to me to apologize for their behavior and ask if I’d seen what he wrote.\n\nWhen our class period rolled around, everyone was on board. I didn’t have to wait to begin the lesson, I had everyone’s eyes during instruction, and even my students who normally need to be reminded to stay on-task really applied themselves to the activity. \n\nWe had so many good conversations and they had so many great questions about the first part of the lesson and the activity that we never got to the formal assessment. Now I have to rewrite or reverse engineer my lesson plans... which feels like a great problem to have.\n\nTl;dr my 10th/11th grade students totally checked out of my first edTPA lesson, but reflected on their behavior before I even got the chance to address it with them. They really came through for me today when I restarted filming.",
    "title": "Amazing students reflected & recovered after edTPA filming nightmare",
    "subreddit": "Teachers",
    "timestamp": 1551317059,
    "score": 61,
    "keyword": "man engineer"
  },
  {
    "text": "I feel so lost (marrying a teacher) I'm marrying the love of my life in less than a month! I am a 28 yo man who works in engineering, she's a 25 yo woman who teaches 6th grade English. She's been teaching for a few years now in a few different positions at various schools.\n\nI understand how tough it is to start a career. I myself had times when I was working 70 hours a week. And I understand there are elements of teaching that I will never be able to relate too. But her career is putting a huge strain on her mental, and now physical, health. It's starting to even affect me and our relationship negatively.\n\nShe's always questioning if she really enjoys teaching. She insists she doesn't care about the students most of the time, even says she hates them sometimes. She works twice as many hours as I do and gets paid less than half of what I make. The stress has gotten so bad that she has developed severe muscle tension. A doctor prescribed her muscle relaxers and pain killers. So now when she's not grading papers at home, she's passed out from the meds. Her health is not where it should be, and her family tree is filled with cancer, heart disease, diabetes, etc. so it is ESPECIALLY important that she maintains a healthy lifestyle and mental clarity.\n\nI do all the cooking, all the cleaning in our house, I drive us wherever we need to go. And I work 40+ hours a week and have a 2 hour commute every day. I'm starting to feel like our relationship is one-sided.\n\nI was hoping she would get wise advice about work/life balance from more experienced teachers she works with. But when she talks about that with them, all they say is \"My husband doesn't like how much I work either. Men are so clingy\" thus further cementing the idea that work/life balance simply isn't possible as a teacher. My fiance has even said \"This is the life of a teacher. If you don't like it, don't marry me.\n\nI think her defensiveness comes from knowing she can't contribute to our relationship as much as I can right now. I know she loves me, and I know I love her. I have no doubts about marrying her. But the lifestyle we have right now is simply not sustainable, *especially* in a marriage and *especially* when we have kids someday. And if we're struggling with work/life balance *before* we're married I can't imagine it improving after.\n\nAt the moment, she is currently a long-term sub. So my suggestion to her is to simply be a daily sub (which she would be able to do as often as she'd like since we have very big districts around us) after her contract is up. She likes that idea too, but she wouldn't want to do that for too long. My fear is that she has become so distant from her true self that she might not be able to come back to her real self. She is so different than who I know she really is right now. It's like she's a totally different person.\n\nSorry for the long post. I just feel so lost and I don't know where to turn to. I feel so rejected by her, although I know she does not intent to make me feel that way. And I'm so scared for her health. She is ALWAYS having some sort of physical ailment that can be related to stress.\n\nTL;DR\nMy fiance's teaching career is taking over her life and damaging our relationship. I've been as supportive as anyone possibly can imo, but now it's damaging her mental and physical health (and her family tree already has tons of horrible mental and physical health problems). I feel like her entire life exists to support her students, and now I'm starting to feel like my entire life exists to support her students too.",
    "title": "I feel so lost (marrying a teacher)",
    "subreddit": "Teachers",
    "timestamp": 1568995848,
    "score": 14,
    "keyword": "man engineer"
  },
  {
    "text": "Sharing post for thought, way more in depth post for this sub than normal probably; person trying to figure what career path to go down So I'm young, but at a point in life where I am putting my energy in to things that interest me in some way. I went through a nervous breakdown a year ago in the middle of getting really in to engineering studies at school which made things super confusing. I no longer had the will to put in to studying engineering and it literally still gives me anxiety that I can't seem to comfort when I think again to hunching down and settling back in to it. That said, I didn't think I could totally abandon the idea either since there were other temporary circumstances going on in life that I figured were reasons for my anxiety.\n\n&#x200B;\n\nI've spent the last year networking and whatnot trying to get some real engineering experience so I could see it outside of school. And honestly, today, I went to a design meeting for the upgrade of a water treatment plant It is probably the most exposure I've had to the work life of an engineer. I spoke with one man who is an engineer and he asked what I thought; aside from anxiety, I knew that I liked the idea of working in a team to problem solve and provide creative solutions. I asked what he liked about the job, and he said he liked everything from the design to maintenance. I got to talk to the people who designed it as well. I feel like any engineer I talk to though, I'm just smiling, trying to find some sort of moment or nugget of wisdom that makes me feel good enough to confidently go down that career path. I didn't mind being in the meeting though, but I didn't love it either. I think part of the anxiety is just returning to studies and wondering how on earth I can push through to get a degree with the anxiety and weighing whether it's worth it or not.\n\n&#x200B;\n\nAnyway, a lot of detail, but when I'm trying to think of things I like doing for work, it's hard for me to brainstorm and think of something. One thing I notice though is that I like teaching and helping people understand things that they're interested in. Kids always make me smile for some reason. I find it fun to work with kids and get a rewarding feeling from it. Through the networking there was actually a short time where I helped out in a summer camp for a short while. It was just arts and crafts but also some education. I couldn't help but smile a lot at little things. It makes me wonder if I might like teaching. I'm searching for a key to happiness here but just needed to vent a bit.",
    "title": "Sharing post for thought, way more in depth post for this sub than normal probably; person trying to figure what career path to go down",
    "subreddit": "Teachers",
    "timestamp": 1564524530,
    "score": 1,
    "keyword": "man engineer"
  },
  {
    "text": "What sort of trade should I pursue in Ontario (but not Toronto)? Tl;dr: I have a diploma in Electronics Engineering Technology and am hoping to for a relevant trade that has moderate travel requirements.\n\n&#x200B;\n\nI am 38. Not too late, lol.\n\nI have a diploma in Electronics Engineering Technology, which I earned after the family business bit the dust and I wasn't sure what to do with myself. I graduated at the top of my class and I am determined to spool this into something.\n\n(I have a fancy R&D job right now, but the lab is shutting down and there is nothing else high-tech around here.)\n\nThe jobs I can find require extensive travel (away from home for months at a time), or are in Toronto (too far), or have below-average pay.\n\nMeanwhile I have plenty of construction experience. I used to form concrete as a summer job, have installed structured cable, worked as a carpentry labourer, etc. I also have experience plumbing, building cabinets - you name it.\n\nThe trades are looking pretty good, guys. I am in good shape, and my Dad just flipped a house and did most of the work himself. Not bad old man!\n\nSo I would love to apprentice and get a ticket for something - but what? It is ***hard*** to get into a licensed trade, so I would like to focus my efforts.\n\n1. Electrical. Natural choice. The diploma would shave off a year of the apprenticeship, if I understand correctly. I could try to go the industrial route: I actually taught a course on PLCs. Competition seems absurdly steep though. Everyone wants to be a sparky for some reason.\n2. HVAC. It's tough to make sense of the qualifications here. There are the three levels of gasfitter licenses, but then there is 313a and 313d for refrigeration. What is going on here? Do people get all of these? What about the controls/electrical part of HVAC - is that its own ticket?\n3. Instrumentation. I am not sure what the deal is, since 447a not a compulsory trade, but it seems fascinating to learn. I think these guys travel all over, though, and that is what I want to avoid.\n\n&#x200B;\n\nHelp me decide - and is there anything else you might suggest?",
    "title": "What sort of trade should I pursue in Ontario (but not Toronto)?",
    "subreddit": "careerguidance",
    "timestamp": 1559829861,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "How do I present myself to recruiters? (Resume struggles) I'm an IT professional. Took the past year off from working to finish my Associates of Science, just because. Going back to work, and I'm realizing that I need to remake my resume.\n\nPart of my issue is that, as a double edged sword, I know I'm far more qualified than the typical candidate, although that doesn't necessarily come across from my current resume/portfolio. I started programming in my early teens, back in the 2000's, and was headhunted almost right out of high school by a big tech company. I've worked with almost every mainstream language and technology out there, and quite a few fringe ones as well. I'm fully proficient in front end and back end web development, desktop and mobile application development, database architecture, APIs, video game programming (physics engines, rendering engines, etc). I've worked on open source operating systems, programmed programming languages, heck, I've even programmed telephone systems and networking infrastructure (like router firmware). This over a period of almost 12 years.\n\nI firmly believe I fall in the category of \"10x programmer\" because I've seen in almost every job I've ever had, I'm vastly more productive/efficient than most of the other programmers, or I've always finished projects in less than a quarter of the time frame allotted. If it sounds like I'm just deluded or bragging, trust me, there are many aspects of life that I'm average or below at, but software is one thing I know in and out, in my sleep, with a wireless mouse tied behind my back. And I have plenty of IQ/\"Standardized Test\" type scores that put me in the 99 percentile range (for the record, I don't think that means anything good or bad about me as a person, except that it provides me some objective reference to think I'm not crazy to think I'm exceptionally good a few very specific things, like math and programming).\n\nThe field being what it is, ninety percent of the jobs are filled by non-technical recruiters that play middle-man between the employers and us STEM candidates. From my experience, recruiters only care about three things:\n\n* Years of experience using _____ (Specific technology their client is hiring for)\n* In the last year specifically, experience using ______\n* Talking about projects that you've worked on that used ______\n\nI find this really handicaps me and results in recruiters ruling me out for submission for many positions that I know 100% I'm well qualified for. They always say, \"Okay, so you're a PHP developer.\" Or, \"You're a front-end developer.\" Or, \"You're a database guy\". I don't understand why it's apparently inconceivable that a person could be good, even really good, at more than one language or technology. Or why you can have seven years of experience with something in the past, but if you didn't specifically get paid to use it in the last year, you're assumed to have almost no relevant experience? I know these technologies change rapidly, but come on, programming doesn't change THAT much from year to year, especially regarding long-established technologies.\n\nSo that's where I'm at:  Working on making a new resume from scratch, brainstorming on how to present myself to hopefully convey, concisely and professionally, the kind of jobs I'm capable of performing.\n\nAny tips/ideas?",
    "title": "How do I present myself to recruiters? (Resume struggles)",
    "subreddit": "careerguidance",
    "timestamp": 1558542156,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "Master list of Free Resources With the holidays coming up, I wanted to share some mostly free resources (well the books and some courses aren't free) that I've used for preparation in the past. If you have any resources that worked for you, let me know and I'll add it onto this list. My goal is to create a master list so everyone knows about which resources might be helpful.\n\nLeetcode Question Sets:\n\n* [https://leetcode.com/discuss/interview-question/352460/Google-Online-Assessment-Questions](https://leetcode.com/discuss/interview-question/352460/Google-Online-Assessment-Questions)\n* [https://leetcode.com/discuss/interview-question/344650/Amazon-Online-Assessment-Questions](https://leetcode.com/discuss/interview-question/344650/Amazon-Online-Assessment-Questions)\n* [https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-100-LeetCode-Questions-to-Save-Your-Time-OaM1orEU](https://www.teamblind.com/article/New-Year-Gift---Curated-List-of-Top-100-LeetCode-Questions-to-Save-Your-Time-OaM1orEU)\n* [https://medium.com/@koheiarai94/60-leetcode-questions-to-prepare-for-coding-interview-8abbb6af589e](https://medium.com/@koheiarai94/60-leetcode-questions-to-prepare-for-coding-interview-8abbb6af589e)\n* [https://h1ros.github.io/posts/coding/leetcode-top-100-problem-selection/](https://h1ros.github.io/posts/coding/leetcode-top-100-problem-selection/)\n* [https://github.com/fterh/leetcode-curation-topical](https://github.com/fterh/leetcode-curation-topical)\n* [https://github.com/liuchuo/LeetCode-Top100](https://github.com/liuchuo/LeetCode-Top100)\n\nSystem Design:\n\n* System design template - [https://leetcode.com/discuss/career/229177/My-System-Design-Template](https://leetcode.com/discuss/career/229177/My-System-Design-Template)\n* [System Design Primer](https://github.com/donnemartin/system-design-primer)\n* [Grokking the System Design Interview](https://www.educative.io/collection/5668639101419520/5649050225344512) \\*this isn't free but widely used\n* [https://www.youtube.com/watch?v=iJLL-KPqBpM](https://www.youtube.com/watch?v=iJLL-KPqBpM)\n\nBehavioral/Deep-Dive:\n\n* [https://www.youtube.com/watch?v=PJKYqLP6MRE](https://www.youtube.com/watch?v=PJKYqLP6MRE)\n* Amazon's official interview guide - [https://www.amazon.jobs/en/landing\\_pages/in-person-interview](https://www.amazon.jobs/en/landing_pages/in-person-interview)\n\nGeneral Interview Resources\n\n* Careercup\n* Glassdoor\n* Catalog of all FAANG interview information on Rooftop Slushie [https://www.teamblind.com/article/Catalog-of-FAANG-interview-information-MRLji71n](https://www.teamblind.com/article/Catalog-of-FAANG-interview-information-MRLji71n)\n* [https://www.freecodecamp.org/](https://www.freecodecamp.org/)\n\nBooks:\n\n* Cracking the Coding Interview by Gayle Laakmann McDowell (6th edition) [https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/](https://www.amazon.com/Cracking-Coding-Interview-Programming-Questions/dp/0984782850/)\n* Computer Science Distilled [https://www.amazon.com/Computer-Science-Distilled-Computational-Problems/dp/0997316020](https://www.amazon.com/Computer-Science-Distilled-Computational-Problems/dp/0997316020)\n* [Distributed Systems for Fun and Profit](http://book.mixu.net/distsys/single-page.html) \\- free book, 100 pages or so, but excellent content\n* Designing Data Intensive Applications by Martin Kleppman - this is a more in-depth book, and you can get it on Amazon/libgen\n* The Google Resume by Gayle Laakmann McDowell (1st edition)\n* Programming Interviews Exposed\" by John Mongan, Noah Suojanen (3rd edition)\n* Elements of Programming Interviews\" by Adnan Aziz, Tsung-Hsien Lee, and Amit Prakash (2nd edition)\n* System Design Primer\" by Donne Martin\n* Grokking Algorithms (free to read online) [https://www.manning.com/books/grokking-algorithms](https://www.manning.com/books/grokking-algorithms)\n\nCourses\n\n* [https://www.educative.io/courses/grokking-the-system-design-interview](https://www.educative.io/courses/grokking-the-system-design-interview) \\*this isn't free but widely used\n* [https://www.educative.io/courses/grokking-dynamic-programming-patterns-for-coding-interviews](https://www.educative.io/courses/grokking-dynamic-programming-patterns-for-coding-interviews) \\*this isn't free but widely used\n* [https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/](https://ocw.mit.edu/courses/electrical-engineering-and-computer-science/6-006-introduction-to-algorithms-fall-2011/)\n* [https://www.youtube.com/watch?v=y62zj9ozPOM&list=PLhQjrBD2T3828ZVcVzEIhsHVgjANGZveu](https://www.youtube.com/watch?v=y62zj9ozPOM&list=PLhQjrBD2T3828ZVcVzEIhsHVgjANGZveu)\n\nBlogs\n\n* Netflix tech blog - [https://medium.com/netflix-techblog](https://medium.com/netflix-techblog)\n* Uber - [https://eng.uber.com/](https://eng.uber.com/)\n* Twitter - [https://blog.twitter.com/engineering/en\\_us.html](https://blog.twitter.com/engineering/en_us.html)\n* Airbnb - [https://medium.com/airbnb-engineering](https://medium.com/airbnb-engineering)\n* Airbnb - [https://airbnb.io/](https://airbnb.io/)\n* Here's a consolidated list of company-wise engineering blogs: [https://github.com/kilimchoi/engineering-blogs](https://github.com/kilimchoi/engineering-blogs)\n* [https://medium.com/outco](https://medium.com/outco)\n* [https://medium.com/@liyin2015](https://medium.com/@liyin2015)\n* [https://medium.com/@sourabreddy](https://medium.com/@sourabreddy)\n* [https://github.com/donnemartin/system-design-primer](https://github.com/donnemartin/system-design-primer)\n* [https://www.geeksforgeeks.org/](https://www.geeksforgeeks.org/)\n* [https://github.com/sindresorhus/awesome](https://github.com/sindresorhus/awesome)\n* [https://github.com/liyin2015/Algorithms-and-Coding-Interviews](https://github.com/liyin2015/Algorithms-and-Coding-Interviews)\n* [https://medium.com/leetcode-patterns](https://medium.com/leetcode-patterns)\n* [https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed](https://hackernoon.com/14-patterns-to-ace-any-coding-interview-question-c5bb3357f6ed)\n* [https://www.programcreek.com/2012/11/top-10-algorithms-for-coding-interview/](https://www.programcreek.com/2012/11/top-10-algorithms-for-coding-interview/)\n\nYoutube channels/playlists that I found helpful:\n\n* [Back to Back SWE](https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA) \\- playlists [https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA/playlists](https://www.youtube.com/channel/UCmJz2DV1a3yfgrR7GqRtUUA/playlists)\n* [Tushar Roy](https://www.youtube.com/user/tusharroy2525)\n* [happygirlzt](https://www.youtube.com/channel/UCamg61pfZpRnTp5-L4XEM1Q)\n* Nick White's Leetcode explanations - [https://www.youtube.com/playlist?list=PLU\\_sdQYzUj2keVENTP0a5rdykRSgg9Wp-](https://www.youtube.com/playlist?list=PLU_sdQYzUj2keVENTP0a5rdykRSgg9Wp-)\n* Tushar Roy - [https://www.youtube.com/user/tusharroy2525/playlists](https://www.youtube.com/user/tusharroy2525/playlists)\n* mycodeschool - [https://www.youtube.com/user/mycodeschool/playlists](https://www.youtube.com/user/mycodeschool/playlists)\n* Tech Dummies - [https://www.youtube.com/channel/UCn1XnDWhsLS5URXTi5wtFTA/playlists](https://www.youtube.com/channel/UCn1XnDWhsLS5URXTi5wtFTA/playlists)\n* CS Dojo [https://www.youtube.com/channel/UCxX9wt5FWQUAAz4UrysqK9A/playlists](https://www.youtube.com/channel/UCxX9wt5FWQUAAz4UrysqK9A/playlists)\n* Jeff Dean's talk at Stanford: [www.youtube.com/watch?v=modXC5IWTJI](http://www.youtube.com/watch?v=modXC5IWTJI)\n* Building Billion user Load Balancer at Facebook: [www.youtube.com/watch?v=bxhYNfFeVF4](http://www.youtube.com/watch?v=bxhYNfFeVF4)\n* Netflix Guide to Microservices: [www.youtube.com/watch?v=CZ3wIuvmHeM](http://www.youtube.com/watch?v=CZ3wIuvmHeM)\n* Amazon DynamoDB deep dive: [www.youtube.com/watch?v=HaEPXoXVf2k](http://www.youtube.com/watch?v=HaEPXoXVf2k)\n* [Abdul Bari’s Youtube Channel](https://www.youtube.com/channel/UCZCFT11CWBi3MHNlGf019nw)\n* Derek Banas tutorials [https://www.youtube.com/user/derekbanas](https://www.youtube.com/user/derekbanas)\n\nIntro to CS\n\n* [https://github.com/ossu/computer-science](https://github.com/ossu/computer-science)\n* [https://github.com/ForrestKnight/open-source-cs](https://github.com/ForrestKnight/open-source-cs)\n* [https://upskillcourses.com/courses/essential-web-developer-course](https://upskillcourses.com/courses/essential-web-developer-course)\n\nedit------\n\nadded some of the links/resources people commented. Put youtube channels at the bottom.",
    "title": "Master list of Free Resources",
    "subreddit": "cscareerquestions",
    "timestamp": 1575269326,
    "score": 2555,
    "keyword": "man engineer"
  },
  {
    "text": "Have you ever wondered what the hiring process was 20 years ago compared to today? Probably not, but I'll tell you anyway. I have searched tech jobs twice in my life.  Once as a new grad in 1999, and just now.  For those that are just curious, or for those that are older and am curious about the current recruitment process, let me explain what I saw.\n\n1999:\n\nJobs were super easy to get.  It was a weird time when non-tech folks were in charge of tech folks.  Also, the amount of technology used wasn't as massive and varied as it is now.  No one asked for 12 years of Python Experience with Computer Vision with Jenkins within a Docker container or whatever because that shit didn't exist back then.  It was a much simpler time.  It was kind of Development of System Admin as the major pillars back then. \n\nThis meant that often times, it was behavioral and simple questions, as many hiring managers were just general people managers and not Engineering managers.  \n\nIn terms of tech questioning, whiteboarding of useless problems was the only way to test really.  But it wasn't that complicated.  And if you were decent, and communicated well, you got the job.  I think I ended up with 10 offers out of 10 second round interviews (I got rejected by one, but another one gave me two offers).  But since I just finished undergrad, silly algo / data structure problems were all I knew, it was super easy for me.  Sure, the first time I saw vi I was scared and had to ask a colleague what this was, but I could traverse a graph on whiteboard like a motherfucker.\n\nRecruiting was also different.  It was put your resume in a resume database and kind of wait.  job fairs were the best way to do that.  The massive recruiting teams that large employers have now were definitely not at today's scale. This meant that you got fewer requests for jobs, but you also weren't competing against 100 other people for that one position.  Essentially, if you were contacted, there was a much better chance you were getting the job due to limited HR resources.  It saved a lot of time.\n\nAlso, there were no tiered awesome companies with great pay.  It was pretty standard for a new grad.  I got $62K and a few piddly stock options at the time at the most awesome company ever, a company that would never run out of ideas and dominate the industry forever.  That company was Sun Microsystems.  So, yeah, don't count on me for any gambling advice.  Pretty much ever company was the within $10K of that, with varying degrees of stock options. \n\nAll that being said, the fallout of the dot-com bust (one year later) was dramatic.  All those people who were hired with limited credentials and skills suddenly got canned and things got tight.  Suddenly, knowing HTML didn't make you a coder anymore.  I know a lot of people who were plain screwed.  There were no bootcamps back then, but equivalent were the people that learned to code with the \"Learn Java in 21 Days\" books were assed out at the end of the day.  A lot of them went it to Real Estate, so, yeah, you can put two and two together on what the next downturn was.\n\n\n2019:\n\nFirst thing first.  Holy fucking shit job searches are annoying.  You need to match all these random technologies.  Then, even if you have that, you have to memorize all those leetcode tricks (that's right, not skills, but tricks).  Sure, I know loops and trees and the like, but dang, I didn't remember the trick to get the consecutive subset of numbers to equal a passed in sum efficiently (mine was inefficient) - so yeah, even though I matched pretty darn well with the job requirements, I did not get that coding parlor trick, so I'm out.  This was for a partner engineering position BTW, which in no way shape or form would require any sort of algorithmic knowledge. \n\nIn my undergrad days, I would say I memorized 80% of those tricks out there.  Today, I know about 40%.  So, I was immediately knocked out of like 60% of interviews.  I didn't realize that the leetcode monkey dance would be so prevalent.  Next job search, I know what to study for - this last one I was ill-prepared.  Anyway, I think most people felt the algo / data structures problems were outdated 20 years ago - but man, they are even worse now.  But knowing the trick basically got me an in as well.  So yeah, it's completely fucking random whether I impress people or not.  One company thinks I'm an idiot and nother thought I was God because of the random selection of leetcode-esqe questions.  \n\nOn the opposite end - holy fucking shit does this pay well.  MY. FUCKING. GOD.  5 years ago, those that got $300K were lucky to jump in the right company at the right time with the right options, were a super genius, someone who is some major thought leader, or some Senior Director.  Now a schmuck like me can get near $300K.  This is crazy.  I joined a company for $180K in 2017 in total. compensation, and I was ecstatic.  In 2012, I think I was rightly paid at $120K or something like that.  Now I just accepted an offer for $280K.  This is nice, but also a bit scary.  I've been through 2 different downturns.  What's going to happen if there's another downturn and these crazy salaries whither away?\n\nLet me put it another way.  For the early to mid 2010s, my wife and I were paid the same though she's way smarter than me.  But since she does supply chain and not tech, she's gotten about a 30% increase in pay in the last 4 years (pretty good), and my pay has roughly doubled. \n\nI'm also amazed that some companies out there think that it is still 2015 and offer those salaries.  Most non-tech companies are completely flabbergasted in terms of my desired salary.  Many of them came back later with a substantial increase because they couldn't find anyone qualified, but I still had to say it wasn't enough.  \n\nRecruiting is also way different.  LinkedIn is awesome, because I know how Yakov Smirnoff feels when he talks about Soviet Russia.  On LinkedIn...Jobs come to you!  Of course, since it is LinkedIn, you got to wade through all these useless intros.  It's a full time job.  I think the first week I said I was actively looking, I got 30 pings.  Everyone wanted a half hour conversation.  Many of them didn't bother reading my requirements.  No, I am not a front-end engineer and no I don't want to move to Seattle - why do you want to talk?  Many just plain ghosted me after I replied with something like, \"I am interested and I would like to know more.\"  Like, what did you want, me to show a picture of myself jerking off to Tim Cook or something or in order to get a reply back from you?\n\nMost recruiters who do talk to you basically tell you are God's gift to employers, then either say something like, you were not a match to the job I said you were a match to, or send me to another person who grills me.  It's a huge bi-polar emotional rollercoaster of validation and rejection.  I was mentally drained from all this.  Like my ex-girlfriend is God of job applications or something.\n\nAlso, the pillars are way different.  You don't have simple pillars like Development or System Admin, it gets way more fragmented.  You have DevOps/SRE, you got Web Development, ML/AI/Data Science, and way more high level pillars.  This is cool in that you can be more sure of what you want, but not cool in that once you are in one, it takes some effort to get out. \n\nIn terms of those pillars - DevOps/SRE is the hottest thing out there right now. I actually just got a Masters in CS with a specialization in ML and some minor ML experience.  No one gives a flying fuck. But because I can spell Kubernetes, I got DevOps / SRE requests left and right (this is the job I essentially took BTW)\n\nAnyway, 2019 is similar and different in many ways.  But damn, I do not want to go through this job search again.  FUCK. THAT.\n\n...............\n\nAnyway, for us old farts who walked uphill both ways in the snow, I wanted to share a few tricks along the way and would totally do my job search differently.  Here's what I l learned. \n\n1) Leetcode algo / data structure memorization is key.  Sure, they don't know if you are older, but it's the easiest way to have age discrimination.  Very few 41 year olds are going to remember what they did in college at age 20 - the perfect way to filter out the gray hairs and those with a family.\n\n2) I always ask for salary.  Weed out those that say, \"it depends.\"  Depends on what?  My experience?  The exact same experience that you can see on LinkedIn as we are talking right now?\n\n3) Ask a question that only a hiring manager can answer.  If the recruiter can't do that, the recruiter is just gathering resumes and has no idea if you \"perfect for the job\" as he or she states.  Time is limited with the relentless amount of pings you'll get - this is a great way to make sure that they are serious about you being a candidate.\n\n4) Ensure that you are the only person interviewing for that position if possible.  I got a semi-offer from a company because they loved me, and wanted me to wait for another rec to open, but they hired someone with Azure experience and explicitly saying Azure experience is not a requirement.  I wasn't going to wait and it was a complete waste of my time.  I found that there are companies that have like 5 people interview for one position, and those that interview one at a time and will fill it if you are good.  The latter is the key because you are the only variable.  Ask for flexibility in terms of interviewing.  If they are interviewing a whole bunch of candidates, they want you in a 3 day window.  If they are just checking you out exclusively, they'll be really flexible.\n\n...............\n\nAnyway, enough my pointless rant.  Now you little fucking whippersnappers can get off my lawn!",
    "title": "Have you ever wondered what the hiring process was 20 years ago compared to today? Probably not, but I'll tell you anyway.",
    "subreddit": "cscareerquestions",
    "timestamp": 1558493062,
    "score": 1556,
    "keyword": "man engineer"
  },
  {
    "text": "Why does it seem like some CS YouTubers try a little too hard at grabbing attention? The click baiting is out of control.. Sorry to rant, but I’ve been feeling this way since a couple months ago when I felt the need to subscribe to people in my intended career field and see how they go about their lives. From what I found, I became very disappointed. The state of computer science vlogging on YouTube is so unauthentic and goofy. And I want to make this clear before I go any further: this is not every YouTube channel. I actually came across a couple of accounts I liked, such as ForrestKnight.\n\nWhat really grinds my gears are the insanely-titled, blown-up stories that make you feel stupid for clicking on it by the end of the video because you realize that they tricked you into clicking on the video then tried their best to keep your attention. Another thing I noticed about these guys is they hop to each other’s videos and they are even featured in the videos of brand new CS creators on YouTube. It’s almost like they recruit early just so they remain in the loop and look as sort of reference points for these newer creators, building a false credibility for themselves. \n\nNow... I know I’ve been saying “they” and “these guys” a lot without really referencing to any real examples so I’m going to link a few for those who haven’t noticed this in these videos yet.\n\nExample 1: Click Bait\nJoma Tech titles this video [Guy with 2.9 GPA now makes $300k as a SWE (Software Engineer)](https://youtu.be/YGflHj1SjA4).  The reason this one bugs me is because of the false impressions that it gives off. The thumbnail of the picture shows a young man, he supposedly did bad in school and now makes a shit ton of money... sounds like the same formula “Get Rich Quick” schemes use to attract people. \n\nExample 2: Making Babies\nClément Mihailescu is a perfect example as a clone of these guys. This guy started THREE MONTHS ago, beginning with videos talking about making $40k per month (featuring Tech Lead, who is a post by himself) and then how to get a SWE Internship (featuring Chris Jereza). He takes on the formula above by talking about how he learned programming in 6 months and got hired at Google, and then takes on what Tech Lead loves to do, which is talking about why he quit from some people’s dream jobs. \n\nMy full-hearted hope is that instead of hopping into each others’ videos to share viewers, I have full faith that if these group of guys were to team up and create one channel of content, it would have potential to be a true and honest representation of a fun, lively representation of the SWE lifestyle. If it does fall into place this nice, I can only hope that the replacement is a better one.",
    "title": "Why does it seem like some CS YouTubers try a little too hard at grabbing attention? The click baiting is out of control..",
    "subreddit": "cscareerquestions",
    "timestamp": 1567240957,
    "score": 716,
    "keyword": "man engineer"
  },
  {
    "text": "How to graciously accuse  I've  been working as a software engineer at a small company for just about 4  months now. They recently hired my predecessor back as a contractor  part time to help transfer his knowledge to me. He was known to make  changes in the code and deploy these changes without telling anyone.\n\nLast  Thursday he deployed some changes that, in turn, crashed a vital piece  of software over the weekend. My boss isn't happy because it went  against procedure and he had to deal with it over the weekend.\n\nMy  boss is holding a meeting with our team tomorrow to get to the bottom  of this. I spoke with my boss today and let him know I saw the  contractor deploy things he shouldn't have. Boss-man told me at some  point during tomorrows meeting, he is going to ask exactly how untested  code was deployed against procedure. At which point I will be able to  inform everyone that the contractor is responsible.\n\nTo  make matters worse, the contractor seems to think it was me who  deployed the code. I'm certain everyone will believe me over him (since  he has a history with this kind of behavior), but how do I point the  finger at this guy in a professional way?\n\nI'd  love to give the guy an out (especially because I'm going to be working  closely with him over the next couple of weeks). When I'm asked how  this happened, how do I word my response?\n\nUPDATE:\nThe contractor was late to the meeting, so I was able to quickly tell them that the issue originated with him, but I worry it seemed cowardly. When he finally came in one of the guys asked again, how this happened. I decided to just keep my mouth shut and look over at him. He said it must've been mistake by whoever did it. So I think it went as good as I could've hoped for. Problem is, now I sense some hostility from him. Nothing obvious, more passive agressive than anything. But, I might just be paranoid, as I tend to be. Im looking forward to the day we no longer have a need for him.",
    "title": "How to graciously accuse",
    "subreddit": "cscareerquestions",
    "timestamp": 1553002776,
    "score": 176,
    "keyword": "man engineer"
  },
  {
    "text": "Depressed, relevant qualifications: almost zero, 6 months of stress and for that one call. I finally did it. I'm sorry, I just need to vent this somewhere. I'm so happy I could cry. It's raining but it might as well be beach weather for all my feels.\n\n&#x200B;\n\nBackground:\n\nI live in Melbourne, Australia. Needless to say, compared to the US, CS careers are nowhere near as lucrative or as abundant here. While demand is still \\*high\\* compared to other industries, salary range for a graduate ranges from 45k on the lower end and 60k+ for those who top out or luck out. I have been a satanic follower of this sub for the last 6 months as I've been hunting for a software engineer/developer position after graduating from university.\n\n&#x200B;\n\nAbout me. I graduated from one of the more reputable universities in Australia, part of what's known as the \"Group of 8\" here down under. In Finance. Yeah, nothing to do with CS. My whole life, I've never been motivated by anything except computers. I won awards in high school, I started building websites for my friends and family on Weebly and Wordpress. But I was an also flawed. I cared too much about what others thought of me, and I had expectations from my parents I desperately wanted to uphold, and to them - I was destined to be a great, high achieving son: a doctor or a banker. So I caved. I fooled my mind into that pathway while still in high school. Easy enough, except I had to go to university.\n\n&#x200B;\n\nThat's where everything crashed. I was soulless, unmotivated and empty. I had this fake crappy persona about me that lied to everyone about my marks, my ambitions - I looooved finance. It went pretty far. To everyone, I was a 4.0 student, president of a commerce society, with an internship done with a financial behemoth. In reality, I had a 2.5 gpa, was the president of a society I fooled myself into thinking I cared about and an internship where the only thing I developed were dark thoughts about my future. I was disgusted with myself and banking was the worst thing on the planet to me - I learned things that repulsed me ethically from ever wanting to be in that profession.\n\n&#x200B;\n\nI leave university in Nov 2018.\n\n&#x200B;\n\nFast forward to my graduation (with zero offers lined up) and I walk across the stage to shake the hand of a man who presented me with a degree that I didn't want; a ticket to an industry I fucking hated. In the months that followed November, I struggled internally. I had to get out of this profession before I fooled myself into thinking that it was okay to stay - the money makes you comfortable. Cue stumbling across this sub and the one known as the Tech Lead, where I decided to fuck it all and gun for a career in CS, the only thing I had ever had a passion for.\n\n&#x200B;\n\nHere I am at ground zero. No relevant experience. No relevant degree, no qualifications. No money for a bootcamp. No knowledge of the industry. I have the skills of being able to sit in an office - and the ability to stream bullshit out of my mouth - a skill courtesy of the bullshittest industry ever. So with newfound motivation and fear, I started studying anyway. I busted out my old coding notes from when it was a hobby, refreshed my Java, learnt Ruby and Rails, SQL. 12 hours a day. I lived on ramen and fear itself. Studied more than I ever had in university. Brushed up (bullshitted) my resume as much as I could without outright committing fraud. HackerRank, Leetcode, Codewars - my best and only friends. Applying all the while.\n\n&#x200B;\n\nAnd boy, did the rejections roll in. Each new email was a fresh reminder of my empty shell of being. I didn't even count them, but I had to buy a new mouse a few months in. I had to bum off my parents for money, which only increased my self loathing. I couldn't even get a part time job working as admin or at a supermarket - I was rejected by them too (actually not sure the reason for this one). Whirlpool (Australia's version of intern/grad forums) was my homepage. But every time I came back to this sub, I saw a new post from a graduate who struggled to have their patience rewarded but persisted until success. And that kept me going. Every time.\n\n&#x200B;\n\nSlowly, the phone calls came in, my coding challenges and tests spoke for themselves. And then, the interviews. one after the other. I couldn't even study all day anymore because I would be peppered with interviews. And finally, 6 months of struggle later, the light: offers. 5 of them. 50k, 50k, 55k, 55k.\n\n&#x200B;\n\nThe last one I received yesterday I had already dismissed, due to what I thought was ghosting. 60k. July start.\n\n&#x200B;\n\nI sat in my car and cried. Thank you Reddit, for allowing the constant reposts from graduates saying they finally landed a job. Thank you for all the repeated advice, for all the unique problems and requests that kept me coming back to the sub for more motivation and solace that I was not alone. Thank you Tech Lead. I start a new story of my life now. No more lies, just bugs that I will both hate and enjoy fixing.\n\n&#x200B;\n\ntldr; No relevant qualifications or experience. Long study, no moneys. Now have moneys and can buy sandwiches instead of making them. Thanks to all reddit.",
    "title": "Depressed, relevant qualifications: almost zero, 6 months of stress and for that one call. I finally did it.",
    "subreddit": "cscareerquestions",
    "timestamp": 1561087694,
    "score": 119,
    "keyword": "man engineer"
  },
  {
    "text": "Grad for about a little over a year (end of 2017) with no related experience/internships. What should I do? So it's been quite a bit of time since I graduated with a BS in Computer Science. I spent probably a good 4-5 months shotgun applying to jobs with no responses so I ended up taking a job kinda in construction for some income. The amount of effort I put into job hunting for a software engineer/developer role pretty much dropped to none as I was at times mentally and physically too exhausted to care about job hunting. The only pieces of experience I have on resume are a hackathon and that construction job. I do have a few school projects listed and a minor outside of school personal Android project.\n\n&#x200B;\n\nI've been out of work now for about 2 months now so I can full-time job hunt but I've gotten as much results now as I did then - which is close to none. But man it just sucks that I think I've only gotten maybe one call from a recruiter from a company that isn't from one of those \"IT Staffing Consultant Companies\" like Revature or FDM group. I live in NYC, so it's not like I live in the middle of nowhere.\n\n&#x200B;\n\nIt's really mentally draining, not gonna lie. I workout pretty often to relieve stress so I have some outlet. I just recently purchased the React 16 The Complete Guide tutorial on Udemy and about to full dive into it so it can hopefully give me something to build. I'm planning to build a simple portfolio/personal website in it but I'm not sure how much good that'll do. Anybody else been in the same situation? How did it work out for you?\n\n&#x200B;\n\n&#x200B;",
    "title": "Grad for about a little over a year (end of 2017) with no related experience/internships. What should I do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1547676339,
    "score": 17,
    "keyword": "man engineer"
  },
  {
    "text": "Was let go; what to do? Hi all,\n\nI'm an iOS developer in NYC that was let go from a startup. Prior to the startup, I worked at Verizon as an engineer (contract) and left to work at my current (previously) startup. \n\nA couple of things:\n- The way I entered was debatably toxic; I replaced a remote developer who was fired without notice but was told I was joining \"to help with work load.\" This was a red flag to me because it seems they are fickle when it comes to their engineering team.\n- I was the only iOS developer responsible for a huge MVP feature for our series A (and the entire iOS stack in general)\n- During my offer conversation, I was told I would get a bump post series A; but this was not in mentioned in my contract so I was not going to receive it. \n- My VP of tech was let go a month prior.\n\nThey quietly walked me to a vacant room and was told they wanted to take engineering in another direction (they had been talking to low wage, green card sponsored engineers and possible dev shop). I was told it wasn't personal nor was I given any feedback on performance.\n\nIt's been 60 days since I was relieved. I was given severance; but have been dealing with a bit of burnout after working many hours to get out a solo manned feature. \n\nMy question are: \n- how can I communicate this to recruiters/job posters without creating an inherent disadvantage due to the connotation \"let go?\"\n- is my career damaged because of this situation? \n\nAny advice would be appreciated; I've been feeling really defeated and it's a big reason why I've waited so long to re-enter the market.",
    "title": "Was let go; what to do?",
    "subreddit": "cscareerquestions",
    "timestamp": 1551031394,
    "score": 7,
    "keyword": "man engineer"
  },
  {
    "text": "When, in my fairly unique situation, do I request a title change/pay raise? Hi cscq!\n\nGraduated at 21. 22 now. CS Bach. C# back end focused. Talented in sql, GUI, learning front end slowly. \n\nThis company, 2500 employees, takes me on as an intern. It was made clear day one I'd be replacing someone. He's been with company since 30, retiring this Friday. \n\nVb coder. Self taught thus code base and code style is.. Interesting. Lots of crazy sql. This man honestly made company, I feel. \n\nThey won't be hiring another programmer for a few years at minimum. I'm essentially inheriting his applications and I'm honored to do so. It's daunting. \n\nI think I'm in a unique position. I went from intern to full-time in two months, and have been a junior since. After six months, I've been working on projects alone for three months now, using git by myself and letting boss review, not being mentored any more.\n\nAFAIK that's not junior engineer right there? Am I wrong? When, if ever, do I ask for a raise?",
    "title": "When, in my fairly unique situation, do I request a title change/pay raise?",
    "subreddit": "cscareerquestions",
    "timestamp": 1576714866,
    "score": 7,
    "keyword": "man engineer"
  },
  {
    "text": "Feeling stressed I am not performing well enough in internship? Hi guys, \n\nA little background: \nI’ve been at my software engineering internship for about a month now at a fairly large company. My actual team consists of (including me) 6 engineers, 2 QAs, 1 scrum master, a product owner and manager. The team itself is rather small. One of our engineers has been there since forever, and I more or less report to him when I have questions. I just graduated college from a decent school with a degree in CS and Math. \n\nI started off really really strong. My first 2-3 weeks were amazing. I set the bar really high. I ended up adding features to our project that are used heavily by the user. They wanted me to do a very small part of it, and to get a feel for the back end. I just kept at it though and they kept throwing me more pieces of the ticket. Eventually it was tested by QA and went into the release. I got tons of praise. My bosses bosses boss called me telling me how wonderful I’m doing and how impressive I am. I got messages by fellow engineers in a different location telling me I’m super solid and to keep up the really good work. You know, I am on cloud nine. And to be fair, the legacy code is massive and looking back on it, I am extremely proud of the features I added because they were critical. \n\nOkay, that’s back end. That’s what college taught me. Now they had me work on the front end stuff. Again, I picked things up fairly quickly, and started making an impact cleaning up the UI. Fixed some various bugs. More praise. \n\nBut the past week or so, idk man. It just feels weird. I had a problem the past few days and I burned a lot of time trying to fix a more in depth front end bug. I ended up working together with the lead engineer for like 4 hours on it. We thought it was fixed. Nope. QA sent it back. I fix it again. It broke something else. I just kept fixing stuff and breaking other things and it turned out there was some discrepancy in behavior between my code and what was being merged, because I never cleared my cache and we’re dealing with CSS. Long story short, I think everything is perfect on my local machine and then these buggy implementation makes its way into the build and QA tests it and then my product owner sees it’s broken and it just makes me look bad. I took the time to fix it, and then I made sure it didn’t break anything else, but because I never cleared my cache I wasn’t seeing what everyone else was seeing. End result, im telling people it’s fixed, and it’s not. And not only that, but then other people start adding in saying not only is it not fixed but it broke other things. \n\nI felt A LOT of heat the past day or two. Once I finally cleared my cache though and I was on the same page with everyone... I got a working fix and QA is happy and we’re good now. But damn it makes me look bad and I had set the bar so high. I really need this return offer, and I know I’m acting overly paranoid but for 3 months I just need to be as perfect as possible, and idk. I also feel like I ask too many questions to my lead engineer. I can’t tell if being too hand holdy sometimes. I know expectations for an intern is low but they pay well, and I personally expect to produce at a high level, and I take pride in that. \n\nBut damn I just sit here feeling anxious that I’m messing up. Like I set the bar high to begin with and I’m slippin...? \n\nThx for listening to my rant/ ramble.",
    "title": "Feeling stressed I am not performing well enough in internship?",
    "subreddit": "cscareerquestions",
    "timestamp": 1562731811,
    "score": 7,
    "keyword": "man engineer"
  },
  {
    "text": "Looking for some project management/client interface web software, feeling lost and overwhelmed! Hi folks -- new to this sub, and the consulting game. I am starting a small business as a freelance consultant and could use some advice.\n\nI'm an environmental engineer and project manager by trade (but I'm not yet a licensed PE so I can't advertise my business as \"engineering\" -- so, for now at least, it's \"technical services\") and have a steady day job but I want to freelance on the side. So I started a business as a small consulting firm. Right now it's a one-man show, although I am open to the idea of taking on interns or subbing work out to collaborators on a contract basis, or whatever. I have some work coming from a college friend, who is more established basically doing the same thing and has more work than she can handle, but that's on a really informal basis where I serve as a subcontractor and we do a lot of things informally. I want to get my own clients and complete projects, though, so I'm trying to get set up to handle situations where I have to actually interface with a client who isn't my bestie from back in the day and will just do business with me casually over the phone.\n\nBasically, I want to add some features to my website. Internally (for me) I would like a system where I can perform project management tasks like creating a work breakdown, time and cost estimate, etc. I would like to be able to track my time worked on a project using this system to update the estimates and use for invoicing. I also imagine an external, client-side interface where the client can log in. They would get a username and password when I set up their account, and when they log in to the client portal it would have some project info available to them in real time -- updated estimates, status reports, my timesheets, etc. -- and maybe some accounting features such as copies of their invoices and the ability to make payments.\n\nI could basically do all of this stuff in Microsoft Project, but I'd like it to be cloud based, and I'd like the client to be able to just log in at their convenience and grab real-time info as needed. \n\nSince it's literally just me right now, I want to keep things light, and the focus doesn't need to be on collaboration/communication features. It seems like there are a lot of packages out there that would probably fit most or all of those needs, but they 1) are heavily focused on managing large teams, which would be useless to me; and 2) have every feature under the moon, which would probably just be bloat. I need something more simple. Also, a lot of the packages seem to be rooted in software development culture -- e.g. \"bug tracking\", \"support tickets\", etc. I don't do anything that has to do with coding. There may be some analogous aspects in the environmental engineering world but I don't want to try to fit a square peg in a round hole.\n\nDoes anyone have advice for systems to use that might fill these needs? Thanks!",
    "title": "Looking for some project management/client interface web software, feeling lost and overwhelmed!",
    "subreddit": "consulting",
    "timestamp": 1572554747,
    "score": 1,
    "keyword": "man engineer"
  },
  {
    "text": "A compilation of evidence debunking feminist historical revisionism. I have made a post somewhat similar to this before but I've since collected a lot more information about these topics and so I believe warrants yet another post.\n\n*Myth #1: Women weren't allowed to work.*\n\nMost documentation from the past heavily implies that people attempted to avoid working as much as possible. Even so, many women did work (mostly because they had no choice but to) and there has never been a law restricting women from working.\n\n\"Though creative research has produced evidence of women working at male-dominated occupations in the eighteenth century and before, there is undoubtedly more documentation out there, in newspapers, diaries, legal proceedings, and prints. What is more compelling is the lack of documentation that women were not allowed to work. Although religious practices and social norms might have restricted certain activities in some parts of the world, there were no laws prohibiting women from working a trade.\"\n\nAt the time, only members of a trade guild (associations of producers that trained craft people, maintained control over production, regulated competition and prices) were allowed to sell their goods or practice their skill within the city. Non-guild members were prohibited from selling competitive products. An aspiring master would have to pass through the career chain from apprentice to journeyman before they could be elected to become a master tradesman. They would then have to produce a sum of money and a masterpiece before they could actually join the guild. If the masterpiece was not accepted by the masters, they were not allowed to join the guild, possibly remaining a journeyman for the rest of their life.\n\nWomen were not barred from any of the trade guilds in Britain at least as far back as the 1400s. Apprentice forms for guildwork had spaces left blank to insert 'he' or 'she', though girls who chose this traditional route to mastery of a trade (which was extremely long and arduous) were usually orphaned and had low prospects for marriage, thus they were going to need to work.\n\nMarried women, though, had the privilege of circumventing the long, onerous, arduous process of trade certification as they could receive the master tradesman status from their husbands and thereby continue his work, even take on apprentices to train (which suggests that the social assumption was that wives would learn enough about their husband's business and trade to be able to at least continue to oversee it after he died). Lots of widows continued to run their husbands' businesses long after their death.\n\nThe Worshipful Company of Blacksmiths in London lists sixty-five \"brethren\" and two \"sistren\" in its 1434 charter.\n\nA 1770 publication called *The Tradesman's True Guide or a Universal Directory for the Towns of Birmingham, Wolverhampton, Walsal, Dudley and the manufacturing village in the neighborhood of Birmingham* carried exhaustive lists of tradesmen and tradeswomen alphabetically by name and by trade, and there are women listed in every trade from butcher to wire drawer.\n\n[https://www.history.org/foundation/journal/spring04/women.cfm](https://www.history.org/foundation/journal/spring04/women.cfm)\n\nReally, very little I've seen shows that women were maliciously \"kept out\" from trades or professions that they wanted to enter into. It may have been a social norm that most women did not seek out careers as they do now, but looking at the histories of the first women to enter into medicine, law, etc, show that they hardly faced any resistance in doing so.\n\nIn 1847, Elizabeth Blackwell became the first woman to attend medical school in the US and was the first woman on the Medical Register of the General Medical Council. She sent applications for admission to twelve of the most promising institutions in the northern states, and her application was accepted by the medical department of Geneva University. Feminist revisionist history \"explains\" that she was only admitted to the college by the evil men as a joke, but as will be amply demonstrated this is the opposite of what actually happened.\n\nIn fact, the student body sent her a letter to welcome her:\n\n>At a meeting of the entire medical class of Geneva Medical College, held this day, October 20, 1847, the following resolutions were unanimously adopted:–  \n>  \n>Resolved – That one of the radical principles of a Republican Government is the universal education of both sexes; that to every branch of scientific education the door should be open equally to all; that the application of Elizabeth Blackwell to become a member of our class meets our entire approbation; and in extending our unanimous invitation we pledge ourselves that no conduct of ours shall cause her to regret her attendance at this institution.  \n>  \n>2. Resolved – That a copy of these proceedings be signed by the chairman and transmitted to Elizabeth Blackwell.\n\nShe describes this letter as one of her most valued possessions, and in her autobiography she states that the men of the college supported her 100% and beyond.\n\n\"The behaviour of the medical class during the two years that I was with them was admirable. It was that of true Christian gentlemen. I learned later that some of them had been inclined to think my application for admission a hoax, perpetrated at their expense by a rival college. But when the *bona-fide* student actually appeared they gave her a manly welcome, and fulfilled to the letter the promise contained in their invitation.\"\n\nShe also notes that the general public also had a favourable view of a woman entering into medicine.\n\n\"The admission of a woman for the first time to a complete medical education and full equality in the privileges and the responsibilities of the profession produced a widespread effect in America. The public press very generally recorded the event, and expressed a favourable opinion of it. Even in Europe some notice of it was taken, and 'Punch' showed his cordial appreciation by his amusing but friendly verses.\"\n\n[http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III](http://digital.library.upenn.edu/women/blackwell/pioneer/pioneer.html?fbclid=IwAR09FZZlnVMVha0PNLYnQQDSnptVDEoGxokEf10QHPCGgxZMly5HyfDlgQI#III)\n\nThere are also other examples of women entering into \"male\" fields and encountering little resistance. There's the example of Arabella Mansfield, the first female lawyer in the United States. Although by Iowa law the bar exam was restricted to \"males over 21,\" Arabella Mansfield took the exam in 1869, passing it with high scores. Mansfield challenged the state law excluding her, and the Court ruled that women may not be denied the right to practice law in Iowa, admitting Mansfield to the bar.\n\nOr Ada Lovelace, who was encouraged in her mathematical ability from a young age by her parents and received the best of tutors to increase her ability. She worked with Charles Babbage on his Analytical Machine, though they both \"fell into historical obscurity, and the Analytical Engine was unknown to builders of electro-mechanical and electronic computing machines in the 1930s and 1940s when they began their work, resulting in the need to re-invent many of the architectural innovations Babbage had proposed.\"\n\nOr Amelia Earhart, who was flown \"like a sack of potatoes\" by pilot Wilmer Stultz across the Atlantic in her 1928 transatlantic flight, and immediately became a celebrity, wrote a book about the experience, was used to endorse products, and dubbed 'Lady Lindy'. There is a plaque that marks where the plane landed in Wales. All the fervour over it was solely because she was a woman who crossed the Atlantic regardless of the fact that she didn't do any flying at all in her 1928 flight (She did, however, go on to complete a transatlantic solo flight later on in 1932).\n\n[https://en.m.wikipedia.org/wiki/Amelia\\_Earhart](https://en.m.wikipedia.org/wiki/Amelia_Earhart)\n\nOr, for a very long-ago example of this, Murasaki Shikibu from Japan around the year 1000, who listened at the door while her brother received lessons in Chinese writing and through that learned it herself. She was far from reviled for being a woman who knew Chinese and was commissioned by the Empress to write the Tale of Genji, a classic work of Japanese literature often called the world's first novel.\n\nOh, the o p p r e s s i o n .\n\n*Myth #2: Marriage was an institution created by men to oppress women. Men were disproportionately given privilege and power and women were treated like his property in marriage.*\n\nAgain this is a bastardisation of the past. Feminism has to stop treating men as the enemy and as the source of all women's (and also men's) problems. They need to realise that things weren't always as they are now, and realise that it was not Patriarchy or men that restricted the choices of both genders and forced them into strictly defined roles, but that these roles came about because it was the best way of arranging societies in the past - a past that was much harsher and more unforgiving than it is now. A past in which there was more work to do than there were hours in a day. A past where men spent most of their short lives working like mules to support themselves and their families and women spent most of their short lives incapacitated by childbirth and child-rearing. A past in which we sent children into coal mines that ruined their lungs and into factories which lost them limbs. Things sucked, and the reason it was bearable at all back then was *because* of the gender roles.\n\nMen were not the ones who relegated women to the domestic sphere or kept them dependent on men. Biology did. A woman at that time could not simply strike out on her own and do whatever she wanted. For most of history we had no reliable birth control, no safe abortion, no maternity leave, or social security, and most public sphere work back then involved hard labour. And if you were a woman back then who wanted to be able to have sex, then you would have had to plan your life around the idea that you would be getting pregnant, giving birth, and breastfeeding for most of your adult life - and that would have meant you could not be a reliable enough worker to support even yourself, let alone a child, and it would inherently have made you dependent on other people to help you. Until the last 100 years or so, most women could not have lived a life of children and public sphere work, independent of a man (and not all can today, realistically).\n\nEven with support, most women in poor and middle class families had to work because that was the only way to make enough money to live.\n\nSo in a time when single motherhood was a one-way trip to the gutter, marriage was a practical arrangement. The function of marriage was not to oppress women, but to positively assign paternity inasmuch as possible, and then obligate the men so assigned to their children and the mothers of their children. For life.\n\nThe taboo on sex outside of marriage (which was applied to men no less than women) made it difficult for an unscrupulous man to cheat the system. These rules surrounding marriage also mitigated the problem of paternity uncertainty, which maximised men's willingness to invest in their kids. \"I know these are my kids, so I will work hard to feed and shelter them.\" And the reason why we kept lifelong monogamous marriage for so long is because it increased the resources which would have been available to offspring, providing a healthier environment for children to grow up in.\n\nSo when a man married a woman, he was legally obligated to feed, clothe and shelter her and any children produced in the marriage to the best of his ability. Unlike what feminists seem to think, he could not sell her. He could not return her for his money back. He could not drop her at the local midden heap. He could not destroy her the way he could his actual chattels. He could not trade her for a better one. He could not legally neglect her.\n\nJust to make things crystal clear, here is a summary list of entitlements that women enjoyed in marriage (and after marriage) during the old \"patriarchal\" system of the past.\n\n1. When a woman married, she had to hand over her property to her husband's care (again, NOT because she herself was property, but because he was administrator of the family), but he OWED her not just a living, but the best living he was financially capable of providing for her. A wife was entitled to be maintained by her husband.\n2. Though women did not have the right to enter into contracts in their own name in marriage, women had the privilege of the Law of Agency, giving them the legal right to purchase goods on their husbands' credit as their agent. If the wife racked up debts that the husband couldn't pay, she was immune from liability for the debts she racked up - that liability fell to the husband instead.\n3. Women had the entitlement of being protected from prosecution for any number of crimes if they could prove their husbands were aware of said crimes. In which case, he would be prosecuted in her stead--not just held AS responsible as she was, but held solely responsible for her actions. This allowed married women to displace accountability for a large number of offences onto their husbands. \"She's out of control and does what she wants, regardless of my wishes,\" was not a valid legal defence for those men.\n4. Women were exempt from paying taxes, and there was an entire female underground economy of barter and trade that was not subject to taxation or government interference. Even when married women gained the right to hold property within marriage, it was their husbands who were responsible for the taxes owing on it, and it was their husbands who were held 100% financially liable for providing all necessaries to the family, including the wife, even if she made more money than he did.\n5. After divorce, men were held fully financially responsible under the law for the ex-wife and kids. Divorced women were entitled to be supported by their ex-husbands to a level commensurate with the husband's for potentially the rest of their lives unless she remarried.\n\n[https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download\\_file?file\\_format=application/pdf&safe\\_filename=Item.pdf&type\\_of\\_work=Journal%20article](https://ora.ox.ac.uk/objects/uuid:2e88e3f6-b270-4228-b930-9237c00e739f/download_file?file_format=application/pdf&safe_filename=Item.pdf&type_of_work=Journal%20article)\n\nThat doesn't sound at all like women were treated like property to me.\n\nI'm sorry, but if I have property, I have no legal duty of care toward the actual property I own, nor any obligation to commit to own it until death. I can smash my property on the ground and treat it however I want and it would be my right to do so. Men could not do any of that to the women they were married to. They had obligations towards them to provide for them - even after divorce, and to protect them - even from the consequences of their own actions. Wives had no such obligation towards their husbands - they were entitled to be the ones who were supported. Because the purpose of marriage in the past was not to oppress women and make them the property of men, but to ensure that women and their children could be provided for and protected, and to place the responsibility for that provision and protection on the man even at cost to his own wellbeing, health, and even life. This has been the case since time immemorial.\n\n\"Husbands, love your wives, just as Christ loved the church and gave himself up for her.\"\n\nEphesians 5.\n\n[https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV](https://www.biblegateway.com/passage/?search=Ephesians+5%3A22-33&version=NIV)\n\nIn fact, many of the supposed \"privileges\" men had in marriage in the past were to help them carry out their obligations and to prevent them from becoming wholly onerous.\n\nIf a man had an obligation to be accountable for provision for his wife and children and to maintain family finances, it stood to reason that he also should have the entitlement of having control over any assets of his marriage, including those his wife brought into the marriage, because he was the one who had a responsibility to keep the entire family afloat and to increase their holdings.\n\nIf a man was responsible for the protection of his wife and children to the point where he could be legally required to stand between his wife and the law within numerous contexts, and be punished in her stead (whether she contracted debts he couldn't pay or committed a crime he would have to answer for), it makes sense why he would be considered head of household and why his family would need to obey him as well as abide by the restrictions he placed on them.\n\nIf, upon divorce, a man would be held solely responsible for the maintenance of his wife and child, it makes sense why he would get custody of the child that he was supporting, as well as ownership of assets so he could satisfy that obligation.\n\nWe gave men these rights and privileges because they were the tools that he needed to satisfy his responsibilities. And in that way there was a balance. \"Women \"got less\" because their obligations and accountability were less, their responsibility was less. Men \"got more\" because the buck stopped with them, whether that buck consisted of a sack of coins or his blood.\"\n\n*Myth #3: Men were allowed to beat their wives with impunity.*\n\nIn the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\n*Myth #4: Husbands were owed sex with their wives. Marital rape was not illegal, and marriage as an institution was based around rape of women.*\n\nThe idea at the time was that there could not be such a thing as marital rape because as a married person you are owed sex from your spouse, i.e. conjugal rights. This applied to both men and women. People who believe that conjugal rights \"allowed husbands to rape wives\" and not the other way around haven't actually done any research.\n\nIt was based on the idea that **both parties** had a right to sex in the relationship, and this was exercisable in law by each partner in a marriage.\n\nThe Bible said:\n\n\"*It is* good for a man not to touch a woman. **2** Nevertheless, because of sexual immorality, let each man have his own wife, and let each woman have her own husband. **3** Let the husband render to his wife the affection due her, and likewise also the wife to her husband. **4** The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.* **5** Do not deprive one another except with consent for a time, that you may give yourselves to fasting and prayer; and come together again so that Satan does not tempt you because of your lack of self-control.\"\n\n[https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV](https://www.biblegateway.com/passage/?search=1+Corinthians+7&version=NKJV)\n\nDo note the specific passage where it says \"The wife does not have authority over her own body, but the husband *does.* And likewise the husband does not have authority over his own body, but the wife *does.\"*\n\nAnd here's a quote from an article detailing the history of sex and marriage.\n\n\"A hundred years ago or so, if you took the statute books literally, the only people entitled to have sex with each other were people who were legally married. All other sex was against the law. Fornication (sex with unmarried people) was illegal; so was adultery (sex with a married person—but not the person you yourself were married to). Cohabitation—living with someone in a sexual relationship—was against the law, except for people who were legally married. Enforcement was, shall we say, something less than perfect. At times, it was almost nonexistent. And the rules were riddled with exceptions. Sodomy, on the other hand, was quite a serious crime; and the full weight of the law sometimes came down heavily on people who had gay or lesbian sex.\"\n\n\"Married people were not only *entitled* to have sex; they were, in a way, *required* to have sex. Of course, nobody checked on whether John and Mary were having sex every night, or once a week, or once a month, or never. But if either John or Mary did not perform at all, for whatever reason, the frustrated partner had grounds for divorce; or even perhaps an annulment.\n\n[https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking](https://verdict.justia.com/2017/01/24/sex-necessary-legally-speaking)\n\nHusbands faced divorce if they were impotent and unable to consummate the marriage, though charges were usually made years after the wedding day. There was a similar charge of frigidity for wives, but it seems that wives charging their husbands for impotency was far more common. Husbands had to show an erection to a court audience and sometimes attempt to perform sex with their wives as well.\n\n[Source 1](http://www.bu.edu/law/journals-archive/bulr/volume89n5/documents/HOFFMAN.pdf) [Source 2](https://www.theparisreview.org/blog/2016/05/18/the-hard-on-on-trial/)\n\nBeing incapable of performing sex for your wife could merit corporal punishment. One medieval husband wrote about his unhappy marriage and his impotence in a book called The Lamentations of Little Matheus.\n\n\"My wife wants it, but I can’t. She petitions for her right. I say no. I just can’t pay.\"\n\n\"Even given his sexual incapacity, Matheolus was subject to corporal punishment:\n\n\"Acting as her own advocate, Petra {Matheolus’s wife} puts forward the law that if a shriveled purse {scrotum} can’t pay because it’s empty, under statute recompense for that injury is corporal punishment.\"\n\n[https://www.purplemotes.net/2015/05/03/matheolus-church-wife/](https://www.purplemotes.net/2015/05/03/matheolus-church-wife/)\n\nSo what does this show? It shows that both parties had an obligation to provide the other partner with sex during the marriage, and could not deprive their spouse of it. If it was an issue, it was not an issue that solely affected women.\n\n*Myth #5: \"Men had the vote and women did not. Women's suffrage was a matter of women as a united group fighting for their rights against the evil men that kept it from them. Suffragettes were champions of equality who got women the vote. Etc, etc.\"*\n\nReally, I'm very tired of hearing this one.\n\nIn Britain, the right to vote was not only restricted by gender, but also by class. Property owners had the vote, the vast majority of men did not. In 1830, just 3% of the population had the right to vote.\n\nDuring this time, there were a few groups who were fighting for the vote to be extended to them, and one of these groups were the Chartists, who were active from 1830 to 1868. They were fighting for broad electoral reforms including:\n\n* a vote for all men (over 21)\n* the secret ballot\n* no property qualification to become an MP\n* payment for MPs\n* electoral districts of equal size\n* annual elections for Parliament.\n\nThey presented three huge demonstrations to Parliament, and their requests were denied every time. The restrictions were relaxed but not abolished. Benjamin Disraeli said when introducing the Second Reform Act of 1867: \"We do not live – and I trust it will never be the fate of this country to live – under a democracy. The propositions which I am going to make tonight certainly have no tendency in that direction.\"\n\nThere were also the suffragists and the suffragettes, who were fighting for the vote to be extended to women. Suffragists emerged in the mid-19th century and believed in peaceful, constitutional campaign methods. In the early 20th century, after the suffragists failed to make significant progress, a new generation of activists emerged. These women became known as the suffragettes, and they were willing to take direct, militant action for the cause.\n\nHowever, a huge amount of women disagreed with women's suffrage. So many women objected to the franchise being imposed on them that in the mere 18 months leading up to a 1910 parliamentary debate on women's suffrage, anti-suffragettes had managed to collect 300,000 signatures from women who objected to the franchise being imposed on them. Meanwhile, in the 16 years leading up to that debate, suffragettes only managed to collect 193,000 signatures of women who wanted the vote.\n\nA segment from the transcript of the debate:\n\n\"Still, for what it is worth, one finds that from 1890–1906 only 193,000 women signed Petitions to this House in favour of female suffrage, and that during the last eighteen months, a period in which a strong anti-suffrage association has been in existence, 300,000 women, some of them eminent women, have signed petitions against it, and to the effect that these proposals shall not be forced upon them.\"\n\nAnd...\n\n\"A rather interesting illustration was furnished by an inquiry which was instituted by \"The Sheffield Independent,\" a newspaper which I think itself is sympathetic with these proposals. This inquiry was addressed to the women householders of Sheffield. Twenty-three thousand papers were sent out, and of the replies 9,000 were in favour of woman suffrage and 14,000 were against it. The representatives of this paper reported that in many cases their emissaries were chased with violence from the houses by the female inhabitants under the impression that they were collecting statistical matter as the emissaries of the suffragist party.\"\n\nIt may be difficult to understand why so many women would reject the vote so vehemently, but this was an era where full citizenship rights like the right to vote were granted only to those with citizenship responsibilities like conscription (and sometimes not even then). In that historical context, the vote was actually viewed not just as a right, but also an obligation. So it was never really about men in power shutting women out of the franchise. It was about government having to decide whether to impose a responsibility on women that women as a whole *clearly did not want.*\n\n[https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill](https://api.parliament.uk/historic-hansard/commons/1910/jul/11/parliamentary-franchise-women-bill)\n\nRegardless of the lack of support for women's suffrage among women, suffragettes became extremely militant in their activism. In 1903 Emmeline Pankhurst founded the Women's Social and Political Union (WSPU) with her daughters Christabel and Sylvia, and the WSPU carried out a nationwide bombing and arson campaign. Between 1912 and 1915, hundreds of bombs were left on trains, in theatres, post offices, churches, even outside the Bank of England; while arson attacks on timber yards, railway stations and private houses inflicted an untold amount of damage.\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nInstead of being beneficial in supporting the vote for women, it was disastrous. Lloyd George said: \"The action of the militants is ruinous. The feeling amongst the sympathisers of the cause in the House is one of panic. I am frankly not very hopeful of success if these tactics are persisted in.\"\n\nTerrorism aside, Emmeline Pankhurst was also resistant to acquiring the vote for working class men, realising that this would be much tougher than winning the vote for \"respectable\" AKA upper-class women, and underlying the resistance appears to have been her contempt for working-class men. According to Sean Lang in his book on Parliamentary reform: \"The Pankhursts became stridently anti-male, ruthlessly dropping even the most loyal of their male supporters from the WSPU, and claiming, as Christabel did in her 1913 book *The Great Scourge*, that men were “little more than carriers of venereal disease”.\"\n\n[https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/](https://conservativewoman.co.uk/men-won-votes-women-not-suffragettes/)\n\nWhen WW1 came around in 1914, suffragettes also threw their support behind the White Feather campaign with the aim of shaming men into enlisting. Those young women went in for the kill, striking men at the very heart of their masculine identities, the bestowing of a feather telling them, \"If you don't go off to be maimed or die, you are no longer a man in the eyes of some brassy chit you've never even met before and will probably never see again.\" And many men went, because a woman's censure - ANY woman's censure - had the power to drive them straight into the teeth of death.\n\nBy mid 1915, it was clear that not enough men were signing up to replace the fatalities on the front line, and the Military Service Act was introduced in January 1916. By March 1916 compulsory conscription for all single men aged 18-41 was in place. In May 1916, the Act was extended to include conscription for married men.\n\n[http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html](http://www.eastsussexww1.org.uk/attitudes-towards-conscription/index.html)\n\nIt was only at that point that the British government considered extending the vote to all men, as most of the propertyless, working class men that were conscripted into war during WW1 did not have the right to vote, and this was finally starting to be seen as the injustice that it was. In the trenches class divisions were eroded to the extent that class no longer had any real meaning and every man was the equal of each other in terms of sacrifice and service to one's country.\n\nMen got universal suffrage in 1918 with the Representation of the People Act, which enfranchised more than five million men over the age of 21 without regard to property or class. Women of all classes were piggybacked onto the Act, with an age restriction temporarily in place to prevent women from becoming a supermajority voting bloc, given that about 1 million British men had died in the war. Regardless, this brought more than eight million women over 30 into the electorate. And just ten years later, the 1928 Act (the act which gave women electoral equality) gave the vote to women at age 21, which added another five million women to the electorate.\n\n[https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/](https://www.telegraph.co.uk/men/thinking-man/has-everyone-forgotten-male-suffrage/)\n\nIntroducing the 1918 Bill, the Home Secretary George Cave said: \"War by all classes of our countrymen has brought us nearer together, has opened men's eyes, and removed misunderstandings on all sides. It has made it, I think, impossible that ever again, at all events in the lifetime of the present generation, there should be a revival of the old class feeling which was responsible for so much, and, among other things, for the exclusion for a period, of so many of our population from the class of electors. I think I need say no more to justify this extension of the franchise.\"\n\nThe Act was achieved not by the suffragettes’ terrorist tactics, but by fighting of men in WW1, when thousands of men from their many different backgrounds came together to fight the common enemy. This finally achieved what the Chartists, the Levellers and the peasants before them had struggled for in terms of eroding barriers of class. Without the sacrifice of men who endured the horror of trench warfare in WW1, class barriers would have persisted and at most the vote would have been extended only to elite, wealthy, propertied women.\n\nIn a later study of attitudes to conscription in 1939, one woman responded: \"In the last war \\[(WW1)\\] I never told one man that he ought to go. I tried to put myself in their place. If I’d been them I wouldn’t have gone. When I saw them going through the streets – all the young men – I used to think that they were being driven like cattle to the slaughter house. And they were, weren’t they? Fodder for the guns.\"\n\nThe common idea that all men had the vote, and that women did not, and that women's suffrage was a fight of women who were united against men working as an oppressive force to keep them down is an affront to these men who died in a literal war that secured universal suffrage for everyone (many of which, in fact, did not have the vote). It also ignores and erases the will and sentiment of many, many, *many* anti-suffragette women who actively rejected the vote and protested vehemently against it being imposed on them.\n\nFurthermore, the view that suffragettes were a valiant, fair-minded, equality-oriented group who got women the vote and whose activism merely amounted to firecrackers in barrels is an affront to any right-thinking person. The real violence and extremism of the suffragettes is barely, if at all, recognised by the general public, and this is partly due to attempts by suffragettes to sanitise their history.\n\n\"Laura E. Nym Mayhall, in her work on the militant suffrage movement, identified the importance of \"a small group of former suffragettes\" in the 1920s and 1930s, who created a highly stylised story of the WSPU and the history of suffrage in England, which emphasised \"women’s martyrdom and passivity\". The group set about compiling the documents, memoirs and memorabilia that now form the basis of the Suffragette Fellowship Collection held by the Museum of London.\"\n\n[https://www.historytoday.com/history-matters/sanitising-suffragettes](https://www.historytoday.com/history-matters/sanitising-suffragettes)\n\nAnd here we are now, in crazy world. According to the dominant narrative, all men always had the vote since the dawn of recorded human history, and they refused to give it to women because penis. The demonstrations of the Chartists, and the dead bodies of these men that were sacrificed to the unpopular idea of male suffrage (and who got votes for women in the process), have gone down the memory hole. The terroristic actions of the suffragettes, engaged in for the benefit of wealthy and privileged women only and for which they were barely punished, are the noblest of acts for the noblest of causes. And of course, the only reason anyone could EVER have opposed them was because of misogyny.\n\nedit: wording\n\nedit 2: Added some extracts from [w1g2's comment](https://www.reddit.com/r/MensRights/comments/edyrf5/a_compilation_of_evidence_debunking_feminist/fbtays6?utm_source=share&utm_medium=web2x).",
    "title": "A compilation of evidence debunking feminist historical revisionism.",
    "subreddit": "MensRights",
    "timestamp": 1576979536,
    "score": 342,
    "keyword": "man engineer"
  },
  {
    "text": "One brave young man takes on gender inequality at USC  \n\nMisandry—the hatred of men—has been a staple of my polemical writing  for more than fifteen years. I felt a special obligation to hammer away  at gender myths such as intimate partner violence (women are about [as likely as men](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) to initiate violence against their partners as men), false sexual allegations (a [disturbing percentage](https://medium.com/t/@jimpreston_36730/how-many-rape-accusations-are-false-f52e4c675f2a) of such allegations) and demonstrable [bias against fathers](https://theccf.ca/ideology-and-dysfunction-in-family-law/)  in family court, because male journalists who dared to write  sympathetically about men and/or critically about women put their  careers in jeopardy (no exaggeration), and most had learned to keep *shtumm* in this domain.\n\nThat  situation has been changing slowly but steadily. Some men have decided  they aren’t going to spend their lives in rhetorical purdah on the  subject of their own cultural dhimmitude, and have been stepping up to  the plate, whatever the personal cost. The university campus is home to  the feminist commissariat—and it’s a brave man who dares to stick his  head above that formidable parapet. Because the cost of doing so can be  high.\n\nThis is the story of one such activist who paid a price,  which only fueled his resistance efforts, and which in turn inspired  others, in reversing a decades-long erosion of men’s rights on campus.\n\nIn  a meeting held in June, 2017, Kursat Christoff Pekgoz was pressured by  his academic director at the University of Southern California into  terminating his PhD degree in English Literature on what Pekgoz  considered spurious and unprecedented grounds, accompanied by “many  threats and irrational exaggerations” (the meeting was recorded).  His  contract was not renewed and his funding was cut off. This is extremely  uncommon. In fact, Pekgoz is unaware of any other PhD student being  denied a doctoral degree in English Literature \\[at USC\\].\n\nThe real  reason for his PhD termination, Pekgoz alleges, is his history of gender  activism via a series of Title IX complaints against a number of  universities, such as Rutgers, [Northeastern](http://ncfm.org/wp-content/uploads/2018/08/NCFM-Title-IX-complaint-Northeastern-University.pdf) and Georgetown, to which he added [one against USC](https://docs.wixstatic.com/ugd/ea7b71_0c223159779e4beaaea809873f2504a7.pdf) at the end of May. As he [told a PJ Media reporter](https://pjmedia.com/trending/ph-d-student-files-federal-complaint-says-usc-retaliated-against-his-pro-men-title-ix-activism/), “They all know that I am a Title IX activist for men, with strong libertarian/conservative views.” \n\nTitle  IX’s language is very plain. It prohibits any institution from funding,  sponsoring, or listing gender-discriminatory programs and initiatives,  so for example, even listing a woman-only scholarship or placing an  employment ad specifying only women need apply runs counter to Title IX,  though such breaches happen all the time. Title IX also prohibits  discrimination in terms of counselling or health benefits. That should  mean that both men and women are treated with equal objectivity and  respect when, say, sexual-assault allegations come up for assessment.  But universities have [not covered themselves in glory](https://helpsaveoursons.com/category/fighting-back/), to say the least, on that front. \n\nIndeed,  motivation for Pekgoz’s robust activism arose in part from a Title IX  complaint against him for sexual harassment. In response, he went on  offence with a forceful and persuasive [counter-charge](https://docs.wixstatic.com/ugd/ea7b71_16c1692eab8844218afdb2b419622827.pdf)  that his accuser had in fact sexually assaulted him (it’s worth  reading, because it offers a formidable sample of the kind of meticulous  research and annotation Pekgoz applies to every single thing he says  and writes. It does not seem to leave much wriggle room for his accuser,  and I think any objective reader would come away from it with,  minimally, doubts as to the accuser’s credibility.) \n\nIn 2018  Pekgoz complained to the Department of Education’s Office of Civil  Rights (OCR) about both USC and Yale University, prompting an  investigation into both schools’ women-only scholarships and programs,  such as a USC Women in Science and engineering group that excludes  males.\n\nLast January, Pekgoz and two former lawyers (not affiliated with Harvard University) filed a Title IX [complaint with the OCR against Harvard](https://docs.wixstatic.com/ugd/ea7b71_85533d99ee0748ac813ca937735a4f94.pdf),  in which they rebut the received wisdom of female victimhood with an  abundance of impeccably-sourced evidence demonstrating the various ways  in which men are discriminated against in society and on campus.  Notably, “the overwhelming majority of all persons sanctioned under  Title IX theory are male. However, there is good evidence that men and  women experience sexual victimization at equal rates and the majority of  male victims [report female perpetrators](https://www.sciencedirect.com/science/article/abs/pii/S1752928X11001569). The majority of Title IX administrators are women.”\n\nAlso in the Harvard complaint is a reference to Supreme Court prohibitions against male-gender discrimination. In [*Mississippi University for Women v. Hogan*,](https://www.britannica.com/topic/Mississippi-University-for-Women-v-Hogan)  for example, the Supreme Court held that denying male admission to  nursing courses was impermissible under the Equal Protection Clause of  the Fourteenth Amendment. They wrote that a sex classification must be  “…determined through reasoned analysis rather than through the  mechanical application of traditional, often inaccurate, assumptions  about the proper roles of men and women. … Thus, if the statutory  objective is to exclude or ‘protect’ members of one gender because they  are presumed to suffer from an inherent handicap or to be innately  inferior, the objective itself is illegitimate.” This statement would  seem to undermine the reflexive argument adduced by feminists that  affirmative action for women is still necessary because of historic  disadvantage or because there are more *Fortune 500* male CEOs than women.\n\nThe  most interesting complaint to the OCR, because it reveals the distance  the men’s rights movement has come from its first tentative and atomized  beginnings two decades ago, is the one led by Pekgoz [against Cornell University](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed) in February, which Pekgoz described in an  [interview with *Campus Reform*](https://www.campusreform.org/?ID=11853) as “one of the worst in the nation” for anti-male bias. \n\nThe  document contains a “list of exclusionary programs” at Cornell, such as  the lack of a Men’s Resource Center to balance the women’s Center, or a  Men’s Health Center to balance the Iris Cantor Women’s Health Center.  Likewise – even though “men are twice as likely to have heart attacks  through life than women” – there is a women’s Heart Program, but none  for men.\n\nBut the list itself, while interesting, is not what is  most significant about the Cornell complaint. Rather it is the public  support for the complaint amongst Pekgoz’s colleagues and from many  respected public intellectuals, such as American Enterprise Institute  scholar and feminist critic [Christina Hoff Summers](https://www.aei.org/author/christina-hoff-sommers/),  that lend unusual moral weight to its claims. More than 185 professors,  scholars and activists signed on to it, including Canada’s own Jordan  B. Peterson, arguably the most recognizable and inspirational spokesman  for gender equality in the world today. Peterson referenced Title IX’s  long association with women’s rights succinctly: “what’s sauce for the  goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*  that he had signed the complaint because it “addresses a fundamental  unfairness in contemporary America, centred in our colleges and  universities” and because “it shows that exclusionary practices create a  hostile environment” for men, some caused by an “animus against males  perpetrated by feminist ideology.” Lawrence Alexander, a law professor  at the University of San Diego, told *Campus Reform* that he signed because “its allegations are true and even understated.”\n\nSuch  public affirmation on men’s behalf by high-status academics in  prestigious institutions represents something like a tipping point in  the gender wars, it seems to me. Margaret C. Valois, a Virginia-based  Title IX attorney who specializes in defending accused male students  filed a similar Title IX complaint against Tulane University and [obtained a win](http://www.aei.org/publication/successful-title-ix-complaint-forces-tulane-university-to-end-gender-discrimination/)  recently. Valois, Pekgoz and another aggressive veteran in the battle  for gender equality, Professor Mark Perry of the University of  Michigan-Flint, are profiled by anti-feminist Canadian vlogger Janice  Fiamengo, a signatory to the Cornell complaint, in [Episode 94 of her popular Fiamengo File](https://inclip.top/studiobrule/aLDRY3qCkmjIuoI/will-2019-be-the-year-of-mra-lawsuits-tff-episode-94.html) series, titled “Will 2019 Be the Year of MRA Lawsuits?”\n\nWill  it? It does seem that we are at a pivotal moment—that there is a  powerful current of social unease, running just below the still  hegemonically feminist surface, with the unfettered misandry that  pervades our culture. In Pekgoz’s Harvard complaint, for example, he  notes that whenever the Department of education investigates an  institution for anti-male discrimination, public attitudes on the issue  are on the side of men: “\\[A\\]ccording to a recent poll conducted by  YouGov, 69% of all Americans believe that men face discrimination to  some extent. 74% of men believe that such discrimination occurs, while  63% of women agree that men face some degree of discrimination.”\n\nFiamengo points to what she ([and I](http://www.barbarakay.ca/articles/view/1297)) consider radical feminism’s shark-jumping moment, the publication in the *Washington Post* of Northeastern University academic Suzanna Danuta Walters’s odiously misandric June, 2018 article, “[Why can’t we hate men](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html)?” which earned her a [Title IX complaint](https://www.campusreform.org/?ID=11249) filed by the National Coalition for Men [(NCFM).](https://ncfm.org/)  Walters doubtless expected her screed would find the passive acceptance  such anti-male rants often have done in the past, but was clearly  startled by the fierce blowback she received.\n\nA final word about  Kursat Christoff Pekgoz. I don’t know him personally, but from his  history, I would say that the USC Literature department picked the wrong  guy to tangle with when they forced him out of his PhD program. This is  a young man, now 30-something, who comes from Turkey, a land where they  play political hardball, and backing the wrong horse can earn you  something worse than a Twitter mobbing. He learned about activism in  what we might call an “unsafe space.”\n\nPekgoz’s [*curriculum vitae*](https://www.kursatchristoffpekgoz.com/)  informs us that In Turkey Pekgoz went out on potentially dangerous  political limbs. He took part in the Republic protests of 2007 against  fundamentalist Islam, as well as a protest against Islamist hate speech  targeting Armenian and Jewish minorities in 2009, amongst other forays.  He advocated against electoral fraud by the Islamist regime. He taught *pro bono* for an anti-Islamist organization that seeks to eliminate illiteracy among young women in Ankara (real feminism in action). \n\nAll  this speaks to character. For relentless discipline and determination  in achieving goals, add this salient fact: As a long-distance swimmer,  Pekgoz has covered 11,000 m in the open sea, with the best speed of  5,000 m in 130 minutes. This is in seawater with a temperature of 17C.  Don’t look to such a man to truckle to latte-sipping ideologues  trafficking in gender injustice. Ever.\n\nAccording to his bio,  Pekgoz has “perfect pitch.” He means musically, of course. But it may be  the case that he has perfect cultural pitch as well.\n\n&#x200B;\n\n[https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/](https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/)",
    "title": "One brave young man takes on gender inequality at USC",
    "subreddit": "MensRights",
    "timestamp": 1569207365,
    "score": 190,
    "keyword": "man engineer"
  },
  {
    "text": "Let's discuss how women exert power and influence in society One of the recent dog whistles from feminists is that men can't be discriminated against, because men are the ones who hold power and influence in society, and not women.  While I don't agree with the logic behind this argument, I also don't think it's true that men have most of the power, and that women are strictly powerless.\n\nIn this post I will briefly outline ways that women have power, and how this power has been used to subjugate men in various areas of society.\n\n###**Examples of power and influence held by women**\n* **Women make up 54% of the electorate in the United States** ([source](http://cawp.rutgers.edu/sites/default/files/resources/genderdiff.pdf))**, and a majority of the electorate in most democratic nations world-wide**.  The female vote is often seen as the most important cohort of voters.  It is more important than the male vote, the white vote, and the minority vote.\n* **Feminism and women's groups make up the second largest special interest group in the United States (behind the military industrial complex) and are the largest special interest group worldwide, in places like Canada, Japan, and Europe**.  They also hold significant sway in local state and municipal elections.  And let's not forget that the military industrial complex is not friendly to men.\n* **Women hold a significant amount of wealth worldwide, and a majority of the wealth in the United States (by some estimates: 60%)** ([source 1](https://www.marketwatch.com/press-release/bmo-report-despite-controlling-14-trillion-in-wealth-american-women-still-have-challenges-to-overcome-2015-04-02-13173119), [source 2](https://www.forbes.com/sites/work-in-progress/2010/07/28/women-making-economic-strides-and-not-slowing-down/)).  To the extent that wealth translates to power, women are the ones who take most of it.  This also means that, baring an aversion to investing in equities, women likely own a majority of all publicly traded companies in the United States.\n* **Women control a majority of spending, exerting even more economic influence through the wallets of their boyfriends and husbands** ([source](https://www.fastcompany.com/1663594/women-dominate-the-global-market-place-here-are-5-keys-to-reaching-them )).  What this means is that most companies cater to women, not to men.  Most luxury cars worldwide are sold to women ([source](https://www.bloomberg.com/news/articles/2018-02-13/luxury-automakers-are-finally-discovering-the-power-of-women-buyers)), most advertising is marketed towards women, and most decisions made by large companies are designed to cater to women.\n* **Women control most relationships and most marriages**.  The so-called \"ball and chain\" is real.  Women make a majority of the decisions for most families ([source](https://www.scotsman.com/lifestyle-2-15039/women-decide-to-rule-the-roost-1-1503380)), and when a husband and a wife disagree about something, the wife gets her way the vast majority of the time ([source](https://public.psych.iastate.edu/ccutrona/psych592a/articles/Vogel%202007.pdf)).  Note that this is not because men cede this power to women willingly; women actively take it from men ([source](https://public.psych.iastate.edu/ccutrona/psych592a/articles/Vogel%202007.pdf)) through manipulation, gaslighting, the threat of divorce, and other abusive behaviors.\n* **By default people listen to women more, and women exert more social influence than men**. Gender feminists like to talk about power dynamics between wealthy men and poor women, as if it were a common occurrence in society.  But they ignore that, by default, it is women who have the upper hand and often control men.  Women are more likely to get their way and are more likely to be in charge of social situations than men.\n* **Academia is incredibly sympathetic to women and gender feminism**.  Equity feminists (feminists who believe strictly in equality) have been complaining about this since at least the 1990s ([source](https://en.wikipedia.org/wiki/Who_Stole_Feminism%3F)).  Gender feminism is the primary form of feminism held by academics, and there has been widespread complaints that dissenting views are not tolerated, and that professors with dissenting views are often discriminated against.  Examples of unethical academic behavior and discrimination is published in the academic literatute, and is itself the topic of academic study, even among feminists ([source 1](https://psycnet.apa.org/record/2012-19716-004), [source 2](https://www.researchgate.net/publication/265747881_Disabusing_the_definition_of_domestic_abuse_How_women_batter_men_and_the_role_of_the_feminist_state), [source 3](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2790940)).\n* **Hollywood is incredibly sympathetic to women and gender feminism**.  Most media representations of men are negative, and masculinity is actively attacked in TV shows and movies ([source](https://archive.is/NHC61)).  Most Hollywood actors pay lip service to gender feminism, and it is likely necessary for them to do so if they want to advance their careers.\n\n###**Examples of how this power and influence has been used**\n* Many of our divorce and child custody laws were championed by stay at home wives who were afraid of being divorced, and women today are slow in wanting to change them (often not even wanting to sign a prenup when they get married).  Being that most women supported these laws, and that women made up a majority of the voting public, it was only natural that these laws were passed.  The amount of money that is transferred from men to women through marriage and divorce is likely on the order of hundreds of billions of dollars a year, if not more.  This represents a significant infringement on male financial and bodily autonomy, and it is women who are primarily responsible for this situation.\n* Men do not have the same rights that women have when it comes to their choice to be a parent.  Women can unilaterally chose whether or not they want to raise a child, and men are forced to go along with that decision.  Men are literally *powerless* here, being completely beholden unto the mother, and are often forced into wage slavery as a result.\n* Men are less likely to receive custody of their children, even when they are the better parent ([source 1](http://www.breakingthescience.org/SJC_GBC_analysis_intro.php), [source 2](https://themalefactor.com/2019/10/03/37-ways-men-are-discriminated-against/)).  This is in large part because of laws that were passed by female voters, and by discrimination and stereotypes that fathers face on a societal level that are often enforced by women.\n* Women have dramatically expanded welfare programs and created an unfair tax situation for men.  Welfare may be politically divisive, but it is factually true that women are more likely to use welfare ([source 1](https://www.creditdonkey.com/welfare-statistics.html), [source 2](https://www.census.gov/newsroom/press-releases/2015/cb15-97.html)), and it is factually true that women have consistently voted to expand welfare benefits to themselves ([source 1](http://www.people.fas.harvard.edu/~iversen/PDFfiles/LottKenny.pdf), [source 2](http://conference.iza.org/conference_files/ELIT2008/bertocchi_g1882.pdf), [source 3](https://www.jstor.org/stable/30026099?seq=1)).  Women on average consume more government resources than what they pay back in taxes, and as a result, it is men who are paying for these programs ([source 1 (USA)](https://www.reddit.com/r/MensRights/comments/2kj8qu/the_benefits_gap_a_cursory_analysis_of_us_social/), [source 2 (New Nealand)](https://www.victoria.ac.nz/sacl/centres-and-institutes/cpf/publications/pdfs/WP10_2013_Distribution-Income-and-Fiscal-Incidence_18062013.pdf)).  This represents another form of wealth transfer form men to women.\n* Women have successfully manipulated men over thousands of years to provide them with free labor and money.  As a result, women can work easier jobs that pay less money, and use men to make up the difference.  Societal norms that pressure men to pay for dates, and to be the primary breadwinner in a relationship, are enforced by women and their preferences for dating and marriage.  The wage gap is likely not only caused by women, but is itself an indicator of financial privilege that women have over men.\n* Men are demonized and stereotyped, and these stereotypes are reinforced by TV shows, movies, and flawed academic theories.\n* Feminism itself represents a force of misandry and discrimination against men, and feminist theory is often used to shame men and silence their opinions ([source](http://everydayfeminism.com/2015/01/male-feminist-rules-to-follow/)).\n* Men are often nagged, harassed, and bossed around to do things against their will for their wives and girlfriends ([source 1](https://www.scotsman.com/lifestyle-2-15039/women-decide-to-rule-the-roost-1-1503380), [source 2](https://www.pewsocialtrends.org/2008/09/25/women-call-the-shots-at-home-public-mixed-on-gender-roles-in-jobs/), [source 3](https://public.psych.iastate.edu/ccutrona/psych592a/articles/Vogel%202007.pdf)).  Husbands spend more time, energy, and money supporting their families than their wives do.  As a result, women have more free time, and more money to themselves, outside of work, chores, and child care, than men do ([source 1](https://www.pewresearch.org/fact-tank/2019/06/12/fathers-day-facts/ft_18-05-01_fathersday_time/), [source 2](https://ifstudies.org/blog/the-myth-of-the-lazy-father)).\n* Men's spaces are increasingly disappearing in society, and the existence of concepts like the \"man cave\" proves that women are in charge of most spaces in society, including inside the home ([source](https://www.artofmanliness.com/articles/the-decline-of-male-space/)).  Men's spaces are often seen as sexist and old fashioned, whereas women's spaces are seen as normal and hip.  Many women's only spaces directly violate anti-discrimination laws, but are given a free pass ([source](https://www.seattlepi.com/lifestyle/article/So-far-women-only-gyms-are-allowed-by-the-courts-1133532.php)).\n* Our school systems have been reformed to help girls, and this has created a toxic environment for boys to grow up in ([source](https://www.theatlantic.com/magazine/archive/2000/05/the-war-against-boys/304659/)).  Gender feminism is primarily responsible for these reforms.\n* Given the same qualifications, women are often paid more than men ([source 1](https://www.nytimes.com/2019/03/04/technology/google-gender-pay-gap.html), [source 2](https://inews.co.uk/news/media/bbc-men-pay-rise-gender-514047), [source 3](https://www.outkickthecoverage.com/the-us-womens-soccer-team-is-actually-paid-more-than-the-men/)) and many job openings specifically, and openly, discriminate against men in favor of women ([source 1](https://www.npr.org/sections/ed/2015/04/22/396672571/could-it-be-researchers-find-a-hiring-bias-that-favors-women), [source 2](https://www.theguardian.com/education/2019/jun/18/top-engineering-university-to-open-jobs-exclusively-to-women)).  \n* Women have successfully campaigned to remove homeless shelters for men, and create new homeless shelters for women (often in their place) ([source 1](https://patch.com/new-york/flushing-murray-hill/college-point-shelter-opens-week-will-only-house-women), [source 2](https://www.bizjournals.com/memphis/news/2019/04/26/city-county-unveil-plan-to-redevelop-building-near.html)).  This is despite the fact that most of the chronically homeless and unsheltered are men ([source](https://files.hudexchange.info/resources/documents/2018-AHAR-Part-1.pdf)).  Conversations about homelessness tend to focus on helping women, instead of helping men ([source 1](https://m.huffpost.com/us/entry/us_560bfafde4b0af3706dec4a0), [source 2](https://www.homeless.org.uk/sites/default/files/site-attachments/Homeless%20Link%20-%20analysis%20of%20rough%20sleeping%20statistics%20for%20England%202017.pdf), [source 3](https://www.academia.edu/Documents/in/Gender_and_homelessness), [source 4](https://i.imgur.com/v4yuVub.jpg)).\n* There are more domestic violence shelters for women than there are for men, even though men are equally likely to be victims.  This is enforced by flawed stereotypes against men that come largely from academic and societal influences that are wielded by \"radical-feminists\" ([source](https://psycnet.apa.org/record/2012-19716-004)).  Feminists have distorted domestic violence definitions at an academic level, and have influenced law enforcement strategies, and these influences have caused female perpetrators to walk free, and male victims to be mistakenly arrested and prosecuted instead ([source](https://www.researchgate.net/publication/265747881_Disabusing_the_definition_of_domestic_abuse_How_women_batter_men_and_the_role_of_the_feminist_state)).  Male victims of domestic violence are often afraid of reporting their abuse for fear that they might be arrested instead of their abuser ([source](https://psycnet.apa.org/record/1997-36466-000)).\n* The legal definition of rape is defined in such a way that women cannot legally rape a man, meaning that male victims of rape often cannot prosecute their attackers ([source](http://www.legislation.gov.uk/ukpga/2003/42/section/1)).  This legal definition is influenced by the feminist definition of rape, which only counts \"insertion\" and not \"made to insert\" as a form of rape.  These flawed legal and academic definitions of rape have skewed years of statistics and data on the topic, and have allowed countless numbers of female rapists to walk free.\n* Awareness of sexual assault and other forms of violence against men, by women, is virtually non-existent.  Men are equally likely to be raped as women are ([source](https://www.scientificamerican.com/article/sexual-victimization-by-women-is-more-common-than-previously-known/)), and women are equally likely to commit domestic violence against men as the reverse ([source 1](https://pdfs.semanticscholar.org/32b9/67aa6ff64264da8c7a67895c516032ff023e.pdf), [source 2](http://web.csulb.edu/~mfiebert/assault.htm)).  Men receive very little recognition as potential victims, and are instead vilified as being abusers.  Societal conversations that include these topics are incredibly sexist against men, and male victims receive virtually no support or attention ([source 1](http://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf), [source 2](https://beaveronline.co.uk/lack-of-support-for-male-victims-of-sexual-harassment-at-lse/)).  Research indicates that one of the main reasons for this is because data about male victimization directly contradicts the social narrative that \"radical-feminists\" are trying to push.  In fact, \"radical-feminists\" often attack and argue against the validity of this research ([source](https://psycnet.apa.org/record/2012-19716-004)), which has the effect of further marginalizing men and male victims of abuse.\n\nI think, just from these examples, it is clear that women hold a substantial amount of power, influence, and privilege in society.  Men's issues can be, and often are, caused by women (whether or purpose or not).  And in particular, gender feminism has been a strong force of misandry and discrimination in society over the years, *a fact that other feminists have been very prominent in pointing out themselves*.\n\nNext time someone tries to argue that men can't be marginalized or discriminated against because men somehow hold more power in society, remember to point out that this is simply not true.  Women hold a substantial amount of power in society, and this power has been used in many different areas to enforce gender norms, and defend the status quo, in ways that often benefit women over men.\n\n___\n####References\n#######1. Center for American Women and Politics (2019, September 16). Gender differences in voter turnout. Available from: http://cawp.rutgers.edu/sites/default/files/resources/genderdiff.pdf\n#######2. COMTEXT (2016, April 2). BMO Report: Despite Controlling $14 Trillion in Wealth, American Women Still Have Challenges to Overcome. MarketWatch. Retrieved October 21, 2019, from https://www.marketwatch.com/press-release/bmo-report-despite-controlling-14-trillion-in-wealth-american-women-still-have-challenges-to-overcome-2015-04-02-13173119\n#######3. Gunelius, S. (2010). Women Making Economic Strides and Not Slowing Down. Forbes / Forbeswomen. Available at: https://www.forbes.com/sites/work-in-progress/2010/07/28/women-making-economic-strides-and-not-slowing-down/\n#######4. Fabry, S. (2011). Women Dominate The Global Market Place; Here Are 5 Keys To Reaching Them.  Available from: https://www.fastcompany.com/1663594/women-dominate-the-global-market-place-here-are-5-keys-to-reaching-them\n#######5. Elliott, Hannah (2018, February 13) Luxury Automakers Are Finally Discovering the Power of Women Buyers.  *Bloomberg Businessweek*, February 19, 2018 Issue. Available from: https://www.bloomberg.com/news/articles/2018-02-13/luxury-automakers-are-finally-discovering-the-power-of-women-buyers\n#######6. The Scotsman (2011, March 1). *Women decide to rule the roost*. Retrieved October 21, 2019, from https://www.scotsman.com/lifestyle-2-15039/women-decide-to-rule-the-roost-1-1503380\n#######7. Vogel, D. L., Murphy, M. J., Werner-Wilson, R. J., Cutrona, C. E., & Seeman, J. (2007). Sex differences in the use of demand and withdraw behavior in marriage: Examining the social structure hypothesis. *Journal of Counseling Psychology*, 54(2), 165. Available from: https://public.psych.iastate.edu/ccutrona/psych592a/articles/Vogel%202007.pdf\n#######8. Sommers, C. H. (1995). *Who stole feminism?: How women have betrayed women*. Simon and Schuster.\n#######9. Straus, M. A. (2010). Thirty years of denying the evidence on gender symmetry in partner violence: Implications for prevention and treatment. *Partner Abuse*, 1(3), 332-362.  Available from: http://dx.doi.org/10.1891/1946-6560.1.3.332\n#######10. Kelly, Linda. (2003). Disabusing the definition of domestic abuse: How women batter men and the role of the feminist state. *Florida State University Law Review*. 30, 791. \n#######11. Abrams, Jamie R., The Feminist Case for Acknowledging Women's Acts of Violence (May 1, 2016). *Yale Journal of Law & Feminism*, Vol. 27, No. 2, 2016; University of Louisville School of Law Legal Studies Research Paper Series No. 2016-5. Available at SSRN: https://ssrn.com/abstract=2790940\n#######12. [https://archive.is/NHC61](https://archive.is/NHC61) (*University of Western Sydney news archives page \"Men become the main target in the new gender wars\"*)\n#######13. Rosenthal, M. B. (1995). Misrepresentation of Gender Bias in the 1989 Report of the Gender Bias Committee of the Massachusetts Supreme Judicial Court. Retrieved October 21, 2019, from http://www.breakingthescience.org/SJC_GBC_analysis_intro.php\n#######14. The Male Factor (2019, October 3). 37 Heart-wrenching Ways Men Are Discriminated Against. The Male Factor (TMF). Retrieved October 21, 2019, from  https://themalefactor.com/2019/10/03/37-ways-men-are-discriminated-against/\n#######15. Benatar, D. (2012). *The second sexism: discrimination against men and boys*. John Wiley & Sons.\n#######16. Lake, Rebecca (2016, May 23). 23 Shocking Statistics Of Welfare in America. Retrieved October 21, 2019, from https://www.creditdonkey.com/welfare-statistics.html\n#######17. United States Census Beureau (2016, May 28).  21.3 Percent of U.S. Population Participates in Government Assistance Programs Each Month. Retrieved October 21, 2019, from https://www.census.gov/newsroom/press-releases/2015/cb15-97.html\n#######18. Lott, Jr, J. R., & Kenny, L. W. (1999). Did women's suffrage change the size and scope of government?. *Journal of political Economy*, 107(6), 1163-1198. Available from: http://www.people.fas.harvard.edu/~iversen/PDFfiles/LottKenny.pdf\n#######19. Bertocchi, G. (2011). The enfranchisement of women and the welfare state. *European Economic Review*, 55(4), 535-553. Available from:  http://conference.iza.org/conference_files/ELIT2008/bertocchi_g1882.pdf \n#######20. Abrams, B. A., & Settle, R. F. (1999). Women's suffrage and the growth of the welfare state. *Public Choice*, 100(3-4), 289-300. Available from:  https://www.jstor.org/stable/30026099?seq=1\n#######21. u/xNOM (2015). The benefits gap -- a cursory analysis of US social security (OASI) and disability insurance (DI). r/MensRights. Available from: https://www.reddit.com/r/MensRights/comments/2kj8qu/the_benefits_gap_a_cursory_analysis_of_us_social/\n#######22. Aziz, O., Gemmell, N., & Laws, A. (2013). The distribution of income and fiscal incidence by age and gender: Some evidence from New Zealand. *Victoria University of Wellington Working Paper in Public Finance*, (10).  Available from: https://www.victoria.ac.nz/sacl/centres-and-institutes/cpf/publications/pdfs/WP10_2013_Distribution-Income-a\n#######23. Clifton, Derrick (2015, January 10). So You Want to Be a Male Feminist? Here are 11 Simple Rules to Follow. everyday feminism. Retrieved October 21, 2019, from http://everydayfeminism.com/2015/01/male-feminist-rules-to-follow/\n#######24. Morin, R., & Cohn, D. (2008). Women call the shots at home; public mixed on gender roles in jobs. *Pew Research Center*.[Online] Available from: https://www.pewsocialtrends.org/2008/09/25/women-call-the-shots-at-home-public-mixed-on-gender-roles-in-jobs/ Accessed March, 10, 2010.\n#######25. Pew Research Center (2019, June 12). For both moms and dads, more time spent on child care. *Pew Research Center*.  [Online] Available from: https://www.pewresearch.org/fact-tank/2019/06/12/fathers-day-facts/ft_18-05-01_fathersday_time/ Accessed June, 12, 2019.\n#######26. VerBruggen, R. (2019, June 11). The Myth of the 'Lazy' father.  Institute for Family Studies. Retrieved October 21, 2019, from https://ifstudies.org/blog/the-myth-of-the-lazy-father\n#######27. Brett (2010, January 10).  The Decline of Male Space.  Art of Manliness.  Retrieved October 21, 2019, from https://www.artofmanliness.com/articles/the-decline-of-male-space/\n#######28. Dizon, Kristin (2004, Januar 1). So far, women-only gyms are allowed by the courts.  seattle pi.  Retrieved October 21, 2019, from https://www.seattlepi.com/lifestyle/article/So-far-women-only-gyms-are-allowed-by-the-courts-1133532.php\n#######29. Hoff Sommers, C. (2000). The war against boys. Available from: https://www.theatlantic.com/magazine/archive/2000/05/the-war-against-boys/304659/ Accessed October 21, 2019.\n#######30. Wakabayashi, Daisuke (2019, March 4). Google Finds It’s Underpaying Many Men as It Addresses Wage Equity.  The New York Times. Retrieved October 21, 2019, from https://www.nytimes.com/2019/03/04/technology/google-gender-pay-gap.html\n#######31. Sherwin, A. (2018, January 30). BBC men to get pay rises as review rejects gender discrimination claims. iNews. Retrieved October 21, 2019, from https://inews.co.uk/news/media/bbc-men-pay-rise-gender-514047\n#######32. Travis, Clay (2019, July 30). The US Women’s Soccer Team Is Actually Paid More Than the Men. Outkick The Coverage. Retrieved October 21, 2019, from https://www.outkickthecoverage.com/the-us-womens-soccer-team-is-actually-paid-more-than-the-men/\n#######33. Phillips, Owen (2015, April 22). Could It Be? Researchers Find A Hiring Bias That Favors Women.  National Public Radio. Retrieved October 21, 2019, from https://www.npr.org/sections/ed/2015/04/22/396672571/could-it-be-researchers-find-a-hiring-bias-that-favors-women\n#######34. Boffey, Daniel (2019, June 18). Top engineering university to open jobs exclusively to women.  The Guardian. Retrieved October 21, 2019, from https://www.theguardian.com/education/2019/jun/18/top-engineering-university-to-open-jobs-exclusively-to-women\n#######35. Kaufman, Maya (2019, September 30). College Point Shelter to Open as Woman-Only Amid Backlash. Patch. Retrieved October 21, 2019, from https://patch.com/new-york/flushing-murray-hill/college-point-shelter-opens-week-will-only-house-women\n#######36. Hardiman, Samual (2019, April 26). City, County unveil plan to redevelop building near Medical District for homelessness effort. Memphis Business Journal. Retrieved October 21, 2019, from https://www.bizjournals.com/memphis/news/2019/04/26/city-county-unveil-plan-to-redevelop-building-near.html\n#######37. Henry, M., Mahathey, A., Morrill, T., Robinson, A., Shivji, A., & Watt, R. (2018). The 2018 Annual Homeless Assessment Report (AHAR) to congress, part 1: Point-in-time estimates of homelessness. Washington, DC: *US Department of Housing and Urban Development*. Available from: https://files.hudexchange.info/resources/documents/2018-AHAR-Part-1.pdf\n#######38. Goldberg, Eleanor (2015, September 9). Portland, Oregon, Mayor Wants To House All Homeless Women By End Of Year.  Huffpost News. Retrieved October 21, 2019, from https://www.huffpost.com/entry/portland-oregon-mayor-wants-to-declares-homelessness-state-of-emergency_n_560bfafde4b0af3706dec4a0\n#######39. Homeless Link (2017). 2017 Rough Sleeping Statistics. *Homeless Link*.  Available from: https://www.homeless.org.uk/sites/default/files/site-attachments/Homeless%20Link%20-%20analysis%20of%20rough%20sleeping%20statistics%20for%20England%202017.pdf\n#######40. Academia: Recent papers in Gender and homelessness (9 articles about women, 1 about men, and 6 other / both).  Retrieved October 21, 2019, from https://www.academia.edu/Documents/in/Gender_and_homelessness\n#######41. That's a weird way of saying 75% of homeless people are men: \"1 in 4 Homeless People are Women\" (Newspaper article). https://i.imgur.com/v4yuVub.jpg\n#######42. Cook, P. W. (2009). *Abused men: The hidden side of domestic violence*. ABC-CLIO.\n#######43. Sexual Offences Act 2003, c. 42.  Available at: http://www.legislation.gov.uk/ukpga/2003/42/section/1\n#######44. Stemple, L., & Meyer, I. H. (2017). Sexual victimization by women is more common than previously known. *Scientific American*.  Available from: https://www.scientificamerican.com/article/sexual-victimization-by-women-is-more-common-than-previously-known/\n#######45. Straus, M. A. (1997). Physical assaults by women partners: A major social problem. *Women, men and gender: Ongoing debates*, 210-221. Available from: https://pdfs.semanticscholar.org/32b9/67aa6ff64264da8c7a67895c516032ff023e.pdf\n#######46. Stemple, L., Flores, A., & Meyer, I. H. (2017). Sexual victimization perpetrated by women: Federal data reveal surprising prevalence. *Aggression and Violent Behavior*, 34, 302-311.  Available from: http://webshare.law.ucla.edu/Faculty/bibs/stemple/Stemple-SexualVictimizationPerpetratedFinal.pdf\n#######47. Fairless, Morgan (2019). Lack of Support for Male Victims of Sexual Harrassment at LSE. TheBeaver. Retrieved October 21, 2019, from https://beaveronline.co.uk/lack-of-support-for-male-victims-of-sexual-harassment-at-lse/",
    "title": "Let's discuss how women exert power and influence in society",
    "subreddit": "MensRights",
    "timestamp": 1571686958,
    "score": 141,
    "keyword": "man engineer"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 128,
    "keyword": "man engineer"
  },
  {
    "text": "Is it just me or there's a lot of interest for men coming from feminists and progressives? Is it just me or there's a lot of interest for men coming from the progressive side of the political spectrum? It's not yet part of the mainstream political and social debate but it's slowly seeping into it. \n\nI'm talking of books like Liz Plank's For The Love Of Men or Rachel Giese's  What It Means to Become a Man discussing how to build a new masculinity etc.\n\nNeedless to say I don't agree with their assumptions and their conclusions and the whole operation looks to me like an attempt at socially engineering a new paradigm of masculinity more docile and compliant.",
    "title": "Is it just me or there's a lot of interest for men coming from feminists and progressives?",
    "subreddit": "MensRights",
    "timestamp": 1571234658,
    "score": 93,
    "keyword": "man engineer"
  },
  {
    "text": "Protests against The Red Pill especially in Australia back in 2017 doesn't create a media uproar? But if there are any protests against women's rights, they do cause a media uproar? #GenderInequality #Feminism Protests against a men's rights documentary doesn't cause any media uproar, but at the same time if the protests been against women's rights documentary it does definitely cause a huge media uproar. Our common enemy, the fake news media cherry picks stories to upset us,  point out our differences and divide us against each other instead of  joining forces to finally end gender inequality. If any innocent man is sent to prison for a crime he didn't commit, the feminist journalists are responsible for it other than the men oppressive judiciary system. What news would be there to publish, what long articles be there, if men and women aren't bad mouthing each other? In a calm society, there is less news, and thus lesser revenue for the media. In the 21st century at least, gender inequality has been socially engineered by the mainstream media, so that they have more stories and articles to publish.",
    "title": "Protests against The Red Pill especially in Australia back in 2017 doesn't create a media uproar? But if there are any protests against women's rights, they do cause a media uproar? #GenderInequality #Feminism",
    "subreddit": "MensRights",
    "timestamp": 1555827147,
    "score": 85,
    "keyword": "man engineer"
  },
  {
    "text": "International Women are Good Men Are Bad Day Hi ladies and  gents, if you live in the northern hemisphere you're probably still 'enjoying' the celebrations for International Women's Day. Now if this day was a celebration of women, motherhood, women's achievements, et cetera, I'd be enjoying it too, and have a glass of sparkling grape juice and a piece of cake.\n\n&#x200B;\n\nBut as a bigger, older school bully might say to you when you explain to her you need your lunch money, 'that's not how it works!'.\n\n&#x200B;\n\nIt's easy for men to celebrate women's achievements, and vice-versa, and at a superficial level that's not a zero sum game. However, when the tire hits the road, and we get into the real stuff like who gets the kids, who gets the university place, who gets the good job, and who gets a long prison sentence because their ex wants to say, 'yes, we did it like bunny rabbits for 5 years, but the last time was just horrible, I didn't want to and he should have known!', IT IS A ZERO SUM GAME To me, and my 'unconsciously biased' and 'white privileged' and 'arsehole and the cause of all human problems' eyes, feminism is not about equality, it is about increasingly advantaging group A (women) at the detriment of group B (men). And not a bit, crazy much. Don't get me wrong, most of this - except the kids bit - won't affect elite men and women, the top 5% can build their own businesses and make themselves the boss, feminism can't and won't attempt to influence this sort of thing. Their exes, who are likely also elites, will have too much to lose by making false claims and grueling through the justice process out for years, so they're unlikely to make them.\n\n&#x200B;\n\nSo selfish men in the top 5% of the income bracket, please stop reading now, enjoy your life, and forget about the enormous lifelong harms and disruptions injustly happening to other men.\n\n&#x200B;\n\nNow back to the point, IT IS A ZERO SUM GAME. It doesn't have to be - anyone who's had a good relationship with the opposite sex knows that. But as time goes on, I'm beginning to think the feminists who came after the Bolshevik revolution (so not the Suffragettes), were probably girls with pretty bad form sheets (several men, none who lasted) who always intended to create a zero sum game where women 'win' and men lose. Now of course, feminism clearly accepts the inevitable side effect of creating a zero sum game involving sex and/or marriage with the rules totally tilted against one player - the marriages don't last so well anymore. This is also not an accident, destabilizing marriage where monogamous, lifelong male female marriage becomes an exception rather than a norm was a primary goal of post Bolshevik feminism very early. You can see it in the Philippines - which is such an odd country as divorce is still illegal there - who is out there arguing for legalization of divorce? You got it, the women's rights movement. Philippines' divorce law is odd, as no other real country prohibits divorce, and I'm not actually defending the law - it seems outrageous to apply a Catholic standard of divorce for example to atheists, Muslims, or Episcopalians) - my point is, who's agitating for divorce? Feminists. Philippines is a valuable example because what we see is the progressive nature of feminism.\n\n&#x200B;\n\nFirst it's divorce, fine, that's gender neutral. Then it's no-fault divorce, well, fine, still gender neutral, although it causes massive spike in the divorce rate. But now the zero-sum part comes in - courts award custody of children to mothers, hey not so gender neutral, more zero-sum. Then, we've suddenly got a significant percentage of the population being divorced women with kids - hey the state needs to look after them. So there's welfare for single parents, again zero-sum with women 'winning' as they are the single parents. Now divorce is a cost-free option, because the state will carry the tab. Then UNMARRIED single mothers say, 'hey, what about me!', so now anyone who has a baby gets looked after by the state.\n\n&#x200B;\n\nI was once on a motorbike in Thailand. And a sad-looking, young-looking, not-pretty-looking Dutch woman came after me like a Cheetah wanting to mate with a Dachshund. All over me, wanting to come to my room. I must have friended her on Facebook or something, but did not go with her suggestion she come and stay in my room. A few years later I look on Facebook, sure enough a little white baby boy is born in Holland, sans-father. I don't blame this woman for having a baby, she was lonely and wanted one, and the Dutch state took care of the tab.\n\n&#x200B;\n\nSo that's one zero-sum game. But let's get now to couples, people who marry or are de-factos. If you live in any western country here's how it goes: You'd better forgive her for her occasional adulterous 'indiscretions' or 'you'll get what's coming to you'. If you've got kids, she'll get them - if you fight hard enough you'll get to see them, sometimes. She'll decide where they go to school, what they eat, wear, what out of school activities they do, what religion or no religion they follow, and how many boyfriends she brings back to meet them. If you have daughters, they will have the fortune of seeing and having modelled that women can have a 'healthy sexuality' as the wife leaves her husband and brings back a series of male lovers over a period of years.\n\n&#x200B;\n\nOh and of course, the money. Elites are a little bit different. But for the majority of the population, she'll get most of the assets - even if it was paid for by the husband's earnings. She'll also get a regular cut of your income - after all husbands should pay for the care of children they're denied to see, that's perfectly fair, isn't it?\n\n&#x200B;\n\nThen there's jobs. Got a profession like nursing or teaching predominantly female - that's fine. I went to a bank the other today and out of the 10 staff in the bank, 1 was male, the rest including manager and all seniors female. The lady Asian teller, who I'm normally very friendly with, got quite angry when I suggested it didn't look like the best bank branch for male job applicants. All deans of all faculties female (like RMIT University in Melbourne was), fine, most paediatric doctors female, fine. Too many senior board executives male - OH NO WE MUST FIX IT. Jobs predominantly male must have female quotas, jobs predominantly female should be left alone - ZERO SUM GAME people. Boy Scouts must allow girls, Girl Guides need not allow boys. I saw in the newspaper in Melbourne today that Geelong Grammar can discriminate and give scholarships only to girls. Does anyone reading this believe that any mixed private school in Melbourne would be given dispension to give scholarships only to boys?\n\n&#x200B;\n\nSo it's zero-sum game across the board: children, relationships, marriage, school, jobs...but let's get to the really good one, 'crimes against women and children'. So all this stuff I've mentioned above would still not keep down an entrepreneurial man who runs his own business. If he is his own boss, well, it's easy for him to hide income so his ex gets less - which would tend to press her to the negotiating table re: the kids - and he won't pass himself over for promotion because he is a man in his own business, so his own talent is his only limit. Now such a man might get uppity, and think he was equal with women, and go around doing a lot offensive male things like being assertive, picky about a women's sexual background and divorce history, and just being self-confident and living without fear.\n\n&#x200B;\n\nCan this really be tolerated? The feminists came up with the solution to that one too, let's change the law whenever a guy is charged with a crime against a woman - ie. the ex girlfriend who cries rape. Let's reveal his identity in the newspaper, but make hers protected upon penalty of contempt of court. Let's make him testify in open court, but let's let her testify remotely via video. Oh and if there's a hung jury, because some sexist jury member goes, 'oh wait, she was banging him the Tuesday before, and sexting, but how come she's saying rape on the Thursday?', guess what - she doesn't have to testify again, the court can just reply her recorded testimony. Oh yeah, and we can't ask her about her sexual history, or say that the fact, you know, she had sex with her boyfriend for years might mean it wasn't rape. I'm not making this stuff up - it differs from jurisdiction to jurisdiction, but there are a complete raft of these laws trying to engineer convictions. It often works, but not always. I spoke to a female former teacher of mine from University years ago, and she told me about a rape trial she was a jury member on. Finally the jury didn't convict because the 'victim' about an hour after her rape went and had sex with her boyfriend - the sexist jury didn't believe that a woman who was raped by her friend (not a cheating girlfriend, how dare you!) would go and then have sex with her boyfriend an hour later.\n\n&#x200B;\n\nThank God I've never had to deal with false charges brought against me - and let's face it, the system would grind to a halt if it started getting out of hand - but just the fear of false claim again is used to oppress and strike fear into the hearts of men. I'm not that worried by it, but mostly because I don't want to have flings with tarty looking girls with bad histories, and I think every man in his right mind would be aware of this and have some sort of risk management plan for it - this, itself, is fear.\n\n&#x200B;\n\nLook, I've gone on and on, and I could go on and on even further. But I won't. I would celebrate Women's Day if it wasn't for the fact that it's really, 'help women, harm men' day. It doesn't have to be like this, but it likely will continue to be so for the rest of our lives. In summation I have one point:\n\n&#x200B;\n\nFeminists realise their objective is a ZERO SUM GAME where there is a definite winner (women) and loser (men). Men and women who are not feminists need to realise the same thing, and the sooner the better.",
    "title": "International Women are Good Men Are Bad Day",
    "subreddit": "MensRights",
    "timestamp": 1552081689,
    "score": 69,
    "keyword": "man engineer"
  },
  {
    "text": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education   \n\nOrwell’s famous dystopia *1984* is often cited as a parable  about the banality of administrative evil. The ever-vigilant bureaucrats  of Oceania position themselves not only on the Left side of history,  but also at its *end.* To err from their ideology is treason.\n\nThe citizens of Oceania live in a state of self-imposed hypnosis  where they have to pretend that even the simplest of words signify their  exact opposites. The government agency that specializes in espionage  and torture is thus called *The Ministry of Love*. The Ministry views every sexual act as a potential crime unless proven otherwise via affirmative surveillance.\n\nImagine a federal agency that has invested itself with the authority  to monitor the most private details of citizens to root out sexual  heresy. Imagine a federal  agency which once contemplated [installing security cameras](http://pgbovine.net/OET-Draft-Grit-Report-2-17-13.pdf) in every classroom in order to monitor the facial and optical muscles of all students nationwide.\n\nThis agency was so devoted to its ideological mission that it never presented its [unconstitutional rules](https://www.thefire.org/did-the-office-for-civil-rights-april-4-dear-colleague-letter-violate-the-law/) to the American public to consult their opinion, considered itself to be [a superior alternative](https://www.huffpost.com/entry/why-students-are-fighting-for-title-ix_b_58e27314e4b0ca889ba1a848) to the criminal justice system, granted itself [universal jurisdiction](https://www.insidehighered.com/news/2018/01/19/feds-find-buffalo-state-failed-investigate-alleged-sexual-assault-created-hostile), threatened many colleges with financial death unless they punished [constitutionally protected speech](https://www.nas.org/blogs/dicta/ocrs_new_sexual_harassment_guidelines_threaten_academic_freedom_due_process), sought to abolish the [“reasonable person” standard](https://reason.com/2016/09/12/ocr-to-frostburg-state-university-common), and created [a class of imitative bureaucrats](https://www.nas.org/blogs/dicta/gender_inequity_among_the_gender_equity_enforcers) in academic institutions to perpetuate an industry of victimhood.\n\nImpossible, you think? We have just objectively described the record  of the Department of Education’s civil rights branch, the Office for  Civil Rights.\n\nThe Office for Civil Rights (OCR) received bipartisan and  professional criticism for its unconstitutional actions during the Obama  administration. Formal critics include the [Federalist Society](https://regproject.org/wp-content/uploads/RTP-Race-Sex-Working-Group-Paper-Campus-Misconduct-Proceedings.pdf), [Heritage Foundation](https://www.heritage.org/crime-and-justice/report/campus-sexual-assault-understanding-the-problem-and-how-fix-it), [National Association of Scholars](https://www.nas.org/articles/nas_applauds_secretary_devos_decision_on_title_ix),[ California Governor Jerry Brown](https://www.wsj.com/articles/jerry-browns-title-ix-veto-1508280834), [Justice Ruth Bader Ginsburg](https://reason.com/blog/2018/02/19/ruth-bader-ginsburg-due-process-me-too),  [American College of Trial Lawyers](https://www.actl.com/docs/default-source/default-document-library/position-statements-and-white-papers/task_force_allegations_of_sexual_violence_white_paper_final.pdf), and [Reason Foundation](https://reason.com/blog/2017/09/07/betsy-devos-rape-ocr-title-ix-campus).\n\nMoreover, courts that have heard cases involving OCR’s Title IX  procedures have often strongly denounced them. Examples include  condemnatory opinions from the [Second Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca2/15-1536/15-1536-2016-07-29.html) and the [Sixth Circuit of Appeals](http://www.opn.ca6.uscourts.gov/opinions.pdf/18a0200p-06.pdf). In a recent [Seventh Circuit of Appeals](https://law.justia.com/cases/federal/appellate-courts/ca7/17-3565/17-3565-2019-06-28.html)  opinion, Judge Barrett stated that “Purdue’s process fell short of what  even a high school must provide to a student facing a days-long  suspension.” Professor KC Johnson [has covered the case in greater detail. ](https://www.city-journal.org/john-doe-v-purdue-univ)\n\nObama’s OCR espoused a particular brand of radical feminism.  According to this doctrine, taught across the nation in women’s studies  departments, men have brutalized women since the beginning of history.  Past oppression must be remedied through government intervention,  eliminating the due process principles that are meant to protect every  American.\n\nThe perils of government tyranny aside*,* the fundamental  assumptions of the “patriarchy theory” cannot survive rational scrutiny.  While it is true that women were historically denied various rights,  they have also been sheltered from grievous harm (combat, for example).  Also, analysis of federal aggregate data from the United States  demonstrates that women are [as likely to engage in sexual coercion](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) against men as [vice versa](https://www.sciencedirect.com/science/article/pii/S1359178916301446?via%3Dihub), which undermines the “patriarchy” narrative.\n\nAt any rate, past historical wrongs cannot be rectified by unfair treatment in the present, as the Eighth Circuit stated in [this ruling](https://cases.justia.com/federal/appellate-courts/ca8/18-3077/18-3077-2019-03-06.pdf?ts=1551889833).\n\nOCR’s historical record speaks to its lack of fairness. The agency  authored a total of 255 resolution letters (formal decisions in a case)  from 2012 to 2019.\n\n[Pekgoz summarizes the circumstances in a Synthetic Analysis](https://static.wixstatic.com/media/ea7b71_a751c44c74dc4e8fa8f35666ab9b81a1~mv2_d_3812_2108_s_2.jpg/v1/fill/w_3812,h_2108/PrintScreen%2C%20Synthetic%20Analysis.jpg).\n\nThe analysis shows that whenever OCR wrote a resolution letter  between 2012 and 2019 to adjudicate adversarial proceedings between  female and male parties, they sided with the female 216 times but only 9  times with the male (2400% more likely to side with the female). Their extreme partisanship is clear in every  aspect of Title IX.\n\n&#x200B;\n\n* **Athletics.** The Department’s athletics compliance tests have been [rightfully criticized](https://www.nccivitas.org/2010/title-ix-blind-quota-system-or-how-kneecap-college-sports/)  for imposing unconstitutional quotas. The agency sided with female  athletes 63 times, but sided with the male only once between 2012 and  2019. The only resolution letter favorable for male athletes is the [Temple University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03142257-a.pdf).\n* **Grading.** The Department sided with female students who alleged [discrimination](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/06112126-a.pdf) in [grading](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11162077-a.pdf) on [multiple occasions](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15132147-a.pdf), while dismissing [very similar allegations by male students](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/07132238-a.pdf).\n* **Retaliation.** The Department sided with female  complainants alleging retaliation on many occasions. There are at least  23 letters in this category, such as the [Jacksonville State University Letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/04142086-a.pdf)  where the agency sided with a “falsely accused” woman. There is no  clear example of the Department siding with a male student alleging  retaliation on the basis of sex, [but dismissal letters do exist](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10111376-a.pdf).\n* **Sexual Harassment.** Male students who petitioned the  agency to allege bias in sexual harassment disputes (either as the  accused, or the accuser) had a success rate of 1.1 percent during  2012-2019 (6/532). The Department was very aggressive when it came to  siding with female accusers while consistently dismissing the concerns  of accused males. This is despite male students often suffering  life-altering consequences, such as expulsion or a permanent notation on  their transcript, in addition to severe emotional distress. [Some have committed suicide](https://www.insidehighered.com/news/2017/05/02/title-ix-cases-resulted-suicide-suicide-attempt-two-colleges-prompt-fresh-debate).\n* **Reasonableness.** OCR urged schools to get rid of the  “reasonable person” standard at least twice:  One letter involved a  female student who accused a male teacher of [staring at her breasts for 3-4 seconds](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09141376-a.pdf). Another letter involved a costly systemic review because very young students [were playing “National Grab Ass Day”](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131106-a.pdf) during play time. The agency even sided with a female student whose claims of sexual violence [were disproven via DNA evidence](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/15112115-a.pdf).\n* **Due Process.** While sending a dismissal letter to an accused male student, OCR argued that [“due process” is not covered by Title IX](https://www.scribd.com/document/426012564/Samuel-Meritt-University-Dismissal).  As long as the accused is a man, that is. Federal bureaucrats  aggressively sided with women who were accused of various sexual  infractions. On one occasion, the Department condemned a university for  allowing a male [to file a counter-claim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11116001-a.pdf) of misconduct against a female student. Another time, the agency [threatened a university](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/01102089-a.pdf)  with loss of federal funding for pressing fraud charges against a woman  who made false accusations. There is also an example of OCR using [defamation theory to side with a female complainant](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11141175-a.pdf), even though the agency has never accepted any complaints concerning the damaged reputations of accused men.\n* **Single-Sex Programs.** Women are the majority of college students, but many colleges offer dozens of support programs [for women only](https://www.jamesgmartin.center/2019/05/identity-politics-versus-basic-logic-should-colleges-offer-affirmative-action-for-the-female-majority/).  Whenever male complainants challenge female-only programs, such as  women’s centers or STEM camps for girls, the Department has dismissed  their complaints on various pretexts. One popular pretext is that these  female-only programs cannot be challenged unless men specifically apply  to them and receive rejections, thus creating a putative victim.  However, OCR has resolved [procedural complaints in the absence of any victim](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/02152290-a.pdf) on many occasions, as long as the objective [was consistent with their agenda. ](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/03121217-a.pdf)\n* **American Psychological Association (APA) Guidelines.** OCR dismissed a Title IX complaint challenging the APA guidelines, which sought to [classify masculinity as a mental illness factor](https://www.dailywire.com/news/46458/foia-request-reveals-boston-title-ix-office-has-ashe-schow).  This was despite serious public outcry against those guidelines. In the  dismissal letter, officials argued that Title IX cannot be applied in a  manner that would interfere with curricular materials. That was false.  OCR has aggressively interfered with [the training materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11142219-a.pdf) and [the curricular materials](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/11131096-a.pdf) of [various colleges](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/10131040-a.pdf) as long as doing so furthers their gender agenda.\n* **Administrative Closure.** OCR has a rule requiring  the dismissal of pending complaints if similar allegations have been  filed elsewhere. This rule is rigorously applied [to male students to dismiss their Title IX complaints.](https://www.documentcloud.org/documents/3479594-Stanford-University-09-15-2324.html) However, when [female students file complaints against their institutions](https://www.ed.gov/news/press-releases/office-civil-rights-launches-investigation-university-southern-californias-handling-sexual-harassment-claims), administrative closure is not applied to dismiss their allegations.\n\nSome might assume that OCR has received few meritorious complaints  from male students. According to a Freedom of Information Act request,  however, the Department received [532 complaints](https://www.scribd.com/document/426016051/FOIA-All-532-Cases-With-545-Relevant-Allegations) from men in the sexual harassment category alone between 2011 and 2019.\n\nThe Department of Education became a hive of identity politics under  Obama and there is little evidence of improvement. The modest reforms  proposed by Secretary Betsy DeVos have not yet been implemented.\n\nResolution letters published under the Trump administration perpetuate the Obama doctrines. For example, [the Stanford University letter](https://provost.stanford.edu/wp-content/uploads/sites/4/2018/04/OCR-Redacted-Stanford-Letter-of-Finding.pdf) tried to eliminate the reasonable person standard. [The Butte-Glenn Community College letter](https://www2.ed.gov/about/offices/list/ocr/docs/investigations/more/09132096-a.pdf) involved a retroactive review of many old complaints, demanding the creation of a complex bureaucracy. [The Buffalo State University letter](https://www.insidehighered.com/sites/default/server_files/media/OCR-SUNY-Buffalo-State.pdf) wrongfully claimed that off-campus incidents fall under the jurisdiction of Title IX, [despite case law to the contrary.](https://caselaw.findlaw.com/us-8th-circuit/1410731.html)\n\nUnsurprisingly, some politicians want to abolish the entire Department of Education. Representative Thomas Massie has [introduced a bill](https://massie.house.gov/newsroom/press-releases/rep-massie-introduces-bill-to-abolish-federal-department-of-education)  to do just that. While we cannot predict whether the Department will  ever be abolished, we must never cease our vigilance against our very  own *Ministry of Love.* \n\n*Kursat Christoff Pekgoz is a PhD student at the University of Southern California.*\n\n*James E. Moore, II is professor of industrial and systems  engineering; public policy and management; and civil engineering at the  University of Southern California.*\n\n[*https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/*](https://www.jamesgmartin.center/2019/10/the-ministry-of-love-ongoing-gender-partisanship-in-the-department-of-education/)",
    "title": "The Ministry of Love: Ongoing Gender Partisanship in the Department of Education",
    "subreddit": "MensRights",
    "timestamp": 1570815774,
    "score": 15,
    "keyword": "man engineer"
  },
  {
    "text": "Advice For Young Men Hi, I want to write this post for young men, say guys teens to 25, regarding my personal views of how young men might deal with the challenges of living within a feminist authoritarian society (ie. all Western countries).\n\n&#x200B;\n\nI think my starting point would be, YES realise the reality of a system that TENDS to binarily present women as having virtuous qualities and men as having vice-like qualities - that there is both public defamation of men and celebration of women, but also numerous actual laws and policies designed to promote women and constrain or retard men. Examples? Reserve jobs for women in male dominated industries (engineering), don't do it for men in female dominated industries (education, some higher education), let women use the Hague convention on child removal to recover their kids, but not men.\n\n&#x200B;\n\nSo once you have this starting point of awareness, my thoughts are a young man SHOULD NOT preoccupy on it and should get on and live his life. That means going on and doing all possible to advance his career (in the private sector a man may face less discrimination than in public service, in some academic environments in Australia a man would be a fool to pursue this career thread if he seeks to reach high office). It also means to lock in a reasonable woman as lifelong partner. Because of the imbalance of the genders' rights, responsibilities and powers the system appears to add lots of problems to the men in heterosexual relationships, but from what I have seen this is less of a problem for couples that met up at a young age. To put it bluntly, if you're 21-22, etc, lock in that 19 year old and build something she doesn't want to burn down no matter how much the feminists tell her to.\n\n&#x200B;\n\nAlso, I would suggest focusing on investing in relationships with family of origin (with the common sense caveat of not investing in abusive, non reciprocating people), particularly female family members. So that is sisters particularly, but further across, aunts, nieces, female cousins etc. The reason for this is women's access to their children is rarely compromised in relationship breakdown - so women relatives will generally be happier as they come out better off in relationship breakdown - and therefore, they generally will have more emotional reserves to help their own biological male relatives.\n\n&#x200B;\n\nI would on balance advise against getting too involved in men's rights, or even lurking here on reddit on the men's rights sub too much - once you realise the state of affairs, there's no point wallowing in the injustice. Get on with life avoiding many of the pitfalls so many here have fallen into. Maybe when you're older, very established, or whatever, such a man will be really helpful for the men's rights movement. Maybe his wife, daughter, or other family member will be an even more valuable spokesperson. But the point is, keep it to yourself.\n\n&#x200B;\n\nThese are my thoughts only. The way I see it now, improving legal conditions or media portrayal of men is a totally unrealistic goal, and for me the goal is simply to help men internally realise what is going on. That, to me, is a valuable outcome and realistic goal.\n\n&#x200B;\n\nBest of luck any young man reading this. If we could but put old heads on young shoulders...",
    "title": "Advice For Young Men",
    "subreddit": "MensRights",
    "timestamp": 1554940071,
    "score": 7,
    "keyword": "man engineer"
  }
]