[
  {
    "text": "No time to find a new job but I can't stay here I work in mid-sized office supply company doing marketing.  I was hired in June 2017 and have been \"considered\" management ever since I got here.  Now, when I say that, here is what I mean:  \n\n• I am one of the few salaried employees here    \n• I participate in all executive meetings but am the only \"manager\" without a staff, I do all marketing myself   \n• I cannot participate in employee events, partake in raffles, or anything that normal employees would benefit from, I am typically part of the staff that organizes and works the events (along with the other department heads)  \n• My boss (the C.O.O. [who practically runs this company due to the empty suit at C.E.O. being an elderly man]) often refers to me as \"Director of Marketing\" when it is convenient, but my \"official\" title is Marketing Coordinator.  When I say she refers to me as such when it is convenient, I mean, when introducing me to prospective clients or partners   \n\nI am certain I get paid less than every other \"manager\" here, which is alright, I am significantly younger than all of them.  I'm in my late 20's.  i am expected to wear many hats that expand well beyond the scope of \"Marketing Coordinator\" or even, \"Marketing Director\".  I draft million dollar proposals and draw up contracts when we land such clientele.  At the same time, I am doing administrative work that should be done by office managers or receptionists, such as maintaining the phone and email list.  I do IT work as primary keeper of our company website.  Graphic design even though I don't have any official adobe training or design training, and despite us having a graphic artist IN HOUSE.  The list literally goes on and on ... \n\n***Here's the thing ...***  \n\nOur collective boss, the C.O.O. and the only person I personally answer to, is a raging ruthless bitch.  I mean, had I looked at this company's glassdoor before interviewing and getting the job, I'd of seen literally tons of negative reviews specifically about her.  She is the worst kind of boss, I mean, if anyone recorded her there could easily be a lawsuit here at any day.  She is rude, makes personal insults, sexually harasses some people (like me, but never too crazy), screams at the top of her lungs in peoples faces in front of the general employee pool - I mean, just a nightmare.  A nightmare.  \n\nLately, shes been battling cancer and while that's humbled her some on most days, she still holds this insanely high level of intimidation and causes tension just being around people based solely on her reputation from beforehand.  Now, she still has her days to remind us all who she really is deep down, with the screaming, pinning managers against each other, personally insulting employees and thinking she's funny during Christmas parties, etc..  \n\nThis job has caused me to fall into a depression, I can't say for SURE it's the ONLY thing but I am certain it is one of the things that has caused me to be depressed.  I rarely do anything anymore, and part of it has to do with her, and the other part is the hour+ long commute to work, and the hour+ long commute home.  All in all my work day is between 10 and 11 hours, and I am doing things I never wanted to do, and being paid too little to do it.  I have been here almost 2 years and haven't been given a review or a raise due to her illness being a major excuse in not sitting down for a review (as well as HR informing me, \"we aren't that kind of business\" when I asked about yearly reviews.  She alluded to the fact that it's because of my boss).  \n\nWhat I really ***WANT*** to do, is quit, and take the time to find a new job.  However, I know that is ***NOT*** the smart thing to do, at all.  I don't have a lot of personal time remaining due to some things that have come up early this year, so applying in the few hours I have to myself after my 11 hour work day (while depressed and not wanting to do anything when I get home) is hard for me to focus on doing.  It will be even harder when I get an interview and can't take time off to go to it.  It just seems like I am stuck.  I'd like some advice...",
    "title": "No time to find a new job but I can't stay here",
    "subreddit": "jobs",
    "timestamp": 1554299691,
    "score": 112,
    "keyword": "man artist"
  },
  {
    "text": "Since Bohemian Rhapsody was a success, and Rocket Man is in production, what band/artist do you think will have a biopic made about them next?",
    "title": "Since Bohemian Rhapsody was a success, and Rocket Man is in production, what band/artist do you think will have a biopic made about them next?",
    "subreddit": "AskReddit",
    "timestamp": 1555557536,
    "score": 396,
    "keyword": "man artist"
  },
  {
    "text": "Men of Reddit, which artists/actors do you have a man crush on?",
    "title": "Men of Reddit, which artists/actors do you have a man crush on?",
    "subreddit": "AskReddit",
    "timestamp": 1563235162,
    "score": 6,
    "keyword": "man artist"
  },
  {
    "text": "Martial artists of Reddit, how accurate are the Ip Man movies?",
    "title": "Martial artists of Reddit, how accurate are the Ip Man movies?",
    "subreddit": "AskReddit",
    "timestamp": 1573747213,
    "score": 4,
    "keyword": "man artist"
  },
  {
    "text": "Why do well-known artists continue to release music through labels rather than cutting out the middle man once they are famous?",
    "title": "Why do well-known artists continue to release music through labels rather than cutting out the middle man once they are famous?",
    "subreddit": "AskReddit",
    "timestamp": 1551177696,
    "score": 3,
    "keyword": "man artist"
  },
  {
    "text": "If all of the greatest martial artists in history entered a free-for-all fight to the last man standing, who do you think would win?",
    "title": "If all of the greatest martial artists in history entered a free-for-all fight to the last man standing, who do you think would win?",
    "subreddit": "AskReddit",
    "timestamp": 1559775212,
    "score": 2,
    "keyword": "man artist"
  },
  {
    "text": "\"You said you work alone - I DON'T APPRECIATE BEING LIED TO!!\" i work in a small print studio. i screenprint shirts and totebags for local businesses and bands and things. i operate on an appointment only schedule because i'm working alone and if someone walks in while i'm printing i can't exactly stop and help them with whatever (usually stupid) question they have. i have a woman who helps me a couple hours a week; reclaiming screens, folding shirts, general shop assistant work. she gets to print her stuff here for free after hours - as do a couple other artist friends.\n\nlast friday, as i'm eating dinner between printing, a man comes in - without an appointment - and walks right behind the counter. leans over my food and starts trying to look at my emails and price lists, etc. i redirect him back to the customer area and we start to discuss a shirt he's brought with him. he wants to add a custom label to his cheap-as-fuck shirt so i explain that printing on the inside of a very thin shirt would show through to the back. he asks why no one else has warned him about this and i explain that because i run this studio by myself, i do sales and the printing, i'm going to know the ins and outs a little better than the uninitiated sales staff at a larger print shop. he seems excited about this. he asks if he could come in and watch me work. maybe assist me? i kind of laugh it off and change the subject.\n\nafter far too long, my dinner is cold and i ask him to leave the shirt, email his artwork and i'll get back to him. we don't print single shirts but if i have time next week i'll do a test for you and see if it bleeds through. i have a spot removal gun that will allow me to remove the print if it does bleed through. he says, \"let's do it now!\" and i explain i'm eating... it's hours of prep... i have other orders to print... etc.\n\nhe comes behind the counter again with his hard drive. i'm so shocked by his brazenness i don't fight it and drag a file from his hard drive to mine and he leaves.\n\nmonday comes, i print go to print out his label artwork and i realize when i dragged the files i only grabbed the SMALL.\n\ni send him an email that says,   \n*\"The shirt you dropped off is LARGE but I only saved the SMALL label - can you send the others?\"*\n\nhe does but the letters are very small. like, less than a pixel wide for some of the fonts. i try to shoot the screen 3 times - it keeps blowing out. i eventually get one that works and print it but the text is so small that the ink can barely get through the screen so the print isn't great. i email him to tell him this - ask him to thicken the lines, resend it and i'll try again. i can't do another free sample so i'll get an invoice going once i've got the new art.\n\nthe next morning i come into the studio and the woman who assists me says, \"some guy came in and took that shirt while i was printing some stuff here last night.\" she's kind of shook. he came in late at night and we work in an industrial area that doesn't see much action after dark and, again, we work on appointment only.\n\ni go to the computer to email him and remind him our policies when i see he's already emailed me.  \n*\"HOW FUCKING STUPID CAN YOU BE?!?!?! I GIVE YOU AN XL SHIRT AND YOU PUT A LARGE LABEL ON IT LIKE AN IDIOT! What gives you the right to destroy my brand? You too stupid to understand sizing?! THE LABEL LOOKS LIKE SHIT YOU MORON!!!! I can't believe you just ruined my shirt. YOU'RE A LIAR AND AN IDIOT! You said you work alone - I DON'T APPRECIATE BEING LIED TO!! i don't know why your fucking stupid brain thought I wasn't going to pay you! It's called quoting and invoicing - look it up on google.\"*\n\ni am so livid and fucking freaked out at this point. who has that kind of reaction? why did he want me to be there alone? who told him to pick up the shirt before i had a chance to fix it? also, i labelled the shirt correctly. i responded to his email with a forward of the previous email about the shirt size, increased the font to 300px, attached a photo of the LARGE tag that i removed from the shirt and blocked his email.\n\ni see a notification light on my spam folder later in the day, he's emailed back:  \n*\"I guess I grabbed the wrong shirt. So sorry.\"*\n\ni push DELETE FOREVER.",
    "title": "\"You said you work alone - I DON'T APPRECIATE BEING LIED TO!!\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1574275027,
    "score": 116,
    "keyword": "man artist"
  },
  {
    "text": "Update:I(22f) am jealous of my best friend (22f) and I think I just ruined our friendship So I posted this [https://www.reddit.com/r/TwoXChromosomes/comments/d578qx/i22f\\_am\\_jealous\\_of\\_my\\_best\\_friend\\_22f\\_and\\_i\\_think/](https://www.reddit.com/r/TwoXChromosomes/comments/d578qx/i22f_am_jealous_of_my_best_friend_22f_and_i_think/) the other day and I figured I would give an update because I talked to her.\n\n&#x200B;\n\nSo I got together with her this weekend for a girls night in. She knows I have been going through some stuff and she reached out to me. \n\n&#x200B;\n\nWe got together watched movies played video games ate pizza and stuff and we talked, and cried, and hugged. I told her about how I felt around her and she cried and hugged me and I cried too. She told me she never wanted me to feel that way and that I didn't have to look like her to be beautiful. She used to be a model and she said this is one of the reasons she stopped. She didn't like being the standard other women were expected to look like and she didn't like her image making other women feel bad about themselves. She said she hated that she was doing that to me. I told her it wasn't her fault at all. It was mine. We talked about the girl in high school she stood up for, she said she told her that her worth and value didn't come from the attention of men. She told her she wasn't flattered or empowered to top their list. She said she wanted me to know the same thing. My value doesn't come from the male gaze. \n\n&#x200B;\n\nWe talked a lot about what she loved about me. Since you guys made a point of me not complimenting myself in the last post I'll list some of the things she said. She said I was smart and funny and a talented artist, that I was insightful and caring. She reminded me I was the first friend she made when she moved to our state. Her mom had abandoned her and she was lonely and sad I was the first person to be nice to her and be her friend. I stood up for her when my friends didn't want to include her. She said shes never forgotten the kindness I showed her when she first moved here. She reminded me that in middle school she wasn't the prettiest girl either she hadn't yet grown into the drop dead gorgeous bombshell she is now. Sort of ugly duckling thing She grew into a beautiful swan so she remembers what its like to feel bad about yourself and she doesn't want me to feel that way. We talked about a lot. \n\n&#x200B;\n\nA few things that really stuck in my mind though, She said being pretty isn't always wonderful. Yes she acknowledges that there is a certain privilege that comes with it but theres another edge to the sword. She said she is never taken seriously She said being pretty is the only value people believe she has at first. She is always having to prove all the time she is more then a pretty face and hot body. For all the attention she gets from men she never knows when a man is actually interested in her or her body. She never knows if a man really likes her or just sees her as a hot chick to conquer. This is definitely not a problem I have...She also says that while it may seem great to have men interested all the time its not. She cant go to the gym or get a cup of coffee without getting approached by men that it gets tiresome and frustrating. I thought back to when she said she was never taken seriously and I started to cry when I realized even her best friend rolls her eyes and disregards her complaints about always being the center of unwanted attention. She also said I had things she wished she had like a good relationship with her mother...or just a decent human being for a mother. \n\n&#x200B;\n\nWe talked about a lot of stuff she wanted to know what she could do to help me when I was feeling this way, and to be honest with her about when I was feeling overshadowed or not as good and that she wanted to help build me up. She said if I wanted she would take me to the gym as her guest and she would work with me about getting into shape. She reminded me that she is an only child and I am her sister and she loved me.  \n\n&#x200B;\n\nMy best friend is a sweet kind hearted and loving woman. She suffered a lot through her childhood and I really didn't deserve her kindness after how I treated her. I love her to death.",
    "title": "Update:I(22f) am jealous of my best friend (22f) and I think I just ruined our friendship",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1569162324,
    "score": 38,
    "keyword": "man artist"
  },
  {
    "text": "Rant - a lady goes out to a bar For context I’m a single woman in my 40s, I work in the arts and I don’t have a problem going out and doing things on my own. I like hanging out with but I find if I wait for people to align their schedule with mine I might wait an indefinite amount of time so I just often go out on my own. It’s usually fun, I talk to strangers and generally have a grand old time.  \n\nI live near the suburbs, the places I like to hang out are downtown in the large Midwest city I live in. Quirky places where artists and musicians hang out, or gay bars that have a mixed clientele that I feel like I can relax in. I haven’t been going out very much lately due to work and sad life events (basically I haven’t wanted to). So I’m pushing myself to try new things and get out of this rut. \n\nThere are places near my house I could go to, but they aren’t my style. Sports bars mostly, with cover bands if there’s any live music at all. A while back I went with one of my guy friends to one of them and it seemed alright. Still sports-bar-ish but they were having karaoke there, and I do enjoy that so I went. \n\nAnd I faced a wee bit of culture shock\n\nThe places I like to go I for the most part get treated with respect. Every so often a guy may get a bit toey with drunk flirting but they’re usually easy to deflect. This place had prowlers I haven’t dealt with in an age. \n\nI sit on porch and immediately a young 20something who looked dirty and lacked general grooming comes and gives me an interrogation. What’s my name, where do I live, do I party, do I have a man, do I have kids, u so pretty... Jesus Christ in a bucket I just sat down. So remembered I have a fake husband and went inside to not use the bathroom. \n\nPar for the course I figure. I end up running into an old coworker and had fun for the most part, but the little things that I thought I was too old to have happen to me kept happening. Guys passing by me using just a LITTLE to much hand contact (nobody needs to touch the small of my back or graze my ass to move pass anybody).  Dudes off to the corner of my eyeliner staring at me in the hopes I would meet their eye and they can engage me. Being in a group of ladies I wasn’t approached again, and overall the space was fine with a good mix of people... except the fucking thirst. \n\nIt.... doesn’t have to be like this. I get that people come to bars to look for partners, but gaddamn! I’d be happy to talk to... well anybody if they didn’t lead with 20 questions to find out if I’m available and can offer them something they want, or act like they have the right to touch me or have my attention when I’m clearly busy talking to others. I don’t miss any of this crap, and as convenient as going there was, I don’t know if I want to come back. I go out to have fun, not to find dick... and if I want wanting dick I’d want that dick to be attached to a person who is looking for more than a human flesh light.   I‘ve been to many, I was out at an open mic last week and everyone was lovely. Another place was having an art walk and live music and also, lovely.  I spent last Sunday working on my computer all afternoon and hung out with random people talking about terrible movie franchises. It was great, got to connect and make some friends. \n\nI just want to meet people and not have my value sized up by what various pleasures I can offer them. Ok rant over.",
    "title": "Rant - a lady goes out to a bar",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1560027004,
    "score": 17,
    "keyword": "man artist"
  },
  {
    "text": "Brainwashed So I don’t know where I’m going with this or why I am doing this but I just need to get this out. \n\nBasically when I was around 13 years old I joined a website for artists and I would post pictures of myself. In different poses different outfits. I thought of myself as quite the photographer. \n\nClearly a 13-year-old girl posting very vain pictures of herself brought the attention of quite a fair amount of people. \n\nUnfortunately some of these people were out to feed some sort of fantasy. What I’m saying is that these were adult men going after a 13-year-old girl. \n\nThese men would talk to me and at first I thought they were just being friendly and nice because it would start off with just general chitchat. But then there just came a day or a point where that normal general chitchat turned unsavoury. \n\nNow with the first one we had been talking for so long... just normal conversation that when it turned unsavoury I kind of got a bit excited and I didn’t want to stop it. I’m not saying that I enjoyed it but just getting this attention from someone was an exciting thing. \n\nImagine being a 13-year-old girl and you’re going through changes in your life. You’re feeling quite insecure and there is this man telling you how beautiful and sexy you are. I was so lonely that I went along with it. \n\nSome of these people I thought were younger.. more my age.. and maybe they were but probably they weren’t. \n\nSo eventually sexual talk turned to either them requesting pictures or videos from me or them sending me pictures or videos. This went on for a whole two years. \n\nMeanwhile my family and my friends had absolutely no idea. I would shut myself in my room because I didn’t want them to find out. I even knew it was wrong but for some reason I felt like I couldn’t get out of it. \n\nI don’t know what happened. I just felt stuck in that situation and that I couldn’t get out of it. \n\nIt’s so silly looking back on it because now I see I could literally just block those people; stop talking to them. But I felt that I maybe owed them something - that I deserved it - or I justified that maybe it wasn’t as bad as I thought it might be. \n\nEssentially I was brainwashed by these people slowly over time. Brainwashed. And I know it was brainwashed because as soon as my parents found out and put a stop to it I was a completely different person. \n\nUnfortunately this two year period has shaped my personality. I can’t remember much of my general life in over those years. And I do have views about relationships and sex and all of that that maybe I wouldn’t have if I hadn’t been through this situation. \n\nThen just today I found some old videos from that time and it did something to my brain. Something that only has happened once before and that was when listening to music that I listened to and watching videos I watched around that time. It was truly a bizarre experience because I felt like I was back in that place. I felt so sad and all I wanted to do was run away and cry but I felt trapped.  \n\nI thought that I was out of that situation but clearly it still affects me and I didn’t even think that it would. But I’m still able to feel that way and regress back to that period of time and that’s why I know I was brainwashed; because something unlocked and my brain just changed today for a split second and it scared me. \n\nNow I’m trying to go to bed and I can’t even think about sleeping because it’s just freaked me out so much. \n\nAgain I don’t know why I am writing this, where I’m going to put it, who I’m going to send it to or if I’m going to do anything with it at all. But I just needed to say it because it was really has freaked me out and unsettled me.",
    "title": "Brainwashed",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1547423503,
    "score": 7,
    "keyword": "man artist"
  },
  {
    "text": "Is My Career Irreparably Damaged? Should I Give Up on this Profession? I am an accountant who has had a difficult life and did not graduate from college at a traditional age. I worked for many years managing a small store and doing physical labor in a not-so-ideal industry for a young lady. I left a semi-abusive living situation with an underachieving, substance abusing significant other to move back in with my abusive dad and dysfunctional family when I went back to school. It was not easy to deal with the environment of my childhood home again, and although my dad was delighted to have me back at first, the household soon reverted to its dysfunctional, abusive ways. I still worked part time and sometimes full time at the same job, save for my last semester at school. My family was pretty awful to me and made things difficult every step of the way. Despite this, I worked incredibly hard in school and flourished in my classes. I immersed myself in Accounting like it was a religion. I was determined to be successful, to finally be somebody who was deserving of respect and acknowledgment.\n\nI went to the meetings of professional organizations as a student, earned the ACFE scholarship and built my overall GPA (which had been tarnished when I’d dropped out of school the first time) back up to a respectable B+. My Accounting GPA was an A. Because I went to the local extension of a fairly well-known state school and worked much of my way through college, it was not adequately impressed upon me how important certain opportunities were and I was personally naïve and ignorant, coming from a working class background and living in an industrial, mostly working class area. I was older than the traditional students but younger than the older ones who had went back to college after their kids were bigger or grown. I wanted more than anything to work for Big 4 and considered not getting into Public career suicide and the end of my life. But I did not realize how important internships were and focused hard on having a perfect GPA. I was also ignorant how far in advance you had to apply to Big 4 firms or even regional firms to nail down a role upon graduation.\n\nThe summer I graduated was a disaster. My parents would threaten and scream at me all the time. I immersed myself in an eating disorder (dropping more weight despite already being quite thin) and passing the CPA exam – one of my last and most cherished dreams back then. Unfortunately, the summer ended with me being sexually assaulted at a house party in a scenario similar to the Brock Turner case. I made the naïve mistake of reporting the assault, and that’s when the bottom fell out. Everything they tell you about how awful sexual assault victims are treated is true, but I had no idea at the time. I thought receiving help for wrongs committed against you is just something that happens and that reporting a crime was the logical thing to do. I was forced to drive back to the city where the assault occurred by myself to report my story at the police station after I got home from the hospital and took a shower. The police officer was a young guy who literally smirked at me the entire time as I conveyed the events that occurred as best as I could. But since I remembered very little of what actually happened, it was difficult.\n\nStudying for and focusing on passing the CPA exam literally got me through my sexual assault. At the time, I passed every section except FAR, which was the one I was studying for when the assault actually occurred. I spent as little time as possible at my parents’ house, but if my dad woke up when I quietly tiptoed into the house late at night after hours of studying, he would pin me against a wall and scream in my face with unbridled rage. My mental state, which was already poor, deteriorated rapidly. My sister and her husband who had just moved overseas wired me some money and I opened a new bank account in my name only and transferred the small amount of money I already had into it and also applied for a credit card. They also found an old friend from school who was looking for a roommate and lived in the major city next to our hometown. I snuck most of my possessions out of my parents’ home while they were driving my younger brother back down to school and stayed at a friend’s house for a month until I could move to the city. My dad had already told me to get the eff out of his house and to make sure I took all my sh\\*t with me because I was not welcome back.\n\nThe day I moved there was a major blizzard. It was just me and my Budget rent-a-van. I had to go back to my dad’s house to get some of the items I’d left behind. He would not let me take my bed, mattress or any dressers. I slept on a cheap, uncomfortable futon and lived out of plastic storage tubs for years after moving to the city. He helped me carry heavier things out, but screamed at me and called me a b\\*tch and a c\\*nt while doing it. All I can say is the move was incredibly difficult, downright harrowing actually. I unloaded the entire the van by myself, carrying loads of boxes and heavy items up three flights of stairs. I got back on the road and exited a major thoroughfare shortly before it was blocked off and cars were stranded on it, frozen to the road overnight. Looking back, I was incredibly lucky, but it was not over yet. I managed to get the emptied van back to the rental facility in the suburbs, but there was fishtailing and white knuckles the whole way, as I prayed I wouldn’t lose control of the vehicle. My car was buried in a snow bank and the tow truck that responded was manned by an inexperienced teen who ended up bending my front tire rod. I was towed to and stayed at a nearby hotel that did not offer me a discount or pity of any kind. It was expensive, and I had to put all this on my new credit card. I shivered in my hotel room wrapped in a towel, sweaty and wet clothes drying on the shower curtain rod (spoiler alert: they were not dry the next day). I had a phone interview with a regional accounting firm the next morning but it probably didn’t go well, considering the circumstances. Then I drove back to the city on a sheet of ice, and my car kept pulling to one side due to the bent tire rod I was unaware of at the time. Other cars were speeding like nothing had happened, riding my bumper and putting me in danger. It was a miracle I didn’t lose control of the car and made it home safely.\n\nI was so shell-shocked after my ordeal that I did not leave my new room for two weeks. I desperately tried to apply and interview for retail jobs in fancy shopping malls downtown, just as a means to survive. The interviews didn’t go too well, since I felt like a cardboard cutout trying to convey human enthusiasm and emotion. I had other accounting interviews I had applied for before the move but did not get the roles due to lack of experience or probably interview skills. I was eventually contacted by a major accounting temp agency but was only offered semi-clerical, data entry AP stuff that was disguised as an accounting role. The headhunters made it seem like this is how everyone started out and that I was lucky for the $10/hr no-benefits temp roles they were offering. The rep would talk like the guy in the Micro Machines commercials when describing the assignment and on the spot ask me if I accepted without divulging the name of the company until I had done so. When I left one assignment because I was offered a somewhat more career relevant role at a more promising company, the rep berated me over the phone before hanging up on me. I was just a scared young lady alone in a large city with broken dreams and the aftermath of a sexual assault still hanging over her head. Having been in the industry for years now, I definitely know this was NOT how most successful accountants start their careers and avoid working with temp agencies at all costs. I actually despise headhunters and consider them the lowest form of humanity. I was barely living hand to mouth, making less than when I was uneducated and managing the small store that was in an area with a much lower cost of living. I’d also surprisingly had health and vision insurance back then but now had none. I felt powerless, trapped and used but had few options at this point in my career.\n\nI worked hard and climbed the ladder from the absolute bottom and made it despite all odds. There were lots of struggles and compromises along the way, including a layoff I had to bounce back from as well as unfair treatment by more fortunate but immature and petty peers (early in my career, I worked at a major start up in my city filled with mostly young people).\n\nI made a bad career move at the beginning of this year and had to quit for my health and sanity after only 90 days. It was a major company, and I thought the role would be an interesting change of pace. I soon discovered the department was understaffed and known for high turnover. A manager was brought in around the same time that I started who was there to push deadlines that had not been made in the past due to inadequate staffing. He acted like he was a nice guy who was interested in our goals and career, but he was also controlling and manipulative, pushing us hard to meet the deadlines no matter what. People were frequently sick and extremely stressed out, but many of them could not quit because it was their first job out of school. I’m not old but I’m no spring chicken and could not hang in that type of sweatshop environment with some guy pacing the cubicle aisles and tapping me on my shoulder to constantly ask my status.\n\nI am having an incredibly difficult time bouncing back. I’m trying to make the jump to and have a last salary that’s around Senior level. I’ve been told my resume and background is impressive by both colleagues and recruiters and know I’m an excellent interviewer, as I’ve been told so on multiple occasions and have worked hard to develop that skill. I am getting responses from quality, major companies but only make it through the phone screen. Oftentimes the recruiter says my background is impressive and he’ll keep me in mind for future opportunities. But I’m only getting in-person interviews at lackluster companies where I would not want to work (the toxic vibes and messy processes come through during the interview). I’m talking to a major company for a decent contract role right now and just quit a menial but well paid contract role at an extremely dysfunctional company. I’m worried I’m going to be relegated to contract roles or permanent roles at crappy, inefficient companies from now on due to this one misstep. I already had the layoff that I repeatedly have to explain on interviews and now this.\n\nI guess I’m tired of the perfectionism that’s expected in Accounting, not just while in a role but even when it comes to your career history. I feel like not having Big 4 or regional experience is a permanent strike against you and you are always going to be looked over or have to fight extra hard for roles that those with that experience get much more easily. So many doors open for you if you have Big 4 and it seems elitist and incredibly unfair. And If I’m truly honest with myself, I find Accounting dry and unsatisfying and working in an office stifling for similar reasons as these posts: [https://www.reddit.com/r/Accounting/comments/9ybn40/anyone\\_else\\_depressedfeel\\_out\\_of\\_placenot\\_sure\\_if/](https://www.reddit.com/r/Accounting/comments/9ybn40/anyone_else_depressedfeel_out_of_placenot_sure_if/) and [https://www.reddit.com/r/Accounting/comments/7k4wy3/is\\_my\\_accounting\\_job\\_causing\\_depression\\_or\\_am\\_i/](https://www.reddit.com/r/Accounting/comments/7k4wy3/is_my_accounting_job_causing_depression_or_am_i/)\n\nI feel trapped and anxious sitting at a desk all day and sometimes even miss slinging cases of beer for a living (but not the customers, haha). If I don’t keep a strict exercise routine to maintain core strength, my body is a mess of knots and tightness and I get debilitating tension headaches. One masseuse said I had the worst shoulder knots she’d ever seen. I also don’t relate that well to others in my field. When we took a team lunch minus our manager, one of my peers said I looked like an artist and everyone else immediately chimed in in agreement. Actual artist friends said they were surprised I’m an accountant and give off artist vibes. When we took a personality test at my last job, I got Rockstar personality with Innovation and Emotion as my top strengths and Prestige as my weakness. Most others had Prestige as their dominant trait and Emotion as their weakness. It appears to me that I’m much more affected by the stress, intense pressure and deadlines while others seem much less reactive and emotional. Oftentimes I feel like an emotion spewing volcano about to explode and an eccentric, counterculture weirdo surrounded by fairly unemotional straight laced types following traditional life and career paths. It’s like my abusive dad is in my head yelling at me that I’m a headcase (too emotional and depressive) and will never amount to anything. I’m getting closer to 40 and am blessed to have no student loan debt. I really don’t want to set out on a new career path at my age. So here I am continuing to hammer my neon colored, round peg self into that square corporate hole. I am well liked by my peers and love telling zany stories and jokes to entertain and make them laugh. People typically like me and I have allies down to the maintenance and janitorial staff. But I often catch the ire of no-nonsense, overly intense higher ups.\n\nMaybe there is room for offbeat types in Accounting. I keep telling myself that. But it can feel isolating at times and I am so tired of the song and dance of interviewing and having to explain career holes and missteps over and over. I’m praying I land something before I run out of money, which is going to happen in the next month or so. My retirement fund and savings have already been gutted. I desperately need health insurance and a permanent role at company that is not crazy or an environment that is not borderline sweatshop. Any advice or solidarity would be welcome. Thanks to anyone who got through reading this novella of a post.\n\nPS - I did retake and pass FAR shortly after moving to the city and obtained my CPA!",
    "title": "Is My Career Irreparably Damaged? Should I Give Up on this Profession?",
    "subreddit": "Accounting",
    "timestamp": 1570746097,
    "score": 2,
    "keyword": "man artist"
  },
  {
    "text": "We got name checked by a journalist describing Boris Johnson's latest speech For those of you who don't know, Boris Johnson is the Prime Minister in the UK, and things aren't going very well for him. Most recently he gave a speech in front of a large group of Police Cadets who were graduating, and basically slurred the entire way through his half forgotten speech, before one of them nearly feinted, to which he sort of shrugged and carried on.\n\nThis is all important context, not because I want to discuss politics. Oh no, I want to discuss the way the journalist writing an opinion about it piece name checked us as professionals.\n\n> Despite practising since boyhood, Boris Johnson’s entire demeanour is that of a man who has won a competition to lead the country for a day. He is Mike Bassett: England Prime Minister, yet wheels out jokes he’s done 437 times before as though he’s Frank Sinatra and reckons the crowd can’t wait to see him do My Way again. Johnson must be the only performer whose audience spends his gigs screaming: PLEASE, DO YOUR NEW STUFF.\n\nHmm ok.\n\n> Physically, he seems in a remarkable state. Apart from looking like he cuts his hair with the bacon scissors, the PM’s shtick is bizarre and juddering, as though some of his innards are trying to escape. Perhaps they have found the tension between the bodily functions they are required to provide and the national interest unresolvable.\n\nThat's very vivid and gross.\n\n> Oratorically, his PMQs debut merits a mere five-word review: “Welcome to the Commons, bitch.” As a dispatch box artiste, Johnson has all the accomplishment of one of those pisshead chancers who go house to house at 10pm in December and “carol sing” for pub money. His delivery was that of a man finding out in real time that material which slayed at the accountancy corporate he did in 2007 is less well received...\n\nOK where's he going with this? Accountants are boring and will laugh at any old shit?\n\n>... by those who haven’t drunk themselves to within an hour of renal failure.\n\nAh no, he's just been to one of our work parties before.\n\n(For anyone wanting to read the article it's here:  [https://www.theguardian.com/commentisfree/2019/sep/06/boris-johnson-twilight-zone-police-escort-conservatives](https://www.theguardian.com/commentisfree/2019/sep/06/boris-johnson-twilight-zone-police-escort-conservatives))",
    "title": "We got name checked by a journalist describing Boris Johnson's latest speech",
    "subreddit": "Accounting",
    "timestamp": 1567796366,
    "score": 0,
    "keyword": "man artist"
  },
  {
    "text": "Why did so many black celebrities go to see slave play? So I never heard about this play the first time it opened. But I saw a post about it on Jake Gyllenhaal's Instagram and the name made me look it up.\n\nA play about slave/master roleplay for modern interracial couples. From one review I read there's a scene in which the black woman raped and thanks her white master.\n\nThe creator is a gay black man who clearly has a white fetish as he has written about it in the past. His first play was about a young black artist in a relationship with an old white art collector.\n\nI was gonna cancel Gyllenhaal for producing this. But then I realised how many black celebrities went and praised this play? Zendaya, Rihanna, Tessa Thompson, Zazzie Beets, Whoopi Goldberg, Janelle Monae, Regina King. I dont want to assume they would support something so bad. So am I miss interpretating it? Anyone here seen it?",
    "title": "Why did so many black celebrities go to see slave play?",
    "subreddit": "blackladies",
    "timestamp": 1570670183,
    "score": 36,
    "keyword": "man artist"
  },
  {
    "text": "Anyone else stop watching Bollywood films because of Anti Blackness? Anyone else stop watching Bollywood films because of Anti Blackness?\n\nI am half black and half white and grew up watching Bollywood (Indian) movies thanks to being introduced by an Indian neighbor. I fell in love with the romance, the fashion, music, dancing and the storylines. I wanted to move to India and marry an Indian man. Also sometimes people thought I was part Indian which made me feel\nEven more connected.\n\nAs I got older, however, I started to realize how colorist and anti-black the Indian Culture was. In the movies, I started noticing how most of the women had pale skin and sometimes there would be comments like “at least your wife is not dark.” I realized that I was supporting a movie industry that discriminated against people with my skin color (light brown/ caramel) and race and I was not okay with that so I distanced myself away from watching the movies. I also had some prejudice experiences where some Indian people would give me dirty looks when I was out with an Indian man. I realized that I was experiencing more prejudice from the Indian community for dating an Indian guy than I normally did from the white community when I was with a white guy. I remember in middle school, this Indian guy and I really liked each other and then one day he started giving me the cold shoulder. Who knows why? In my mind, though, I wonder if his family told him to stop talking to me because I was part black.. \n\nI have a white friend who is obsessed with Bollywood movies and told me she wants move to India because she felt so welcomed there. I felt some resentment and envy because i know a big part of her feeling welcomed has to do with her white privilege and the fact that Indian culture worship white skin. If I went to India, I doubt I would feel as welcomed as her. She may even have a chance at being a dancer in a Bollywood movie——something I dreamed of happening when I was young but soon realized the unlikelihood of that happening. If they don’t embrace their own dark Indian people, how would they embrace a part black woman?\n\nI struggle also because a part of me really wants to start watching Bollywood movies again as they are so artistic and incredible.. but then it doesn’t feel right because of their anti blackness.\n\nYeah.. wanted to get out of my feelings of hurt, rejection, and resentment I have from what I learned of Bollywood and Indian culture. I’m wondering if anyone else relates?",
    "title": "Anyone else stop watching Bollywood films because of Anti Blackness?",
    "subreddit": "blackladies",
    "timestamp": 1555753205,
    "score": 22,
    "keyword": "man artist"
  },
  {
    "text": "Figure Drawing So as an artist I enjoy going to figure drawing sessions where I get to drawn the human figure from a live model. I've been good to these type of sessions since I was sixteen. It usually for adults but they allow mature high school juniors and seniors as along as you're at least sixteen or older.  \n\nAnyway I still go as adult and I'll usually go when I'm off from work and have the money and time. Sessions are about 8-10 dollars and you bring your own supplies and you can draw or paint from the figure for about three hours.\n\nLately the sessions I've been going to have been having a lot of black female models. THANK GOD. My drawings have been more lively and vivid. For the longest time a lot of the models have been stick figure skinny white women and it annoys me.\n\nI don't mind sometimes but switch it up a little. More black female models or other women of color. Or hell some male models would be nice too those are also rare. And I mean young male models because anytime there is a man model he is usually old.\n\nI actually packed up and left early from a session because I just wasn't feeling the model and my drawings sucked. Granted not every day is a good drawing day but I fell like that's what it was.\n\nI'm at a point now where I'm just going to wait and see who the model is before I set up. If I'm not feeling the model I'm leaving and that's no disrespect to the model personally I'm just tired of drawing the same type of white woman.\n\n It made me think of what Toni Morrison said when she was asked once about how come she only writes about black people and when was she going to write about white people. Like damn. I just want to see different people model or at least models that have my likeness.",
    "title": "Figure Drawing",
    "subreddit": "blackladies",
    "timestamp": 1574017133,
    "score": 18,
    "keyword": "man artist"
  },
  {
    "text": "A short appreciation of an ordinary television series My partner and I just watched the third episode of season one of [*Shadow*](https://www.netflix.com/nl-en/title/81033727), the first Netflix Original produced in and by South Africans.\n\nMy partner likes it a **lot** more than I do. Because my partner really likes stories with uncomplicated good guys and moustache-twirlingly villainous bad guys.^1\n\nBut I do like the show, for a, perhaps, unexpected reason.\n\nBecause, as a show, it’s a pretty ordinary example of its type.\n\nThe good guy is a stereotypical ‘down these mean streets a man must walk who is not, himself, mean or afraid’ good guy. His side-kick is a stereotypical ‘voice of the system/reluctant but always loyal’ helper.\n\nOur good guy’s sister (complete with wheelchair and back-story that makes her not-working legs both an accident and something our hero can feel responsible for) and the sister’s friend and flatmate (complete with an unhappy back-story and the requisite mix of serious aspirations to being a doctor and serious poverty forcing her into lap-dancing to make ends meet along the way) round out the troupe of stereotypes or archetypes.\n\nThe writing is competent but not great. The production values are first rate. And seeing an urban landscape that I don’t know (Johannesburg) is a fun mix of the familiar and unfamiliar.\n\nBut I like *Shadow* because this troupe of archetypes, and pretty much all the guest stars — all the noble victims and all the villainous bad guys — are black.\n\nAnd **none** of them are *being* black. They are just being. They are being poor. And rich. And (nobly) good. And (over the top) bad. And they are being news-readers, and doctors, and students, and medical researchers, and layout artists, and career-weary police chiefs. And even the occasional white character is just being. They aren’t performatively White the way so many black characters in US film and television are performatively Black.\n\nBack in August 2018, one of my favourite writers — N K Jemisin — wrote a [twitter thread](https://twitter.com/nkjemisin/status/1024347776551936000) about what commercial entertainment is and is not made. Her core point was that we have not yet arrived. And we’ll know when we have. We’ll have arrived:\n\n> When you start seeing so many Native American fantasies that even\n> the so-so ones sell like gangbusters. Mediocre fantasies set in the\n> Malian Empire — more than one — on the NYT lists. Mediocre epics\n> from indigenous Australian traditions — more than one — getting HBO\n> series.\n\nOn its own, *Shadow* is not evidence enough that ‘We’ve Arrived’. But a perfectly competent but otherwise unremarkable genre TV show in which Black people are every unremarkable cliché such unremarkable genre TV shows are typically populated with is a start.\n\n&nbsp;\n\n&nbsp;\n\n1. In a previous career, my partner spent a long time working in the grey and complicated margins of society. They’ve had more than their fill of moral ambiguity and ethical quandaries in real life. They’ve come to very much prefer simpler and cleaner and brighter and sharper moral issues in their downtime entertainment.",
    "title": "A short appreciation of an ordinary television series",
    "subreddit": "blackladies",
    "timestamp": 1552390968,
    "score": 8,
    "keyword": "man artist"
  },
  {
    "text": "If this isn't the poster for increasing the penalty for false rape claims, Serial liar and scam artist who rape accusation put a man in prison for nearly 10 years expected to be released after serving only 5 years.",
    "title": "If this isn't the poster for increasing the penalty for false rape claims, Serial liar and scam artist who rape accusation put a man in prison for nearly 10 years expected to be released after serving only 5 years.",
    "subreddit": "MensRights",
    "timestamp": 1566528329,
    "score": 37,
    "keyword": "man artist"
  },
  {
    "text": "[Meta] Strangely, the Gillette ad may be +ve for Mens Rights Looking at the fuss around this ad; there's a LOT of negative publicity, a LOT of 'normies' getting outraged.\n\nI'm not just talking about the Piers Morgan types, the Colonel Buffton-Tufftons, the 'outraged from Tumbridge Wells'. There seem to be a lot of negative coverage about the ad.\n\nSure, a lot of it has a 'whiny man-babies' tone, but a lot seems to be sympathetic to MRA talking points.\n\nOf course, WE are still misogynistic MGTOW pick-up artist incel wife beaters et etc ... *cont p. 94*",
    "title": "[Meta] Strangely, the Gillette ad may be +ve for Mens Rights",
    "subreddit": "MensRights",
    "timestamp": 1547597859,
    "score": 25,
    "keyword": "man artist"
  },
  {
    "text": "Men's Rights glossary MRA. MRM. Incel. PUA. Red Pill. Femcel. There’s all sorts of weird words and groups and it can be really confusing when you get here. This is to help explain what’s up with all these groups and explain some of the common terminology and groups. With this you can untangle the acronym spaghetti. \n\nThe first term to know about is the manosphere. Lots of men have gotten online and forged communities of shared interest and a lot of them are forged around male interests. Women may well have a place in these communities but men tend to drive the narrative. [This](https://ibb.co/dJh60Jx) is a diagram noting some of the common famous ones.\n\nThe media likes to conflate a lot of these, but a lot of them don’t really like each other much. This is to help you understand what they are, and who is friends with who. The above graph notes some of the main male dominated group, notes who is friendly with who, and says what they want from their movement. \n\nA lot of these groups are what’s called feminist or anti feminist. Feminists are a group of people who want to help women be better off in society. Anti feminists believe that feminists as a group are hurting men and women and should be opposed, although they may be fine with many individual feminists. \n\nLets go through the groups one by one.\n\n**MRAs**\n\nThese are people who want to stand up for the rights of men and make a better world. We generally can get laid, unlike other groups, and often have had serious problems because of our skills at getting laid. Divorced men and men seeking custody of their kids are major members. Other major groups include men seeking to protect boys from unwanted circumcision, men seeking prison reform, and mothers and fathers seeking educational reform, and children seeking relief from harsh teachers and bureaucracies. \n\nWe believe in better relationships with women and them showing proper respect by not beating us up or insulting us. The legal systems can be very harsh on a man who is attacked by a woman and the courts often take men’s children away. We are anti feminist generally because feminists have made laws that hurt us like the duluth model which says men are always violent and is the main domestic violence model in the USA.\n\nWe are mostly male, but with some prominent women among us, and tend to lean egalitarian and liberal with a substantial wing of conservatives.\n\nWe are friendly with MGTOW who just want to be left alone, and traditional conservatives who we respect for seeking a good model of society. We have regular issues with incels (people who can’t get laid) but are sympathetic to them, dislike male feminists, and sometimes respect PUA (people learning the art of seduction) and sometimes get annoyed by them. We dislike white nationalists, and sometimes are friendly with gamergate people and alt right people.\n\nKey terminology.\n\nThe Red Pill. This refers to the idea of gaining greater awareness of the shitty situation of men. Popularized by avoiceformen and Cassie Jaye and her film The Red Pill. \n\nNAFALT. Not all feminists are like that. This may be quoted at people who say that not all feminists are bad. Since the mainstream institutions are making laws that hurt men we have issues with them.\n\nMGM. Male genitalia mutilation. An emotive term for circumcision that compares it to female genital mutilation. \n\nIntactivists. A group of activists against male circumcision.\n\nMRM. Men’s rights movement. The general term for all of us. \n\nAVFM. Avoiceformen, a very popular men’s rights website.\n\nToxic Masculinity. A widely hated term that feminists tend to use on men, generally seen as hostile use of stereotypes to control men. \n\nPatriarchy. The idea that men rule society. MRAs generally believe that a small minority of men and women at the top rule society, politicians and business tycoons, and that both men and women have varying degrees of power. In the modern world feminists and women often rule the world. Feminists tend to believe all men are dominant in society.\n\nApex fallacy. A popular idea that feminists assume all men have the power and privilege of kings and presidents.\n\nMen Going Their Own Way\n\nThese are men who have gotten tired of living in a hard world where interaction is dangerous and mostly avoid interacting with women. They’re generally friendly with the MRM and there’s a lot of overlap with us. They want to be treated better and with respect, but don’t especially want much else from women. They generally don’t like feminists much.\n\n**Tradcons**\n\nChristian, Islamic, other traditions which want a return to traditional male values and a stable family. They often want women to be submissive and respectful, to regularly have sex with them, and to remain faithful and honest. While MRAs don’t generally believe in traditional values like that and don’t believe in forcing such on people we often make strong and good friendships with those who just want to marry a cute woman and stay at home. Many of the female MRAs value this lifestyle because lots of people like staying at home and being pampered. \n\nDalrock is a famous blog example of this. \n\nTradcons are generally friendly with us, though they have a fair number of fights with male feminists and pua. Often they try to use pick up artist skills to better please their wife, and pick up artists are unhappy with this. \n\n**Incels**\n\nInvoluntarily celibrate people. These are people who, normally due to unattractiveness or poor social skills have trouble getting with women. In the modern world there’s a strong tradition to shame men who are less attractive who approach women which makes it very hard for these men to find partners. They generally want good relationships and to get laid with women, but due to hard experiences are often doubtful of respect. \n\nA small number of them have been violent. Being in a very shitty situation tends to radicalize them. MRAs generally don’t like them much, even if they are sympathetic. It would be better for many incels if they could join a supportive and less sexist group, and bullying them is bad. Lumping them in with MRAs is unhelpful. Since they’re often depressed they tend to have fights with everyone. \n\nKey Terminology.\n\nFemcel. Female incel.\n\nBlack pill. A sad idea that the world is shitty and terrible. \n\nOmega. A term for a male at the bottom of society, aka incels.\n\nChad and Stacey. A term for sexy males and women at the top of society. \n\n**Pick Up Artist**\n\nMost famously, the red pill community. People who seek to build their sexiness so they can get laid. There are feminist pick up artists and variants, but the most famous sort is rather sexist and rather committed to lifting, sleeping with lots of women, and always being confident. They don’t care about relationships with women as much and expect respect only when they prove their value to women.\n\nThey don’t care about the general respect of women, and want to build up their sexiness so they can get laid more. They get fit and sexy and be confident and women will like them more, ideally. They’re pretty sexist and commonly call women sluts.\n\nLots of MRAs, Trad Cons, and Incels like some of their ideas, but their sexism and roughness makes long term friendships tricky. We like being sexier, but don’t want to be with lots of women.\n\nHeartiste is a major blog of theirs, as was Roosh. \n\nKey Terminology.\n\nCuckold. Someone who gains pleasure from other men having sex with their partner. A common insult.\n\nBull. The dude, often black, who has sex with the cuckold’s partner. \n\nAlpha and Beta. The idea that some males are dominant in society and get to fuck women and some men are less dominant and get to comfort them. Alpha fucks, and beta bucks. \n\nHypergamy. The idea that women don’t form strong relationships with men, but always look to upgrade. \n\nFrame. Be confident and you can get laid. Superior frame gets you laid. Have more masculine energy than women.\n\nShit tests. Tests women give to men which are hurtful so they can prove their worth.\n\nSpinning plates. Flirt with multiple women so you can get laid more. \n\nSexual market value. The idea that each person has a fairly fixed sexiness to others they should work on improving.\n\nFDS. A rival female seduction group seeking to gain success in female resource. Female Dating Strategies.\n\n**White nationalists**\n\nA small group of people who could probably all fit in a single hotel. They hate people of other races and are loud and violent. Their circles never really intersect with MRA circles. They’re assholes, no one likes nazis much.\n\n**Gamergate**\n\nThe gaming industry has lots of feminists in it and some have picked fights with gamers. Occasionally their issues cross paths with ours, but there’s no formal affiliation. \n\n**Alt Right/ Trumpets**\n\nPeople who believe that the alt right is the best and want Trump to rule America forever. There are some right wing MRAs, but more are left wing. Our main complication is that feminists are left wing, so we can never get anything done siding with left wing people.\n\nRegardless, while they sometimes intersect we’re not formal allies. \n\n**Menslib/ male feminists**\n\nA group of male feminists who believe that they can be better people by following feminist ideology. Since feminists don’t like men much this leads to much frustration for them. They generally let feminist ideology rule their lives and talk a lot about how to improve their mental health through it.\n\nThey can’t ask for respect since they need to accept feminist criticisms, such as being called people \"who are trash inside” \"dirtbags who are barely able to function\" or constantly being seen as a threat of rape murder and violence, they can’t ask for sex since that would be misogynistic, so they hope that by constantly working to be patient, non-threatening, they can slowly change the just negative conceptions feminists have about men by doing things like teaching three year olds to not sexually harass women. \n\nThey generally hate incels and autistic people since socially awkward men annoy feminists, hate PUA because those people want sex from women, hate MRA for wanting men to get respect, hate trad cons for many reasons, and generally dislike pretty much everyone else in the manosphere. \n\nKey Terminology\n\nPatriarchy. Toxic cultural ideas of masculinity that harm men and women, leading to men being unhealthy, repressing their feelings, and hurting women.\n\nThe Blue Pill. Rejecting the red pill, following feminist ideology.\n\nToxic Masculinity. A idea about how men’s refusal to share their emotions and aggression and violence leads to social problems.\n\nThat's my summary for new people, hope it helps people. If you see any common terminology missing or have any suggestions for better helping newcomers to the MRA movement, do say. Thanks for reading.",
    "title": "Men's Rights glossary",
    "subreddit": "MensRights",
    "timestamp": 1575689393,
    "score": 18,
    "keyword": "man artist"
  },
  {
    "text": "Where feminism took a path to being openly hostile to men's issues. It harms women too. *I answered this in response to someone who had encountered immediate shunning and rejection of any dialog when attempting to broach men's issues and the MRM in feminist communities.*\n\n...We want to help anyone that has issues, including men's or women's or anything in between.\n\nFeminism has become a powerful ideology. Before 1970 you could not get a job for simply being a feminist. Then, Erin Pizzey (nominally a feminist at the time but just wanted to help all domestic abuse victims, and knew men and women alike could be abusive) opened the first domestic violence shelter for women, and soon it became the heart of the feminist movement - it had the funds, the way to get those funds, and the ideology that drove the cause to get more. The people attracted to the cause were radical Marxist (lesbianic) feminists that soon took over the movement. Erin's own words - ([https://www.youtube.com/watch?v=irVB8b0zhQI](https://www.youtube.com/watch?v=irVB8b0zhQI)). These were often women who had themselves witnessed/been involved in violent relationships with men, that were to make the personal political. Lesbian domestic abuse remains an issue swept under the carpet. Subsequently, with the founding of refuge organisations, you could get money and have a career as a feminist - for a good cause, though it was immediately apparent that they could get more money by denying help and recognition to men - and found the more radical the message, and the more they distorted the truth, the more money and power they got, again for a good cause, but also crucially their own gain. Eventually, as Erin tried to get help to men too, and made an observation that about 60% of the women in her shelter were at least as physically abusive as the men they left, and that men needed shelters too, she was ostracised as a heretic, sent death threats, and left the country. She was also met with a deafening silence when attempting to raise funds for abused men (presumably because society expected them to be able to \"look after/fight for themselves\", or that they had failed to be a man and failed to look after even himself - just a homeless man). You could argue feminism wasn't the cause at this point for the lack of funding to men's shelters, but it was seized upon as an opportunity, instead of being addressed. For feminism it was the starting point for creating politically and financially motivated activism in universities, laundering it as verified \"knowledge\", and using it to fund further places in universities and careers in support organisations. ([https://en.wikipedia.org/wiki/Grievance\\_Studies\\_affair](https://en.wikipedia.org/wiki/Grievance_Studies_affair)). As an aside, the feminist support establishment is still financially motivated to keep it *generational*, as they lie about the degree to which it is *gendered*, to allow abusive women to continue to abuse their husbands and their children, some of whom become the abusive males of tomorrow that can \"prove them correct\" and they can treat, but only if they happen to become aggressive later in life, and some of whom become the abusive females they will cover for and produce the next generation of abusers. Feminism harms women too. They actually need it to stay generational, and egregiously try to keep it that way. Victim blaming, a common part of domestic abuse, has become par for the course, even from those that treat it.\n\nHere is the evidence of the distortion this lead to in academic research on the subject of domestic abuse from the 1970s - it's long, but the summary tells you most of what you need to know. Murray Straus was a \"true\" feminist by the way, like Erin Pizzey, and just wanted to help women and men where they needed it.\n\n[https://www.researchgate.net/publication/233717660\\_Thirty\\_Years\\_of\\_Denying\\_the\\_Evidence\\_on\\_Gender\\_Symmetry\\_in\\_Partner\\_Violence\\_Implications\\_for\\_Prevention\\_and\\_Treatment](https://www.researchgate.net/publication/233717660_Thirty_Years_of_Denying_the_Evidence_on_Gender_Symmetry_in_Partner_Violence_Implications_for_Prevention_and_Treatment)\n\nMy mother, who was an active feminist in the 1960s and 70s is frankly disgusted as to what it has become. Originally it was for women, because women needed help to reach equality. Most feminists would have no problem recognising men's issues in those days - it was about getting support and recognition where women needed it, and was welcome of any help to men or anyone else when they needed it - before the most radical became the most funded, taking over the movement from a corrupt new centre.\n\nIntersectional feminism has continued this radical ideology, and taken on truly religious characteristics.\n\n[https://www.youtube.com/watch?v=6QbTRiiZmPo](https://www.youtube.com/watch?v=6QbTRiiZmPo)\n\nFeminists like Christina Hoff Summers, Cathy Young, and my own mother would have a massive battle to rescue the term \"feminism\" and the movement. The radical has become the mainstream from the day they were paid to become activists, and now created a multi billion $/£ women's support establishment, where they fight tooth and nail for every penny of this massive amount of funding. In the 50's and 60's their opposition came from actual \"sexist, racist, anti-gay\" mostly christian conservatives, and because it's now politically convenient, that's what they have learned to say any opposition to any part of feminism in is, despite 2018 being a world away from the 1950's, but this stays the model that they are \"fighting against\". Much of the funding goes to genuinely good causes (e.g. helping victims of abuse etc), but the behaviour of the activists controlling these organisations, lobbying for funds, and printing the \"research\" that supports them in universities has become fundamentally corrupt, and they cover this up with censorship, and make any opinion not sanctioned by them taboo. They're radical because they *feel* it's their *careers* on the line. And so they feel they cannot tolerate any person who doesn't share their political goals having control of what they feel is a narrative-space that only they should control. And so the men e.g. committing suicide, homeless, falsely accused, given no rights to see the children they are paying for, men failed in our education system, men treated as banks (despite being the ones catered to the worst in education) etc.. get nothing, and no politician dare take on this powerful lobby - until out of frustration we get someone like Trump. Feminism harms women too. It's a corruption that's reached the heart of our education systems, media, and government. Now, I dislike Trump as much as any other politician, but he was the only person to stand up to the censorship happening across society. Brexit too was, for some, a move away from an EU that is even more controlled by the feminist lobby than the British government. Freedom of expression to express the truth is all we want, so that the truth can be heard and recognised. If that means women getting the most support where they should get the most - because they need the most - that's great. If that means men getting any support where they need any that would be nice too.\n\nThe uncomfortable fact is that they deny any part of this distortion since the 60s, as heresy. Instead of coming clean with this past and present, which both got help to women in need, and likely had an affect on male homelessness and suicide, they still victim blame men who come forward when denied help as \"abusers in hiding\", offer genuinely abused males \"treatment for aggression\" only in most cases, and play the same zero sum game they have since the 60s, that any money to begin helping men in need is money that should by right go further toward women's issues. All while asserting from their powerful lobby that the \"MRM is just playing a zero-sum game\". Or that it's a \"backlash against women's progress\". No-one wants to stop funding women's issues. Every legitimate organisation (except increasingly feminists) acts for equality. No-one tries to hide male abusers (other than the abusers themselves) fortunately, though they assert this is all the MRM is attempting to do despite no evidence, and evidence to the contrary. It is not remotely what the MRM about. The MRM does not allow the personal to become political, it banishes any genuine misogyny, and has the scrutiny of the world's media and tech companies ready to report and exaggerate even tenuous transgressions. Every political organisation needs honest scrutiny. There is however evidence that female abusers are being hidden. E.g. it is routinely practised within feminist domestic abuse organisations, while they have made it heresy to even talk about it, or have it honestly reported on without masses of feminist harassment. (E.g. Cassie Jaye's *The Red Pill*). Any and all scrutiny of feminism is immediately treated as taboo in comparison. Not wanting to rock the boat or lack of scrutiny and can facilitate the even the most horrific ideas into reality.\n\nThe closest feminism has come in recent years to addressing men's issues, is to allow men to \"join in the cause of feminism\" through becoming a \"he for she\". Or claim that \"toxic masculinity\" is what needs to be addressed first and foremost to help the \"crisis of men and boy's\" that they've conveniently renamed the \"crisis of masculinity\", as \"masculinity\" is the only male concept that exists in feminist dogma, other than when some men are bad. \"Toxic femininity\" remains universally taboo or a non-entity this dogma. We are left with a powerful dogmatic feminist movement that stamps out any recognition of men's issues because of the few dedicated, talented, eccentric, lucky men who earn the most in society (for themselves, their families, and all of of society), while forgetting about and consigning an increasingly large number of men, left behind in education, healthcare, housing, workplace danger, and life/family choices to ever more bleak lives with no recognition or support, except through a vilified and outcast MRM that gets routinely conflated with unrelated, convenient scapegoats. Scapegoats in form of e.g. \"radical incel\" or \"pickup artist\" groups, that grow ever more numerous in part *because* the legitimacy of men's issues and the legitimate MRM is given no credibility, else the feminist establishment be open to valid criticism. Again, this is ideal for the feminist establishment, who benefit from a polarised society, that can't criticise them, with numerous illegitimate outlets for disaffected men. Feminism harms women too.\n\nBut in a direct answer to your question, I think it's the religious characteristic of feminism that explains what you've encountered. Men are sinful, we have the original sin of being a male, and we are bringing up the taboo of occasions where men need help, and sometimes where some women are at fault - and the blasphemy that sometimes things feminists have done may be at fault. It makes the most sense to look at this through a religious lens. It's a shame as many good, well meaning people have become controlled by an increasingly radical and prejudiced ideology. It has given people in times of need a warm cosy shelter, hope at desperate times, and are told this shelter is under attack when this ideology is challenged.\n\nIn reality were just saying they shouldn't be throwing men's shelters in the rubbish dump constantly if men are not allowed any part of the feminist societal shelter. I don't want to stop a penny of funding for women's issues, even if I disagree with some of the activism that got that funding, but men should get some help too. Moving away from a Darwinist survival of the fittest society is a liberally progressive thing, for men too. The final \"trope\" for society to recognise as outdated is that women and young girls are worth more alive or capable than men and young boys, or that we should be able to listen to their issues or support them *at all*. \"Women and children first\" still seems to have become unapologetically all encompassing.\n\nThere are non prejudiced feminists out there, Quillette, Cathy Young, and others still call themselves feminists even if they're treated as heretics by most of the feminist lobby.\n\n&#x200B;",
    "title": "Where feminism took a path to being openly hostile to men's issues. It harms women too.",
    "subreddit": "MensRights",
    "timestamp": 1549434540,
    "score": 16,
    "keyword": "man artist"
  },
  {
    "text": "Why are so many popular make up artists men? I'm a man with a background in Sociology and am interested mostly in power and subjugation. Feminist ideas and literature fascinate me however I obviously lack the experience of being a woman and thus my feminism is often admittedly defined by ignorance.   \n\n\nWith that in mind I hope I can ask this without a pre supposed opinion or stance.  \n\n\nSocietally hair and make up is a feminine staple so it seems a bit jarring that these feminine idols are male? I am absolutely supportive of men practicing femininity and being celebrated doing so but it seems strange that men are the most celebrated hair and make up practitioners and relevant feminine icons in the hair/make up Youtube paradigm.  \n\n\nI asked my girlfriend (who watches and introduced me to James Charles, Jeffree Starr etc.) and she is unsure. Her explanation is that they are just exceptional make up artists but i'm not sure that makes sense. She added that most top make up artists who work with female celebrities etc. are men which I find intriguing. I should add she is not approaching the question from the same kind of feminist reading as myself instead just the female experience.  \n\n\nLiterally any contribution or suggested reading is welcome.",
    "title": "Why are so many popular make up artists men?",
    "subreddit": "Feminism",
    "timestamp": 1566039429,
    "score": 19,
    "keyword": "man artist"
  },
  {
    "text": "Qatar’s tourism chief, infamous for his racist-sexist remarks, launches ‘Summer in Qatar’   \n\nOn Saturday, Akbar Al Baker, CEO of Qatar Airways and secretary-general of Qatar National Tourism Council (QNTC), launched ‘Summer in Qatar’ programme. It is one of the biggest summer tourism festival organised by QNTC, in collaboration with more than 35 public and private partners. The festival brings an opportunity for the families and friends of Qatari residents to visit the country visa-free from June 4 to August 16 i.e from Eid al-Fitr to Eid al-Adha. QNTC plans to provide a wide range of exciting indoor and outdoor experiences to the visitors, along with entertainment programmes featuring local, regional and international artists, edutainment, summer and sports camps as well as special promotions on inbound travel, hospitality and shopping.\n\nDuring the launch Al Baker said: “This year’s summer season promises to attract visitors from across the globe showcasing Qatar as a destination for its unparalleled hospitality and authentic experiences.”\n\nTo promote the country’s tourism, QNTC also introduced lucrative offers including hotel discounts, shopping vouchers, and airfare discounts as part of the festival.\n\nAbout the festival and its schemes, Al Baker said “Aviation and tourism go hand in hand, and this year, we are leveraging the collaboration between these two sectors to offer travelers airfare discounts, promotional travel packages, and exceptional airport experiences throughout the summer. Whether they are passing through, visiting friends and family or remaining in Qatar, visitors will experience Qatar anew.”\n\nQatar is aggressively promoting country’s tourism as it is facing economic pressures of regional boycott. The Quartet, comprising Saudi Arabia, UAE, Egypt and Bahrain, had cut diplomatic and trade ties with Qatar in 2017 over financing terror activities and supporting extremist ideology of radicals groups like Muslim brotherhood. Also, with such festivals Gulf national is trying to revamp its international image which has been charred due to its links with terror groups.\n\nAl Baker who gave out a warm invite to the world, also mentioned sternly that Qatar would not grant visas to those whom it considers its ‘enemies’. In his racist comment he was indirectly referring to the Egyptians, whom the country considers its ‘enemy’ due to the political rift between the two, which began nearly two-year ago.\n\nThis is not the first time Al Baker has passed a controversial comment. In June, 2018, at a press conference in Sydney, when asked what could be done to tackle the lack of women in Middle East aviation, Al Baker replied this was not the case at Qatar Airways. He added: “Of course, it has to be led by a man, because it is a very challenging position.” His remark roused debate over the existence of sexism in the industry. [https://www.reuters.com/article/us-usa-trade-turkey/turkey-expects-u-s-not-to-end-preferential-trade-treatment-idUSKCN1S926M](https://www.reuters.com/article/us-usa-trade-turkey/turkey-expects-u-s-not-to-end-preferential-trade-treatment-idUSKCN1S926M)",
    "title": "Qatar’s tourism chief, infamous for his racist-sexist remarks, launches ‘Summer in Qatar’",
    "subreddit": "Feminism",
    "timestamp": 1557138998,
    "score": 2,
    "keyword": "man artist"
  }
]