[
  {
    "text": "EXPENDABLE - My 2 Years As A Blizzard Entertainment 'Game Master' My apologies for this novel!\n\nWorking for Blizzard was one of my dreams since 2005 when the WoW hype train started gaining major steam. For years, I applied only to get cut before an interview was ever granted. Still, I never gave up, always applying for positions I was qualified for whenever they were added to the Blizzard recruitment page.\n\nThen it happened\n\nThe day before Halloween in 2013, after having finally been granted an interview, I received a call from the team I had interviewed with to congratulate me and offer me the job of Game Master, a position I instantly accepted (for those that may not be aware, Blizzard Game Master is another name for their Customer Support associates) Training began two weeks later which was awesome. Getting to be onsite, experiencing Blizzard Entertainment HQ in Irvine for the first time, and as an employee to boot. It was the start of something incredibly magical for me; a journey I had been longing to embark on for almost a decade.\nSlowly but surely, however, that dream plummeted to the depths of nightmares. \n\nOnce training had ended, it became very clear just how unimportant and expendable Game Masters truly are within the company. Up until just before my addition to the company, I had found out that Game Masters were not regarded like all the other Blizzard Entertainment employees, for instance when company events and outings would occur, Game Masters simply were not invited. Though that was not the case when I started, Game Masters were still looked upon by the rest of the company as the \"Red Headed step-child\" of Blizzard, even having a completely different colored badge than anyone else in the company which created an unspoken hierarchy class system around HQ among the employees (think Blizzard Entertainment being Snowpiercer with Game Masters in the very back and their own special colored badges so you know they're the little guy).\n\nStill, this was not my first corporate job so being the low man on the company totem pole was nothing new to me and I assumed with time and my hard work, I'd be looked at as a valuable member of the Blizzard machine.\n\nThis was something that never came to fruition.\n\nWhat made this most difficult was the fact that the management team within Blizzard Entertainment HQ customer support did not seem like they actually lead their respective teams, instead simply being a boss behind a desk who only gave orders and just shrugged when their associates had concerns about the job, morale, and treatment within the customer support team. While the Game Masters were handling call after call, ticket after ticket, 8 hours a day, 40 hours a week, handling Blizzard customers who more often than not talked to Game Masters like a heated high school student who knows they can get away with saying anything they want online, management was at their desks having the time of their lives. Of course this was part of the job but being screamed at on a regular basis, over and over, while your bosses sit at their desks loudly talking to each other about what movies they saw over the weekend, playing games, demeaning women, and doing nothing that showed any sort of actual work or concern for their employees, whom they knew were all drained of morale.\n\nNow keep in mind that the language at Blizzard is pretty free (managers / employees use foul language on a regular basis, even in meetings, but it's always in a manner that's not hostile).\nFast-forward to late Spring 2015, to me taking my concerns about Game Master treatment to my general manager, telling him via email that the constant schedule changes, complete disregard for Game Master concerns, and the overall lack of attention to their own team had driven many of us to a company outlook based more on animosity than the amazing experience working for a major video game company should be \n(ESPECIALLY one as big as Blizzard). A few days later, I get pulled into the HR office with the general manager where he (we'll call him Justin) began cussing me out right in front of my HR rep (we'll call her Erin) because he didn't appreciate me bringing my concerns to his attention in the fashion I did, along with the fact that my concerns had not been voiced by any other employees to the management team, leaving me as the lone \"whistle-blower\". Erin looked at him while he continued to berate me in the HR office, but most likely due to being 5'1\", mid twenties, 6-months pregnant, and only a recent addition to the customer support team, Erin did nothing to stop this sudden and inexcusable treatment I was receiving from Justin and instead just sat there in silence. Sadly, at home that evening I had what the doctor's office verified the following day as an anxiety-induced emotional breakdown because of it (something I had never experienced before and what was incredibly terrifying).\n\nA month goes by and then without warning, having never been reprimanded or written up in my almost two years with the company, I received a written final warning based on my emails voicing my concerns to the Justin (the ones which lead to my meeting with him and Erin). Yes, inexplicably 1 full month after that meeting with nothing having happened in between. Instantly livid, I walked right into the HR office and demanded to speak with her (Erin’s) boss as I no longer trusted her since she failed to defend me when being cussed out by Justin right in front of her; her excuse was \"That kind of language is acceptable in this company\" to which I replied \"Only if it's used in a way that used by a manager to intimidate a subordinate\". She had nothing to say in reply to that.\n\nA week later, I was finally connected with her boss, however it was through a conference call as he was out of state. The call lead nowhere, simply leading back to me as being the issue having voiced my concerns in a way that Justin did not appreciate (but for some reason Justin cussing me out in front of HR was brushed aside and was not a concern during the call, regardless of how adamant I was of the issue) My continued cries for help went ignored through the company.\n\nFrom there, knowing I was almost out of options, and knowing Justin's boss (we'll call him Tony) was out of the country, I went to the next person up the ladder (we'll call him Todd) who's office is also at the Blizzard Irvine HQ, being one of the highest rungs on the Blizzard customer support ladder. Todd had always been a very available individual, always telling the team that his door was open to discuss any issues we may have. Suddenly though, that door seemed always closed. My email to him detailing the issue that I was in and the fear for my own employment (suddenly being on final written warning after no previous warnings of any kind means I could be tossed for literally anything) was completely ignored. This was the last person I could go to without starting to climb the executive ladder outside of customer support. But again, my cries for help were ignored.\n\nA company, one of which who's main words to live by: \"Every Voice Matters\", had completely disregarded the voice of a Game Master, one of their own employees, who saw the treatment of customer support by its own managers, saw the outlook from the rest of the company on customer service, the main contact point between Blizzard as a company and Blizzard's millions of domestic and international customers, was one that was completely expendable. It didn't matter if you were happy or not, if you felt that you were being mistreated by management, that your higher-ups were not only taking advantage of the rules, but were breaking them on a regular basis whenever it suited them and yet didn't stand by those same rules when their associates came to speak to them (or simply plead ignorance).\n\nDecember 2015, two weeks before Christmas, and just over two years after I had been hired, I was brought into a small corner office with Erin from HR and my hiring manager (we'll call him Nick; another managerial individual who could care less about the morale of his own employees) and was told, with nothing to show for it, that I was being fired for \"Excessive use of the internet\", something that was not brought to my attention at my team lead one-on-one meeting with Nick just two weeks prior, nor had it ever been mentioned as something that was possibly endangering my employment in my two years with the company (which was funny since my one-on-one's always consisted of Nick telling me that I was doing far more than the majority of the Game Masters and that I didn't have to feel \"tied to my desk\" so to speak). Completely shocked, I knew that the real reason I was being fired had to do with Justin and the meeting months ago where he cussed me out that had subsequently been disregarded by HR, management, and the multiple other people I sought out help for.\n\nIt seemed to me that instead of dealing with Justin who was clearly out of line and had broken major company and ethics rules, and dealing with Erin’s lapse of judgement when she failed to stop Justin's outbursts, it was simply the team trying to save itself when they knew they were in the wrong and instead was much easier to get rid of the one Game Master involved, most tragically during the holiday season.\n\nI was crushed. My hopes that I was one day going to move up the ranks and eventually be part of the production team for Blizzard instantly obliterated simply due to Justin's emotional outburst, which he was never punished for and funny enough now has a position with Blizzard HR. It's so hard for me to look back on Blizzard and think that I wanted to work there back in the day. As well, it's tough not to look back on HR, who are supposed to be the ones to do something about things like this, being witnesses to the outburst and remaining mute. Sadly, the only outlook I have now on Blizzard Entertainment is that they fail to go to bat for their employees when one of their leads was clearly out of control, and no matter how hard someone works to make the company what it is, they can be brushed off simply because they are a Game Master; something that is seen by Blizzard Entertainment associates high and low as the absolute gutter of the company.\n\nIf you took the time to read that whole post, I thank you!",
    "title": "EXPENDABLE - My 2 Years As A Blizzard Entertainment 'Game Master'",
    "subreddit": "jobs",
    "timestamp": 1487187490,
    "score": 104,
    "keyword": "man doctor"
  },
  {
    "text": "As a soon to be 27 year old male, who has a Bachelors degree in Political Science, and soon to have an Associates in Homeland Security, how do I acquire a job? Dont really know what Im doing. Edit: Sorry again for the giant rant blog post. I dont even know if this was the right subreddit to even post this too, or even if I should've posted this at all. Just kinda spontaneously happened\n\nHonestly, I dont think posting this question will really do me any good and all, mainly because of my own incompetence, but I figured I have all the free time in the world so I dont think it could hurt to try.\n\nIm 26 soon to be 27 year old male who has lived with my parents all my life. I graduated with a Bachelors in Political Science at the age of 22, so I figured I was on track and on time to living a normal life like everybody else. I dont actually care for the subject I majored in. It was just my parents always told me that having a college degree is better than not having a degree, so I went off to college and became the first one in my family to get a degree, or at least a Bachelors I think. I figured I was never going to have the intelligence/will/skill/enthusiasm to be something like a Doctor/Engineer/Businessman, but I also figured Political Science wasn't on the bottom tier like Underwater Basketweaving or something like that. Figured I had chosen a decent middle of the road major. \n\nI wasnt an honor roll student during the time at the 4 year college I went to, but I think I am at the community college Im currently going to to obtain my Associates in Homeland Security, though I dont think that really counts since I take a low amount of classes each semester, though I will be having the Associates by the end of this December I think.\n\nAnyways after I got the Bachelors, my father would look online for Jobs for me, since I have not even the slightest clue on how to look for jobs. I figured it would make more sense for my parents to look since they have all the life experience and are responsible adults who've already done this. Couldnt really find anything for 6 months. \n\nThen my only real life friend who I still have in close proximity told me to come work with him at Giant Grocery Store. My parents told me its better to have SOMETHING on my resume, to show that Im willing to work, even if it is just at a grocery store. To show that Im not sitting on my ass all the time. So I work their for 1.5 years, simply as a Salad Bar Clerk. Had no problems with the job at all, I liked the people there, figured it could always be much worse. I had perfect attendance there, while everybody else in my Department would call out sick every other week. I was hired part time, but they eventually pushed my hours beyond 40, even though I still wasnt considered full time. I didnt really want more hours, all I wanted was to just have something on my resume saying that I didnt sit on my ass all the time. Figured it was kinda an interesting *problem* since every other worker in the store would complain about a lack of hours, while they kept increasing mine. Whenever my managers would ask me to stay later for whatever reason, I never declined, even if I didnt want to, because I figured I got nothing better to do, and Im a complete beta male who can't really say no.\n\n Heck, I remember we hired this 1 foreign chick who couldnt really speak or understand english, yet was supposed to close the Salad Bar on her first day of work, which I knew there was no way in hell I could successfully teach her verbally and I would get off work earlier than her, so she will inevitably screw up and then make us be behind the next day, so I decided to come in on my own time off the clock and stay with her for 2-3 hours closing the salad bar with her just to have an on the job first hand understanding on what to do. Luckily my manager saw this and thanked me. \n\nSo anyways I eventually put in my 2 weeks, because I wasnt sure if working there was actually helping me find a government job or not. I figured if this wasnt helping, maybe I needed more schooling? Maybe I majored in something bottom tier and I was just too stupid to know better? My managers seemed to try really hard to make me not quit, since they knew they could rely on me to consistently do what I've been doing. Which by the way, I wasn't even remotely close to the best in the Salad Bar. My superior was this lady who was like 10 times more productive than me, but I still felt appreciated even when I clearly wasnt the best. They even gave me a cake when I left. (Though I have no idea if thats standard operating procedure and Im just reading too much into it and hyping myself up because of my ignorance)\n\nAnyways, I put in an application for the TSA. I passed all their tests and then got invited for an interview. I failed the interview for some reason. They dont tell you why. Which really bummed me out. I figured if I never know what I did wrong I could never improve myself. So I was really starting to get sad. \n\nI think I graduated from Salisbury in Maryland in 2013. Then late 2013 started to work at Giant for 1.5 years and then left during 2015.\n\nEver since 2015, I havent worked anywhere. My parents have tried putting applications in whatever they could find, though an overwhelming amount of them require much more education than I currently have, and something required me to have been an honor roll student, or various other things. By the way, this is just what my parents have told me, I have never actually looked for a job myself, because I cannot even begin to formulate a thought on how to start. My logic is my parents would know better than me. \n\nI think this is where I should say my parents are the greatest parents in the world, I dont even need to know any of you or anybody else to make such a declaration. I dont think my parents are rich, but I think they are definitely above middle class I think. Im not sure really. Dad said he might close to 6 figures and Mom made much less than that, but for a family of 3 that seems pretty good to me, my apologies if I really have no clue to what the answer is, I think I've lived a sheltered life, well, at least since highschool and beyond, no idea how to make friends anymore, since all the ones I had in Elementary school and Middle school have moved to other states and such. So much easier as a kid, so I basically stay inside my room all the time. I mean I've pretty much never had to do chores around the house! Like ever! I've barely ever taken out the trash, wash dishes or clothes, vacuum, etc etc the entire course of my life so far. They dont even complain about me! I ask them all the time if it was better if I just went somewhere else to not be a parasite on them anymore but they always tell me its okay dont worry about it. My Dad always tells me its not my fault, its just the bad economy or something, though I personally dont believe that. I think its clearly something wrong with me. I just wish I had a \"How to figure out Life\" guide or something\n\nHell as Im typing this I cant help but think how damn lucky I am to have parents like this. I make sure to not act like a brat, and whenever they tell me to do something for them, Ill certainly do it. But anyways, I think I've been getting off track and sadly this seems more like a blog post or something so now I think Im starting to regret even typing this out because now it might seem cringey as fuck or something, which it probably is. Im basically admitting Im just a giant man child\n\nSo ever since leaving Giant, I havent found a job. I dont know if I should just give up on even thinking about getting a gov job. Maybe I should go back to working at Giant? Or somewhere else? I have no idea. I know my Dad would say maybe working at Giant is not so bad since maybe you could work your way up and do some security stuff, i dont know. \n\nIn reflection, I really dont think I have any skills worth a damn. I know Im somebody who will never miss a day of work. Hell I had perfect attendance in middle school and got an award for it which made me feel special. But when I look on Facebook at all the buddies I used to know, people who never had opportunity like me, who never had amazing parents like I had, who never even went to college like me somehow have their life in order. People who from what I assume to be self sufficient individuals who have figured out their formula for life. I just get some damn jealous. \n\nWell, thats all I can think of at the moment. Im sure theres some more important information I could've listed. But frankly Im already embarrassed as hell that I somehow made some ridiculous blog post. But at this point. I think Ill take some hits to my ego just for some advice. It doesnt have to be good or anything, Im sure there are plenty of people worse off than me or something, but if you dont mind, Id like to know what I should do. Should I just find some random private sector job and start working immediately? Just to continue building the resume? Surely its better than me not doing anything at all for the past 2 years",
    "title": "As a soon to be 27 year old male, who has a Bachelors degree in Political Science, and soon to have an Associates in Homeland Security, how do I acquire a job? Dont really know what Im doing.",
    "subreddit": "jobs",
    "timestamp": 1504210530,
    "score": 4,
    "keyword": "man doctor"
  },
  {
    "text": "Any words of wisdom? So I am working at a sporting goods store that has a sandwich shop inside and have been working this job for two years. My supervisor has only been in my department for one year and she has tried to put me down if I don't have enough time to finish stuff and it is left to be finished the next day. She has done some other stuff like going off for 45 minutes to an hour without telling us where she is going and not doing her job 's responsibilities. She has also denied one of my coworkers medical- necessarily breaks that she has a doctor's note for. The thing is that she has done the running off and not doing her job when she was in her previous department. \n\nNow I've notice when my manager does the sechduling, he only schedules me one day a week to work with her, and it has been usually Saturdays, if I work that is. I also work in other departments when they usually need the extra man power.  I have also applied for other positions within the store and one is under the same manager but different department. \n\nNow I have been told that our manager and the store manager is aware of the stuff that she is doing and are planning on having a meeting with her, but I know that she has lied to get herself out of trouble before. And she has also told another coworker that if she is fired she will pull the race card (she's african-american). So what I am asking is that should I report this to my company's hotline  or just wait it out?\n\nEDIT: I have should have added I love my job and the people I work with it is just that I shouldn't have to go in to work worrying that if I slip up just once, I'm going to get reprimanded for a simple mistake, that she has made too.",
    "title": "Any words of wisdom?",
    "subreddit": "jobs",
    "timestamp": 1494725546,
    "score": 0,
    "keyword": "man doctor"
  },
  {
    "text": "As a girl who ended up not aborting, I am more pro-choice than ever. It is your life. Hello everyone.\n\n\nFirst of all, I would like to apologize in advance for the numerous grammar mistakes I will be making, since English is not my first language. Also, I am very tired and my head is foggy writing this with less than 3-5 hours sleep for the last 2 weeks, so there is a possibility this will be a incomprehensible mess.\n\n\nQuick back story: I am 21-years-old with a baby who is 1 year and 8 months old. I became pregnant at 19 for my then-boyfriend-ish dude. He isn't really in the picture anymore, with his whole heart. He has his own life with a new girlfriend, he studies, he parties, he goes on vacations. He has a fun and active life. That fun and active life doesn't leave that much of time for our daughter. His effort is maybe once a month, usually a lot less, reaching out to ask how she is doing, otherwise it is 99% of time me who sends the whatsapp messages (who are left unanswered) and calls (who he seems to ignore happily pretty often), trying to get him see our daughter. \n\n\nHe doesn't pay child support since he is a broke student, but most of all we had a deal of leaving third parties out of this to have his relationship with her as good as possible. In his words, he will make it up with love with what he can't pay. Obviously I am considering to break our \"deal\" since he has 0 respect to it anyway. It will be a long, exhausting fight where I will be the cruel, money-thirsty manipulating bitch, his new girlfriend will see me doing this because I want to sabotage their relationship and he will be the victim.\n\n\nAnyway, this post wasn't about my ex, I don't know why I wrote about him. Maybe because I just saw his instragram travelling photos from exotic beaches and felt a sting of jealousy and saddness. \n\n\nAs I said, I was 19 when I became pregnant. You know those girls who say \"I _always_ wanted to be a mother!\"? Yeah, I am the complete opposite of that. I can't understand that, like someone would be speaking a different language. What do you even mean with that?? How can someone dream of having children? My first instinct was to abort, immediately after I took the test. I don't like kids. I never wanted to be a mother. I never, for a second, dreamed of having kids in my life. \n\n\nMy then-boyfriend, took a strong pro-life stand, but made it clear he will respect my choice even if I abort. He didn't push or bully me to anything, let's make that clear. What he did do, though was that he did manipulate me with a rosy view how fun it will be to play with our little kiddo. In his mind it was only ponies and rainbows. I thought we will raise this kid together. He told me so, very clearly.\n\n\nI did book an abortion date. The days before that after school I spend scrolling through pro-life-websites, youtube-videos, sites (even reddit) where women like me where called a whore, why didn't I use contraception, this is my punishment, I will go to hell for this. I could spend 9-10 hours glued on my phone and fall asleep at 3-4 in the morning, since I was too anxious to sleep. My mom was the only one who was relieved that I will abort and supported me. My crazy religious relative (the nuts one in our family) who got to know about my situation and harassed me that I will \"pay for my sins\". Good stuff like that. \n\n\nI live in probably the best country in the world for women. I am _not_ religious. I have never been religious. My country's overall position to abortion is very relaxed and respectful towards the women. The conditions to keep my child as a poor (well, let's be honest, I had no income then, have no income now) woman are the best in the world. We have a fantastic welfare system, free health care, free education. Everything. I saw that a lot on those so called pro-life sites, and have seen them later on. Women who say they are feminist and want the _conditions_ to be so well women don't have to abort. I had those conditions. \n\n\nFrom that day I became pregnant (or let's say, more precisely, that first day when I started to scroll those websites) I have lost my real will to live. That kind of will that makes you dream and enjoy life. That kind of passion where you  _look forward_ to things. Where you are anxious to go to the world and fight for your place in life. Anything can happen, life is so exciting and fun. That was my life before I became pregnant. I had dreams of university, maybe a foreign husband, erasmus, travelling, partying, experiencing.  Learning languages, dancing till the morning, drinking, making friends. \n\n\nThe day before my abortion I had the worst panic attack, my first. After that there has been plenty. I cancelled my abortion the morning of it. I felt enormous relief. \n\n\nLet's be honest about the reasons here: I, a person who was raised in a very non-religious-only-namely-christian household, was convinced I am going to hell if I do this. Yes, you read that right. I would never confess this to anyone else, ever, but I did not keep this baby because I saw a future with her or because I wanted to, I did because I did not see that I could terminate it now. I felt 100% trapped, everything was over. The mistake was already happened, nothing could save me anymore. Either I was going to be a baby-killer or then I was going to have a stupid, boring life. No good options. \n\n\nI am more pro-choice today, as a mother for a very challenging but beautiful almost 2 year old, than ever. I know motherhood now. I know what my life is now when I had this child. I lost myself. I am still not in the university because I can't concentrate on reading for the entrance exam with her. I am trying this year, but it won't happen. I am exhausted. Money is tight and it is _very_ strictly controlled, even though because I live in an awesome country I am not missing anything.\n\n\nMore than anything, life is lonely. My friends are living their own life, no one is a mother. I am the boring, frumpy shell that is nothing like what I used to be. I have strecth marks, my boobs are sagging at 21, I am overweight. I had a very difficult and painful birth that still manifestates itself today in form of me having trouble of holding on farts. I don't use make up anymore, nor do I dress up since I don' have money for clothes and I hate my appearance so much there would be no point anyway. Oh I am sorry, I know that when women become mothers appearance and \"superficial stuff\" don't matter at all since we don't care about anything else than our children's welfare. If we do, it is just to please our husbands. Well, I don't have a husband, and I mourn the loss of my looks very much. It affects my self esteem.\n\n\nI am perfectly aware how society even the most feminist, free countries in the world sees single mothers. I am a fuck up, a mess up, I was \"pumped and dumped\", I deserve this. No good man wants me anymore. I have lost even the boys who used to be my friends, not to mention when my boyfriend left us absolutely no one was interested in me anymore.\n\n\nI spend my days with my little human. I take care of her, I feed her, I bathe her, I play with her, I go to the park with her, I read to her. I am constantly, absolutely constantly, scared of parenting her wrong. I try to learn about parenting methods which I can't seem to really keep up with in real life. \n\n\nNow, let's get to the important part of my mindless, long rambling: **I love her**. With all my heart. I have short times of immense joy with her. My life is for her. I am trying to get into university in a field that would have 9-16 days so I can construct my life around her.  I will fight with everything I have to ensure she has a good life. \n\n\nIf I was sent to that day right now, holding my phone with shaking hands, convinced I have to cancel my abortion, would I still do it? No. I wouldn't. I would abort. \n\n\nPeople don't like extremely complicated answers, answers that actually reflect life that is hard and has a million different view points. They want \"oh not aborting was the most wonderful decision of my life, my child gave me a reason and happiness and everything\". They don't want young women with no realistic opportunities to support themselves without the help of the government to have children, but will judge those who abort.  \n\n\nIf I could, I would go back and abort in a heart beat, actually understanding what it means to stay up alone all by yourself, be left my your boyfriend who has the freedom to just merrily fuck off to his exciting student-life bubble with our old friends. I would understand how taxing the bodily, mental and hormonal changes are. I would understand, than once you have a child _that's it_. Your life is over, or at least put on on hold, and you _never_ get life or those precious years of freedom,  fun, studying and networking back. The reason people make babies in stable marriages is because parenting is FUCKING HARD. It is FUCKING EXHAUSTING. I would give _anything_ in this world to do this when I am significantly older, with a supporting husband, living our on own money, in house. It would be wonderful to have that now, but still it wouldn't be what I really want in life. It would still be a second-place good. \n\n\nI don't need help, or reassuring, or cheering or \"it will be get better when that baby reaches age x\"-thing. Nor I am looking for compassion. I know clear well my post comes off as a selfish, whining bitch. That's how women are seen. We have a motherhood myth, and if you don't fit in you are a monster. I don't need advice or \"why don't you just adopt/quit bitching and enjoy what you have/at least you have a healthy child/most people have it worse\". I don't give a fuck. I know perfectly well I am a good mom and will be a good mom, and I will do everything for her. However I don't like it, I don't like my life. Its lost. \n\n\nI have been to the doctor and yes I am depressed. I don't need \"this is your post natal depression speaking, it will get better when you get sleep, when she is an adult you are grateful for her blah blah, you would be depressed anyway\". I don't believe depression being an illness that just pops out randomly for no reason at all. I am depressed because I hate my life and have no way out, and the reason it is because I hate being a mother. You can reverse every single thing in life except having kids and death. \n\n\n**TL;dr**: Women who are pregnant and thinking whether or not to abort: Do not give a single fuck for _any_ outside opinion. Not the opinion of your boyfriend, or even husband, relative, friend, church member, whatever (I know the husband and boyfriend-part will trigger a massive roar, don't care.) . Look at _your_ life in the future, what you want, and then act accordingly. Keep your child ONLY if you WANT TO BE A MOTHER. Everything else, finances, relationships, people shaming and guilt-tripping you, is bullshit. I am **not** encouraging anyone to abort. I am saying that in the end no one else will be there, and it will be you and only you, with your one, unique life. It needs to be _your_ decision you know you can live with the rest of your life. Those people wanting to influence you are not going to care or help you in the end. \n\n\n\nThe end. \n\n\n**Edit**: I have to go now and it can take me a long time until I get back (I can't be on phone or computer when I am with my kid) , so I am upset I can't answer to each and every post made here, but. Please know that all your positive messages have made a huge impact on me. I am in tears. I shared something painful and instead of a few trolls and ignoring, I got to have so encouraging and beautiful messages and other women sharing their feelings and life situations. I thank all of you for your PMS (except the trolls) and your messages. I will read all of them and try to answer to as much as I can.\n\n\nAnd to that person who gave me gold, I have no words. Just... Thank you. Thank you so much.\n\n\n**Quick edit 2 since this is important**: I would never say to my daughter that she wasn't really wanted,  and I will do everything I can ever to feel the complete opposite. I will never tell her anything what really happened when I considered my options. I've always said to her I loved you since the moment I knew you were coming and that she is my greatest gift, and those things are true. My daughter is the light of my life, and I don't blame her on anything, what I do blame is myself and wish that women could have more support. I know my feelings are more complex than mothers are allowed to have, but to those asking if I hate my daughter that is the last sentiment I have. I will be the best I can for her, and I am sticking to my decision.\n\n\n\n**Edit 3** : Good god I am shaking. I don't understand what is happening here. I am honestly in a state of shock. I thought I would just quickly check this before crashing since I can hardly keep my eyes open, and came back to blown up inbox of hundreds of messages, _four fucking golds_,  this is being in the r/all. I can't wrap my head around what is happening.\n\n\nYour messages. Your private messages. It would be impossible for me to try to put in words how I am feeling right now. It would be too little to say that I am overwhelmed. I have read message after message with my hand covering my mouth since I can't take all these people reaching out to me, telling their stories and sharing how they feel about their situations that are from every perspective of this issue, people sending just LOVE, just lovely, encouraging, loving messages for a complete stranger (and yes so, so many hateful trolls too, btw I don't read further immediately when I spot on a message that was mean simply to hurt). I don't know what to do with all this love. My heart is beating so fast.\n\n\nIt would be absolutely impossible for me to go through all of them right now, it is very late and I have spend much longer on this than I really could. I will read each and every single of them and reply to as many as I possibly can.\n\n\nI can't believe just letting the world see my ugly raw hopelessness and feelings of being trapped could open a gate like this. I dwell on these thoughts hour to hour, day to day alone, month to month, usually when grandma takes my daughter to her so I can have a short break I write to myself in my diary. I can't believe the amount of women reaching out and sharing how they feel. \n\n\nAs I said, I am not religious, but I believe in the universe. But let's just say I've have a _very_ hard couple of months, and _extremely_ hard couple of days, especially this day. i think. I think I was supposed to write this. Something has cracked inside of me, I can't handle my emotions right now but this, this has been more therapeutic than the 7 months I have spent with a professional. I know this sounds ridiculous, but this is some kind of turning point for me. I feel it.\n\n\n\nI don't know how to say thank you. Thank you. Just **thank. you**. Thank you, thank you, thank you. Now I am going to drink about 6 liters of water to hydrate myself after all this crying and then I think I am going to lay down to the bed and be actually able to breath without the heavy feeling of creeping pain and soul-crushing anxiety blocking it. Then I am going to sleep well. For the first time in so long I don't want to write it. I just know it. \n\n\n\nSince I have this one short chance to say how I feel about this and maybe reach out to someone (also because I received so many of those messages of how I promote and encourage abortion), I will repeat this in a shorter way: **Nothing else matters than your own, personal, deep desire and inner voice on choosing what to do. It has to be YOUR choice. Do it ONLY if it TRULY is YOUR choice. Nothing else should do, since nothing else really matters.** Everything and everyone trying to manipulate, influence, bully, shame, or convince you is indifferent. It should go without saying, but since it was confusing to so many people, this applies to those women wanting to keep your baby but feeling that you are too much of x, have too much or too less of x or are being pushed by a partner/parent/important person in your life to abort. That decision _will_ hurt you, greatly.\n\n\nLet's get through this one more time: your marital status, age, education, wealth, what the society and community thinks, your image, how religion/someone from the outside views your decision, every single one of those are not what should be the reason you do what you do. \"But women are struggling to conceive so I should feel lucky, but my married lover wants me to abort, but I have everything I need in life, I am ready\", do not give a single fuck if it goes against your inner voice. If it comes from the outside, it is not yours, and you will have more than a hard time living life that is not yours. If it is, you will find a way to cope with everything and anything that comes along the way, since nothing in life is a greater motivation, source of power than knowing what you are doing comes from you.\n\n\nAnd lastly for those attacking me for bringing up the pro-life propaganda and how much it affected me, being skeptical about how it can get through to someone like me: when you are a confused hadly-an-adult, in a situation that is so panicking you feel like you are in the roof of a burning apartment with no opportunities to save yourself, with a huge hormonal rush, not knowing what to do (or more like thinking you aren't supposed to do what you want to do), you submit to powers you would normally not pay a second to. And I consumed that shit _a lot_. I understand it is hard to understand for an outsider, but when you are in a state of complete vulnerability feeling like it is something too big for you to decide, it is easier to listen to someone who says they know exactly what is right for you even if you know it isn't. They use stuff that cuts down to your emotions and really fucks up your mind.\n\n\nI am not blaming my boyfriend, my internet habits, or anyone outside for my decision. I take full responsibility of what happened. No one forced me with a gun to do anything, even though it felt like it in some way. But just like it was my choice, I should have seen it truly is _only_ my choice and absolutely no one is invested in that I am.\n\n\nAnd that is my goal for women to realize. I belive we are strong together and should celebrate and look out for each other. Womanhood is a beautiful but hard thing and we need to help each other. Thank you, you wonderful ladies and gentlemen. I will get back to all of you soon.\n\n\nThank you for giving me hope, since that is what I got from this. Hope. So much hope. I am now going to bed with a lighter heart I've had in years.",
    "title": "As a girl who ended up not aborting, I am more pro-choice than ever. It is your life.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1490447998,
    "score": 14972,
    "keyword": "man doctor"
  },
  {
    "text": "Dear Fellow Pro-lifers; We can't legislate away abortion and why we shouldn't want to. Dear Fellow Prolifers,\n\nI am Pro-life. To me, that means caring not only for unborn children but also the women who feel they have no other choice than to terminate their pregnancy.\n\nThe thought of someone having an abortion tears at my heart. The loss of an innocent life physically hurts me. But this isn’t something new. Abortions have been going on since the dawn of time. We will never be able to reverse legislation that makes it legal. And we shouldn’t want to. We shouldn’t want to go back to a time when desperate women would go into an alley and let someone they didn’t know perform a dangerous procedure on them. \n\nI don’t want that and you shouldn't either. Instead, we should be doing everything possible to make it so that women aren’t forced into that position to begin with.\n\nThat starts with education. We need to support legislation that encourages sex education that teaches our young people about safe sex. Not only to prevent pregnancy but to also prevent the spread of STIs. The idea of abstinence, waiting until someone finds their one true love, is great. It’s what we want for our children. But it didn’t work a hundred years ago and it doesn’t work now. Our self-worth, as women and as people, should never be tied to our sexuality. To tell someone they are worth less because they gave in to temptation, the same temptation probably close to 100% of the adult population gave into before marriage, is disgusting. If, as a parent, it is important to you to teach that to your child, then go ahead. But I, as a Christian, am called to love everyone. Even those who don’t agree with me in my beliefs. And I certainly don’t expect others to follow commands I failed to obey. How many abortions are on our heads? How many abortions have been done because single women were too embarrassed to tell their religious families that they were pregnant outside of marriage? I never want my children to feel like they can’t come to me. I don't want them to be afraid that I would disown them or send them away should I find out they had sex outside of marriage. It’s preposterous. We need to stop holding others to a higher standard.\n\nNext, we need to fight for legislation that provides free or low-cost contraception to anyone who asks. If everyone having sex knows about contraception and can go to the pharmacy or the local clinic or their doctor’s office and get it, imagine how much it would reduce the number of abortions in this country. This includes the sixteen-year-old high school student that wants an IUD, the thirty-year-old mom that wants an implant, and the forty-year-old homeless man in need of condoms. And I am including the morning after pill in this, because that is NOT an abortion, and people need to stop acting like it is. All the morning after pill does is makes the uterus inhospitable so that the fertilized egg doesn’t attach. I would rather this than have a woman wait six weeks to find out she’s pregnant and then have an abortion. \n\nWe need to stand together, whether pro-life or pro-choice and find our common ground. We need to fight so that abortion is so rare that it’s no longer a division between us. We are women, we are strong, and we can do this!",
    "title": "Dear Fellow Pro-lifers; We can't legislate away abortion and why we shouldn't want to.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1485715929,
    "score": 11372,
    "keyword": "man doctor"
  },
  {
    "text": "Boyfriend wanted an abortion, so I got one. Less than a week later he runs to his parents and tells them i got an abortion against his will. Then he told my extremely conservative family, all of this without my consent. What can I do? This all started weeks ago when I found out I was pregnant. My (now ex)boyfriend has a severe anxiety disorder where he shakes contantly under pressure, has episodes that look and feel like heart attacks and has to go to the hospital frequently because of it. He's from an extremely religious background, and this is his first adult relationship (he is 27, I am 26 and we've known each other well over a decade. He was a virgin until age 26 by choice, and I was his first partner.. I am not religious so he was not my first). He has a very close relationship with his family; many/most would say TOO close. \n\nAnyways, he told me that if we had the baby, he would most likely die of a heart attack because according to his doctor, if he didnt remove stress from his life he will eventually have a fatal heart attack. He said if it was up to him, he would choose to have the abortion, but that its completely my choice and he would just try to find a life insurance policy to take care of me and the baby. To me that's not a choice or an option. Either my partner dies or i get an abortion? A life for a life is not a choice. He told me not to worry, that in 2 to 3 years we could have a baby and everything would be fine. So I decided to abort, despite my hesitation and constant emotional breakdowns because of it. We decided mutually to keep it a secret from our extremely conservative and overbearing families.\n\nFast forward 5 days after the abortion. SO asks me to marry him and Im filled with joy and hope and elation. We were passionately in love and he had spent most of his time sitting with me while I recovered. Then the next day he told me he needed alone time. The day after that he said he thought I was having over the top emotional reactions (no kidding, after a stressful pregnancy, unwanted abortion, and first week of birth control?). He said these reactions were unfair to him, but Ive never raised my voice or insulted him. I was just crying a lot and Ill admit it, being very needy. \nSo he approached some friends for \"counsel,\" told them everything EXCEPT  the pregnancy/abortion and they told him I was being emotionally abusive and to stop talking to me immediately. So he did. And told me he was going to tell his parents about the abortion. Then ghosted.\n\nNext thing I hear is hours later from my mother, saying he had met up with his father and my stepdad to tell them that I had an abortion. And that he never wanted one and had asked me to keep the baby and that I had decided this against his wishes. He broke up with me through our parents, as a grown-ass man, and refused to talk to me until the next day. When we met up the next day, he wouldnt let me into his apartment to get my things. When we talked he showed zero emotion or remorse. It was truly disturbing. Like talking to a shell of a human. Within one day, everything changed. I feel dizzy and betrayed and abandoned. I guess i just need to vent about all this. What can I do in this situation? I had trust issues before, and I dont know how I can come back from this.\n\nI need help (edit-- any recources to cheap or free therapy i could find? I feel an immense amount of grief about this abortion and the aftermath and I feel like I cant handle it on my own.)\n\n-----------------------------------------------------------------\n\nTHANK YOU for all of your sentiments and support. I've read through every comment and it helps so much to be affirmed that this is in fact not normal behavior. (I've been through many abusive relationships and have a hard time assessing what is \"acceptable\" behavior or not.) \n As an update/correction to the above, while he did not allow me into his house at first, when I brought my best friend (and mutual friend of his) with me, he allowed us in. He didnt want me in his house \"without a witness\" (his exact words). We ended up talking, and he really believes that what he did was the right thing. He really believes he's a victim. And thats all he would say, that he offered to die for me and the baby but i just wouldnt let him. My friend told him how abusive this was, and how fucked it was of him to do. He had multiple conversations with her in the past in which he stated he wanted an abortion. And when she asked him if he remembered that, he just stared blankly. So clearly mental illness is at play here. It was like he was dissociating. \n\nAlso just to be clear, my family has been shockingly supportivr through all of this. They believe me and are actually relieved that this happened now and not later, which blows my mind because my mother is clinic-protester level conservative. So all is sort of well on that front.\n\n I know this isnt my fault, and that I need to just look ahead and never backwards. Will be hard because hes been my close friend since middle school. But I know Ive been through some crazy abusive shit in the past, and have always recovered after time... This just feels like the ultimate betrayal and I'll be checking out all the sources you all left to go to therapy. Thanks! It has helped me immensely to read all of this confirmation and support.",
    "title": "Boyfriend wanted an abortion, so I got one. Less than a week later he runs to his parents and tells them i got an abortion against his will. Then he told my extremely conservative family, all of this without my consent. What can I do?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1514142480,
    "score": 5154,
    "keyword": "man doctor"
  },
  {
    "text": "In 7 hours I went from \"bad period cramps\" to pregnant to emergency surgery and a lost baby. Trying to process. Hey there, I didn't know where else to post this so here I am ladies!\n\nSince Tuesday I had been having terrible cramping, everybody told me it was period cramps so I tried to ride it out. \n\nYesterday I just had a bad feeling about it and went to the ER around noon. They did some blood work and told me I was pregnant, to which I responded \"shut the fuck up\". I'm a single mom and definitely wasn't trying for this. I have a friend with benefits (let's call him Tom) that I've been hooking up with so it was obviously his. I panicked. \n\nThey then did an ultrasound and the ER doctor told me it was ectopic pregnancy, and my tube had burst which explained the pain and bloating I was feeling. I was bleeding heavily and they needed to operate immediately. \n\nFrom there it became a rush to make sure I didn't crash, and to get me in the OR as soon as possible. They told me they were pushing to get me to the front because everything could go from stable to bad very quickly. It was terrifying. I cried a lot just from the rush of all the information. \n\nWithin 7 hours of checking into the ER I was being discharged. Now I'm home. And just feeling a bit numb from it all. I have a very dark sense of humor so I joked with Tom that the baby was trying to kill me and stuff. But it's hit me hard now that it was a baby, my baby, and it's gone. And that's been really hard to process. I didn't even know I was pregnant 24 hours ago. \n\nI don't know if we would have kept it, neither of us are in a position to have a child, much less together, but I feel robbed of that choice and that's hard to cope with. And to make matters worse Tom is the kind of man who shuts down when he gets stressed and overwhelmed, so he's totally gone dark on me. He keeps saying all that matters is that I'm okay and how I'm doing, but I know that this was also his baby too. I feel like I robbed him of something. \n\nSorry this is so ramble-ey. Just the rush of finding out I'm pregnant, then finding out I'm not, then the fear of surgery and trying to come to terms with the potential (even though it was small) of things going wrong and not waking up again. It's been a crazy 24 hours. And now I just feel alone. \n\nThis probably sounds stupid, but i feel this desire to mourn the baby, and I don't even know where to begin. \n\nThanks for listening ladies. I just needed to get it out. \n\nTL;DR feeling crippling isolation after a surprise ectopic pregnancy that burst my tube and undergoing emergency surgery, all in a 7 hour period. \n\nEdit: this got way more responses than I expected. I'm overwhelmed by the love and support I feel from you all. Thank you so so much. This has been such an isolating experience and you lovely strangers have helped me find so much more peace and solace than I thought possible. I can't thank you enough. \n\nI'm going to definitely focus on taking care of and loving myself. Every part of that night was a rush of emotions, from finding out I'm pregnant, to finding out it's not a viable pregnancy, even the whole coming to terms with the fact that I was being put under and something could go wrong and I may never wake up. And I need to cope with it, all of it. \n\nFor now I'm just so thankful to be alive, and home. And everything after that is just a blessing. Whatever happens to my friendship with Tom, it's okay. I will heal with or without him. \n\nThank you again everybody. You don't know how much your messages and comments have meant to me.",
    "title": "In 7 hours I went from \"bad period cramps\" to pregnant to emergency surgery and a lost baby. Trying to process.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1502576699,
    "score": 1176,
    "keyword": "man doctor"
  },
  {
    "text": "Why do people practice medicine like this? 60 something year-old man is brought to the ER by his family with 3 hour history of worsening left arm weakness. He had a CVA after CEA at OSH 10 days ago. His stroke was not treated at that time. His imaging from that hospital stay were transferred from the OSH. As soon as he hits the ER, he gets a head CT, CTA head. Orders are also put in for an MRI head, before any of the aforementioned exams were even completed. No physician has evaluated him yet, but both CT exams are performed. I read both. Remote right frontal infarct reidentified, along with two sub-acute infarcts that were already known about. No other significant finding. About 23 minutes after he leaves the scanner -not exaggerating- three additional requests are made: 1. Non-con CT head, 2. CTA head, CTA chest. I call the NP who put orders in (still no physician has evaluated him). She says he \"crumped\", requiring intubation. Said she needed to rule out new stroke, bleed, etc, as well as PE. I asked her if she really thought that in the last 23 minutes since his last exam he had a new infarct, hemorrhaged, or threw a PE!! And if she could maybe decide which of the three it might more likely be. She can't say, but she's sure it's one or the other (WTF?). Anyway we do all three exams.  All negative except for the aforementioned  strokes, no significant interval change in 23 minutes (surprise!). \n\nThis shit is the reason the medical system in the United States will crumble. The complete lack of clinical judgement, blatant disregard for costs, and unwillingness/inability to apply even a little common sense. Occam's razor goes a long way in solving most problems.  This one patient was imaged a total of 8 times in the emergency department tonight alone, and probably will get an MRI overnight. On top of god knows how much imaging related to his surgery and strokes at OSH. \n\nCan anyone tell me why people abuse radiology so much? I'm not crying - I don't mind reading the extra scans they're often basically normal or unchanged from the recent comparison which was also unjustified. But seriously what is the reason that doctors don't sack up and practice medicine without the crutch of a having a radiologist tell them what they already know?",
    "title": "Why do people practice medicine like this?",
    "subreddit": "medicine",
    "timestamp": 1510983758,
    "score": 197,
    "keyword": "man doctor"
  },
  {
    "text": "UPDATE: How does a doctor married to a surgeon make it work? Having a lot of trouble these days. Original post:\nhttps://www.reddit.com/r/medicine/comments/55b04m/how_does_a_doctor_married_to_a_surgeon_make_it/\n\nFigured I'd update given the surprising interest in the topic.\n\nSo as it often happens - things got worst before they got better-ish. My partner decided to take on even more duties, deciding to become involved in teaching. He would now come home from work and be making powerpoint presentations and stressing over interactive cases for medical students. I continued to feel lonely and isolated - I'm one of the few female anesthetists at my institution so finding girl friends has been really hard. I've tried to maintain my hobbies, but at some point, you get tired of being alone all day.\n\nFinally, I hit my last straw - we had a huge falling out one Friday night about a month ago and I ended up spewing all my feelings and then some. I had planned to sit down and discuss my concerns with him in a calm and reasonable manner but that all fell out the window. I ended up asking him to stay with a friend for the weekend, as I was just too upset and didn't trust myself to not further antagonize the issue.\n\nAfter the weekend apart, we both cooled down and sat down and had a reasonable discussion. He agreed he was taking on too much, but he also felt like he had no other choice, as this seems to be the expected status quo among his peers. After lots and lots of talking, he agreed he'd sit down with his supervisors and see if he could at least drop the graduate degree he was pursuing. \n\nIt was a step in the right direction - he's put his grad work on hold for now, but has replaced some of that free time with medical education pursuits. His justification is that to work in an academic centre as an orthopod, he needs all the advantages he can get. I can see that it does make him happy - he was inspired by a great mentor and wants to pay it forward to students and I find this admirable.\n\nWe've instituted mandatory date nights and that's really helped. I've also joined some classes and clubs to expand my own social circle - I definitely feel like over the years, I've become dependant on medicine to provide me with all my sources of entertainment, including a pre-made social circle, so I'm trying to move beyond that. So there's improvement and I think that's all I can ask for at this point!\n\nEarlier this month, he stared hinting at marriage - just comments like \"oh that would be a nice place to get married\" or \"we could take our honeymoon when I finish X project\" . It's been in the conversation before and I think we both knew the relationship was heading there. Part of me wonders, rather naively I'm sure, if this is a sign of his commitment to further working on the relationship - I have always said that I wanted to get married once we'd \"settled in\" to our careers and I wonder if he's hinting that he's nearing that point? Another part of me wonders if its terrible timing - almost an appeasement to my unhappiness? I've had these discussions with him, but I find I always come out of the conversation still unsure of how I feel. There is no question I love the man, just not sure how this would work with kids and marriage! \n\nAt the end of the day, if I can offer any piece of advice to those married to a surgeon - be prepared to have it take over your life too in some ways. In anesthesia, my colleagues and I will always say how we love being in the OR but are so happy we're not surgeons - but being married to one means you still get the surgery lifestyle encroaching on your own! I love my partner and that makes it worth it but it presents a unique set of challenges that doesn't just disappear once residency is done!",
    "title": "UPDATE: How does a doctor married to a surgeon make it work? Having a lot of trouble these days.",
    "subreddit": "medicine",
    "timestamp": 1485471683,
    "score": 122,
    "keyword": "man doctor"
  },
  {
    "text": "Lost another doc to depression This one was also a family member: a cousin who was just finishing his residency. In the med school I am associated with, it's the second trainee suicide this year (earlier was a student, and now a recent graduate)\n\nI don't know what I'm looking for here. I think I already have a pretty good feel for what we're doing wrong. Anyone who's seen a colleague, especially a trainee, suffering from depression and needing help knows full well how the gossip goes. I'm sick to death of having to defend trainees who need time or help, to associates who can't seem to understand that needing help isn't weakness and taking time to recover from illness doesn't impact your ability to practice.\n\nWe can be bad even about organic illness, but in residency I had two health problems. One was organic, and I had a single minor hiccup in getting it dealt with. The other was mental health (postpartum depression) and I had to skirt close to legally threatening a preceptor who found out and seemed to think it was somehow not just her right but her duty to report a transient health issue to the residency program (despite it having been resolved a few months earlier, when I sought and got appropriate help during my parental leave).\n\nWe suck at this. If anyone has any insight into how to make us suck less, I'd love to hear it. I'll bring it up to those who might be willing to listen after the losses we've suffered.\n\nGonna miss you man. You were an amazing doctor, a good man, and it should have been you explaining the medical details of family tragedies to your sister. For some reason, that's the part that is making me tear up the most.",
    "title": "Lost another doc to depression",
    "subreddit": "medicine",
    "timestamp": 1507219167,
    "score": 100,
    "keyword": "man doctor"
  },
  {
    "text": "Has medicine made me unable to grieve? Hey Medicine,\n I want to use a throwaway because I feel a bit ashamed.\n\nI'm a junior doctor.\n\nRecently a member of my family passed away who I was very close too. It wasn't a surprise to me, he was old and unwell and I have seen the decline he went through in many patients over my time studying and working.\n\nI'm worried because I haven't really felt the grief that I've felt in similar situations before I did medicine. I haven't cried, I haven't really felt bad. In fact I've felt a kind of contentment because in my experience the way this man died was actually quite lovely, with his children around him, relatively quickly, without pain and without loosing his mind.\n\nI guess I often worry whether I'm a bit of a psychopath, I need to empathize daily patients, I wonder whether I actually just fake my emotions.\n\nWhat do you think? Has anyone been through a similar thing?\n\n\nEdit: Thank you all so much for leaving your lovely messages. I'm feeling a lot more normal now. Thank you.",
    "title": "Has medicine made me unable to grieve?",
    "subreddit": "medicine",
    "timestamp": 1492311701,
    "score": 14,
    "keyword": "man doctor"
  },
  {
    "text": "Can I open a practice that only bills Workman's Comp for new cases with established patients of mine? Or is taking WC all-or-nothing? I'm planning on opening a direct primary care (DPC) practice that is subscription fee for service, and does not take insurance, private or government. I plan to formally opt out of Medicare. Think what you will of my choice, but I am not here to debate or defend it today. If you can't get past this choice of mine, please don't reply.\n\nI have a problem with Workman's Compensation, but not totally. I think such a thing should exist, and if an established patient of mind happens to suffer legitimate and demonstrable injury on their job, I'm not against billing and documenting for WC. My problem is with patients establishing care with me and bringing an old WC case with them, especially if this is one of their main or only reasons for establishing with me as their PCP. I've been burned, and burned up, by a number of these cases. By the time the patient is putting WC forms in front of me to sign, it's often far from clear to me how disabled and unable to work they currently are, or ever were. Some people who simply don't want to work anymore benefit from and maximize this obfuscation. Even if their claim to disability is (or was) legit, the fact that they're picking a new PCP who wasn't there when everything went down raises an eyebrow. I know that if I was legitimately injured and disabled on the job and claimed WC benefits, and had a caring PCP who'd been with me since I first made the claim, I'd stick with him/her at all costs. I'd *maximize* continuity of care, and if something like a move made this impractical, I'd have my paperwork in order to make it as easy and clear to my new PCP what went down.\n\nOne of the cases I dealt with which finally made me leave my most recent job involved a patient with an old WC claim, where he'd hopped around between PCPs for the whole case. Clearing up the ambiguity in his case would have required hours and hours of reading over old notes and making calls to old doctors of his. As if this wasn't enough, the patient was not at all clear in communicating his wishes or reasons for establishing care with me, and was just a nasty, angry man in general. I ended up filling out a disability insurance form for him which indicated he was good to work, which from my H&P on him didn't seem wrong at the time. This ended up derailing a whole lawsuit he had going against WC, and he raised hell with me and my practice. I'm amazed he didn't sue me. Factoring in the time and sweat equity I spent trying to fix this situation, I don't think I made minimum wage on his case. As if that wasn't enough, my practice was angry with me for the hell that came their way from this patient, and basically told me, \"Stop not giving our paying customers what they're looking for!\" I decided right then and there: eff Workman's Comp. Or at the very least, eff taking on old WC cases.\n\nMy question is, can I make it a policy at my new practice that I will not bill WC for old cases I didn't originally help them file, but I am willing help established patients of mine file new ones? Or does being willing to bill and document for WC bind me to some obligation to take old cases that come to me for help? If there's a chance I might run afoul of WC's rules, I may just decide to say that I don't bill WC at all.",
    "title": "Can I open a practice that only bills Workman's Comp for new cases with established patients of mine? Or is taking WC all-or-nothing?",
    "subreddit": "medicine",
    "timestamp": 1501019601,
    "score": 2,
    "keyword": "man doctor"
  },
  {
    "text": "Legal Torture Part of being an ICU nurse is having to discuss the dirty acronym 'DNR' but to me, it's not dirty, it is freeing. Before I became a nurse, I never would have thought that telling the doctors and nurses taking care of my sweet family member to stop saving their life could be a good thing.\n\nIt's never an easy decision, but a necessary one.\n\nToday I took care of the man in room 5. Before his surgery, he was an active man, former military. He has many grown children. He came into the hospital over 90 days ago with a large aortic aneurysm. During surgery, they found that the old stent in his aorta from a previous surgery had slipped down and occluded blood flow to his two renal arteries. His kidneys were basically dead. They also found that due to other complications, his gut was dead and infected. The family was updated on his poor prognosis. The surgeon brought up to the family the need to discuss stopping life saving measures. The devastated family of this sweet man were outraged and said that is not going to happen.\n\nHe was transferred to room 2 in CVICU and 3 days later, he coded four times in one day.\n\nThis poor man is essentially brain dead now. He breathes through his trached ventilator. He does not make any urine, but gets dialysis every other day. He's on several blood pressure drips that are very harmful to your arteries and veins. He has infection all over his body. His skin looks like it is rotting off. He has 4+ pitting edema because his kidneys aren't filtering any fluids or toxins, so if his blood pressure isn't stable enough for dialysis one day and he misses, his tissues become invaded with all the fluid his vessels can't hold.\n\nWith each breath, his whole head moves to the side, his ribs retract and his belly bounces.\n\nEvery shift, the nurses have to change his countless dressings. He has pressure wounds and shear tears all over his body. Not from negligence, but a sign from his body that he is falling apart.\n\nThe neurologist says it's unclear whether or not he can hear us or feel pain.\n\nHe's been in this room for way too long. 90% of which he has been like this. His family still refuses to make him a DNR or \"Do Not Resucitate\"\n\nThey think there is some kind of chance we can fix him even though we have exhausted every possible measure.\n\nThis is my third day in a row to have this man and it's painful to even walk in the room. The family hasn't even come to see him in a week.\n\nHe starts coughing so I begin to in-line deep suction him through his tracheostomy. Blood comes through the suction line. I look to his face and see tears rolling down his expressionless face. \"I'm so, so sorry..\" I tell him every time I have to suction him.\n\nHe smells awful. I've already bathed him, cleansed all his wounds and changed his dressings. It is a smell of the overwhelming infection that has taken over his body that the IV antibiotics cannot fight fast enough. Another nurse and I turn him to the side and my hand presses into his skin like play-dough and my hand impression stays there for several minutes. I take off the dressing on his bottom and his fragile, thin skin tears off with the tape. The other nurse pets his head. The neurologist said it's unclear if he can feel pain, but I've taken care of him so long, and I think he can.\n\nAnytime a doctor, nurse, or even janitor comes into room 2 with me, it is never our usual chit-chat. It is a solemn silence only interrupted by need-to-know information.\n\nThis is what legal torture looks, feels, and smells like.\n\nPlease, tell your family your wishes or make an advance directive outlining your wishes regarding end of life.\n\nMaking someone a DNR is hard, but it frees them of the tortures of life saving measures.",
    "title": "Legal Torture",
    "subreddit": "nursing",
    "timestamp": 1501707169,
    "score": 292,
    "keyword": "man doctor"
  },
  {
    "text": "Pleasantly confused patients I'm having a rough night and I need to hear funny things your pleasantly confused patients say. Here's some of mine:\n\n* patient set off her bed alarm shifting around in bed. When I went in to turn it off, she pointed to a pillow on the window sill and told me to hand it to her. She puts it up to her face and says \"hello?\", then hands it to me and says \"I think it's for you\"\n\n* same patient kept asking me where she should hang up her \"new decorations that she just bought\". I asked her what decorations. She pointed to the IV pumps\n\n* patient swore up and down that he and I grew up together. He was 89, and I'm 23. \n\n* patient started freaking out in the middle of the night because he thought the cord for the mouse was a snake. I had to unplug the mouse and \"wrestle\" it out of the room before he would calm down. Afterwards, he told everyone how brave I was \n\n* patient needed a new IV and needed to be held down (needles made him a little antsy). He accused all the nursing staff of being part of the \"kangaroo posse\". He would salute me whenever I entered/exited the room for the rest of the night \n\n* code grey for tornado like weather. Patient refused to go out into the hall, and told me to tell the tornado to \"stop being a pussy and face him like a man\"\n\nEdit: I survived the night (god bless doctors who prescribe PRN Haldol) but you all helped! Now it's time to sleep and do it all again tonight 😴",
    "title": "Pleasantly confused patients",
    "subreddit": "nursing",
    "timestamp": 1493792701,
    "score": 185,
    "keyword": "man doctor"
  },
  {
    "text": "I did it - story of the ultimate con That's it boys, I realized my kid's dream. As someone pointed out in this very sub a couple hours ago, there are not many place where you can brag about such achievements, so here is my story of how I made Google believe I am a skilled software engineer.\n\n**Why?**\n\nI have always loved programming, but when I was a student I thought it was for losers, and I wanted to learn physics. Physics is great, I don't exactly regret learning it I spent a great time at my university. But when I worked on my PhD I realized that research is boring and that I hate being a scientist, I am an engineer. I also realized that programming is the best engineering activity there is, with the fastest feedback loop possible, you can build awesome things incredibly fast. And I was in love with Google's philosophy (granted it was 15 years ago, but I still believe there is such a thing). So I switched to programming as a professional activity.\n\n**Learning how to code**\nI thought I knew how to code, I found a job very quickly and they asked me to write programs on my own. I did, it was not bad, but mostly I was pretending, spending half my day on Google/Stackoverflow, reading books. The best thing that happened to me was when a real programmer joined my team, showed me how to use SVN, how to write templates in C++, how to remove all the comment and replace it wit readable code. I spent 2 years in my first company, but unfortunately I did good and was promoted to project manager, which is a terrible job and I quit a few month after that.\n\n**Learning how to code, again**\nI spent 6 years in a research laboratory, officially doing electrical engineer things, but I chose to do only software. That's the kind of deceptive human being I am, and they fell for it. I made robots talk to each other, camera stitch their environments, I helped medical doctors use the algorithms written by real doctors. And I learned a lot, I read many books, I followed courses on MIT Opencourseware, on youtube, on Coursera.\n\n**The bait**\nEvery year, I participated to Google's codejam. The first time I didn't manage to go passed the qualification round, but I went on and trained and improved my competing skills, now I can confidently go the the round 2 although I never made it to round 3 (and probably never will). This is how their recruiter got my number. \n\n**The recruitment**\n4 years ago they asked me if I would be interested to join Google. I was absolutely not prepared and I declined, but that made me think that I would really want to work in the industry. So I started applying here and there in real tech companies. I was almost hired a couple time, declined a couple offers that I couldn't accept for financial/family reasons, and 2 years later Google contacted me again. This time I accepted, bought CTCI and Elements of Programming Interview (this one is far superior in my bragging opinion), spent 2 hours per day practicing interview questions, and passed my first round of real interviews at Google. Thatb went well, but eventually they had difficulty finding a team for me, especially given the fact that I am obviously not a software engineer since I never worked as such, and I was rejected by the VP board (the last stage of their recruitment process).\n\n**Joining the industry**\nI finally managed to find a job in the tech industry. This past year, I have been working with awesome software developers, in a great startup, building an amazing product where I am doing image processing stuff and machine learning computation and all that. I learned a lot, again. This thing is endless, it seems.\n\n**Second interview**\nIn January I asked my recruiter at Google if I could reapply. She kindly accepted, and I went through the process again. You know the drill: Whiteboard, whiteboard, whiteboard, and some more whiteboard. I know the drill. Nailed it. This time with my small but significant experience in the tech world, I had no trouble finding a team. They sent me an offer. I fooled them, they really believe I am a talented software engineer. This was a long con. It was not easy, but man it was fun. I can't wait to join their team and see how much I have to learn still, and how long it takes them to realize.",
    "title": "I did it - story of the ultimate con",
    "subreddit": "cscareerquestions",
    "timestamp": 1488478990,
    "score": 5,
    "keyword": "man doctor"
  },
  {
    "text": "Semi-complicated question about getting into a CS career without a typical HS diploma This question is going to have to involve a lot of background, so prepare for quite a bit of text.\n\n**TL;DR: Life keeps throwing me curveballs, and despite stellar grades I'm two years behind for graduation. Is it possible/feasible to get a career in software development without a formal high school diploma? If so, how would I go about pursuing that?**\n\nI'm 18 years old, and I want to go into a tech job. While I'm not entirely picky on what specifically I go into, I know I am both good at and genuinely enjoy programming- my stepdad raised me, and seeing as he's a software developer I grew up with exposure to it, at age 10 or so I was already studying Python to learn some basic logic.\n\nUnfortunately, around age 12 my parents separated, and since then my life has seemed determined to screw itself up as much as universally possible. I'm now considering dropping out- not to give up and work a minimum wage job, but as a genuine option.\n\nBasically, I have had issues with public schools and the general American education system since 1st grade. I have ASD (autism spectrum disorder), and while I am plenty intelligent and capable, my brain doesn't do well with environments that most kids would've flourished in, and until I learned how to successfully imitate normal socialization, the other kids thought I was a bit odd. I switched schools at the end of 2nd grade. Then again at the end of 3rd. Then again, at the end of 4th, and 5th, and 7th, and 8th. Keep in mind, my issues have never been grades. I'm a straight-A, honor roll student. The issue for me was bullying and the general school environment- in 5th grade, I threatened suicide if my parents made me go back, and to this day I have nightmares about the bullying I went through and the way the administration handled it. (I didn't go back, incidentally- I finished 5th grade through independent study, and then 6th and 7th were completed through online homeschooling.)\n\nIn high school, I was doing okay for a record amount of time- 9th grade went amazingly, and about half of 10th did as well. Then, of course, because I was doing so well emotionally, my physical health had to fail. I spent the remainder of 10th grade in and out of the hospital, and was held back. It took about 2-3 years to figure out what was wrong with me and fix it- the anti-depressants I was on were making my body sick from serotonin overdose, and of course coming off of them gave me suicidal depression due to some major chemical issues in my brain.\n\nDuring that time, the school administration sucked. They tried suing me for truancy- yes, I was definitely skipping school so I could go hang in the hospital with IV lines. Super fun time, 2 kool 4 skool man!! Eventually, when we got a legal letter from the doctor saying I was NOT skipping school (Apparently, the dozens of doctor's notes were not good enough), they funneled me into the Florida Virtual School program. Uh, yeah, even kids who aren't chronically ill can't pass that program- the curriculum is notoriously horrible. I was in all AP classes prior to getting sick, and even I could not handle that workload. So, I got held back. I was now 1 year behind.\n\nNext year. We finally pulled enough teeth from the school board to get me into the Hospital Homebound program. This is supposed to be an independent study program like the one I did in 5th grade- but oh, no. This was just virtual school again, but with a tutor sent once a week to assist me. I worked like crazy, and managed to pass the year after working through weekends, breaks, holidays, and the summer. I didn't even finish all the material- the school board just gave me credits after the tutor attested to exactly how hard I was working.\n\nThe school board continued to give me issues repeatedly, the meanwhile I was working on how to combat my depression without Zoloft- to date, I've been on at least 5 different medications, have been hospitalized so many times that people raise their eyebrows at me when I can't remember the exact number, and have been seeing a therapist for a VERY long time. I'm considered a 10th grader by the school system, however I am in 11th grade classes, and am set to graduate in 2019... my original graduation date should've already happened, in this past May. All my friends from freshman year are now in college.\n\nI have tried every single option the district has offered. Partial schedule, where I go in for a few classes a day. Virtual school. They won't provide Hospital Homebound to me since I'm not considered incapacitated enough for it anymore, even if I wanted to go through that again.\n\nCurrently I'm about halfway through the equivalent of my junior year, and it's miserable. I sit through 5 classes a day, and every single one of them feels useless. I'm in honors, but I still finish about 30-40 minutes before everyone else does, leaving me to sit there and stew in my thoughts, not being allowed out of class to do anything more productive. Due to diagnosed PTSD from all the crap I went through with school as a kid and my autism-related anxiety when I don't have anything to do, over half of every day I'm in school ends in a meltdown. You know that meme, autistic screeching? Well, I don't scream, but I end up leaving class and sit in a guidance office for about half of every day crying and unable to physically get myself to speak more than a couple sentences out loud.\n\nTeachers refuse to read my 504, guidance refuses to listen when I say no, I can't go to class right now unless you do want me literally screaming under a desk. I was sent to a mental hospital during one of these incidents- they literally dropped me in with a bunch of suicidal kids, and I was there for 24 hours in living hell (Florida youth mental healthcare is NOT beneficial- it's more like a prison) before a psychiatrist finally realized I didn't need to be there.\n\nI do not think I'll be able to continue like this for another year and a half. I'm not learning anything, I'm sitting there listening to a teacher lecture me on things for an hour that'd take me 15 minutes to learn on my own on places like khanacademy. If I dropped out today, I am completely confident I would be able to study for and pass a GED test by the end of the 2017-2018 school year.\n\nI've done lots of research, but unfortunately most of what I find focuses more on a lack of a college degree than a high school diploma- from what I have gathered, it is entirely feasible to get hired without a degree if you build a portfolio, which is what I am currently working on. But next to nothing has any real information on dropping out of high school.\n\nI want to do something with my life, and that's not happening right now. I'm taking mindless tests and writing mindless essays that don't feel like they're benefiting me aside from getting me baby-steps closer to a piece of paper. I want a job, I want to get to doing what I have a passion for. The only reason I'm still in school is for that piece of paper, but if I don't truly, absolutely need it, then I am wasting my time and going through hell for nothing.\n\nSo- is dropping out a real option for me? Does anyone have any recommendations on how to move forward and get a career, if so?",
    "title": "Semi-complicated question about getting into a CS career without a typical HS diploma",
    "subreddit": "cscareerquestions",
    "timestamp": 1513199255,
    "score": 1,
    "keyword": "man doctor"
  },
  {
    "text": "Software dev vs. ABET Software eng before I get too committed. Here's my situation. I'm two years away from graduating with a software development degree from Champlain online. It's fairly reputable in the cybersecurity realm if nothing else. It is a private non-profit that is regionally accredited (i.e., not a diploma mill). The degree program itself is newer and seems to focus on preparing graduates to be project managers for software projects because it has quite a few accounting and management classes.\n\nI have a couple of concerns\n1. What makes a company want to hire me over a programmer that has been with them a while and shown some leadership experience?\n2. Is 'software development' a poor man's software engineering? Would I be better off transferring to Arizona State's ABET accredited program? Or is this degree the health care management of the software world, where those specialists have replaced senior doctors in management?\n\nLooking at the curricula, the software engineering degree has a large focus on high level math instead of the (more practical?) project management/business courses.\n\nMy situation forces me to go online as I have an unrelated career that is geographically isolated where I do programming to make my shop's job easier but it's not a primary duty I could claim tons of experience from.\n\nAny thoughts?",
    "title": "Software dev vs. ABET Software eng before I get too committed.",
    "subreddit": "cscareerquestions",
    "timestamp": 1499898161,
    "score": 0,
    "keyword": "man doctor"
  },
  {
    "text": "so i just got let go... EDIT - this post ended up being pretty long so let me summarize up here. I have 5 questions.  \n\n&nbsp;  \n1. Would it make sense to go back to Corporate Accounting for a year or two to strengthen my Accounting skills, in order to do better as a Financial Analyst in FP&A?  \n2. Can anyone recommend a few accounting courses, ideally free MOOC courses, though it doesn't have to be restricted to that?  \n3. As a CMA I've never done auditing. How valuable is that? Can I learn some important skills just by an auditing course? Can anyone recommend one? I haven't been able to find one.  \n4. This isn't the first time I've been fired and part of me suspects there's something else going on. I do have ADD and a doc for that, but haven't made any progress with that. Might there be other things at play?  \n5. Are there any kinds of Accounting simulations / real world courses I can take, that might help me do better at work? Courses in university teach basic skills but there's very little similarity to what is actually done at work, such as learning new reports and using advanced Excel skills.\n\n----------------------------------------------------------------\nOriginal Text:\n\n&nbsp;  \nTo start off with I'm a CMA in Canada with about 6 years experience.\n\n&nbsp;  \nI just got let go from my job as a Financial Analyst. Sucks man! What to do. It was on pretty good terms thankfully. My boss told me I'm very dedicated to my role and there's no personality conflict with anyone. I just don't have the solid foundation for this role.\n\n&nbsp;  \nI'm not clear as to how she came to that conclusion but one of the things she mentioned was that I don't seem very clear on what accruals are. I do actually know what they are, but in her defense, I didn't know the concept until about 15 months ago when I was working as a Senior Financial Analyst. I dont know how I got through the previous years without it coming up but it never did. And I dont know what I dont know, so I never knew there was a gap. Not sure what the CMA program is doing wrong and what other skills I'm missing.\n\n&nbsp;  \nNow my boss suggested that I take a job that's a few positions lower and get more comfortable with corporate accounting duties, journal entries etc etc. I'm thinking of doing that but I did want to also ask if that actually would make sense? My last few roles have been FP&A roles and I don't know that Corporate Accounting jobs would actually make me a stronger Analyst. I realize the initial assumption is that of course it would, which I assumed as well. But upon second thought I don't know that it would. Can anyone share their thoughts?\n\n&nbsp;  \nAlso, I should probably take a few courses to make sure I know everything I need to know. I have no intention of doing an entire designation again. But I wonder if there's a few courses I can take (ideally free MOOC courses) that might cover most of what I'd need to know. I find that 90% of one's education never comes up at work so I don't think its unrealistic that a few courses might cover most of what I need.\n\n&nbsp;  \nAs a CMA I've never done auditing. I hear its a shit job; but I've often wondered how valuable it is? In my mind it would be very helpful but I really dont know. If it is, would a course be helpful in it? I don't see how I can get a job in it since I have no experience whatsoever in it.\n\n&nbsp;  \nThis is not the first time I've been let go so a big part of me suspects this isn't actually a lack of experience / basic accounting skills as something else that's 'wrong'. I'm not sure what that is. I do think I'm pretty smart all told but I do sometimes find myself not grasping something as well as others might. I do have ADD and have a doctor for that but it's been fairly pointless as none of the meds have helped. I dont know what advice I could get on this on an Accounting subreddit but if anyone does have some thoughts they could share on this I'd be grateful. \n\n&nbsp;  \nAnd lastly I wanted to ask - are there any kinda classes / courses / seminars that might have real world accounting simulations? University accounting courses as fine for teaching the underlying principles but there's very little similarity between that and the real world. At work it's more like using Excel, creating or working within a report that I've never seen before, doing an assignment on that. Are there any such simulations of what someone might ask for in the real-world, maybe something that would simulate what the first week or two in a new job might be like?\n\n&nbsp;  \nSorry for the wall of text! I know I asked a lot of questions here. Would be grateful for any advice as I keep stumbling here and I need to figure out what the hell to do about my career.\n\nThanks guys!",
    "title": "so i just got let go...",
    "subreddit": "Accounting",
    "timestamp": 1485904407,
    "score": 26,
    "keyword": "man doctor"
  },
  {
    "text": "Netflix Picks For The Holidays **Action/Adventure**\n\n* Crouching Tiger, Hidden Dragon: Sword of Destiny\n* Doctor Strange\n* Everly\n* Frontier\n* The Hateful Eight\n* Luck-Key\n* Monkey King 2\n* The Prison\n* Punisher\n* Wheelman \n\n**Comedy**\n\n* Archer\n* Blazing Transfer Students \n* Brickleberry\n* Don't trust that Bitch in Apt 23\n* F is for Family\n* Good Morning Call\n* The Good Place /u/senattyrice\n* Grace & Frankie\n* How the Grinch Stole Christmas \n* Kentaro: The Sweet Tooth Salary Man\n* Love\n* Naked /u/the_undine\n* Neo Yokio\n* New Girl\n* Shameless\n* Seeking A Friend For The End Of The World\n* She's gotta have it /u/tropfou\n* Trevor Noah: Afraid of the Dark\n* Unbreakable Kimmy Schmidt\n* White Chicks \n\n\n**Documentaries**\n\n* Beauties of the Night\n* The Black Panthers: Vanguard of the Revolution\n* Conspiracy\n* The Death & Life of Marsha P. Johnson\n* Diana: In Her Own Words\n* I Am Ali\n* I Am Bolt\n* Mala Mala\n* Paris is Burning\n* Strike A Pose\n* Time: The Kalief Browder Story\n* What happened, Miss Simone?\n\n\n**Drama**\n\n* Black Mirror - December 29th \n* Blame! \n* Burning Sands\n* The Chosen Ones \n* Criminal Minds\n* Dark\n* Dexter \n* Divines\n* Erased - December 15th\n* Gerald's Game\n* The Get Down\n* Glitch\n* The Great Gatsby \n* Heathers\n* Luther /u/midasgoldentouch\n* Mindhunter\n* Mudbound \n* The OA\n* Other Life\n* Queen of Katwe\n* The Returned \n* Urban Hymn\n\n**Horror/Thriller**\n\n* 13 Cameras\n* Anguish \n* A Christmas Horror Story\n* Cube\n* Exam\n* The Eyes Of My Mother \n* Hard Candy \n* The Invisible Guest\n* The Invitation \n* It follows\n* ~~Meet The Trumps~~\n* Office\n* The Ones Below\n* Temple\n* Unborn\n* Verónica\n* Visions\n* The Void\n\n**Sci-fi/Fantasy**\n\n* The 4400\n* Arq\n* Automata\n* Continuum\n* GANTZ: O\n* Harlock: Space Pirate\n* Helix\n* Hemlock grove \n* iBoy\n* The Magicians\n* Spectral\n* Stranger Things S2\n* Terminus\n* Travelers\n* Van Helsing\n* Wynonna Earp",
    "title": "Netflix Picks For The Holidays",
    "subreddit": "blackladies",
    "timestamp": 1513094741,
    "score": 1,
    "keyword": "man doctor"
  },
  {
    "text": "My wife was charged with assault today. And forcible confinement. I put up with the abuse for around 5 years.  She has provoked me into physically defending myself more than once andd it paralyzed me with fear that she could convince the authorities that I was the aggressor.  \n\nThings of course escalated over time, being undealt with.  She started threatening to call the cops\n\nWhat broke the camels back is over mothers day weekend she started drinking and called our daughter an \"attention whore\" within earshot.  Our daughter is 4 and my angel, my pride and joy.  I told her to go fuck herself and went to the shed, then a few minutes later went in to grab a beer and then go sit outside to cool off.  She went ballistic that I took another beer and ended up pushing me and biting me with our daughter in my arms.  \n\nI went to the hospital earlier today to have them look at a bite mark she left on me and to report the incident.  The FEMALE doctor said \"that's assault you know,  you should consider contacting the police. My husband is an officer\".   I ask her - wouldn't be just be my word against hers?  She says \"No, I've seen it and the police will take pictures.  The police will make a judgement call.\"   I then went to the police and showed them the bite and that she was blocking me from leaving the house and ended up shoving and biting me.  \n\nLong story short guys - Don't hesitate to contact the police if you have been assaulted.  Even if you've just been FORCIBLY CONFINED, contact the police.  It is illegal to block someone in a room and not let them leave.  This evokes your right to physically defend yourself, meaning you have the right to push them out of the door to get out, within reason.  You can't purposefully cause injury but you most certain can push them back out of the way and even restrain them if they start assaulting you for trying to escape.  Assault simply means pushing, shoving, body-blocking, etc.  Anything a man would never get away with towards a woman really does apply to us also.   YOU MUST CONTACT THE POLICE FIRST.  The female doctor said I should before the situation gets redirected back on me - because if your abuser contacts the police first because they feel you are about to report them,  you could very well be the one in handcuffs instead of them. \n\nedit: a word",
    "title": "My wife was charged with assault today.",
    "subreddit": "MensRights",
    "timestamp": 1494900545,
    "score": 168,
    "keyword": "man doctor"
  },
  {
    "text": "Mansplaining is Simply Men Speaking. I couldn't stop laughing at this. Apparently if a man with a M.D. explains the necessity of getting patients moving post-op to a woman with a Master's degree...that's mansplaining. \n\nI'm guessing that in her mind her two-year graduate degree trumps his doctorate in medicine. \n\nThese women are nuts.\n\nhttp://www.scarymommy.com/men-stop-mainsplaining/",
    "title": "Mansplaining is Simply Men Speaking.",
    "subreddit": "MensRights",
    "timestamp": 1508812694,
    "score": 154,
    "keyword": "man doctor"
  },
  {
    "text": "Feminists oppose men's sexual freedom This web site is named the Campaign Against Sex Robots, but its title should be the Campaign Against Men's Sexual Freedom.  Companies like Real Doll have for years sold realistic looking sex dolls for men (and some women) who want an alternative to the real thing.  They're essentially high-end sex toys.  Now Real Doll, and several other companies, are at work creating sex robots, which will essentially be animated versions of the silicon sex dolls.  They're not for everyone.  Some people will find that strange, but for some people it may be the only sex or companionship they can get.  Other people who have sex lives might want such a toy to enhance their sex lives.  Maybe a guy has a girlfriend and has always fantasized about a threesome.  A sex robot could provide that without the risk of including another actual person.  The bottom line is if a sexual activity does not force any person to do anything against their will, then it's their business and no one else's.  \n\nHowever, the Campaign Against Sex Robots opposes a man's right to make such a choice, even though his doing so hurts no one else.  They make absurd arguments against sex robots.  They claim that the use of sex robots will turn men into rapists.  It's the same old tired refrain we keep getting from feminist hate groups: Everything is rape.  It's not clear from their arguments if they think that using a sex robot will cause a man to go out and rape a real woman or if they think the robot is getting raped.  First of all, women have used dildoes for decades and they've never caused a woman to go out and rape any man, woman, or child.  Sex robots, as high-end sexual enhancers, will not cause men to do that either.  And it's not possible to rape a robot.  The robot is not a sentient being any more than a dildo is.  \n\nThe truth is that feminists simply hate male heterosexuality.  They've bitched for years over what is totally involuntary about male sexuality: That men prefer young and beautiful women.  That's just the way evolution has made human biology.  You could not change that any more than you could change the rings of Saturn.  You'll have about as much success changing that as religion fanatics have converting gays to being straight.  The irony is religion fanatics are hostile toward male homosexuality while feminists are hostile toward male heterosexuality.  \n\nFeminists hate men who go out socializing trying to find a girlfriend.  Supposedly, it's sexist or feeling “entitled to sex” to look for a girlfriend and ask for a woman's phone number.  \n\nFeminists hate men who don't have a girlfriend.  If you decide “fuck it, it's not worth it” and pursue your own life's goals sans female companionship, you're branded a loser.  \n\nFeminists hate men who pay for sexual services.  Pay your hard-earned money for the services of a prostitute and somehow you're exploiting women, even if it's in a Nevada brothel where all the professionals there do their trade willingly.  \n\nNow feminists are adding a new thing to hate men for.  If you don't do any of the above and instead buy a sex robot, something that hurts no one else and doesn't infringe upon anyone else's rights, they hate you for that.  \n\nThe only thing they won't hate you for is for being a man who has a six-figure income, looks like a model, and works as a doctor.  That's probably something like .004% of the male population.  The other 99 plus percentage of men are worthy of feminist scorn.  \n\nI never wanted to have to fight against feminists, but I will.  They're out to oppress male sexual freedom.  If you want to go MGTOW and just have sex with realistic robots, that should be your choice.  If you want to hire sexual services, that should be your choice.  If you want to stay in the game and search for a girlfriend, that should be your choice.  In all of these, as long as you don't force anyone to do anything against their will, it should be no problem.  However, feminists have a problem with you being anything other than a drop-dead model gorgeous dude who earns 500K as a doctor (or some other glamorous profession).  \n\nShoeonhead has made a great video mocking the hatred of feminists over sex robots: \nhttps://www.youtube.com/watch?v=Z2nOsdj8dmc",
    "title": "Feminists oppose men's sexual freedom",
    "subreddit": "MensRights",
    "timestamp": 1503884202,
    "score": 108,
    "keyword": "man doctor"
  },
  {
    "text": "\"brainwash\" -- norwegian documentary examines how fields like sociology and feminist studies reject actual science because it doesn't fit with their ideology [a quick background from wikipedia](http://en.wikipedia.org/wiki/Hjernevask).\n\nyou can watch the 7-part series [here](http://www.dailymotion.com/playlists/user/BrainwashingInNorway/1). (not safe for work: nudity)\n\neach part is approximately 40 minutes long; i recommend watching #1 (gender equality paradox), #5 (sex), and #7 (nature or nurture) since they are most relevant to this subreddit.\n\n#7 nature or nurture:\n\nin this part, the interviewer interviews several social scientists, biologists, and medical experts in norway and elsewhere in the world. the social scientists want to push the idea that gender is a \"social construct,\" but the majority of biologists and medical experts soundly reject such ideas. the way the social scientists argue for their positions is both hilarious and frightening. a young baby boy (victor) was born with an undeveloped penis and doctors and surgeons removed the penis and then the boy was raised as a girl (victoria). victor was not happy with the feminine clothes he had to wear or the girly activities he participated in. victor (as a girl) had no idea that he was born a boy -- this is a counterexample to the theory that boys and girls are raised to fit into traditional gender roles. the \"gender researchers\" interviewed simply ignored his case. \n\n#5 sex:\n\ndespite feminists' insistence that culture shapes sexuality, researchers found that sexual desires are the same cross-culturally: men want more variation compared to women. women have evolved to desire less sexual partners due to the biological differences (pregnancy is more burdensome to women); women also want commitment from men as a result. men aren't as picky as women. \n\nwhen women were asked what they seek in relationships:\n\nshort-term: they wanted a man with a bad boy attitude, who has a tough and robust look, and good in bed.\n\nlong-term: a man who is considerate, a great personality, good provider, etc. \n\nevolutionary explanation: if it's going to be a short-term relationship, women will shop for the best genes rather than the best provider. \n\nthey also go into genetic cuckoldry (\"mama's baby, papa's maybe\") and how uncertainty of pregnancy affects male psychology. one of the most important things men look for in women for long-term relationships is faithfulness. women who have a lot of casual sex are rejected due to fears of infidelity.",
    "title": "\"brainwash\" -- norwegian documentary examines how fields like sociology and feminist studies reject actual science because it doesn't fit with their ideology",
    "subreddit": "MensRights",
    "timestamp": 1487025895,
    "score": 102,
    "keyword": "man doctor"
  },
  {
    "text": "My Harvey Weinstein was my high school teacher. This is my story. It happened in a small, wealthy, Catholic high school--run by Catholic brothers, fairly conservative, extremely sexist, extremely homophobic, extremely white, highest position held by a woman was guidance counselor. As a senior, I chose psychology as my second semester elective. The instructor was an alumni, been teaching a few years after 20+ years in law, and well regarded in the school/entire community because he was also the football coach. His son was a student in my year. To the football team, he was not only Coach, he was also their best friend's/teammate's dad. People hung out at this guy's house. This teacher was also my home room teacher all year. He knew exactly what rules to break to make him popular as a teacher--never marked you late no matter what time you strolled in, let you do homework, and didn't care if your shirt was tucked in. Every female was \"sweetheart\". He gave every male a personal nickname. He was very dad-like. \n\nSecond semester, day one of his class, he shut the door and it started. Basically, we were told that what happened in that class, stayed in that class. We were going to talk about things that the \"boss\" wouldn't like--sex, drugs, rock and roll type things. He set up an \"us\" against \"them\" mentality really early. He told us we were going to get really close. He made it clear that if you weren't going to be cool about it, you needed to drop the class. Then, he specifically stated: \"if i ever make you uncomfortable, come to me and we'll work it out, don't get an administrator involved and ruin it for everyone else\". He started slow: making stupid sex jokes, telling us about his glory days as a lawyer in the 80s, making comments here and there about women's bodies in general. Then the \"jokes\" got a little more graphic--throwing in lewd hand gestures. When we got to a lesson that included sexual harassment, he told us that sexual harassment doesn't happen anymore. Women routinely lie or exaggerate and it ruins men's careers. And when men do cross a line, it's because they don't know any better and women need to lighten up. In his unit on abnormal psychology, he thought it was important for us to know that \"some doctors\" say that homosexuality fits the criteria of a mental illness. About this time in the semester, his style of dress started to became more relaxed. He started wearing basketball shorts with no underwear rather than his usual khakis. This was a very small classroom so he was less than a foot away from you if you sat in front, which I did. He told us that he had \"friends\" that commented on how hot the girls were at our school. \n\nOne day at lunch, sitting with 3 girls from my class, I worked up the courage to say, \"so Coach is like...a creep, right?\" The response was essentially \"yeah, you didn't know?\" He only taught 2 classes each semester. All seniors. He was a guaranteed A. That's how he got away with this shit. Nobody is going to rock the boat a few months before graduation and he knew it. Right before final exams we played his version of \"Girls ask Guys\". We were encouraged to ask ANYTHING, without embarrassment, because questions were going to go in a hat. What happens in class, stays in class, remember? We were graded on our discussion participation but we could say \"pass\". A lot of sex questions came up because we were all 17/18yr olds trying to play this demented man's game. We went around the room and were pressured to talk about sexual fantasies, masturbation habits, penis size etc. There was several days of this. Looking back, I think he humiliated us for his entertainment. This was in 2010. Last I checked, he is still teaching. Every word of this is true and I would testify in court if his day ever comes.",
    "title": "My Harvey Weinstein was my high school teacher. This is my story.",
    "subreddit": "Feminism",
    "timestamp": 1508369435,
    "score": 8,
    "keyword": "man doctor"
  },
  {
    "text": "Advice Needed: My brother says awful, sexist things around me to make me angry. Tldr included. He's the oldest. He does it to me in front of my sister and brother, both adults, and even in front of my mother. We were watching Doctor Dolittle, the old version, because he fancies himself the expert on all things cinematic. He made a comment calling the female's song \"If I were a man\" pointless to the story, when it actually outlines key aspects of the society at the time of the story. When I pointed that out, he just kept going and went from bad to worse.\n\nThing is, even if I keep my cool and don't act up, anything I do is wrong or inappropriate. I'm sick, too, with a hacking cold that's made me vomit at least three times now. Throughout the movie, he constantly kept asking if I was 'triggered' and making horrible comments, then staring at me, as if expecting a response.\n\nI left the room after he nearly sat on my laptop -asking simultaneously if he could sit on the ottoman that I was using to change from a youtube video, long after the movie had ended. I was disgusted by his conduct throughout everything, so I quietly got up and left the room. I could hear him talking and explaining that it wasn't his fault that I was triggered or couldn't control myself or some other rubbish like that.\n\nIf I do speak out against him, I have to do it as civilly as possible, because it's awful if the non-cussing daughter who always helps out around the house suddenly develops an affinity for verbally abusing her brother. At one point, he wasn't even paying attention to the movie; he was launching so much bile in my direction. I was too scared to contest it, so I just told him to pay attention, because he had really wanted to watch this, right?\n\nThing is, I know that if I stand up for myself, I won't get any support. I can take it to my parents, but they'll just say that he's an adult, and that there's nothing they can do to regulate his behavior anymore, pretty much giving him a free pass.\n\nBut I know that if I actually speak up I'll be called a bitch or an sensitive pansy who can't take a joke. I'll get verbally whipped again, and I'm pretty sure my parents won't stand up for me because I'll probably start crying and getting \"too emotional\" in the middle of everything.\nI'm not even what you'd call a \"femi-nazi\". I'm just a feminist; I just want equal rights. Sure, military enrollment for both sexes. And please give equal pay! That sort of basic stuff.\n\nI didn't want to post on the reddit feminism thread because that's blowing up with the Womens' Rights March news right now, and I definitely want advice, because I hate living like this and having to mutely tolerate whatever he throws at me. I can get a quip in one time in a million, but I know if I do it often... you know, the same old, same old.\n\nThing is, everyone in my family ignores it (And I believe I see them smirking at his comments), and now the 17 year old brother that I leave early 4/7 days to drive him to school is picking up on the trash my brother exemplifies. He even looked at me after saying something horrible and said, \"I'm glad ____ didn't say anything about that.\" I knew I couldn't because I'd be outnumbered again by these jerks, and I just didn't want to deal with it. Again, I'm miserably sick here.\n\nI have even been driving this kid 3 weeks in advance before my own Senior Semester starts. Oddly enough, I think my father would be more understanding than my mother in this situation.\n\nThis might be more suited for rants than advice at this point. But seriously, what do I do in this situation? How do I stop this sort of blatantly abusive treatment? Please don't suggest moving out; I'm not financially able to do so. And please don't suggest calling up cops/authorities. He's my brother, after all.\n\nTLDR: My brother is super vocal about women in a very negative way -just to try to get me mad. I feel trapped because if I say anything, I'm the bitch or the person who can't take a joke. I think he wants to be given an excuse to say this sort of stuff about me. My family ignores it to try to avoid a shitstorm. He's rubbing off on my 17 year old bro, whom I consistently sacrifice for to get him to school. What do I do to stop this?",
    "title": "Advice Needed: My brother says awful, sexist things around me to make me angry. Tldr included.",
    "subreddit": "Feminism",
    "timestamp": 1485116380,
    "score": 4,
    "keyword": "man doctor"
  }
]