[
  {
    "text": "Cardinal Health Warehouse? This morning, I applied to Cardinal Health for a part time warehouse associate job. It would be my first job ever if I’m called in for an interview and get the job. (A lot of people say getting hired at warehouses are relatively easy, even if you have no work experience like me). I’m personally excited.\n\nThe job description said picking, packing, shipping, moving goods, and cleaning.\n\nAnd as far as I’ve heard about warehouse jobs, I think it fits me. I like moving around as I’m I’m very hyper, paying attention to detail is something I do constantly cause of my OCD tendencies, I’m kinda stupid in real life so repetitive and simple tasks are all I’m really good at, I’m out of shape as I need to get rid of some man meat, and I’ve noticed that when I’m working most efficiently  is when I’m by myself. I don’t hate people, it’s just that dealing with them consistently causes too much stress and anxiety that hinders me from working the best I can for my teachers or whoever. I also find the overtime chances intriguing because I have online classes and no social life anyways. My biggest concerns are adjusting to the weights I’m probably going to deal with, and just getting comfortable with everything there. Where everything is, this task, that task, this co-worker, that co-worker, etc. Both concerns could get better in time though.\n\nHonestly, the pay is one of the last things I considered. It’s good enough for me and the job is only 11 minutes away which is convenient.\n\n\nI just wanted to know if anybody has worked at one of their warehouses? If so I’d like some incite, advice, tips, etc.\n\nIf you don’t/haven’t worked there but have worked at a warehouse in general, that also counts and I could use that incite, advice, tips, and etc as well cause I’m sure they are all similar in enough ways. \n\nSorry for the messy post and bad grammar. It’s Friday night and I’m too squeezed to right these professional paragraphs people make, lol.",
    "title": "Cardinal Health Warehouse?",
    "subreddit": "jobs",
    "timestamp": 1693618094,
    "score": 3,
    "keyword": "man teacher"
  },
  {
    "text": "Flex Jobs isn't worth it For a lot of people on here this will probably be quite obvious. But, I was getting pretty desperate and had a little bit left in my bank account after months of being jobless so I figured I had nothing to lose. Well...I guess I had at least that much to lose. \n\nA bit of backstory before I continue. I'm a recent MBA graduate with 5+ years of financial experience working in a variety of fields. After graduation, all the jobs I was going for fell through rather rapidly and quite humorously. \n\nThe first job I was interviewing for was a consultant position of which my classmate ended up helping me get into the interview with a recommendation. After 4 interviews I was informed that the company was experiencing a merger and that my position was no longer available. \n\nThe second job required 5 interviews including a project to which I was told I didn't get the bit months after I finished the final round. \n\nThe third position I was passed over for the interviewer's nephew which man nepotism is a hell of a drug. \n\nThen I started rage applying after 6 months of almost nothing and landed on a remote premium auditing position that \"paid $32 an hour.\" That in fact was not true, you could work a full 40 hours a week but only get paid for whenever the billing department got around to regarding completing your contracts. For example, you spent 10 hours on 5 different contracts, they'd only fill out 2 of those audits and leave the rest to sit for 2 weeks. Thus, you'd get around $144 for 10 hours of work IF they actually filed the paperwork. I'd sometimes have to wait the better part of a month to get even a few bucks even though I was working diligently. Eventual I got all the pay I earned but by that point I was basically making less than minimum wage. \n\nNeedless to say, it didn't even cover food at that point and my boss said in my exit interview \"hey man this job is tough, I was on government assistance for the first 2 years! It just requires consistency and belief in the company.\" Terrible experience. \n\nAt that point I was pretty tired so I tossed in what cash I had left to a Flex Jobs account and wouldn't you know it....nothing happened. After weeks of applying, not a single company has even contacted me regarding interviews. It has been a straight and immediate \"NO\" each time. I contacted my buddy who's an HR lead to help me with my resume, I called my CPA buddy to help me practice interviews. But all of that was useless as it's been well over a month and not a single company has offered me an interview. \n\nI apologize if my grammar is off but I haven't been sleeping with this stress. \n\nI've customized my resume each and every time to the position, I've used words from the job description to alter the verbiage in the \"duties conducted\" portion under each line in the employment section, I've done just about everything. It's been embarrassing where they don't even want to interview you ya know? \n\nSadly I'll have to get back into an old job I had 5 years ago as an ESL teacher and kinda ruin my career prospects but I've got nothing in the bank. I'll take out a loan to snag a flight to east Asia and start the next chapter in my life. Thanks for reading guys, Goodluck out there. \n\nTL:DR - Save your money, it's a waste of time.",
    "title": "Flex Jobs isn't worth it",
    "subreddit": "jobs",
    "timestamp": 1679507074,
    "score": 2,
    "keyword": "man teacher"
  },
  {
    "text": "Passed over for promotion from part-time to full-time (higher education) Just like the title says. I have worked full-time as an adjunct (all the work with none of the pay!) at a local community college for the last almost four years. I have said yes to everything—I’ve taught dual credit classes, prison courses, countless hybrid and online courses. It has been rewarding and I’ve gained valuable skills…but it very quickly became a very monotonous, tedious gig. But I kept telling myself that it will lead to something, that I’m early career (graduated with doctorate in 2020), that I’m putting in my dues. I’ve done my own research—unsupported—on the side and have managed to publish four papers on my own (history and architectural history). I’ve redesigned the main course I’ve been assigned to teach, granting other instructors access to my materials. I’ve put my head down and worked to build up my resume. In the meantime, I have applied to other places through the years. I’ve always gotten rejected (not even an interview) but, still, I would just tell myself I need more experience and take on more. I taught five classes this fall, for example (and I don’t get T.A.s so I had to grade all assignments for 100+ students myself). \n\nSeptember 2023, I got a call from my head of department saying an opening for a full-time instructor in my field has been made available and he encouraged me to apply. He reminds me that it will be an open internal hire but that I’m still his favorite candidate for 👆🏼reasons. I apply the day the job ad goes up. I have my first interview a few weeks later and the follow up the following week. I then wait for a month. In the meantime, boss-man routinely emails me with updates implying there’s a positive outcome once he hears from HR. Quite recently, I get the call: he asks if I’m available to talk; says he finally got the “green light” from HR then follows up saying “I’m sorry to have to give you bad news”; and then spends 10-20 minutes trying to brainstorm with me about how he can keep me around and happy despite this (meanwhile, I’m just trying to restrain my emotions and keep everything professional). He also speculated that HR didn’t want to give bad news mid semester. meanwhile, he dropped this turd on me when I still had to finish grading the five classes I was assigned and submit final grades for the semester after we hung up. Just the cherry on top of the shit sundae. \n\nNeedless to say, I’m gutted. What a slap in the face. I feel used and betrayed. And I don’t know what to do. What do I have to do to get my foot in the door? What do I have to do to prove I’m a capable historian, teacher, administrator (this college splits semesters in half…so I get a new schedule every 6-7 weeks—sometimes even teaching 3 week courses—and I’ve mixed things up twice in four years of this bullshit system. Given that I also routinely manage 80-150 students all by myself, I’d say I’m a good administrator)? I haven’t been to a conference in years but a) I am always so busy teaching and b) I don’t get paid enough to be able to afford going to these destination networking events. \n\nIn short, does anyone have any advice? Words of encouragement? Right now the only thing that cuts through the numbness is consuming iterations of melted cheese and I can’t keep doing that.",
    "title": "Passed over for promotion from part-time to full-time (higher education)",
    "subreddit": "jobs",
    "timestamp": 1702403286,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "So I keep finding interesting flaws and issues with the firms I work at, and it's starting to make me think I either need to job hop again or look for a different industry I have a degree in architecture, and basically I work as a draftsman who tells people I'm pursuing my license, working with multiple companies throughout the years, ever since my first internship in college. \n\nI've always had this \"too good to be true\" pessimistic anticipation attitude about companies because I keep finding issues that I feel like strongly inhibit my ability to grow in the profession.  \n\nIn a sense I'm kind of new, but not too much. I've been using Revit and CAD since high school, being trained by my high school teacher who is also an architect. I've had multiple internships with college that were always short term because they were contractural or school conflict. \n\nAfter I graduated, I struggled to find a job for a year and a half. Then I worked with an engineering firm where the employer was alway stresses out for 8 months. Was recruited into a fire alarm company, but was released in a month because I had surgery. Found an architecture firm, but it was basically a mill and I was removed because I went to a doctor's appointment on my first month. Then found a one-man contracting firm where I and another person was basically doing my architect's homework while he was busy off doing meetings. \n\nThen I found my current job because I thought I was going to significantly earn more.\n\nIn the past six months I learned that besides the long drive and taxed out paychecks, my managers do not always charge for their times, because they don't to go over the budgets on projects, even though the clients are being cheap and asking for too many revisions.  \n\nThis isn't some tiny firm, it's supposedly an award winning firm with 5 locations across the US. So I'm really shocked by this. \n\nThe problem I have with this is that it also affects me, because it might force me to do overtime on a project but I won't have permission to charge for it. \n\nI asked my managers, since I'm fast and efficient on other projects, if I can help them take off the workload on these projects since they're almost always doing overtime. But they cannot because they don't have enough time to explain the context or tasks or scope of work, and I don't know how to get this information any other way. \n\nI feel bad about my managers' situations, but it also makes me feel bad about my profession as a whole. I feel like they're undervaluing themselves to keep cheap clients, and that I might have to follow in their footsteps. I had a talk to my manager about it and they told me they feel like this is just the way the profession is, with any other firm. And while I don't completely believe them, I think the idea that this is a common problem, makes me want to quit pursuing the profession, since I'm struggling to support myself financially on this job alone and need so many side gigs. \n\nI want to job hop, but I don't want to burn bridges or yet again add another red flag on my resume. But I think this is a problem that's bigger than me to solve on my own. I just value work-life balance, my health and self-love.",
    "title": "So I keep finding interesting flaws and issues with the firms I work at, and it's starting to make me think I either need to job hop again or look for a different industry",
    "subreddit": "jobs",
    "timestamp": 1687042474,
    "score": 0,
    "keyword": "man teacher"
  },
  {
    "text": "Help me consider careers that match my skills and interests that do not require further education \n43F who is autistic with ADHD, Alberta Canada. I tried to give comprehensive background but summarized most info in category TLDRs.\n\nIntro: \nI aced University but I generally suck at real life. I am lost trying to think of a job that will allow me to live without eventual burnout from masking as an autistic.  I need something that gives me flexibility for my waxing and waning energy and requires very little hustling in person or on the phone. Email is fine because communicate much more effectively in writing than verbally. I would consider related self employment ideas too.\n\nIdeal job characteristics: \nFocus on creativity,  problem solving in Science & Arts. Importance placed on ideation and planning for implementation, and then delegate to others to actually finish. Maybe project based? No cold calling or selling and prefer remote or hybrid work. Ideas which help others is very appealing.  \n\nStruggles with typical employment: TLDR: mostly Communication / Sensory\n\n- Just getting employment. I am terrible at interviews. \n- work at 200% 3 days a week and 10% the last 2 days when I am recovering. \n- Asking too many questions and wanting to know more about stuff outside of my job description. \n- Meetings leave me confused and unclear about priorities and what was brainstorming vs actionable ideas.\n- Treating everyone as my peer to have intelligent conversations and brainstorming with regardless if speaking with a 7 year old or my CEO. \n- Subjective language and unclear expectations/ directions\n- Feeling like an outsider- the loneliness of not really wanting to do outside of work social activities but also feeling hurt when everyone is closer or they stop bothering to invite you. \n- Oversharing\n- Environment: I need a quiet minimally stimulating area with few human interactions. \n- I tend to have SO MUCH STUFF because I hate not having what I need in the moment. This means I am messy in the wrong environment. \n\nWhat I enjoy: TLDR: mostly creating and finding solutions. \n\n- Thinking about the “big ideas and issues” such as  climate crisis, consciousness, cognitive development, sources and solutions for inequality, longtermism, ethics, modelling human development of cognition to facilitate research. \n- Learning!!!! I am a slow processor at times especially if requires visualization to understand the lecture but once it clicks I am on my way. \n- Visually designing something\n- Creating systems/ organizing ideas for others \n- Editing photos (but just the editing part- I know little about the actual in-person taking photos) \n- Communicating about science \n- Graphic Design in Canva / Easy (little coding) web design in drag/drop programs like wix\n- Writing\n- designing and building things BUT I never like building or creating the same major idea twice. \n- Hobbies : Video Microscopy, drawing, water colour portraits,\n- \nWhat I am good at: \nTLDR: skills: Researching, Ideation, problem-solving, areas: Psychology, Cognitive Science, Medicine , Education, visual Arts. \n\n- Researching, tracking down info- I swear my persistence means I can find anything. I am so happy and hyperfocused when working on a problem/ question. \n- Learning new skills \n- Prompt generation, I just seem to be able to keep shaping a prompt until I get what I need. I do think that Prompt engineering as a career will soon be obsolete as technology makes the middle man no longer needed.  \n- Mentoring, I am very good at researching and offering resources and solutions. As an older student (43) I had many younger classmates come for advice which always surprises me. \n- Finding the best deals on things (I guess this fits into researching) \n- Aesthetics and styling. I have always had a good sense of what is visually pleasing. \n- Finding creative ways to educate that uses project and experiential learning to help people remember and apply their knowledge\n- Writing: I love to write both academically and to write personal but informative papers to help break down the gate keeping of knowledge. We all deserve the opportunity to have complex ideas broken down into meaningful communication. \n- Providing strategies for interacting with ND kiddos\n- Weird and  not a job possibility but medical/ psych diagnosing. Don’t worry I do not go around giving people diagnoses I just have the background and I see patterns in symptoms . I don’t always have the greatest memory but I remember everything medical. 🤷‍♀️\n- Developing Teaching materials and lessons. (I wish I could just do this and not do the teaching 😉) \n\n\nEducation:\nTLDR: certificate: family engagement in medical research diplomas: Nursing, audio engineering Degrees: BSc, BEd\n\n\n-Audio Engineering post-production diploma (obsolete now, but the foundations like layering and signal flow  have helped me a lot with editing music, video, photos, and graphic design) \n\n-Practical Nursing Diploma (license now lapsed) taught me how much I love science and medicine. Worked as a pediatric nurse but hated that curiosity and thirst for knowledge  was frowned upon (aka: “why does the rationale for the order matter? Just do it.”)\n\n- BSc Life Science with a focus on Physiology, Pharmacology, Biology, Neuroscience. This was supposed to be my pre-med once I realized I wanted to be a pathologist not nurse but my family responsibilities made it obvious towards the end that med school + residency was not a possibility \n\nBEd focus Science. My BSc was useless as I had planned it as a stepping stone to med school. My Uni offered a 2 year after degree bachelor of Education program. I thought I could work as a science teacher but despite graduating with a 4.0 I realized the level of masking required to teach K-12 would break me down in less than a year. Love teaching small groups and adults. Also was hired as a research assistant and received funding to do my own educational research which I LOVE. \n\nIf I could I would love to be in grad school doing research into developing a methodology to analyze and model curriculum to develop longtermism thinking in k-12 school but that is not a possibility because my husband isn’t keen after 6 years studying to have 5+ more for my doctorate and I need to make some kind of financial contribution to our family.",
    "title": "Help me consider careers that match my skills and interests that do not require further education",
    "subreddit": "jobs",
    "timestamp": 1702220636,
    "score": 0,
    "keyword": "man teacher"
  },
  {
    "text": "A student I don't know interrupted my lecture today to hit on me. Guys, it's been a week. So I teach at a community college in my area, and this week I'm covering classes for another teacher who is out on bereavement.  I'm standing at the front of a lecture hall, clearly lecturing, with a slide deck up on the projector, and some kid (probably early 20s) comes up and stands in the open doorway to the room. \n\nHe stares at me for a minute and then, while I was talking!, tried to speak over me in a loud voice.  I finished my full thought, then turned to the door and said, \"I'm sorry, can I help you?\"  In a polite, but not too sorry voice. \n\nI shit you not, this kid stands before God and man and says, \"I was passing by the room and I heard a beautiful voice coming out of the doorway, and I just had to stop in and see you.\"\n\nThis is not a student of mine.  This is not a friend of mine.  This is a kid half my age interrupting a college lecture to hit on the professor in front of a full lecture hall.\n\nI stared at him hard, shook my head and said in a loud voice, \"No you absolutely did not 'have to.' PLEASE LEAVE.\"  And I turned back to my lecture. He left.\n\nThe class just stared at me appalled, and one young woman got up and shut the door for me.  I used to teach middle school, so I rally pretty quickly from stupid interruptions, but what the hell?!\n\nThis is after I had to call the police on Monday on a different guy peeping in on the ballet class (I've danced my whole life, and the ballet teacher lets me take classes for free as a faculty member).  Friends, there were literal nose marks on the window from where this guy pressed his face up against the glass.  I looked over at the window as I was dancing and he was staring me down so freaking intently I thought his eyes were going to stick to the glass.  I couldn't see his hands.\n\nThen on Tuesday I had to call the police AGAIN on a homeless man who was sleeping in front of the elevator I need for my work and who wouldn't move when my coworker and I asked nicely.  I am empathetic and wish him the best, but you CAN'T just block people from using the equipment at their place of work.  \n\nIt's been a week. What the hell is wrong with men?  I mean I married, work with, and know so many wonderful guys, but what the hell is wrong with these guys who think they are entitled to my time, attention, and space or that I exist for their fucking viewing pleasure?",
    "title": "A student I don't know interrupted my lecture today to hit on me. Guys, it's been a week.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1697091068,
    "score": 2750,
    "keyword": "man teacher"
  },
  {
    "text": "A little bit upset with the \"lonely, sexless 20's man\" Increasingly, I keep seeing posts, discussions and conversations around the new epidemic of the single, lonely, virgin or sexless man in his 20s'. I see it online, I see it in real life, and I for sure see it on Reddit.\n\nThis discussion bothers and scares me a lot, especially with the rise of anti-women/LGBTQ laws, and increasingly 1950's traditional extremism that's popping up more and more. I'm a 20 year old woman and I feel like whenever the discussion on alienation in your 20's is brought up, it only applies to men. Women cannot be lonely; we all have a ton of friends of course!\n\nBut I'm constantly lonely. I didn't have a support network for most of my life, and all of my friends either are so busy with their own lives, or are fair-weather. It looks like I have 15 or more, but only 3 are close friends, and only 1 will drop everything to come and help if I need help.  I can go weeks without seeing any of my friends; but since I'm a girl, I'm not included in the discussion on alienation. There's alienation where you are by yourself, but what being in a group and realizing that you're only here as long as you play your correct part? I can stick around as long as I'm funny, but if I ask for help with something serious, then I'm a burden. In class, I can't for the life of me make any friends. I had no friends in public school, and I've only made friends outside of my classes in college.\n\nThe thing is, those experiences? It's not limited by my sex or gender at all. It's a very human problem, so why is half of the population excluded from talks about it?\n\n&#x200B;\n\nOf course men face different limitations because of the ideas drilled into their heads at a young age, but the outcome is the same. Why don't we talk about women who struggle with being alone and on their own in their 20's?\n\n&#x200B;\n\nAnd I think this applies to the sexless part. I'm just going to say the quiet part out loud since I'm so tired of people skirrting around it; the \"solution\" for these sexless young men is for women to have sex with them, and become their gfs, wives, fwb, etc, etc. It feels like a huge backlash against the fact that women are now becoming independent and aren't tied to their husbands by their hands and feet legally, socially, and financially. If we ignore the fact that not only men are facing issues in the most turbulent time of our lives, we can construct a narrative that this is a man exclusive epidemic. Also, why is there such a huge fixation for men to have sex? I don't see this for single, unmarried women for them to go and have sex as much as possible. Sex isn't that big of a deal to not have, and its a bit creepy and sad that men are told that they need to have sex or else they're not manly enough, or that it's a pressing biological urge. My own father said that for young men, it's just different than for women when it comes to sex. That they need it more than women do. Doesn't that sound so sad? Life is so wonderful and lovely, but men have to have sex for it matter? At that point, are they even better than breeding bulls? We're humans, not dumb animals. Why would we expect men to have to behave like that? And where does that put women? If sex for women is different than sex for men, why do we need to give men that? No one is entitled to someone else's body for anything.\n\nAnd this need and drive for sex is ironically, part of the reason that there are so many sexless single men who don't a lot of friends. I don't have a lot of actual friends, but I've been friended just because the person wanted to fuck me. I've had friends try and get me drunk to have sex with them, I've had men who, we got along super well, but they started to get creepy because they didn't want a friend. They wanted to have sex with me. That's so horrid for both parties! I want to be friends with everyone, but if I have to worried that a dude is only getting close to me because of what I can give him, it's heartbreaking.\n\nThis whole discussion is leading to the idea that we need to return to traditional gender roles because men can't function socially or without a sexual partner. But that thinking limits men, and punishes women. In all of these talks, women aren't seen as actual people unlike the men are. I don't see anyone saying, hey, where are all of the lonely women? How are they doing? What's going on with that? I don't see anyone treat them more than sex and socialization dolls for men. And the conversation babies men! It acts like they are no more than dumb animals that need to get their dicks wet and that no one will ever ever like, so they need to lash out; instead of seeing them as actual people!  This whole epidemic of the \"single, sexless 20 year old men\" is just so dehumanizing to both groups. We should talk about men's mental health, but the solution we're coming to is that women aren't suffering and that they need to start fucking these poor guys and become trad wives.\n\n&#x200B;\n\nTLDR: Frustrated with the focus on men only in lonely and sexless conversations, and the unspoken idea that women having sex and becoming their S/O's is the only solution, and that women aren't suffering as people either.\n\nEDIT: A lot more people than I thought have read this post, and things I skimped on in detail for personal reasons are becoming a hot topic which bothers me. I've struggled with making friends my whole life; I was bullied in pre-k for God's sake. I wasted a decade of my life alone in my bedroom, not talking to anyone and feeling cut off from society. I tried to make friends following advice from other people, because I know what real loneliness feels like. I got some DMS that didn't think that I did, but I do. I know what it's like to go out to school for 8 hours everyday where people hate you for things you can't change, where they hate you for being award or having mental issues, they hate you for being poor,  and the wear and tear it is it look at a room and know that if they're thinking of you, it's at your expense. I had to leave my first high school because I was being bullied so bad I would wake up vomiting before class. In my second high school, I started to break down mentally at the end. Every week as a senior in high school, I would break down and have to go home. No one cared. None of my teachers thought that there was an issue with me crying and sobbing in my classes so often, none of the new, tentative friends who hadn't been picking on my for their entire school lives cared that I was having mental breakdowns next to them.\n\nI am more akin to a dude in my manners; I do get angry and mean when I'm unhappy. The same things that worked for my male classmates to get help didn't work for me. No one seemed to care that I was so close to losing it all. That's why this whole thing bothers me. There's an idea that women don't really suffer from being alone, that they don't need to contribute to the conversation when it's brought up. I am one of those women who didn't have friends, who everyone thought was ugly because my family couldn't afford decent clothing, and who was mean and jaded because I was treated so badly. When I came to college, I was still so fucking lonely. I did course work, made no friends in my major, and slept an average of 4 hours each night. Even when I started to get this big group of friends, it doesn't really cancel out the lifetime of being isolated, nor does it mean that everyone is close to me. A friend to me is someone who I can hang out with and talk to. Out of that big old group, only one person really gives a shit when I'm in trouble. I don't even ask other people for help because we're not those types of friends.\n\n&#x200B;\n\nI know what it's like to literally have no one. I also know what it's like to have lots of people, but too know that if you don't play your part right, you'll be shamed and tossed out. Both are horrible in their ways; like how drowning and burning alive are. The whole point of this post was that this is an issue that is effecting everyone, but is only being applied to young men who don't have sex instead of the wide array of the population.\n\nMen need to have their mental health taken seriously. I never said anywhere that all men deserve to suffer forever; in fact, I think the opposite! Wouldn't it be great if all men didn't have to operate underneath a system that treats them like animals that crave sex, but rather a system that treats them like smart people who can be wonderful, and amazing and alive. We can't make that system fair though in reality without also taking into account how women are treated though. Women are fighting all of the time for so many things - an issue that runs as deep as how society wants us to live together needs both sides not one. If we only care about how men are alone and sexless in an age where our lives are being torn apart, the path forward is one that hurts women and limits what men can be.\n\nEDIT 2: Read the whole damn post before dropping your hot take in regards to what I said. I know that this is Reddit and no one has any reading comprehension, but if you have beef with a point I make very, very early on, you might have the pleasant surprise of an answer that supports the point you want to argue about :D! \n\n&#x200B;",
    "title": "A little bit upset with the \"lonely, sexless 20's man\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1677539889,
    "score": 2498,
    "keyword": "man teacher"
  },
  {
    "text": "Am I overreacting? Pregnant, and mom keeps insisting I move back to a very red state. Can someone tell me if I am overreacting/pregnancy hormones, or if I had a right to be mad at this?\n\nFor about 5 years, my husband and I lived in Florida. Florida was always a bit red, but we lived there before DeSantis got into office, so it was manageable, especially living in a blue city. Everything went downhill once Desantis was elected. \n\nMy husband and I had a dream from the start of our relationship to move to Colorado, and once Florida politics got worse and worse, we decided to just up and move. Especially since we were starting to talk about having kids. I refused to have children in a state that has no human rights. Plus, as a bisexual, very pro choice woman, it was not the place for me. My husband agreed. The only reason he liked Florida was because of the warm weather, he has some chronic pain ailments and the cold weather makes them worse. \n\nAnyway, I think from the time we moved, my mom held on to a glimmer of hope that I or we would move back. Always dropping little comments that I could move back in with mommy if my marriage doesn't work out (which I would never do). Trying to bait me by sending me photos of the beach saying \"don't you miss this?\" (no. Mountains > oceans. Plus, I can fly two hours to California, have a beach AND human rights! Win win!). Bragging that it's 80 degrees in February in the hopes that I'll say I miss it. This continued even after my husband and I bought a house here, basically showing the long term commitment of staying here. Her argument is because we live in a slightly red area of Colorado, it's \"basically the same\" as Florida and may as well come back. Um, no, it's not. At all. The city leans slight red and is surrounded by blue areas. It's been incessant little comments since we moved in 2021. \n\nThe \"funny\" thing is, my mom is a democrat. She hates Desantis. But, she loves the warm weather. And has, verbatim said \"As much as I disagree with his politics, as a post menopausal, straight white woman, they don't have much of an impact on me\". I like the warm weather too, as does my husband for reasons mentioned above. But human rights matter more to us, so if the cold becomes too much ever, we will move to California. \n\nNow, I'm pregnant. Yay!! This has only made her comments much worse. We don't have any family in this state, BUT my husband and I are both self employed, doing very well financially, and we will both have the ability to be stay at home parents as we set our own schedule and have savings to not work for up to a year. My husband is extremely hands on, and I know he will do everything I do less breastfeeding and birth. I do not underestimate how hard parenting is, but I think I have an advantage being that we can both be stay at home parents, we can afford a post pardum doula, and my husband isn't a loser man child that sees childcare as \"women's work\".\n\nI know this sounds dramatic, but I would literally rather be a single mother in a dingy studio apartment on welfare vs move back to Florida. This is truly how strongly and angry I feel about it. \n\nThe last time my mom made a comment relating to us moving back to Florida, I snapped. I lost it. I told her it's evident that she cares more about selfishly seeing me/her grandkid, then she does them having human rights (especially so if this child is a girl). She cares more about seeing me, than me having rights, and me being in a place that makes me happy. I said it's disgusting how she can care so little about politics that don't directly impact her life, especially as she was a teacher all her life, mostly teaching students of very marginalized backgrounds. I said \"you literally live in the North Korea of the USA and you want me to come back??!\" It was a very heated convo and we haven't spoken in a week. \n\nIf she genuinely and whole heartedly wants to see me and her grandkids more, nothing/no one is stopping her from selling her home and moving to Colorado. But ohhhhh noooo its cold here!!!!!!! It snows here!!!!!!! I don't know anyone there!!!!!!!!!!! It's more expensive!!!!!!!!!! \n\nIs Colorado perfect politically? No, no location is perfect. But I love it here for reasons beyond politics. It is the most scenic and beautiful state I have ever seen. I take two to three hikes a week, and can't wait to do more 14ers once not pregnant. The people here are so much nicer too. Overall, there's very little I don't like here. \n\nAny outside thoughts would be appreciated, but either way, it felt good to get this off my chest.",
    "title": "Am I overreacting? Pregnant, and mom keeps insisting I move back to a very red state.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1685650830,
    "score": 2161,
    "keyword": "man teacher"
  },
  {
    "text": "Teacher made a weird comment about my chest. I’m in a concurrent enrollment criminal justice class through my high school. I missed our lesson on how to hold a handgun when you’re not pointing it. The teacher quickly explained it to me. You hold it up to your chest and cover the trigger with your other hand. \nAfter explaining that, he said that I could probably hold it like that for hours because I have a “shelf”. He was obviously talking about my chest. It was a weird comment that I’d normally awkwardly laugh off, but I just said ummm okay. He seemed kinda embarrassed and started saying how he used to have a shelf too before he started going to the gym. Me and the two girls who were standing with me were just giving each other weird looks. \nI didn’t really think much of it until I mentioned it to my mom, and she’s absolutely pissed. It just seems weird to me now that this 40-50 year old man would say that to an underaged girl. Idk. Is this an overreaction?",
    "title": "Teacher made a weird comment about my chest.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1700101944,
    "score": 1897,
    "keyword": "man teacher"
  },
  {
    "text": "I’ve been stalked by the same creep for 8 years and I have no way to make it stop This is going to be one of those non-feel good posts where I vent about being powerless in an absolute shituation. \n\nI(F29) have been stalked by the same man(M47?) for about 8 years now. All of it is done via email these days. It started when I was about 21 and we worked at the same place. My job was to answer phones at that place and one day he started using his lunch break to sit in a parking lot across the street and call the phone of our business literally every five seconds for the whole hour he was out there. Twice he sent flowers to my job for me, but used my email address to send them. I tried calling flower place and they said they couldn’t tell me the name on the credit card. Several times after work, I would be sitting in traffic to see that he was following me. He lived in the complete opposite direction and would follow me and try to make eye contact before turning off the road and leaving. After a few months of unsuccessful interventions by my employer, I quit. After that, the emails started. At first, they came from his personal email. Then, he started making new emails. All of the emails had the year he was born in them, like his personal email. I think he did that so I would know it was him. I have been getting these emails for years. Sometimes they are angry (but not violent?). Sometimes they aren’t. One time he emailed asking if I would spend the night with him for $1000. I was young, alone, and lived in the city and eventually I just never felt safe in that city so I moved. Far. I made myself un-googleable and got rid of/privatized all of my social media. I moved to texas after graduating from college and became a teacher. \nThe emails are still coming. A few months ago he made a linkedin profile for ME using MY work email. I only found out because I got the notification and a separate email from him basically letting me know that he knows where I work and live. I just got another one that says he is visiting my city soon and he can’t wait to see me. \n\nWhat can I do with all of this information to help myself? I have the emails saved. I went to the police back when everything first started happening and was told basically there was nothing I could do. The detective I spoke with said that stalking laws are built around domestic abuse laws, and since we were never in a relationship there wasn’t anything I could do unless this guy actually threatened or hurt me. I don’t want either of those things to ever happen and I have lived my life for the last eight years being scared and reminded that it could. Just posted on r/legaladvice and was pretty much told them same thing. I just hate this whole thing. Inaction feels unsafe. Action feels unsafe. I feel unsafe.",
    "title": "I’ve been stalked by the same creep for 8 years and I have no way to make it stop",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676914088,
    "score": 1466,
    "keyword": "man teacher"
  },
  {
    "text": "student told me something disturbing about a male teacher during assessment I was doing a work w/ a 7th grade girl, and she started gossiping about the teachers she didn’t like.\n\nShe told me that during her math class, she was picking a scab on her leg, and her male teacher randomly told an anecdote about a “supermodel student” he used to have. When this student was in his (middle school) classroom, he told her she needed to start shaving her legs, and she accidentally cut herself while shaving and got a pretty bad scar. Now allegedly now a model who’s been on the cover of Vogue, and still has the scar and it needs to be “airbrushed/covered  in her photos”\n\nThe whole thing sounds like BS, but even if it is, it’s so weird that a man would tell a fake story that revolves around telling a 12 year old to shave her legs? It creeped me out so badly.",
    "title": "student told me something disturbing about a male teacher during assessment",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1700675216,
    "score": 1309,
    "keyword": "man teacher"
  },
  {
    "text": "Is it weird that I'm struggling with this situation? I'm a middle school teacher. My principal was recently arrested for some pretty heinous stuff that involved a 16 year-old girl. He was attested this past weekend.\n\nI have worked at that school for the past 2 years, but I've been teaching for 20 years. While I have encountered all manner of creeps in my 42 years of life, I've never been this closely associated with one.\n\nI really respected him. I thought he was a great principal. I saw him as a role model. I wanted to be able to approach every situation with his level of kindness and compassion. I used to brag to my friends who taught at other schools about how awesome my principal was. I trusted him to do the right thing. I went to him for advice all the time. I liked him as a person. I thought he was a good man. I thought he was an example of non-toxic masculinity. I mean, he played D1 college football but was also the kindest middle school principal I have ever worked for.\n\nWhen I first found out about the charges, my mind instantly went to \"It's probably just a vindictive parent.\" That's so fucked up. I can't believe I'm admitting that! Then I thought, \"Well, college football in the 80's definitely resulted in CTE. Maybe he has a brain tumor. He got a concussion a few months ago after a fall.\" I grabbed for every single explanation for this behavior other than \"he's a fucking creep\" because, I just had to. \n\nI mean, how fucking stupid can a person be?! He is 55 years old, married and has 3 children. He could have retired this year. He threw that all away! I'm heartbroken for his wife and children. I'm disgusted that I trusted him. I'm worried about all of the other girls who he may have/probably did do this to. \n\nI guess this is really just a rant from a woman who was really looking forward to a relaxing summer but instead found out something really disturbing 2.5 weeks into that break.",
    "title": "Is it weird that I'm struggling with this situation?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1689194159,
    "score": 932,
    "keyword": "man teacher"
  },
  {
    "text": "I feel like I over reacted. This guy was calling and stopping by my house everyday for the last 3 days. I (30f) was walking home from dropping the kids off at school when I ran into this guy 'Tom.'(30~m) I live in the south and people are generally nice and Tom offered me a ride home. I am always on guard when someone pulls over. Tom noticed that and said not to worry, he is a music teacher for kids. He says he understands that he's a stranger and he's a God worshiping man and wouldn't hurt me. \n\nI've been wanting to put my kids in music classes. So when I heard this I was happy to hear it. They would love that and I loved music classes as a kid. We exchanged numbers. \n\nI asked my husband about putting the kids in music classes and didn't want to for reasons unrelated. \n\nTom called me and asked me about the classes and I told him it was not husband approved. Maybe next school year. \n\nTom didn't like that response. \n\nTom suggested I take the kids to his music lessons and not tell my husband. We can have a secret text code and Tom won't come over if I text him that. \n\nI tell him no. That's not possible. I'm not going to lie to my husband. \n\nI did agree to talk to my husband again, because I did want this for my children. \n\nTom calls me every day and stops infront of my house. I tell him no. It won't work with my schedule. He suggests I take lessons and then I can teach my kids what he teaches me. I do not need lessons. I actually already k ow how to play that instrument, I just don't have one. \n\nWell, I have a tendency to talk more when I'm uncomfortable. So I mentioned needing a handy man to clean out my gutters. Tom says he can do it. \n\nI actually really need them cleaned and I'm more than happy to pay him to do this.  \n\nTom insists he will do it for free. I insist he must be paid for his work. He insisted he do it free. \n\nTom has officially creeped me out. \n\nHe pushed me to take his classes.\n\nHe encouraged me to lie to my husband.\n\nHe wants to clean my gutters for free. \n\nHe tells me he will be working at my kids school. I dunno if he's seen my kids, but now I'm freaked out even more. \n\nI feel like I'm justified... I also feel like I'm an anxious bitch.\n\n\nEdit: I messaged him and said 'please do not call me or come to my house anymore. I do not want music lessons and I do not want you to clean my gutters.' \n\nHe said, ' I don't know what changed all the sudden but ok.' \n\nI plan of confirming his story with the school and talking to the ladies in the office about not letting anyone but the list of ok people. I also had a talk with my kids about not going home with anyone that wasn't at the house during Christmas. \n\nI haven't told my husband about it, but I will tonight.\n\nEdit 2: Did some fb stalking. He worked at a few schools and now does private lessons. I wouldn't be suprised of his story about working at my kids school is true. His business fb looks very God and music oriented. I think he's trying to be helpful but doing it in a super creepy way. I will probably still talk to the school and express my desire for my kids to not be in his class or at least to have a second adult present.\n\nEdit 3: Talked to the school and gave them a mini version of my experience. He's a parent volunteer and going through background checks still. I said I didn't want my children in class with him or at least have another adult there. They promised that if he starts volunteering, they can take the kids out of the class, and there is always a teacher when parent volunteers are teaching. They reassured me of the ID policy and my kids won't be released to anyone not on my list. So nothings happened because he doesn't actually 'work' there.",
    "title": "I feel like I over reacted. This guy was calling and stopping by my house everyday for the last 3 days.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1678302926,
    "score": 794,
    "keyword": "man teacher"
  },
  {
    "text": "I'm angry at the response of many women I know to the report of a teacher raping a young boy. TW: SA\n\nI have to say I'm pretty angry as I write this. Over the last few days, I've seen a few posts across the Internet about the teacher in the UK who has recently been revealed as having raped a young boy 8 times in the 90s. \n\nSo many women I know who profess publicly to be feminists, to be for equality, to be fighting against sexual assault, have made vile comments about this case. Saying that it can't be assault because 'any young man would jump at the opportunity to f**k a teacher' that it's 'a young lads fantasy' or that 'he probably took advantage of her'.\n\nThis is a adult who raped a child. I know UK law does not define the rape of a boy by a woman as 'rape', but that's what it is. An adult women took advantage of a minor and otherwise reasonable people seem to be determined to paint the child she raped as the likely perpetrator. \n\nFrankly, do better. \n\nIf you stop supporting the victim of rape because the victim was a boy not a girl, that's not feminism. If you make excuses for the pedophile who took advantage of a minor because she's a women, you aren't fighting for equality; you're disgusting. \n\nThe SA of a child isn't something any decent human should be defending, regardless of who the victim is.",
    "title": "I'm angry at the response of many women I know to the report of a teacher raping a young boy.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1685902547,
    "score": 478,
    "keyword": "man teacher"
  },
  {
    "text": "An American man, who lured the head of an English academy (= hagwon) into his home in Korea to discuss working for her as an English teacher and tried to rape her, injuring her in the process and then fled the country in 2008, gets caught after 16 years by the US Interpol and is extradited to Korea. >  \n>  \n>News articles:  \n>  \n>[https://www.seoul.co.kr/news/newsView.php?id=20230119500148](https://www.seoul.co.kr/news/newsView.php?id=20230119500148)  \n>  \n>  \n>  \n>[https://news.kmib.co.kr/article/view.asp?arcid=0017881652&code=61121111&sid1=soc](https://news.kmib.co.kr/article/view.asp?arcid=0017881652&code=61121111&sid1=soc)  \n>  \n>  \n>  \n>The man (54) has admitted his crime and is charged with attempted rape.",
    "title": "An American man, who lured the head of an English academy (= hagwon) into his home in Korea to discuss working for her as an English teacher and tried to rape her, injuring her in the process and then fled the country in 2008, gets caught after 16 years by the US Interpol and is extradited to Korea.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1674528612,
    "score": 393,
    "keyword": "man teacher"
  },
  {
    "text": "I'm tired of dealing with misgynoir from men of my own race Ever since I was a kid I've always been masculatized by grown men of my own race and I'm sick of it. It's so dehumanizing. I've dealt with the same pattern as a kid. Some grown black man acting like I'm the same size and gender as he is when Im clearly a woman, they threaten me because I'm not kissing their ass or put their hands on me, and if they ever get confronted on the matter by someone else they'll lie and say I made them do it because I was starting drama with them first even though I don't even say anything to these men most of the time. I'm visibly black, darkskinned with kinky hair..I don't use the hair typing system anymore because I feel like it promotes colorism and racism. I feel like that makes matters worse because it seems like it gives colorist black men the green light to be rude as possible to me. \n\nI got tormented by a black male teacher when I was in high school and no one helped me. He hated me for whatever reason and when I got older and started going to practice after school hours he would come up with reasons to torment me. He would call me out in front of everyone, he pushed me, he made up some reason one day to throw everyone's stuff on the floor except his favorite ones and indirectly said it was my fault. \n\nA few days ago this black homeless man with barely any teeth acted like he wanted to fight me because my trash bag had a hole in it and I didn't realize. I live in homeless shelter and im just waiting to be placed into a permanent home. For whatever reason he was helping the maintaince people take out the trash so he saw my bag leaking, i apologized and was literally about to clean my mess up until he started making passive aggressive insults.\n\n When I defended myself he stood by the door trying to scare me..I called him a fucking idiot and started walking away. He said as I was walking away,\" say that again. I was in the army for x amount of years.\" I cursed him out and said he wasn't going to do shit because he would've done it already. I had mace in my pocket but the fact that he was trying to scare me and thought it was a good look for him to try to scare a black woman is insane. I came back out with my mom and she said,\" stop talking to my daughter crazy.\" He said he never said anything to me and that i started bothering him out of nowhere..i started screaming and making a scene, then he walked to his room saying he was going to get his sister to beat our asses. \n\nBefore anyone in here comments that this is a poor person issue I've experienced this similar situation while being in middle class areas the school I went to where the black male teacher was tormenting me was in a middle class area. And I already have a feeling someone is going to say that poor areas have a high rate of violence so I should be expecting this..I have not seen any fight that broke in since I've been in a homeless shelter, and before someone else tells me I need to leave I know I'm leaving I'm just waiting to get permanently placed somewhere else. This wasn't about being in a poor area he was just very eager to do it because I'm a black woman. After that he came out to smile at the hispanic women in the hallway. After that I wanted to cry not because I was scared of him but because I'm I'm sick of being treated this way. \n\nNo matter what I've worn I'm always been treated like a man from men my own race. I was more girly when I was in school and still got pushed and hit by black boys. They would try and justify it somehow all of the time while always leaving the hispanic or more exotic looking girls alone. I used to be all for black empowerment but honestly I'm not anymore. I'm sick of defending black men and boys but they turn around and want to try to break me down and treat me like shit. I've never experienced so much hatred from another group of men..even when I dealt with racist white men they have never tried to act like they were going to hit me.\n\n I'm sick of it..I'm so uncomfortable around my own race of men because of all the stuff they've done and tried to justify doing. I had gotten some help from a few black men but I've gotten way more hostility and anger from them as a collective. And every time a black man acts like he wants to hit me and I'm around other black men they just all stare and don't do shit about it, but later want to talk about being protecters and providers. I told my ex about it and he hasnt said anything (he's black) ,I asked if he was even going to ask if I was okay..no response. He's been texting me obviously wanting to have sex but you can't even pretend to care? \n\nI hope I'm allowed to post this here. I don't really know if I'm allowed because there's other races of women here. I hope this doesn't come across as hate speech. I just feel like misgynoir and violence against women within the black race isn't talked about enough even with these youtube channels I feel like these things aren't getting enough coverage or people just write us off as being bitter. And yes I got referred to a psycharist, but for anxiety. I'm scared of having ptsd on my record but I do think I may have it..I still think about the teacher that bullied me and it happened over 6 years ago.",
    "title": "I'm tired of dealing with misgynoir from men of my own race",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1694384962,
    "score": 226,
    "keyword": "man teacher"
  },
  {
    "text": "Imagine if the genders were swapped A boy is wearing a tight shirt in high school. His female teacher stops him and asks him to change; this is backed up by the principal and he is sent home and told to come back when he's wearing looser clothes that don't tempt his teacher. \n\nA man is at a party wearing a tank top, the sides are cut out and you can see his six pack. Later, he tells everyone a woman raped him. They say but wasn't it actually your fault for wearing a shirt that showed off your body? You should have worn something different if you didn't want to be raped, you really were kind of asking for it. \n\nA man is at a pool shirtless. Women walking by begin calling out derogatory terms to him and staring at him, some even approach him, putting a hand on his thigh and getting angry or violent if he does not respond politely. He finally begins responding politely and later is cornered by one of the women. She tells him if he didn't want this then he should have said so earlier. His friends see no problem with this when he tells them and tells the man if he has an issue he should just have covered up. \n\nI just read an AITA post about a woman told to cover up in her own pool that inspired this. These are all obviously insane but this is what most women face their entire fucking lives. If it's not okay if women are doing these things, then it is also equally not okay if men are doing them.",
    "title": "Imagine if the genders were swapped",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1674884400,
    "score": 183,
    "keyword": "man teacher"
  },
  {
    "text": "Why do people always defend/act oblivious about the creepy guy When I was 13, I had a really creepy gym teacher who of course was also the softball coach. One morning, I felt really sick and left early. My friend texted me saying that he asked her FIVE TIMES in the span of like 30 minutes “How’s OP doing? Can you let her know I hope she’s okay? Has she responded yet?” When I told my brother this he said “Well yeah obviously he’s concerned, you’re his student and he’s your coach.” Even though I told him all the other BS this man would do. When I told him about how our grandpa (moms side) was creepy and would send me bitmojis out of nowhere saying “Love you” or “Thinking of you” but wouldn’t send my brother any texts like that, he said “It might just be his way of girl talk” Tf does that even mean? I’m his granddaughter!!!\n\nA week or so before my 8th grade year started, I went with my dad for meet the teacher day, and I ran into my OTHER softball coach. He told my dad “We were talking about her yesterday. Trying to figure out how to get her to talk.” W.T.F. (I’m a very reserved person) I don’t remember what my dad said but all I could do was stand there wide eyed and confused. When we got in the car to go home I said “Don’t you think that’s weird?” He went “Oh. I didn’t think so.” Bruh. \n\nWhen I told my mom about my grandpa (her dad) she said that he would make weird comments to her as well. She told me that she thinks he has asperger’s. I don’t know a lot about that but he only does this to me and sometimes my girl cousins but 95% of the time it’s me. Last Thanksgiving she put my glass of water right by his seat at the dinner table, something she never does. I was able to move it at the other end of the table though, thank goodness. When we went upstairs, she was sitting next to me on the couch and asked my grandpa if he wanted to sit where she was sitting. I was completely baffled and I still am. I get that he’s family but still… I don’t enjoy being around him. \n\nYesterday, she and I went to lunch together and I told her about some creepy old guy last December in the skiing lockeroom who was staring at me and told me “Come on young lady smile! It can’t be all that bad!” And she told “Maybe he was trying to be nice.” No. Grown men don’t talk to underage girls in SKIING LOCKEROOMS, and tell them to smile to ‘try and be nice’. This guy was OLD too, he could barely walk. Also, I don’t see why grown men should talk to any underage girls in public AT ALL.",
    "title": "Why do people always defend/act oblivious about the creepy guy",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1701634793,
    "score": 153,
    "keyword": "man teacher"
  },
  {
    "text": "Walking around Washington DC/It's the Patriarchy I am an older woman who lives and works in DC. I work very hard and seldom get leisure time. I am a Family doctor and do meet people of all kinds in my office, but I do not think my far NW location gives me an accurate cross section of my metro area or the world around me. My patients are all ages and genders and orientations.\n\nSo today I went to the Adams Morgan Porchfest. I think porchfests are pretty common in lots of cities and towns ad it is fun to walk around a neighborhood and listen to musicians play and get a look at the crowd.\n\nIn any case, DC is generally a young city and it was energizing to be around so many young people. I was noticing so many of the young people seem to present in non gender conforming ways. I was struck by a tee shirt on a person that said, \"Raise boys and girls the same\". It got me thinking. I was pondering the universe and moving to the rhythm of the music, when something started to make sense to me about the rise of folks who present to the world in an array of gender and style. \n\nIt's all completely clear that this is a generation who is raging against the Patriarchy. The culture wars are about breaking down the established cis het white male dominance of everything. I am 63 years old. In my generation, we were all forced into gender norms that seemed to be cast in stone. When I worked hard to get into the advanced math and science programs both in high school and college, I was told, more than once that I was taking a man's spot and that the only benefit was basically to be good breeding stock for the promising young men I went to school with. (not kidding at all.  My High school chemistry teacher and English teach told me this in front of the class. A professor told me this is a large lecture hall during Genetics class.) My generation helped break the glass in that way. but it was always the Patriarchy and it still is. \n\nWomen can have masculine traits and men can have feminine traits and we do not have to fit neatly into our gender assigned at birth. We don't have to be normative by the rules of patriarchy to any gender or any sexual orientation. we need to break the Patriarchy and they hate it. \n\nYou do not need to be cis, You do not have to be trans. You do not have to be white. You only have to be human and have respect and love for others and for this gorgeous planet we abuse.\n\n/end rant",
    "title": "Walking around Washington DC/It's the Patriarchy",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1684634197,
    "score": 154,
    "keyword": "man teacher"
  },
  {
    "text": "How we treat teen girls after assault is infuriating. Thinking about my experience pissed me off. The system failed me. I was groomed for 10 years.  Since it was all so subtle, when the police were called i was only aware of being assaulted one time (i was 15 and woken up by him trying to eat me out. He stopped when i said no).  After extensive CPTSD therapy (CPT) i have realized the extent included collection of child porn, stalking, & drugging me twice.  These are not recovered memories but all so subtle and minor seeming over a decade i almost didnt notice. To this day he tries to reach me, its been 12 years.\n\n- **The mental health professionals** \n'so it sounds like you have ptsd even though your trauma wasn't that bad'\n'it sounds like you dont like your moms boyfriend but is it possible you just have a crush on him?'\n'lets start with why you dont relate to being a virgo instead'\n\n- **the 2 cops who interviewed & home checked**\n'whoa! I saw his concert last week. He was so good! Are you sure?' ... Yeah im sure\n'were you on drugs at the time of the assault?' No. Uhh.. birth control. Lol.\n'Did you see his face?'\nTechnically no. but i saw his dumb pony tail. How he tightened it while he did his annoying walk out. While wearing his favorite red loose sleeveless t shirt currently hanging in the closet. and he gave me notes, yelled at me and texted threats at me the following weeks.\n'did you keep those?' no. I wanted it to go away.\n'that was not very smart of you was it' i guess not.\n'you didnt want to press charges did you?' No. I dont know i think i just want him out.\n'Good call. Abuse is impossible to prove. Theres one girl who was raped  by her brother and dad for 10 years and collected evidence so she MIGHT get a convonction if shes lucky.'\n\n- **closing the case & statute of limitations**\nIt was 5 years in California at the time. So when i was 20 in a group of friends studying for a final i got a call.\n'your case is being closed this week. We just need to make sure that the information in your report is correct. It looks like you were high and never saw who did this to you'\n\n- **The family**\nMom not believing me for 12 years, did you know moms who were assaulted are more likely to not believe their daughters? \nStep mom - i told this year and she completely blames my mom and now my family holidays are impossible.\nThe sister chosing him over me \nDad was great! Which is shocking. Since i barely have a relationship with him at all, maybe that's why.\n\n- **religious private schools**\nI told friends i was abused. They told the school. They called home not the police. To bad he answered and cleared it up. They prayed for me to stop being so bad.  They watched me cut. They called home again. I got in trouble.\n\n- **And to get preachy here, the media**\nIf i see one more ad where a 16 year old seduces her teacher, step dad, friends brother who is 23 i swear to fuckin god ill lose it.  Neurotypical non creepy adult is attracted to a child.  This type of media normalizes it and left me for yeara wondering 'shit. What did i do to make him think i liked him?? Everyone knows men like teenage girls and im basically an adult and he obviously thought i was hitting on him.' he was a 58 year old man.",
    "title": "How we treat teen girls after assault is infuriating. Thinking about my experience pissed me off. The system failed me.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1676574432,
    "score": 149,
    "keyword": "man teacher"
  },
  {
    "text": "Thursday                                   Had an interesting Thursday, felt like sharing a journal entry. Apologies for the formatting\n\n Thursday\n\n\tI hurriedly knock, apologize for the wait, pull up my stool and sit down. Bob sits in his chair; I sit on mine. His hands are shaky today, clasping a hand written note with five items on it. “I’m tired.” Bob is an engineer by training, long since retired. He’s often understated, but always organized. “I just don’t seem to have any energy and I get short winded these days.” These are items one and two. He doesn’t look at me, just peers over his rimmed glasses at his note, neatly penned on fancy stationery with geese at the top. His wife was fond of geese, and used to be his focus during visits with me. \n\nMy mind drifts a bit. I’ve read about Bob before I stepped in the room. It’s my job, you see. I’m to fix his problems, ease his dis-ease. Set things right. But in Bob’s case, I already know he’s full of cancer. I’ve been walking with him, starting 2 years ago at diagnosis. I have been there through his cryoablation of kidney cancer. Clear cell renal carcinoma. The procedure nearly killed him, and he recovered very poorly and slowly. Bob became very confused, as is common with people with mild cognitive impairment after a large insult to their body. It looks a lot like Alzheimer’s, and is similar, in a way. The disorientation, confusion, frailty. Family was concerned he didn’t know who he was, where he was, when it was. That he was so weak and unbalanced, falling all the time. He used to lead his family, a strong patriarch. Daughters and son in laws would tell me that something just wasn’t right, that he seemed a mere shell of himself. A wraith, faded away and unable to take care of Mabel. It had been my idea to put them both in the nursing home, and a bit of paternalistic nudging saw it done. \n\nHe eventually recovered after spending many unhappy months in long term nursing care. During his stay, Mabel withered away from a myriad of conditions including paralysis of a leg, a stroke and too many birthdays. She’s been buried more than a year now. I remember signing her card from the clinic. “It was a privilege to have played a small part in Mabel’s care. Thank you for the opportunity to be a part of your lives, and my sincere condolences at your loss.” I’m sure I wrote some such platitude. I sign a few of these cards each week. Some I know better, some less well. \n\nNow it’s Bob’s turn. He is telling me that sometimes he has such terrible pain in the right flank that he cannot stay standing up to shave, and has to sit in a chair. He’s stoic, quiet, and understated, the way many octogenarian men of his generation are. I’m sure he is minimizing his pain. “I see you saw the oncologist last month. What did they tell you?” I ask. “The spot in my lung is smaller. We’re going to do another CT in a few months. Looks like it is going well,” he tells me. I’m already running behind, about 10 minutes. I have a choice, I can have him follow – up with oncology, and do a standard fatigue workup. Check some blood, some iron, talk about sleep, depression and send him on his way. I mean, he’s already seeing the oncologist for his cancer, right? They’re taking care of things. \n\n“Did they tell you that you that this cancer is going to kill you? That this is a terminal disease, and will likely be the cause of your death?” There’s a loud silence. Deafening. Bob stares at me. I look back and him and sit, perched with my legs crossed, peering back over my glasses and waiting with open body language for his response. Seconds pass. Tens of seconds. His hand shakes, and squeezes his list, crinkling the paper audibly. He knew, or at least I suspect he knew, that something was very wrong. I had read the consult notes, full of euphemisms such as “conservative approach” and “longitudinal monitoring.” I don’t like these words. Die, death, kill, fatal. These words are better. These are not nice words, but there is no mistaking their meaning. If I think a patient is going to die, I tell them “I think you are going to die.” It’s too easy to weasel out of the discomfort and couch things in medical jargon and pleasant euphemisms. \n\nThese situations often put me in mind of an apocryphal story I was told in my training. A Mexican immigrant had been at the hospital, admitted after some terrible injury. He was whisked from the emergency department to the operating room by the trauma team. As often happens, despite the best efforts of the team, this poor man succumbs to his injuries and dies. A resident, a doctor in training, is dispatched to the waiting room to break the news to family. No one in the family speaks English except the 14-year-old son. “I’m sorry to give you this news, but we’ve lost your father,” the resident solemnly intones. After the deceased’s son translates the news, the family is appropriately shocked, grieving wife, daughters and sister begin crying. The resident withdraws to give them time to grieve as a family, but when he returns in a few minutes with the attending physician and ancillary staff, the family is nowhere to be found. A harried search ensures, and the family is found wandering the hospital grounds in the parking lot and surrounding park, calling out their father’s name. He was lost, and now they have desperately gone to find him. \n\nQueue morbid laughter. The lesson here was supposed to be – always used a licensed hospital interpreter and never family members. Also use plain language and not euphemisms or expressions. “Your son is dead.” “Your wife died.” It seemed silly at the time, and I’ve never been able to verify if it was actually a true story. But I’ve had occasion to tell so many people “your baby is dead” that I can’t remember them all. But my teachers were right, because I’ve seen what happens when it isn’t said that way. \n\n After the long silence, Bob clears his throat. “Oh. I didn’t realize that it was that serious. I thought it was no big deal.” “I think your body is wearing out. This isn’t good news, and you have uncurable cancer. That’s why you’ve been so tired. That’s why you’re getting more short of breath.” \n\nBefore walking into the room, I spent 10 minutes between patients hurriedly pouring over prior testing that I had ordered and specialists had done. Normal Echocardiogram 6 months ago, EF 55%, grade 1 diastolic dysfunction, blood pressure normotensive, no significant weight gain, mild weight loss of 3 lbs in 2 months, physical exam is euvolemic today, no conversational dyspnea; my medical assistant tells me he had mild exertional dyspnea with normal Sp02 from his walk in from the waiting room. Physical exam unremarkable. Bronchoscopy with endobronchial ultrasound done 3 months ago for hilar adenopathy with 2.8x2.1cm subpleural right mass with no evidence of lymphatic spread, surgical path of subpleural lesion consistent with renal oligometastatic disease, not a lung cancer. Suboptimal sampling of the lymph nodes. Cannot exclude regional metastasis with persistent right hilar lymphadenopathy on repeat CT chest. No clear evidence of regional recurrence in right kidney, changes consistent with post-ablation therapy, clinically correlate. New 1.8x1.6cm mass at upper pole of left kidney, concerning for renal malignancy; recommend MRI and/or tissue sampling/excision for further evaluation. No evidence of abdominal or pelvic metastasis. \n\nI am not a cancer doctor. I don’t want to be wrong. Can’t be wrong. I’m giving a terminal diagnosis. He asks me “Well, what do we do next? Can we beat this thing?” I already know the answer is no. I tell him a rehearsed script about how doctors like to fix problems, but some things cannot be fixed. That we can actually do more harm than good trying our very best. I broach the topic of hospice. He wants to know how long he has. They usually ask me this. I tell Bob that I will give a call to his oncologist, because these things are unpredictable, but that I think I would hurt him more than help by doing more tests, more needles, more tubes, more tests. I tell him that patient’s on hospice actually live longer than patients receiving aggressive care. (I doubt myself, and look up the study again for probably the 40th time, per AAFP review from 2007 showing that patients with a terminal diagnosis of cancer had a median survival that was statistically significantly longer in lung, pancreatic or metastatic melanoma by up to three months but not in colon, prostate or breast cancer. This is likely not generalizable to my patient. Evidence based medicine is a bitch). \n\nTime’s up. Time to send Bob out the door. He came here with a list of 5 things, and his chief complaint is he wants to be less tired. Instead of making him feel better, I told him he’s dying, so long and thanks for all the fish. I am now 35 minutes behind. I have 4 patients waiting. An infected butt abscess, a cold that needs a work note, a well-known-to-me patient who is a demanding hypochondriac and someone who has been waiting to get their child vaccinated so they can get back to work. I give Bob an after visit summary (what a fucking joke), some promises that I will talk to his cancer doctor, to his daughter and that I will call him later. \nTime for the next patient. I put on a smile, open the door and ask a 13 year old if he’s decided what he’s going to be when he grows up. “Did you do anything fun this summer?”\n\nSomewhere in the middle of my day I call the oncologist. He agrees it’s recurrent, metastatic and now with a probable new primary malignancy in the left kidney. Bob is not a curative treatment candidate, and a poor candidate even for palliative immunotherapy. They agree hospice is “reasonable.” “These kidney cancers are weird. Could be weeks or years. You never know.” Thanks. The oncologist asks how my father is doing, and to say hi. He’s worked with him for decades. “Still chugging along. Go “local sports team” I say.” \n\nI finish my day early somehow. I have 27 phone messages, 32 lab and imaging results, 8 cc’d notes, 14 MyChart™ messages to address. One of these is a phone call from Bob’s daughter. Bob called her and told her he “doesn’t have long,” – Provider please address, the copied message says. I call and talk with her, tell her that I talked to oncology, they agree that he’s terminal. Yes, it’s serious. No I don’t know why this wasn’t more explicit at their last visits. Yes, he has a new cancer in the left kidney. I talk about hospice. Bob and his wife Mabel and daughter had a great experience with hospice care during the end of her life (go me for early referral? #selfcare). Yes, they’d be open to visiting with hospice for admission. I call Bob and repeat everything. I call my hospice coordinator. He’s to be admitted tomorrow. Not every nurse saves lives. God made some to give out angel wings. \n\nTomorrow is Friday. TGIF.\n\n\nI stare at my computer for a bit at the end of the day. I picture Bob sitting alone in his assisted living apartment, clutching his stationery with the fabulous geese on top. Five problems. In the dark. I cry for a little while by myself, then pack up to go home. \n\n\nThursday.",
    "title": "Thursday",
    "subreddit": "medicine",
    "timestamp": 1694753414,
    "score": 135,
    "keyword": "man teacher"
  },
  {
    "text": "What the Hippocratic Oath really says I remember having to recite the Hippocratic Oath during medical school inauguration, and afterwards the phrase \"First Do No Harm\" was probably engrained in our minds as its key ingredient. I'm currently reading *The Classical World: An Epic History from Homer to Hadrian* (Robin Lane Fox), he mentions the Hippocratic Oath in the chapter *The Eastern Greeks* that made me look up its history (I guess I was never curious enough to even wiki it). Apparently the one we recite in modern times is a [revised edition](https://www.pbs.org/wgbh/nova/doctors/oath_modern.html) from 1964. \n\nThe original version runs as \n\n>I swear by Apollo Healer, by Asclepius, by Hygieia, by Panacea, and by all the gods and goddesses, making them my witnesses, that I will carry out, according to my ability and judgment, this oath and this indenture.  \n>  \n>To hold my teacher in this art equal to my own parents; to make him partner in my livelihood; when he is in need of money to share mine with him; to consider his family as my own brothers, and to teach them this art, if they want to learn it, without fee or indenture; to impart precept, oral instruction, and all other instruction to my own sons, the sons of my teacher, and to indentured pupils who have taken the Healer's oath, but to nobody else.  \n>  \n>I will use those dietary regimens which will benefit my patients according to my greatest ability and judgment, and I will do no harm or injustice to them. Neither will I administer a poison to anybody when asked to do so, nor will I suggest such a course. Similarly I will not give to a woman a pessary to cause abortion. But I will keep pure and holy both my life and my art. I will not use the knife, not even, verily, on sufferers from stone, but I will give place to such as are craftsmen therein.  \n>  \n>Into whatsoever houses I enter, I will enter to help the sick, and I will abstain from all intentional wrong-doing and harm, especially from abusing the bodies of man or woman, bond or free. And whatsoever I shall see or hear in the course of my profession, as well as outside my profession in my intercourse with men, if it be what should not be published abroad, I will never divulge, holding such things to be holy secrets.  \n>  \n>Now if I carry out this oath, and break it not, may I gain for ever reputation among all men for my life and for my art; but if I break it and forswear myself, may the opposite befall me. – Translation by W.H.S. Jones.\n\nHere's what Fox has to say:\n\n>It is probably in the eastern Greek world that we should locate the most widely cited and endorsed of all Greek prose texts: the so-called 'Hippocratic Oath'. Doctors still contest, or appeal to, its principles, but within Greek medicine it was only the 'oath' of a minority of practitioners. There is no reason to ascribe it to the great Hippocrates, the most famous early Greek teacher of medicine who is linked to the east Greek island of Cos. Like Hippocrates himself (probably an early to mid-fifth-century doctor), its date is unknown, but its morals and ideals have been upheld for centuries as a tribute to 'Greek science'. As a 'charter text', what it says is sometimes misrepresented by those who appeal to it. It is even cited in support by those who disapprove of euthanasia. What it actually requires is that doctors swear not to assist poisoners, rather than not to assist those who wish to be helped to die. Most modern doctors still admire the clause against the sexual harassment of patients, women as well as men, although the Greek oath also protected the persons of slaves; most doctors are less keen on the oath not to give a pessary to a woman 'to assist an abortion'. The clauses swearing to share one's livelihood with one's teacher in medicine and not to repeat gossip heard in the course of everyday life, outside professional hours, disqualify even the most admiring modern doctors from the halo of the Hippocratic Oath's observance.",
    "title": "What the Hippocratic Oath really says",
    "subreddit": "medicine",
    "timestamp": 1682835289,
    "score": 69,
    "keyword": "man teacher"
  },
  {
    "text": "I think I'm done I have been a registered nurse with a BSN since 2011. \n\nI worked in emergency, public health, occupational health, psych, med-surg, and med-surg tele. \n\nAfter working for such a long time, I think I'm done with nursing for so many different reasons.\n\n1. People don't believe I'm as educated as I am. I'm a 6'3\" Black man. When I come to work, I often get mislabeled as CNA (LNA in some states), LPN, or ADN by patients, their family members, or hospital staff even though it has my credentials on my name tag. There is nothing wrong with those credentials, but I worked hard for my bachelor degree, and I always noticed that people won't attempt those same labels to my non-Black coworkers. It is pretty lame. I probably shouldn't tell them that I also can speak Mandarin and can do magic tricks with playing cards. \n\n2. Being told I'm not leadership material yet wanting me to train others. This is more specific. I have precepted multiple people, but the one that sticks out to me was precepting someone with way less experience (been a nurse for less than a year) and management chose this person for a promotional position over me. Definitely brought my piss to a boil.\n\n3. I have been reflecting on my own life more. I really have been thinking about how I want my life to be. This just doesn't feel right anymore, but I'm also conflicted because I can logic my way out of quitting permanently. Shoot! I even quit one time and became a teacher overseas and only came back because of family issues.\n\nAnyways, I can feel the burnout, but I'm just not at the point of cremation yet. More like a zombie or one of those pirates that stole the cursed gold in the Pirates of the Caribbean movie. \n\nStill don't know what to put this under. Burnout or rant... Maybe \"burnant\". That seems legit.",
    "title": "I think I'm done",
    "subreddit": "nursing",
    "timestamp": 1682876912,
    "score": 114,
    "keyword": "man teacher"
  },
  {
    "text": "My heart broke today running into a former student I don’t want to post this on my fb and look like an a@@hole seeking attention. But I need to process and unload with people who understand. I was out with my college age daughter today and had to stop at dr office that happens to be in a horrible part of town. She wants Starbucks but then remembers the dive burger place nearby. I jokingly told her, “sure let’s get a burger and maybe shot today. I’m game!” And that is where some divine intervention happened. We go in and there is a homeless man that was so pitiful looking and smelling. Took my breath away. I also got that energy that something bad may go down. Then I’m telling myself to stop. But he was strung out on something. He keeps trying to get my attention. He finally makes eye contact and I said hi to him. Then… he says to me “you were my teacher, do you remember me?” I did! Couldn’t remember name because I’m 54 and been at this for over 3 decades. I had him in first grade and my daughter was one year ahead at same school. So we talk and bless him he was struggling. He is homeless and just got out of drug and mental rehab. At this point I’m just sick to my stomach. He walks outside and I ask the workers if he was causing any issues and if he had eaten. No, to both. So I go outside and ask him if I could buy his lunch. Next thing you know he is showing me his belongings and that is all he had. Sadly, some drugs were given to him by someone. He showed me he had no tracks on arms and I saw no needles. I went into teacher/mom mode and he told me what the pill number was. I told him he can’t be using meds someone on Street gave him. He showed me other things he had dug from trash cans. I then talked to him about a contact I have with homeless services in town. But he said he would rather be on streets. That’s when it hit me he was truly on something. I also found a kit that someone from an agency gave him to clean himself. I really just wanted to fix him right there but knew this is way bigger than the bandaid I had. So I took him inside the place and ordered him a meal and told him he had to be nice and respectful to everyone there. He thanked me over and over and then hugged me. I told him to be safe and take care of himself and find a safe place on the streets to sleep. I also told him to consider a shelter. When I walked away, kids sitting at another table asked who I was. As I was getting in my car I look up and he says, “that was my first grade teacher.” He also had a huge smile on his face. I waved to him and told my daughter I was going to lose it when we pulled away. I ended up driving around the block a couple of times. My daughter said I did everything I could for him and not to feel guilty. But damn, he is only 19 and has been homeless awhile. It just sucks he was born into a shitty environment and was not able to climb out of it. But I always tell my kids on the last day of school they will always be one of my kids. So today, he is still my kid. And I got his belly full and he smiled. Hopefully when he lays down tonight he remembers I still care. Now I’m crying and just wish I could have done more. Thank you for letting me get this off my chest.",
    "title": "My heart broke today running into a former student",
    "subreddit": "Teachers",
    "timestamp": 1686950495,
    "score": 43210,
    "keyword": "man teacher"
  },
  {
    "text": "Student saw consequences in the workplace! Fool around and find out! I live where I teach, and shop at the local grocery store that employs a ton of our students (because it's a shitty job and most places that hire high schoolers are shitty jobs). Some of the knuckleheads actually bear down when they have a paycheck dangled in front of them and working is actually very good for them, a couple graduated seniors are even assistant managers. \n\nHowever, some of them try to carry their school behavior into the workplace. One in particular was always a pain. I never taught him but wrote him up a few times for hallway behavior. Even as a senior, he behaved like a 5th grader (actually no, this is an insult to 5th graders) but got everything excused because he had an IEP and an enabling mom. It got to the point where flipping desks and telling teachers to go fuck themselves just got excused by admin with a 15-minute detention where he was allowed on his phone. He barely graduated, I'm certain somebody fudged his grades to avoid the trouble. This young man cannot function in society. \n\nI'm chatting with one of the graduated seniors working there for the summer, and he said that X got fired after a single shift working. I asked what happened, and he said \"X was sitting on a pallet of product, eating snacks off the rack, vaping, and sitting on his phone. Our manager came over to talk to him, and he told her to go fuck off and die. When he got fired, his mom came in screaming about how he has extended time in his IEP and deserves a retake of his first day. We had to call the cops to get her to leave.\"\n\nLack of consequences in school lead to this type of situation in the workplace.",
    "title": "Student saw consequences in the workplace! Fool around and find out!",
    "subreddit": "Teachers",
    "timestamp": 1687138384,
    "score": 15216,
    "keyword": "man teacher"
  },
  {
    "text": "You want summers off? Become a teacher At a family picnic this weekend I kept on getting teased about the fact that I get summers off and that I’m not working a part time job over the summer. My one cousin in particular was insufferable about it because he has a STEM degree and I make more than him (strong union state) plus have summers off. \n\nHe shut up really quickly when I said “hey man you have a bachelors in biology, you can get a teaching certificate done post-bacc in a year or two. Plus as a science teacher you would have a really easy time finding a job.” Something or another about how he could never deal with teenagers all day and that he was done with school, he was just too smart for it and didn’t learn anything (total bs)",
    "title": "You want summers off? Become a teacher",
    "subreddit": "Teachers",
    "timestamp": 1685385280,
    "score": 6292,
    "keyword": "man teacher"
  },
  {
    "text": "Shut your CRT ass up! My husband last night wanted to have dinner with his parents and I was down. Then he mentioned some of his parent’s friends would be there, and I was still willing to go because the in-laws are my in-laws. \n\nLet’s call the new friends Marti and Barty. Marti seemed like a nice and sweet lady, but Barty on the other hand was a real asshole. \n\nWhen we first got there my in-laws and their friends were in the dining room eating, and my husband and I are were in the living room. While we were eating I thought I overheard Barty saying some real off-putting shit about Mexicans and Cuban, but whatever I let it slide because I wasn’t sure. \n\nAfter they got done I heard my MIL say let’s go to the living room to join us, and oh my I wish I would have left then because they brought up that I was a school teacher. \n\nIt was the usual I wIsH I hAD tW0 moNthz oFf or I CoUlD dO tHaT jOB iF iT wAsNt fOr thE kiDs teeHEE and blah blah blah blah. Nothing that really bothers me because I, my husband, and in-laws know how hard I work, so whatevs. \n\nThen Barty says, “I hear they’re teaching kids to be racist in schools.”\nFIL replies, “No, they are starting to teach Critical Race Theory.”\nBarty, “Yes thats the thing” and then they both look at me.”\nSo I say, “No, no one is teaching CRT, and it’s not even in most state standards.” Barty says, “No they are teaching it at schools because I heard it from Dr. Phil.”\nThen I politely say, “No, actually they are not because K-12 students cannot grasp CRT. CRT is usually taught in grad school or upper level college, teaching CRT would be unable to be taught to K-12 students because they do not have a firm understanding of Law, History, or theory to properly apply CRT”. \nBarty stares at me and says, “We’ll it’s being taught.” \n\nI cannot fathom how people still take the word of Dr. Phil these days lol and this man knows no teachers and ain’t even from here. \nSo what I really wanted to say is “SHUT YOUR CRT ASS UP. Motherfucker, YOU don’t even know what CRT is! Students aren’t even on grade-level and you think they can learn CRT??” \n\nBest part of last night was the official start of summer! It was also my birthday! And FIL said we ALL would have dinner again next week! Yaaaaaay!\n\nEdit: wow I did not think this would blow up like it did lol thanks for the coins, idk how to use them but I’ll figure it out 😆 and thank you for the responses as well some of them were hilarious too. \n\nSomeone commented I should make videos or posts about this subject matter and honestly it’s worth it. Even if I wasn’t teacher, you all out there are amazing individuals, and yes the compliment even extends to those who judged me based on this post or my Reddit account. \n\nFinally, I just wanna say that I was raised and believe that everyone does deserve respect and kindness, especially if you are a guest in someone’s home, and if anyone ever were to cross a line or boundary l was also taught to stand up for myself too.",
    "title": "Shut your CRT ass up!",
    "subreddit": "Teachers",
    "timestamp": 1685809259,
    "score": 6051,
    "keyword": "man teacher"
  },
  {
    "text": "Security guard fired for pulling student off teacher they were attacking! My colleague two doors down was attacked by a student during passing period for taking her phone and sending it to the office and assigning a lunch detention! The student shoved the teacher to the ground and begin hitting her and kicking her! Our security guard is a larger man ( think football build) and grabbed the student from behind by her shoulders to remove her! Well apparently he did. Ow know his own strength because he left a bruise where he grabbed har! The parents came up to my school the next day and now this man is out of his job for merely doing it! Make it make sense",
    "title": "Security guard fired for pulling student off teacher they were attacking!",
    "subreddit": "Teachers",
    "timestamp": 1692957879,
    "score": 5596,
    "keyword": "man teacher"
  },
  {
    "text": "I got a single man tear tonight... Someone asked me tonight the most awkward encounter I have ever had with a student outside school, and I thought of this moment.\n\nI'm wandering through a grocery store looking for snacks. Following checking out, I run into a graduating senior I had a few times. He looks panicked and shocked when he sees me. He immediately runs to meet and grabs me arms.\nS: Thank God, Dr X, I need you.\nMe: Uh, OK...\nS: My girlfriend is late.\nMe: Do you need a ride?\nS: No... she's late late\nMe: [realizing] Oh!\nS: What do I do?\n[discussed several things and settle on him purchasing a pregnancy test]\n\nAs the student checked out, and then he hugged me. He followed the hug with, \"Thank you thank you thank you, this is why you're the one teacher students trust.\" I said thank you and when he left I got the single man tear down my cheek.\n\nN.B. - ran into student several months later, and he was happy with the outcome.",
    "title": "I got a single man tear tonight...",
    "subreddit": "Teachers",
    "timestamp": 1690681459,
    "score": 4100,
    "keyword": "man teacher"
  },
  {
    "text": "Saying \"Catch a Bubble\" is now racist... At least according to my school's admin. A bunch of Kindergarten and first grade teachers were told that in a meeting. The teachers were completely confused because they've been saying it for years and asked for an explanation, but of course admin was not able to explain any of their reasoning behind it. One teacher (white woman) was specifically told that she \"doesn't understand the culture of the children (title one school, mostly African American)\" to which she reminded them that she is engaged to a black man and has a mixed race child. They didn't respond to that either and basically the teachers were told if they are ever heard saying it again, they would be fired. \n\nI tried searching this claim and found something about how it's equivalent to telling kids to \"shut up\", but even that seems like a stretch. Nothing about how it's racist. \n\nAnyone else ever heard this?\n\nEDIT:\nTo clarify: I don't think it's racist. I'm just curious if anyone has dealt with something similar with that phrase or another management skill with their admins trying to be \"white saviors\". Also can't believe that of all the issues my school should be dealing with, this seems to be the focus right now. We literally had a child bring bullets into the building last week and that's being completely covered up.",
    "title": "Saying \"Catch a Bubble\" is now racist...",
    "subreddit": "Teachers",
    "timestamp": 1697473897,
    "score": 3983,
    "keyword": "man teacher"
  },
  {
    "text": "Update on teacher who was peed on & vandals I posted a few days ago about a young man who decided to pee on a teacher on his last day of school. Well, here's a update. Turns out he turned 18 in march.\n\nHe was held in the county jail over the weekend without bail.\n\nHe has been charged with 2 **felony's** (I'm leaving this here, it seems to be pissing some people off) and 2 misdemeanors.  There are a couple of other pending charges, but they need to go to a grand jury.\n\nHe was arraigned Monday morning and was given an OR bond. He was also ordered to have no contact with the teacher and to stay at least 500' from her, her home and place of work. This is in effect until this is resolved.\n\nThe teacher who was peed on is obviously livid and distressed over the matter. The young man apparently walked into the area she has her desk, and peed on the back of her feet. The way her desk is set up, there's only one way in, and out of the area.\n\nApparently this kid has been threatening to do this since after Christmas break. This came from a situation when he asked for the third time to use the bathroom and was told no. He told her he would \"piss on her heals the last day of school\" and she dismissed it as his running off at the mouth. \n\nAs for the vandals and their \"senior prank\". As of yesterday, the number I heard was over $7 k in damages. Mostly furniture that was busted. Looking at some of the security video, they hurled chairs down the hallways. One of the entry doors to the rear of the school had the glass busted out.\n\nThey used a sub teacher key to enter the building. We knew that a few were missing, and they figured that subs were walking off with them. They need to account for them better. I asked why the alarm didn't trip. Was told that because there is only a three hour gap between the over night custodians and the day custodians, they don't arm the alarm. It only goes on over the weekend and long breaks.\n\nThe kids who were involved were all given 10 day suspensions. That means none of them will walk this weekend, and three will have to come back when summer school picks up to take a couple of exams.\n\nNo one will be given their diploma's or transcripts released, until the bill for the damage is paid in full.\n\nThat prompted an Marine recruiter to visit yesterday. One of the three is scheduled to ship out to Paris Island in June, and can't without a diploma. Of course, there are parents screaming about it as well.\n\nThe way I and others see it, they put their heads together and pulled their prank, they can put their heads together and figure out how to pay it off.\n\nThe senior pranks here have been mostly annoying at the worst. This went over the line. The pisser had nothing to do with the prank, and is just a little asshole. I'm hoping the juniors are paying attention, and don't try to outdo this group. I'm also hoping the school board doesn't cave in and let the kids off the hook. They need to allow more out of school suspensions, expulsions and even detentions to resume. In the meantime, I'm looking to go elsewhere, and have a couple of prospects.\n\nEDIT: \n\nFor those of you who seem to think she had it coming because she wouldn't let the kid go to the bathroom, you need to understand this. **He was the kid who asked to go every single period. He never actually went to the bathroom.** The would wander the halls. He's been caught several times outside on the basketball court, playing invisible basketball, among other things. Normally, he liked to walk into classes he didn't belong in and cause problems.\n\nIt came to head with this particular teacher during a fire drill just after Christmas break. The kid went to the bathroom, except he didn't. The fire drill came down, and she couldn't account for the kid. She red flagged and the fire marshal and others had to look for the kid. It took a half hour, but they found him near the middle school. \n\nShe got her ass reamed over that, of course he got little more than a smack on the hand. \n\nShe decides to limit one student to the bathroom at a time after that and limits the time you're to be gone. Of course she's more lenient to others. He decides he wants to go a third time one day, there was already a kid out. She says no, he gets mouthy and his threat comes then. \n\nSo, for all of you know it all's, who think she was wrong for not letting a kid go on a little walk, you'd be the first ones asking why the school allowed him to go if he'd hurt one of your little darlings.",
    "title": "Update on teacher who was peed on & vandals",
    "subreddit": "Teachers",
    "timestamp": 1685034500,
    "score": 3333,
    "keyword": "man teacher"
  },
  {
    "text": "Teacher haters just got schooled on overtime. I was in the back-to-school section and there were several people near the filler paper. A lady and her husband were ridiculing another woman because she took “too much” filler paper to send in to her children’s teachers.  They pulled the “they only work 9 months” BS.  Another teacher joined in their argument.\n\nThe topic of overtime came up and the man said something along the lines of *“I WISH I could get more overtime.”*  The teacher said, *“that’s because you get time and a half for your overtime. They stop paying teachers before they even reach 38 hours, but that doesn’t mean we stop working. Even coaches and tutors are lucky if they get a stipend that is less than their regular rate.”*\n\nMan looks physically frustrated, grabs his wife, and leaves his cart in the store.  I went to congratulate the teacher.",
    "title": "Teacher haters just got schooled on overtime.",
    "subreddit": "Teachers",
    "timestamp": 1690569190,
    "score": 1932,
    "keyword": "man teacher"
  },
  {
    "text": "Teacher shortage but you have to submit a reference for every employer in the last 10 years (yikes) I left education and teaching during the 2021-2022 school year. Recently, I thought about returning so I figured I would go through the motions and submit an application because a part of me genuinely misses the classroom and kids. My school district recently changed their procedures. Now every single application has to be screen by the district team before they are cleared to be sent to interviewers at each individual school. Furthermore, as my title states, you have to have a reference on file for every employer prior to being cleared as an applicant. As of today, my school district has 400 teacher openings left to fill.\n\nAm I wrong for feeling discouraged from moving forward with it if there’s so many hurdles? Would you do it? \n\nPS: I checked with the recruitment team, the man said that if any of the employers did not return a completed reference, the application would never go through to the next step.",
    "title": "Teacher shortage but you have to submit a reference for every employer in the last 10 years (yikes)",
    "subreddit": "Teachers",
    "timestamp": 1687359514,
    "score": 1558,
    "keyword": "man teacher"
  },
  {
    "text": "New teacher quit before first period We had a math teacher quit in December. another teacher was holding their class and that connection just went to the gym. I saw that connections teacher in the room today and asked what happened because I thought we'd gotten a new teacher. \n\nWe had. He came in. Saw his homeroom during homeroom and decided he'd pay the 800 bucks to break contract and walked out. The kids didn't listen and when I tried to call admin to tell them a boy said to \"get off my tip\" to try and get him removed admin told him basically that wasn't a real issue and to handle it himself. \n\nI never even got to meet him. He didn't make it to first period. \n\nI wish I could say that this would make admin get off our dicks but something tells me it won't. \n\nHumor tag because the idea of this man walking out after working here for 30 minutes is kind of darkly hilarious.\n\nEdit: people are talking about teacher prep programs. This was a waiver teacher. He had no teacher prep programs. He was a retired engineer who came in because he saw the posting and thought he'd help out. Admin left a guy with no training on his first day just on his own and he left because he didn't need the job and didn't have a certificate to take",
    "title": "New teacher quit before first period",
    "subreddit": "Teachers",
    "timestamp": 1672962186,
    "score": 1540,
    "keyword": "man teacher"
  },
  {
    "text": "Saw my rosters. I think I’m going to literally throw up from anxiety This will be my 15th year. Or 16th. I can’t remember and I stopped giving a f*ck. Taught 6th last year in an extremely tough school. Got 10k in bonuses between finishing last year and starting this year. This school is very hard. \n\nThis year I have 6th and 7th. But each class is twice the size bc of staff shortages. And the kid who got caught “shining his mushroom” in the bathroom after taking pics of girls in the hallways is one of them. \n\nI am literally sick to my stomach. Therapy appt in 20 min. I have an interview for a library supervisor position Tuesday. I can’t afford to leave without something else lined up. And I’m dreading returning so badly that I think I’m going to puke. \n\nEveryone left from last year except one other teacher. All my friends. All the awesome admin I had last year (seriously the best admin ever). I don’t know what to do. I’m a grown-ass man with a ducking doctorate and I’m sitting here so stressed I’m crying. I wasn’t this stressed in Iraq. I’m not kidding. \n\nLast year was hell. And I don’t know how ti survive another year. \n\nHelp.\n\nETA: wow. Blown away. I’m trying to get to comments, but in short, thanks. The advice, the empathy, and the encouragement are much appreciated and make me feel not so alone.",
    "title": "Saw my rosters. I think I’m going to literally throw up from anxiety",
    "subreddit": "Teachers",
    "timestamp": 1690641879,
    "score": 1299,
    "keyword": "man teacher"
  },
  {
    "text": "Dismissed from a charter school. Here is my rant. I am one of the permanent subs that is filling open positions left by the nationwide teacher shortage.\nOn one hand, I feel like a scab. On the other hand, I make $30/hr and bill hourly to avoid the perpetual wage theft committed against certified and Masters level teachers.\nI'm sure my pro-union leanings and frequent reminders of \"this is why there's a teacher shortage\" whenever an unreasonable request was made didn't endear me to administration. Still, students suffer when they don't have qualified teachers and if that is ever going to change we have to address the reasons teachers are leaving.\n\nI do not tolerate bullying or disrespect in my classroom. I have ensured parents that my classroom is a safe place for their kids to learn. So, when I had a student constantly telling others they are poor, broke, ugly, stupid, smelly, etc., I called the office to have him removed. I did the same for one other student whose entire body language exuded contempt and disrespect.\n\nThe administrator who showed up at my door yesterday in response to the disruptive student proceeded to disrespect me further, blame my poor classroom management (I do not have a problem with my class, thank you, I have a problem with 1-2 students), complain that \"Level 1 behaviors\" were not worth his time, and then walked away from me while I was talking to him. What a dick. And clearly not the right man for the job.\n\nThere's more, but this post is long enough. I have mixed feelings about it all. Looking forward to something new. Sad I won't see my students again. Worried that all we've built and worked on will go down the drain with a new teacher. Disappointed that something I used to have a passion for has become so...this.\n\nAnyways, thanks for reading my rant. Take care of yourselves out there.\n\nEdit to add: Of course I went through all the steps of redirecting, changing seating arrangements, having conversations about the behaviors and their impacts, contacting parents, etc. before involving administration.",
    "title": "Dismissed from a charter school. Here is my rant.",
    "subreddit": "Teachers",
    "timestamp": 1696417283,
    "score": 1093,
    "keyword": "man teacher"
  },
  {
    "text": "Everyone Forgot But Kids Today's my birthday.\n\nAlmost everyone (including family) either forgot, was having a bad day in general, or didn't want to do anything. I ended up treating myself to dinner.\n\nWe did the customary cake at work - only 3 colleagues wished me a happy birthday.\n\nBut my 7th grade kids, man.... The kids made my entire fucking day. \n\nThey decorated my door with quickly written birthday wishes. One class tried (a little unsuccessfully) to do a \"surprise\" jump out and sing this morning. At lunch, some of the kids ended up running around putting the icing from my cake on each other. Some decided to tackle hug me in the hallway while screaming at the top of their lungs.\n\nI love these little weirdos. This was the first time that any of my students actually cared to try to find out my birthday, let alone act on the knowledge.\n\nI feel bad because I try to stay out of the spotlight anyway and felt like I was getting too much attention and aggravating the other teachers. I hope my kids know just how much I truly appreciated their love.",
    "title": "Everyone Forgot But Kids",
    "subreddit": "Teachers",
    "timestamp": 1684192037,
    "score": 1026,
    "keyword": "man teacher"
  },
  {
    "text": "My principal died I got to school this morning and our principal wasn't at his usual spot by the front gate, welcoming everyone in. Then one of my students came running and said she'd been sent to get me for an emergency faculty meeting. I ran to the meeting, and our assistant admin broke the news that our principal had died suddenly at home early in the morning. \n\nWe were all devastated! We all know how hard it is to find a good admin these days, and I tell you teacher friends, this man was a unicorn. He was only with us for 1.5 years, but he loved our school, our students, and our community and he had big plans for us. We had our weekly faculty meeting YESTERDAY and he was there talking about how optimistic he was for the future and how he was going to lobby at the state level for more funding for education, he was just on fire! And then this morning he got up and then was just gone. I'm still wrapping my head around it.\n\nOur district was actually great and sent a grief counselor to our school as soon as they found out.  We've cancelled school tomorrow to allow for a day of grieving. My kids are older and they were OK when I broke the news to them this morning. Mostly they were worried about me and the other teachers (they're the best). A letter went home to all our parents via email and hard copies explaining what had happened and providing mental health resources. Our school is small and close-knit and I'm so grateful that we can support each other at this time. I just needed to put this out into the void tonight.",
    "title": "My principal died",
    "subreddit": "Teachers",
    "timestamp": 1702015707,
    "score": 984,
    "keyword": "man teacher"
  },
  {
    "text": "Teachers who don't go to the police... WHY?? It seems like every other day on here we get a post like\n\n\"A student brought a knife to school and chopped off my left arm. I told administration and they gave him a lunch detention. Now the kid is back in my classroom and calls me 'Mr. Army' every day. I wish my admin supported me. Man, admins are lame.\"\n\nAnd like... what powers are compelling you to not file a police report?? Did you forget that teachers can do that?\n\nIF A STUDENT COMMITS A CRIME AGAINST YOU THAT HARMS YOU, FILE A POLICE REPORT.\n\n>!And if you're too chicken to file one, please don't post here and infuriate us for no good reason.!<",
    "title": "Teachers who don't go to the police... WHY??",
    "subreddit": "Teachers",
    "timestamp": 1676484578,
    "score": 582,
    "keyword": "man teacher"
  },
  {
    "text": "A parent reported me to admin for teaching “demonic things” to my class because of…Krampus. My students have finished state tests and always give a “fun” research project that’ll take a week to complete before we get out for winter break. \n\nThis year they have to research randomly-assigned winter folklore figures from around the world (La Befana, Mari Lwyd, Belsnickel, etc.) I always do the assignment myself first an example of what their quality of work should look like. I used Krampus as my example because it’s a relatively well-known figure in popular culture and figured everyone could familiarize themselves with the assignment easily if they recognized the research example. \n\nBetween the time it took for me to explain the project and randomly-assign figures, a student had texted their parent an image of the example assignment that included a picture of Krampus (y’know…using their phone in class, which isn’t allowed) and that parent had emailed my principal asking why I forcing their child to participate in demonic things by doing this research assignment.\n\nHere’s the kicker: after I finished explaining the project a couple students asked if they could have an alternative assignment because they didn’t feel comfortable doing this one. (I teach in the Deepest South part of the Bible Belt and several of my students are evangelicals who apparently are hardcore “Christmas is ONLY about Christ” advocates.) I agreed with no issue and assigned them an alternative (a similar project on researching their dream career) and even apologized for the assignment making them uncomfortable, explaining it was never my intention. The student of the parent who complained was among the students who were given a fair and equal alternative assignment. \n\nMy principal pulled me presumably right after they got the email and asked me about the assignment. I explained that figures were assigned randomly and that anyone with an issue was assigned an alternative project. I also explained that I had given the assignment before and never had issues or complaints; and that if I could have foreseen any problems I never would have assigned it. (That’s my genuine thought process as well. I’m a religious, but progressive person and have lived in the Bible Belt my whole life, so I can usually read what hardcore evangelicals are going to take issue with— but I didn’t see this coming.) \n\nAdministration seemed to understand and even seemed irritated that the parent would take issue. They supported me and agreed with my plan to just offer anyone the alternative assignment ahead of time to prevent further issue. So that made me feel better. But now I’m living in fear that this parent isn’t going to be satisfied with the principals’ support of me and will take it to social media. Something similar happened last year when a teacher taught “The Kite Runner”, which was in the crosshairs of M*ms4Liberty at the time. It raised a huge stink and the community crucified both administration and the teacher for deigning to allow such “filth” to be taught. I’ve been at this school for ten years and, even though I’m known as the “friendly local radical feminist liberal teacher” (a title mainly earned because I tell kids not to use slurs at each other, fully embrace my LGBTQ+ students, am straight-passing, and don’t worship a certain former president) I’m in good standing with most of the community here. I hate thinking my reputation and, potentially, career may be on the line over one hasty kid.\n\nWhich is what really ticks me off: the kid didn’t even wait to ask for an alternative assignment. They just fired off a text to the parent without even considering that I’d make accommodations for them. And one thing all my students know is that if they need something they can communicate that to me and I’m always willing to work with them. \n\nI don’t know, man. This is the kind of thing that will drive me out of the profession. Not the kids, not even the administrators— the people who feel entitled to micromanage and vilify our jobs as “caring and concerned parents” from the comfort of their couches. It’s discouraging.",
    "title": "A parent reported me to admin for teaching “demonic things” to my class because of…Krampus.",
    "subreddit": "Teachers",
    "timestamp": 1702326572,
    "score": 522,
    "keyword": "man teacher"
  },
  {
    "text": "i have never. a kid today came up to me today with a little ziplock bag and what seemed to be a brownie in it. \n\n“I brought this for you for teacher’s appreciation!”\n\n“oh wow thank you what is it??”\n\n“IT’S MEATLOAF”\n\nhonestly weirdest thing I’ve ever gotten but hey, it’s the thought that counts. Thanks for the meatloaf little man.",
    "title": "i have never.",
    "subreddit": "Teachers",
    "timestamp": 1683932289,
    "score": 517,
    "keyword": "man teacher"
  },
  {
    "text": "Apparently we're the villains Today my district organized a full day of professional development, complete with a guest speaker. He was energetic, funny, and seemed like he was connected with the current state of education. I was with him until the end.\n\nHe asked if we had ever seen the movie A Bug's Life. Then he said that the students are like the ants and we, the teachers, are like the grasshoppers. I think he was trying to illustrate how students can take over a classroom if the teacher doesn't build relationships and manage behaviors.\n\nBut the grasshoppers in that movie are very clearly the villains! In fact, there's a pretty popular quote that sums it up:\n\nHopper (the main bad guy grasshopper) says, \"You let one ant stand up to us, then they all might stand up! Those puny little ants outnumber us a hundred to one, and if they ever figure that out, there goes our way of life! It's not about food, it's about keeping those ants in line.\"\n\nEither this man completely misunderstood the moral of the movie, or he truly believes that teachers are villains and students should be \"kept in line\" through whatever means necessary.",
    "title": "Apparently we're the villains",
    "subreddit": "Teachers",
    "timestamp": 1701137747,
    "score": 472,
    "keyword": "man teacher"
  },
  {
    "text": "Man I swear teacher parents are either the most supportive or the most critical with nothing in between I got an email from a teacher parent cc’ing my principal to complain that I showed a movie in class- French movie, in French, during our unit on cinema, accompanied by students writing a 5 sentence review of the movie in French. She rambled on and on about the lack of direct instruction (I do much more direct instruction than most of my colleagues) and how her daughter’s GIEP needs are not met during this sort of activity. Her daughter is a great student who really enjoys this class but I think mom is upset that it’s a class that is actually challenging her daughter and where she has a lowish A despite trying her best. My admin is very supportive of teachers so I doubt anything will come of this but it’s still not an email that’s fun to receive on a Sunday. \n\nI swear teacher parents are a dichotomy of either being super supportive and incredibly positive or the ones who know how to game the system and go scorched earth on you.",
    "title": "Man I swear teacher parents are either the most supportive or the most critical with nothing in between",
    "subreddit": "Teachers",
    "timestamp": 1681674012,
    "score": 476,
    "keyword": "man teacher"
  },
  {
    "text": "Probably gonna get fired Had a bad formal eval. Like *really* bad. Co-teacher and I didn’t do much *teaching* when we got observed because we were running low on time that period due to external stuff and only had enough time to introduce the upcoming project. Let’s just say my post-observation didn’t go well at all.\n\nThis is my second year on the job and just barely made it last year…….and everything is just constantly flying around everywhere. Even Admin doesn’t even seem like it knows up from down half the time. I feel like things are getting down to the wire and I just feel like I’m standing in the midst of a hurricane. I’m just damn tired, man. It’s getting hard to wake up each morning and I honestly don’t want to go back to work.",
    "title": "Probably gonna get fired",
    "subreddit": "Teachers",
    "timestamp": 1700009663,
    "score": 463,
    "keyword": "man teacher"
  },
  {
    "text": "37M no kids and single. What path should I take? 37 years old. No girlfriend. No car nor driver license. Living in a rented room with flatmates. Procrastination and lack of discipline made me stagnated in life. Been working in the service industry (waiter, bartender, restaurant manager etc) for 15 years and it’s time to do something more sustainable long term and have a normal social life for an adult man. I feel Kinda lost.\n\n\\-> Possible transferable skills from my work experience:\n\n\\-English (I live abroad, so I could be a teacher in my home country if I decide to go back)\n\n\\-Customer service, of course, dealing with guests from many different nationalities\n\n\\-Stocking control, food and beverage logistics, intermediate level at Excel \n\n\n\\->Only things that I feel I’m doing RIGHT:\n\n\\-Stopped Drinking and smoking, consistently go to the gym (physically fit)\n\n\\- I know how to draw and make digital art so I am a hobbyist artist/creative person\n\n\\- I have saved more than 12 months worth of livable expenses (consider EU countries costs)\n\n\n\n\\->Career options I am considering\n\n\\-Match my personal skills: Digital/social Media Marketing; Graphic Design; UX Design\n\n\\-Match my work experience: Hotel Revenue Management or any administrative role in Hospitality; Event planner; Restaurant consulting\n\n\\-Just for the money and won't take ages to learn: Trade (like pumbler or carpentry); programming; software engineering; accounting\n\n\nAny advice would be immensely appreciated. \n\nThanks in advance!",
    "title": "37M no kids and single. What path should I take?",
    "subreddit": "careerguidance",
    "timestamp": 1694005905,
    "score": 8,
    "keyword": "man teacher"
  },
  {
    "text": "Teacher or Firefighter? I have never used Reddit but I see people find countless solutions on here.. so here it goes.\n\nI attended college to become a teacher. I am currently finishing my master’s degree in education, I’ll be done with it in May. I became a teacher because I was into sports and athletics, I loved the summers and holidays off schedule, and it was not a ridiculously challenging major. Plus, I love History so I became a history teacher. What’s not to love teaching something you enjoy and coaching sports you love? Well a great deal as it turns out.\n\nKids are a handful. I hated my life last year teaching at a high school in a nearby system. The kids were awful, administration horrible, and coworkers even worse. I was so done after year one in the profession that I chose to pursue firefighting. An odd switch I know, but my dad, uncle, and grandfather were all professional firemen. It’s something I’ve always been around. 24 hours on, 48 hours off is a pretty nice schedule. Believe it or not, I would be paid more as a firefighter. Plus, I love to exercise and so do fire departments which is a big win.\n\nI did not do it. I was interviewing at a department and withdrew because of another job offer in education. This time, I would be in a better system, same school as my wife, and closer to home. Middle school instead of high school also. That is where I currently reside. I like it much better than last year. Same schedule as my wife is great for our marriage as well. However, kids still are not behaved, I find myself always being a jerk when that’s not my personality type. Administration is fantastic and my coworkers couldn’t be better. I am important and valued at this school, but I feel unfulfilled. I opened the door to firefighting and withdrew myself quickly. I find myself wondering about it all the time and now I’ve even applied to two departments where I have two interviews coming up.\n\nI envy the masculinity associated with being a fireman. I don’t feel so manly being a teacher. I would make more money, have a nice schedule which I already do now, and not have to deal with kids all day. I want to supplement my income some way, and I find no time or energy to do so teaching. I know several firemen who have a side hustle, two within my own family. I am so mentally, physically, and emotionally exhausted each day after teaching. I feel like my 20’s are being wasted on a career that I give EVERYTHING to but I get nothing (or very little) in return.\n\nMy questions are what would you do? How do you digest this information? Am I just being selfish or am I correct to consider leaving education when it’s really not that bad now? I am feeling many emotions and a third party might help clear my head. Thank you.",
    "title": "Teacher or Firefighter?",
    "subreddit": "careerguidance",
    "timestamp": 1675039066,
    "score": 5,
    "keyword": "man teacher"
  },
  {
    "text": "24M with a useless degree, been working retail since I graduated. My interests won't realistically make any money, and I feel incompatible with the vast majority of career options available to me. Where do I go from here? Brace yourself, this is gonna be a long one.\n\nIn 2021 I graduated with a BA in Music with a Concentration in Industry, a fairly unique program that my school offered. It was basically a Music degree and a Business degree formed into one. The idea was that I could use that degree to work for a Record Label doing work like A&R, Talent Discovery, etc. After failing to land an internship in my final semester due to COVID (I applied to well over 40 different internships, not a single response) I went into my post-graduate life with a complete inability to get hired, let alone an interview. I have since been working retail, while throwing applications out whenever any Music Industry-related jobs came to my attention. No interviews, maybe a couple of responses out of dozens and dozens of applications. Many of my classmates were finding positions, but it seems that their extracurricular experience was doing the heavy lifting, as many of them were already in bands or managing one, working for venues, and had a large network to work with. After 2 1/2 years of trying, I give up. I've deemed my degree useless, and the complete lack of communication from the companies I applied to have left me resentful. \n\nSo no more music, fine. What now? Here's where it gets hard.\n\nI'm a scrawny, introverted young man whose main interests consist of Music, Video Games, Hockey, and Film/TV. I had started college as a Sports Management major, but quickly changed after realizing that I would never be the General Manager of an NHL team, and that my classmates would consist of the rich jock assholes that I hoped to escape from when graduating High School. So I switched to Media Arts, which was effectively a Film and TV major. Classes were fun, teachers were great, but I hated my school and felt like my degree had no viability. Ironic, considering I then decided to transfer to another school and pursue Music, as that was (and still is) my greatest passion. I had the mindset of \"just pursue what you're passionate in\" and I naively went along with it. Now that i'm throwing in the towel, i'm becoming increasingly aggravated with myself and my options, because nothing interests me. The thought of a 9-5 desk job makes me want to die. I'm an introvert so Sales jobs are completely off the table. I only work retail now because I work at a record store, but I would almost certainly hate working more hours at another store that sells shit that I have no interest towards. I've considered writing jobs, but freelance work pays even less than I make now. I've considered working with animals, but I have no experience raising an animal, i've just been around my friends and family's pets. The USPS subreddit says kiss your free time goodbye if you start working there, so that's out of the question too.\n\nAll I want is a job that pays well enough that I can move out of my mom's house, enough free time that I can actually pursue my real interests, and work that doesn't cause me to instantly burn out. Yes, i've been in therapy for probably a decade now. I'm diagnosed with Anxiety, Depression, and ADHD, and take medication for all of them. I feel like at this point I will have to settle, and that really depresses me. My degree is now just an Albatross of debt and regret. I don't know what to do with my life that won't make me miserable. I'm stuck.",
    "title": "24M with a useless degree, been working retail since I graduated. My interests won't realistically make any money, and I feel incompatible with the vast majority of career options available to me. Where do I go from here?",
    "subreddit": "careerguidance",
    "timestamp": 1695079689,
    "score": 4,
    "keyword": "man teacher"
  },
  {
    "text": "Should I become a pilot? Or wait for Revature and the tech industry to sort itself out? Need to Rubberduck some career options, thanks in advance!\n\nI suppose it isn’t true rubberducking since I’m hoping for help, but close enough and it’s a fun term, so here we go. \n\nI’m currently in the middle of a divorce AND a major career transition and need some help. You see, I’ve been a high school math teacher for years, but it’s become unsustainable and I decided to leave the profession. Teachers are not respected or paid very well in Arizona, and finding out that my friend stocking Walmart shelves made the same paychecks I did (with a masters degree and half a decade at the school) was the last straw. \n\nTo keep it short, after a couple months of research I decided to transition into software engineering. Passed Revature’s RevUp program and got offered a contract, start time a couple months out. Totally doable right? Well it probably would have been, but Elon Musk started the whole twitter debacle in the meantime and the whole tech industry has been shaken up, so my start date has been pushed back indefinitely and I am scrambling for options. Here we go:\n\nOption 1: wait for Revature - Revature is basically a tech employment agency. They get members up to speed on the industry and provide entry points into it, in exchange for a 12-18 month contract where they, I’m sure, make their money back. But the more pressing matter is that my start date is currently indefinitely postponed and I can’t just wait around forever and hope it still happens. But it IS an option. \n\nOption 2: Education 2.0 - I have since moved to a new state, one that pays teachers better and treats them *better*. It’s far from perfect as it’s expensive to live, but giving teaching a second shot is an easy option to get into, as transitioning my license won’t be much work or money. I just don’t think I’ll stick with it long term because education chews up teachers like nothing and it already burnt me out once. With a more peaceful home life though, it might be doable. \n\nOption 3: Aviation - I have my private pilot’s certificate already, though it isn’t current at the moment, and aviation is very much something I enjoy. I know there are currently impressive reimbursement programs as airlines scramble to find enough pilots (supposedly), but that’s what they said about teachers too, and you see where that got me. I’m hesitant, but the only reason I didn’t pursue aviation before was because I didn’t have the money to break into it. It’s an expensive career to start. \n\nOption 4: Drone Aviation - much lower cost of entry, but far fewer jobs from what I can tell. It would take me nothing to get my class 107 licensing and become a commercial drone pilot, but jobs seem to be few and far between, as it’s high niche, low skill, so while an easy option to try, this likely isn’t viable. \n\nSo there you have it. I’m looking for general advice and for career field specific advice if anyone has it. I’m honestly heavily considering aviation but it’s still such a damn high monetary risk, and I owe more than I borrowed for my teaching degree already. Getting stuck with two student loans I couldn’t pay off would drive me off the deep end. But man, flying for a living sounds amazing, even if it’s 50% paperwork and politics. Haha. Thanks again everyone",
    "title": "Should I become a pilot? Or wait for Revature and the tech industry to sort itself out?",
    "subreddit": "careerguidance",
    "timestamp": 1679172826,
    "score": 3,
    "keyword": "man teacher"
  },
  {
    "text": "I wanna leave food service but I’m LOST and INSECURE because of my accent. SoFlo? NYC? I’m a 34 year old man living in Fort Lauderdale, FL. I was born and raised in Italy, moved to America 8 years ago and recently became a citizen. I’ve been working as a manager at an Italian pizza place for 5 years now, and even though I don’t mind the job itself, I’m sick and tired of making less than $2000/month ($15/hour after taxes). \nWe don’t have table service, which means we get very few tips. The commute time is close to zero and so is the gas cost to get to work, as I could even walk to work if I wanted to. This sounds convenient, except it’s literally preventing me from job-hunting because I feel like I’m in a comfort zone. But it’s a toxic comfort zone because in the mean time I’m staying poor.\nIf you were wondering how I manage to live: I don’t order take out food, I only shop at Walmart, I cook for myself, I don’t have a social life, and I live in a tiny, microscopic studio for $810/month. \nAnother reason why I’m having a hard time job-hunting is I have social anxiety, generalized anxiety disorder and I’m not super confident about my English level, or rather, I’m scared of being judged for my accent. \nMy therapist told me my English is pretty good and I shouldn’t feel insecure because of my accent, especially in Florida. The funny thing is it’s not even that thick of an accent. It’s just noticeable because I tend to speak slowly, so I enunciate more than I should (if that makes sense).  \nIn Italy I had been a customer service representative for a mobile carrier company for 5 years. We would answer customers’ questions over the phone, through social media and via email. \nSometimes I search for jobs that require Italian language but nobody’s looking to hire bilingual Italian speakers in my area (except for teachers, and I only have a high school diploma so I’m not qualified). I’m kinda over the food service environment and at this stage of my life I would prefer to go back to a desk job that has an acceptable pay rate. I know I can be good at that. \nHere comes the best part: I am a creative person, my dream job would have been to be a singer-songwriter. But I don’t have any connections to that world (I don’t know anybody who works in that field) and I’m getting too old to even think about starting a career in music. I would also like to write a book. I like to draw. Still, I’m willing to settle for something that won’t feed my soul but will at least make me earn more money so I can enjoy life more. \nIn all of this, eventually I’d like to move to New York City because I prefer its chaos over Fort Lauderdale’s quietness and isolation (and I hate the heat!) Maybe I should move there asap, maybe nyc has more to offer. \nAny advice for this lost soul?",
    "title": "I wanna leave food service but I’m LOST and INSECURE because of my accent. SoFlo? NYC?",
    "subreddit": "careerguidance",
    "timestamp": 1700738256,
    "score": 3,
    "keyword": "man teacher"
  },
  {
    "text": "I feel like all of my current and former peers are passing me by at 100mph and I’m stuck spinning my tires in situations I hate with no way of changing them. How do I turn it around? \nTl;dr I need to escape a dead end job and subpar educational background and actually become something but I feel like even though I have the drive to change it, I don’t know where to start, don’t know if I have the resources to do so at all. \n\nKind of a rant. Idk. \n\nI graduated from college a year and two months ago with a degree in history and English. Since then I have held two jobs: I managed a coffee shop, which was fun but unsustainable, and I worked at a hotel which is my current job. Well paying, but not enjoyable tbh. \n\nMy grades weren’t amazing when I graduated because I had been struggling with pretty substantial major depression and suicidal ideation for the second half of college that happened during Covid. Still, “c’s get degrees” and all that so I powered through. History and English are really my main two interests aside from more niche subtopics like anthropology, studies of myth & religion, archaeology, etc. but I just knew that I didn’t want to do something that wouldn’t play to a passion of mine. I want to love my work even if it means sacrificing financial stability now. \n\nI now have neither. \n\nI regret my degrees and wish, as someone who didn’t aim for the focus of being a teacher or some shit that I had specialized my focus to anthropology or archaeology more closely but I’m insanely broke and can’t even fathom going back to school to pick up the pieces and get another degree, even fast-tracked or online (I also just don’t think it would look good). I also told myself I wasn’t interested in grad school in the past and that I would worry about it in the future if I wanted but I needed a break. That was a mistake. The opportunity for some sort of internship came and went forever. I never corresponded closely enough with professors to get a leg up in that regard. And again, I got so-so grades for useless degrees and I have not been proven to have had any more worth than someone who just straight up didn’t go to college. I wasted four years for a lifetime of shame and regret and crippling debt. My current partner also says that I can’t go to grad school unless I can get funding because it would leave us too deep in debt so it’s seemingly off the table, but tot doesn’t even look like people in my field are making decent splashes with their careers anyways unless they have doctorates which like, as if. \n\nMeanwhile, my two close friends got degrees in business and communications and are working comfortable high-paying jobs. They’re both 23 and just bought their first house. My older sister just moved to Chicago for grad school after an absolutely incredible i story of internships, opportunities, and points of excellence as a student and my younger sister had an internship with a law firm as an undergrad with law school aspirations. Even my friend who dropped out of college and is a full-blown alcoholic is working an extremely successful career as a mechanic. And I’m here, working in hospitality for barely enough money to scrape by with a partner who isn’t doing much better in a role that I probably only needed a GED to get in a city I didn’t really want to live in. I feel like a failure. \n\nEveryone says I’m smart. Everyone has said I’m smart my whole life. I don’t feel smart. I feel inept at everything I do. I struggled through high school. I struggled in college. I like the things that I mentioned. I live for books and literature and sagas of history and the world of man, and want to spend a lifetime studying humanity and sharing my findings with humanity. I wanted to be a professor but I can wave that goodbye without good grades, grad school, or any real achievements to stand on. I’m even writing a book, as author is another big achievement that I would love to reach, but I’m 30,000 words/100 pages deep into writing it and just feel defeated. I doubt myself at every turn and I feel like finishing a story that people will care about as much as I do and actually conquering the task of traditional publication is such a Herculean task that it feels impossible. I write regardless, but it doesn’t hold the same luster. I can’t even get a job working the door of a museum with how bad the job market is rn, and neither can people I know that DO have master’s degrees. \n\nI even decided at one point that I would be content with working in a coffee shop my whole life. Why not? It was fun. I was good at it. I made people happy and worked in an environment that didn’t make me wish I was dead. Making flat whites doesn’t keep food on the table though. I even got a job offer from a coffee shop that I would consider dream job territory and when I asked if their wage of $11/hr was negotiable as I couldn’t survive off of that, they cut contact with me. \n\nI moved to a different city because I thought that that would change things. Cities are where opportunities are, right? It’s no different. \n\nI’m 22 years old. 23 in a month. I feel like every action I’ve taken in my life thus far has been failure after failure leading me to the failure that I am now, and I’m just stuck job hopping in industries that I hate forever until I get my big break too late for me to be able to smother out the regret of lost opportunities with money or I die.\n\nI don’t sleep anymore. I eat enough to stay mostly alive. I stopped going to the gym, which was my one great non-intellectual hobby that brought me joy. I just want to succeed. I just want to be given the chance that will let me live a life that makes me happy in the moment and satisfied with my work and what I achieved when I get to the end. What am I working towards? What the fuck do I even want to achieve? \n\nI need to know that I’m not the only one here…more importantly I need to know that others have been here and broken free. I need to know that someone can make all of this worth it and BE something. To achieve or contribute to something. To be great in small ways that can, if no one else, make me proud. Make me feel less small. Make me feel like I’m not the floundering black sheep of a family that has always been able to just “make it work” so fucking effortlessly. \n\nI’m sorry for being so melodramatic. I just wish it would all stop sometimes.",
    "title": "I feel like all of my current and former peers are passing me by at 100mph and I’m stuck spinning my tires in situations I hate with no way of changing them. How do I turn it around?",
    "subreddit": "careerguidance",
    "timestamp": 1692594874,
    "score": 3,
    "keyword": "man teacher"
  },
  {
    "text": "Which career path would be best for me, Sonographer or Engineer? I’m a 24 yr old college dropout who has bounced around and worked in almost every Industry since leaving school. I’ve recently decided to leave my high paying but unstable sales job to take on another less stressful but good paying hourly full time job and become a full time student once again. I’m writing this in hopes to get some better insight and life advice about my career options.\n\nFor the longest I wanted to get into the trades but after working in residential plumbing and commercial roofing I’ve decided that maybe I can find better options with lower risk. So after some long research I decided that becoming a Sonographer would be a great fit with it having so many benefits that a lot of trades offer with an addition of being a very clean and high paying trade with little to no debt after completing school. \nBenefits of this career would be a very high paying hourly wage with little school and very limited debt. I would be able to work anywhere in the country with many options to work whenever I want. Very clean setting with hopefully nice people to work around with in a hospital or clinical setting. \nCons, there don’t seem to be many other than having the same job title throughout your career but you can choose different niches to work in. \n\nMy second option was to become a engineer of some sort because I’ve always been good at problem solving and creating things with my hands which is something I never realized until my teacher pointed it out to me after I completed several construction projects being the top student during those assignments. Only downside to this path is that it’s much longer and has more stressful school work and all the debt that comes with it. Debt is a major factor that I really don’t want to occur much of. I’m also mid at math and it has always been a stressful subject for me. I would basically have to restart from the very beginning since I’ve lost so much brain storage for the subject over the years too, which could lead me to stay in school longer with more debt as well. \nBenefits would be completing a bachelors or even a masters which is always a plus. High paying career with many options to choose and bounce around jobs later on. Seems to be a very fulfilling experience. Lots of clout of having a title of an engineer. And the ability to transfer skills to everyday home tasks.\nCons, longer years in school and most likely will have lots of debt after leaving school. My exes dad was an electrical engineer and I remember that man working very long hours and always being stressed out. I deal with a lot of stress already with personal problems and this aspect kinda scares me because I don’t want anymore of it. \n\nWhich ever career i choose, ideally would just be a job and not a life long career until I can invest more money into what I actually want to do which is to open up my own business. Opening a Gym and selling Tshirts have always been something I wanted to do but I know the reality of owning a business can be a very risky venture so I would like to have a good backup option. \n\nMy plans as of right now are to just work full time and go to school starting spring semester with very limited room for hobbies and going out until I’m completely done.",
    "title": "Which career path would be best for me, Sonographer or Engineer?",
    "subreddit": "careerguidance",
    "timestamp": 1696549226,
    "score": 2,
    "keyword": "man teacher"
  },
  {
    "text": "What is a career I am not considering that requires no further education? 43F who is autistic with ADHD, Alberta Canada. I tried to give comprehensive background but summarized most info in category TLDRs.\n\nIntro: \nI aced University but I generally suck at real life. I am lost trying to think of a job that will allow me to live without eventual burnout from masking as an autistic.  I need something that gives me flexibility for my waxing and waning energy and requires very little hustling in person or on the phone. Email is fine because communicate much more effectively in writing than verbally. I would consider related self employment ideas too.\n\nIdeal job characteristics: \nFocus on creativity,  problem solving in Science & Arts. Importance placed on ideation and planning for implementation, and then delegate to others to actually finish. Maybe project based? No cold calling or selling and prefer remote or hybrid work. Ideas which help others is very appealing.  \n\nStruggles with typical employment: TLDR: mostly Communication / Sensory\n\n- Just getting employment. I am terrible at interviews. \n- work at 200% 3 days a week and 10% the last 2 days when I am recovering. \n- Asking too many questions and wanting to know more about stuff outside of my job description. \n- Meetings leave me confused and unclear about priorities and what was brainstorming vs actionable ideas.\n- Treating everyone as my peer to have intelligent conversations and brainstorming with regardless if speaking with a 7 year old or my CEO. \n- Subjective language and unclear expectations/ directions\n- Feeling like an outsider- the loneliness of not really wanting to do outside of work social activities but also feeling hurt when everyone is closer or they stop bothering to invite you. \n- Oversharing\n- Environment: I need a quiet minimally stimulating area with few human interactions. \n- I tend to have SO MUCH STUFF because I hate not having what I need in the moment. This means I am messy in the wrong environment. \n\nWhat I enjoy: TLDR: mostly creating and finding solutions. \n\n- Thinking about the “big ideas and issues” such as  climate crisis, consciousness, cognitive development, sources and solutions for inequality, longtermism, ethics, modelling human development of cognition to facilitate research. \n- Learning!!!! I am a slow processor at times especially if requires visualization to understand the lecture but once it clicks I am on my way. \n- Visually designing something\n- Creating systems/ organizing ideas for others \n- Editing photos (but just the editing part- I know little about the actual in-person taking photos) \n- Communicating about science \n- Graphic Design in Canva / Easy (little coding) web design in drag/drop programs like wix\n- Writing\n- designing and building things BUT I never like building or creating the same major idea twice. \n- Hobbies : Video Microscopy, drawing, water colour portraits,\n- \nWhat I am good at: \nTLDR: skills: Researching, Ideation, problem-solving, areas: Psychology, Cognitive Science, Medicine , Education, visual Arts. \n\n- Researching, tracking down info- I swear my persistence means I can find anything. I am so happy and hyperfocused when working on a problem/ question. \n- Learning new skills \n- Prompt generation, I just seem to be able to keep shaping a prompt until I get what I need. I do think that Prompt engineering as a career will soon be obsolete as technology makes the middle man no longer needed.  \n- Mentoring, I am very good at researching and offering resources and solutions. As an older student (43) I had many younger classmates come for advice which always surprises me. \n- Finding the best deals on things (I guess this fits into researching) \n- Aesthetics and styling. I have always had a good sense of what is visually pleasing. \n- Finding creative ways to educate that uses project and experiential learning to help people remember and apply their knowledge\n- Writing: I love to write both academically and to write personal but informative papers to help break down the gate keeping of knowledge. We all deserve the opportunity to have complex ideas broken down into meaningful communication. \n- Providing strategies for interacting with ND kiddos\n- Weird and  not a job possibility but medical/ psych diagnosing. Don’t worry I do not go around giving people diagnoses I just have the background and I see patterns in symptoms . I don’t always have the greatest memory but I remember everything medical. 🤷‍♀️\n- Developing Teaching materials and lessons. (I wish I could just do this and not do the teaching 😉) \n\n\nEducation:\nTLDR: certificate: family engagement in medical research diplomas: Nursing, audio engineering Degrees: BSc, BEd\n\n\n-Audio Engineering post-production diploma (obsolete now, but the foundations like layering and signal flow  have helped me a lot with editing music, video, photos, and graphic design) \n\n-Practical Nursing Diploma (license now lapsed) taught me how much I love science and medicine. Worked as a pediatric nurse but hated that curiosity and thirst for knowledge  was frowned upon (aka: “why does the rationale for the order matter? Just do it.”)\n\n- BSc Life Science with a focus on Physiology, Pharmacology, Biology, Neuroscience. This was supposed to be my pre-med once I realized I wanted to be a pathologist not nurse but my family responsibilities made it obvious towards the end that med school + residency was not a possibility \n\nBEd focus Science. My BSc was useless as I had planned it as a stepping stone to med school. My Uni offered a 2 year after degree bachelor of Education program. I thought I could work as a science teacher but despite graduating with a 4.0 I realized the level of masking required to teach K-12 would break me down in less than a year. Love teaching small groups and adults. Also was hired as a research assistant and received funding to do my own educational research which I LOVE. \n\nIf I could I would love to be in grad school doing research into developing a methodology to analyze and model curriculum to develop longtermism thinking in k-12 school but that is not a possibility because I cannot get an application together, my husband isn’t keen after 6 years studying to have 5+ more for my doctorate and I need to make some kind of financial contribution to our family.",
    "title": "What is a career I am not considering that requires no further education?",
    "subreddit": "careerguidance",
    "timestamp": 1702220197,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "I'm lots at choosing my career what should I do? Thanks in advance to those who read So as the title says I (am 21) male and have been struggling to find the right career for me and don't know what to do, a little background when I was in high school I wanted to go to med school but people told me that I wouldn't be able to make it and I panicked and picked engineering since I was good with maths and as silly as it is I was doing great but felt miserable cause I didn't want to be there so after 2y I changed career tried music as a full career but got cold feet and quit then I decided to choose something related to my original dream of med school I got on a pre-med school course and I loved it. but here's when things got sour you see I wanted to get my degree as quickly as possible because I come from a household of poor income and med school wasn't and option for that since getting the degree in my country takes 6 y plus 2 years of residency so I decided to go to radiology but ended up getting scared of the x rays and it's side effects on the body so the college put xme on nursery school at the beginning I thought i could do it since it was also health related but I realize the hard way that nursing and med school are to different things completely I've also learned that I have a big ego I want to have a job were not only I will be important but were I can have financial security and more specifically we're I can make a good amount of money, which is hard to do on nursing either in my own country Venezuela or the country I want to move to Argentina apparently nurses there are heavily underpaid not only the career my teachers and classmates are straight up awfull with me I'm the only man and you would think is a plus, wrong woman's are hard to deal when they are in group. Most of them are old angry women who want to get they're degrees for only personal satisfaction ( I have no issue with that) so here I am without any idea of what to do quitting or staying and manning up. for those who may ask I live with my mom and eat her food while I'm in this mess, I had a job for two years before the career change but I'm currently unemployed any advice you can give me about my career drama would be greatly appreciated also thanks to everybody who takes the time to read you are gold.",
    "title": "I'm lots at choosing my career what should I do?",
    "subreddit": "careerguidance",
    "timestamp": 1697713277,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "should i lie about the time i stayed at my job on my resume? thoughts on leaving a job before a year? hello! i’m a technical writer and not a fan of my job. i also live in florida and i feel like to break into a good paying job in tech, i should look elsewhere. i’ve had ppl tell me i’m severely underpaid for the work that i’m doing and my company on glassdoor doesn’t have rly good reviews. i’ve been told that my job is a bit “red flaggy” and that it’s ideal to look somewhere else. the benefits are trash for a government job and yadda yadda yadda. i’m getting paid a little more than a teacher here lol. i’m okay with the entry level pay being that i am a beginner to this but man im starting to think i should’ve been a high school teacher lol.\n\ni also just graduated in may but got this job in march. i just got my secret clearance, however i am hoping to not look into defense as i don’t think it is for me (as long as i am in florida/working for a company in florida…it could be just this company making me feel that way, who knows).\n\nso with this being said, should i just say i got hired in january/february on my resume as opposed to march while applying to more jobs? has anyone left a job before a year? before six months? i’m at the fourth month mark and i’m ready to leave before this company crash and burns haha. or before i mentally crash and burn. any and all advice is helpful! thanks :~)",
    "title": "should i lie about the time i stayed at my job on my resume? thoughts on leaving a job before a year?",
    "subreddit": "careerguidance",
    "timestamp": 1688050448,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "I have came down to 2 career paths which should I take? Background\n\nI’m a 24 yr old college dropout who has bounced around and worked in almost every Industry since leaving school. I’ve decided to leave my high paying but unstable sales job to take on a less stressful but good paying hourly full time job and become a full time student once again. I want to go back to school so I can have more options about where I work. I don’t want to work for the same company doing the same thing stuck being in my hometown city forever. So I’m writing this in hopes to get some better insight and life advice about my career options.\n\nFor the longest I wanted to get into the trades but after working in residential plumbing and commercial roofing I’ve decided that maybe I can find better options with lower risk. So after some long research I decided that becoming a Sonographer would be a great fit with it having so many benefits that a lot of trades offer with it also being a very clean and high paying trade job with little to no debt after completing school. \nBenefits of this career would be a very high paying hourly wage with 2-3yrs of school and very limited debt. I would be able to work anywhere in the country with many options to work whenever I want. Very clean setting with hopefully nice people to work around with. \nCons, there don’t seem to be many other than having the same job title throughout your career but you can choose different niches to work in. \n\nMy second option was to become a engineer of some sort because I’ve always been good at problem solving and creating things with my hands which is something I never realized until my teacher pointed it out to me after I completed several construction projects being the top student during those assignments. Only downside to this path is that it’s longer and has more stressful school work and all the debt that comes with it. Debt is a major factor that I really don’t want to occur much of. I’m also mid at math and it has always been a stressful subject for me. I would basically have to restart from the very beginning since I’ve lost so much brain storage for the subject over the years too, which could lead me to stay in school longer with more debt as well. Benefits would be completing a bachelors or even a masters which is always a plus. High paying career with many options to choose and bounce around jobs later on. Seems to be a very fulfilling experience. Lots of clout of having a title of an engineer. And the ability to transfer skills to everyday tasks.\nCons, longer years in school and most likely will have lots of debt after leaving school. School seems to be very stressful. My exes dad was an electrical engineer and I remember that man working very long hours and always being stressed out. I deal with a lot of stress already with personal problems and this aspect kinda scares me because I don’t want anymore of it. \n\nWhich ever career i choose, ideally would just be a job and not a life long career until I can invest more money into what I actually want to do which is to open up my own business. Opening a Gym and selling Tshirts have always been something I wanted to do but I know the reality of owning a business can be a very risky venture so I would like to have a good backup option. \n\nMy plans right now are to just work full time and go to school starting spring semester with very limited room for hobbies and going out until I’m completely done.",
    "title": "I have came down to 2 career paths which should I take?",
    "subreddit": "careerguidance",
    "timestamp": 1696507366,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "32M Former teacher... The world is my oyster but can you help me with advice on what to do next with my life? I'll try to provide as much useful context as I can, but basically I'm looking for suggestions on what I should do next in my career.  My life is more or less a blank slate\n\n32M, previously I was a teacher in South Korea for 6 years.  I was planning on moving to international teaching, but I got burned out during the Pandemic.  I traveled the US and South America this past year, climbed a lot, learned Spanish, and met lots of locals in Colombia.  I was waiting on a remote position that opened in February for a company called BUNAC.  Basically, they help people who want to live and work abroad with visas, jobs, etc.  My good friend worked for them and told me just to hold on until February.  Long story short, they gave the job to someone inside the company.\n\nNow I'm living in a cheap place in Colombia with a buddy.  I have about $50,000 in savings and money isn't the biggest issue.  I'm really at a loss for what to do next in my life.  I feel as a youngish healthy man with a decent chunk of savings and no responsibilities I should take the time to find something I will love, or at the very least not hate and pays decent.\n\nPlease anyone with suggestions on what you would pursue, please let me know!  Thanks!",
    "title": "32M Former teacher... The world is my oyster but can you help me with advice on what to do next with my life?",
    "subreddit": "careerguidance",
    "timestamp": 1675894371,
    "score": 0,
    "keyword": "man teacher"
  },
  {
    "text": "How to be happy with your career choice? **Bharath (Q5):** Many students are forced by their parents to study something or to do something they are not interested in doing. I have even seen students committing suicide because they were asked to do something which they never liked and as a result they had failed miserably. In that case, should students listen to their parents? In my case though, I was not interested in doing an M.Tech. I still listened to my father and did it. As a result, I have got this divine knowledge from You. You gave me Nikhil sir as my teacher, who helped me understand this knowledge by patiently answering all my questions. So, by listening to my father, even though I did not like what he told me to do, something good happened to me.\n\n**Swami replied:** Parents are always wiser than their children because parents have more worldly knowledge than the children. Worldly knowledge is also a fundamental necessity. Suppose, you are planning to present a devotional drama to the public to develop their devotion to God. To perform the drama, a stage is essential. So, you must have all the knowledge of the stage too. The devotional drama is your spiritual effort. Maintaining yourself in the world i.e. securing your livelihood, is the stage. Worldly knowledge is the knowledge of the stage. If you are very rich and if you are interested in spiritual knowledge, it is good. You need not struggle to maintain yourself in the world. You can only concentrate on the spiritual effort which leads to the permanent welfare of the soul. It is certainly far far more important than merely the welfare of the body. But if you are poor, then as the first step, you should concentrate on the welfare of the body, which is securing your livelihood. **Even if you are a middle class person, you should concentrate on the welfare of the body in the first step. This is because, your limited savings might not be sufficient for your lifetime since the value of money might fall steeply in the future.**\n\nAs regards education, even if you do not have any interest in a subject, you have to develop interest in it since it is helpful for your profession. **You should choose a field of study which has better career prospects so that you may get good employment and develop interest in that field.** Even if a man is forced to marry a certain woman, he must develop interest in his wife, once the marriage has taken place. He married her under inevitable circumstances. If the circumstances had not been inevitable, he could have married the girl he loved very much.\n\n**Similarly, in order to maintain yourself in the world, which is the basic stage for the spiritual effort, you have to study the subject in which you have no natural interest.** After entering in to the subject, you must show your interest in it to the climax. You should not withdraw from the subject saying that you have no natural interest in it. It would be just like saying to your wife that you do not love her because you were forced to marry her under inevitable circumstances! It would be real injustice. Until you are well-settled in life, you must continue your interest in that subject and in the profession related to that subject. Once you are established in your profession, you can pursue your interest in another subject of your choice. But please do not extend this concept to the example of marriage that I gave you. It was only a simile. You cannot say that after getting married, you will also continue your interest in your lover on the side! A simile can be applied to a concept only in a limited manner.\n\n**Shri Nivedhan:** What are all the ways of being happy in life?\n\n**Swami:** You must actually see the other side of the coin. Instead of asking how one can be happy in life, you must ask how the happiness can continue forever. If you take the case of worldly pleasures, the happiness is not continuous and moreover, it ultimately ends in unhappiness alone. Temporary happiness, which finally ends up in sorrow, is not desirable at all! On the other hand, the Gita describes eternal happiness. **It says that the happiness which comes after some initial unhappiness during the stage when one makes efforts, alone is eternal** (*Yattadagre vishamiva*\\*\\*\\*…\\*\\*\\*). You must not only see your need of happiness in the present but also in the future. Some people give importance to their happiness in their old age. They work hard earn and save enough money for their old age. They also take care of their health through good exercise and food habits. These people accept some discomfort in the present, so that they can be happy during their old age. But it is not enough. It is even more important to make efforts to ensure your happiness after death. Merely focusing on your happiness during the temporary period of this life, is not wise.\n\nIf you concentrate on God, you will be happy now, you will be happy in your old age and you will be happy even after death. **God is the best and only way for getting eternal happiness. His grace can be attained through spiritual knowledge and devotion.** You can realize this perfectly once you study spiritual knowledge completely. **You must be very careful in choosing the means of getting temporary happiness or the means of getting permanent happiness.** It is most important to analyze your own goal very very carefully. You must decide whether you are seeking temporary happiness or permanent happiness.",
    "title": "How to be happy with your career choice?",
    "subreddit": "careerguidance",
    "timestamp": 1682187141,
    "score": 0,
    "keyword": "man teacher"
  },
  {
    "text": "Need advice. I think I’m about to get scammed at a tax preparation job. I believe it’s a pyramid scheme I got a job at a tax preparation place. But, I think it’s a scam/pyramid scheme. I’m a teacher and  want out. I would like a career change towards financially services (payroll, accounting and bookkeeping. I’ve been looking for entry level accounting jobs but it’s hard and very low pay because I have no experience. I thought if I got a job as a tax preparer place I can could get my foot through the door. \n\n\nI got a job a tax preparation office. This man hired me on the spot and told me to start coming to his training classes. He told me it was commission based. I would get paid $125 for each tax return that I complete, I can recruit other people as well and get $25 for each tax return they complete. After, the fourth class he invited me to do taxes at the office before I took the certification exam. He said since I’m learning really fast since I’m a teacher he wants me to offer me a manager position. He wants me to recruit more people from my own Indeed account, create a job post, conduct interviews and train other people he recruits as well. Which got disabled because the way he told me to verify through indeed. My pay will increase to $150 for a tax return and $25 for each of the people I recruit who complete a tax return. It didn’t make sense to me because his giving me a management position without hourly pay and the time I take interviewing people and training I can be completing tax returns for more money. It feels like his trying to give me all his work. \n\n\nI need advice. I’m already going to quit tomorrow. But how do I get my foot in the door into financing services. Do I volunteer at a tax preparer service place(that are valid on google maps and have been open for years) or try to get a job at one part time and take a pay cut.",
    "title": "Need advice. I think I’m about to get scammed at a tax preparation job. I believe it’s a pyramid scheme",
    "subreddit": "Accounting",
    "timestamp": 1673750564,
    "score": 3,
    "keyword": "man teacher"
  },
  {
    "text": "I am so sick of being objectified by men! Like, do y’all ever be talking to a dude and then start coming to that slow realization of “Oh...he fully does not see me as an actual human being capable of deep contemplation, opinions, intellect etc.”  \n\nFor instance, I started talking to this man who is a teacher and was telling me about how regimented he was with meal prepping and exercising.  I told him how much I appreciated him being a teacher because it’s an important and undervalued career and complimented him on his dedication to staying healthy even when it’s hard to stick to his routine. Meanwhile all he kept complimenting me about was how beautiful and sexy I am and how much he liked looking at me etc, which is nice to hear but gets old when that's the only thing they say.   \n\nHowever, what *really* pissed me off is when I was telling him about a spider that had lived in the bushes in my backyard for like six weeks.  Every week her web would become more and more elaborate, it had different levels to it and she would make these little balls out of webbing and hang them up around her web.  As an environmental science major, I was extremely fascinated by what she was building and every time I took my dog out, I would peak in the bushes and check out what new developments were happening with her web.  Then one morning I went out and her web was completely destroyed, and she was gone.  The dude and I went on a date that night and I was explaining to him how I had this weird feeling in my stomach all day because the whole spider thing was making me think about how we live our lives and work so hard to build something until one day it and you are gone forever.  This man looked at me and said, “You’re lucky you’re cute.”  \n\nWTFFFFFFFF I just spent the last 5 min telling you about my anxieties regarding the impermanence of life and that's all you have to say?!",
    "title": "I am so sick of being objectified by men!",
    "subreddit": "blackladies",
    "timestamp": 1676495293,
    "score": 341,
    "keyword": "man teacher"
  },
  {
    "text": "Do I have permission from my beautiful black ladies to chuck a big thick black history book at my ex in class? So… this man to the initiative to sign up for BLACK HISTORY class, know FULL DARN WELL he likes to be “devils advocate” AKA ignorant and a bigot.\n\nTwo of my friends was FLOOREDDD to have him in our class. One even said “I can tell her likes to get very political.” Cause he DOES.\n\nThe three of us tried warning our teach collectively that he needs to keep an eye on my ex because he gonna try and start stuff in a room full of black kids.\n\nI tried to hold in my laugh cause I was greatly appalled at the audacity.\n\nMy teacher said “make sure everyone is respectful and if someone says anything that’s offensive unintentionally it doesn’t mean they’re a jerk, but educate them”\n\nWhy my ex gonna go “oh I meant to be a jerk” 😀????\n\n\nAll three of us exchanged looks across the room 😭\n\nWhen he left the class my friend said he muttered how ready he is to basically start some shit and was a lil too happy to do so.\n\nWe have these big ass thick ASS text books in our room, and I might just use it as a folding chair to knock some sense into him. \n\nHe drained me towards the end of the relationship because he was so ignorant.\n\nWe tried telling my teacher and he said that if someone’s ignorant you have to educate them even though I said I tried that one too many times than I should 😭",
    "title": "Do I have permission from my beautiful black ladies to chuck a big thick black history book at my ex in class?",
    "subreddit": "blackladies",
    "timestamp": 1694115231,
    "score": 50,
    "keyword": "man teacher"
  },
  {
    "text": "What is it with older Black men being so patronizing? A number of Black men who are older seem to be patronizing to Black women and occasionally others from this weird place of acting as if they must bestow wisdom...or am I trippin? I've noticed this in observing how they try to flirt with women, how they try to teach, and how they interpret other's information erroneously as if looking for something to teach, challenge, or correct. Like...did someone just issue a decree that every Black man has to be a more annoying bagger vance once they're over 40?  \n\n\nI've had male therapists before and all of my therapists have been nice lovely people. However, the Black male therapist I have is...patronizing and often fails to fully grasp where I'm coming from in a way that transcends my having ADHD and rapid fire thoughts. To be blunt, as a therapist being on the receiving end is oddly fascinating. He simultaneously respects my knowledge and I'm encountering an attitude I've experienced specifically the most from older Black men which is a certain level of *let me explain the world to you* combined with this feeling of they're *doing me a kindness*. I am a therapist. I get there's an unavoidable explanatory quality sometimes. But every fucking session I feel like I'm back in high school listening to a particularly great, but deeply annoying Black male teacher who very clearly bought into this attitude. \n\nIt's a sexism problem on one hand, and I've experienced similar with white folks, but they don't do it with this sense of familiarity or attempted \"I'm helping you out by doubting you/talking down to you while simultaneously demanding you meet a certain level\". Or at least it doesn't feel that way, in fact of white folk it seems I get that attitude from the most is white women/afabs, which I think is striking. It is as though because they feel a kinship they don't think they can be perceived as anything other than helpful despite their tone/attitude. The result is me walking away feeling older Black men tend to perceive themselves as sages of the community instead of fully authentically just listening especially to Black women. I suspect they think Black women won't let them get a word in edgewise(...which is less to do with being Black and a woman with me, but more with my ADHD . \n\nOverall while this attitude can be present in other populations and individuals, but this feels so common and uniquely accepted as how Black men of a certain age should be. It appears different than older white dudes who are \\*similar\\*, but generally don't have a sense of that over familiarity/arrogance until they know you well or unless they feel like they know Black folk as a group well (barf). Maybe that's the core, when people feel they understand someone they perceive as less experienced/lesser/in need of wisdom then they don't feel the need to check how they convey information NOR question if they actually understood the information shared with them. They assume they're being the wise mentor, the kindly sage, the Bagger Vance and with Black women it feels so...automatic in the interactions with older Black men. Even men who've tried to flirt with me have on occasion come at me like I don't know what I want, what I'm doing, or as if I need guidance. Meanwhile certain Black men come into the room like they know you especially if you're Black. **It's not about their language, code switching, but about their tone and approach that feels like being put at a distance intellectually while fronting like there's a closeness they uniquely have due to their supposed understanding and wisdom**. \n\n&#x200B;\n\nI feel bad critiquing one of our own when our field needs Black men so badly, but these older dudes stay with this attempted sagely behavior without listening to what a Black woman is saying and he recognized I got defensive because it sounded like he was judging my professionalism without actually grasping the concepts I was explaining. **Am I overgeneralizing to an insane degree? Is this a cultural norm or behavior you've witnessed. Am I codifying race into something rooted in sexism?**",
    "title": "What is it with older Black men being so patronizing?",
    "subreddit": "blackladies",
    "timestamp": 1676484901,
    "score": 34,
    "keyword": "man teacher"
  },
  {
    "text": "I think I might be too broken to continue dating. I hate dating. I sincerely and genuinely hate it. When I'm single, I'm the happiest, most peaceful and most confident person. I have lots of friends and family, I'm part of a close knit community and I have a daughter whom I adore. When I'm dating someone I feel anxious, pre-occupied and insecure about my appearance. I spend a lot of time reading the other person's cues trying to prepare myself for the inevitable moment that they're going to lose interest and ghost me. \n\nI grew up in an emotionally and physically abusive household. My parents split up (for the last time) when I was seven, and even though I spent a lot of time with my dad and older half-brothers, I was raised primarily by my mother (who I was very close with) and my grandmother (who was the source of most of the physical and emotional abuse). When I was 18, my mother moved my \"stepfather\" who she had known for all of three months, into the house. My instincts, which I supposed were well-honed from years of violence, immediately picked up on the fact that he was a creep, but I tried to be polite to him anyway. He spent years making disgusting comments towards me, and trying to touch me inappropriately. I told my mother, and in a tale as old as time, she chose to ignore me. Obviously I don't talk to her anymore.\n\nWhen I was 22 and in university, I met my abusive boyfriend, who eventually SAed me (I was still a virgin at the time) and I got pregnant with my daughter. I broke things off with him the day after I found out I was pregnant. \n\nThat particular experience really messed me up. In spite of being a very outgoing person, I was always shy when it came to men, but following that experience I spent 9 months in my house not going anywhere. When I eventually did leave the house again, a man entering my personal space at all, or even sitting next to me in public was cause for an immediate anxiety attack. I started therapy, joined a domestic violence support group, and was able to work through a lot of my issues. I've gradually gotten more comfortable with men, I've even lost the sense of discomfort and distrust I always had with my daughter's male teachers and my friends' husbands. \n\nWhen my daughter was three I decided to try to start dating again. It was extremely scary for me, and difficult. In the last six years, I've dated three people. The only time I was able to relax around any of them was during sex, which I guess takes me out of my own mind a bit. In the first few weeks of dating my last partner, I had anxiety induced breakdown and confessed my entire past to him. He was very understanding and kind about it...But only a few months into our relationship he was waving some serious red flags for DV  (getting controlling, getting angry and yelling all the time, violating my boundaries) so I broke things off. \n\nThat relationship ended in 2019, and I've been focusing on myself and my daughter, and life had been really happy and peaceful. I was walking everyday, doing yoga, writing and hanging out with my friends, and  I started my own business last year. I had been considering going down the IVF route, because I love being a mom, and I DESPERATELY want to have another baby. \n\nThen I met my current partner. I was initially anxious with him the way I always am, but he was so consistent in communicating with me, so kind and patient and so open about his feelings for me, that within a few days of talking to him, the anxiety was gone, and being with him was just another beautiful, peaceful part of my life...And then we slept together. My daughter was spending the weekend with my aunt and uncle, so we spent the weekend together. We had sex several times, and when we weren't, we were kissing and cuddling. The entire time he kept telling me how beautiful and amazing I was. After he dropped me home, we texted for a few hours, and I didn't hear anything from him the next day, and only a little the day after that. The next day, I texted him and 'jokingly' asked him if he wanted to chat on the phone, so he could politely reject me. That seemed to snap him out of it and we've been texting normally again, and when we talked on the phone, things were great. But his messages are less affectionate than they were. \n\nIt's been five days since we had sex, and the lack of affection and consistent communication has put me right back where I was. I feel anxious, preoccupied, and weepy ALL THE TIME. I ended up crying for 20 minutes last night. I've written two breakup texts that I never ended up sending. I so badly want to avoid getting hurt that I just want to break things off with him and go back to my happy, peaceful single life. I just don't think I'm the kind of person who can be in relationships anymore and I'm ready to stop trying. \n\nTL;DR: I'm a survivor of multiple abusive situations. Relationships are complete misery for me and I don't want to date anymore.  \n\n&#x200B;",
    "title": "I think I might be too broken to continue dating.",
    "subreddit": "blackladies",
    "timestamp": 1699013791,
    "score": 22,
    "keyword": "man teacher"
  },
  {
    "text": "White Women Supervisor (Black Men) Yes, you read that correctly I am a Black man, but I was unsure where to go with this and I decided who could sympathize w/ what I’m going through other than other black men, it would be y’all! Black women. So, hopefully y’all could help a brother out.\n\nLong story Short: I spent 7 years as a Middle School ELA teacher and I am now transitioning to an Educational non-profit as a Tutoring Manager who runs the tutoring center and coaches undergraduate tutors. I supervise two other people and I have a supervisor (the Program Director) who, yup you guessed it! She’s white. I’m trying my best to keep an open mind/be optimistic but I really believe I can read people well (especially white people). She just gives off fake-woke I support you and I’m here for you vibes, she loves to say I have all the freedom in the world to implement what I see fit in regards to programming because my extensive teaching experience, but each time I have an idea, it’s complimented but then given “feedback” on how it needs to align more with the company’s vision aka her vision lol and I see right through it!\n\nHave y’all ever experienced this/any advice? This job is more of a stop gap for me to gain leadership skills and eventually in a year or so moving into an Instructional Coach role at a school or another company. Anyway, thank you in advance!",
    "title": "White Women Supervisor (Black Men)",
    "subreddit": "blackladies",
    "timestamp": 1694212342,
    "score": 9,
    "keyword": "man teacher"
  },
  {
    "text": "Do you market and advertise your business as black owned? There was an internet discussion brought up a while back that stemmed from Jess Hilarious proudly proclaiming that she doesn't support black owned businesses due to unprofessionalism. \n\nI have not advertised or marketed my business as black owned anywhere other than LinkedIn. In part, due to the negative stigma associated with black businesses. I do feel like I will be unfairly judged and held to a higher standard than a typical white owned business or beyond what would even be considered as reasonable expectations just because I'm black. I am an indoor hydroponic farmer (vegetables, not marijuana), co-op organizer and recreational teacher as part of an agriculture/horticulture learning program for kids. I had a black man leave a negative review for my business because I was attending to paying white customers at the farmers market instead of holding up the line and taking time out to entertain him with random conversation. At the end of his rant was \"what you expect from black businesses.\" I had to appeal that bs review for almost a month before it was taken down. \n\nI don't hide it if asked but sometimes I find myself really hoping no one asks. After being asked, I've randomly been asked for skinfolk discounts, had my prices questioned or sometimes I've just had a nice black woman state that she would've supported sooner if she knew it were black owned, which is nice and I appreciate it but it doesn't feel necessary? Out of my friends group I'd say almost half of us are business/side business owners, mostly black women, and none of us advertise our businesses as black owned except for one. The one that does, that's just so it's easier to be identified for grant qualifications.\n\nSo do you advertise and market your business/side business as black owned? What do you think are the real pros and cons of either choice?",
    "title": "Do you market and advertise your business as black owned?",
    "subreddit": "blackladies",
    "timestamp": 1698886262,
    "score": 9,
    "keyword": "man teacher"
  },
  {
    "text": "My Friend Said the N Word, Seeking Advice I’m currently a senior in high school. We are reading a play called Fences and have volunteers playing a role. Throughout the play, we view the lives of a black family and their situation in the 1950’s. It was very much chosen by our teacher to learn about racism and other literary stuff common to English classes. \n\nGetting back to the point, my friend volunteered to play the role of a black man, who is the only other person saying the n-word  besides the main character (who is played by a black dude). Well, the only time the character says the word, he chose to say it and my teacher did nothing to reprimand him. I try to tread lightly with throwing around the word racist, I’m not sure if i’m valid in just believing that it was truly misguided as my counselor told me. With other black students wanting nothing to do with the situation, I want a conversation about it with my class. I feel like i am in the minority (and it hurts) since i don’t have the same views as my fellow black women in the grade.\n\nI was the only one that demanded an explanation after the fact (Out of the 6 black students, 2 of us were vocal about being upset) and was told that he understood how his actions affected us, and that he will be making an apology. I did tell him i was pissed, offended, and am not accepting the apology because nothing will ever change the fact that he thought it was okay to say the slur. But he is on the spectrum and genuinely cannot take social cues. I am not trying to make a excuse for him, because there is none, but with people making jokes about him, I don’t feel alright without letting them know that even while this is a horrible situation, I hope no one feels any hatred. \n\nI did have a conversation with my teacher and another black student, and I basically told him that i lost his trust and how I now feel very unsafe in this environment and it wasn’t my place to handle the situation. I also said that while we are having a dialogue about it tomorrow (that i asked for) nothing will change how it was initially handled. How should I proceed with the discussion taking place? I don’t want to make any excuses or accept any apology, but i just want the jokes about my friend and “how they would’ve handled it” to end because apparently this is a funny situation to my peers. I don’t want to be labelled as an angry black woman again or not truly black, so where should I go with this?",
    "title": "My Friend Said the N Word, Seeking Advice",
    "subreddit": "blackladies",
    "timestamp": 1699927223,
    "score": 7,
    "keyword": "man teacher"
  },
  {
    "text": "how can i stop hating men? need advice i feel like there is so much misogyny and misognoir in this world and the way it’s so normalized really pisses me off. these past few months my hatred and resentment for men have increased. every interaction i have with a man there is just something that he says that reminds me that he’s just like every other man with deeply rooted misogynistic beliefs and it’s just so disappointing. the way men talk about women and are so entitled and think they deserve everything it just pissess me off. my father (the most misogynistic piece of shit alive), my brother (misogynistic aswell), men i’ve been attracted to, my male friends, ALL OF THEM are just so ughhhhh\n\nmy black african mother has made my hate stronger because (not to go into any detail) but she treats my brother so much better than me. i’m essentially the golden child, never had a boyfriend despite being 18, barely speak to men, get excellent grades, don’t get into any trouble, all my teachers have a good word to say about me, whereas my brother has gotten away with so much shit and he is 15 years old (smoking weed in our house, bringing girls to his house when my mom has prohibited us from dating, missing class, teachers complaining about him) whenever he does something bad, he gets yelled at once and my mother claims she’s keeping an eye on him but then does NOTHING! whereas i can’t date till i’m 21 and she yelled at me for wearing a revealing outfit in my 18th birthday dinner and that instance alone caused her to become weary of me. \n\nand i will blame this hatred partially on me being chronically online and seeing overwhelming misogyny on social media, but it’s like even when i go out into the real world it’s not any better. it’s literally everywhere. even in real life men are still misogynistic assholes \n\ni just wish i didn’t have so much hate for them because i am attracted to them and am inlove with one right now so i know it’s not healthy but they just piss me off so much. and the fact that so many of them are genuinely convinced that they’re oppressed for being men too and don’t even see women as humans dosent help either",
    "title": "how can i stop hating men? need advice",
    "subreddit": "blackladies",
    "timestamp": 1679966901,
    "score": 4,
    "keyword": "man teacher"
  },
  {
    "text": "Am I overthinking this or is this something you’ve experienced as well? Yesterday my mom met with a lawyer (an older white man) and she told me that at one point she corrected him on the price of one of her properties and he let out a loud sigh and rubbed his face with his hands the was someone who’s frustrated would. My mom called him out on the fact that he appeared to be impatient with her, to which he replied that he is patient. She also said he was acting as though she was trying to argue when she corrected him on the price of her property when she wasn’t at all and she didn’t say that to be combative in anyway. My mom was recommended this lawyer by the husband of a a former coworker (both white) and they’re very nice to her, so she was disappointed that she didn’t have the same good experience they had with this lawyer.\n\nAs she was telling me this, I was thinking that maybe his blatant expression of impatience and the fact that my mom’s white friends had a better experience than she did might’ve been due to some unconscious bias the lawyer had. As I’ve noticed in many scenarios some white people have a tendency to be less patient with people of color, and when I brought this up to my mom, she immediately understood and mentioned how this especially happens to poc who have an accent that isn’t native to the US. My mom does have a Filipino accent but it is more suppressed. I also noted that with him acting like she was trying to argue that I’ve noticed that sometimes white people may overexaggerate the actions of a poc, as I had a math teacher in high school who’s Filipina and I remember one of my white classmates acting like she was yelling when she was just talking at a higher volume.\n\nMaybe I’m overreacting or overthinking this but I have noticed many times throughout my life where white people were less patient when interacting with a poc (especially if they speak with an accent) than they are when interacting with other white people. My mom was thinking that maybe he just wanted to speak without being interrupted - which I get but I feel like the way he loudly sighed and covered his face was unprofessional and rude, so I feel like that was an overreaction to a small interjection as there are nicer ways to ask not to be interrupted.\n\nHave any of y’all had similar experiences or observations?",
    "title": "Am I overthinking this or is this something you’ve experienced as well?",
    "subreddit": "asianamerican",
    "timestamp": 1699571584,
    "score": 95,
    "keyword": "man teacher"
  },
  {
    "text": "3 years ago I filed a detailed report for my daughters daycare with Department of Social Services and the San Bernardino County Office of Education, those reports disappeared and follow up by CPS and SBCS was refused as \"unfounded\" then I found they had and were investigating other cases from women. &#x200B;\n\nhttps://preview.redd.it/oq3ywurvaska1.jpg?width=3264&format=pjpg&auto=webp&s=a7973d64eeb0844fe5514c38bd833821ccf3ef7d\n\n&#x200B;\n\nI first heard about them in yelp reviews\n\n[https://www.yelp.com/biz/montessori-school-house-rancho-cucamonga?sort\\_by=rating\\_asc#reviews](https://www.yelp.com/biz/montessori-school-house-rancho-cucamonga?sort_by=rating_asc#reviews)\n\nhere's the link to the DSS reports themselves\n\n[https://www.ccld.dss.ca.gov/carefacilitysearch/FacDetail/364817872](https://www.ccld.dss.ca.gov/carefacilitysearch/FacDetail/364817872)\n\nAt least 2 possibly 3 teachers were involved in grabbing children's arms, yanking them around and digging there nails into there arms, my daughter sported similar behavior making it at least 4 teachers, only 1 got fired.\n\nThe first picture they posted online is of kids drying off from playing in the water, it was over 90 degrees that day and the asphalt was probably over 140, my daughter told me that her feet got burned that day.\n\nThe second picture is another one they posted online, the other teacher got cut out but they were both supposed to be wearing masks, they yelled at kids when they didnt and yet 1 teacher has hers down, this same teacher was involved in many other incidents.\n\nSome of the main issues were they claimed to be a school to wealthy foreigners visiting for awhile but then a day care when they just needed a baby sitter all day. They are listed as a day care, something they used to effect when schools were shut down for covid and they asked to increase capacity by 50%\n\nThey actually had what's now believed by many parents to be a 50 child Covid outbreak in December 2019 and never told the parents that they weren't the only ones taking there kids out for sickness, as the day care is filled with children who travel all over the world like on Thanksgiving getting strange and often early sickness is common.\n\nAnother issue is they often failed to secure the facilities, often leaving exterior gates to the playground open to the parking lot, not separating age groups and forgetting kids inside during fire drills.\n\nAnother issue is these teachers were making unaccredited decisions about mental health for children and claims about there school programs being \"advanced\" despite claiming that kids would still need to see a tutor to test into an age appropriate grade for public school later. They charge 900-1200 pr month per child and every parent knows they only \"care about the money\".\n\nThey were also cited for going to children's homes for tutoring without the proper vaccination or safety protocols during the lockdowns including offering lessons for subjects they were not accredited for.\n\nOther concerns were they used a single bathroom and lined up all the children to use it - this led to any parent entering the facility and other children to see children often sitting on the toilet with the door open to the common areas and front door.\n\nAnother concern was the same as many of the other parents, they were not operating as educators but indoctrinators - often telling children as young as 4 years old that the are to blame for slavery because of their skin color, the president is a bad man and should go to jail, Columbus Day and Thanksgiving are bad and they should celebrate Indigenous day and the Day of the dead despite not being able to show correlation to how that matters to basic education like math, reading and science or even knowing who the indigenous people are. Santa isn't real, guns are evil, people who voted for Donald trump are evil and on and on and on.\n\nThere is no possible way any of these children could understand or comprehend much of this and it was clear they weren't intended to - the \"advanced education\" was a cover for angry not teachers to go on unchecked political rants to toddlers.\n\nWhile you may or may not agree with this, its not what anyone paid for, wanted or expected and even the yelp comments made it clear - there mission is not education that tout but surface level appearance only for profit.\n\nFinally I will say this, the State Department suspended my daughters passport and put her on an international kidnapping watch list at my request. As part of they they instructed me to ask them to report any suspicious injury or absence to me immediately.\n\nWhen I gathered the owner, administrator and teacher and explained this they just stared at me blankly - since I had already been told they only cared about money I told them if they felt uncomfortable to report it to the Sheriff first.\n\nThey never did and injury and absence came and went and they stayed silent - they already had the legal requirement to report this and they refused , for money.\n\nThe final insult and perhaps the worst is the teacher in the picture above conned my daughters mother into believing she was not developed enough and needed to take preschool again.\n\nThis was nothing more than a money grab to get another 10K for the xtra year - my daughter is fluent in 2 languages, reading, writing and speaking and was teachers pet - this devastated her as her small group of close friends went on to other schools without her, leaving her to feel stupid and alone, she has probably cried about that over a dozen times to me so far.",
    "title": "3 years ago I filed a detailed report for my daughters daycare with Department of Social Services and the San Bernardino County Office of Education, those reports disappeared and follow up by CPS and SBCS was refused as \"unfounded\" then I found they had and were investigating other cases from women.",
    "subreddit": "MensRights",
    "timestamp": 1677526850,
    "score": 410,
    "keyword": "man teacher"
  },
  {
    "text": "Male privilege is a myth in Muslim countries, too, and here's why: **Afghanistan**\n\n*Trafficking*\n\nWell here's an interesting fact: [boys are more likely in Afghanistan to be trafficked than girls](https://hagarinternational.org/wp-content/uploads/2018/04/Hagar-Research-Forgotten-No-More-Male-Child-Trafficking-in-Afghanistan.pdf). They can be subjected to sexual trafficking, forced labor or being sent off as a soldier (a loophole due to the country's absence of conscription). For example, boys often age 13 and under often were sexually trafficked into Bacha Bazi or \"boy play\", which was a custom where young boys were forced into entertainment where they danced or sang sexually as male entertainers for adult men and were raped repeatedly by their captors and his friends. At least 50 percent of sexual exploitation in Afghanistan was bacha bazi, and it often crossed lines into forced labor. Boys age 13 and under were most likely to be sexually exploited, and because Afghan girls were banned from sexual work and entertainment because they were seen as child-bearers and homemakers, [Afghan boys were picked as a substitute for sexual gratification](https://76crimes.com/2021/10/21/sex-trafficking-of-boys-contributed-to-taliban-victory-in-afghanistan/), being seen as a substitute for women. As a result, the people raping them saw them as a fake woman and didn't consider themselves gay for raping them. Taliban opposed Bacha Bazi but American-backed Afghan leaders practiced it and American forces ignored it. This led to support towards Taliban from families of victims and others opposed to the practice. The boys were made to dress in feminine attire and were released as soon as they grew beards. Many powerful Afghan men supported the practice because they believed women are for children and boys are for sexual gratification.\n\nBoys are more likely to be trafficked in Afghanistan than girls, as mentioned above, and often forced into forced labor or being a soldier, with young men ages 14 to 18 often being forced as soldiers or forced labor. Many soldiers were forced to become suicide bombers and young men put in forced labor worked in mines, worked in the streets or assistant truck driving.\n\n*Crime victimization and abuse*\n\n[Physical abuse and corporal punishment is common for Afghan kids](https://journals.plos.org/plosone/article/file?id=10.1371/journal.pone.0220614&type=printable). Except for baseline, boys were more likely than girls to experience physical punishment at home. Boys were also more likely than girls to experience peer violence victimization. Boys also scored higher than girls on depression, but often admittedly scored slightly higher on hope. Schools and teachers also inflicted corporal punishment and violence, particularly on boys. 100% of boy schools and only 20% of girl schools involved physical punishment from teachers. The same study found high rates of sexual abuse, including rape, of boys at schools, often by male teachers and older boys. When it comes to physical abuse, mothers often can be aggressors. In a [study](https://www.whatworks.co.za/documents/publications/424-ndungu-et-al-gibbs-2021-afghan-child-punishment-sem-15122021/file), 71.8% of married women admitted to physically abusing their children, and a little less than half said their partner also did so, which means many times, their partner, presumably a husband, did not do so. [In a study of physical abuse of children in Afghanistan](https://areu.org.af/wp-content/areu_publications/2016/01/804E-Love-Fear-and-Discipline-IP-print.pdf.pdf), men were more likely to believe boys got more physically disciplined, possibly due to probably experiencing it themselves or due to boys being perceived as potentially troublemakers. Women believed girls were beaten more, and women reported higher levels of violence directed towards girls because men might be unaware of violence mothers inflict on girls in the house.\n\n*Murder/homicide*\n\nIn Afghanistan, [87% of homicide victims are men](http://www.unodc.org/documents/gsh/data/GSH2013_Sex_data.xlsx). [In fact](https://www.aljazeera.com/opinions/2021/9/10/it-is-time-we-remember-afghan-men-are-also-victims-of-this-war), Afghan men and boys were killed all the time and American media only focused on the women and children, portraying Afghan men as sexist oppressors, but these men are usually victims instead. Due to media portraying Afghan men as evil misogynistic terrorists, the American military killed many male Afghan civilians and assumed they were terrorists. The media used feminist language (even the right-wing media did this) to portray women there as damsels in distress in need to help but not due to care for the women there, but to influence Americans into supporting the war against Afghanistan. America's war created so many political and economic issues, it made Afghanistan even more dangerous and violent for women and even for men. In fact, the US military only helped solely women who claimed to be harmed by Taliban, so many women lied and said the Taliban hurt them to get US aid from the US military. Most American soldiers, just like their political leaders or generals, did not distinguish between Afghan male civilians and Taliban fighters, and thus killed many male civilians. They often were unlawfully imprisoned, tortured and killed by the US military despite being civilians. Often mistaken as security threats instead of civilians, these men were killed either by the US military or by Taliban. According to the Bureau of Investigative Journalism, between January 2004 and February 2020, the US conducted at least 13,072 drone attacks in Afghanistan, killing 4126 to 10,076 people. 300 to 909 of those killed are believed to have been civilians. It's impossible to know how many were really civilians, because the US did everything to obscure this number. As the New York Times [explained](https://www.nytimes.com/2012/05/29/world/obamas-leadership-in-war-on-al-qaeda.html) in 2012, for example, the Obama administration counted “all military-age males \\[killed\\] in a strike zone as combatants … unless there is explicit intelligence posthumously proving them innocent.” “Counterterrorism officials,” the Times article went on to say, “insist this approach is one of simple logic: people in an area of known terrorist activity, or found with a top Qaeda operative, are probably up to no good.” Thus, many Afghan men who were civilians were killed by being guilty by association. They lived in Afghanistan in areas the US attacked, being labeled as automatically terrorists by default.\n\n[In fact](https://news.un.org/en/story/2021/07/1096382), the media emphasizes women and children in Afghanistan who are wounded or killed, when adult men are the most likely to have been killed. In Afghanistan, of all civilian casualties, 32% were women and 14% were children. This means 54% were men. Men were the most likely to be casualties, more so than women and more so than children. Not to mention some these children are presumably boys. The media emphasizes exclusively the women and children who are killed.\n\n*Taliban's treatment of boys*\n\n[Taliban have turned so many young boys into soldiers](https://www.hrw.org/news/2021/09/20/our-opportunity-end-talibans-use-child-soldiers). Boys as young as 6 are indoctrinated, and by age 13, learned how to use firearms. By their teenage years they were required to fight. The US-backed Afghan government and pro-government forces also recruited and used young boys. Taliban also used these boys to carry out suicides and other violent attacks, recruiting them through deception, promises of money or other incentives, or even threats. Taliban and other armed forces used young boys many times to carry out suicide bombings because they thought they could manipulate them more easily and might be less suspicious than adults. The US-backed former Afghan government and other pro-government forces also recruited young boys as recruitment and using them to fight. [Taliban used many young boys even as young as age 7 as suicide bombers](https://www.hrw.org/news/2011/08/31/afghanistan-taliban-should-stop-using-children-suicide-bombers), telling them lies like they would survive the bombing themselves if they were an amulet with Quran verses on it. Boys as young as 11 were also recruited by Taliban to carry out activities like smuggling weapons across the Pakistan-Afghanistan border, planting explosive devices, and armed combat. There were even 5 year olds used to plant bombs in south Afghanistan.\n\nAnother thing people must realize about Afghanistan is that women didn't lack rights in Afghanistan before Taliban took over. Look up pre-Taliban Afghanistan and women didn't need to wear veils and they were much more liberated and dressed in Western clothes and often had prestigious jobs. It was like America. Honestly if the CIA didn't give weapons to Islamic fundamentalist warriors in Afghanistan during the Afghan-Soviet War in the 80s, Taliban would've never taken over. That's how osama bin laden got his weapons. The CIA gave the mujahideen guerillas weapons which helped them fight off Soviets and they saved Afghanistan but these guerillas turned Afghanistan into another war zone. Then, the Taliban told Afghans that they would stop the war zones and offered an alternative, which many Afghans thought would liberate and save Afghanistan. They then recruited many people deceptively to increase the number of Taliban members, and this helped Taliban take over. A year after taking over, Taliban then began to become oppressive, which citizens didn't expect. If it wasn't for the CIA, the mujahideen wouldn't have taken over and thus Taliban wouldn't have been able to offer an alternative to citizens and take over. The CIA indirectly created Taliban. The CIA also are why Osama bin Laden managed to get weapons.\n\n**Iran**\n\nIran didn't make women dress a certain way or do anything particularly oppressive until 1979 when the Islamic Revolution happened. Before that, Iran was a secular monarchy and it wasn't different from the Western world. Women back then had more rights than women today in Iran. If it wasn't for the 1953 CIA assassination of their prime minister, King Shah wouldn't have had such a firm rule over Iran, which eventually led to Iranians having a fit about him and overthrowing him, creating modern Iran. The CIA's actions eventually led to modern Iran happening. But men in Iran have it just as bad as women in Iran. [This article](https://avoiceformen.com/featured/the-myth-of-patriarchal-oppression-in-iran/) should give a lot of information so read this article too. Boys in Iran are disproportionately raped or homeless, men are drafted, 81.9% of murder victims are men (see citation above for Afghan murder victims too which is where I got this from), and men are economically oppressed too. The media only shows what women go through. There's much more details about men's oppression in Iran. They aren't a patriarchy. They oppress everyone, just like America. For example, yes, men can divorce women for any reason while women can only divorce men for certain reasons, but women receive more benefits: \"Should a woman get divorced, in addition to what she gets out of her husband (called *Mehrieh*), her provider is considered to be her father and in case her father is dead, she will get from the government an equal share of her father’s occupational insurance as her salary for as long as she lives. This way, most divorced women do not have to work.\" Hell, mahr is something men have to pay to women in Iran if he divorces her and it's alimony but on steroids. Look up about it. Here's [two](https://avoiceformen.com/featured/indentured-servitude-for-men-in-iran-the-myth-of-patriarchal-oppressive-divorce-alimony/) [articles](https://en.wikipedia.org/wiki/Mahr).\n\n**Syria and Iraq (ISIS)**\n\nThe media always talks about how ISIS oppress women, but they hurt men all the time. If you look at Syria, so many men are killed, including by ISIS.\n\n*Murder*\n\n[Since March 2011, when the Syrian civil war began all the way up to now, 228,647 Syrian civilians have been killed](https://en.wikipedia.org/wiki/Casualties_of_the_Syrian_civil_war#Civilian_deaths). 79.4% of them were men (181,540 men), 6.96% were women (15,925 women), and 13% were children (29,741 children). Many of these children probably are boys. This means women were the least likely to be killed and usually men are killed. In fact, of all the 5,043 civilians ISIS killed, 68.65% were men, 11.64% were women, and 19% were children. Of the 200,367 civilians killed by Syrian government forces, 82.24% were men, 11.45% were children, and 5.96% were women. This means it's typically men being killed there. [Within their first year following the 2014 declaration of Caliphate](https://www.ibtimes.co.in/isis-has-beheaded-stoned-shot-1362-civilians-including-9-children-report-630716), ISIS had already killed 1,362 civilians, including 9 children and 19 women. This means 97.94% were men.\n\n*Sexual assault*\n\n[Many times the media shows women being made as sexual slaves by ISIS. What they don't show is that many men face sexual abuse/rape in this region too](https://www.unhcr.org/en-us/news/latest/2017/12/5a27a4e04/male-rape-sexual-torture-widespread-syria-crisis-report.html). They often were held as prisoners and raped, gang raped, or sexually tortured with these men ranging from age 10 to age 80. They also might get jobs due to poverty while being sexually blackmailed or forced to do sexual favors in countries of asylum to be paid money. In asylum countries, boys might be molested by older youth and others. [This sexual abuse of men and boys is done by ISIS, other non-state armed groups, or even the Syrian government](https://www.hrw.org/report/2020/07/29/they-treated-us-monstrous-ways/sexual-violence-against-men-boys-and-transgender). LGBT men were particularly at risk, but it happened to men regardless of sexuality, including straight, cisgender men. A woman for The Guardian, a newspaper who are pro-feminist, [even said](https://www.theguardian.com/working-in-development/2017/nov/21/male-sexual-torture-in-the-syrian-war-it-is-everywhere) she initially thought this was rare but interview many refugees from that region and all of them, including all the women, told her that they knew many men who were raped or sexually tortured, and of all men detained in prisons, the female refugees estimated 30 to 40% of the detained men were sexually abused. Armed groups even conducted raids on homes and raped both men and women. When fleeing, boys were promised food or money by older boys but were instead molested. [Syrian men are just as often sexually assaulted or tortured as Syrian women](https://www.arabnews.com/node/1370701/middle-east). People think that in these countries, society hates women who get raped, but they don't. The social norms by a vocal minority who influence/form the government decide what is right and because these countries are often dictatorships/kingdoms, most people can't say what they truly think. People might pretend to view rape victims negatively, which is why being raped damages your reputation there, but people there actually don't feel this way towards rape victims. People hate rapists there, and Syrian families were horrified by the male and female rape victims in their family's stories of sexual assault victimization. Yeah, there are honor killings, but most murder victims there are men, and honor killings don't happen as much as the media says, and a considerable chunk of it happens in a couple specific countries.\n\n**Yemen**\n\n[Even in Yemen, men and boys are often sexually abused, raped or sexually tortured in detention centers](https://www.un.org/sexualviolenceinconflict/countries/yemen/). [In 2020, about 62% of civilian casualties killed were men, but this article emphasizes women and children](https://reliefweb.int/report/yemen/average-six-women-killed-every-week-yemen-result-ongoing-conflict). [Even in Yemen, men and boys are raped during conflict, and this is a problem that happens in conflicts worldwide, including in any other nation](https://web.archive.org/web/20190321220806/https://www.foxnews.com/world/male-rape-emerging-as-one-of-the-most-underreported-weapons-of-todays-wars). This problem even happened in Libya in the 2011 revolution. Even in yemen, boys as young as age 8 are raped by often militias aligned with the Saudi Arabia and UAE-led coalition. Psychologists treating former underage soldiers forced to fight for Houthis, an Islamist armed group in Yemen, found that 50 to 60% of them were sexually abused by their superiors.\n\n**Saudi Arabia**\n\nEven Saudi Arabia has their fair share of oppression of men. [When it comes to trafficking victims](https://www.state.gov/reports/2020-trafficking-in-persons-report/saudi-arabia/), they only give shelter to female domestic workers and nobody else. Only Riyadh had a place for male domestic workers. Men and women from other employment sectors were unprotected. People like to complain about how women are not allowed to walk out or go on an airplane without a male guardian (at least in the nighttime) but [young men weren't allowed in malls unless with a female relative in Saudi Arabia](http://www.alriyadh.com/1008285). [In fact, evidence shows that women in Saudi Arabia are more likely than men to be happy](https://www.ipsos.com/sites/default/files/ct/news/documents/2020-12/spotlight.ksa_views_on_happiness.pdf). Saudi Arabia is more happy than most countries. People there might think people in the Western world treat women poorly, and that not allowing women to do certain things is protecting them. It's called benevolent sexism rather than misogyny (or hostile sexism). The way America views Saudi Arabia is how they view America, but the people there don't necessarily agree with the government laws. [In Saudi Arabia, virtually everyone who is executed is male](https://www.bbc.com/news/world-middle-east-60722057), and there's many kinds of capital crimes there, and two-thirds of homicide victims are men (citation above). [In 2013](https://ncfm.org/2013/08/news/discrimination-news/discrimination-against-men-news/saudi-arabia-bans-domestic-abuse-because-it-hadnt-already/), Saudi Arabia banned domestic violence by men against women, but ONLY men committing domestic abuse against women. Women doing this to men wasn't even banned (although maybe they'll be charged with simply assault). So much for patriarchy. [In fact, in 2013](https://web.archive.org/web/20131109094735/https://www.theguardian.com/commentisfree/2013/nov/02/saudi-protest-driving-ban-not-popular), most Saudi Arabian women opposed the right to drive and they believed it would lead to sexual harassment, men betraying them, and other problems. They believed it was horrible America would allow women to drive and thought it led to women being harmed or unsafe from predators, and believed this was an imitation of America. They instead believe America allowing women to drive is oppression. They believing being prohibited from driving was a privilege. In fact, this is similar to how long ago, many women often didn't want the right to vote because they believe suffrage was harmful to women by allowing them into the dangerous world of politics and considered the lack of right to vote a privilege or luckiness. [In fact](https://en.wikipedia.org/wiki/Universal_suffrage#Dates_by_country), Afghanistan didn't allow anyone to vote until 2004 where everyone including women could vote. Although women couldn't vote in Saudi Arabia until 2015, men couldn't until 2005, just ten years prior. Men are expected to pay full sum for the wedding even if his future wife makes more than him. Men are required to work as usual with no other option, but women can get the option to work and go to school (if given permission) or they can choose to be homemaker. While women can walk alone in the daytime, at night they are required to have a man with them, but this is an overprotective attitude about women, not misogyny (hate towards women). Society just doesn't care about men getting hurt.\n\n**Domestic violence**\n\n[There's surprisingly high rates of domestic abuse against men in the Arab countries, where way more men than women are victims of DV](https://www.arabbarometer.org/wp-content/uploads/Sexual-Harassement-Domestic-Violence-Arab-Citizens-Public-Opinion-2019.pdf). There are more male victims than female victims of domestic violence in Yemen (70% vs 19%) Libya (66% vs 17%) Tunisia (52% vs 32%) Palestine (51% vs 18%) Iraq (49% vs 17%) Jordan (48% vs 11%) Sudan (41% vs 25%) Algeria (34% vs 16%). There are more female victims of domestic violence than male victims in Morocco (35% vs 29%) Egypt (43% vs 26%) and Lebanon (56 vs 18%). Typically people there get help by contacting relatives instead of police for dealing with domestic abuse. They don't often contact police unless they're in Lebanon. Yes, women come forward in Arab countries. They contact the family, and the family intervenes. It's not like in the West where you call police.\n\n**Americans underestimate people's support for women's rights in these countries**\n\nPeople in these countries aren't as conservative as their governments might be. [Among men in Egypt](https://web.archive.org/web/20170503224119/http://imagesmena.org/wp-content/uploads/sites/5/2017/04/IMAGESMENA-2017-FULL-Final.pdf), men can have conservative attitudes towards women but even men. These Egyptian men still had conservative attitudes about men, most believed men and women both should not have friends of opposite gender, and most of them (80%) believed that boys are responsibile for the behavior of their sisters, even if they're younger than their sister. This means they believe the boy should be held responsible for something the sister did. Many views in the data do show you that Egyptian men have conservative attitudes towards women, but people who have conservative attitudes about what women should do or their jobs don't feel this way due to hatred of women, but due to social norms/gender roles which they still believe about men, too. 94% believe men who fail to pay maintenence should be penalized. Women were far more likely to spank (79% of women and 41% of men) or hit their children (44% of women and 11% of men). Some of the men admitted to having slapped or pushed their wife before and some women experienced it but most did not experience in the past year. Relatively low percentages outright beat them, and even lower percentages did so in the past year. Hardly any threatened them with a weapon. 64% of Egyptian men and 60% of Egyptian women believed woman should marry her rapist (but it could be out of concern for her reputation), but 72% of men and 67% of women disagreed with the idea that rapists should not be prosecuted if he rapes a woman then marries her. Only just 16% of men believed a woman is obliged to have sex whenever the husband wants if he provides financially, compared to 33% of women thinking this. Nonetheless, 80% of men and 73% of women believe a woman should be able to refuse to have sex with her husband when she doesn't want to. **Remember this though, read Arab surveys with a grain of salt. As a guy who knows many Arab immigrants, many people in these countries might have a social desirability bias and will answer what they feel the government expects them to say or what the Western questionnaires expect them to say. They probably don't mean a lot of the things they say.**\n\n  \nAccording to [Gallup](https://news.gallup.com/poll/103441/saudi-arabia-majorities-support-womens-rights.aspx) in 2007 (and the results could be different these days), 67% of Saudi men believed men and women should have equal rights, 55% believed they should be able to drive, 75% believed women should be allowed to have any job they are qualified for outside home, 52% believed women should have leadership positions in the cabinet and national council, 83% said women should keep all earnings from jobs for themselves and that husbands should support them and the household in full, and 88% believe in divorce, the child's financial support should be full responsibility of the father even if the mom has custody. Iranians had similar attitudes too, and most Iranians supported women's right to drive, including most Iranian men.\n\n**Dress codes**\n\nPeople complain about how women are required to wear a veil, but this is only true in Saudi Arabia, Iran, and some of Afghanistan. It wasn't always true in these countries. Besides, in many countries they aren't required to wear anything and in any other country besides these 3 they aren't required to wear a veil but it is widespread. but only Saudi Arabia requires BURQAS. In Iran you still them wear normal clothes, just a mere hijab and they still show some of their hair. But men have a dress code too. [In Iran](https://www.justice.gov/sites/default/files/eoir/legacy/2013/11/07/IRN102671.E.pdf), men can't wear shorts or western hairstyles, and men who wear \"feminine\" clothes might get stripped or beaten. [Men have to cover knees, and cannot wear sleeveless shirts without stigmatization](https://www.bordersofadventure.com/iran-dress-code-what-to-wear/). [In Saudi Arabia](https://www.saudiarabiavisa.co.uk/dress-code-foreigners.html), men aren't required to wear thobes as tourists but must cover legs and shoulders. They must avoid skinny jeans, shorts or sleeveless shirts. [In fact](https://www.theguardian.com/commentisfree/2007/feb/20/themalehijab), in Iran, up until maybe the 2000s, men were required to wear long-sleeved shirts before they could wear short-sleeved. [In Iraq](https://web.archive.org/web/20150529185836/https://www.nytimes.com/2005/03/18/world/middleeast/a-haircut-in-iraq-can-be-the-death-of-the-barber.html), for example, barbers were killed by militias for giving \"un-Islamic\" haircuts or shaving beards. These Islamic militants tried to stop beardless men in Iraq. One Iraqi fled and said he was beaten up as onlookers cheered for lacking enough facial hair and wearing traditional clothes instead of a t-shirt and jeans or bright clothes or clothes with English writings. [Taliban](https://www.usnews.com/news/world/articles/2022-03-28/taliban-bars-government-employees-without-beards-from-work-sources) also set restrictions on men saying they will be fired from government unless they have beards and wear certain clothes. [Taliban even will severely punish any man without a beard and stop male drivers to check if he has a beard or not](https://www.republicworld.com/world-news/rest-of-the-world-news/afghanistan-taliban-carries-out-vehicle-checks-to-see-mens-beards-womens-clothing-articleshow.html).\n\n**Conclusion**\n\nIt's a myth that male privilege happens in Muslim countries. Men and women are both oppressed there and the media just focuses on when women are but ignores men's problems there. In fact, [the roots of sexism toward women in the Arab World go back to Ottoman empire problems, which is caused by western europe](https://www.theatlantic.com/international/archive/2012/04/the-real-roots-of-sexism-in-the-middle-east-its-not-islam-race-or-hate/256362/). It wasn't caused by Islam. These countries weren't even always like this and pre-Islamic Arabia was actually worse for women until Prophet Muhammad came. It wasn't until the past couple centuries (and couple decades in some countries) when it all changed. Dress codes in these countries used to be more diverse and vary until recent times.",
    "title": "Male privilege is a myth in Muslim countries, too, and here's why:",
    "subreddit": "MensRights",
    "timestamp": 1687457371,
    "score": 371,
    "keyword": "man teacher"
  },
  {
    "text": "Mandated Child Support and Alimony should be the bare minimum Child support and alimony should not be based on the disgusting principle that \"Women and children deserve to maintain the same lifestyle after divorce\". No they don't. Unless you can prove that the husband promised his wife that he will support her forever, this shouldn't even be a debate. \n\nChild support and alimony should be not be based on \"potential\" income or a mathematical formula. Different parents decide different amounts of money to be spent on their child and each other. There will be couples who prefer saving money rather than lavishly spending all of it. There will be parents who prefer to put their child in a modest school rather than the most expensive one in the city. Going to such a school and living such a lifestyle is a privilege and not some birthright. And let's not talk about the fact that you'd have to do all this even if the child is found to be biologically not yours.  Therefore, a state enforcing a hard-working person to pay that much money to a non-working member of the society just because the government doesn't have to is deflecting responsibility.  And anything above the bare minimum should be a child's privilege, not some right.  \n\n\nThe same goes for alimony. The fact that people still feel entitled to maintain a good lifestyle just because you met a good man at some point does not make sense. The only thing you deserve is minimum money to maintain the basic needs of life which are food, clothing and shelter at the cheapest place in town. And that too if you can prove that the husband promised the same. In this case too, the government is trying to save money by deflecting the responsibility of the welfare of a non-productive person to someone who is working hard.  \nI would advise men who work in STEM and are currently trapped by this gynocentric system to move to countries like Singapore, Japan, and South Korea, which don't have any treaty regarding this disgusting practice of child support and alimony. You can also work there as an English teacher if you have the required skill set. The fact that an old clown(court judge) who likely gives a biased decision based on his interpretation of a very subjective law and personal feelings(like potential income, future income, benevolent sexism etc), and not some objective evidence,  and eventually decide how you should be spending your hard earned money shows how unjust the court system is. The women, in this case are trying to reap the benefits of the so-called \"patriarchy\". Therefore, it is not wrong to avoid this circus and live your life in a place which respects people of your gender.",
    "title": "Mandated Child Support and Alimony should be the bare minimum",
    "subreddit": "MensRights",
    "timestamp": 1698832637,
    "score": 251,
    "keyword": "man teacher"
  },
  {
    "text": "The double standard of relationships with wide age gaps So…two women I know agreed with the statement that an older woman and a much younger guy is ok but an older man and a much younger girl is weird and creepy. Apparently it’s a controversial thing to say that both can be wrong.\n\nYou can think wide age gaps are weird or not but saying that only older men are creeps and not women is just complete bs. I’m honestly shocked and worried cause how do you change opinions like this? I mentioned female teachers sexually assaulting their students and they were surprised that this even happened. Is it such a wild concept that any older person can groom a younger one?\n\nThis idea of the woman being the only victim and men the only perpetrators of sexual assault and manipulation is just wrong and still embedded in so many people’s minds (men and women). I’m worried, what can we do?\n\nedit: I personally don’t find relationships with (wide) age gaps inherently problematic but I do find it questioning if it’s between (let’s say) an 19 year old and a 50 year old. But that’s not really the point of my post anyways. Like I said, no matter if you’re critical towards age gaps or not, it shouldn’t only be directed towards one gender and not the other. Sorry if my english isn’t good enough to explain what I mean, I’m not english.",
    "title": "The double standard of relationships with wide age gaps",
    "subreddit": "MensRights",
    "timestamp": 1703591432,
    "score": 186,
    "keyword": "man teacher"
  },
  {
    "text": "men are more reactive to lower wages-why? In the UK the number of male teachers in secondary schools is falling and the data suggests it’s because men are more reactive to wage fluctuations.\n\nBut why?\n\nPressure to make money more on men because men are providers etc…ok no problem. but also bcos women want men with more money i guess.\n\nbut this is 2023. women have their own money.\n\nSo why does this still exist? \n\nIt’s depressing as a man if I have to accept a reality in which i should chase money not a job i actually want. \n\nIf it is just because women will never date men on lower wages…how do we solve that?",
    "title": "men are more reactive to lower wages-why?",
    "subreddit": "MensRights",
    "timestamp": 1691147507,
    "score": 156,
    "keyword": "man teacher"
  },
  {
    "text": "why do men blame women for the (relatively) new disparity in college degrees? as most of you already know, women are now completing more college degrees than men. i keep seeing men saying that “society is holding men back”, “we don’t need feminism because women are getting more degrees”, “it’s not fair to men that women are graduating more now”. my question is: how do these men rationalize this reasoning/why do they think that it’s our fault? \n\nfor as long as i can remember, girls/women in my classes always worked hard, respected the teacher, completed homework, cared about their grades, prioritized academics, et cetera. on the other hand, boys/men in my classes have disrespected the teacher, not completed homework or asked to cheat off of mine, not studied, not cared about academics, said “school doesn’t matter”, et cetera. obviously these things don’t apply to every man and woman, but there’s a general pattern. \n\nwomen were not allowed in or were pushed out of higher education and education in general for years and years; now that we have the opportunity to achieve, we are doing it (and doing it well). in fact, we seem to have raised the standards, even though men don’t face any new barriers with women in schools, and women still face sexist attitudes and inappropriate comments all the time in education (i could rant for like 20 minutes just about my own experiences). why are we expected to pander to men who have skated by with the bare minimum for so long and are now unable or unwilling to put in more effort? why are we expected to take the blame for their failings when they have tried to hold us back every step of the way? why do they think that it’s our fault that they can’t achieve everything just because they are (usually white) men? how do we get these people to realize that our success doesn’t cause their demise?",
    "title": "why do men blame women for the (relatively) new disparity in college degrees?",
    "subreddit": "Feminism",
    "timestamp": 1672847248,
    "score": 547,
    "keyword": "man teacher"
  },
  {
    "text": "Mistreatment of women in my country  \n\nHello girls, I'm Moroccan and I just want to let my thoughts about because I'm frustrated, I have observed that a significant number of Moroccan Muslim( my default assumption) men, and men from other Muslim-majority countries like Egypt and Algeria, treat women unfairly and disrespectfully. Some women also exhibit this behavior, but it is unclear what else these individuals have in common other than the religion, I'm trying to understand what is the common ground that they share. although it mostly has nothing to do with what Islam preaches. For instance, I have come across a Facebook group with over 200K members that refers to women in derogatory terms such as \" lmra hashak\" which is kind of hard to translate correctly but it means something along the lines of \" women are something disgusting, something you're sorry to see\" because the term \" hashak\" is mostly used while talking about donkeys or dogs  ,and \" 9hwya\" which literally means \" the brown girl\" but in a very offensive manner, obviously both racist and degrading because that's what their intention is while using it. Other Arabic groups share similar content, including pictures that are demeaning to women. Additionally, there was a post mentioning a national team competing in mathematics with only one girl and four boys, people left derogatory comments, calling women stupid. because there aren't more girls there, and because in my country it's known that girls mostly get higher grades and pass more exams than men, such as exam to become a lawyer teacher etc., so when there is any post about any team that contains more men than women they immediately make everything girls did worthless,  And It happens with any post where there is anything about women sadly. I always check the comments hoping I'm wrong, just to be let down. They also do not acknowledge women's achievements throughout history or recognize the success of many women who did not get the recognition they deserved due to historical discrimination.\n\nIt is disheartening to see that many individuals in these communities blame the victim in rape cases and even defend pedophilia. In my high school, I witnessed four teachers who slept with 13-15-year-old girls or even younger. I want to understand why such mistreatment of women is prevalent in these societies and why some individuals think it is acceptable. I had hoped that in other environments such as university, things would be better, but unfortunately, I was once again disappointed. Even my professors speak about women in a derogatory manner, giving examples of them being stupid, crazy, and so on, even when the material they're teaching is unrelated to such topics. When they ask my mostly male classmates if they agree, they laugh and make even more offensive remarks. Some even go as far as to suggest that they would do worse things themselves.\n\nI once even tried to stop the professor and all he did was telling me \"you'll understand why men are better when you get married\". \n\nI just want to know if it's okay for me to have hatred for men in my country, and all the ones with similar mentality, or am I wrong? because I don't know why even the girls agree with them, if there is a rape case, it's women's fault, if there's assault case, it's women's fault. etc.\n\nThere is also a whole group that has the hashtag \"#NoToMarryingWorkingWomen\" where they say they won't marry any woman who works, because she gets exploited by her director and she isn't only his, but his and the director's too, and that they don't cook, and won't find time to take care of the children and him, and because she will start to go out with friends etc.\n\nAnd the list goes on obviously. \n\nI just don't get the hatred, is this also this common in your countries?\n\n Examples of such posts that they share, I provided translation :\n\n[https://ibb.co/c8Rn9ZM](https://ibb.co/c8Rn9ZM) \\- this photo was taken from a video where a girl was walking with a skirt and some man lifted her skirt and obviously sexually harassed her and slapped her bottom. they call him king for doing so. and when this happen most men were saying the girl deserved it for going out like that.\n\n[https://ibb.co/wQwzDm3](https://ibb.co/wQwzDm3) : insulting an inventor, and the comments kept saying she didn't help them make WIFI, she just opened her legs.\n\n> [https://ibb.co/jwM9Cjh](https://ibb.co/jwM9Cjh) : as for this one, the post says \" does women deserve to and the answers are \" she does \" \"she doesn't\" and everyone picked she doesn't, meaning they stopped at \" she doesn't deserve \" referring to she doesn't deserve anything. \"",
    "title": "Mistreatment of women in my country",
    "subreddit": "Feminism",
    "timestamp": 1683878025,
    "score": 544,
    "keyword": "man teacher"
  },
  {
    "text": "I got told I was an idiot today by a man who wouldn’t let me finish speaking. I wasn’t that much of a feminist before but omg I am now. Discrimination towards women is real and it still happens today. In my creative writing class we were discussing a part of a book where a white man made a mockery of a serious situation that he was apparently supporting. I was the last to speak and as soon as I said my sentence a row of hands flew up. Two guys, one girl. The girl and one of the guys were very kind and respectful in their disagreement of me but I was barely able to pay attention as this kid was waving his arms around and acting frustrated, like a child. I like CONVERSATION and that was fine. The one guy left tho was a complete ass. He completely dismissed and made fun of the one girl WHO WAS LITERALLY AGREEING WITH HIM and he silently and respectfully listened to the guy. He also basically called me an idiot and when my teacher asked him if he was gonna be nice he said “to you yeah to her ehhhhh”. I wasn’t finished talking, i didn’t even get my whole point across. This kid will never admit he’s wrong, he’s racist, and hes insanely reactive as well. I will continue to be civil and kind to him but I’m never going to let him speak over me again. In situations like these I wish I was a man, I wish I was able to talk and not immediately be made a joke. My friend and I were talking and he says he does this all the time, it’s not happening to me again though. I just want to be heard even if it’s in a little situations like these. And I will be",
    "title": "I got told I was an idiot today by a man who wouldn’t let me finish speaking. I wasn’t that much of a feminist before but omg I am now. Discrimination towards women is real and it still happens today.",
    "subreddit": "Feminism",
    "timestamp": 1675468479,
    "score": 355,
    "keyword": "man teacher"
  },
  {
    "text": "Young Men and Hostile Sexism I am a psychology researcher, and enjoy studying criminal justice and social issue. I’m trying to collect statistical, peer reviewed data for what I'm seeing. It appears as if young men as young as 11/12 are turning to hostile sexism more so than previously. They do it to teachers (apparently that's a huge problem) sisters, mothers, young kids, adults - really anyone\n\nGrowing up evangelical Baptist, the Red Pill Manosphere is almost exactly what I heard growing [up. It was](https://up.it/) shaming, evil, hateful, violent, would rather women pass away than terminate a pregnancy. They thrive on a culture of women deserving abuse. However a lot of that in the past was benevolent sexism and infantilizing. Now I see growing numbers of men who are leaning towards hostile sexism and causing their own issue of loneliness.\n\nI see the famous, privileged Alpha Bro podcasts giving terrible relationships to encourage impressionable viewers that young women are nothing but servants and sex toys. I do believe that men will listen to good male leaders, but any time I look into those conversations, young men are trying to shut down the idea of self improvement. They attack the guy who is telling a straight man \"this is how to help your relationship\" and the response in a hostile way, attacking a happy man in a relationship to drag **him** down.\n\nDaily comments go from pedophilic desires, rape threats, invasive comments and pure vitriol. If a woman tries to make a post, article, or video about women's issues and that is the only time I see men talk about men's issues, other than the podcasts which are full of toxic information that will absolutely end in a break up. These Men's Rights Activists and WASPS are hindering the possibility of their relationships being successful.\n\nThey convince men that they *need* to cheat because \"they have needs\". They shut down these healthy men in favor of listening to podcasts that validate their feelings and blame their shortcomings on \"used up hoes\".It seems like now more than ever in my studies and life that men are completely okay with admitting to their immoral behavior but expect the woman to be as pure as driven snow.\n\nI think we are in the midst of a pendulum swing. Remember all the SJW stuff that is really cringy now? I feel like the alt right pipeline of misogynists is getting more and more brazenly violent in words and actions.\n\nOnly found one study about sexism of Gen Z was specifically in NC. Young voters are becoming increasingly less supportive of women in leadership. What are your thoughts:\n\nTl:Dr - I'm noticing more hostile sexism among American men, especially Gen Z and young Millennials. Have you noticed this too? Do you think there will ever be studies about this in time?",
    "title": "Young Men and Hostile Sexism",
    "subreddit": "Feminism",
    "timestamp": 1700593393,
    "score": 63,
    "keyword": "man teacher"
  },
  {
    "text": "TW assault. An essay I wrote a couple months ago On Being Afraid as a Feminine Person:\n    I was seven when I first learned something I was too young to know. My second grade teacher, a tall man in his 50s, told all of my classmates to stand up and point to our genitals, all in the name of “safety”. I later realised he was probably getting off to our sheepish, embarrassed faces, pointing to our “private parts”.\n    This wasn’t the first incident where I was reminded of what it was like to be raised in America, much less as a person assigned female at birth. At around 11, my sister was approached on a bike ride by a much older man, who told her to follow him. She would have probably ended up on the news, had it not been for some passing older women who scared him off.\n    At thirteen, I was called “beautiful” in a store by a man who followed me to my car. At the time, I had already grown terrified of men, especially older ones. The stares that followed me on the street, the microaggressions, the news articles about countless women and girls, raped and murdered- all of these things filled me with fear. I’ve started carrying a knife when I go out in public, and hope these people will see it clipped to my belt and not engage. \n    This terror of men doesn’t just come from the ones on the street: it comes from within my own home and school. As a child, my mother would tell me about her father; how he would scream at her and her siblings, awful words that cut deep. Visiting his house, I soon saw remnants of this abuse- when he would demand things of my grandmother, his wife, and insult her in the same breath. From that point I was wary of ever marrying a man. \n    It’s funny to me: how little girls are taught to trust men, trust the boys in their classes, but also to be wary of them. From youth, we teach girls to love boys, to find husbands, but also not to provoke them; not to say anything that might set them off. It’s similar to loving a venomous snake that may strike at any moment.\n    Recently this hypocrisy was demonstrated at my school. A boy, a freshman, was thrown in a locker room and raped with a plunger by a group of male soccer players. My mother, after expressing her condolences about the fate of the poor young man, told me that this was a clear reason for me to not “set anyone off”- especially a group of boys. This warning came from the mouth of the same woman who talks all the time about finding a nice boy after college and giving her grandbabies. \n    I ask this- how am I supposed to carry out this wish, even if I wanted to? How can I remain silent, not get into an argument with any boys about politics or feminism because they might hurt me for it, but then marry a man? How can I learn to be powerful, but still silent enough so they don’t rape me, or kill me? \n    It is my wish that eventually, people socialised as female will no longer have to walk down the street in fear. It is my wish that eventually, people socialised as female will be able to trust men enough to discuss politics with them and challenge their ideas without fearing revenge. It is my wish that all people, not just women, will not have to fear anyone; not our fathers, not our classmates, not the men we pass on the street.",
    "title": "TW assault. An essay I wrote a couple months ago",
    "subreddit": "Feminism",
    "timestamp": 1673896656,
    "score": 38,
    "keyword": "man teacher"
  },
  {
    "text": "Illusion of Consent Some of this is US specific, some is general feelings.\n\nAutonomy vs Justice\n\nThe more I read and experience the more I’m baffled by the consent conversations. YES, consent matters. However, we live in a patriarchy. Informed consent implies two (or more) parties of equal power coming to an agreement whereas folks AFAB literally come out of the womb with limited access to power over their own bodies. We recognize power dynamics in teacher/student relations, therapist/client relations, even employer/employee situations. Why isn’t the greater power dynamic talked about?\n\nIt is only recently (the 90s) that marital rape was made illegal in all 50 states. Roe was just overturned. In the 80s, it was finally overturned that men are “head of household and master” with unilateral control over property, same time the first woman got to SCOTUS. 2007 is when we had our first female speaker of the house.\n\nFor centuries, women weren’t allowed to hold property because they were considered property. They didn’t get credit scores when the credit system was first put in place. They weren’t/aren’t paid equally for equal work. Marriage was literally a contract transitioning property from one man (the father) to another (the husband). We are raised from infancy to seek out a husband because that benefits men while simultaneously being told we hold men back. Everything in society is about getting our compliance so men can get what they want from us and face minimal consequences. Men hold all the societal power. \n\nWe are not on equal footing with men in this patriarchal world. At no point in my life was I making a free and educated choice to interact with men in my life. I keep looking for instances of actual consent and I just see power imbalances everywhere and indignant AFAB folks claiming they can freely consent.\n\nI’m struggling to see choice. It is even worse in some countries, slightly better in others. None of them are free from it.",
    "title": "Illusion of Consent",
    "subreddit": "Feminism",
    "timestamp": 1692387555,
    "score": 21,
    "keyword": "man teacher"
  }
]