[
  {
    "text": "Help Getting A Raise Just to start off, I’d like to give context to my work, maybe it’ll help somehow. So, I work in the fashion industry, at a small independent fashion brand in Singapore, they have been in business for 4-5yrs. Their items retail from about 100SGD (75usd) for accessories, to abt 800SGD (600usd) for dresses.\n\nThe fashion industry in Singapore is not great, but not that bad either as we have some local-brand-big-players here. And im talking big big. So, in that sense, there are market rates so to speak. Altho, the avg salary of a designer is abt 2-4k here. Let me also lay out the fact that im 90% sure they cant afford to lose me. Ive taken on every single design job here and everything produced is done under my watch.\n\nNow lets get to it. I want a mother fucking raise. I’m on a consultation basis which means i go by an hourly rate, and I dont get any paid off or sick days. With that said im looking at a 15% increase which totals up to abt SGD280 on avg.\n\nIve gone thru the first rounds of negotiations where they said they the usual, which is the company isnt turning a profit, we cant give u what u want. They instead offered me this:\n\nIf sales hits 22k, u get your asking amt for the month. And if we go abv 30k, u get an additional commission of 2% (not of the 30k, but the amt beyond it). Sounds ok-ISH until u factor in that for abt 5-6 months of a year, they only make 17-25k in that month. They also tell me that their breaking even number is 20k (a very shady amt, backed up by estimates). \n\nSo heres where my self-awareness kicks in and i’d like to share what tactics i see them (the negotiation is amongst my boss, his right hand guy and i) using to try to get what THEY want. (Which is to pay me as little as possible, and to make as much sales as possible).\n\n1. The right-hand-man (lets call him RHM) is v quick on his feet to come up w excuses, using numbers and figures saying things like we would pay you more if we could.\n\n2. Ive also noticed, RHM will never agree quickly to something, unless it benefits him & the company. He’s also v insistent when he believes in something.\n\n3. My direct boss is slightly different. He looks to RHM for advise and instead his tactics are to play on heartstrings. So he will poetically announce things like “i want you to be happy w our discussion” and “you have your own right to this opinion, but just to let you know, i do not take a salary from this company”.\n\nAll in all, they are shady as hell and i do not trust then in the slightest bit because they are evidently propelled by self interest.\n\nIn terms if whether i deserve a raise, my answer is hell yes? My unsaid job scope entails other things besides design as well. Sometimes i deal w clients, i facilitate bespoke orders, i manage multiple seamstresses, i have to do the reports, i am also the runner when things need to be bought or delivered. The list cud go on. Times are hard now and I’m quite comfortable where I am, there great autonomy which i enjoy as a designer and part-time artist. Hence i have not gone looking that much. Ive taken on a lot of my boss’ workload ever since i arrived, he doesnt deal w any production anymore. And he’s even been passing on some clients to me. I also feel like whether or not he is pushing retail sales is entirely his domain, and I question why my raise and commissions shld be based off of that?? Also why does he look at month to month when he shld be looking at profits in the year? Isnt that what a good month is for? To tie you over the bad months. Its like they’re saying I only deserve a raise if we do well every month?? Which is impossible imo.\n\nI need help figuring out how I can get what I think I’m worth and I’m exhausted having to deal w the stress and anxiety of plotting/thinking where i shld move on to. Any advice is helpful tysm.",
    "title": "Help Getting A Raise",
    "subreddit": "jobs",
    "timestamp": 1620033552,
    "score": 3,
    "keyword": "man artist"
  },
  {
    "text": "Today is Mac Miller’s Birthday; Miss you dearly man, who’s one artist that will always have a place in your conscious?",
    "title": "Today is Mac Miller’s Birthday; Miss you dearly man, who’s one artist that will always have a place in your conscious?",
    "subreddit": "AskReddit",
    "timestamp": 1611066274,
    "score": 3,
    "keyword": "man artist"
  },
  {
    "text": "who would win: the world's strongest man or the worlds most skilled martial artist?",
    "title": "who would win: the world's strongest man or the worlds most skilled martial artist?",
    "subreddit": "AskReddit",
    "timestamp": 1618666268,
    "score": 3,
    "keyword": "man artist"
  },
  {
    "text": "I was being followed and called the police. Walking home from the grocery store. A man came up to me without a mask and I put my hand up to sat Im not interested and keep walking. He sayings stuff like “give me a chance” and “wow a real escape artist”. He is persistent in following me a few blocks, so I enter the first store I could find. I told the clerk that the man outside was following me and Ive been waiting for him to leave. She recommended that I contact 911. I called the police and they asked me to identify the individual. A hotel manager across the street  saw the police care and came over and said they kicked the man out this morning for a ‘mental health crisis’ and he has been wandering the area ever since. The police asked if he was threatening and I said no but he made me feel unsafe. I told them I didn’t feel comfortable walking outside and they drove me home. Then they drove back to talk to the man.\n\nIf ANYONE makes you feel uncomfortable, speak up and get help. It is better to waste a half hour or so letting someone know you feel unsafe than putting your life in danger.",
    "title": "I was being followed and called the police.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616451904,
    "score": 2455,
    "keyword": "man artist"
  },
  {
    "text": "Men ruining hobby/gaming groups As the title says, I'm sick of men ruining hobby groups for me.\n\nWhen I was 7 my sister and her friend brought home some Choose Your Own Adventure books that were based on Dungeons and Dragons, and I quickly became obsessed with them, the obsession lasting throughout my childhood and teens.\nFast-forward thirty years and I started collecting them again, for the sake of nostalgia and fun - they are great to read during pandemic lockdowns and I can race my husband through them when we have double-ups of the more common books.\n\nBut the hobby is dominated by dudes. So dominated that the ratio is about 100 to 1 of men to women gamebook enthusiasts. And of course, that means there will be problems. After joining a few groups to find books I was missing, a man messaged me to tell me that he got his first boner to a magazine cover depicting a female antagonist in one of the books. I blocked him. Other guys from the group went through my facebook profile and 'liked' all my profile pics, back as far as 2015. I blocked them. I posted in one of the groups the maps I used to draw of the castles and dungeons in the books, and one guy started creepily messaging me to buy the *original* copies of the maps I drew as a kid. I also posted about how excited I was that Rhianna Pratchett (daughter of Sir terry Pratchett) had written a gamebook that was released last year, and got immediately hate bombed by sour dudes who didn't think her book was any good because she's a woman. \n\nAnd lastly, one of the guys in the biggest gamebook group posted a drawing he'd done of a woman's ass and vulva in a thong, thrust at the camera. I complained about the image, pointing out that a) it was gross and sexist and b) there are kids in the group as the recent releases of these books are marketed at teens.\n\nI was inundated with insults by the artist and his friends, then the admins of the group banned me for 'causing trouble'.\n\nWhy, why WHY the fuck can't men stop themselves from ruining hobby groups for women? All they need to do is stick to the subject matter - the hobby - and talk about that.\n\nApparently I'm asking too much.",
    "title": "Men ruining hobby/gaming groups",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1630612617,
    "score": 1270,
    "keyword": "man artist"
  },
  {
    "text": "I pissed off the mailman, and I liked it. CW: men who think it's couth to talk about women like sex objects, let alone publicly disrespect them.  Sharing here, because there's nowhere I can take delight in this win, outside of with the friend it involves.  \n\n\n I work in a tattoo studio with my co-worker (we'll call her Cheryl) and two guys (the owner and an artist we just got from LA).  While this story may have never occurred if the owner knew where to step in, I'm used to men not knowing what to do in the face of other men being asshats.  I've grown used to being the balls for myself and my friends.\n\nSo, several months ago, we got a new mailman. The first day we all met him, it was Thanksgiving and he was in sour spirits.  Of course, very nice Cheryl asked him why he was so glum.  \n\nWell, it turned out this poor guy moved to Kansas from Florida for a woman he loved.  When he got here, she left him, and he was suddenly all alone in one of the most geographically different places than his beloved Florida.  He was just drinking himself silly, all alone, and that made us sad.  \n\nSo for the next several months we began building a rapport.  Anytime he'd stop in, he'd take 10-30 minutes to gab away with myself and Cheryl. We'll call him \"Florida Man\".  At first, I thought this was really sweet.  You could tell Cheryl made Florida Man light up and that he looked forward to laughing with her.  \n\nHowever, he started giving me bad vibes. \n\n It started with how he'd start dick-nosing his mask whenever he stopped in.  He talks a million miles, a minute, and clearly the mask was too cumbersome for him.  My best friend is in his 70's.  I'd gone from being a bar fly to completely isolating myself to home and work.  Meanwhile, Florida Man goes to God knows how many businesses a day, and he's definitely not getting vaccinated.  Yet, he thinks we just love his pathogens, so he starts dropping his mask, entirely, at times.  \n\nThen, he said something about Cheryl's vagina, and I told him to watch his mouth.  He then \"joked\" about bending me over to give me a tattoo on my ass of his name.  At that point, I decided I didnt like Florida Man, but Cheryl does and as long as someone else talks to him, I don't have to.  \n\nBut eventually, he got too comfortable.  He started making some really crass remarks about Cheryl.  Mind you, he's saying these things not just to her, but loud and ostentatious enough the whole studio has no choice but to listen.  Examples include such gems \"Damn, you'd think we were fucking with how you treat me.  Do you see how she talks to me? I swear, I should be getting some.\"  \"Dont worry, ol' [insert actual name here] will give you something to walk weird about.\" and \"If I had that vagina at my disposal, you'd be in bed for days.\"\n\nI'm beginning to understand why his ex left him. \n\nWhen he would say things like this, the men folk never spoke up or told him he was going too far.  But Cheryl was clearly uncomfortable.  She got giggly in that \"I don't know what to say\" way and would try to change the subject.  I counted three days in a row he brought up her vagina and I'd had it. \n\n When he left, I asked \"Do you like the way he's talking about you?\"\n\nCheryl: \"No, I hate it.  It makes me really uncomfortable. Why can't he stop talking about my body?\"\n\nMe: \"Why don't you ask him to stop?\"\n\nCheryl: \"I don't know.  I just kind of freeze and laugh.  I know it doesn't help, but I'm not good at speaking up for myself in situations like that.\"\n\nMe: \"it's a defense mechanism.  It's not helping, but I understand what it is to be so uncomfortable you can't come up with the words.\"\n\nCheryl: \"I wish he'd stop.\"\n\nMe: \"Do I need to be your bitchy friend?\"\n\nCheryl: \"Please.\"\n\nSo the next day Florida Man came in, I got up, excused myself from my customer, and grabbed some new latex gloves.  I walked over and stood beside her silently and just waited.  He mentioned fucking her and I snapped the gloves hard around my hands and held his gaze.  I then asked him when was the last time he had a rectal exam.  He was clearly confused, and Cheryl started laughing and caught on.  We started talking about all the things we'd love to see shoved up his ass.  He left after being weirded out.  \n\nThe next day, he came in again, and brought up her sex life.  So I started asking him if he was familiar with the concept of docking.  Cheryl and I then digressed into sounding, and how cool it would be to see him with a rod up his dick.  \n\nBy the third day, he still hadn't gotten the message.  We had no incoming mail, no outgoing mail. And yet there he is, leaned over the desk making creepy eyes and comments at her. This time, he didn't even try to wear his mask.  \n\nSo I finally just asked him what he was doing here?\n\nFlorida Man: \"What do you mean?\"\n\nMe: \"I mean we have no incoming mail, no outgoing mail, and you're standing here without a mask, endangering myself, the rest of the artists, and our customers.  All so you can degrade my friend and talk about her body like a starving dog.  Why are you here?\"\n\nFlorida Man: looking to Cheryl \"Is she being serious right now?\"\n\nCheryl: \"As a heart attack.\"\n\nFlorida Man: to me \"Are you being serious right now?\"\n\nMe: \"I'm so fucking serious. Get out of my shop.\"\n\nFlorida Man: In disbelief, he looked over to our two men folk.  \"She's for real?\"\n\nThe owner:  \"You heard her.  Move on, man.\"\n\nAnd that was the last time Florida Man bothered us.  He spent three days just poking his very masked face in to see if we had mail, refusing to say a word.  For a week, he had someone else take us on his route.  Now, he's back on the route and has finally gotten the courage to step in to ask for our mail.  But all conversations are off Cheryl couldn't be happier.\n\nTLDR; my friend laughs as a defense mechanism and was being made to feel uncomfortable.  So I made him very uncomfortable and the behavior stopped.\n\nEDIT: thank you guys so much for the karma and the awards. It's nice to feel like I made a good call, even if roundabout.  As per recommendation, I've put in a complaint with USPS.",
    "title": "I pissed off the mailman, and I liked it.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1621551090,
    "score": 600,
    "keyword": "man artist"
  },
  {
    "text": "After 6 years, I realized I was roofied. Just needed to get this off my chest, and don’t feel comfortable sharing this with anyone in real life.\n\nMy city holds a popular music festival every year in the summer. I’ve never been to one of the festivals, but the artists who play at the festivals will also do “after-parties” at smaller venues with smaller crowds. My friend and I went to one of these after parties in a spur-of-the-moment decision we made at dinner. \n\nWe had been drinking a little beforehand at the late dinner, but I was most definitely not drunk when we arrived at the after party. My friend recognized an acquaintance, and after some small chit chat the acquaintance insisted we join him and his friends at their table, which was going to have a great view of the performer. The group was a mix of men and women. \n\nI was talking to one man, who was friendly. It turned out we went to the same university, and were talking about that. I felt more comfortable around him when he told me he had a girlfriend, who wasn’t here because she didn’t enjoy this type of thing. I also had a boyfriend at the time, who was also not into this sort of thing. I thought nothing of it when he handed me a glass of champagne, which was my first drink at the venue.\n\nShortly after, the room started to spin. I felt extremely claustrophobic and rushed to the venue’s exit. I remember the man who handed me the drink ask me where I was going, and I don’t remember if I said anything. I think he got up to follow me but I can’t remember at all.\n\nMy memory starts getting spotty after that. I have a memory of sitting on the side walk, a pile of vomit next to me. A girl I had never seen before handing me a Gatorade, asking if there was someone she could call from my phone. I remember a police officer who helped me into the Uber that had been ordered for me, I don’t know by who. The police officer said I would be okay.\n\nI woke up on the floor of my apartment the next day, smelling like vomit. My boyfriend at the time was furious with me, and berated me as soon as I woke up. He accused me of ruining his night and trying to cheat on him. Or something. I don’t know. I was in a lot of pain and he felt like the least of my problems.\n\nI was reading a post about refusing drinks from men and it triggered this realization - I finally figured out what happened that night. The man I thought was nice and friendly had roofied me. I could have died. Because it was at an after-party, people just assumed I had had to much to drink. The Gatorade lady (bless her) and the police officer did help, but they thought I just needed to go home and sleep it off. I should have gone to the hospital. I could have choked on my own vomit passed out on the floor of my apartment, because my own boyfriend thought I was just a messy cheater and left me to “take care of myself.” It could have been so much worse.\n\nIt makes me sick to think that other women might have a similar story. Who realize too late.\n\nThanks for reading.\n\nEdit: I apologize for not proactively flairing, this is my first post",
    "title": "After 6 years, I realized I was roofied.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613856795,
    "score": 478,
    "keyword": "man artist"
  },
  {
    "text": "A man tried to do something to me last night I am a 39 year old woman, I have never feared walking alone at night, when I was a teen I had insomnia and I would walk miles and miles in the evenings trying to get tired enough to sleep. Any time I've encountered another person while out walking they've either ignored me or nodded hello and we've both gone on our ways. \n\nWhich gets me to last night. I have a dog who is an escape artist. We've installed a wired fence that pairs with a collar that corrects him when he gets too close to the fence. It works pretty well - unless something REALLY interesting is on the other side of the fence. Since we've had him neutered he hasn't jumped out of the fence. \n\nLast night I thought my son put him out, but we couldn't find him in the yard. We called and looked under all his favorite bushes and hiding spots and didn't see him. So, it's almost 11 and the dog isn't anywhere to be seen, so I grab his leash and start walking toward where he tends to go when he gets out.  I walked about three blocks from home when my partner called me - the dog had been in the house the whole time, he'd crawled under a bed I didn't think he even still fit under and was asleep. \n\nSo I turn around and start walking home. And here's where the creep comes in. I was walking up the left side of the street because there were no sidewalks in that part of the street and a man was walking the opposite direction on the opposite side of the road. No big deal until he CROSSED THE STREET TO PUT HIMSELF ON A COLLISION COURSE WITH ME. Any time I tried to angle my direction to go around him he'd side step so that he was right in front of me again. He changed direction at least 3 times to stay like that. \n\nSo I yelled at him to keep walking. And he says something along the lines of he was just trying to be friendly, so I YELLED EVEN LOUDER \"YOU WALK ON YOUR WAY OR I AM GOING TO MAKE A WHOLE LOT OF FUCKING NOISE\" and I kept walking towards my house which was less than a full block away. \n\nI don't know what his real intentions were, but I think he was trying to get close enough to me to put hands on me. I'm only 5'2\" but he wasn't much taller than me and I am pretty sure my fatass outweighed him. \n\nI got home and I was rattled and told my boyfriend what had happened. He encouraged me to call the police and report the event, I didn't want to at first but he dialed the number so all I had to do was quickly talk to dispatch. \n\nEveryone I told has taken me seriously, no one has acted like I overreacted or was being dramatic about it. I really expected to have a little bit of push back about it. \n\nAnyway, that's my story. Guy put himself in my way multiple times and I got meanly, aggressively loud with him on a residential street to get him to leave me alone. It worked and everyone I told about it has agreed that he had bad intentions and that I did the right thing. \n\nDon't be afraid of being called an overly dramatic bitch, nice is how they get close enough to mess with you.",
    "title": "A man tried to do something to me last night",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1624371073,
    "score": 164,
    "keyword": "man artist"
  },
  {
    "text": "The Gabby Petito and Brian Laundrie Traffic Stop is Fucking Me Up I know there are specific subreddits about this case and lots of true crime fans who are very fascinated by this, but I wanted to bring it up somewhere specifically with women. I just watched the Moab traffic stop and I just feel triggered and disturbed by the micro aggressions and coded/veiled misogyny. Has anyone seen it?\n\nOne thing I noticed so obviously is the amount of projection the lead officer is doing, where he is constantly relating himself to Brian, and his anxious wife to Gabby. Many people in the comments on the YouTube video are people saying how nice the officers were. And there’s no doubt that they were “nice”. But the way they speak to and about Gabby has very 1960s-hysterical-woman vibes to it.\n\nThe cop throughout the video refers to her as hyperventilating when she’s crying, and later when he’s telling her she’s not going to be charged, she starts crying again and he says “there’s no reason to be crying right now,” and later when he’s driving Brian in the cruiser he’s basically encouraging him to get Gabby on antidepressants even though he knows VERY LITTLE about their relationship. He’s projecting his own relationship on to this couple, and now that child (22 years old!) is very likely dead.\n\nI dated a man when I was 22 who I thought was a “nice guy” who was actually incredibly emotionally manipulative, and toxic, and he turned out to be a con artist who was stealing money from all of my friends. I was so anxious and neurotic the entire time we dated, because he was constantly picking fights that made no sense, and looking back, it’s just so obvious that our society creates these chasms in the ways we treat men and women. And so we behave differently, to varying degrees. But I feel that since there is no emphasis on mental wellness or psychology or defining healthy relationships, we leave young women extremely vulnerable. And then you see situations like this, where laws were designed to help women in domestic violence situations are twisted and blown out of proportion, and made huge and scary with real world consequences. And when we (women), show any emotion, the cops assume we are insane, because they also have not been trained in psychological welfare and de-escalation. \n\nThat cop sounds like a total noob. I really hope he learns from this terrible situation.\n\n[Traffic Stop Full Video](https://youtu.be/fCGsW41aQEw)",
    "title": "The Gabby Petito and Brian Laundrie Traffic Stop is Fucking Me Up",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1631991328,
    "score": 150,
    "keyword": "man artist"
  },
  {
    "text": "Posing with artwork I'm sure most of you have witnessed this phenomenon. A woman will post a piece of artwork to reddit, with her face or body in the picture, and without fail dozens of people will voice their displeasure. I don't think I've seen a single post of a woman with her artwork that didn't have several negative or boderline abusive comments of that nature.\n\nWhenever people call out these commenters on their misogyny, their defence is usually something like: \"It's not because she's a woman! I'd say the same if a man did it, but men never get upvoted.\"\n\nNow today, I see a picture just like that, but with a male artist posing in it. The post has tens of thousands of upvotes and over a thousand comments. As I scrolled through them, I couldn't help but notice the distinct lack of any of those complaints. Nobody accusing him of using his attractiveness for clout, nobody annoyed at having to zoom in to see the painting, nobody preaching about how the art should speak for itself. Any criticisms were purely about the art itself. There were even several comments praising the artist's good looks, and they weren't downvoted or called simps.\n\nSo, it really isn't about the \"integrity of the art\" is it? They don't say the same thing when it's a man showing off his work and being proud of his talents. It's pure sexism.\n\nNothing against the artist in question, of course, but he happened to perfectly showcase the double standard. Maybe now people can just admit they hate to see women publicly promoting themselves and not being ashamed of existing and.. I don't know, having a physical form? Since apparently that's an issue for these guys.",
    "title": "Posing with artwork",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616648667,
    "score": 101,
    "keyword": "man artist"
  },
  {
    "text": "Corporate picture: naked woman on conference room desk Hey guys, I could do with some advice as I'm an anxious person who tends to over think things after the fact. \n\nMy office building has recently been refurbished. A few months ago I was walking through a hot desk area, and noticed some new 'artwork' had gone up on one of the walls. \n\nThis consisted of three photographs.  One of a naked woman, facing away from camera, sat on a conference room desk. One of a woman kneeling on a kitchen work surface with her head in a sink, and one of a woman sat on the floor between two isles of seating. \n\nI mentioned to my male line manager at the time, that I wasn't sure if the pictures (especially the nude) gave off the impression of the business we would want them to. He said he'd raise it with HR and come back to me. \n\nLast month, I was walking through the area again and noticed they were still up, and asked him if anything had ever come of it. He said that in all honesty he had completely forgotten as we've been going through some big organisational changes which had taken up most of his time. Fair enough. He suggested I might consider mentioning it to hr myself as it might be taken more seriously coming from a woman. \n\nFine whatever, I did so. I messaged my HR rep over an instant chat application, asking for her to take a look at them and let me know what she thought. \n\nShe confirmed she would, but never came back to me. A couple of days later I asked again over instant chat, no response. \n\nA week or so after that I saw her in person in passing and she said she 'thought she would probably ask for them to be taken down'. \n\nCut to this week, which is two weeks after that, and I'm walking through the area again and they are still up. Impulsively, I take them down - no damage to the wall as they are just hanging - and stack them next to the desk, facing the wall. The wall is now bare with three studs hanging on it. For context it's a high use area that several directors walk through so the lack of 'art' is probably noticeable. \n\nMost stupidly, I also took down the small artist info card and threw it away. I don't know why I did that, it was an impulse decision id take back if I could. \n\nExcept now I'm obsessing over it. I want to be a person who stands up for what is right but I'm worried I'll get into trouble at work. A friend suggested telling my line manager what I did but I'm worried that I have my annual review coming up and it would affect my pay increase for the year. Someone else suggested putting the frames back up with different art, or editing the pics, but I don't want to do further damage. \n\nThey can easily know it was me through swipe card access records, CCTV, and the fact I'm the person who has complained about them. \n\nHonestly I'm a little stuck as to what to do and could really use some advice. I'm just so frustrated because I feel if a man had complained, or if I had gotten emotional about it, it could have been taken more seriously. But that shouldn't have to be the case! \n\nThanks in advance!\n\nEdited to add:\nHow I think I'm going to handle it: \n\nDo nothing. \nIf asked if I took them down, say: \n\nOh yeah, sure did! I had a chat with (hr lady) who agreed they would be taken down. \nA few weeks later I noticed it hadn't been done and I just figured everyone is so busy, so I just took them off their hooks and put them to one side, ready for them to be replaced :)",
    "title": "Corporate picture: naked woman on conference room desk",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1633857808,
    "score": 94,
    "keyword": "man artist"
  },
  {
    "text": "Why do men assume we don't know anything about video games I know this isn't as serious of a problem as many of you have, but it's a new experience to me and I find it frustrating and wanted to vent for a minute.\n\nSo, I like video games, a lot. I've been playing them since I was a toddler and at this point have probably played thousands of games. It's a silly flex, but I do know a LOT about gaming, moreso than most. I'm working towards a degree in computer science and in my spare time teaching myself Unity and Blender so that I can make VR games, which to me is the next big leap in game design. Long story short, I know a lot about video games.\n\nI'm also a transgender woman. I've been working very hard on my transition for years now and, at this point, I think that I look pretty good. I'm fashionable and stylish in ways I never could be before and I like how I look. I have also always liked striking up conversations about video games with people. Talking about all sorts of obscure or lesser known titles, hearing about their experiences, discussing good and bad design practices, it's an artistic medium that has a lot to talk about and I'm passionate about it. \n\nIt's something that I like talking about, but I've noticed the conversations going differently since I transitioned, and especially since I started looking good. Now that people no longer read me as male it seems like their knee-jerk response to me talking about video games is to quiz me. Like I get a lot more questions from people, as if they're trying to test my knowledge. Or they're a lot more likely to assume I don't know about something really obvious and talk down to me about it. These people almost never know a fraction of what I do on the topic, and I never had to prove myself before. Now when I mention really liking a game that they consider \"hardcore\" (it's usually not that hardcore but they think it is) I'll either get eye rolls or incredulity, like how could a girl POSSIBLY have played all the Devil May Cry games or how does a girl know about Deus Ex. Usually guys will assume I don't know really obvious stuff and go into an explanation on it without seeing if I've played some super mainstream game.\n\nThis never happened when I was acting as a man. When I talked about games there was no testing phase where I had to prove I was worthy of the conversation. I just talked about stuff and there was a mutual feeling of equal footing.\n\nI've always heard about gendered gatekeeping in geeky hobbies, and had a sort of vague idea that it was real but I didn't experience it so it wasn't a huge problem to me. But FUCK it's annoying.",
    "title": "Why do men assume we don't know anything about video games",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1616849281,
    "score": 63,
    "keyword": "man artist"
  },
  {
    "text": "Women in music I need to rant. I had a 'discussion' with a colleague today about music and our favourite artists. I should add this colleague is a mid 30s male. All was going well with the conversation when he suddenly came out with \"The greatest musicians of all time are men, women just can't compete with men in that field\". Naturally this earned a very puzzled look from me, and I was taken aback by his words. \n\n\"What do you mean?\" I asked him. My tactic now when a man says something so stupidly misogynist is to ask them to explain so I can weed out if they are really an arse hole or just a bit ignorant. His response made me so angry. He told me that all of the successful song writers and 'real' musicians like guatarists and drummers are men. He truly believes that there are no women in the music industry apart from 'vocalists' that sing songs mostly written by men. He couldn't understand why I disagreed with him, and told me that the \"facts talk for themselves\". He added that men are just better at music like Rock and Indie and women are better at singing and need men to be truly successful. \n\nAt the time I was so taken aback that I struggled to find the words to disagree with him and prove him wrong. And unfortunately the discussion ended before I could. \n\nSo I need to write this here to get it out. \n\nTo you, Mr misogynist music snob: \n\nSome kickass women in music. \n\nChristine Mcvie and Stevie Nicks wrote loads of Fleetwood Mac songs. Some of their biggest hits like Rhiannon and Dreams etc. \n\nCarole King wrote a massive amount of songs in the 60s and 70s for men and women and had massive commercial success. \n\nWomen who played instruments, wrote music, worked crowds and have gone down in music history: Janis Joplin, Debbie Harry, Heart, Joni Mitchell, the Pretenders, the Cranberries. \n\nSo many different genres involve female musicians.  Evenesence. Kate Bush. Modern bands and musicians like Haim and Alabama shakes, heartless bastards. \n\nAll the wonderful rap and RnB songs from the 90s and 00s:\nFoxy brown. Lauryn Hill, lil Kim, Missy Elliott.. \n\nFemale composers: Rachel Portman Oscar winner, composed for films like Chocolat and Emma \n\nI could go on and on....Every single genre if you open your eyes and ears and actually pay attention. \n\nSo the reality of the situation isn't that there aren't talented and successful women in music. It's that you are a misogynist piece of garbage that doesn't want to see them. \n\nRant over. \n\nHas anyone else ever heard this opinion from men before?",
    "title": "Women in music",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1622827646,
    "score": 49,
    "keyword": "man artist"
  },
  {
    "text": "My (23f) manager (55?m) is a creep. I filed a complaint and my boss supports me, but I'm not sure how to proceed Hi guys. I'm in a strange situation I've never been in before, so forgive me if this is scattered, but I'd love any insight or advice anyone wants to share. \n\nBasically, I work at a retail store and my manager is a creep. I'm going to change all names etc, let's call this guy Darren. Darren is a single, divorced man of about 55 who's extremely overweight, misogynistic, bitter, and dirty minded. Think boomer making jokes about hating his ex wife and nonstop making sexual jokes. \n\nI was warned about him when I first started working there, because I'm a young woman and the only woman in my male dominated workplace. it's a very old school  work place with an old school mentality (read: low-key sexist and racist remarks common) so his behaviour isn't hugely unusual, although he's definitely the worst offender. \n\nWhen I first started, he was the worst, and has since mellowed out a bit, and would routinely try to push my boundaries to see what he could get away with. I'm gonna list what he's done below:\n\n-i broke my pinkie toe and he's the only one first aid certified so he splinted and wrapped my toe, said \"I'd so have those toes in my mouth if I could, I have such a foot fetish\" WHILE TOUCHING MY FEET AND BROKEN TOE\n\n-stared at me for 30 sec then when I noticed and said what, he said \"you would be so hot if you got all muscly, you'd carry it really well\"\n\n-i had a red mark on my chest from itching, I'm really pale so I go red any time my skin is touched, he said \"I'd love to 'play' and see how much I could mark you up\" (play meaning bdsm or sex)\n\n-without my knowledge, looked into my BF's car when he picked me up after work and watched us make out for several minutes, then accidentally let it slip later that he'd done that \n\n-stares at me whenever he thinks I don't notice..... I mean constantly. no matter what I look like that day or what I'm doing. \n\n-stares at me to assess my outfit and comment on it almost every single day\n\n-constantly talks about sex, bdsm, his kinks\n\n-objectifies women, especially Asian women, and if one comes into the store, acts nice to their face but makes disgusting comments about them when they're gone\n\n-has repeatedly commented on my butt, calling me \"callapigian\" meaning \"has a big butt\"\n\n-has repeatedly shown me photos of women in bondage and ropes, talking about how he thinks it's so beautiful and artistic and how he would love to run a workshop about bondage etc\n\n-constantly, and I mean CONSTANTLY, makes sex jokes\n\nAny time he crosses a boundary or does something I don't like, I either make a face, roll my eyes, walk away, say \"that's not funny/appropriate\", tell him he's crossed a boundary and that's not ok, etc. You get the idea. Basically I've been vocal that I'm not into him, I don't like talking about sex especially not BDSM related things. I don't actually think he'd do anything to me, like he isn't a danger, but he does make me feel so insanely uncomfortable that I don't want to go to work. \n\nI've spoken to multiple coworkers about this, those who are reasonable and progressive and cool, not the boomer dudes. They've all told me he makes creepy remarks about me and other women when I'm not there, and that they notice his behaviour toward me and it makes them uncomfortable just watching it. \n\nI went to the boss, Darren's boss, Andrew, about this. I basically told him, look, I'm used to working in male dominated environments (sports and the music industry jobs in the past) and I'm difficult to freak out or offend. But with Darren it's getting to the point where I am so uncomfortable I don't want to come into work anymore, and my history of missing work especially lately corroborates that. Andrew heard me out, said this isn't surprising nor the first time he's been written up for being inappropriate (he didn't specify with staff or customers). He said he believed me fully, and he would support me with whatever I want to do. That said, what do I want to do? I believe Andrew would escalate this to head office or even my provinces human rights commission if that's what I wanted. My plan as of right now is to write Darren a letter outlining what he's done, why it makes me uncomfortable, how it needs to stop, and what my expectations are going forward, and that it it doesn't stop, there will be real consequences. \n\nThe ONLY things I'm worried about are:\n\n1) Darren and I have a tentative friendship. We buy each other coffee sometimes in the morning, well bring each other lunch if we made extra, we talk about music and our lives and he has been very understanding of me missing work for family and medical reasons. I do like the guy even if he's a creep, and I know he's so lonely and everyone hates him for being a creep, that I would feel bad going forward with this complaint because I genuinely think I'm the closest thing he has to a friend \n\n2) we have a VERY small staff and he's my direct manager. it's a small family business and since COVID we only have about 5 staff, including me and Darren. I don't know how to word this letter to him without making things weird or him retaliating against me.\n\nSorry for the long post guys. This isn't everything but I'm honestly kind of rattled and not thinking super clearly, so I'd love any advice. Thank you for reading. \n\nTL;DR: my manager is a creep, I filed a complaint and my boss supports me, but I'm not sure how to proceed.",
    "title": "My (23f) manager (55?m) is a creep. I filed a complaint and my boss supports me, but I'm not sure how to proceed",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1614293482,
    "score": 14,
    "keyword": "man artist"
  },
  {
    "text": "What should I do about this, how would you feel in this situation ? I started taking photos of my body in lockdown, and I was into weight training and fitness for YEARS , plus I loved nude photography for years, I loved art history, seriously  immersed myself in it. I worked and had many friends that had artistic careers.  I got good money from it. Many friends of mine at the time told it’d be a great idea for me, even family members.   \nI had also just come out of an abusive relationship, with someone who threatened to throw acid in my face before, threatened to hurt my family, emotionally abused me, he got back with me after a break to shame me for being such a WHORE for what I was doing, and he tried to get money from me that i had earned to pay his rent, and he wanted to have a relationship with me again to control the content I was creating, he said he wanted a percentage of my earnings ?!?!?!?!  \nI was getting a lot of comments like “you got fat”, “you look like a man” etc. ”I’m glad you got raped.”   \n\n\nANYWAY. moving on, that’s a little bit of what was happening at the time for me, I was walking down the street in my neighbourhood for a walk, and a couple of  men were standing waiting for something, staring at me as I approached them, I saw one of them use to teach me in school and I knew him, and he also taught my older siblings before. His friend said to me “nice legs, nice arse, but you have no hips though...” as I was walking away from them and had walked so far up the street...   \nseriously... What? I felt like they were trying to tell me that my body was wrong in some way, that i should be ashamed,  that all they were doing was piecing apart my body parts as if they somehow had some authority in how my flesh and skin should exist ??? I was also concerned about what they were waiting for, they had obviously seen my content to have paid so much attention to my body, and this was a regular route that I had walked, so I felt a bit unsafe and like they knew too much about me ?.. or tried to find out about me an unhealthy amount ?",
    "title": "What should I do about this, how would you feel in this situation ?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1634820036,
    "score": 11,
    "keyword": "man artist"
  },
  {
    "text": "Getting tattoos from women tattoo artists? Hi all, I’ve been a lurker here for a little while and I recently had a conversation/debate with friend of mine that has been playing around in my head and I just wanted to gather some other perspectives from this wonderful community! \n\nEssentially, I (21F) have quite a few tattoos, they help me feel more confident in my body, a lot of them are dedicated to self love and acceptance...my best friend also has a lot of tattoos and yesterday we were talking about them; the artists who had done them etc. \n\nMy tattoos have all been done by female artists and my friend has had all but one of hers done by women although that was just by coincidence. \n\nAnd I honestly had the thought of...\n“I would not feel comfortable having a man tattoo me” \n\nMy friend on the other hand has no problem with a male artist, her view was that the best artist for the design is the one she wants to tattoo her. I have no real reason to distrust male tattoo artists, I know the 99.9% of them are professional, clean and safe...but I would just feel uneasy. \n\nMy friend then raised the point that my view might be a little sexist. I feel uneasy based on my preconceived notions and I don’t really want to change them...ya know, I just don’t want to go to male artist and have them put something so intimate on my body! \n\nI just want to know everyone else’s thoughts on this...like, is anyone a tattoo artist themselves or has tattoos from any type of artist...I’m just genuinely really curious! \n\nThanks💜",
    "title": "Getting tattoos from women tattoo artists?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1620653424,
    "score": 9,
    "keyword": "man artist"
  },
  {
    "text": "Do I drop out of school once again? I'm a French male 19.\n\n Back in high school, at 16, i quit out of shame and of feeling despised (this \"oh my god girls are looking down on me, all popular guys are douchbags and I am stucked with creeps like me I don't really wanna hang up with\" very classic kind of profile)...\n\n6 months stuck at home thinking I could finally write my book, muster up the courage and time to build my artistic skills with all that free time. \n\nIn the meantime, my creeps friends whom I had abandonned in a blink of an eye had begun flourishing. One became this psychedelics user and painter hosting parties in his coutryside home, the other got kicked out of his mom's house and by being homeless became a sort of charismatic adventurous black metal artist, a Valfar or Per Ohlin copypasta, and him and other of these \"creeps\" created a metal band as a pretext to hang out.\n\nI had not seen the potential of these people by being a piece of sht unable to see people as they really are, and at how high in charisma and social success could be at their best. I quit just the moment it became to be wild back there. Too bad. I didnt write, just watched youtube, didnt even play games which could at least have uppered my cultural and social credits.\n\nThen I got in a wood carving schools, running away. I still connected hardly to people, didnt write, demons kept following me.\n\n Then at the end of these two years I was 18 and could have chosen to leave once again, not seeing the potential of good life my commitment to my friends in this carving school could bring me, if regardless of all my shitty context i wanted to run away, numerous relational problems with all of this friends, and creativity still not flowing on the keyboard, i'd still stick to it.\n\nSo i followed these not that much friends in upholstery 2 years course in the same high school. And fucking regret it\n\n I hate upholstery, still cant manage to be creative, dislike a lot of the people here, and want to run away from them to become a better me and present this one to a new social group of unknown people, but in the meantime i genuinely love AWESOME people here ,  some are friends, some a bit less. \n\nI didnt wanna quit after carving because the learn-from-your-mistakes wiseness told me not to repeat my catastrophic 16yo year that made me miss a wonderful history of friendship with awesome people. But either by being stuck in the failed social context because fearing to losing the pearls in the garbage that are in it and that would lose contact with me and that I would have to start over in a new context OR when running away from this context by sacrificing the pearls, I still cant begin to be creative. \n\nYet I have all the ideas in my head but €procrastination€.\n\n Oh and if I leave I will be at my parents and its very humiliating because i cannot fully live and work on my projects by being into the fking nest of mommy, having my room asked getting cleaned and all the stuff, not being able to invite whoever i want or order the food or -healthy unaddictive-psychedelics I want, not having my private world. I'm stuck.\n\n Do I risk remaking the same mistake as in my 16nth year? \n\nDo I try getting an apartment and a shitjob to struggle away from the nest as a free grown man, to carve wood and write things and all?\n\n Or do I stay in this humiliating context to not lose all the social interactions I have with the awesome friends I have in this upholstery course?\n\n Or do I wait till covid ends to do this?\n\n Some friends in this highschool are metalheads and i love metal and would love to play the guitar with them but i cant play the guitar even though i personally own one, and leaving rn would repeat the pattern of when i quit my first school and see my friends forget me to work on music projects.\n\n Do I stay till the end of the course the time to learn some guitar, some chords, and integrate better with them and be later on in my life more easily in touch with the metal world? I don't have a fucking clue.\n I feel like an artist, always felt, and i dont wanna stagnate in this hole but not lose friends either. \n\nAm I fucked?\n\n I'm stuck with procrastination and asociality since middle school.\n\nP.S i'm diagnosed with aspergers\nP.P.S i decided to go in Berlin for my upholstery stage out of craving for travel but everything is closed, all my teachers think im a very very important student and the expect me to be as passionnate in this course as it takes to want to be the first to make this stage up there in our deutsche neighbourss home. So i can't drop out that easily and discretly. And yes i fell like this kind of idiot not wanting to get face masks in public, wtf am i doing in this DEAD lockdowned foreign city in a full pandemic....",
    "title": "Do I drop out of school once again?",
    "subreddit": "careerguidance",
    "timestamp": 1611186024,
    "score": 1,
    "keyword": "man artist"
  },
  {
    "text": "Someone messaged all my coworkers through my public Instagram that I'm a con artist, need help I did a CS homework to a guy that I never met, he didn't get an A on the assignment, asked for a refund, I refused, and now he messaged all my coworkers at work that I'm a con artist that takes people's money and disappear. I should have put my Instagram profile on private. He got to all my coworkers through my follow list. Have no idea what to do about it. One of them already told me that some guy wrote to him and I had to explain it all. I feel like I'm always going to be a con man in their eyes. Idk what to do.",
    "title": "Someone messaged all my coworkers through my public Instagram that I'm a con artist, need help",
    "subreddit": "cscareerquestions",
    "timestamp": 1619686499,
    "score": 3,
    "keyword": "man artist"
  },
  {
    "text": "Being “unapologetically black” in the face of white family and white peers. (An essay… sorta?) So I’m not really sure what I’m trying to write or why I’m writing it but I figured I’d post it here. This is sorta like an essay so guess and it’s mostly about my one brother who really is the only other black person I know and what it was like growing up with him in an all white family.\n\nSo him and I (as well as two of my other brothers, one of who is biologically related to me), were adopted into a conservative white family in a rural mostly white town in New Jersey. \n\nThree of us are black (my bio brother and I being half black, while the brother I will be talking about is fully black, I’ll call him B to make things simpler). \n\nI’ve posted on here a few times and if any of you have seen my posts I’ve mentioned that growing up my mother told us that we were Puerto Rican. January I took a DNA test and found out that’s not true, it’s not that she lied it’s just that she didn’t know we were half black and she was not educated enough to realize that afro Latino people exist. (Ironically B is actually afro Latino as my mom has met his mom and she only spoke Spanish).\n\nBut anyways growing up believing I was Puerto Rican and not black, every time I was hit with the “are you black?” I’d get defensive and go “no!” And people would go “are you sure? I think you are.” And I’d be like “are you my mom? Shut the fuck up.” \n\nNow I did this because as the youngest in the family I was closest to my mom and I unfortunately inherited all of her ideals. She would get defensive and angry when I told her people ask me if I’m black so when I was faced with that question I’d get defensive. B on the other hand was always automatically perceived as black (go figure). No one asked him if he was black though. So he readily settled into his black identity. And he brought that identity home with him. He would say the n word much to my mother’s disapproval. On top of that he naturally was loud and obnoxious. \n\nThey’d argue all the time. And in those arguments he’d say “you just don’t want to have a black son.” And she’d shoot back that he’s not black and that even if he was she doesn’t care that he’s black he’s just disrespectful. And while I think he is disrespectful to an extent I believe his anger with her comes from someplace else. And that it’s valid. Because I myself share that same anger but as the meek younger one I don’t express it, I don’t like the backlash that I get when I do express it.\n\nAs I mentioned before my family is conservative. And as someone who is mixed and also has 0 black influences in my life it is hard for me to be comfortable within my black identity, especially after hearing the comments my family makes at holiday dinners. I frequently hear my step dad complain about BLM and my older white siblings will chime in or nod along. I’m closest with my mother but she makes those comments too. It is hard to be black and proud when I get berated for making a joke about white people and the tables get turned on me. It’s hard when for my entire life I’ve had my hair straightened and processed because my mother didn’t know how to take care of it and didn’t bother learning. And when my mother remarks about how my skin is perfect and tells me how if I marry a blue eyed man maybe our children will have my skin and his eyes and making me uncomfortable with those remarks. When she constantly tells me I don’t look black because I do not have the “features.” \n\nAnd finally it is especially hard when showing anger for police brutality is met with “they should’ve complied.” And making a remark like saying the phrase white trash is met with “that’s offensive to white people.”\n\nB however is not meek. His relationship with my parents is already strained so he does not care what they think of his beliefs. I did not know what it meant to be unapologetically black until yesterday when I thought about it and I thought of my brother. \n\nHe proclaims his blackness openly, he knows my mother hates it when he says the n word but he says it to me right in front of her and he does not care, he is not afraid to speak out when my family says something racist, he isn’t afraid to argue with them about it. You could see he is proud to be black when he stood up to my step dad when he called him then n word. It radiates from him, you can feel it in every step he takes. Sometimes he talks back to cops when they pull him over because he does not want to be pushed around by them.\n\nI think that last part is stupid of him though. It’s dangerous. Yet I still admire him for him being the way he is. \n\nHe’s no Huey though. And certainly no Malcolm. While he does have a Malcolm X poster he doesn’t really seem interested in the black power movement. He’s brushed me off when I’ve mentioned “the liberation of our people.” Which it me is unfortunate. He is the type of person who would be good for something like that, he’s a natural leader. While I admire people like Malcolm and Huey I’m too afraid to actually be like my brother.\n\nI’ve spent a lot of my life internalizing the things my parents say and running from my black identity whereas B has embraced it. And I admire him for that so much. Even if he is an absolute pain in the ass.\n\nHe’s 24 right now and I’m 19. We’ve never been close. Actually I used to say he was my least favorite brother. But we have this thing we do now, we call each other “bitch ass n*ggas.” Or say “the fuck you lookin at?” And pretend we’re thugged out and hard and ready to fight. We do this every time we walk past each other. Sometimes if our mom is around we just glare at each other and say it quietly (she doesn’t know I use that word, I don’t want her to yell at me for it). \n\nBut we have this solidarity now, especially as I’ve gotten more and more into hip hop and rap music. I’ll always go up to him and be like “yeah I’m listening to (insert artist here)” and he’ll go “the fuck you know about them? You don’t know nothing about that.” He pulls up blasting rap and if he sees me in the driveway he starts dancing in his car like a damn fool and yelling the lyrics. He laughs at me when he sees me picking my afro and he complains about my hair taking too long but I know he understands because he used to have an afro when he was in middle school. So while I will never go to him for emotional advice I know we have a quiet, unspoken bond and I know he cares (most likely because I take care of his dog).\n\nAs I slowly learn more about our culture I feel more connected to the community and as I watch my brother be who is I learn what it means to be unapologetically black. It is to be yourself, to stand up in the face of oppression in any way you can whether that be silently rebelling (growing out your natural hair in an afro to spite your mom and pay homage to the panthers) or to loudly revolt and proclaim your blackness (yelling at your step father for calling you a slur). And even though this man used to torment me as a kid I admire him and I hope one day I can be more like him (minus the obnoxious, loud phone conversations I hear him having when he comes home at 12am).\n\nThank you for listening. I’d also like to add that I actually wrote an essay similar to this one in one of my classes my senior year of high school and it was on my relationship with race and how I felt disconnected from my Latino heritage (this was before I found out I was not Latino) and so I think of this as the new and improved part 2 of that essay.\n\nAlso I’m so sorry this is so long.",
    "title": "Being “unapologetically black” in the face of white family and white peers. (An essay… sorta?)",
    "subreddit": "blackladies",
    "timestamp": 1634262574,
    "score": 13,
    "keyword": "man artist"
  },
  {
    "text": "Tattoos Hey everyone I hope you are all well . I've been dreaming of getting tattoos for ever now and it's gotten to a point where I'm getting older and I just want to jump in and do it . Do any of you know any black tattoo artists ( man or woman) in London ? Possibly affordable.  If not do you know where I can get more information about this please , it would be much appreciated ( google found nothing for me ) .",
    "title": "Tattoos",
    "subreddit": "blackladies",
    "timestamp": 1633283029,
    "score": 8,
    "keyword": "man artist"
  },
  {
    "text": "I ruined her week Doing so was very simple. I took my hidden 2nd key and went driving while she was at work. When she came home, she saw the lettering on my tires wasn't in exactly the same position as they were this morning. She memorizes this every morning when she leaves. She lost her mind.\n\n\nYou see, I'm not allowed to drive, or have my debit or credit cards, lest I drive off to meet \"some whore\" or buy some alcohol.\n\n\nI'm not a pussy. My first marriage ended in divorce and I was in a bad way. I met her when she used to attend my band's concerts. She loved my whisky-drinking blues guitarist persona (it was exaggerated). She took videos and photos of us. This is how she worked her way into my life. \n\n\nShe claimed we had sooo much in common. She sent me videos of artists I loved until late hours of the night. She brought me food at work. She bought me prime-quality booze and vintage guitar amps. She was a sweet, kind woman who was abused by her evil, right-wing ex-husband who was a traditionalist Catholic who only accepted Latin Mass. She came from money.\n\n\nI fell for it. I was her big 6'4\" he-man savior. She played that up. I married her. But right after the wedding she began tearing into me. All those things which attracted her to me were now \"problems.\" No more music. No more guitar (\"you love that guitar more than me\"), no more playing live gigs (\"you just love the attention of all those sluts\"). She now says she hates the music I love.\n\n\nShe went through my phone and now makes things that happened years before I married her into a huge issue to bitch about. She talked to old girlfriends. She projected the worst of her ex-husband onto me and seemed disappointed and bored when I wasn't similarly cruel and held me in contempt. Anything I do, say, or watch that doesn't meet her pre-approved standards sends her into an existential crisis that never seems to end. Thank God I resisted her pressure to have a kid. \n\n\nSo here I am. Walking on eggshells again. This is representative of the texts I get almost daily. btw, I've never cheated on her: \n\n\n\"Justify yourself as you see fit. I dont have to look for reasons to be angry or upset. As I said, you have lied for 9 years, cheated, and been abusive in other ways.  I have tried to maintain a relationship as best I could. It is unfortunate that it is not the googly-eyed teenager style relationship you want.\"\n\n\nWhen I was dating her she used to say: \"oh, you're the man I've always wanted!\" She was googly-eyed over me and chased me from gig to gig. As soon as I married her, I became the useless fool who can't do anything right. She leaves the house in the morning bitching and complaining, texts me during the day complaining, and comes through the door in the afternoon bitching and complaining. The best I can get is silence, but I know that just means she's thinking of things to bitch about later. \n\nAnd she wonders why I might want to drink!\n\nBut I've learned my lesson. I'll never get married again. No way. I'd rather live in a cave with my dog than live like this. Never again.",
    "title": "I ruined her week",
    "subreddit": "MensRights",
    "timestamp": 1635383109,
    "score": 269,
    "keyword": "man artist"
  },
  {
    "text": "Single Mothers: Men Don’t Owe You Anything NOTE: This post was deleted right away in the following subreddits - r/unpopularopinion, r/offmychest, r/rant. I really don't know where else to go to interact with people who have differing opinions, so if you know of another place let me know. I'd love to have a debate with people about this issue. Reddit is full of censorship and uncivilized moderators. Anyway, here is the actual text of my post:\n\n&#x200B;\n\nI hear it quite often from single mothers that they are “worth it”, as   they try to convince men to date them. I get it: single mothers have it   tough in the sexual and dating marketplace. It’s like being a divorced   man, in your 30s, and trying to start a new relationship and rebuild   your life -- except HARDER because you got children on you too. Immense   sympathy ought to be afforded to single mothers who are genuinely  trying  to raise their children right and exude the feminine qualities  that men  desire. HOWEVER, sympathy is NOT the reason why men should be  with  single mothers. I get it that something probably went terribly  wrong in  these women’s past that had resulted in their single  motherhood; I’m  sure most of them did not intend it. But the suffering  resulting from  those tragedies/unforeseen events/mistakes/etc cannot be  a cause of  entitlement. Victimhood is not automatically a cause for  entitlement.\n\nWomen  in their 30s,  especially single mothers in their 30s, need to realize  and accept the  laws of physics in the sexual marketplace. A woman’s  allure as a  serious partner (e.g. for marriage or its secular  equivalent) stems  from the perception of purity. Put aside the idea of  “Purity” in the  Ahrahamic religions. The “Purity” that I have in mind is  more objective  than anything. Mainly, it’s less baggage: less years,  less sexual  partners, no previous children, less psychological trauma  and/or  complexes, less financial issues, etc. I know how terrible this  sounds,  because it seems to diminish one’s worth as an individual. But  this is  very much the reality. The feeling of diminishment is merely a   subjective reaction to the reality. To tell a man that a single mother   with 2 children from another man -- or hell, 3 children from two other   men -- “should have” equal worth in his mind as a single, childless, never-married woman in her mid-20s is the same as telling someone that a 10 year old car with 200,000km on it “should be” considered the same as a 3 year old car with 30,000km. “Should” is the feeble attempt to erase unfair laws of nature. Good luck with that because it never works.\n\nNow, I realize that people can fall in love. People of different creeds,   circumstances, etc. I personally believe in Romeo & Juliet; I think   people can fall in love like that. Can a man fall so passionately in   love with a single mother? I think so, it’s possible. The question is,   although it’s possible, how PROBABLE is that? Think about what I said in   the above paragraph: why would a man elect to be with a woman in such a   difficult situation when there are other women out there whose   lifestyles would present far less difficulties to him? Look at it from   the man’s perspective for a second, and remember that he is a free human   being. Entering into the life of a single mother would more likely  mean  that his agency in his own life would be far diminished because he would be funneled into the inertia of HER life. And what inertia drives her! He will have very   little control of the direction of where he is headed, since the   practical status quo of the MOTHER that he married, weighed down by the   presence of the children and the ethical burden that they bring into  the  picture, would dictate the necessary steps to be taken in the   relationship. Also keep in mind that he would never be their father, and   thus would never have the right to hold the same authority over them  as  he would over his children. This affects a man probably much more  than  many women realise. A man has his own needs and desires too, and I  hope  you accept their validity. And would he really want to override  his  (reasonable and valid) needs/desires by bringing a woman into his  life  who now expects him to care for and maintain children who are not  his  own? Would he want to contend with such a situation over the   alternative, where he marries a woman without a bad history and baggage   and fathers children of his own with her, knowing full well that she is   the vessel of all his offsprings? Again, it’s possible that a man may   choose the former because of love and passion. But how probable is  this?\n\nAnd  what kind of man are we  talking about, even? A man younger than you? If  you are serious about  this, I’m sorry, but you’re living in a  wonderland. The chances of that  happening are so slim, not only because a  young man would likely be  terrified at the prospect of marrying a  mother but also because they  have plenty of women to choose from in  their (younger) age group. And  do you really want a young man who  doesn’t know how to be responsible  (and financially mature) enough to  handle your very difficult  situation? So that leaves men in your age  groups: 30s, 40s. First thing  to keep in mind about them is that many  are already married or taken  in some way, so they’re unavailable. Among  those who are left, many are  not “high quality” according to modern  women’s high standards (but I’m  gonna assume you are a reasonable person  with reasonable standards,  considering the experiences which led you to  single motherhood were  probably the phenomenon of reality hitting you  in the face like a ton  of bricks). And I’m going to assume that you  would prefer not to be  with a man who is desperately looking for a woman  to marry. Desperation  is usually not a good sign. This means your list  of choices has grown  rather thin. In this thin list of men in their 30s  and 40s, you’re  likely to encounter more pragmatism than idealism. They  may have been  through similar experiences as you. Perhaps they are  divorced, or even  parents themselves (key difference, though, is their  kids are and will  remain with the ex, not with them), or perhaps they  have been single  all this time (unsuccessful with women, or maybe too  successful with  women). These men have careers, and many may be making  quite the buck.  The thing about the successful among these men -- whom  I’m assuming you  are interested in -- is they DO NOT want to waste time.  And the  motherhood that you bring into their lives may likely be a  major  problem for them, obviously. They may not be looking for a fresh   undergrad in her 20s, but they still want a legacy in the form of   children. And as I said above, just like any other man they don’t want   baggage. Do these men fall in love? Of course! But probably not before   considering many practical aspects of the relationship they are   embarking on and the woman they are dedicating themselves to. They will   not fall in love with you, nor you with them, like a 20 year old or a   teen.\n\nThere is also another aspect   to consider, which is love and passion. This may be less an objective   topic but I truly believe it is significant. Let’s take an extreme   example. Look at Romeo and Juliet: they’re teenagers, not middle-aged.   And there is a reason for that. You know one major factor that separates   the the young and the old? Foolishness. You read classical Western   literature from the ancient Greeks to the 19th century and there is a   common theme to the way writers and artists diagnose the young and the   old. We can understand their diagnosis in the form of an inner conflict   in every human being: an epic battle between Passion and Reason. In   youth, Passion reigns supreme and Reason is an untrained master-to-be;   Passion runs wild, and in its chaos the human being succumbs to   temptation and cannot resist pleasures or powerful rushes of emotions.   In old age, Reason ultimately tames Passion, and the human being is   composed, contemplative, stoic -- thinking before acting. The story of   Romeo and Juliet was only possible because they were young, since very   few people in their 30s would consider the risks of such a relationship   as “worth it”! It’s not worth it, it’s dangerous, it’s foolish --   mindless! Tell me, single mothers, do you think a man can be mindless   like this with you as he looks upon another man’s child that you hold in   your arms before his very eyes? Indeed, can you yourself afford to be   mindless like this with a new man, with your child in your arms? Ask   yourself this question seriously and think about it for a bit. Now,   maybe I’m making things too extreme in my example. But my point is this:   in our more matured state of being, we are more likely to THINK and   CONSIDER and CONTEMPLATE. These behaviours are not going to help the man   who is supposed to fall in love with you. The more he thinks about it,   and he will, the more he will see problems. The same goes with you:  you  are not as foolish as you were 10-15 years ago; indeed you do not  want  to repeat mistakes of the past, you are more careful, all of which   requires more thinking and deliberation. Such mental processes by   definition cannot allow for passion and swift decisions. And this is   thereby more likely to take love out of the picture all the more.\n\nSo   here you are in your single motherhood, complaining about men not  being  interested enough in you, and telling them that they “should be”   because you think you are “worth it”. Please remember that the bulk of   your worth to another person is not defined by you, it’s defined by the   other person! And unfortunately, you will have a very hard time   convincing the other person of your worth because you are at a major   disadvantage in the sexual marketplace. Is this fair? Yes and no. You   may have made a terrible mistake in your past and you may be the direct   cause of it, for which you now are paying the price. In that case, fair   or unfair, it’s karma or whatever you want to call it; actions have   consequences and you are now suffering the consequences of your actions.   Or, perhaps you did not make a mistake and you were harmed. That’s   horrible, and I’m sorry that you are in such a predicament. However, how   can you bring “fairness” into the picture, unless you’re talking to   some supernatural deity dealing wirh ethics and morality? You cannot   tell men who had nothing to do with you that they are being unfair to   you for not dating you for being a single mother -- even if you were a   victim and not the cause of your single motherhood. All of this is no   different from an incel man talking about how unfair it is that women   are not dating him, and that they “should” date him because he perceives   himself to be worth it. I mean, what do you expect people to do?  Should  they be forced to date you? Shamed into dating you? You really  think  this is a solution? You cannot make this into an issue of social   injustice; discrimination in the sexual marketplace is the law of our   reproductive natures. Everyone discriminates (women more so than men   actually), everyone holds their place in a hierarchy, and all of this is   inescapable. No one owes you sex or marriage according to any sort of   law or regulation -- human, God, or nature-made -- and you have no such   rights to be owed it. All you can do is make the best of the situation   that you are in, just as anyone else does. Your situation may be more   difficult than those of others but that is the hand you were dealt.   Perhaps the best you can do is to understand what the men you are   chasing desire from women and then try to change yourself in any way you   can to attract them. There is no ideal way to get yourself out of your   troubles, but you certainly won’t get anywhere by talking about what  men  should be doing for you based on your perceived self-worth.",
    "title": "Single Mothers: Men Don’t Owe You Anything",
    "subreddit": "MensRights",
    "timestamp": 1627499668,
    "score": 126,
    "keyword": "man artist"
  },
  {
    "text": "Toward a new theory of gender II: on the harmful notion of 'toxic masculinity' This post is about the term \"toxic masculinity\" and why many people in the MRM consider it harmful. As I consider it a slur, the phrase will be abbreviated as 'TM'. Before I go into detail about why I think usage of the term TM is harmful, I want to elaborate on how traditional masculine gender roles have indeed harmed men in many ways. This perspective is important, but as I explain later, the problem is not with the individual man, but that society at large is still blind to the extent of male suffering, and forces often cruel standards on men that they cannot escape if they want to live a happy life.\n\nMen have always been shamed for not adhering to strict standards of masculinity, i.e. what was required of them by society at the time. There is an expectation that masculinity is something that has to be \"earned\". The transition from boy to man is often portrayed to be more of an ordeal based on hardships with the goal to achieve fame and social standing or to preserve some ideal for society's greater good. This can be observed in various cultures around the world, for example the [Filipino tradition called Tulì](https://en.wikipedia.org/wiki/Tuli_(rite)), which is \"regarded as a culturally sanctioned rite of passage from boyhood to manhood resulting in significant PTSD-like symptoms among much of the male population\" ([Post-traumatic stress disorder (PTSD) among Filipino boys subjected to non-therapeutic ritual or medical surgical procedures: A retrospective cohort study, Boyle & Ramos, 2019](https://www.sciencedirect.com/science/article/pii/S204908011930030)). According to the same paper:\n\n>Typically, an elderly man (manong) stretches the boy's foreskin over a wooden anvil (tree stump), places a “cut-throat” barber's razor (labaha) lengthwise on top of the foreskin and then with a few quick blows slices the foreskin wide open, thereby exposing the glans. The resultant traditional dorsal slit (superincision), while damaging in and of itself, at least spares thousands of erogenous nerve endings and highly specialized sensory receptors located within the inner foreskin. The newly-cut boys then bathe in the cool water of a nearby river or stream in order to lessen the pain, and they also apply chewed guava leaves to the genital wound in an attempt to control bleeding and promote more rapid healing.\n\nAnother example is the Sateré-Mawé tribe in Brazil, where they fill wicker gloves with bullet ants and put a sedative on them to make all of them fall asleep. Then they force a ten-year-old boy to put on these gloves, each of them filled with over 120 ants. The boy then has to keep his hands in them for ten minutes as he is being bitten by these ants. It's called a 'bullet shot' because getting a bite from a bullet ant is as painful as being shot. Men have reported wanting to cut off their own hands to escape it. People from the outside of the tribe who came to film a documentary about it were horrified because the boy in question was writhing on the floor in pain, screaming. It is so painful that the boy has to take up to a month to recover. Over the course of his life he has to repeat it 20 times to \"prove\" to the tribe that he is worthy of being a warrior, of being a \"true man\". [Click here for video footage.](https://www.youtube.com/watch?v=Cb5BK2NMAwU)\n\nMasculinity is often described as something that can be taken away at a moment's notice. A man can be \"emasculated\" while there is no similar word for women, and masculinity is frequently sought to be reinforced. Similarly, there is no shortage of terms to disparage feminine qualities in men, and more recently to shame men for not adhering to an adequate version of masculinity (TM). In the past, a husband's impotence or unwillingness to have sex was grounds for divorce. The inverse was also possible, but rare in practice. To determine the truthfulness of the wife's claim in front of the legal authorities, the husband had to prove his ability to perform for the court. This would often entail either actually having sex with his wife in front of the court or a physician, or having his genitals fondled (masturbation) by volunteer women to prove his potency. For example, [one case in 1441](https://historyofyesterday.com/putting-impotency-to-the-test-cb73bd8e92d0):\n\n>\\[The examining woman\\] exposed her naked breasts and with her hands warmed at the said fire, she held and rubbed the penis and testicles of the \\[husband\\]. And she embraced and frequently kissed the \\[husband\\], and stirred him up in so far as she could to show his virility and potency, admonishing him for shame that he should then and there prove and render himself a man. And she says, examined and diligently questioned, that the whole time aforesaid, the said penis was scarcely three inches long.\n\nMasculinity, or so I have seen it described, is very fragile. During WW1 and briefly during WW2 there was the White Feather Campaign where women shamed men as cowards and pacifists by handing out white feathers to men not in uniform. It has been noted that men subject to being \"white feathered\" have been scarred for life, demonstrating how uncomfortable men are at female disapproval, sometimes to the surprise of women. Another example is the sinking of the Titanic, after which surviving men were often shamed for not giving up their life boat seats for women and children.\n\nWomen determine and have always determined the current notions of masculinity and shape what is acceptable behavior for a man; manhod is contingent on the existence of womanhood and masculinity is traditionally defined by its differentiation from femininity. This can be described by [Briffault's law](https://www.psychologytoday.com/us/blog/machiavellians-gulling-the-rubes/201610/briffaults-law-women-rule), namely that \"the female, not the male, determines all the conditions of the animal family. Where the female can derive no benefit from association with the male, no such association takes place\". Women's role as child-bearers and child-raisers is the primary role, men's role only develops in a way to optimally support women in that role; one might say that female is the \"primary sex\". The patriarchy itself is a gynocentric arrangement. In the same vein, a man trying to adopt more feminine traits is seen as attempting to usurp privileges and get out of responsibilities he doesn't have the innate right to get, like a peasant trying to pass off as an aristrocrat. For example, male artists are not seen as 'lesser', they're seen as deserting their labor duties by doing something that might not earn money or will not get guaranteed results.\n\nAs phrases like 'male fragility', 'man up', 'male privilege', 'pussy', and 'grow some balls', TM uses shame and guilt as its vehicle to forcefully shape men's behavior and attitudes into something that the speaker deems more useful to their own goals. Functionally, TM is nothing more than a simplistic but effective marketing gimmick that allows the feminist idea of female oppression and male privilege to spread quickly and shame men to reshape masculinity into something that better serves the current needs of the ruling elite, and through their gynocentric orientation women. We used to need tough men ready to sacrifice themselves and take charge (that is what \"traditional male gender norms\" really are), now those same attitudes that made men sacrifice themselves for the 'greater good' do not rank high enough in a cost benefit analysis in terms of their use for our modern society, and we are shifting to a state of overt gynocentrism.\n\nAs Dr. Warren Farrell once said:\n\n>Regarding a boy as a hero is a social bribe that we created; a social bribe for that boy to be disposable. \\[…\\] Love is blind enough for him to never acknowledge that a woman who falls in love with the officer and a gentleman is attaching her love in part to his potential disposability. \\[…\\] For parents raising a daughter meant caring about her safety but raising a boy meant being caught between a parental rock and a hard place. We wanted our son to be safe, for sure, but we also wanted to feel proud that he served his country in time of war. So whether as a soldier, a firefighter or another first responder we give social bribes for young men to die; why? So that his potential for death might increase our potential for life.\n\nIt should be noted that guilt, shame and lack of self-worth are two of the most salient factors leading to depression in men. Thus, TM amounts to victim-blaming and is akin to telling men their place in society, shaming them for trying to fit into a narrow definition of what behavior is acceptable for their gender. TM is not a diagnosable disorder. It is often used to derail conversations about mental health and detract from the true reasons of men's suffering. On the contrary, it shifts the blame towards men, and ignores why men don't speak up about their problems. TM actually promotes what it pretends to fight because more often than not, it is used to assign blame (i.e. agency) to a man even if he was a helpless victim of his circumstances. When it comes to suicide for example, it has been found that men do open up about their problems, they are just not getting the help they need:\n\n* The paper titled [Masculinities and suicide: unsettling ‘talk’ as a response to suicide in men (Chandler, 2020)](https://www.tandfonline.com/doi/abs/10.1080/09581596.2021.1908959) argues that men do talk and seek help for their mental health problems. And that focusing on getting men to \"speak up\" is counterproductive and \"detracts attention from structural drivers of suicide\" in men.\n* The authors of [Suicide by middle-aged men (UK's National Confidential Inquiry into Suicide and Safety in Mental Health, 2021)](https://documents.manchester.ac.uk/display.aspx?DocID=55305) find that 91% of middle-aged men who committed suicide were seeking professional help for problems in their lives, including 50% who were seeing a mental health specialist.\n\nAs Elizabeth Hobson phrased it in [her 2019 speech \"The History of Feminism\" at Cambridge University](https://www.youtube.com/watch?v=3IFD4rQIX68) / [click here for a transcript](https://j4mb.org.uk/wp-content/uploads/2019/05/190524-transcript-of-Elizabeth-Hobsons-talk-at-Cambridge-Uni.pdf):\n\n>And the climate of everyday misandry pouring forth from feminists is relentless, Suzanna Danuta Walters asked “Why Can’t We Hate Men?… We have every right to hate you.”, a segment on ABC’S ‘Tonightly with Tom Ballard’ programme featured women sarcastically “thanking” men – in general – for drugging and raping women, Laurie Penny announced (in response to the Capital Gazette massacre) that “We must not allow our society to be held hostage to white male fragility any longer” and Barack Obama complained that “Men have been getting on my nerves lately… I just think brothers, what’s wrong with you guys? What’s wrong with us? I mean we’re violent, we’re bullying…”. Chidera Eggerue aka The Slumflower tweeted that “If men are committing suicide because they can’t cry, how’s it my concern?” Most fourth wave feminists though like to cover their misandry with platitudes about wanting to liberate men from the toxic expectations society places on them. They live in this alternate reality wherein uninhibited male aggression and violence are pardoned by the mantra “boys will be boys” and wherein “violence as a means of defending \\[pride\\] is glamorized.” Fourth wave feminists are unconcerned with truth however, their goal is power. The power to penalize the most successful men in order to privilege women (quotas and other forms of discrimination) and the power to demonize men collectively in order to defend and extend the ability of women to destroy men in general – along with the power to silence any men or women that dare to oppose their baseless narratives.  \n>  \n>Regardless of whether a behaviour is innocuous or women engage in equivalent behaviour, if a man does anything, feminists oppose it. In the last few years, snappy feminist portmanteaus such as manspreading, mansplaining and manteruppting have proliferated and become ubiquitous in their use. The aim is to shame, silence and bludgeon men into compliance.\n\nIn this sense, TM serves as a constant reminder of all the negative stereotypes associated with people of the male gender. TM is anti-male hate-speech, and there are many ways we can observe the cultural demonization of the male gender:\n\n* [Australian college principle Jane Boyle makes 7th-grader schoolboys collectively apologize to the girls for their gender](https://news.sky.com/story/schoolboys-made-to-apologise-for-stuff-we-didnt-do-during-assembly-about-sexual-assault-12260783)\n* [The pathologization of masculinity leads to teenage boy being chemically castrated for 'oppositional defiant disorder'](https://www.latimes.com/california/story/2020-07-15/teenage-boy-was-given-estrogen-developed-breast-tissue-while-in-l-a-county-juvenile-hall-lawsuit-alleges)\n\nAdditionally, the term reinforces rigid gender norms, and [according to labeling theory acts as a self-fulfilling prophecy](https://en.wikipedia.org/wiki/Labeling_theory). TM is a harmful term that makes it hard for boys and men to see themselves as victims, and directly goes against the notion that boys and men should open up about their emotions\n\nThe labeling TM also contributes to the notion of male perpetrator-hood and by extension female victim-hood and thus directly plays into the [Gamma Bias Hypothesis](https://link.springer.com/chapter/10.1007/978-3-030-04384-1_5). For some tangential empirical evidence of the Gamma Bias hypothesis see [Man up and take it: Gender bias in moral typecasting](https://www.researchgate.net/publication/342642686_Man_up_and_take_it_Gender_bias_in_moral_typecasting), a peer-reviewed and global study that shows that people more readily assume female victims and male perpetrators, that people assume that women suffer more pain from their harm, even when women fall in the perpetrator role, see male suffering as more deserved, fair and moral, feel more inclined to punish men and would like to dole out harsher punishments to men, assume more suffering and have more pity for women even in those cases where the real-world discrepancies signal that men have it worse. Women show a greater bias in almost all of the studies conducted. Alternatively, see [Dr. Tania Reynolds' YouTube video](https://www.youtube.com/watch?v=iR9tixOJSi0) about the same topic. Conversely, the same \"poisonously masculine traits\" are often celebrated in women, an effect described by the [Delta Bias Hypothesis](https://www.pjp.psychreg.org/wp-content/uploads/2020/12/seager-barry-168-171.pdf). In this way, TM can also serve as a mechanism of obscuration to hide overarching gynocentric societal attitudes from the average eye. As stated by William Collins in his book \"The Empathy Gap: Male Disadvantages and the Mechanisms of Their Neglect\":\n\n>Evolved matricentrism is enacted by those same emotions which drive the pair bond. This includes, for example, the key element of the ceding of moral authority to mothers, and by extension to women in general. One of the associated correlates of this moral authority is men's discomfort at female disapproval. The veil which has obscured this matricentrism is the traditional patriarchy which the feminists are so intent on smashing. The societal respect which patriarchy embodied hid, and hence made tolerable to men, the underlying matricentric subservience. As matricentrism has intensified into feminist gynocentrism, and the veil of respect for men has been withdrawn, **another mechanism of obscuration has become necessary. This is the doctrine of female oppression and poisonous masculinity.** For most people now, this new perspective on the sexes serves very effectively to hide gynocentrism. But it is a step too far. One cannot sweeten the pill by making it more bitter still. Some people are now rejecting a pill so bitter that it requires service to those who will continue to despise you. Matricentrism was never truly invisible to the  inquiring mind, more of an invisibility of convenience. And gynocentrism can be, and is being, perceived and resisted by many people, of both sexes. For women, resisting gynocentric tendencies may be equated with the responsible use of their power, motivated by the recognition of feminism's corrosive effects.\n\nAdditionally, TM conceals the effect female sexual mate selection has on male behavior and the fact that mothers, not fathers show a \"boys don't cry\" bias; see [Hypergamy](https://en.wikipedia.org/wiki/Hypergamy)^(1) and [Thomassin & Seddon (2019)](https://psycnet.apa.org/record/2019-46241-001) – Implicit attitudes about gender and emotion are associated with mothers’ but not fathers’ emotion socialization (or the [article summarizing the paper and articulating that even the authors expected to find the opposite](https://www.ctvnews.ca/sci-tech/boys-don-t-cry-study-suggests-mothers-not-fathers-show-gender-bias-towards-sons-1.4693208)). It has also been shown that females prefer stoic males for long-term mates ([Female Choice and Male Stoicism, Brown et al., 2018](https://www.ashdin.com/abstract/female-choice-and-male-stoicism-3240.html)).\n\nInstead of TM, prefer more appropriate labels: If a man engages in rape apologia, e.g. saying a boy being raped by an older woman was 'lucky', use the term 'internalized misandry'. If a man struggles to open up about his problems, realize that this is often because no one takes him seriously and use the term 'male invisibility'.\n\n^(1) See [this study that finds income is the primary factor that predicts a man getting married for evidence of female hypergamy](https://www.sciencedirect.com/science/article/abs/pii/S109051382100060X).",
    "title": "Toward a new theory of gender II: on the harmful notion of 'toxic masculinity'",
    "subreddit": "MensRights",
    "timestamp": 1636519422,
    "score": 35,
    "keyword": "man artist"
  },
  {
    "text": "Unhealthy relationship. First time posting on this thread. Feel really unbalanced in my life. I am currently a over full time college student with 21 units and I have a job as well. I live a pretty stressful life, I am an artist for one so I have personal work I do and I’m trying to become a professional tattoo artist one day. There are a lot of hardships and competition in this field. So, I have very minimal time in my life to enjoy anything socially. I am as well in a relationship with a girl I’ve been with since I was 18. I am no 21. She is a couple years older than I am, so she is very persistent on what she wants in a man. But it’s too much pressure I am 21 year old college student but expects me to wine and dine here as if I am a billionaire. She constantly puts me down if I don’t do anything for her or back her up in keeping up in the house. She gets very angry and often gets physical I have had cuts, scratches and bruises from her . She always accuses me of cheating but I don’t even know how if all do is go to school, work and home. I constantly spend time with (we live together) and are always together. But enough is never enough for her.  She constantly makes me feel bad for not spending time with her \nfor doing what I need to do. She’ll hit me with the “another man would”. I just get depressed and so sad. She just a moody person all the time. She keeps me from my friends and if I want to spend time with them she will guilt trip me and start an argument . This is a reason now I’m in my early 20s with literally no friends. Cause she would keep me from them. I feel so alone and have no one to talk to about this . Well I have people but it’s like the feeling you have others around you, but no matter how many people I still feel alone. I’m tired of feeling weak and disrespected I’m tired of the verbal and physical abuse. I just want to be happy man …",
    "title": "Unhealthy relationship.",
    "subreddit": "MensRights",
    "timestamp": 1636765127,
    "score": 15,
    "keyword": "man artist"
  },
  {
    "text": "Is anyone here familiar with Laura Bates and her book \"Men Who Hate Women\" that was recently released? I had heard of her book when it was coming out late last year because the subtitle caught my attention \"Men who hate women - From incels to Pickup Artists, the truth about extreme misogyny and how it affects us all.\" and I haven't gotten around to reading it yet but I did listen to a 45 minute podcast with her on Intelligence Squared.\n\nIt was actually fascinating to listen to someone describe the manosphere from an outside perspective. She tried to do her research and looked into the MensRights communities, the incel communities, the Red pill communities, etc and although her impressions were very negative, I can't really blame her for being an outsider with an agenda. \n\nI was disappointed to see that she fundamentally misunderstands these communities and only seems to have seen half the picture. Are there a bunch of misogynist men online that hate women? Of course. Is that the majority? Definitely not but the few are creating our reputation.\n\nThe manosphere to me has been a bastion of hope, community and progress for my personal life and if I hadn't found the seduction/redpill community for example, I think my life would today be a lot more painful than it is. Did I witness a lot of misogyny and men being heavily bitter towards women? Absolutely. Did I also get to read/hear stories that shocked and horrified me, portraying men getting absolutely demolished and ruined by women? Absolutely. \n\nIt is my belief that most of us here and a lot of the feminist crew also just want equality and the world to be a better place for everyone. It is important for us to realize that both camp is heavily biased and that makes sense but these issues will never be solved if we just keep pointing fingers and demonizing the other.\n\nI think Laura's book was made in good intentions but it failed short in actually understanding these issues. Good on her for trying though, if she's willing to make a sequel and get a more nuanced perspective I think there's real potential here. She needs to speak to quality figures in the manosphere to actually be able to portray a realistic and unbiased view of our current gendered issues. \n\nAn example is she was very surprised that a lot of the men in these incel communities were university educated. She pictured the \"angry misogynists online\" to be more like the uneducated tinfoil crowd where as I would argue that as a man university is where you do start to get redpilled to the world. That's where you start to find out your position in life and how being a good boy won't give you the financial resources that you see other people having nor the respect and attraction from your female peers.\n\nShe, and a lot of women, have the impression that men's biggest issue is this hatred of women, and if they just started to be nice and respecting women they would all the sudden get the relationship they're looking for. I don't even blame them for that view, how could you possibly understand what life is like as a man? \n\nThis is why I really like for example Alexander Grace's video on Youtube where he has a 19 year old girl make a fake tinder as a guy and see what that's like and she literally reports feeling anxious and depressed afterward. There's also the BuzzFeed video where a female reported tries out pickup and gives up at the start and hires girls to approach men for her video because she realizes it's too hard and scary to approach random strangers. \n\nCurious if any of you have read/heard about the book and what you guys think about the idea that the Men's Rights and feminist community should collaborate and have a more open discourse if we each want to get to solutions.",
    "title": "Is anyone here familiar with Laura Bates and her book \"Men Who Hate Women\" that was recently released?",
    "subreddit": "MensRights",
    "timestamp": 1639510783,
    "score": 13,
    "keyword": "man artist"
  },
  {
    "text": "Ran across a new study: The men and women, guys and girls of the ‘manosphere’: A corpus-assisted discourse approach r/mensrights was one of the sources used.\n\n* https://journals.sagepub.com/doi/full/10.1177/0957926520939690\n\n* **The men and women, guys and girls of the ‘manosphere’: A corpus-assisted discourse approach**\n\n* **Abstract**\n\n* This study investigates how the lemmas woman, girl, man and guy are used to discursively represent and construct gender identities in an anti-feminist forum on the discussion website Reddit. The lemmas were analysed using corpus-assisted social actor analysis and appraisal theory. Similarities and differences within three sub-communities of the TRP subreddit were considered: Men’s Rights (activists who believe that men are systemically disadvantaged in society), Men Going Their Own Way (who abstain from relationships with women), and Red Pill Theory (primarily pick-up artists).\n\n* The corpus was characterised by bare assertions about gendered behaviour, although the masculine gender role was less well-defined than the feminine one. Women and girls were dehumanised and sexually objectified, negatively judged for morality and veracity, and constructed as desiring hostile behaviour from male social actors. **Conversely, men were constructed as victims of female social actors and external institutions** and, as a result, as unhappy and insecure.\n\nWell, at least the bolded part seems more or less correct.\n\nLooking through the actual quotes (they quoted one sentence or part of a sentence), I see very few from here, most are from MGTOW or TRP. \n\nI wonder what she would find if she examined FDS and r/ feminism? She'd probably find nothing of concern.",
    "title": "Ran across a new study: The men and women, guys and girls of the ‘manosphere’: A corpus-assisted discourse approach",
    "subreddit": "MensRights",
    "timestamp": 1621034950,
    "score": 8,
    "keyword": "man artist"
  },
  {
    "text": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari Excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari\n\nhttps://www.amazon.com/Sapiens-Humankind-Yuval-Noah-Harari/dp/0062316095\n\n***\n\n\"Different societies adopt different kinds of imagined hierarchies. Race is very important to modern Americans but was relatively insignificant to medieval Muslims. Caste was a matter of life and death in medieval India, whereas in modern Europe it is practically non-existent. One hierarchy, however, has been of supreme importance in all known human societies: the hierarchy of gender. People everywhere have divided themselves into men and women. And almost everywhere men have got the better deal, at least since the Agricultural Revolution.\n\nSome of the earliest Chinese texts are oracle bones, dating to 1200 BC, used to divine the future. On one was engraved the question: ‘Will Lady Hao’s childbearing be lucky?’ To which was written the reply: ‘If the child is born on a ding day, lucky; if on a geng day, vastly auspicious.’ However, Lady Hao was to give birth on a jiayin day. The text ends with the morose observation: ‘Three weeks and one day later, on jiayin day, the child was born. Not lucky. It was a girl.’4 More than 3,000 years later, when Communist China enacted the ‘one child’ policy, many Chinese families continued to regard the birth of a girl as a misfortune. Parents would occasionally abandon or murder newborn baby girls in order to have another shot at getting a boy.\n\nIn many societies women were simply the property of men, most often their fathers, husbands or brothers. Rape, in many legal systems, falls under property violation – in other words, the victim is not the woman who was raped but the male who owns her. This being the case, the legal remedy was the transfer of ownership – the rapist was required to pay a bride price to the woman’s father or brother, upon which she became the rapist’s property. The Bible decrees that ‘If a man meets a virgin who is not betrothed, and seizes her and lies with her, and they are found, then the man who lay with her shall give to the father of the young woman fifty shekels of silver, and she shall be his wife’ (Deuteronomy 22:28–9). The ancient Hebrews considered this a reasonable arrangement.\n\nRaping a woman who did not belong to any man was not considered a crime at\n\nall, just as picking up a lost coin on a busy street is not considered theft. And if a husband raped his own wife, he had committed no crime. In fact, the idea that a husband could rape his wife was an oxymoron. To be a husband was to have full control of your wife’s sexuality. To say that a husband ‘raped’ his wife was as illogical as saying that a man stole his own wallet. Such thinking was not confined to the ancient Middle East. As of 2006, there were still fty-three countries where a husband could not be prosecuted for the rape of his wife. Even in Germany, rape laws were amended only in 1997 to create a legal category of marital rape.\n\nIs the division into men and women a product of the imagination, like the caste system in India and the racial system in America, or is it a natural division with deep biological roots? And if it is indeed a natural division, are there also biological explanations for the preference given to men over women?\n\nSome of the cultural, legal and political disparities between men and women reject the obvious biological differences between the sexes. Childbearing has always been women’s job, because men don’t have wombs. Yet around this hard universal kernel, every society accumulated layer upon layer of cultural ideas and norms that have little to do with biology. Societies associate a host of attributes with masculinity and femininity that, for the most part, lack a rm biological basis.\n\nFor instance, in democratic Athens of the fifth century BC, an individual possessing a womb had no independent legal status and was forbidden to participate in popular assemblies or to be a judge. With few exceptions, such an individual could not bene t from a good education, nor engage in business or in philosophical discourse. None of Athens’ political leaders, none of its great philosophers, orators, artists or merchants had a womb. Does having a womb make a person un t, biologically, for these professions? The ancient Athenians thought so. Modern Athenians disagree. In present-day Athens, women vote, are elected to public office, make speeches, design everything from jewelry to buildings to software, and go to university. Their wombs do not keep them from doing any of these things as successfully as men do. True, they are still underrepresented in politics and business – only about 12 per cent of the members of Greece’s parliament are women. But there is no legal barrier to their participation in politics, and most modern Greeks think it is quite normal for a woman to serve in public office.\n\nMany modern Greeks also think that an integral part of being a man is being sexually attracted to women only, and having sexual relations exclusively with the opposite sex. They don’t see this as a cultural bias, but rather as a biological reality – relations between two people of the opposite sex are natural, and between two people of the same sex unnatural. In fact, though, Mother Nature does not mind if men are sexually attracted to one another. It’s only human mothers steeped in particular cultures who make a scene if their son has a fling with the boy next door. The mother’s tantrums are not a biological imperative. A significant number of human cultures have viewed homosexual relations as not only legitimate but even socially constructive, ancient Greece being the most notable example. The Iliad does not mention that Thetis had any objection to her son Achilles’ relations with Patroclus. Queen Olympias of Macedon was one of the most temperamental and forceful women of the ancient world, and even had her own husband, King Philip, assassinated. Yet she didn’t have a t when her son, Alexander the Great, brought his lover Hephaestion home for dinner.\n\nHow can we distinguish what is biologically determined from what people merely try to justify through biological myths? A good rule of thumb is ‘Biology enables, Culture forbids.’ Biology is willing to tolerate a very wide spectrum of possibilities. It’s culture that obliges people to realise some possibilities while forbidding others. Biology enables women to have children – some cultures oblige women to realise this possibility. Biology enables men to enjoy sex with one another – some cultures forbid them to realise this possibility.\n\nCulture tends to argue that it forbids only that which is unnatural. But from a biological perspective, nothing is unnatural. Whatever is possible is by definition also natural. A truly unnatural behaviour, one that goes against the laws of nature, simply cannot exist, so it would need no prohibition. No culture has ever bothered to forbid men to photosynthesise, women to run faster than the speed of light, or negatively charged electrons to be attracted to each other.\n\nIn truth, our concepts ‘natural’ and unnatural’ are taken not from biology, but from Christian theology. The theological meaning of ‘natural’ is ‘in accordance with the intentions of the God who created nature’. Christian theologians argued that God created the human body, intending each limb and organ to serve a particular purpose. If we use our limbs and organs for the purpose envisioned by God, then it is a natural activity. To use them differently than God intends is unnatural. But evolution has no purpose. Organs have not evolved with a purpose, and the way they are used is in constant ux. There is not a single organ in the human body that only does the job its prototype did when it first appeared hundreds of millions of years ago. Organs evolve to perform a particular function, but once they exist, they can be adapted for other usages as well. Mouths, for example, appeared because the earliest multicellular organisms needed a way to take nutrients into their bodies. We still use our mouths for that purpose, but we also use them to kiss, speak and, if we are Rambo, to pull the pins out of hand grenades. Are any of these uses unnatural simply because our worm-like ancestors 600 million years ago didn’t do those things with their mouths?\n\nSimilarly, wings didn’t suddenly appear in all their aerodynamic glory. They developed from organs that served another purpose. According to one theory, insect wings evolved millions of years ago from body protrusions on flightless bugs. Bugs with bumps had a larger surface area than those without bumps, and this enabled them to absorb more sunlight and thus stay warmer. In a slow evolutionary process, these solar heaters grew larger. The same structure that was good for maximum sunlight absorption – lots of surface area, little weight – also, by coincidence, gave the insects a bit of a lift when they skipped and jumped. Those with bigger protrusions could skip and jump farther. Some insects started using the things to glide, and from there it was a small step to wings that could actually propel the bug through the air. Next time a mosquito buzzes in your ear, accuse her of unnatural behaviour. If she were well behaved and content with what God gave her, she’d use her wings only as solar panels.\n\nThe same sort of multitasking applies to our sexual organs and behaviour. Sex first evolved for procreation and courtship rituals as a way of sizing up the fitness of a potential mate. But many animals now put both to use for a multitude of social purposes that have little to do with creating little copies of themselves. Chimpanzees, for example, use sex to cement political alliances, establish intimacy and defuse tensions. Is that unnatural?\"",
    "title": "\"He and She\" - excerpt from \"Sapiens: A Brief History of Humankind\", by Yuval Noah Harari",
    "subreddit": "Feminism",
    "timestamp": 1627323647,
    "score": 32,
    "keyword": "man artist"
  },
  {
    "text": "where did telling women to smile come from? it's such a weird thing to me. I mean, obviously the instinct to harass women on the street doesn't make sense, but like. How did the meme of harassing women in such a *bizarre* way spread from man to man? Does anybody know what popularized it?\n\nI can't picture in my head one sexual harasser turning to the guy next to him on the bus and going, \"hey, the next time you're harassing a woman on the street, try doing it in this very strange way\". Like, I know the \"ask a girl if she has a bf, if she says no then act like that means she can't say no to u, if she says yes then act like her not being married to the guy means she can't say no to u\" sexual assault flowchart came from \"pickup artists\" (read also: sexual assault advocates). Was it something that was on tv somewhere?\n\nI put a little effort in & discovered that google had 0 results for \"stop telling women to smile\" prior to 2012\\*, had 1 result in 2012 then 2013 & beyond there were too many results to count. (everybody I've asked doesn't remember getting this line from before about then so *anecdotally* these dates appear to line up). Which, combined with the fact that it seems to be extraordinarily (not exclusively, of course) popular among older men reinforces my working hypothesis that it isn't a naturally occurring, just like, random meme. If it were I'd imagine it'd have had a more gradual ramp-up in articles talking about it instead of going from 0 per year to thousands. Also the fact that ppl talking about it pretty closely correlates to g@mergate seems... potentially related? Weird coincidence if not\n\n&#x200B;\n\nAnybody know anything abt it?\n\n&#x200B;\n\n^(\\* there was 1 result that google attributes to before 2012 but it's just a sidebar link to an article written after 2012, the actual pre-2012 article itself is unrelated)",
    "title": "where did telling women to smile come from?",
    "subreddit": "Feminism",
    "timestamp": 1627005522,
    "score": 26,
    "keyword": "man artist"
  },
  {
    "text": "The French comic artist Emma illustrates the concept of the ‘mental load’. When a man expects his partner to ask him to do things, he is viewing her as the manager of their household chores",
    "title": "The French comic artist Emma illustrates the concept of the ‘mental load’. When a man expects his partner to ask him to do things, he is viewing her as the manager of their household chores",
    "subreddit": "Feminism",
    "timestamp": 1636353015,
    "score": 25,
    "keyword": "man artist"
  }
]