[
  {
    "text": "The \"Husband Stitch\" So a few years ago my husband told me that the doctor who delivered his brother asked his dad if he wanted a \"couple of extra stitches thrown in there\" while her episiotomy was being closed. Of course I found this offensive and angering, and a joke in extremely bad taste. \n\nThis morning the topic came around again, and I mused that, back in the '70's, doctors might have actually *done* that shit. My husband scoffed at me and said \"No way,\" and I agreed. I was probably just being bitter bc his dad is a sexist asshole. (Ex: took pictures of other women in bikinis on a family vacation with the family camera, got them developed, and they're still in their photo box.) Out of curiosity, I decided to google \"husband stitch\" to reassure myself that it was an urban legend. \n\n**I was so. Fucking. Naive.**\n\nThe \"husband stitch\" was [totally](https://www.healthline.com/health-news/husband-stitch-is-not-just-myth#The-history-of-episiotomies,-from-popular-to-discouraged) [real.](https://granta.com/the-husband-stitch/) My husband and I just stared at each other open-mouthed for a second because it seemed like such an evil, misogynistic violation that it couldn't be real. But it is. \n\nFor those that don't know, the practice involves putting extra stitches in the vagina to make it \"tighter\" for the man's pleasure because men are still terrified that childbirth makes pussies loose. That's not true, and it also shouldn't be a fucking priority after you just had an infant. The practice can cause a host of complications for women, most frequently **pain during intercourse.** But that's a petty concern when compared to a man's right to fuck. This can affect husbands, too, because it really messes up their sex life. (Hope it was fucking worth it, asshole.)\n\nI took the practice to be separate from an episiotomy, which I thought was a medical procedure, but my husband made a great point: episiotomies used to be routine because they didn't want the vagina torn too much, and he asked me if I thought that was out of concern for the woman. \"No,\" he said, \"the interest in preventing tearing was **also** to keep the husband's vagina nice and tight and pretty looking.\" I had to admit that he was right. (And I was also secretly proud of him. I hit the man jackpot!) \n\nThe \"husband stitch\" is still performed today, and I truly wonder how many women even get asked or told about it.\n\nEven after being on the planet for 43 years, this practice still shocks the **fuck** out of me. One woman described \"laying there like a lump\" while the husband and doctor discussed the extra stitches, ignoring her completely. I always worry about being one of those stereotypical \"angry, man-hating\" feminists, but I'm so fucking tired of men thinking they have any amount of privilege or control over our bodies!!! This stitch shit is fucking crazy! \n\nIt's nothing but a subtle admission that a lot of men see women as non-sentient fuck-holes that only exist to pleasure them. Look at they way they flipped their shit about #MeToo, when it was made loud and clear that they don't just get free access to our bodies whenever it strikes their fancy. And i **know** women have it relatively good in America, but I can't believe that we still have this far to go. And to be brutally honest, I am finding it hard **not** to despise men just a little bit for thinking they're owed a tighter pussy because they were generous enough to let us have their baby. **Fuck that.**\n\nMy husband was appalled, too, but I really needed to rant at some fellow women. Thanks for putting up with me :) Stay safe and healthy out there!\n\nEdit: 20 seconds and the post gets downvoted. I'm gonna throw caution to the wind and assume it's a guy throwing a tantrum because he doesn't like being told that our bodies don't belong to him. How about that person simply respect us out of common fucking courtesy, since it's always the **obviously correct** choice, and just go on from there.\n\nEdit2: **STEPS TO TAKE TO PROTECT OURSELVES**: Fuck genital mutilation, ya'll! From what I have read, there are a couple of simple things we can do to avoid this bullshit:\n\n1. Find an OBGYN that you trust (good advice for all of us!)\n\n2.  Talk to them about how you would like your birth to go and try to establish some kind of plan. Keep it short and simple, say 3 of your most important thoughts. It's always helpful to bring an advocate with you (this is usually the husband if it's an obstetrics appt, but it can be anyone you trust and who knows what you want to achieve.)\n\n3. Ask the OBGYN **what their policy is regarding episiotomies.** Ask them how often they do them and how they decide that it's necessary. *Tell them you would prefer you don't have one if at all possible,* although sometimes they are needed in emergent situations. Use your voice, say that shit - doctors work for *you.*\n\n4. Tell them that you don't want the husband stitch, and if they try to laugh it off, tell them what you know about it and that it's a real thing. Don't let them intimidate you, you have the right to tell them what is and isn't acceptable. If you have an advocate or support, bring them too if it will help.\n\n5. This is unofficial, but I'm a nurse, so: **do your own research before your appointment. ADVOCATE FOR YOURSELF**, because a lot of doctors (sorry if I offend, and I'm only speaking from *my* experience) are supercilious man-splainers that are used to having their ass kissed constantly. (And you should see the difference in the way most male doctors talk to female nurses vs. male nurses. But that's another post.) **Don't take that bullshit.** Ask them however many questions you want, make them explain anything you aren't sure you're solid on, ask about meds, ask about anesthesia, bring something to write on. If they order tests, ask them what they're for - doctors will order Bullshit tests to get a few extra bucks from your insurance. (I have seen this happen at nearly every floor I've worked on. It's especially bad if you have Medicare - they charge the fuck out of Medicare.) When it's all over, **ask for an itemized bill.** If something seems bogus, call the office and make them give you an explanation.\n\n6. Again: Use your voice. Advocate for yourself (and the rest of us ladies will benefit, too!) I can't say that enough. Don't let anyone blow you off or condescend to you, and don't leave until you have the information you want. **I love you guys! Stay safe and healthy and vaginally perfect out there!! I know it's painful And upsetting to read about this shit, but THIS IS HOW WE MAKE LIFE BETTER for ALL of us. You're amazing, and i believe in you!**\n\nEdit3: Guys, my inbox is freaking blowing up and i can't answer everybody. **Thank you so much for the awards and the kind words!** I was mortified by this and really needed to talk to some women (I've got some anxiety issues - but who doesn't after 2020), and you guys have helped me so much! Spread the word about this misogynistic fuckery to all the ladies you love of child-bearing years, and keep on being wonderful human beings! <3 <3\n\n**Edit 4: What can we do to raise awareness and hold doctors accountable?** I slept on this, and I have some ideas, but I also need your help. Here are my thoughts: I'm a member of the Satanic Temple, and they do a lot of activism regarding bodily autonomy. This issue seems to be right in their wheelhouse. They have funds and they have lawyers. I think it's worth it for me to email them about this - even if they don't pick it up right away, at least it will put the bug in their ear. I have a friend back in Boston who knows one of the ST founders, and i am going to get him to work this into a convo with Doug sometime. That's one way to raise awareness about this. But what else? How do we find women who have been victims of this? Do we set up a website where they can self report? Does anyone know how to do that, because I'm shit with that kind of thing. Are there any lawyers reading who could give advice? What do you guys think? Can we create a space where we can talk about/collaborate on this - maybe a Slack workspace or something? **What are your thoughts?**",
    "title": "The \"Husband Stitch\"",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618413909,
    "score": 10417,
    "keyword": "man lawyer"
  },
  {
    "text": "My supervisor told me I was “overthinking it” when I reported sexual harassment For two years, my coworker ten years my senior has been making comments, been increasingly more bold with touching and being territorial of me. I finally came to the conclusion that it’s not okay and reported him to my direct supervisor. For two years, my supervisor (another man ten years my senior) was gaslighting me. Each time it got really uncomfortable for not only me but everyone else in my department, he would pull ME aside saying “you should really do something about this, upper management is talking about the two of you”. Excuse me??? I have told my coworker several times to not touch my legs or back, do not sit so close to me, and do not answer over me or take things off my desk to “be helpful”. I even had another guy from a different department say he didn’t want to work with me because my coworker would stare him down and get angry at him if he helped me. \n\nSo when finally put my foot down, my supervisor said “your overthinking this, he’s basically in love with you so this is outside my job responsibility”. Luckily this was over text. So I told him that according to the corporate policy to sexual harassment my coworker checked basically all the boxes and that I now have proof that not only my manager but also upper management has been actively not dealing with this. He feebly reply “oh okay I seemed like you two were friends and it was a grey area”. To which I responded, I was 19 when this started, he was 29. You should have fucking dealt with this.\n\nEdit: Thank you everyone for the encouragement and advice. A friend of mine is a lawyer and I’m going to talk to him later this week. I needed the push so I appreciate the kind words. This sub is amazing.",
    "title": "My supervisor told me I was “overthinking it” when I reported sexual harassment",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613674175,
    "score": 1325,
    "keyword": "man lawyer"
  },
  {
    "text": "I finally called the police about my abusive partner forcing himself on me and after a minute talking to just my partner the police reported that I was the one attempting to sexually assault him. So I only just learned about this report.\nYears ago I was in a severely abusive relationship with a dangerous narcissist. The abuse was mental, physical and sexual. It wasnt uncommon for him to trap me in his room with no phone and deprive me of food and sleep until I let him do what he needed with my body. I have issues where sex hurts so with how he treated me my body never wanted it and it was excruciating.\nAt the time i was isolated from everyone and was staying at this mans home in a rural area. I didn't drive. \nFinally one night after all his friends left a backyard campfire he woke me up and tried to force himself on me and i pushed him away violently and said no. He then got petty as he usually did and proceeded to throw things at me or shake me anytime i started to go back to sleep. All the while muttering awful things at me. That was his typical response. Hed let me sleep if he got what he wanted. That eventually was not enough and he got irate and violent and trapped me in the room and things escalated. This time i realized in his drunken state he didnt take my phone immediately like usual. I made a dash to my bag and dialled 911 frantically. I yelled the address and hung up as he tried to wrestle the phone from me. It didnt matter what happened because the police would arrive soon. \n\nThe police arrived and i was half dressed in near hysterics because i was scared. He is a scary person. The police barely spoke to me and talked privately with my partner. He transformed into mister sober and collected. After a while trying my hardest to listen in I overheard \"I am so sorry officer for wasting your time. When she drinks a bit too much she has these episodes..\" and i  absolutely lost it. No. You are not making me the bad guy. You do this to me all the time. Force me into sex with you through torture and im done.\n\nThe cops drove me to a friends house and after a very messy and tumultuous break up that was that.\n\nI finally this year decided to report his repeated abuse and rape to pursue charges. After the Crown said I had a case my detective found that police report.\n\nThe responding officer wrote that I woke up my partner after he went to bed early trying to be intimate, when he declined because I was too drunk I became hysterical and made a bunch of threats and called the police and he requested I be removed from the home. It states I was then taken to a friends at his request. I was mailed a victim services pamphlet the next week. \n\nThe police officer took his word over mine. And I am about to walk away from my case and am absolutely devastated and he will win because in the words of my detective \"his lawyers will eat this up\".\n\n\nEdit: Recent interactions with my detective since asking for these reports and poking holes in missing statements and missing reports have been condescending and gaslighty. It doesnt matter theres no statement from me from that night because the officer spoke to us both enough to determine what happened. Am I sure I'm not just misremembering? What I'm implying simply doesnt happen and she doesnt understand what Im getting at. She then said she wont be discussing the flubbed report issue anymore and to just wait for the FOI reports to come in and she will call me after she speaks to other listed witnesses.",
    "title": "I finally called the police about my abusive partner forcing himself on me and after a minute talking to just my partner the police reported that I was the one attempting to sexually assault him.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618443773,
    "score": 588,
    "keyword": "man lawyer"
  },
  {
    "text": "My husband left me, 5 months pregnant Hello. I'm still in shock and don't know where to go from here, which is why I'm here talking to a bunch of strangers hoping I get some form of advice. \n\nWe have been married 16 years. We have two kids 6 and 3. \n\nI'm afraid. I think he's having \"an episode\"? how do I recognize that? \n\nI'm sorry I'm all over the place, I dont know what to say... I know he's controlling, manipulative, a cheater, a liar, very spiteful and a narcissist (according to my individual therapist) \n\nYes, we have tried counseling, after he would have an affair, tried church counseling (I was desperate) a counselor, a therapist \n\nAnyway, sitting here 5 months pregnant and have absolutely no idea what to do next. I just dont... my brain feels scrambled and idk.. Im tired. \n\nCan you tell me about your divorce experience with a man who is controlling?\n\nEdit: Thank you so much kind strangers. I will be reading this all night since I cant sleep. I will take into account every link, every book and every suggestion. \n\nIt sounds so dumb... but I feel like I'm still in shock that he just up and left us, in a state he has no family in. Left us stranded at home and apparently, even installed an Amazon Ring Doorbell the day he left. I discovered it the next day. The reason is because the day he left us I had had surgery so I was half asleep all day until he left.\n\n2nd Edit:\n\nHe returned to the home on the evening of 2/13, before I could speak to a lawyer about changing the locks. He grabbed a bed, took it the guest bedroom downstairs, and hasn't said not one word to me. My daughter asked him where he was and he just smiled and said \"work\"\n\n-It is so much worse having him here.",
    "title": "My husband left me, 5 months pregnant",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1613221056,
    "score": 471,
    "keyword": "man lawyer"
  },
  {
    "text": "Why is it always an argument with older male doctors? I'm tired of having to viciously advocate for myself every time I get stuck with one because my primary isnt available. I'm tired of having to have an argument about my right to recieve adequate care every time I get saddled with one. I should be going to the doctor to be *helped*, not have a jousting match with a jerk who wont listen to me.\n\nI'm a woman in my mid-20s and have been suffering with an autoimmune disorder since just after I turned 20. *Every* older male doctor I've had has gone out of their way to deny me any form of help or treatment. It always boils down to: *\"Well, I think you're okay, and you're too young to have these kinds of issues! It sounds like you're depressed and have anxiety. Is your period coming?\"*\n\nI was unfortunately stuck with a doctor like this when the immune issues began, too. I put on 50lbs in 2 months despite barely being able to keep anything down. I began having shakes and my heart rate while resting was 130bpm. I was admitted to the ER several times and, instead of taking me seriously, he repeatedly insisted it was just my period, secret binge-eating, and that I must do some kind of street drugs that are damaging my heart. Anything not to test me or take me seriously, right? He was actively watching me die without treatment and was seemingly content with it.\n\nThe only way I was able to get him to test me for this condition (which is hereditary and runs *very strongly* in my family) was to threaten a lawsuit in a full-blown screaming match with him. It shouldn't have had to be that way. For me or for anyone. This man was supposed to be a doctor. I had to drag a *lawyer* to the appointments with me until I was able to switch doctors and move to a new town.\n\nAnd after many years and many doctors, this is still a problem.\n\nWhen my primary, a woman who actually listens to me and helps me, isnt available I get tossed around to random physicians. Yesterday I was stuck with an older male who, of course, listened to every word I said and then contradicted me at every single point. Even going to far as to say that I dont *actually* have an autoimmune disorder. All the tests I have every month for literally years to monitor it are wrong, I'm perfectly healthy. I'm apparently just severely mentally ill and require buckets full of psych meds. *Also, hows my period?*\n\nI'm so mad I could spit.\nInstead of getting my autoimmune medication adjusted, I get accused of being hormonal and psychotic. Again. I get denied help, again.\n\nBut I advocated for myself this time. And I yelled. I reiterated everything I had said previously. I forced him to write in my chart if he was continuing to refuse me treatment for my very well documented disease. I had to argue with him and continually correct his perception of me for well over 20 minutes in order for him to give me the medication I very literally need to live.\n\nAnd it shouldn't be this way. This is exhausting and inhumane. If you're going to treat your female patients this way ***you should not be a doctor.***",
    "title": "Why is it always an argument with older male doctors?",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1619215972,
    "score": 237,
    "keyword": "man lawyer"
  },
  {
    "text": "I read my victim impact statement in court and put a monster in prison. Here's my statement and what happened. **\\*\\*\\*TW for abuse (csa and other) and court process\\*\\*\\***\n\nAround three months ago I took the man who sexually, emotionally, and physically abused me to court. He pled no contest so it was a sentencing hearing and I opted to read an impact statement to the court. It took 3.5 years (42 months) from the first police report to the day it finally went to court. It was by far the hardest thing I have ever done but I needed to do it. The perpetrator got sentenced to 32 months and will have a sex offender status for the rest of his life. I won't go into what happened but for a little context, I was 16 and he was 41 and in a position of power over me.\n\nI am making this post to share my impact statement. As I was preparing for speaking, I read and listened to other impact statements but could not find too many, so I am adding mine to the internet for other survivors. I wish I had tips for others in this situation but I don't. I'll still share what happened though in case it helps anyone, that's why I'm making this post. I got through it and I have no idea how. I spent so much time on my statement and read it until I almost had it memorized.\n\nThe day before and the day of I felt absolutely sick and I don't think there is any way around that. I just read Harry Potter quotes and tried to not throw up. After a certain point, you can't prepare any more. My entire body froze when I saw him and the air was pulsating around me. It was the most stressful experience I've been through and I am very fortunate I had the support of me my family. I was also grateful to be able to physically hide behind them. I was shaking the whole time and completely derealized.\n\nI won't go into the court process but if you have questions you can comment/ask. My statement was last, nearly at the end of the hearing. It was hard to hear my family's statements and go after them but I had read them prior to the hearing and knew what to expect, which helped. I couldn't feel my legs and I could feel his eyes burning me as I walked past him; it was the closest I'd been to him since the trauma happened and my body was ice. My advocate blocked me from his view and I was in full panic. But I just did it. I stood up and looked only at the judge and I spoke for around ten minutes straight with barely any mistakes. My voice fogged up but I did not cry. I spoke every word clearly and deliberately. My victim's advocate told me it was the best statement she had heard in all her 20 years. Hearing the handcuffs click together at the end of the hearing was one of the best sounds I've heard.\n\nThis post is getting long but it is hard to condense such an intense and emotional process into fewer words. The next part of this post I wrote the day after the hearing. It was written for you - the reader/survivors.\n\n&#x200B;\n\nhttps://preview.redd.it/3eidw0buo0y71.png?width=468&format=png&auto=webp&s=06f8ab7f96e5017901679c3b024b923e75fc527e\n\nIf you are in a similar situation, or just a bad situation, I believe in you. I know how impossible everything can seem but I also know we can always handle more than we think we can.\n\nI am moving on to the final portion of this post, I know it is long. This is a portion with words directed at the monster who did it. He will most likely never see it but I don't care. And it isn't particularly important to my post, I just need to get it out because I couldn't have it in my statement. I used to feel so guilty for wanting him to feel bad, but I can't anymore. He is a monster and he deserves the punishment he is receiving.\n\n&#x200B;\n\nhttps://preview.redd.it/1yn4n8uvo0y71.png?width=468&format=png&auto=webp&s=33ca8d286aa1f98bdaf7627d67746d43da16fc24\n\nIf you have made it all the way to the end, thank you for sticking with me. I am so proud of anyone and everyone who is just surviving because sometimes that is all you can really do. I wish I could tell you this whole process gave me closure or made me feel better, but I ache just as much, if not more. My PTSD has gotten more severe in the months following the hearing and it has been incredibly difficult to fight through every day feeling emotions at the level of intensity I felt immediately following what happened. But going to court was something I knew I needed to do. An evil man rots in prison as you read this. He will never again be able to hurt someone like he hurt me. Please let me know if you have any questions about the court process, police/reporting process, or anything else. My statement can be found using the link below. It is long and heavy and obviously triggering so please keep that in mind. My advocate said it was the best she heard in her years and I made dirtbag's lawyer cry, so I hope it helps someone. And please remember that you are strong. Even when, especially when it feels the complete opposite you are strong.\n\n[https://docs.google.com/document/d/1lBv4kY8DXJyuE\\_HRqzcorjXNS\\_1aipVlkJ\\_1vUrsr4Y/edit?usp=sharing](https://docs.google.com/document/d/1lBv4kY8DXJyuE_HRqzcorjXNS_1aipVlkJ_1vUrsr4Y/edit?usp=sharing)\n\nedit** thank you for those who responded! i’m sorry I didn’t respond, this whole thing is far too overwhelming but I appreciated each one of them.",
    "title": "I read my victim impact statement in court and put a monster in prison. Here's my statement and what happened.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1636223189,
    "score": 216,
    "keyword": "man lawyer"
  },
  {
    "text": "When a man text/IM you and say \"I am having problems with my marriage\" - shut it down fast and run. Because to HR/lawyers no doesn't mean no. Hello everyone,\n\n   I am not sure if this is the right place to post this but I needed to get this off my mind and my head.  Warning: there may be things that trigger people.  \n\n   On the night 3/24/2021, I received text msg from someone that I've worked with for 5 years on the same team. He texted me to tell me that he and his wife were having marital problems. I didn't think anything of it, thought he needed someone to talk with to work out some issues.  I counseled him to not think about it and act rash and to step away from it and look at it again in the morning.  He said that maybe he rushed into things (he had gotten married in 08/2020) and that it's his fault.  I asked him what it was about he said he wasn't ready to speak on it so I let it go.  I told him to go watch a movie and relax for the rest of the movie and thought the conversation was done. A few minutes later he texted back and asked me if there was any adult film I would recommend. I asked him if he meant not cartoon (I had just woken up from a nap and didn't understand him).  He said no he meant porn. I told him porn is boring. He then proceeded to tell me \"this is my favorite porn\" and attached a link. I stared at blank link (iPhones doesn't automatically show preview) thinking this must be a joke. I proceeded to deflect and tell him that porn is unrealistic and that it doesn't fit real life, even linked him a BuzzFeed article showing that porn just match real life. He started to make fun of porn scenario and I thought he just needed to blow off steam so I continued talking to him. \n\n  All the sudden he asked me if the conversation was turning me on. I froze and said no, because porn is boring. He then responded by saying that he takes that as a challenge. At which point I shut him down and told him that I am the wrong target for flirtation and that he better be drunk. He said yes he's drunk haha. I then told him to go sleep it off before he said anything more that he will regret in the morning and he made the comment \"I love to think about treating you so gooood\". I was horrified and shocked and I told him again to go before I slap him. I was livid and mad and started texting a mutual friend that he was drunk and was out of him mind. That friend was in shock and thought he had lost his mind.\n\n  The next morning at work, I had intended on calling him and telling him that I don't ever want to get drunk text from him again and that he better learn to behave himself properly. Except in a fit of irritation I told another friend of mine that he had drunk texted me and made some pretty inappropriate comment at me. That's when I found out that he had done a similar thing to this other female co-worker (who was suffering from a loss of a family member). He had snapchatted with her and told her he wanted a work wife to do \"things\" with and that what her husband doesn't know won't hurt him. Basically before noon that day, there were 3 of us that had been harassed by him. At this point under the guidance of a director in my department I filed an HR case against him and so did 2 others. \n\n  He came to work later in the day and claimed that his wife had thrown him out and started panic text in two different tone to me and the other co-worker. To her he was all glee and mirth, to me he played the sad puppy card. I refused to speak with him and asked another to speak with him. According to the person he started spouting things that sounded suicidal and panicky and she got so triggered she called HR herself to report that he may be doing self-harm to himself. By this time, my direct boss had known that I filed an HR case so had another. He said that he will handle him from now on. Before 4pm rolled around he went on PTO because he had to deal with \"his marital problem\".  He went on Leave of Absence (LOA) the following week.\n\n  HR interviewed my friend and I. They asked her \"why did you friend him (on social media) if you didn't know him well?\" (They've worked together on the same team for 5 years). They also accused her of being in cahoots with me to cook this up. When my turn came, all I can say was I was slut shamed for talking to him. They kept asking me why I didn't 'shut him down at different juncture'. I explained that I thought he just needed someone to talk to/to blow off steam because he was having problems with his wife. I didn't know the conversation would turn to the point that I would need to open a case.  I left that interview anxious and dirty. I couldn't speak, I was stuttering.\n\n  Nothing happened for almost a month, he continues to be on LOA, people now thinks he's on an exotic vacation because his running buddy at work told everyone he's traveling and enjoying himself.  HR again called me into an interview and asked me if I tried to deliberately mislead them I said no three times and I was mad and angry and livid and not nice anymore.  The following Monday on 5/3/2021 I was terminate from my job. A job that I've held for over 9 years. The reasoning, you wonder? Because HR decided I violated the sexual harassment policy instead. I was in shock and was coerced into resigning by my very own boss. I barely had time to send myself my own resume before they terminated my access in the company and basically told me to go to hell. \n\n  I was in a state of shock and didn't know what to do, I texted my friends and just freaked out. A bunch of them told me to get a lawyer to represent me. At work they just announced that I resigned and the team was in an uproar because they know I would never leave without talking to them. I got texts and phone calls from people worried about me and anxious about me. A few went out of their way to ask their friends who work in law firms for contact info. I spoke with one and was told in no uncertain term that what happened to me was retaliation and that \"HR works for the company not the employee and that they will try to blame the victim\". The lawyer spoke with the partners of the firm and they agreed to take on my case. I placed my trust with them and decided to let them take it where it needs to be while I start to slowly put the pieces of my life back together, that was three weeks ago.\n\n  This morning I received a call from the lawyer that after reading the text screenshot I sent that they decided to not continue with the process because the text showed that I \"engaged\" in the conversation and therefore it's \"hard\" to prove harassment had taken place. I was reeling from this. So No doesn't mean No after all in the legal sense. I shut him down when he crossed the line and I shut him down again when he escalated. He had harassed two others, we all three filed cases but it doesn't matter. In the eye of the lawyers, I \"engaged\" so therefore I must've wanted it.  \n\n  My trust was destroyed when he crossed the line, it was destroyed the second time when I followed company policy to submit the issue to HR and was fired for doing the right thing, it was destroyed once again when I realized that I wasted time even talking to a lawyer when they will simply say that I \"engaged\". I can see HR easily dismiss the other two cases now because they (my co-workers) had also \"engaged\" in very awkward conversations with him so therefore they must wanted it too.\n\n  The lessons I learned from all of these: 1. Don't trust HR; 2. Don't trust people; 3. Don't make friends; 4. Run the other way; 5. Never Engage; 6. Never Speak.  All negative.  None of the HR training on sexual harassment included \"don't speak to anyone you work with outside of work\", \"don't answer their texts\", \"any statement directed at you, you run and stop speaking\". Our society is still blaming the victims, it's still telling us that we, victims, don't matter. If someone flirt at you in a very subtle way and you can't tell if they're being nice or flirting, if it escalates to the point that you are uncomfortable and you try to stop it it's still your fault because you \"engaged\" in the conversation.\n\n  I just wanted to tell my story. I am going to keep moving forward and remind myself every day to breath.  I am going to keep looking for a new job and try not to get so broken that I can't function, every day is a struggle and every day there is something that hurts. I am glad that I do have very good friends that has supported me in this and are still there helping me get my life back. Maybe your company and your work place isn't like this and I say kudos to your work place and company and bosses. The rest that may have gone through something similar I want to say, you are brave and you have everything to live for.",
    "title": "When a man text/IM you and say \"I am having problems with my marriage\" - shut it down fast and run. Because to HR/lawyers no doesn't mean no.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1621902466,
    "score": 203,
    "keyword": "man lawyer"
  },
  {
    "text": "My lawyer tried to kiss me I’m not certain if this is the appropriate place for this but I’m uncertain of what to do in this situation. \n\nContext: The case my lawyer represented me in was against my rapist and trafficker. As multiple people were involved, the case is ongoing and my lawyer is still my legal representation. Despite this, I would say I and his other clients have become very friendly with the lawyer and view him as a trusted friend as well as legal representation. Maybe I need to take some blame here for allowing the personal and professional lines to blur but since knowing him, I thought he was the safest person to be around and didn’t think something like this would happen. \n\nRecently, while hanging out with him and several of his other clients (in a non professional setting) he and I wound up alone in the room I was staying at. We had been drinking heavily and talking all night but were both sobering up when he caught me off guard, cupped my face in his hand and leaned in to kiss me. I dodged the kiss and he kissed my face instead of my lips. I knew what was happening was wrong because he’s married, he and I are not on romantic terms, and he’s my attorney. A few minutes later he tried again and I did the same thing. After he left my room I realized I felt awful but I didn’t know why. I cried myself to sleep two days in a row after the incident without really knowing why I felt so bad. The following day after the kiss he caressed my lower back and waist several times throughout the day when the other clients weren’t looking. This made me feel uncomfortable and confused. I guess feel like he crossed a boundary and put me at risk of being taken advantage of. I cannot say for certain what would have happened if I kissed him back but the situation certainly had implications. It feels so wrong that someone who knows more than anyone else about what I’ve been through and the trauma it’s inflicted on me would even try and cross that boundary.  \n\nI don’t know what to do about the situation at all. I had hoped he would apologize to me but he hasn’t made a peep about the incident. I’ve thought about calling to talk to him about it but I’m worried about how he might take this considering the nature of the case he represents me in. I’m of course not accusing him of doing anything illegal; I just want him to know how it makes me feel that the one man I thought I could trust like a father almost would behave this way. Furthermore, him not addressing it with me makes me feel like he’s counting on my silence about it so he doesn’t have to deal with the embarrassment. This in particular really bothers me as he knows too well I was a silent victim for a long time  and let my abusers get away with what they did for many years.\n\nI don’t want to be silent anymore but I also don’t know what I can do. Should I have this discussion with him? Thank you to those who took the time to read and respond to this.",
    "title": "My lawyer tried to kiss me",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1639668630,
    "score": 188,
    "keyword": "man lawyer"
  },
  {
    "text": "Society has a problem in assuming male is default In one of my classes, the professor had a word problem that referenced the movie, *The Matrix*. In it, he said that the director of the movie wanted some sort of system of equations to make a specific shot more realistic.\n\nLet's ignore the fact that there were two directors for the movie, so the wording of the problem was already incorrect. Then later in the problem, the pronoun \"he\" was used to describe the director.\n\nIn case you didn't know, *The Matrix* was directed by two transgender women, the Wachowskis. So not only did my professor assume that *The Matrix* was directed by a man, but that in doing so, he misgendered them. I asked him after class to fix the mistake for future semesters, and although he did, he was a little bit defensive saying, \"Well *I* didn't know who directed the movie.\" But it's a vital piece of information. You shouldn't just mark someone down as using he/him pronouns when you don't even know who they are.\n\nAnd honestly, this is just one experience I've had of this nature. Society likes to assume that everyone who does anything of importance is male. Whenever someone has Dr. in their name, they are often assumed male. Whenever someone is a lawyer, they are often assumed male. There are more genders than just male and more pronouns than he/him!",
    "title": "Society has a problem in assuming male is default",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1632773074,
    "score": 172,
    "keyword": "man lawyer"
  },
  {
    "text": "First misogynistic experience I hope this is the correct place to post as I thought it might be a talking point. I'm also not sure if misogynistic is the correct word\n\nMy wife recently applied for a home loan, she will be fully paying it, the interest rate is based on her credit score and 90% of documentation is only filled in with her details, the 10% where I needed to fill in was the usual next of kin, spouse details, joint liability etc. Everywhere that has both our contact information has mine after my wife's.\n\nSince then everyone (realtor, lawyers, home owner) started phoning me instead of my wife probably because I am a man.\n\nThis is like a big version of the waiter putting the bill in front of me because I am the guy.\n\nAre women still treated this way?",
    "title": "First misogynistic experience",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1609790379,
    "score": 120,
    "keyword": "man lawyer"
  },
  {
    "text": "LEGAL HELP! Underage pictures of me were posted on 4chan along with my current Instagram! Some background info before I start, my Instagram is now private and I have changed my handle. I reported and emailed 4chan about this but have not yet seen a response. \n\nYesterday I got a weird influx of messages and followers on my public Instagram (which I use as both my personal account and a way to reach other women/advocate for living with PMDD, a chronic illness I’ve had my entire adult life). All these people were men’s burners accounts sending me unsolicited dick pics, and/or offering me money for nude pictures.  One of them was clearly a highschool boy (I am 24) and I essentially scared him into giving me a link to where he found me. It goes to /b random page on 4 Chan where there was my public Instagram page with my full name, and underage photos of me half naked from when I was 16, as well as pictures of me hiking, where my nipples are clearly showing through my sports bra. There were also numerous other females posted to this thread, quite obviously without permission. In the thread men were talking about how much they would love to stuff their c*cks into me and the other girls. And the man who posted my stuff said he “knew me for years” and I was “regular boner material”, and to also “message her sly anons with your big dicks I’m sure she’ll reply”. I have screenshots of everything but I don’t know what to do from here? I live in Washington State if that helps. The pictures of me my breasts and vaginal area are covered I’m in a towel, I’m afraid because they aren’t “true nudes” I won’t be able to do anything legally. Is there anything I can do? Who do I talk to? Would getting a lawyer help? Would 4 Chan be legally obligated to supply with an IP address if I took legal action? I would assume the police wouldn’t really take this seriously, but this kept me up all last night. I feel violated and just utterly disgusted, the things men do for a power trip is sick.",
    "title": "LEGAL HELP! Underage pictures of me were posted on 4chan along with my current Instagram!",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618595003,
    "score": 102,
    "keyword": "man lawyer"
  },
  {
    "text": "The pure insanity of the Texas SB8 fetal heartbeat bill Edit: any lawyers care to chime in here? Please correct me if I've got anything wrong in my assessment. I'll remove any misinformation \n\nEdit 2: this post seems to be a roller coaster of up and down votes. Some more comments and discussion would be nice. My tin foil hat suspects vote manipulation to keep this post hidden.\n\nEdit 3: changed three appellate court judges to six out of seventeen.\n\nThere's obviously been lots of buzz about the minimum $10000 civil liability written into this bill, but I suggest that everybody read the full text of the bill. \n\nCopied from one of my comments:\n\nHave you read the full text of the bill? I'm not a lawyer but it seems to be worded such that it can be used as a get out of jail free card card for rape. \n\n#1: if the plaintiff prevails, the defendant is liable for attorney fees and costs. However, if the defendant prevails, the plaintiff is **NOT** liable for the defendants attorney fees. \n\nHeads I win tails you lose.\n\n#2: burden of proof is on the defendant and is based on a **preponderance** of evidence\n\nSo subjective outcomes decided by a judiciary stacked with partisan far right extremists.\n\n#3: \n\n > (a)  Notwithstanding Section 171.005 or any other law, the requirements of this subchapter shall be enforced exclusively through the private civil actions described in Section 171.208.  No enforcement of this subchapter, and no enforcement of **Chapters 19 and 22, Penal Code, in response to violations of this subchapter**, may be taken or threatened by this state, a political subdivision, a district or county attorney, or an executive or administrative officer or employee of this state or a political subdivision against any person, except as provided in Section 171.208.\n\nThose are the sections of the Texas penal code regarding criminal homicide and assault including sexual assault.\n\n#4: it is worded such that an affirmative defense includes if an impregnation occurs as a result of rape or sexual assault.....but statistics show only 20% of sexual assaults are reported and that less than 1% of those result in a successful conviction. So 1/500 or .2%\n\n#5: the court ruling isn't finalized until after review by an appellate court, which was stacked with SIX OUT OF SEVENTEEN federal appellate judges by trump in the fifth circuit that covers Texas.\n\nThis bill is an all-out war against women. It's retaliation for the me too movement. I'd bring up more horrific sections but honestly the entirety of the bill is insane. \n\n#6: a plaintiff has standing if they **reasonably** believe the defendant **intends** to perform or induce an abortion. \n\nA man in Texas can now preemptively shield himself from being prosecuted for sexual assault or even criminal homicide if he files a lawsuit asserting that a woman intends to abort....does that mean women can be effectively murdered with impunity with abortion as the shield?\n\nAgain I'm not a lawyer, but that's my takeaway for this downright evil bill.",
    "title": "The pure insanity of the Texas SB8 fetal heartbeat bill",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1626364303,
    "score": 63,
    "keyword": "man lawyer"
  },
  {
    "text": "\"He was abused/ is ill.\" I'm sick of all the excuses assholes give out to negate the responsibility of abusers. (Rant) I read a news report of a man being sentenced for the sexual abuse of his sister-in-law and his daughter, and his asshole lawyer tried to negate the waste of oxygen's responsibility because of his \"appalling childhood, and drug addiction.\"   No, you don't get a pass to abuse women, and then try to blame other people.  You made the choice to hurt and abuse your daughter and sister-in-law, nobody else.\n\nThis is what frustrates me because people try to mitigate the responsibility of the perpetrator, and shift blame onto other people or the victim.  When Brittany Higgins came forward with her rape at the hands of a colleague, and a brainless bimbo tried to blame her for the attack, saying \"This is what happens when people drink too much.\"  No, this is another excuse trotted out to excuse the behaviour of a man who should be held accountable for his actions and crimes.\n\nEvery time you hear of abuse being committed against women and children, there is some creep excusing the actions of the perpetrator, because \"Boohoo, their parents didn't buy them the latest iPhone/video game/PS/Xbox etc.  They're the real victim!\" No, they are not.\n\nExcuses. excuses, excuses.  That is all it is, and I, for one, am sick and tired of hearing them.  Women are allowed to have a drink, go out and dance, and wear what they freaking want, without some asshole thinking that they deserve to be hurt, because someone has hurt the asshole, or more likely, had never been told \"No!\" in his entire life.",
    "title": "\"He was abused/ is ill.\" I'm sick of all the excuses assholes give out to negate the responsibility of abusers. (Rant)",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1618296784,
    "score": 50,
    "keyword": "man lawyer"
  },
  {
    "text": "Vent: seeing the man who raped me living a happy life Not sure where to put this, but I’ve got a lot of emotions and don’t want to make my friends listen to another vent about this person.\n\nOnce upon a time I dated and loved a man. Cut to the part where I discovered that his legal separation wasn’t as described and didn’t exist at all…leading to a confrontation and then violent rape.\n\n9 months of threats, stalking, begging, 300 texts a day, sleeping with younger girls and talking to them about me only to have them report my location, what I wore, who I was with…\n\nAnyways. I’ve had him blocked, reblocked, etc for years as he attempts contact and gets through once a year or so. \n\nI am finally in therapy, and just beginning to feel grounded enough to build back my life and emotional state. 5 years later. \n\nBut fuck social media. \nI just stumbled upon his girlfriend. She’s easily 20 years younger than him, and in law school. She’s beautiful and most assuredly a smart and lovely human. \nBut fuck him for feeling any romantic joy. \n\n\nThanks for letting me vent, Reddit. \n\n\n(As some may ask: statue of limitations has passed. Multiple lawyers advised against action as since there was consensual relationship and sex previous, that my case would likely turn very ugly towards me and was i ready for that? I chose no. I didn’t want to take on more trauma. I should mention this person is a well loved public figure in my area.)",
    "title": "Vent: seeing the man who raped me living a happy life",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1637104499,
    "score": 46,
    "keyword": "man lawyer"
  },
  {
    "text": "Jessica Jone's feminist and inclusive framing (Sorry about the grammar mistake on the title, how embarrassing.)\n\nSo I just finished watching Marvel's Jessica Jones, a Netflix original series that ran for 3 seasons of 13 episodes. I was quite late to the party, as it started in 2015 and ended in 2019, but what can I say, I'm a bit slow with these things.\n\nI found it to be very feminist and inclusive as a series, and wanted to write a rave talking about all the things that made it good in my eyes. I don't think I've ever seen a show like that. It felt like it was made for me, as a (bi) woman. I felt so SEEN by the show, if you know what I mean?\n\nThere will probably be things to criticize about the series, or problematic stuff I missed. I'd be more than happy to discuss all of that with you all as well.\n\nAlso, there's been hinting that some of these Netflix+Marvel shows could make a comeback, so I'm hoping to give a bit more attention to this one in hopes of it being reopened. It was left in a very delicious point when it ended, IMO, and I'd love to see more. And honestly, I just want more of this woman-oriented entertainment.\n\nI think I'll just list the things I wanted to talk about in no particular order, and elaborate on what I feel like. Feel free to add your own points!\n\n**Content warning:** as the show is very very grimdark and gritty, it does contain suicide, mentions of sexual coercion and some gore/murder. I will be discussing some of these topics as carefully as I can, but just so you know.\n\nThis post will contain some mild **spoilers** for all 3 seasons.\n\n&#x200B;\n\n1. **The female gaze**\n\nSomething I realized when I started the second season, was how devoid of the male gaze Jessica Jones the series felt. It was a big revelation, that I had to think about for a while before understanding what made this show feel so different. I'm just so used to having most of my entertainment filtered through the male lens, especially when it comes to action/superhero/crime stuff.\n\nThe female characters aren't depicted in the way I'm used to seeing. If they have a good reason to take their clothes off, for example, they will, but the shot isn't framed like we're supposed to be ogling her breasts and ass or whatever. We don't linger in the visuals of their uncovered body, they just put on a fresh shirt and that's that. Or they keep talking and the shot is focused on their face. None of that Megan Fox stuff, you know. Also, they never end up having their clothes strategically ripped during a fight or anything ridiculous like that.\n\nThe men are what's to be ogled. Every season Jessica has a new man pretty much, and they're all pretty hot. They all have at least four packs and when they take their shirts off, the center of the frame is their bodies. Many of the non-love interest male characters are also hot and have a couple scenes of them shirtless. And honestly, I love it. Not even as much because I want to watch shirtless muscle men, just because of principle. It's such a nice change of pace. Even 50 Shades didn't do it like this. And it's still done respectfully and sparingly.\n\nAnother thing that I only realized when I was watching this show. You know how in every movie and tv show when people are having sex, the woman is moaning and ooohhing and aaaahhing all over the place? Well, in this show it's the men. And I never really gathered before how silent and controlled most men in entertainment are. Because men are watching, men want to hear women's pleasure noises, they'd feel bad to hear the males enjoy themselves.Well okay, to be honest I think the men don't moan that much in JJ either. But there was this one scene where a man was really sounding like a real man does when he... finishes. And it was hot as hell, and I was like \"Wait, how come I've never heard that before on tv?\"\n\n&#x200B;\n\n**2. The Inclusivity**\n\nI'm not sure if having more women main characters goes under the umbrella of inclusivity, but I thought mentioning it here was sensible. So 3 of the 4 overarching main characters throughout all the seasons are women. (So Jessica, Trish and Jeri. Jeri being the genderbent version of the originally male comic character. Love it. And I'm counting Malcolm as the 4th main character, since he stays for the whole run of the show.) There are other important woman characters, especially the antagonist turned protagonist of season 2, and the mother of Trish. Also, many many of the side characters are women, much more than I've ever seen in any show save for maybe Orange Is The New Black.\n\nYes, most of those are white women. That could be better. The men's ratio is a bit better, I think. Malcolm is black, and we obviously start with Luke Cage being one of the main characters and the love interest of season 1. The second season love interest is hispanic I believe, and many more. Kith, Zaya, Cheng, Linda Chao, Griffin, Reva, and the amazing Gillian (played by trans activist Aneesh Sheth). Could be even more, and in even more important roles of course.\n\nI actually feel like most of the tertiary characters are POC, but then I always start wondering if it's just my white lens that makes me feel like that. You know, the same according to studies way men think there's more than 50% women in a picture, where it's actually like 25%. Nevertheless, I was so happily surprized in pretty much every episode, when cops, agents, lawyers, inmates and so on were POC women. And it was never questioned by anyone, these characters were just as respected and good at their jobs as everyone else. I really liked that.\n\nThere are also more confirmed gay characters than I'm used to seeing, and it's so great. The main character Jeri is lesbian, and her lesbian relationships and multiple women she courts are central plot elements in the show. And I have to say, the lesbian romances are never depicted in objectifying, fetishist ways like you might fear. They're shown as normal, complicated people loving, hating, and everything in between. There are sex scenes, yes, but again, the framing is so important. And it's always more about the emotions and sometimes intellectual schemes, not titillating.\n\nWe find out that the police officer helping Jessica is gay and in the process of adopting a child with his husband when we get to know him a little better. It doesn't really mean anything special that he's gay, when it comes to the plot, it's almost like he'd originally been written as having problems home with Martha or something, and the showrunners decided to tweak it a little for the better. Some characters just mention offhandedly that they're gay. No one really makes that a problem, and it never defines the characters. Again, there could be even more rainbow people in the show, but this is a lot better than I'm used to seeing.\n\n&#x200B;\n\n**3. The women are allowed to be real**\n\nI don't see normal looking people a lot on American tv and movies. It's more common in our Finnish entertainment or for example British. I guess that's one of the reasons why I was so impressed with the way especially women were shown in Jessica Jones.\n\nFirst, women are allowed to be old. (Or \"old\".) Many a character/actress are older than the 30 year old Hollywood \"mom\" age. It's so good. For example the mothers in the show actually look like they could be an adult's mom. They're still beautiful and more importantly, super talented, but it's just so refreshing to see them on screen. Carrie Ann Moss is in her 50's I believe, and instead of desperately trying to make her look younger, the show shows her as she is. Beautiful and powerful.\n\nAnother thing is the makeup. Jessica Jones does have heavy mascara on always, but I don't really mind it because it looks kind of like she's been sleeping in the makeup for a couple of nights. Maybe added a bit more on top. It doesn't look polished or perfect. The other main character, Trish, who as the pretty blonde actress could be expected to look made up at all times, has many scenes with barely any makeup on. I mean, the actress probably does have makeup on, but it doesn't look like it on screen. And I don't mean the \"only wearing neutral shades\" no makeup makeup, but actually looking like someone who just washed her makeup off when she comes from the shower. Little things like these make a really big difference in my opinion.\n\nAgain, not sure if this point fits here but I'm trying to condense a bit: their personalities and feelings are also realer than most women characters' on screen. They get angry, disappointed, confrontational, dominating, selfish. And none of that is shown as inherently bad. The characters also understand each other, and don't guilt or blame each other for having human feelings that aren't always pretty and convenient. It's actually been super weird to me to keep seeing Jessica be her abrasive, blunt, competent, no-nonsense self. Don't so many female characters in fiction who start out like that just... get buffed out until they're sweet and caring? Sometimes they find a man to teach them to be like real ladies, sometimes they at least find their softer side by themselves. And not that there's anything wrong with that, but I don't like how it happens to every controversial woman character. Or they die. Well, Jessica doesn't change.\n\n&#x200B;\n\n4. They know what it's like to be a woman\n\nMy last point, I swear.\n\nSo, like I said, the show is very, very gritty. One of it's main themes is addiction, and drugs and alcohol are in a big role. In my opinion as someone who hasn't been addicted to anyone, but who has worked with addicts, they do a very good job. They show the ugly and bad sides without wallowing or turning it into misery porn.\n\nAnother theme, especially in the 1st season, is... coercion? Rape. I guess we'll just call it what it is. As the main villain has a superpower to make anyone do anything even against their will, the question of consent is a very central one. The villain of course doesn't understand what he's doing is wrong, and there are a couple of scenes where Jessica screams at him that what he's doing is rape. It's very powerful to me.\n\nThe subject of rape comes up a couple of times during the show's run. In my opinion it's always handled as tastefully as this type of grimdark show allows. It is never shown, for one. It is only mentioned, almost as a concept and not descriptively. But the reactions of all the characters show how awful a thing it is. It's made clear to the viewer how disgusted every decent person is at hearing about it.\n\nAs a sexual abuse survivor, the reactions and feelings of the victims are realistic and feel true to me. I guess everyone is different, and obviously every reaction by a survivor is valid. But myself, I just wanted to move past those things. Not talk about them, not take anyone to court, nothing. But if someone went and punched them on my behalf, I would lie if I said I didn't feel some satisfaction. Which is pretty much exactly how Trish seems to view her abuser and survivorship. It's not pretty, it's not perfect, but it rings true to me. I appreciate how the show didn't go the route of \"solving\" the rape, like someone could \"save\" Trish from her past trauma. It just doesn't work like that. (I want to clarify that Trish's rape happened in the past of the show, not in real time.)\n\nAlso, there's the abortion subplot in season 1. I like how they handled that. The raped young woman was sure about her decision, and everyone else asked for confirmation once and then agreed with her. Sometimes it just goes like that. The subplot honestly brought some anxiety to me, but I think they handled it like they should have. (I hope this doesn't cause too much controversy in the comments.)\n\nJust about being a woman: there are some of these moments sprinkled throughout that made me feel like my life and experiences were valid. Like Jeri criticizing Chang about his weird obsession with Jessica: \"Yes, you lost to a woman, get over it!\" \\[paraphrazed\\] Sometimes it's just so obvious how certain men can't deal with being bested by women, and I'm glad they showed that.There were other similar things, but as this post is too fucking long already and it's one in the morning here, I think I'll leave this here. :D\n\nIf anyone had the patience to read all the way to the end, THANK YOU. Forgive any errors, English isn't my native language. And I hope we'll get some good discussion out of this, or at leas someone will find it interesting. I recommend checking out the show if you're intrigued. :)",
    "title": "Jessica Jone's feminist and inclusive framing",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1624312524,
    "score": 41,
    "keyword": "man lawyer"
  },
  {
    "text": "Fellow nurses, or anybody, Considering the elevated moral and ethical standards which we are held, Is there anything a colleague could do while off duty you consider to be so morally disgusting or corrupt that it would lead you to believe they are unfit to hold the title of RN? So, the title pretty much is the question, it says it all.\n\nPlease forgive my errors as thinking about this still makes my blood boil and I can't really think straight. And I'm tired and it's long post\n\nTLDR Three people. A registered nurse two a physician Three. I only know the guy's name, took my truck, A brand-new 2021 F 250 platinum. They were told that it must be back after breakfast. After four hours They Came back by the campsite with some guy I don't know to drop him off at his car that was 15 yards from the RV. I was sleeping in Then went to natural bridge caverns and then to Austin where they went clubbing and drove home drunk to the campsite. They never called, texted, or checked on me once from 8 AM to 2 AM, leaving me stranded in an RV that I rented and putting 330 miles on my brand-new truck that only had 800. The last time I saw. I watched dashcam videos All 30 that remain had something bad in them, whether it was the physician who was continually driver running my truck off the road hitting a curb. Some other object or just generally swerving and in about 70% of the videos. The nurse can be heard sitting in the back denigrating me over the pettiest things such as I like to talk about certain things too much. But in effect, it was just that I'm too annoying to be invited my own truck generally following it up with but I'm a good guy what does that say about the character? I know for a fact that the Texas Board of nursing mentions moral turpitude multiple times in the NPA\n\nSo, the reason I bring this up is last weekend. Memorial Day weekend on Sunday. I was camping I was part of an undisclosed group or club, whatever you want to call it, trying to maintain some level of anonymity. There were two separate groups' reasons which I will not explain That's a pretty dead giveaway to the location or club or event. \n\nAbout three weeks ago I bought a brand-new 2020 F-250 platinum four-wheel drive I was nearly in tears and having chest pains. As I was signing the loan documents. But I was in love with that truck, I still cry every time I have to make payment through. The sole reason I bought it was so that I can begin travel nursing And tow an RV Normally I'm a very cheap guy. I have always sworn I would never buy people for any reason, but the tiny truck that I had could barely Paul a utility trailer So an upgrade was much needed.  I could've gone use, but the 2021 year model introduced several things which I felt must have, one being the automatic emergency braking, which has already paid for itself twice over, As it also activates trailer brakes and the adaptive cruise control because it breaks for you as well but much earlier than the AEB. My dad was a mechanic in, car. I love car trucks too but I was genuinely fascinated by this machine, it features The power it put out, how big it was. The beauty,  the ridiculous little things that it offers that are so unnecessary but so cool.  naturally, I was showing it off every chance I get. I was like a kid just showing off their new toy I was literally fascinated. This part however is just a little bit of setup, explaining why I am so outraged.\n\nThe club which is being a part of has been planning this trip for them. We were given two options to or bring your own RVPersonally I hate tents so much so I would not have gone on this trip. If tents were the only option then we decided we wanted one to fit as many people as possible so I shelled out for $150 a night for expecting to be paid back easily campsite, however, was not cheap. We're talking $675for three days with all fees and everything included. I shelled out 1600 had 11 slots, all of which were expected to be full. That didn't happen. I ended up with only four and had been promising everyone they would only have to pay about $100. So I'm out of money to start. That's not the issue here. So the ride there three people wrote none of them had ever driven anything very small, so I lectured them at least three times on all of the reasons why they were not going to be driving my truck. They agreed we get there Friday night suffered a disaster. It's unrelated Saturday morning I wake up and my truck is but just as I woke up. They came back so I scolded them and let it go. Fast-forward to the middle of our float. The other campsite just happened to be mid float And one of the other guys that were in my RV wanted to go back and get his sandwich because nothing that the campsite was good. I kept trying to tell him that they'll leave us, we got ago we don't have enough times, etc., etc., etc. he follows me around like a puppy dog pitching the whole time about how he wanted his sandwich so I just couldn't take anymore and said fuck it let's go, Naturally, they were gone already. When we got back and I missed the rest of my trip. Since it was too late to float. I took the chance to go into town, which was quite a way away so that I may buy parts to repair my truck from Friday night's disaster. I cannot count how many texts I got from these three in the three hours I was gone as if I was their personal chauffeur. Saturday night comes, I'm having a great time so much so that I ended up bringing back an extra guest. I know this is getting long, but it's kinda hard to really tell it all without all the details here is where the morality question kicks in, though.\n\nEvery one of us was drunk, there's no denying some more than others Maybe. But we were all intoxicated RV that I rented had one private room. The master bedroom. Naturally, I took it. My newfound friend joined me and we closed the door. As this is a community of adults and nurses. I don't feel the need to explain why. But the whole time we were in there she kept saying I don't think the other girl likes me and that she (other nurse)Doesn't want me to be here hereAfter about 20 minutes, the other RN in the group Barges in on us without warning and proceeds to lecture and yell at us about how we are both drunk and cannot consent more or less calls me a rapist and then continues to lecture this girl. I didn't want to hear her shit so I went to the main part of the RV. I could hear a little bit of what she was saying most of it was just nasty mean girl talk interlaced with talks about how you can't decide on what you can do right now your Drunk, you'll regret it. Etc. etc. etc. I get up and go to the bathroom and just as the other nurse is finishing her rant had gone to the bathroom. I walked out and my friend is gone, it's 4 AM she's drunk. I'm concerned she had no clothes or shoes with her other than a bikini. So I drove up and down the only road looking and I could find her and after an hour I gave up. So I was up until about 6:30 AM. While the two other men in the group, one of whom is a Physician we will get to that in A second Were in bed at one and the and the nurse in bed by four at something like 8 AM the physician and the other male came into my room dug through my pockets for my keys and said we're taking the truck and I said the fuck you are which the respondent Says It will only be for second will be right that will be right back, We don't want to miss breakfast and I Don't want to wake you up. Knowing how persistently I would've been bothered this day, I caved and said y'all better be back after breakfast. I did not see my truck or any of these people again. 2 AM.\n\nOnce they got back. The nurse came and lay on my bed and asked if I was okay and I was dumbstruck. Obviously, I'm fine. But where have you been, She dodged that question by asking where I had been. She stated that they had been by the RV between 1130 and 1400 and I was gone. Having not caught Onto the game yet I just said\"right here, I don't even think of gotten up to pee today\" She insisted that I had been gone. I said no. She said no, you were gone. We looked for you. We couldn't find you. You are you. My response again was no. I was here in this bed. At this point, she is still trying to play nice and sweet and she asked me are you okay Are you were here like did something happen? I smelled BSAnd now I'm mad so I told her okay if you're going to call me stupid just come out and say It. She scoffed and walked away saying I'mNotGoing to dothis with you. Five minutes later she walks into my room throws herself on my bed and proceeds to lecture me that she is not my friend from last night and that if I touch her bad things are gonna happen. The rest of the night was uneventful, but the first thing I did when I got up as I went and I inspected my truck. It wasn't about the same condition that I left it, except it reeked of booze and the first thing I reach for was my Dashcam. I couldn't really pull much from it the but I was able to determine that they had taken my truck far away never came back after breakfast and had gone all the way to Austin from New Braunfels. Once we finally got back to Houston with the SD card. My PC took a few days but it and what I found absolutely enraged me. Unfortunately, I lost a lot of the video from the previous day. It had been overwritten on the ride home butting home. The truck experiences a shock, that period of time gets locked so that is most of where my data came from. I found out that they unplugged or turned off the dashcam at 1420 and that they left the other campsite at 1110. This is the first video. In this video you can see them driving down the road with some mother fuckerI've never met before in my truck And they are dropping him off at his car, which just so happens to be about 15 yards from the RV which I'm sleeping. What did they do? They backed up and left me immediately Proceeding to natural bridge caverns. Every video that I saw was very similar. The physician was driving the other man was not seen and the nurse was sitting in the back. In every video, you can hear the nurse talking about me negatively in many different ways, mostly about my money. They seem to think that when I'm showing off my truck. I'm trying to say. Oh, look at me I'm rich so there will video contained lots of shit talkingAbout me and how I spend my money and how I think I'm a Highroller in this and that and where I got all that and I must've got money when my dad died because I talk about Is my truck and insurance money. It is true I have a story I tell Quite often about beating an insurance company. yes, it involves money but I'm not telling that story to say oh I'm rich!. Really I love to tell that story because I have very low self-esteem and I feel like I Ruin everything and can't do anything right, And the fact that II could reverse an insurance company's decision overriding the one good argumentative letter is one of the few things I'm I've done that I'm proud of. I mean an insurance companies Wholebusiness business model revolves around having people pay in and finding ways not to pay out so I was very proud of the fact that I was able to be such a powerful company that has so much money with a single letter. That is why I love that story not because I'm trying to brag truthfully, the majority of the money I spend comes from overtime, which can get really lucrative as most of you know I also have a very low mortgage and multiple renters along with the fact that before this F250. I always drove cheap cars and saved a lot of money. But to get back on track. This physician wanted to carpool with me because he did not want to put miles on his Mercedes So much so that he refused to drive it 6 miles to my house. Yet he did not mind whatsoever putting Nearly 50% of them. I was on my truck, meaning when I last saw it. It had 800 miles. The next morning the odometer read 1110. These two and everybody else left me in the camper by myself all day Sunday. No call, no text, no nothing. When I texted the physician and asked why my truck was not brought back after breakfast. His response was, and I quote \"But Eric, You did not tell us you need the truck back ASAP\" I don't even remember what I said after that because I was so mad. There were no more involved but my main grief lives with the physician and nurse. Because in every single video you can hear them denigrating me so you can't say they forgot about me. Apparently, I am so annoying that I can even be brought on a trip in my own vehicle that I've been trying to get them to understand is while they were not caught by the police. They in fact committed a felony. See we live in Texas. Texas honors any verbal agreement as a legally binding contract. Therefore, when they left with my truck and I told them the truck has to be back after breakfast. That in itself was a legally binding contract. So the second they went somewhere else. After breakfast, they were breaking the law. In addition, the legal definition of theft in Texas includes deprivation, I can't quote exactly, but it says the meaning of depriving is to deny the owner. The use of their vehicle to which an extent that they lose the majority of value or enjoyment of their vehicle for an extended period of time. The extended period time clause year is key because it is relative, As we were only there for the weekend, depriving me of my vehicle for an entire day would be an extended period of time under the law. I went so far as to contact the district attorney who freely admitted that a crime had been committed, but since they were not arrested. She wouldn't do anything I'm Pissed and I want justice would be wrong for anyone to do this, but a physician and a registered nurse??? they took my brand-new vehicle 330 miles broke a legally binding contract committed theft, lied to me and so much more I can barely type. In fact, a million typing I'm using a voice-to-speech thing and I just keep freezing just because I'm so damn mad\n\nnow that's the story. This brings us back around to the question at hand because I for one do not feel that either of them are fit for their profession I must admit that I may Bebiased because I'm the one that is affected but what kind of thought process must someone have, think that's okay. Like how can you go from being a nurse who is literally trusted with lives to a person that could do that. Put yourself in my shoes and imagine how it would feel seeing those videos of these people riding around in your new $85,000 truck that you are so proud of and can barely afford to listen to them talk shit about you the whole way Like just petty things like were back in high school like I like to talk about my truck too much or I try to post or try to pretend like I'm rich this is that is a good guy. They will admit I like the guy, you know, I'm just apparently so annoying and my conversational skills are so bad that I don't deserve to be invited Into my own vehicle. I blocked the nurse that night, so I haven't spoken to her. I tried to extract information from the physician and get him to admit that he had said he would bring the truck after breakfast But he won't. So I tried to get the third guy to say that he had heard that. So I sent him links to the video of the physician running my truck off the road and into things and all the times he hit curves and all of the things they said about me and how that how would that make you feel I was Hannah ranting at this point, but that's irrelevant in his response was 'your drunk' I told him you know what man I never saw you in any of the videos so I thought you were the good one so I was going to leave you out of this, but what you just said to me right now. After I poured my heart out to you shows me what a piece of trash you are. So I will not be speaking to you again but expect to hear from my lawyer that was about 30 minutes ago right before I started this post. That's it\n\nthis brings me back to my question. If you read my whole post what you think?as nurses were supposed to be compassionate and caring, and put others first were supposed to be truthful and honest. In fact, I'm pretty sure most state nurse practice acts less list theft, deceit, and fraud as things that call for instant revocation depending on the circumstances. I know for a fact that in Texas you can lose your license for a simple lie. Granted, it would have to be over something pretty serious, but generally, you can do something even worse. But as long as you tell the truth, you may come out without consequence. It's all about honesty. Think about the way these two treated my vehicle. They knew good and well how expensive that the, they most certainly knew how much it meant to me considering one of the reasons that they disdain me is because I speak of my truck too much. Like I truly just don't get it, but how were these two people fit for their profession. I don't believe they deserve the at their titles. I generally genuinely don't. There are some things where there is a gray area. There is no gray area here, they crossed the line again and again and again.",
    "title": "Fellow nurses, or anybody, Considering the elevated moral and ethical standards which we are held, Is there anything a colleague could do while off duty you consider to be so morally disgusting or corrupt that it would lead you to believe they are unfit to hold the title of RN?",
    "subreddit": "nursing",
    "timestamp": 1623137422,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "I put together a list of various YouTube channels **Biology:**\n\n* [Journey to the Microcosmos](https://www.youtube.com/c/microcosmos/videos) \\- microbiology, microscopy\n* [Deep Look](https://www.youtube.com/user/KQEDDeepLook/videos) \n* [Crime Pays But Botany Doesn't](https://www.youtube.com/c/CrimePaysButBotanyDoesnt/videos) \\- botany\n* [Animalogic ](https://www.youtube.com/channel/UCwg6_F2hDHYrqbNSGjmar4w/videos)\n* [Microbehunter](https://www.youtube.com/c/Microbehunter/videos) \\- microscopy, microbiology\n* [PBS Eons](https://www.youtube.com/channel/UCzR-rom72PHN9Zg7RML9EbA/videos) \\- ancient history\n* [Natural World Facts ](https://www.youtube.com/user/NaturalWorldFacts/videos)\n* [zefrank1 ](https://www.youtube.com/c/zefrank/videos)\n* [Basin79](https://www.youtube.com/c/Basin79/videos) \\- spiders\n* [Ben G Thomas ](https://www.youtube.com/c/BenGThomas/videos)\n* [AntsCanada ](https://www.youtube.com/user/AntsCanada/videos)\\- ants\n* [Anthill Art ](https://www.youtube.com/c/Anthillart/videos)\n* [TierZoo](https://www.youtube.com/c/TierZoo/videos)\n* [Made in the Wild](https://www.youtube.com/c/MadeintheWild/videos) \\- zoology\n* [Stated Clearly](https://www.youtube.com/c/StatedClearly/videos)\n* [MBARI ](https://www.youtube.com/user/MBARIvideo/videos)\\- marine biology\n* [Anthöny Pain](https://www.youtube.com/c/Anth%C3%B6nyPain/videos)\n* [Nature on PBS ](https://www.youtube.com/c/naturepbs/videos)\n* [BBC Earth ](https://www.youtube.com/c/bbcearth/videos?view=0&sort=p&flow=grid)\n* [Quaoar Power](https://www.youtube.com/c/QuaoarPower/videos)\n* [Animal Fact Files](https://www.youtube.com/c/AnimalFactFiles/videos)\n* [Cornell Lab of Ornithology](https://www.youtube.com/c/LabofOrnithology/videos?view=0&sort=p&flow=grid)\n* [Planet Fungi](https://www.youtube.com/c/PlanetFungi/videos)\n\n**Physics:**\n\n* [Physics Girl](https://www.youtube.com/c/physicsgirl/videos)\n* [Fermilab ](https://www.youtube.com/user/fermilab/videos)\n* [Physics Videos ](https://www.youtube.com/user/EugeneKhutoryansky/videos)\n* [DrPhysicsA](https://www.youtube.com/user/DrPhysicsA/videos)\n* [Minutephysics](https://www.youtube.com/user/minutephysics/videos)\n* [For the Allure of Physics](https://www.youtube.com/channel/UCliSRiiRVQuDfgxI_QN_Fmw/videos)\n\n**Chemistry:**\n\n* [Periodic Videos](https://www.youtube.com/user/periodicvideos/videos) \n* [NileRed](https://www.youtube.com/user/TheRedNile/videos)\n* [NileBlue](https://www.youtube.com/c/NileRed2/videos)\n\n**General Science:**\n\n* [Veritasium](https://www.youtube.com/c/veritasium/videos)\n* [The Science Asylum ](https://www.youtube.com/user/TheScienceAsylum/videos)\n* [The Action Lab ](https://www.youtube.com/c/TheActionLab/videos)\n* [Steve Mould](https://www.youtube.com/c/SteveMould/videos)\n* [Domain of Science ](https://www.youtube.com/user/dominicwalliman/videos)\n* [Sci Show](https://www.youtube.com/user/scishow/videos)\n* [Minute Earth](https://www.youtube.com/c/minuteearth/videos)\n* [Real Science](https://www.youtube.com/c/realscience/videos)\n* [Sixty Symbols](https://www.youtube.com/user/sixtysymbols/videos)\n* [Alpha Phoenix](https://www.youtube.com/c/AlphaPhoenixChannel/videos)\n* [It's Okay To Be Smart ](https://www.youtube.com/user/itsokaytobesmart/videos)\n* [Up and Atom](https://www.youtube.com/channel/UCSIvk78tK2TiviLQn4fSHaw/videos)\n* [Arxiv Insights](https://www.youtube.com/channel/UCNIkB2IeJ-6AmZv7bQ1oBYg/videos)\n* [Nottinghamscience](https://www.youtube.com/user/nottinghamscience/videos)\n* [Sabine Hossenfelder ](https://www.youtube.com/c/SabineHossenfelder/videos)\n* [BackstageScience](https://www.youtube.com/user/BackstageScience/videos)\n* [Sciencephile the AI](https://www.youtube.com/channel/UC7BhHN8NyMMru2RUygnDXSg/videos)\n* [Verge Science ](https://www.youtube.com/channel/UCtxJFU9DgUhfr2J2bveCHkQ/videos)\n\n**Anatomy:**\n\n* [Institute of Human Anatomy ](https://www.youtube.com/c/InstituteofHumanAnatomy/videos)\n* [Armando Hasudungan](https://www.youtube.com/user/armandohasudungan/videos)\n\n**Science Experiments and Building Stuff:**\n\n* [Applied Science ](https://www.youtube.com/user/bkraz333/videos)\n* [Thought Emporium](https://www.youtube.com/user/TheChemlife/videos)\n* [StuffMadeHere](https://www.youtube.com/c/StuffMadeHere/videos)\n* [Tech Ingredients](https://www.youtube.com/user/TechIngredients/videos)\n* [Mark Rober](https://www.youtube.com/user/onemeeeliondollars/videos)\n* [Cody's Lab](https://www.youtube.com/user/theCodyReeder/videos)\n* [TheBackyardScientist ](https://www.youtube.com/user/TheBackyardScientist/videos)\n* [The Post Apocalyptic Inventor ](https://www.youtube.com/channel/UCDbWmfrwmzn1ZsGgrYRUxoA/videos)\n\n**Math:**\n\n* [3Blue1Brown](https://www.youtube.com/channel/UCYO_jab_esuFRV4b17AJtAw/videos)\n* [Numberphile ](https://www.youtube.com/user/numberphile/videos)\n* [Eddie Woo](https://www.youtube.com/c/misterwootube/videos) \n* [Vihart](https://www.youtube.com/user/Vihart/videos)\n* [Stand-up Maths ](https://www.youtube.com/user/standupmaths/videos)\n* [Mathologer](https://www.youtube.com/c/Mathologer/videos)\n* [patrickJMT](https://www.youtube.com/user/patrickJMT/videos)\n\n**Engineering and Electronics:**\n\n* [EngineerGuy](https://www.youtube.com/user/engineerguyvideo/videos)\n* [Mr Carlson's Lab ](https://www.youtube.com/user/MrCarlsonsLab/videos)\n* [Simply Electronics ](https://www.youtube.com/user/sutty6/videos)\n* [Technology Connections](https://www.youtube.com/channel/UCy0tKL1T7wFoYcxCe0xjN6Q/videos?view=0&sort=p)\n* [styropyro ](https://www.youtube.com/user/styropyro/videos)\n* [Real Engineering](https://www.youtube.com/channel/UCR1IuLEqb6UEA_zQ81kwXfg/videos)\n* [The Engineering Mindset](https://www.youtube.com/c/Theengineeringmindset/videos)\n* [Practical Engineering ](https://www.youtube.com/user/gradyhillhouse/videos)\n* [How To Mechatronics ](https://www.youtube.com/user/DejanNedelkovski/videos)\n* [AvE](https://www.youtube.com/c/arduinoversusevil2025/videos)\n* [DiodeGoneWild](https://www.youtube.com/channel/UCQak2_fXZ_9yXI5vB_Kd54g/videos)\n* [SeanHodgins ](https://www.youtube.com/channel/UCE-bw6PRKuDlH6fP1mP4nOw/videos)\n* [GreatScott!](https://www.youtube.com/user/greatscottlab/videos)\n* [Afrotechmods ](https://www.youtube.com/user/Afrotechmods/videos)\n* [Zilipoper](https://www.youtube.com/user/zilipoper/videos)\n* [Vidduley](https://www.youtube.com/channel/UCnSqwyD8RmO-nX1EF_UJXaw/videos)\n* [JerryRigEverything ](https://www.youtube.com/c/JerryRigEverything/videos)\n* [Kyle.Engineers](https://www.youtube.com/c/KYLEDRIVES/videos)\n* [Engineering Explained ](https://www.youtube.com/user/EngineeringExplained/videos)\n* [ElectroBOOM ](https://www.youtube.com/c/Electroboom/videos)\n* [Esperantanaso](https://www.youtube.com/user/Esperantanaso/videos)\n\n**Computer Science:**\n\n* [Ben Eater ](https://www.youtube.com/user/eaterbc/videos)\n* [Two Minute Papers ](https://www.youtube.com/user/keeroyz/videos)\n* [Sebastian Lague ](https://www.youtube.com/c/SebastianLague/videos)\n* [sentdex ](https://www.youtube.com/user/sentdex/videos)\n* [Computerphile](https://www.youtube.com/user/Computerphile/videos)\n* [jdh](https://www.youtube.com/c/jdhvideo/videos)\n* [george hotz archive](https://www.youtube.com/c/georgehotzarchive/videos)\n* [freeCodeCamp ](https://www.youtube.com/c/Freecodecamp/playlists?view=1&sort=dd&shelf_id=0)\\- learn to code\n\n**Space:**\n\n* [Anton Petrov](https://www.youtube.com/c/whatdamath/videos)\n* [Everyday Astronaut ](https://www.youtube.com/channel/UC6uKrU_WqJ1R2HMTY3LIx5Q/videos)\n* [Jared Owen ](https://www.youtube.com/user/captainranic/videos)\n* [SEA](https://www.youtube.com/channel/UCG9ShGbASoiwHwFcLcAh9EA/videos)\n* [PBS Space Time](https://www.youtube.com/c/pbsspacetime/videos)\n* [Deep Sky Videos](https://www.youtube.com/user/DeepSkyVideos/videos)\n* [Dr. Becky ](https://www.youtube.com/c/DrBecky/videos)\n* [Isaac Arthur ](https://www.youtube.com/channel/UCZFipeZtQM5CKUjx6grh54g/videos)\n* [Sci Show Space](https://www.youtube.com/user/scishowspace/videos)\n* [Astrum ](https://www.youtube.com/user/astrumspace/videos)\n* [Cool Worlds](https://www.youtube.com/c/CoolWorldsLab/videos)\n\n**Iconic:**\n\n* [SethEverman ](https://www.youtube.com/user/SethEverman/videos)\n* [Dillon The Hacker](https://www.youtube.com/c/DillonTheHackerisgod/videos)\n* [bill wurtz  ](https://www.youtube.com/user/billwurtz/videos)\n\n**Lectures:**\n\n* [Crash Course](https://www.youtube.com/c/crashcourse/videos)\n* [Khan Academy ](https://www.youtube.com/c/khanacademy/videos)\n* [AK Lectures](https://www.youtube.com/c/AKLECTURES/playlists)\n* [MIT OpenCourseWare](https://www.youtube.com/c/mitocw/videos)\n* [The Organic Chemistry Tutor](https://www.youtube.com/c/TheOrganicChemistryTutor/videos)\n* [Bozeman Science](https://www.youtube.com/user/bozemanbiology/videos) \\- physics, biology\n* [YaleCourses](https://www.youtube.com/user/YaleCourses/playlists)\n* [Harvardphysics](https://www.youtube.com/user/harvardphysics/videos)\n* [Professor Leonard](https://www.youtube.com/c/ProfessorLeonard/videos)\n\n**General Explanation:**\n\n* [Kurzgesagt - In a Nutshell](https://www.youtube.com/c/inanutshell/videos)\n* [Wendover Productions](https://www.youtube.com/user/Wendoverproductions/videos)\n* [Joe Scott](https://www.youtube.com/c/joescott/videos)\n* [D!NG](https://www.youtube.com/channel/UClq42foiSgl7sSpLupnugGA/videos)\n* [Half as Interesting](https://www.youtube.com/c/halfasinteresting/videos)\n* [Tom Scott](https://www.youtube.com/c/TomScottGo/videos)\n* [New Mind ](https://www.youtube.com/channel/UC5_Y-BKzq1uW_2rexWkUzlA/videos)\n* [Vsauce ](https://www.youtube.com/user/Vsauce/videos)\n* [Vsauce2 ](https://www.youtube.com/user/Vsauce2/videos)\n* [TED-Ed](https://www.youtube.com/user/TEDEducation/videos) \n\n**Graphic Design, Motion, and 3D:**\n\n* [Motion Science](https://www.youtube.com/c/MotionScience/videos)\n* [Texturelabs ](https://www.youtube.com/c/Texturelabs/videos)\n* [Video Copilot ](https://www.youtube.com/user/videocopilot/videos)\n* [Spoon Graphics ](https://www.youtube.com/c/spoongraphics/videos)\n\n**Motivation:**\n\n* [Mateusz M](https://www.youtube.com/user/TheMiro0r/videos)\n\n**Music:**\n\n* [Harry Mack](https://www.youtube.com/c/HarryMack/videos)\n* [DOMi & JD Beck](https://www.youtube.com/c/DOMiJDBeck/videos)\n* [CharlesBerthoud ](https://www.youtube.com/channel/UCAi_uNeDWRXj8C8yw358gWw)\n* [Daniel Thrasher ](https://www.youtube.com/c/danielthrasher/videos)\n* [The Dooo](https://www.youtube.com/c/TheDooo/videos)\n* [Markus Veltri](https://www.youtube.com/c/MarcusVeltri/videos)\n* [Marc Rebillet ](https://www.youtube.com/c/MarcRebillet/videos)\n* [Kyle Landry](https://www.youtube.com/c/kylelandry/videos)\n* [Tony Ann](https://www.youtube.com/user/tonyannmusic/videos)\n* [lara6683 ](https://www.youtube.com/c/lara6683/videos)\n* [Majestic Casual ](https://www.youtube.com/c/majesticcasual/videos)\n* [MrSuicideSheep ](https://www.youtube.com/user/MrSuicideSheep/videos)\n* [Mariana Froes](https://www.youtube.com/c/mariffroes/videos)\n* [ibi ](https://www.youtube.com/c/ibiBerlin/videos)\n* [Fkj](https://www.youtube.com/channel/UCxqkOxQYocXRtSqlotgXh7w/videos)\n* [steezyasfuck](https://www.youtube.com/c/steezyasfvck/videos)\n\n**Chill:**\n\n* [Reid Gower](https://www.youtube.com/user/damewse/videos)\n* [Macro Room ](https://www.youtube.com/c/MacroRoom/videos)\n* [Hsinchuen Lin](https://www.youtube.com/c/hsinchuen/videos)\n* [Ingleton Pottery ](https://www.youtube.com/c/IngletonPottery/videos)[ ](https://www.youtube.com/user/billwurtz/videos)\n* [Yukikawae](https://www.youtube.com/channel/UCLGSpxD0XXHnbXtDJJqMqDw/videos)\n* [Kraig Adams ](https://www.youtube.com/c/KraigAdams/videos)\n\n**Outdoors:**\n\n* [Primitive Technology ](https://www.youtube.com/channel/UCAL3JXZSzSm8AlZyD3nQdBA/videos)\n* [AlfieAesthetics](https://www.youtube.com/user/AlfieAesthetics/videos)\n* [Learn Your Land ](https://www.youtube.com/c/LearnYourLand/videos)\n* [Yellow Elanor](https://www.youtube.com/c/YellowElanor/videos)\n* [Paul Stamets ](https://www.youtube.com/c/paulstametsofficial/videos)\n\n**History:**\n\n* [Sam O'Nella Academy ](https://www.youtube.com/channel/UC1DTYW241WD64ah5BFWn4JA/videos)\n* [Dan Carlin](https://www.youtube.com/user/dancarlinpodcaster/videos)\n* [Historia Civilis ](https://www.youtube.com/c/HistoriaCivilis/videos)\n* [Military History Visualized ](https://www.youtube.com/c/MilitaryHistory/videos)\n* [HistoryMarche ](https://www.youtube.com/c/HistoryMarche/videos)\n* [OverSimplified](https://www.youtube.com/c/OverSimplified/videos)\n* [Fire of Learning](https://www.youtube.com/user/Fireoflearning/videos)\n* [The Great War ](https://www.youtube.com/c/TheGreatWarSeries/videos)\n* [Drachinifel](https://www.youtube.com/c/Drachinifel/videos)\n\n**Documentaries:**\n\n* [Channel 5 with Andrew Callaghan ](https://www.youtube.com/c/Channel5YouTube/videos)\n* [FRONTLINE PBS | Official ](https://www.youtube.com/c/frontline/videos)\n* [All Gas No Brakes](https://www.youtube.com/channel/UCtqxG9IrHFU_ID1khGvx9sA/videos)\n* [kimgary](https://www.youtube.com/channel/UCOuf_kStlWnhuauw4ce8l-w)\n\n**Blue Collar:**\n\n* [ChrisFix](https://www.youtube.com/c/chrisfix/videos)\n* [HVAC-R Videos](https://www.youtube.com/c/HVACRVIDEOS/videos)\n* [Speedkar99](https://www.youtube.com/c/speedkar99/videos)\n* [AC Service Tech LLC](https://www.youtube.com/c/acservicetechchannel/videos)\n* [HVAC School](https://www.youtube.com/c/HVACSchool/videos)\n* [Word of Advice TV](https://www.youtube.com/c/WordofAdviceTV/videos)\n* [MikeHoltNEC](https://www.youtube.com/c/MikeHoltNEC/videos)\n\n**Comedy:**\n\n* [Vlog Creations ](https://www.youtube.com/c/VlogCreations/videos)\n* [Casually Explained ](https://www.youtube.com/c/CasuallyExplained/videos)\n* [Internet Comment Etiquette](https://www.youtube.com/user/commentiquette/videos)\n* [Alex Ernst ](https://www.youtube.com/user/TheAlexErnstShow/videos)\n* [surreal entertainment ](https://www.youtube.com/c/surrealentertainment/videos)\n* [twomad ](https://www.youtube.com/c/threemad/videos)\n* [Berd ](https://www.youtube.com/c/Berdboi/videos)\n\n**Other:**\n\n* [Lemmino](https://www.youtube.com/user/Top10Memes/videos)\n* [melodysheep ](https://www.youtube.com/user/melodysheep/videos)\n* [Exurb1a](https://www.youtube.com/user/willunicycleforfood/videos)\n* [Dictionary of Obscure Sorrows](https://www.youtube.com/user/obscuresorrows/videos)\n* [Internet Historian ](https://www.youtube.com/channel/UCR1D15p_vdP3HkrH8wgjQRw/videos)\n* [Company Man](https://www.youtube.com/channel/UCQMyhrt92_8XM0KgZH6VnRg/videos) \n* [Objectivity ](https://www.youtube.com/c/ObjectivityVideos/videos)\n* [Booking Hunter TV ](https://www.youtube.com/user/BookingHunterTV/videos)\n* [NightHawkInLight](https://www.youtube.com/c/Nighthawkinlight/videos)\n* [Incognito Mode](https://www.youtube.com/channel/UC8Q7XEy86Q7T-3kNpNjYgwA/videos)\n* [Sharkee](https://www.youtube.com/user/AhSharkee/videos)\n* [Mikasacus ](https://www.youtube.com/channel/UCIWEHR8n8GiLMWY8v7IP0Gg/videos)\n* [Thomas Schwenke ](https://www.youtube.com/user/ehochzwei/videos)\n* [Frost ](https://www.youtube.com/c/FrostV45/videos)\n* [Ahoy ](https://www.youtube.com/user/XboxAhoy/videos)\n* [LockPickingLawyer ](https://www.youtube.com/c/lockpickinglawyer/videos)\n* [EdwardCurrent](https://www.youtube.com/user/EdwardCurrent/videos)\n* [BG Kumbi](https://www.youtube.com/c/BGKumbi/videos)\n* [Disrupt ](https://www.youtube.com/c/DisruptReality/videos)\n* [Simply Explained](https://www.youtube.com/c/Savjee/videos)\n* [EdisonTechCenter](https://www.youtube.com/user/EdisonTechCenter/videos)\n* [Captain Disillusion ](https://www.youtube.com/c/CaptainDisillusion/videos)\n* [Robin Baumgarten](https://www.youtube.com/c/RobinBaumgarten/videos)\n* [Daily Dose Of Internet ](https://www.youtube.com/c/DailyDoseOfInternet/videos)\n* [Sciencium](https://www.youtube.com/user/sciencium/videos)\n* [xkcdHatGuy](https://www.youtube.com/c/xkcdHatGuy/videos)\n* [The Slow Mo Guys ](https://www.youtube.com/user/theslowmoguys/videos)\n* [Michael Reeves ](https://www.youtube.com/c/MichaelReeves/videos)\n\n**Podcasts:**\n\n* [Materialism](https://podcasts.google.com/feed/aHR0cHM6Ly9waW5lY2FzdC5jb20vZmVlZC9tYXRlcmlhbGlzbQ?sa=X&ved=0CBoQ27cFahcKEwjgj5L-4Kr0AhUAAAAAHQAAAAAQQg) \\- material science\n* [Lex Fridman ](https://www.youtube.com/c/lexfridman/videos)\\- long form podcasts with the world's greatest minds\n* [Old Radiolab](https://www.wnycstudios.org/podcasts/radiolab/radiolab-memorable-episode-results) \\- listen to any episodes from 2017 and before\n* [After On - Rob Reid](https://podcasts.google.com/feed/aHR0cHM6Ly9hZnRlcm9uLmxpYnN5bi5jb20vcnNz) \\- science and technology\n* [Hardcore History](https://podcasts.google.com/feed/aHR0cHM6Ly9kY2hoYWRkZW5kdW0ubGlic3luLmNvbS9yc3M) \\- history in depth\n* [The Anthropocene Reviewed](https://podcasts.google.com/feed/aHR0cDovL2ZlZWRzLndueWMub3JnL1RoZUFudGhyb3BvY2VuZVJldmlld2Vk) \\- reviewing aspects of earth on a 5 star scale\n* [Ologies](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5mZWVkYnVybmVyLmNvbS9PbG9naWVz) \\- interviewing people with different science jobs\n* [50 things that made the modern economy](https://www.bbc.co.uk/programmes/p04b1g3c/episodes/downloads)\n* [Speaking of bitcoin](https://podcasts.google.com/feed/aHR0cDovL2ZlZWRzLnNvdW5kY2xvdWQuY29tL3VzZXJzLzM1MTM2NzYxLW1pbmR0b21hdHRlci90cmFja3M) \\- general cryptocurrency discussion\n* [30 animals that made us smarter](https://podcasts.google.com/feed/aHR0cHM6Ly9wb2RjYXN0cy5maWxlcy5iYmNpLmNvLnVrL3cxM3h0dHc3LnJzcw)\n* [This podcast will kill you](https://podcasts.google.com/feed/aHR0cHM6Ly93d3cub21ueWNvbnRlbnQuY29tL2QvcGxheWxpc3QvYWFlYTRlNjktYWY1MS00OTVlLWFmYzktYTk3NjAxNDY5MjJiLzkzZTI3MWJmLTU3ZGEtNDUyNi05MzdhLWFiMDQwMDI0MzczMi8xNWI2OWRhMS0yMDAwLTRmMzUtYTNlYy1hYjA0MDAyNDM3NGYvcG9kY2FzdC5yc3M) \\- disease and epidemiology\n* [Unscrypted Podcast](https://podcasts.google.com/feed/aHR0cHM6Ly9hYW50b25vcC5jb20vY2F0ZWdvcnkvcG9kY2FzdHMvdW5zY3J5cHRlZC1wb2QvZmVlZC9wb2RjYXN0Lw) \\- explanation of cryptocurrency\n* [Big Biology ](https://podcasts.google.com/feed/aHR0cHM6Ly93d3cuYmlnYmlvbG9neS5vcmcvcnNzLWZlZWQ_Zm9ybWF0PXJzcw)\\- biology \n* [Stuff to blow your mind](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vc3R1ZmZ0b2Jsb3d5b3VybWluZA) \\- random cool stuff\n* [Invention](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vSFNXODkzNjQ0MDYyNw) \\- exploring different inventions\n* [TWIV](https://podcasts.google.com/feed/aHR0cDovL3R3aXYubWljcm9iZXdvcmxkLmxpYnN5bnByby5jb20vdHdpdg) \\- the current state of virology\n* [Astronomy Cast](https://podcasts.google.com/feed/aHR0cHM6Ly9hc3Ryb25vbXljYXN0LmxpYnN5bi5jb20vcnNz) \\- astronomy\n* [Origin Stories](https://podcasts.google.com/feed/aHR0cHM6Ly9vcmlnaW5zdG9yaWVzLmxpYnN5bi5jb20vcnNz) \\- evolution, anthropology\n* [Life's Little Mysteries](https://podcasts.google.com/feed/aHR0cHM6Ly9hdWRpb2Jvb20uY29tL2NoYW5uZWxzLzUwMTY3NjMucnNz) \\- general science\n* [Daniel and Jorge explain the universe](https://podcasts.google.com/feed/aHR0cHM6Ly9mZWVkcy5tZWdhcGhvbmUuZm0vZGFuaWVsYW5kam9yZ2VleHBsYWludGhldW5pdmVyc2U) \\- cosmology, particle physics\n\n**Booklist:**\n\n* [Full list](https://book4you.org/booklist/99231/aa21a5)\n\n**Non-english:**\n\n* [Deus Ex Silicium ](https://www.youtube.com/user/dexsilicium/videos)\n* [Dr Nozman ](https://www.youtube.com/c/DrNozman/videos)",
    "title": "I put together a list of various YouTube channels",
    "subreddit": "Teachers",
    "timestamp": 1638972604,
    "score": 9,
    "keyword": "man lawyer"
  },
  {
    "text": "Male students harassing female teachers Hi everyone.   \n\n\nThis is going to be the very first post I have ever made. It's long, not sure how to shorten it without leaving out a lot of context. Obligatory \"not a teacher\" and \"English not first language\". But I have found very little on this topic, and would like to ask for some advice, or just insight on if whether or not anyone has ever gone through something similar. So...here it goes.   \n\n\nMy longtime partner in life is a highschool teacher, teaching french in Costa Rica (French is an obligatory 2nd language in most schools over here) at a private school. Over the past 5 years she has received varying degrees of abuse from students, mostly verbal. She's a sweet, but tough person. She doesn't tolerate disrespect in her classroom and sticks to the rules, but is never rude or condescending to her students and really cares about all of them. She will socialize with them and interact with them but makes sure to keep clear boundaries (such as no hugs, no touching her, no sharing of personal details like Facebook, Instagram or any other kind of social media and no pet names), this to avoid any possible misunderstandings that could cost her job and career. You can imagine which ones I am referring to. Anything that could ever point to inappropriate conduct between a young, attractive teacher and students.   \n\n\nAnyways, taking the above into account, she's been having issues with 4 students ever since they started highschool. At first, both the school and her considered they were just kids being kids. They would throw a few insults at her or try to cross the above boundaries during the 1st and 2nd year. In the course of that time, they had various discipline issues, such as bullying other students, causing fights or failing their tests and not doing their tasks and homework.   \n\n\n3rd year starts. 2 of those 4 students molest and harass other female students. Parents threaten the schoolboard that if nothing is done about this, they will take their daughters out of the school. The usual case of \"nude pics\" being passed around and other cases cause 13 students to be transferred. School psychologists decide to implement \"mending procedures\" and \"positive action\" to talk to the students. They deny everything, or say that they feel like the school is harassing THEM instead. The parents of those 2 students back it up, so the school give them the benefit of the doubt and buries the whole thing as a case of over sensitive parents, and teachers (including my partner) not understanding the sensitive minds of young kids.   \n\n\nA few kids continue to leave the school, my partner starts to get catcalled by the 4 culprits, and any kind of disciplinary action against these students turns into a call to the principals office in which my partner is being told that she can't keep noting down her students for being kids. They're just confused and need to be explained nicely, not disciplined. Ok...so she tries that instead. This just evolves into them making fun of her, catcalling her a bit more and insulting her, to the dismay of other students and a few teachers who witness the entire thing. During this whole thing...she still keeps her composure...  \n\n\nPandemic hits, 1 year of rest from those students...and then this year starts...  \n\n\nDuring all of 2021, the same 4 students have so far barked at her on the school yard, followed her into different classrooms (that they are not a part of), interrupted her classes, brazenly insulted her, catcalled her and most recently stepped it up to threatening her, backing her up against walls, showing up behind her and whispering things into her ear and stating that they would find out where we lived if she dared speak up about any of it. They are now 17 years old...  \n\n\nShe has developed severe anxiety, ended up in the hospital due to a mental breakdown and has become increasingly afraid to return to school...  \n\n\nThe school offered psychiatric assistance and offered to open up a case against them. Which she accepted...only for the school to try to convince her to drop it immediately after since they were gonna graduate soon anyways.   \n\n\nThe school is no help, so she tried contacting other outlets, but every \"specialist\" on the matter either say she should feel flattered to have students catcalling her, or that the threats aren't real...they're just kids and she's the adult who should simply ignore them.   \n\n\nIdk what to do to help her. I've told her to quit and I will shoulder the expenses until we are able to find her something else, but she refuses to resign until she has found something else (hard during the pandemic). She feels humiliated, misunderstood and her mental health is in decline. Not a day goes by where she doesn't cry. But doctors and psychologists refuse to assist her...they say she's ok, and basically to get over it. Or just take an ungodly amount of pills to numb her. As a man in today's seemingly \"progressive\" world...I don't understand how no one will give a damn about a female teacher going through this with 17 year old, male students...in one year, they will be legal adults, taking part in the world. Mind you...these are highly privileged students, sons of doctors and lawyers too...  \n\n\nI hope anyone got this far...but if not...\n\n**tl;dr:** Have you, as a woman, ever been harrassed by male students and everyone around you simply played it down? What did you do? And what would you do if it was affecting your health and no one is willing to help?",
    "title": "Male students harassing female teachers",
    "subreddit": "Teachers",
    "timestamp": 1629390508,
    "score": 6,
    "keyword": "man lawyer"
  },
  {
    "text": "How can I rework my interviews? And how do you avoid bad mental health from constant rejections? Hi, I’m a first generation lawyer and don’t have a lot of people to ask about these things, so I appreciate this online community of support. I graduated from a top 3 law school. I have a resume involving years of humanitarian work and social justice work, civil rights law, and business law. I recently finished a prestigious fellowship to help defend the rights of people in need. Because of the traumatic nature of my work, the life or death nature of my cases, and an abusive boss who left me in shambles, I experienced extreme burnout and had a mental breakdown. I took a couple months to recover and now my recovery looks like having a job to pay the bills with less emotionality. My school told me the {school name} would get me a job anywhere I wanted. But that’s not the case. In fact, people look at me funny when I’m not doing the 2 things people from my school do: go to a big top law firm where you do 2200 billable hours and never sleep or do heavy public interest work where it’s an uphill battle for people in desperate need and you also never sleep. I just want a job that is 9-5 or even 8-6 and is just a job. Not 8am-11pm. Just a job and not my whole identity. It doesn’t have to be law. I’m open to anything. In my interviews, I don’t mention the burnout. But people don’t know how to interpret my resume and their position. They don’t know why I want to be there even though I am genuinely interested in their firm or company and the work. It really sucks. Any ideas on how to transition into a new field without having another mental breakdown from all the rejection? I feel like there’s something wrong with me. and the imposter syndrom being a woman of color in this white man’s legal world is rough. And I don’t know how to prove to employers that I want to be there.",
    "title": "How can I rework my interviews? And how do you avoid bad mental health from constant rejections?",
    "subreddit": "careerguidance",
    "timestamp": 1629979116,
    "score": 3,
    "keyword": "man lawyer"
  },
  {
    "text": "Can't work and can't get disability. What are my options? 34 year old man in Texas. Chronic pain. Diagnosed with autism. Get severe meltdowns, burnout, and self harm when working. Unable to work for more than a day or two at a time without suicide attempts. I also cannot drive.\n\nUnfortunately I am not eligible for disability benefits. I've been denied by 3 judges and the Social Security Appeals council. Lawyers have told me that it's over. No lawyer will take my case now.\n\nWhat options do I have now other than homelessness or suicide?",
    "title": "Can't work and can't get disability. What are my options?",
    "subreddit": "careerguidance",
    "timestamp": 1612449374,
    "score": 3,
    "keyword": "man lawyer"
  },
  {
    "text": "LONG. Can't find work even with good chances. Can anyone help me figure out how to stop my life crashing and burning? No TLDR sorry. It's just a long read from a relatively desperate man and I don't know how to be more succinct about my life's failures.\n\n~~Story:\nIt's hard to know where to begin. My parents \"raised me to be individual\" which is another way of saying that they provided zero guidance beyond \"school is important.\" That is not an exaggeration. My parents never gave me a sex talk, job talk, interview talk, or ANY talk for that matter. Literally. They fed me. Clothed me. Kept a nice house and generally put an emphasis on family. I felt loved. But short of that very important thing, I felt completely unprepared for adulthood. If I ever become a parent, I'm going to be much more hands on. Laissez faire is not a parenting strategy.\n\nI was a stellar Highschool student. Without much effort on my part I was able to easily attain a 4.0+ GPA with honors and AP classes. I was socially apt. I was a state champion in debate, a national semi-finalist in Student Congress, as well as a 4 time national qualifier for competitive political speech. I had racked up hundreds, possibly approaching thousands of hours of community service in high school to pad my resume; including teaming up with 4 other students to 100% plan, execute, and deliver unique service events. One event we even rallied in the local national guard to help host a Run-a-thon to raise money for a well-liked student who had been crippled by a degenerative disease. Raised thousands of dollars for her medical bills. Granted we did all this for ourselves. I don't claim to be altruistic, but the scale of accomplishments  completely outpaced anything else I had heard of students doing in our state. I was selected for multiple top % summer camps and programs. (not books they try to sell you, actual experiences where they try to bring in the top students). Honestly my resume applying for scholarships was something I was really proud of because I had done it all on my own, with no guidance from my parents. Unfortunately, the money didn't show. Probably should have been a red flag here.\n\nI was pushed into college since I was in 8th grade; it's what everyone was doing at least till the early 2000's (probably still are). My dad was a first gen college grad and it had provided a good life for him since the 70's. So I tailored my high school experience to get me there and that was the plan. I had been accepted into prestigious schools on account of my test scores and resume. In the end, I had no way to pay for it and no one ever offered my guidance about whether  it would be worth it to do whatever it took to pay for those schools. So I ended up going to the local state school because I had placed in the top 3 in their two largest scholarship programs which, while short of the full ride, had secured me 2 years of free college. In the end I would end up with over $50k in student debt and 15 years later I have never once been in a financial position to start making payments on it. I'm honestly extremely bitter about college all together. It's a burden I will likely shoulder until I die and as of yet have seen zero rewards from it.\n\nStarting college and all throughout I never had any clue about what kind of work I wanted to do, should do, or even had a chance of getting into. I went to college for the vague idea that I had to do it to \"get a good job\". After 5 years and several major changes in the business school, I walked into the counselor's office and asked them what degree would get me out the door fastest. Because the loans were piling up and I still felt like I had no path in front of me. I figured I needed to get work experience. That's the real world shit that people actually care about right? That's how I went from Entrepreneurship Major to Accounting Major to Engineering Major to finally...Marketing Major. I was one class short of the Marketing degree come the May graduation, but since it was an elective credit, I could take it over the summer and they would still let me walk the the grad ceremony beforehand. I just got an asterisk saying I had to complete the summer program. \n\nSo I walked the stage, got my papers and my entire family celebrated. My dad was proud. It's all he ever wanted for me. Somehow he just couldn't understand that I had just went $50k into debt but had absolutely no clue what I had purchased or how to use it. I went to guidance counselors and they made resumes with me. I was willing to take any job in any industry that would serve as a stepping stone to something better. But it was 2009 and the economy had just crashed so I found nothing. 2 years of searching, working a local sandwich shop, and watching my own peers decide it made more sense to go back to school for a Master's than continue to search for jobs. I took a slightly different route. I sold everything I owned and moved to the west coast from the midwest. Another year of searching for jobs out here yielded nothing better. I was told the economy was recovering and the job market was heating up. No one ever called me back for an interview. I began to get depressed. I felt worthless. Here I was this \"gifted\" student whose pedigree would make plenty of people jealous but no one cared. I had amounted to nothing. \n\nLuckily I was able to stay afloat the last decade because of a free state program sponsored by Boeing because they needed CNC operators. So I did a 6 month course for free at a local community college, sent out one resume after getting the certificate and 3 weeks later I was hired at $15/hr at a local shop that supplies Boeing with parts. 7 years there, the company promoted me multiple times, made me a lead, I managed dozens of employees working directly under the supervisor. I interviewed candidates. Made hiring decisions. Trained staff. Did disciplinary action. You name it. I managed. The company brought in an outside teacher to host a chosen few of us in Leadership classes, this lasted a few years. In the end that company seemed to be helping me grow, but ultimately it was never reflected in my titles or pay. Because I was so hopeless at finding work I stuck around. I thought the time would soon come that I could take my management experience, package it right, and get a bump up to Supervisor somewhere else maybe. Then Covid hit. I survived 3 rounds of layoffs but eventually was laid off. During this same time Boeing was hit hard by the Dreamliner crashings and the company decided to move 90% of its work to North Carolina in a business move, a place I couldn't follow because my wife's family lived here. \n\nFast forward 2 years and the job market is supposedly \"hot\" right now. My old company has positions open from operator to supervisor. I applied for the big positions first. I believed I was qualified and they knew me so I figured if they gave me an interview I pretty much had the job since they knew what they were getting. Well they never called. Later I applied for the lowly jobs at the company again. As things tightened up I was willing to take anything. They ghosted me. 7 years at this company of ~100 employees. I personally knew both HR staff, the COO, the Operations Manager, and anyone under them. They won't even give me the time of day. Fine. They're a company after all. I'll just add that the list of lessons I've had to learn the hard way. No one cares.\n\nSo life is giving me lemons. We press on. I consider seeking more school. Not sure what, but it didn't matter. I discovered that my transcripts wouldn't be sent around from my college because some clerical error had showed me as receiving zero credits for that summer course. As a result for the past decade I had been telling people I had a college degree but anyone who bothered to check would see otherwise. This was absolutely infuriating to discover. But I held my head high and pressed on. What could I do? It's not like I could afford a lawyer and it was all so long ago. \n\nSo I call up the student advising center. In an insane turn of events, my old college buddy who couldn't find a job with his bachelor's ended up getting his Master's there, worked there to save money on that, and ended up employed by the University as the head of the student advising office. So pile embarassment onto the luck, but my old acquaintance was able to help me through the process of appealing to the college. In the end, the graduation rules had changed so that technically I had enough credit hours even without the summer course being applied, but there was a problem. In order to reopen my account with the college, I had to send them all recent transcripts. So I had sent them the grades from my 6 month machining course. This in turn meant that my \"final 15 credit hours\" or w/e had not been completed at the college which violated a rule and prevented a simple rubber stamping of my diploma. In the end my friend 2000 miles away had to give the in-person verbal appeal on my behalf to a panel of decision-makers at the college. Luckily they saw fit to wave their hands and grant me my diploma. Seems fair since the program I missed credit for was literally a Bowling class. I had completed all core coursework and capstones.\n\nSo the first time I \"graduated\" college was in 2009 at the height of the housing bubble when I couldn't find employment with my degree. The 2nd time I graduated college was in December 2020 at the then-height of the Pandemic and I haven't been able to find employment with my degree or experience. Now add in 3 ectopic pregnancies for my wife and a now we have a bundle of medical debt, all my student debt, and things are just looking really grim for us. Luckily I saved pretty well and was also able to get some of the UI bonus last year, but this month I had to withdraw several thousand from my Roth retirement account (thanks machinist job) to stay afloat. We've been bleeding red since last September when the UI benefits stopped and my unemployment ran out. It won't be long be long before I have to start dipping into actual gains and start paying penalties on any withdrawals. I'm back to being very depressed. Our whole situation just stinks. We thought we've done everything how we're supposed to. We followed all the rules. We stayed hopeful. But now were facing the unthinkable. Moving in with her family in our mid 30's. And I don't have enough text to tell you how fucked up that would be.\n\nListen, the long and skinny of it is that I busted my ass early in life. I was told I had every advantage. And indeed I did. White male in the midwest. College educated. Not too ugly or pretty. The list goes on. I honestly can't think of what else I could've asked for besides someone to guide me along the way and help me transition all this into a gainful career. \n\nI'm willing to take full responsibility for my situation. I don't care how much of it was my fault or the \"system's fault\" or whatever. I'm sure I've sugar-coated my story a bit, but it's all history now, and the reality is here I am today. I'm a 35yo married man with dreams to have kids, own a home, and just try not to be destitute in my old age. I have over a decade of work experience, most of it assisting managers or being a manager myself, although I never received a title better than \"Lead\" or \"Assistant\". I've been responsible for the operation of multimillion CNC work centers, including training other newcomers. Anyone who knows CNC mills knows that it only takes a 1 second mistake to lead to VERY EXPENSIVE repairs. So when I say these were my responsibilities and people I directly oversaw worked them, it means I was reliable, laser-focused, and I made sure others around me were the same. I've coordinated production schedules, reviewed QA, created meticulous training programs, mediated disputes, and really just about done it all as mentioned previously. I'm ready for the next challenge. I'm ready for someone to bring me to the next level. I could type on and on and on explaining why I believe this is true. But it feels futile. I can't even find work at my \"current\" level or any level lower than that.\n\nThe \"hot\" job market doesn't seem to apply to me. I can't get management jobs. I can't get machinist jobs. I can't get Lead jobs. I can't get Fast Food jobs (I've tried, I'm desperate, but I must seem too 'something' to them cause they won't interview me or hire me either.) I can't seem to get any job beyond the most sketchy. I'm at my wit's end. The only conclusion left for me to draw is that I'm the problem, and I don't know how to fix that or even what to fix. I guess I've got a 2 year gap on my resume since being laid off at the start of Covid. But I filled that with \"finishing my college degree\" and \"started my own business\" (I've tried doing VO as a side-gig but literally has been a money pit for me. There's a story there if I could get into an interview to share it). And if that isn't enough, well then I can always point out that being furloughed in times of Covid should cover some of that gap. I've even tried getting some professional photos done to spice up my profiles. I don't know what to do anymore. I feel like I've completely fallen through the cracks of society and now I'm just waiting to be put out of my misery.\n\nI started writing this thinking I would post it to Career Guidance or Jobs or somewhere on reddit where maybe I could find help, but now I'm just more hopeless than when I started. I cannot imagine what it must feel like to be a disadvantaged member of our society. With every leg up, I've fallen flat on my face. With every natural and circumstantial advantage except overwhelming wealth...I've made nothing of myself. I own nothing. I have no prospects. The only and best thing in my life is my wife whom I love and I truly believe loves me the same.\n\nAnd worse. Despite all the life lessons and experience. I still have no idea what to do or how to fix it. I still have no idea how to succeed or even proceed. I'm no better off than when I was 13 years old at the end of 8th grade and my parents told me I WAS going to college. In fact, I'm worse off financially. At least then I had no debt or responsibilities beyond myself. Now I'm tens of thousands of dollars in debt with no end in sight and I'm responsible for more than just myself.\n\nI just glanced at the title I started with. I guess this is all pretty much in line. It feels like everyone around me is getting on with life. They're managing to make things work and some of them are even accomplishing dreams. They are finding jobs, finding new jobs, getting raises and promotions. They have trajectory. I feel like a dud. So many folks are out there making it with worse situations than me and I don't know how. I feel doomed to just keep bleeding retirement money until we're living off toast and ramen living in my in-laws basement. I try so hard to keep my head up and stay positive. Even now as I write I'm trying to be conscious of not coming across as too much of a whiny loser that is only going to attract angry replies and suicide-hotline links. \n\nIf I could have anything right now? If this post could change my life? It would give me the secret I need to get a good job, get promoted, and just live my life. But that's a crazy ask from a reddit post. So for now I'll just tell my story into the void and see if it makes me feel better. Maybe cross post a bit. If you made it this far I really appreciate you hearing this....paired-down version of events. It's hard to sum up anyone's life, even a portion it so of course I couldn't do that to my own. If you're someone who can help me understand what to do. Thank you.",
    "title": "LONG. Can't find work even with good chances. Can anyone help me figure out how to stop my life crashing and burning?",
    "subreddit": "careerguidance",
    "timestamp": 1639532136,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "So, any ideas? Hello, let me presente myself, 31 yo, lawyer, unemployed, or freelancer if you like, is little more elegant. Spanish speaker, so brace yourselves to any mistake here and there.\nI was a teacher, during my last years in the university and during the first ones after I graduated. I studied law. Some 3 years ago I quit teaching, I am a lawyer, so, let's do some law stuff... I hate that law stuff haha\nEvery new day I remember how much I liked teaching, I was a history and philosophy teacher at a highschool, it was a little difficult, the kids were sometimes a little savage, but in the end I managed to win them. Even to this day, they keep sending me memes or asking some advice through social media.\nThe thing is, as third world country dweller, the teaching career is underpaid, and every new school I tried, they ask some teaching degree of sorts, and I am still paying my law degree... I should man up, and do law stuff to pay my degree and some teaching degree if I want to go back to the classrooms... But, my first years as a graduated, I learned teacher stuff, not law stuff... And I am a little too old to do beginners stuff because no one will hire me... And that's why I am freelancing, pretending to be a lawyer...\nSo, thank you if got this far, this is more a rant, or general complaint...\nBut, if you have an advice, something, that will be greatly appreciated. \nSo, any ideas?\nUn abrazo pana",
    "title": "So, any ideas?",
    "subreddit": "careerguidance",
    "timestamp": 1615595639,
    "score": 1,
    "keyword": "man lawyer"
  },
  {
    "text": "Is there a profession where I can leverage both of 1) my IP Law expertise and 2) my music/art/collaborative personality? To clarify, I'm good at a lot of things but my marketable professional experience is limited to patent law (for a specific set of technologies). I'm working on laterally transitioning to in-house or other types of legal work, although there are many hurdles in this process itself. I also predict that lawyering in general isn't going to scratch the itch, which is:\n\nI really want to make a difference, and I've got a ton of informal experience in the music world (multi instrumentalist in various rock bands), improv comedy, and building and managing teams for art projects (mostly at Burning Man). \n\nBUT my current work doesn't use these skills, so I'm feeling like it's a waste of life (despite being an excellent source of income). And therein lies the rub. Got any advice for me?",
    "title": "Is there a profession where I can leverage both of 1) my IP Law expertise and 2) my music/art/collaborative personality?",
    "subreddit": "careerguidance",
    "timestamp": 1626457384,
    "score": 1,
    "keyword": "man lawyer"
  },
  {
    "text": "Is it time to stop with the \"stuck in your job, move to IT\" encouragement? I've been in IT for a decade and half and I've seen a ridiculous amount of competition in this field. Taking 1-2 years to change a job is actually quite normal and you can apply to a shit tonne of companies without getting a single interview. \n\nInside a big corporate we get like 100-200 resumes / day for each vacancy. You read that right. Per day! \n\nTo top it all I've seen volunteers in almost all CSR activities teaching everyone how to code. Be it orphanage (\"because they can join the IT\"), the elderly (\"because it's good for their brains\") and the housewives (\"make money from home with remote IT jobs\").\n\nThat includes people who could have one day been doctors, professors, lawyers, administrators, constructors. There's this movement to sell everyone the dream of joining IT and making big bucks.\n\nWhenever the common man asks me what job I do and I say \"IT\" he immediately assumes that I must be filthy rich, jumping into a swimming pool full of money and making cigars out of currency notes.\n\nWe are churning out a hell load of graduates every year who have a degree in comp-science and/or IT and 80% of them will never get into the IT industry. And I've seen a shitload of Youtube videos/articles that are centered around \"stuck in your job, move to IT\". A friend of mine was fed up of his job in the medicinal field and was asking me how he can become an IT manager (in the US). He put in some fake experience and secured a job.\n\nIs it time to stop encouraging non-IT people to join the IT stream? We had an IT boss who came over from manufacturing industry who brought with him horrible manufacturing-centered work-culture (like discipline in office timings in spite of flexible hours policy) and zero domain/technical knowledge. We had almost every employee quit the job from under him due to his rudeness.\n\nHow much more are we going to keep encouraging every Tom, Dick and Harry the IT dream? I mean come on! There are a hell load of other professions that are also doing good and where you can make an good living. Like accountancy or business or manufacturing or civil or federal or argricuture. What do you feel?",
    "title": "Is it time to stop with the \"stuck in your job, move to IT\" encouragement?",
    "subreddit": "cscareerquestions",
    "timestamp": 1636436397,
    "score": 39,
    "keyword": "man lawyer"
  },
  {
    "text": "What I learned from 1.5 years in tax technology at B4 (some thoughts apply in general for accounting/tax) Alright, so I am totally out of B4, out of tax, out of accounting, everything. Looking back, I'm grateful for getting my foot in the door in software development, which tax tech allowed me to do, but man I wish I knew a lot of things when I started that I know now. So, to that end, I thought I'd share what I wished I knew with you guys who are aspiring accountants. Also, I get a lot of PMs asking about tax tech, so here ya go.\n\n\\#1 ACCOUNTING DOES NOT PAY AS MUCH AS EVERYONE HERE CLAIMS\n\nI don't like all caps, it's annoying, but this point is so important I felt the need to highlight it. I don't know if the vast majority of people on r/Accounting are making up their comp, it used to pay more, whatever, but you will not make as much as you think. Your starting salary in MCOL, which is where I'm at so I'll use that as an example, is going to be about 52k for audit and 55k for tax at B4. If you go into advisory, it'll be higher at around 60k. Tax tech we started off in high 60s. Keep in mind this is for a profession that requires a bachelor degree and a master's degree as well as extra work on the side (CPA) to optimize your chances of success. These starting salaries haven't budged from what I've read since about 2008. I did initially look at industry tax jobs, since I was hating my job pretty bad at the 6 month mark, but even with 2-3 YOE you're looking at around 70-80k. Which, yes, that is the vaunted 20-30% bump everyone talks about, but 70-80k doesn't go that far in MCOL anymore. If your spouse works, you'll be fine, but just be forewarned. When you're watching Becker and the lawyer dude, forget his name, is talking about how you'll be swimming in benjamins that's just not true. Also, for the fact you need a BS + MS + CPA to do it, the ROI is not great. It's better than a lot of industries still, but it pales in comparison to other degrees like data science, computer science, etc.\n\n\\#2 Tax technology is not worth the higher salary to start in\n\nSimply put, it's kind of interesting, and kind of neat, but if you think tax is niche and will pigeonhole you well tax tech will do it even more so. I think it's fine if you know for sure that's all you want to do with your life, but if not, I think a safer path would be to start in regular tax and get compliance experience first then do tax tech. That way, if you decide you don't want to do it forever, you have the compliance experience everyone will expect you to have.\n\nCaveat: If you get to the end of your degree, and realize you're not a huge fan of accounting or you otherwise have a strong interest in data / tech, then tax tech as a first job is a good choice. Obviously it got me into software development, and many of my colleagues left for software development or data analyst jobs, so it's good to get related experience for that kind of stuff.\n\n\\#3 Work-life balance is not much better in tax tech or advisory in general from talking to my colleagues\n\nYou likely won't work 80-100 hours a week like you will in tax or audit (fun fact that's not much above minimum wage if you calculate your effective hourly rate) but you will still be expected to work nights, weekends, work on every single vacation, cancel PTO, work over holidays or holiday break, all at the drop of a hat, if that's what your manager wants. So, your total hours will be less, but your WLB will be just as trash as it otherwise would be in the other practices. Also, all of the people at manager and above seem to work 60+ hours a week. It's a horrible life that I would not wish on anyone.\n\n\\#3 The CPA is underrated for interviewing\n\nYeah, you may be wondering why I'm saying this since I left accounting completely, but if you think all the BS of accounting is stupid look up the interviewing process for software engineers. It's insane. There is no certification, like there is with CPA, where you can just get B4 experience and CPA then be super competitive for jobs. It's way more like a luck-based lottery interviewing in other fields, so for interviewing and getting jobs, accounting is ahead of most industries.\n\n\\#4 You don't have as much stability as you think\n\nWhen I left a week ago, it was about a month after the B4 firm I was at announced that they were laying off 4% of everyone in the tax practice or asking them to take 20% salary reductions. They also cancelled bonuses, slashed benefits, and gave me a 2% raise. There is absolutely no guarantee of you keeping your job in an economic downturn nor are you going to get 10-15% raises on average like everyone here brags about in public. You are just as likely to get screwed, whether it's due to covid, an asshole manager, etc. Which leads me to my final point...\n\n\\#5 Do not stay in public accounting\n\nSeriously. The clients are leeches. They try to squeeze as much out of you for as little as possible. This leads to very unethical crap like time getting eaten, managers asking you to work on PTO, etc. in this insane but hopeless effort to always please the unreasonable client. Also, every firm will say they're against eating time, but if you don't, inevitably you will get punished one way or another. It is a very toxic relationship, and it permeates audit, tax, advisory, everything, and frankly I just don't see it changing. The public accounting model is essentially a pyramid scheme where the people at the top exploit the hell out of the people at the bottom (you) while dangling the carrot of some day making partner in front of you to justify all of the abuse they will subject you to.\n\nTo that end, you should very much consider yourself a mercenary. Do not stay longer than you have to. You do not owe them shit. They will exploit you as much as possible, so do the same to them. Make them pay for all the food you can. Make them pay for your CPA. The moment the clawbacks expire on your signing and/or CPA bonus, consider looking. Some people here advocate for staying until senior associate, and maybe for the title bump that may be worthwhile, but seriously the moment you have determined it is best for you to leave (and the sooner the better) then get the fuck out. You should give no loyalty to them, because I guarantee they will give none to you.\n\nAlso, a lot of industry jobs aren't much better. Due to the nature of deadlines in tax and accounting, you're going to be working over 40 hours a week regularly. Sorry. This subreddit seems to give the impression that once you escape to industry everything is magically better. It's not. Plenty of people joined my practice, coming from industry, and talking about the hours they worked and WLB they had, there wasn't much difference. Maybe for private companies it is but publicly traded companies have filing deadlines, hence why the public accounting firms work you like dogs, to meet those deadlines. Obviously, they still apply if you're on the other side. You may get some improvement, and it's fair to assume that'll be the case at most companies, but the hours / WLB in this profession just aren't great and you can't sugercoat that fact.\n\nHope it helps guys. Still a much better choice to do accounting than say marketing, history, business, and a lot of other crap. Try to avoid any debt if you can, and failing that, take on as little debt as possible because seriously with what you'll get paid you'll have a decent middle class life to start if you don't have a lot of loans but if you do then you're going to be living check to check.",
    "title": "What I learned from 1.5 years in tax technology at B4 (some thoughts apply in general for accounting/tax)",
    "subreddit": "Accounting",
    "timestamp": 1609541433,
    "score": 32,
    "keyword": "man lawyer"
  },
  {
    "text": "Confused high school grad Hey guys,\n\nI just graduated high school about two years ago. took a gap year to figure out what i want to in life, as well as find my passion. however i was unsuccessful. my dad is a business man and my mom is a house wife, my family mostly just consist of business people and engineers. i don’t have a true passion per say, however i did have a few interests along the way. \n\nstarting with astronomy/astrophysics, until i realized how sparse the job market is and that i don’t know if i’ll like physics. \n\nthen i looked into being a pilot for a long time, i do enjoy aviation and think it’s pretty cool but it’s not really a stable job and i don’t know if i like the fact i’ll be away from home A LOT.\n\nI got into law and forensics but i was discouraged because i’m an introvert and not talkative enough to be a lawyer, and there aren’t much jobs in forensics.\n\nafter i got into medicine but then i realized, i don’t think i have it in me to put myself through the restless nights and crazy stress.\n\ni looked into dentistry as well but then i realize it’s kind of nasty and dentists have a high suicide rate.\n\ni looked into engineering and computer science but i really hate math, well trig atleast, and i think there’s a lot of that in those fields.\n\nso now i’m at accounting/business.\n\ni’m not really sure what i want to do in life, however i know the type of lifestyle i want, and that is to live comfortably, travel the world, drive nice cars, buy something and not have to look at the price tag, you know? \n\ni wasted a year already and i got into a canadian university for accounting .\n\ni’m wondering how flexible and useful this degree would be to me. \n\ni def do not want to be an accountant all my life. but i’m wondering if the skills and degree could land me jobs in different business strands, such as ib, consulting , marketing, etc.\n\nor even if i were to open my own business or expand my family business (liqour), get into real estate and things like that\n\nthanks for reading and i appreciate any response.",
    "title": "Confused high school grad",
    "subreddit": "Accounting",
    "timestamp": 1629478039,
    "score": 5,
    "keyword": "man lawyer"
  },
  {
    "text": "What if a whole week's worth of employee paychecks you sent out should all bounce? Asking for a friend.\n\n::EDITED TO ADD:: But seriously, I am not the bookkeeper, I am an employee. My paycheck bounced. And now it turns out other employees have reported bouncing paychecks.\n\nMy general sense is I need to just quit with no notice, because it looks like this company is about to go down in flames. But there are OTHER issues here in my situation which I felt the need to ask a professional (or two, or a hundred) about.\n\nAnyone care to hear my sad tale of woe of being stiffed for over $800?\n\n::EDIT #2 on SUNDAY Jan 17, 9:30 AM Eastern Time::\n\nI'm back! I have a long long story to tell. I am going to do a copy-paste of the whole saga in the next couple of minutes right here in the OP. I hope it all fits. Stay Tuned!\n\n::EDIT #3 on SUNDAY Jan 17, 10:40 AM Eastern Time::\n\nGreetings! I am a CNA (certified nursing assistant) and I work for two different HHA agencies (home health aide agencies) here in Massachusetts. AS A LITTLE BACK STORY, I get live checks from this one agency with the bouncy-fun payroll checks, NOT direct deposit only because it's my preference (although, my OTHER employer made us all go to direct deposit this past April, we had no choice). And also, payday is ALWAYS on Fridays (not Thursdays, and instead of weekly paychecks (52 paychecks per year), we get bi-weekly checks (26 paychecks per year). Also, I operate my life on a cash-only basis. I do not have a checking account, I have a savings account instead (it is the only account I have at this time, so that fact right there will hopefully keep this story simple for you to follow, as complicated as it all is). I withdraw the cash every week, keep a super-low balance, and I live my life via the hard cash.\n\n(If you're wondering why I am a cash-only person, it's because I just don't trust banks. And be assured that because I am a CNA I am automatically NOT a criminal because I can't get state certification, nor can I legally obtain ANY job in healthcare, without yet again passing both CORI and SORI every time I apply for a new job.)\n\nMy bank is a small credit union. My employer's bank where they have the payroll accounts is one of those mega-huge investment banks which are \"too big to fail.\" Meanwhile, the bank lobbies are all closed right now due to the pandemic, so the only option when you physically go to the physical bank is the drive-thru. Any really involved banking issues need to be handled by making an appointment ahead of time to meet with someone in the lobby, and you must go through all the screening ahead of time. So as I tell my tale of multiple trips to the bank, imagine me sitting in my car at the speaker thing and the vacuum-tube-cannister thing.\n\nWhat follows is my story of the bounced payroll check saga. Maybe it's a little wordy (a lawyer could probably pare this down by 70% in length), and for that I apologize.\n\n\\---------------\n\nTimeline of events:\n\n\\----\n\nTHUR DEC 31 -- The office was scheduled to be closed on Friday, Jan 1 for the holiday, so they instead issued Thursday checks this one time during that that one week just because of the holiday. Normal payday is a always a Friday. I didn't bother going in to pick up my check that day. It was a busy day for me, and this is only one of my jobs. I have another job with another agency. so I have two sources of income. So I told myself to wait until next week (first week of January) to go and get my check.\n\n\\----\n\nTUE JAN 5 -- I went to the home office of this agency (the one with the bouncy-fun checks) to pick up my (live!) paycheck which had been sitting there since the previous Thursday. Receptionist said to me as she handed me my check: \"Examine your check before you leave. Some of the girls have reported that their checks were short.\" \\[I know it's not politically correct to say \"the girls\" but that's literally the jargon we use in healthcare when referring to the aides.\\]  The supervisor was standing there nodding her head at me. So I opened the check right there, and I discovered that instead of 28 hours for a two-week period, it was just 10 hours. The supervisor wrote down my name and the number 18 for the number of missing hours. She said they would reimburse. \\[SIDE COMMENT: My previous paycheck from 2 weeks earlier was also 10 hours. I am wondering if perhaps this error was someone in payroll --maybe a total newbie-- just did a copy-paste of my prior pay cycle without realizing the folly of that move. Another theory I have is maybe they switched over at the end of the year to a new payroll system, and they tried to carry over all the old data into the new system, and this mirroring of the previous hours was the result of the bulk data transfer. Maybe it's a combination of both of these two theories of mine (a newbie payroll clerk combined with a new payroll system). I don't know, just spit-balling here.\\]\n\nMy check was only $137.95 (should have been well over $300). \\[THIS IS THE CHECK THAT EVENTUALLY BOUNCED!\\]\n\nI left the office, drove to my bank (credit union), and (I am in the drive-thru, mind you NOT inside the bank itself) I did NOT deposit that check into the savings account. Instead I cashed it for the full value, and drove off with the cash. My bank honors all payroll checks and government checks (not personal checks), and will cash them on the spot for you.\n\nMy closing bank balance at the end of the business day (and I do not dispute this balance at all) was:\n\n$68.36\n\nAnd again, I will remind you, this is a savings account, not a checking account, and it's the only account I own right now.\n\n\\----\n\nFRI JAN 8 -- Unbeknownst to me, a special run of new payroll checks got issued on this day for all of us girls whose paychecks of the week before had gotten shorted. This employer does paycheck cycles of 2 weeks (26 paychecks a year) so this was an off-Friday for paychecks. I just didn't know they would print these checks. So I didn't pick it up. It just sat there at the receptionist's desk in the main office for another full week.\n\nMeanwhile my OTHER job, on this same Friday, did a direct deposit of $126.38 in my credit union savings account. I didn't go and withdraw that money from the direct deposit because I was busy that day and didn't need it. I let it sit in the account over the weekend.\n\nMy closing bank balance at the end of the business day (and I do not dispute this balance at all) was:\n\n$194.74.\n\n\\----\n\nMON JAN 11 -- I drove to the post office so I could retrieve the latest mail from my PO Box. And in there I found a late Christmas card from my favorite Auntie with a personal check in it for $50 (she lives 2 counties away from me, so not only is it a personal check, but a way-the-heck-out-of-town check as well). I also found my COVID stimulus check for $600. I drove to the bank (my credit union) and when I got my vehicle up to the speaker-vacuum-tube-cannister thingy of the drive-thru, I did the following transactions:\n\na) withdrew $180.00 cash from that day's balance of $194.74\n\nb) deposited my Auntie's personal check for $50 (couldn't cash it outright because it is a personal check, it HAD to be deposited)\n\nc) cashed the full $600 stimulus check for full value\n\nI pocketed the entire $780 in cash, and went about my business that day. I knew my Auntie's check would be held for another 3 or 4 days, so I just let that go for the time being.\n\nMy closing bank balance at the end of the business day (and I do not dispute this balance at all) was:\n\n$64.74.\n\nAnd the $50 Christmas check was being held by the bank for a few days, so my \"Available Balance\" was listed as being only:\n\n$14.74\n\n\\----\n\nTUE JAN 12\n\nWhile I was busy with life, my bank (a credit union) got the message from my employer's bank (a really huge investment bank) that the payroll check for $137.95 which I had cashed at my bank exactly one week earlier on Tuesday, January 5, was rejected for insufficient funds in my employer's payroll account over at the mega-huge investment bank. All this happened without my knowing about it.\n\nSo on this day, January 12, after my bank/credit union received the bad payroll check back from the mega-huge investment bank, my bank/credit union turned around and raided my bank account to recoup their losses. They also charged my account $7.81 (really strange number!) for a bounced check fee. (I reviewed my account ToS and the standard charge for a bounced check is $7.81. Maybe it's an old bookkeeper's trick to be able to scan down a very lengthy ledger of numbers and find that one odd-ball number in the mix. Idunno, I'm just spit-balling.)\n\nThis generated a letter from the bank to me, letting me know I had a bounced check fee. The letter went to my PO Box, but I still didn't know any of this yet. (I only go to my PO Box every now and again, not every day.)\n\nMeanwhile, by the close of business that day, my account was now registering a negative balance of:\n\n\\- $81.02.\n\n(I also don't go online and check my bank balance every either. Believe me! If I had seen a negative balance in my account at any time, I would have been all over it!)\n\n\\----\n\nFRI JAN 15\n\nA direct deposit from my OTHER employer (the one whose payroll department has their act together) hit my account. It was for $67.79. This reduced the negative balance of my account down to just:\n\n\\- $13.23\n\nand I still knew nothing about this (yet).\n\n(SPECIAL SIDE NOTE -- there is a minimum balance requirement at my credit union of $5.00. So there were actually 2 different versions of the negative balance: the -$13.23, and then an adjusted negative balance of -$18.23, which of course is a difference of exactly $5.00.)\n\nThis same day, I drove to my employer around 3:30 PM to pick up my latest paycheck. They handed me TWO payroll checks. These were, 1) the special reimbursement check from last week which I never knew existed, and then 2) the normal Friday paycheck for the latest 2-week payroll cycle. The special payroll check was $248.32. And my regular payroll check was $415.08. Grand total of $663.40. (MINOR SIDE NOTE: I didn't notice at the time, but this was actually way too much money because I deliberately specify a very high tax withholding on my checks. Someone, somewhere in the payroll department of my bouncy-fun-paycheck employer reset the withholding to a lower amount, and I don't know why. But I can certainly fix that in the upcoming weeks. And so, because of this reset of my withholding, I am AGAIN suspecting that this is possibly a case of a new payroll software being used by my employer.)\n\nI then drove to my bank to cash these two payroll checks. I arrived around 4 PM. As I sat in my car, in the automobile line for the drive-thru, waiting my turn to get my car up to the speaker-vacuum-tube-cannister thingy for the drive thru, I took out my cell phone to glance at my bank account balance, and figure out how much I needed to withdraw after the latest direct deposit from my other employer.\n\nMy phone's screen told me that my account balance was in the negative by just under $20, or\n\n\\- $18.23.\n\nI didn't panic, I was merely puzzled. So I got up to the speaker and the vacuum tube thingy, and I politely asked the teller what was up with my account balance being in the negative.\n\nShe got a look and said: \"You deposited a check that bounced. It was for $137.95.\"\n\nI realized it was my payroll check from 2 weeks earlier that she was referring to. And after another few moments of polite discussion about it, she said \"My manager just told me we can't cash these other two payroll checks that you just now presented to us from that same employer. So we're going to send them back to you \\[via the vacuum tube thingy\\] right now.\" She apologized, I said it was okay. She suggested I try driving to the mega-big investment bank to see if they would honor the two payroll checks for $663.40.\n\nI thanked them for their explanation. Then I drove a few hundred yards away to park, and I called one of my best friends in the world, a wonderful woman I've known for over 20 years, and whose wedding I was in. She's a human resources officer in New York, so she is very well versed in employee payroll disputes and all the legal ramifications as well as the options for what employees can do when their payroll is messed up. (It's so awesome to have friends who work in these kind of specialty fields, and knowing you can call them and ask for advice and guidance. John and Paul were right: \"I get by with a little help from my friends.\")\n\nShe said go back to my employer right now (it was already 4:15 at that point, and the office was closing at 5 PM) and tell them what was going on. She said I should ask them if they would make good on this money by tomorrow (by Saturday, January 16). And if they hesitated in any way to make me whole again by Monday, then I should go to the Department of Labor. I asked her if I should go to the mega-huge investment bank to try and cash these other two checks that got rejected by my credit union just now. She said if I had time, yes. But in her opinion, going to my employer over the bounced check was the priority at this moment. The bounce itself was a legality that carried more weight than the rejection of the other two checks in this particular instance (a distinction with a difference). If I could financially afford to hold off on those other two checks, go to the employer immediately, worry about the other two checks later.\n\nI went back to my employer. I got there by 4:30. I spoke to the receptionist. She said: \"Wow, a lot of other girls here said their paychecks have been bouncing lately!\"\n\nI smiled and secretly thought to myself (Oh my dear God!)\n\n\"Can I talk to someone in payroll?\" I asked (very politely, not a molecule of anger or sarcasm or emotionalism).\n\nThe receptionist called human resources (which is in Connecticut for some reason!) and then after she explained all of this to the HR rep, she handed me the phone. I chatted with HR for about 10 minutes (I kept it very polite, no anger, no snark). HR said they found out several days earlier about the bounced check (their bank called THEM!), but then they were told by their mega-huge investment bank that my check (and I presume other such bounced checks) were eventually cleared. I said no, my bank said it wasn't cleared.\n\nSo then I asked \"How can I get my money for this check? My bank account currently has zero dollars in it. And the bank also refused to accept these other two payroll checks that I only just now picked up today. So I literally have no money.\"\n\nShe said: \"Maybe we can resolve this on Monday. And maybe we can do a direct deposit for you instead of a check. So I will call you back on Monday. Okay?\"\n\n\"When on Monday?\" I asked.\n\n\"In the morning,\" she said.\n\n\"When in the morning?\" I asked.\n\n\"I'll mark my calendar right now,\" she said \"I will call you back at 11:30 on Monday morning.\"\n\n\"I look forward to your call,\" I said. \"Have a good weekend.\"\n\nWe each hung up. I called my friend back. She said \"I forgot to mention: Monday is MLK day. They might not be open.\"\n\n(Awww! Man!)\n\n(And I totally do not like the idea of a direct deposit because of how much I hate direct deposit.)\n\n\\----\n\nSAT JAN 16\n\nSo .... first thing in the morning, I got up super early, gathered as many documents as possible, reviewed them, tried to piece together a timeline, and then I cam here to this message forum and posted this post.\n\nThen I made the following trips (I had to be early because ALL of these destinations were going to close by noon time because that's how Saturdays go. And so I had to squeeze everything into a 3-hour window of time). My mission was to go to three separate banks plus my PO Box. All in one outing. FOUR destinations on a rainy Saturday morning.\n\nFIRST I drove to my credit union, got in line at the drive-thru, and when I got to the speaker, I said, \"I need to make my account whole for now.\" So I deposited $24.00 in cash. This raised up my negative balance from the -$18.23 to a positive number of $10.77 (and $5.00 is the minimum balance, so I really only have access to an \"Available Balance\" of $5.77).\n\nHowever, this deposit (because I waited until Saturday to do it, rather than doing it in the drive-thru yesterday, which I would've if I'd been thinking) won't kick in until Tuesday, January 19, the first business day after the MLK holiday on Monday, January 18. So technically, my account is still in the red.\n\nI also asked them if I could have a printout with formal ledger items on it itemizing the details of each transaction. . They said I should have a letter sitting in my PO Box with the bounced check notice. I said I needed an explanation in writing detailing the $137.95, because that check is nowhere to be found in my account history due to the fact that the check never actually hit my account. I merely cashed it at the window. They accommodated me with printouts of several screen shots of THEIR database which only THEY get to see (very helpful!) showing me the dates and the check number for the bad check, and the dollar amounts of the check and the fee.\n\nSECOND, I drove to ANOTHER credit union about 6 blocks away. I got my car up to the speaker of the drive-thru and asked if I could open an account. The reason I wanted to do this is because if my employer --the one with the bouncy-fun payroll checks-- is going to continue to present difficulties for me with the cashing of paychecks, I want a separate bank account for now, so that my OTHER payroll deposits from my OTHER employer don't get confiscated anymore. This other credit union politely said that the opening of an account on a Saturday during the pandemic is not possible. They said all regular transactions are currently being done only via the internet and the drive-thru, and that the opening of a new account, as well as all other specialty banking services, requires an in-the-lobby meeting with a bank specialist by appointment only, and their bank specialists are not available at all on Saturdays. They said I should come back on the next business day, which will be Tuesday (since Monday is MLK Day, and they will not be open at all). So I made an appointment with them for an in-the-lobby meeting as I was talking with them at the speaker. I will be there first thing Tuesday morning.\n\nTHIRD, I drove to my PO Box. I retrieved from it the letter from my credit union which was auto-generated back on Tuesday, January 12, stating that my account had been subjected to a Return Check Fee of $7.81. They itemized the check (the bad payroll check) and the dollar amount it was for, as well as the check number (a 6-digit number from my employer's business/payroll account). The letter also declared that my account was now in a negative balance.\n\nFOURTH and LAST, I drove to the mega-huge investment bank where my employer has their payroll account. I presented the two payroll checks totaling $663.40, which my credit union said they were not allowed to honor this past Friday. The tellers at the mega-huge bank didn't bat an eye. They cashed them both! Hooray! I now have cash!\n\nThe only drawback here is that they had to charge me two $6.00 fees since I do not have an account with them. So I am now out $12.00 more. (I am going to request that my employer reimburse me that $12.00 in addition to the $7.81.) So instead of $663.40, they gave me $651.40. (I failed to get documentation of this $12 fee. I will need to negotiate this with my employer when they undertake reimbursing me.)\n\nSorry for the long drawn out story. I can come back and keep you all posted on the upcoming developments.\n\n\\-- IB\n\n::EDIT #4 SUNDAY Jan 17, 10:45 AM Eastern Time::\n\nI forgot one detail: it seems that my credit union has placed a 14-day hold on my payroll check --or else it has placed a 14-day hold on the funds for my payroll check. I have come to understand that the bounced payroll check was indeed honored, but my credit union is choosing to withhold the funds from me. (I am a cash-only person, so I'm not an ideal customer. I can only presume that they would treat me better if I maintained a high balance at all times.) Those funds will not be released into my account until January 26, which is exactly 14 calendar days after the January 12 date when they charged me the Returned Check Fee.\n\n&#x200B;",
    "title": "What if a whole week's worth of employee paychecks you sent out should all bounce?",
    "subreddit": "Accounting",
    "timestamp": 1610796408,
    "score": 3,
    "keyword": "man lawyer"
  },
  {
    "text": "Is this a valid tax planning strategy for a non-american? I found this on a  website from a business consultant. The author is a lawyer from Texas and I want to know if accountants who have experience in this stuff think it's a viable plan.\n\nI am not sure if I can paste the link Here so I copy and pasted directly from the article:\n\n&#x200B;\n\n**A Ve****r****y PRIVATE Model for E-Commerce in the USA!**\n\nPosted on **November 8, 2018**\n\nYesterday, I was talking to a prospective client from Israel who owns and operates an E-Commerce store, and wanted to know how would be the best way to set it up. He does not live in the USA, does not maintain any facilities in the USA, and drop ships everything that is purchased directly from service providers in Asia. He needed a way to accept online payments from customers.\n\nThere are two issues here:\n\n1. How to best obtain merchant account services so that you can easily accept payments using the primary online payment systems: PayPal, Stripe, and Shopify.\n2. How to best reduce taxes without getting into any trouble with your home country’s tax authority.\n\nIn the case of an Israeli there are a lot of problems. There are few countries with a more demanding tax system than Israel. The taxes are high, and the rules are very complicated.\n\nLet us begin with Issue #1 above. In the past I would have suggested that the client simply establish a US LLC that will be treated as a ‘disregarded’ or ‘pass through’ tax entity. What this means is that the IRS does not recognize the existence of the company for tax purposes, but instead looks to the actual owner(s). If you are a non-citizen and a non-resident of the USA this can be very advantageous! In the case of this prospective client such a structure would mean he could set up a bank account in the USA for the US company, and not owe any taxes in the USA since he was not earning any “effectively connected US source income”. Also, in the past it would have been very easy to register such a company with PayPal, Stripe or Shopify.\n\n***PROBLEM: It is no longer easy to setup PayPal, Stripe or Shopify using a ‘disregarded’ US LLC. For more information on this \\[CLICK HERE\\].***\n\nThere is still no taxes due for a ‘disregarded’ LLC, and it is still possible to open a bank account such a company. However, the US now requires the ‘payors’ (PayPal, Stripe or Shopify) to  maintain such complicated records on these type of companies, and has placed such high penalties upon them if they make any mistake that most ‘payors’ have decided to discontinue servicing such ‘disregarded’ LLCs, and instead require that the company be a ‘taxable’ entity that only requires a simple W-9 form that can be filled out and executed online in a matter of minutes.\n\nIf your only interest is in solving Issue #1 then the solution is easy. Establish a company in the USA that will be a ‘taxable’ entity that can quickly and easily fill out an online W-9. I would suggest using an LLC and elect to have the company treated as a ‘taxable association’ rather than a ‘disregarded entity’. Avoid setting up a corporation as that is more complicated to establish, manage, and deal with the taxes. In this way you get all the management benefits of using an LLC while still getting treated like a C Corporation.\n\nHere is where Issue #2 might comes in.\n\nIf an Israeli sets up a foreign company he must pay the same taxes on that company as if it were established in Israel. In the USA the tax rate for a C Corporation (or an LLC treated as a ‘taxable association’) is 21%. Because there is a tax treaty between the USA and Israel the client would pay 21% in taxes to the USA, and an additional 3% in taxes to Israel because the corporate tax rate in Israel is 24%. Other than having to file two tax returns in different countries, I suppose that is not so bad. However, tax laws in Israel are more complicated than that..\n\nLet’s say that the client wants to take a very small salary and reinvest the rest into the company… or perhaps even just let the money sit there. That could get him into trouble. The Israeli government wants you to behave in a manner that results in the maximum amount of possible taxation. So he may be required to pay personal taxes on all the net profits of the company whether or not he takes those profits as a salary or profit distribution. Personal tax rates in Israel are extremely high!\n\nOUCH!\n\nSo is there a solution?\n\nYes. The Israeli government is not going to like this, but there is nothing they can do about. It is legal.\n\nTo help with Issue #2, reducing the taxes for the client, instead of setting up one company that is owned by the client, we instead setup two companies that are NOT owned by the client.\n\nCompany Number 1, from now on the ‘Taxable Company’, will be owned by a someone other than client. It will be this company that operates the E-Commerce Store, and pays any taxes that may be due. Other than ownership it will be just the same as the above company. The client will receive a salary from this company sufficient to satisfy his basic needs. The rest of the revenue of the company will go primarily to two expense items:\n\n* Costs of operations (transaction costs, professional fees, etc.), and\n* Cost of goods or cost of sales (wholesale price of goods to be sold).\n\nCompany Number 2, from now on the ‘Non-Taxable Company’, will be owned by an International Privacy Trust that the client can take over at any time, but does not own now. This company will be acting as a middle man, buying the goods from the Asian service provider and drop shipping them directly to the buyers.\n\nThe Taxable Company receives the payments from the buyers, and pays the Non-Taxable Company the reasonable wholesale price for the goods.\n\n>*Example: Taxable Company sells a widget to Buyer for $100 USD. Taxable Company pays a reasonable wholesale price to the Non-Taxable Company of $70 USD. That will leave $30 USD in the Taxable Company to cover operating expenses and the salary for the client. The actual cost of the item was only $20 USD so the remaining profit of $50 USD in the Non-Taxable Company is tax free. (These numbers may change for different situations — it will depend upon the costs of goods, the margin of profits, and the requirement of the client for a monthly salary.)*  \n***NOTE****: In this case it is very important that the client understand the real costs involved and how much he is going to need as a salary because he does not want to touch the money that accumulates in the Non-Taxable Company until later. I will explain this further on.*\n\nThis system is a little bit more complicated to setup and perhaps to understand, but once in place it will be much easier to run on a day to day basis because there will be only one tax return that needs to be filed for the Taxable Company, not two.\n\nAbove I mentioned how the profits that pile up in the Non-Taxable Company are not touched by the client, at least not until the right time. This is because the client is an Israeli, and again Israel is a much more complicated country than most.\n\nThe treatment of the Taxable Company is simple and easy. The client does not own the company, and as such there is no requirement to deal with the added Israeli tax issues.\n\nThe issue of the Non-Taxable Company is not so clear. It is a grey area. The client does not own the Non-Taxable Company, a trust owns it. The client has an option to take over the trust, and thus the Non-Taxable Company at any time, but until he executes that option it is not his company. He is not taking any of the money from that company. He is not benefiting in any way whatsoever.\n\nYou may ask: ***Why in the World would you want to do that????***\n\n>*REASON: Israel has a policy of granting ‘one time’ Tax Forgiveness for Israelis who have money offshore and then bring the money into Israel. Usually there is a one time tax of 10%, any tax violations are forgiven, and the money is now in Israel free and clear. These Tax Forgiveness programs take place about every 2 to 3 years.*\n\nThat is why the profits that the Non-Taxable Company makes must remain in the Non-Taxable Company… at least until the next Tax Forgiveness program is announced.\n\n>***WARNING****: I believe this system is legal in Israel, but I would not suggest you to go to the Israeli tax authorities and ask them for their opinion. In this case it is much easier (and safer) to ask for forgiveness than for permission. If you ask them, I suspect they are going to decide that what you are doing is illegal, and require you to submit all the funds to Israeli taxation. You might win in Israeli tax court, but it might take years and a lot of legal fees. I would not suggest you do this. Keep it simple: Company Number 1 is not owned by you, is a US company that pays US taxes, and pays you a generous salary. Company Number 2 is a wholesaler that Company Number 1 uses as a middle man. It is really none of your business what they do. Then when there is enough money in Company Number 2, and a Tax Forgiveness program is announced, you then declare the money and pay the 10% tax, and get a blanket forgiveness for whatever happened in the past.*\n\nFor non-Israelis it might be a bit easier to access the funds in the Non-Taxable Company. It will just depend upon the client’s citizenship and residence status.\n\n**REAL LIFE EXAMPLE:**\n\nTaxable Company\n\n* Annual Sales for Taxable Company: $2,000,000 USD\n* Annual Cost of Sales: $1,400,000 USD\n* Annual Corporate Operating Costs: $100,000 – $200,000 USD\n* Annual Salary to Client: $300,000 USD\n* Annual Taxable Income for Taxable Company: $100,000 USD\n* Annual US Corporate Income tax (about): $21,000 USD.\n\nNon-Taxable Company\n\n* Annual Sales for Non-Taxable Company: $1,400,000 USD\n* Annual Cost of Sales: $400,000 USD\n* Annual Corporate Operating Costs (will vary): $25,000 – $50,000 USD\n* Annual Income for Non-Taxable Company: $950,000 USD\n* Annual Income Tax for Non-Taxable Company: $0.00 USD\n\nI suppose you could say that the above $950,000 USD is tax free, but I prefer to think of it as tax deferred. Eventually, you are going to pay taxes on it, but at a time and circumstance that results in less tax not more.",
    "title": "Is this a valid tax planning strategy for a non-american?",
    "subreddit": "Accounting",
    "timestamp": 1617704910,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "Staffing Consultant: which state should I register my LLC or INC? I work as a middle-man to place Software Engineers on short-term contracts with different companies.  I am resident of Connecticut, and my partner is resident of Florida. I work with companies in different states (e.g. company A headquartered in Georgia but has office in New Jersey). The Software Engineer that I place is resident of New York. Where should I register my LLC or INC as primary state? and where should I register as Foreign Entity?\n\nI am in the process of contacting some lawyers and will share their response here. Meanwhile, it would be nice to know your thoughts.",
    "title": "Staffing Consultant: which state should I register my LLC or INC?",
    "subreddit": "consulting",
    "timestamp": 1614780062,
    "score": 1,
    "keyword": "man lawyer"
  },
  {
    "text": "An update of an everything is awful post, and an old man lost his horse. I wanted to write an update to: [https://www.reddit.com/r/LawSchool/comments/lbeeuu/another\\_everything\\_is\\_awful\\_post\\_but\\_can\\_somebody/](https://www.reddit.com/r/LawSchool/comments/lbeeuu/another_everything_is_awful_post_but_can_somebody/)  I was struggling to find anything to do over the summer towards the end of 2L . Got a bit discouraged. Several people read and commented and that helped me a lot. I've recovered, but hadn't made any updates. Just felt weird because it was a confession to strangers and what not.\n\nI did find a summer position with a solo-practitioner doing IP litigation. I was a little worried that he might be one of those \"patent troll\" lawyer but he's legit, great to work with, and we have legitimate clients with great cases. And I am getting some great experience and the attorney is giving me a great deal of advice. Things are way better than I expected (although I wish I had told him I want to start a few weeks later so I could take a vacation).\n\nThere's a Chinese proverb/fable,  **塞翁失馬**, which translates to \"old man lost his horse\". The story goes something like:\n\n>An old man lost his horse. His neighbors bemoaned the loss, but the old man said \"I don't know, it may be a good thing.\"  \n>  \n>The horse came back with a mate. His neighbors celebrated the gain, but the old man said \"I don't know, it may be a bad thing.\"  \n>  \n>While breaking in the new horse, the old man's son got thrown off  and became lame. Again, his neighbors bemoaned the loss, but the old man said, \"it may be a good thing.\"  \n>  \n>As it turned out, a horde of barbarians invaded. All the young men were drafted and died on the battlefield except the old man's son who was lame. The neighbors finally understood the old man's attitude and said \"every event in the world is just the old man losing his horse.\"\n\nI dunno. I'm not a great story teller and I don't know Chinese.\n\nA lot of things are difficult right now. In addition to the usual problems and personal problems, the events around the world and close to home feel unavoidable and suffocating. It seems easy to go to a dark place. But every event in the world is just the old man losing his horse.\n\nAnd now, when things aren't going your way, you can at least impress people by expressing your plight with a Chinese fable or something.\n\nAnyways, thank you r/lawschool. And I promise I will work to get to a position where I can call into a law school and say: \"give me your biggest loser that hasn't found work yet. I'll give him a chance.\"",
    "title": "An update of an everything is awful post, and an old man lost his horse.",
    "subreddit": "LawSchool",
    "timestamp": 1624941386,
    "score": 146,
    "keyword": "man lawyer"
  },
  {
    "text": "I hate my clinic. What was your experience like? 2L. The entire experience has been miserable. Professors who seem stretched too thin, partners who are 3LOLing, and clients who are constantly pissed off. No clear communication on how grades are determined. I am literally counting down the days until this is over. Thankful for the resume booster, but man do I wish I never signed up for this. It's made me not want to be a lawyer anymore. \n\nPeople who did clinics: What was your experience like? Did you receive a good grade?",
    "title": "I hate my clinic. What was your experience like?",
    "subreddit": "LawSchool",
    "timestamp": 1635519397,
    "score": 16,
    "keyword": "man lawyer"
  },
  {
    "text": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans] Noticeably absent:\n\n* University of Texas - Austin\n* Fordham\n* Iowa\n* Alabama\n* George Mason\n* Baylor\n* Notre Dame\n* Texas A&M\n* Kansas\n\n&#x200B;\n\n&#x200B;\n\n[https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/](https://www.washingtonpost.com/education/2021/01/12/157-law-deans-denounce-attempted-insurrection-effort-decertify-election-dont-name-names/)\n\nJanuary 12, 2021\n\nLaw Deans Joint Statement on the 2020 Election and Events at the Capitol\n\n&#x200B;\n\nWe are deans of a diverse range of law schools across the country. We do not use our positions to advance our individual views. But we do have an obligation to support the rule of law and preserve the integrity of the legal profession. On rare occasions, despite our differing situations and views, that obligation requires us to speak as one to defend the fundamental commitments of our profession. This is such a moment.\n\nThe violent attack on the Capitol was an assault on our democracy and the rule of law. The effort to disrupt the certification of a free and fair election was a betrayal of the core values that undergird our Constitution. Lives were lost, the seat of our democracy was desecrated, and our country was shamed.\n\nMany lawyers and judges worked honestly and in good faith, often in the face of considerable political pressure, to ensure the 2020 election was free and fair. However, we recognize with dismay and sorrow that some lawyers challenged the outcome of the election with claims that they did not support with facts or evidence. This betrayed the values of our profession. Our profession demands that when lawyers pursue legal action, they must bring claims in good faith, grounded in facts and evidence, and demonstrate respect for the legal system. Only then can lawyers fulfill their responsibilities as lawyers and public citizens to promote public confidence in the rule of law and the justice system — duties that extend to all professional activities, whether lawyers are representing a client or not. The rule of law is as much a touchstone of our profession as it is of our Constitution.\n\nAs law deans, our mission is to train the next generation of leaders to uphold the core values of our profession and sustain the rule of law. This should be a moment of reflection for legal educators and members of the legal profession. A sustained effort will be necessary to repair and preserve our precious democratic institutions. As legal educators and lawyers ourselves, we must redouble our efforts to restore faith in the rule of law and the ideals of the legal profession. We have enormous faith in the law’s enduring values and in our students, who will soon lead this profession. We call upon all members of the legal profession to join us in the vital work ahead.\n\n&#x200B;\n\nSigned,\n\n^(Alicia Ouellette President and Dean Albany Law School)\n\n^(Robert Dinerstein Acting Dean and Professor of Law American University, Washington College of Law)\n\n^(Jace C. Gatewood Dean and CEO Atlanta's John Marshall Law School)\n\n^(Melanie Leslie Dean and Samuel Belkin Professor of Law Benjamin N. Cardozo School of Law, Yeshiva University)\n\n^(Vincent Rougeau Dean and Professor Boston College Law School)\n\n^(Angela Onwuachi-Willig Dean and Professor of Law Boston University School of Law)\n\n^(Michael T. Cahill President, Joseph Crea Dean & Professor of Law Brooklyn Law School)\n\n^(Sean M. Scott President and Dean California Western School of Law)\n\n^(Reynaldo Anaya Valencia Dean and Professor of Law Capital University Law School)\n\n^(Anita K. Krug Dean and Professor Chicago-Kent College of Law, Illinois Institute of Technology)\n\n^(Charles H. Rose III Dean and Professor of Law Claude W. Pettit College of Law, Ohio Northern University)\n\n^(Lee Fisher Dean and Joseph C. Hostetler-BakerHostetler Chair in Law Cleveland-Marshall College of Law, Cleveland State University)\n\n^(Gillian Lester Dean and Lucy G. Moses Professor of Law Columbia Law School)\n\n^(Jens David Ohlin Interim Dean & Professor of Law Cornell Law School)\n\n^(Joshua P. Fershée Dean and Professor of Law Creighton University School of Law)\n\n^(Henry C. Strickland Dean Cumberland School of Law, Samford University)\n\n^(Mary Lu Bilek Dean and Professor of Law CUNY School of Law)\n\n^(Rodney A. Smolla Dean & Professor of Law Delaware Law School, Widener University)\n\n^(Jennifer Rosato Perea Dean and Professor DePaul University College of Law)\n\n^(Jerry L. Anderson Dean and Richard M. and Anita Calkins Distinguished Professor of Law Drake University Law School)\n\n^(Kerry Abrams James B. Duke and Benjamin N. Duke Dean and Professor of Law Duke University School of Law)\n\n^(April M. Barton Dean and Professor of Law Duquesne University School of Law)\n\n^(Horace Anderson Dean and Professor of Law Elisabeth Haub School of Law, Pace University)\n\n^(Luke Bierman Dean and Professor of Law Elon University School of Law)\n\n^(Mary Anne Bobinski Dean and Asa Griggs Candler Professor of Law Emory University School of Law)\n\n^(Deidré A. Keller Dean and Professor of Law Florida Agricultural and Mechanical University College of Law)\n\n^(C. Peter Goplerud Dean and Professor of Law Florida Coastal School of Law)\n\n^(Antony Page Dean & FIU Foundation Professor of Law Florida International University College of Law)\n\n^(Erin O’Hara O'Connor Dean and McKenzie Professor of Law Florida State University College of Law)\n\n^(William M. Treanor Dean & Executive Vice President Georgetown Law)\n\n^(Leslie E. Wolf Interim Dean and Distinguished University Professor Georgia State University College of Law)\n\n^(Eric C. Christiansen Dean of the Law School (Interim, 2020-21), Professor of Law Golden Gate University, School of Law)\n\n^(Jacob Rooksby Dean and Professor of Law Gonzaga University School of Law)\n\n^(John F. Manning Morgan and Helen Chu Dean and Professor of Law Harvard Law School)\n\n^(Danielle Holley-Walker Dean and Professor of Law Howard University School of Law)\n\n^(Austen Parrish Dean and James H. Rudy Professor of Law Indiana University Maurer School of Law)\n\n^(Karen E. Bravo Dean and Professor of Law Indiana University Robert H. McKinney School of Law)\n\n^(Gordon Smith Dean and Woodruff J. Deem Professor of Law J. Reuben Clark Law School at Brigham Young University)\n\n^(Jennifer J. Johnson Dean and Erskine Wood Sr. Professor of Law Lewis and Clark Law School)\n\n^(Matthew R. Lyon Vice President & Dean Lincoln Memorial University Duncan School of Law)\n\n^(Colin Crawford Dean and Professor of Law Louis D. Brandeis School of Law, University of Louisville)\n\n^(Lee Ann Wheelis Lockridge Interim Dean and Professor of Law Louisiana State University Law Center)\n\n^(Michael Waterstone Dean and Professor of Law Loyola Law School, Los Angeles)\n\n^(Michael J. Kaufman Dean and Professor of Law Loyola University Chicago School of Law)\n\n^(Madeleine M. Landrieu Dean and Judge Adrian G. Duplantier Distinguished Professor of Law Loyola University New Orleans College of Law)\n\n^(Gail Prudenti Dean Maurice A. Deane School of Law at Hofstra University)\n\n^(Cathy Cox Dean and Professor of Law Mercer University School of Law)\n\n^(Lincoln L. Davies Dean & Frank R. Strong Chair in Law Michael E. Moritz College of Law, The Ohio State University)\n\n^(Melanie B. Jacobs Interim Dean & Professor of Law Michigan State University College of Law)\n\n^(Patricia Bennett Dean & Professor of Law Mississippi College School of Law)\n\n^(Anthony Niedwiecki President and Dean Mitchell Hamline School of Law)\n\n^(Anthony W. Crowell Dean and President New York Law School)\n\n^(Trevor Morrison Dean and Eric M. and Laurie B. Roth Professor of Law New York University School of Law)\n\n^(James Hackney Dean and Professor of Law Northeastern University School of Law)\n\n^(James Speta Interim Dean Northwestern Pritzker School of Law)\n\n^(José Roberto (Beto) Juárez, Jr. Dean and Professor of Law Nova Southeastern University Shepard Broad College of Law)\n\n^(Jim Roth Dean and Professor of Law Oklahoma City University School of Law)\n\n^(Danielle M. Conway Dean and Donald J. Farage Professor of Law Penn State Dickinson Law)\n\n^(Hari M. Osofsky Dean, Penn State Law and Penn State School of International Affairs Distinguished Professor of Law, Professor of International Affairs, and Professor of Geography)\n\n^(Paul L. Caron Duane and Kelly Roberts Dean and Professor of Law Pepperdine University Rick J. Caruso School of Law)\n\n^(Jennifer Gerarda Brown Dean and Professor of Law Quinnipiac University School of Law)\n\n^(Gregory W. Bowman Dean & Professor of Law Roger Williams University School of Law)\n\n^(David Lopez Co-Dean & Professor of Law Rutgers Law School)\n\n^(Kimberly M. Mutcherson Co-Dean & Professor of Law Rutgers Law School)\n\n^(Elizabeth Kronk Warner Dean S.J. Quinney College of Law, University of Utah)\n\n^(William P. Johnson Dean and Professor of Law Saint Louis University School of Law)\n\n^(Judith Daar Ambassador Patricia L. Herbold Dean and Professor of Law Salmon P. Chase College of Law, Northern Kentucky University)\n\n^(Douglas J. Sylvester Dean and Professor of Law Sandra Day O’Connor College of Law at Arizona State University)\n\n^(Anna M. Han Interim Dean Santa Clara University School of Law)\n\n^(Martin H. Brinkley Dean and Arch T. Allen Distinguished Professor School of Law, University of North Carolina at Chapel Hill)\n\n^(Annette E. Clark Dean and Professor of Law Seattle University School of Law)\n\n^(Kathleen M. Boozang Dean and Professor of Law Seton Hall University School of Law)\n\n^(Jennifer M. Collins Judge James Noel Dean and Professor of Law SMU Dedman School of Law)\n\n^(Susan Westerberg Prager President and Dean Southwestern Law School)\n\n^(Michael A. Simons Dean and John V. Brennan Professor of Law St. John’s University School of Law)\n\n^(Jenny S. Martinez Richard E. Lang Professor of Law & Dean Stanford Law School)\n\n^(Michèle Alexandre Dean and Professor of Law Stetson University College of Law)\n\n^(Andrew Perlman Dean & Professor of Law Suffolk University Law School)\n\n^(Craig M. Boise Dean and Professor of Law Syracuse University College of Law)\n\n^(Gregory N. Mandel Dean & Peter J. Liacouras Professor of Law Temple University, Beasley School of Law)\n\n^(Dayna Bowen Matthew Dean and Harold H. Greene Professor of Law The George Washington University Law School)\n\n^(Christopher J. (C.J.) Peters Dean and C. Blake McDowell, Jr. Professor of Law The University of Akron School of Law)\n\n^(Thomas J. Miles Dean and Clifton R. Musser Professor of Law and Economics The University of Chicago Law School)\n\n^(Katharine Traylor Schaffzin Dean & Professor of Law The University of Memphis Cecil C. Humphreys School of Law)\n\n^(Sergio Pareja Dean The University of New Mexico School of Law)\n\n^(Benjamin Barros Dean and Professor of Law The University of Toledo College of Law)\n\n^(Lyn Suzanne Entzeroth Dean and Dean John Rogers Endowed Chair The University of Tulsa College of Law)\n\n^(Daniel M. Filler Dean and Professor of Law Thomas R. Kline School of Law, Drexel University)\n\n^(David D. Meyer Dean and Mitchell Franklin Professor of Law Tulane University Law School)\n\n^(Theresa Beiner Dean & Nadine Baum Distinguished Professor of Law UA Little Rock William H. Bowen School of Law)\n\n^(Kevin R. Johnson Dean UC Davis School of Law)\n\n^(Jennifer L. Mnookin Dean and Ralph and Shirley Shapiro Professor of Law UCLA School of Law)\n\n^(Darby Dickerson Dean and Professor of Law UIC John Marshall Law School, The University of Illinois at Chicago)\n\n^(Barbara Glesner Fines Dean & Rubey M. Hulen Professor of Law UMKC School of Law)\n\n^(Aviva Abramovsky Dean and Professor of Law University at Buffalo School of Law, The State University of New York)\n\n^(Marc L. Miller Dean & Ralph W. Bilby Professor of Law University of Arizona James E. Rogers College of Law)\n\n^(Margaret Sova McCabe Dean & Professor of Law University of Arkansas School of Law)\n\n^(Ronald Weich Dean and Professor of Law University of Baltimore School of Law)\n\n^(David L. Faigman Chancellor & Dean and John F. Digardi Distinguished Professor of Law University of California Hastings College of the Law)\n\n^(Erwin Chemerinsky Dean and Jesse H. Choper Distinguished Professor of Law University of California, Berkeley School of Law)\n\n^(L. Song Richardson Dean and Chancellor’s Professor of Law University of California, Irivine School of Law)\n\n^(Verna L. Williams Dean and Nippert Professor of Law University of Cincinnati College of Law)\n\n^(S. James Anaya Dean and University Distinguished Professor University of Colorado Law School)\n\n^(Eboni S. Nelson Dean and Professor of Law University of Connecticut School of Law)\n\n^(Andrew Strauss Dean and Professor of Law University of Dayton School of Law)\n\n^(Bruce P. Smith Dean and Professor of Law University of Denver Sturm College of Law)\n\n^(Phyllis L. Crocker Dean and Professor of Law University of Detroit Mercy School of Law)\n\n^(Laura Ann Rosenbury Dean and Levin, Mabie & Levin Professor of Law University of Florida Levin College of Law)\n\n^(Peter B. Rutledge Dean University of Georgia School of Law)\n\n^(Camille A. Nelson Dean and Professor of Law University of Hawai‘i at Mānoa, William S. Richardson School of Law)\n\n^(Leonard M. Baynes Dean and Professor of Law University of Houston Law Center)\n\n^(Jerrold Long Dean and Professor of Law University of Idaho College of Law)\n\n^(Vikram David Amar Dean and Iwan Foundation Professor of Law University of Illinois College of Law)\n\n^(Mary J. Davis Dean and Ashland-Spears Distinguished Research Professor of Law University of Kentucky J. David Rosenberg College of Law)\n\n^(Daniel W. Hamilton Dean & Richard J. Morgan Professor of Law University of Las Vegas, William S. Boyd School of Law)\n\n^(Donald B. Tobin Dean and Professor of Law University of Maryland Francis King Carey School of Law)\n\n^(Eric J. Mitnick Dean & Professor of Law University of Massachusetts School of Law)\n\n^(Anthony E. Varona Dean and M. Minnette Massey Professor of Law University of Miami School of Law)\n\n^(Mark D. West Dean and Nippon Life Professor of Law University of Michigan Law School)\n\n^(Garry W. Jenkins Dean & William S. Pattee Professor of Law University of Minnesota Law School)\n\n^(Susan H. Duncan Dean and Professor of Law University of Mississippi)\n\n^(Lyrissa Lidsky Dean & Judge C.A. Leedy Professor of Law University of Missouri School of Law)\n\n^(Richard Moberly Dean and Richard C. & Catherine S. Schmoker Professor of Law University of Nebraska College of Law)\n\n^(Megan Carpenter Dean and Professor of Law University of New Hampshire Franklin Pierce School of Law)\n\n^(Michael S. McGinniss Dean and Professor of Law University of North Dakota School of Law)\n\n^(Katheleen R. Guzman Interim Dean and Professor University of Oklahoma College of Law)\n\n^(Marcilynn A. Burke Dean and Dave Frohnmayer Chair in Leadership and Law University of Oregon School of Law)\n\n^(Theodore W. Ruger Dean and Bernard G. Segal Professor of Law University of Pennsylvania Carey Law School)\n\n^(Amy J. Wildermuth Dean and Professor of Law University of Pittsburgh School of Law)\n\n^(Vivian I. Neptune Dean University of Puerto Rico School of Law)\n\n^(Wendy C. Perdue Dean and Professor of Law University of Richmond School of Law)\n\n^(Robert Schapiro Dean and Professor of Law University of San Diego School of Law)\n\n^(Susan H. Freiwald Dean and Professor of Law University of San Francisco School of Law)\n\n^(William C. Hubbard Dean and Professor of Law University of South Carolina School of Law)\n\n^(Neil Fulton Dean University of South Dakota Knudson School of Law)\n\n^(Andrew T. Guzman Dean and Carl Mason Franklin Chair in Law, and Professor of Law and Political Science University of Southern California Gould School of Law)\n\n^(Robert K. Vischer Dean and Mengler Chair in Law University of St. Thomas School of Law)\n\n^(Douglas Blaze Interim Dean and Art Stolnitz and E.O. Overton Professor of Law University of Tennessee College of Law)\n\n^(Renée McDonald Hutchins Dean & Rauh Chair of Public Interest Law University of the District of Columbia David A. Clarke School of Law)\n\n^(Michael Hunter Schwartz Dean and Professor of Law University of the Pacific, McGeorge School of Law)\n\n^(Risa Goluboff Dean and Arnold H. Leon Professor of Law and Professor of History University of Virginia School of Law)\n\n^(Mario L. Barnes Toni Rembe Dean and Professor of Law University of Washington School of Law)\n\n^(Daniel P. Tokaji Fred W. & Vi Miller Dean and Professor of Law University of Wisconsin Law School)\n\n^(Klint Alexander Dean and Professor of Law University of Wyoming College of law)\n\n^(Chris Guthrie Dean Vanderbilt Law School)\n\n^(Thomas McHenry President and Dean Vermont Law School)\n\n^(Mark C. Alexander Arthur J. Kania Dean and Professor of Law Villanova University Charles Widger School of Law)\n\n^(Jane H Aiken Dean and Professor of Law Wake Forest Law School)\n\n^(Carla D. Pratt Dean and Professor of Law Washburn University School of Law)\n\n^(Brant J. Hellwig Dean and Professor of Law Washington and Lee University School of Law)\n\n^(Nancy Staudt Dean and Howard & Caroline Cayne Distinguished Professor of Law Washington University School of Law)\n\n^(Richard A. Bierschbach Dean and Professor of Law Wayne State University Law School)\n\n^(James McGrath Dean and President Western Michigan University Cooley Law School)\n\n^(Sudha Setty Dean and Professor of Law Western New England University School of Law)\n\n^(Allen K. Easley Dean & Professor of Law Western State College of Law at Westcliff University)\n\n^(Brian Gallini Dean & Professor of Law Willamette University College of Law)\n\n^(A. Benjamin Spencer Dean & Chancellor Professor William & Mary Law School)\n\n^(John E. Taylor Interim Dean and Jackson Kelly Professor of Law WVU College of Law)\n\n^(Heather K. Gerken Dean and Sol & Lillian Goldman Professor of Law Yale Law School)",
    "title": "Law Deans Joint Statement on the 2020 Election and Events at the Capitol [157 Law School Deans]",
    "subreddit": "LawSchool",
    "timestamp": 1610491035,
    "score": 17,
    "keyword": "man lawyer"
  },
  {
    "text": "Advise in Remote Document Review Alright, I have read the many posts on this forum where document review is considered a stagnant field not worth pursuing as a lawyer. I could use some advice.\n\nBackground: I am currently a 1L student, I have worked in a private firm, interned at a City Attorney's office, and had a mentor who works for state government related to law and public accommodations. My law degree is tailored towards technology and intellectual property (I will not be graduating with an extreme amount of debt). \n\nLast year I started remote document review work (at a paralegal level) and I absolutely loved it. I know this makes me the \"odd man out\" however, I do not find it to be soul-sucking or mindless. I enjoy working with the documents and having multi week breaks between projects. While the money is not incredible, for where I live it makes for a decent living (without a JD). I realize that for the companies I primarily work for (upon earning my JD) pay will increase for projects to $25-$40 an hour. \n\nWorking for these companies has brought me to realize, I may enjoy a career out of this such as potentially becoming a project manager and on up. Personally, I did not join the legal career for the more lucrative forms of law such as becoming a trial lawyer, etc.  Is it wrong that I am interested in a career in document review? Can anyone provide experiences from the lawyer side of it? \n\nThanks!",
    "title": "Advise in Remote Document Review",
    "subreddit": "LawSchool",
    "timestamp": 1639523584,
    "score": 2,
    "keyword": "man lawyer"
  },
  {
    "text": "Love the law - Hate law school I hate this rat race man. Before you say that it isn't ever going to end, I worked at a DAs office for like 6 years out of undergrad and know the culture of state service and love it. I don't like big law or private firms I'm here because I wanna serve the public. \n\nI hate how people passive-aggressively ask how your classes are going, the stazi mentality of academic honor codes, the unfeeling administration (endemic to all higher edu). Most of all, the yuppie nonsense about \"saving the ecosystem and saving the world\" boggles my mind. How can future lawyers not see that joining a system of exploitation won't ever fix the ecosystem or justice system. That all requires votes and shifts in culture, not a moucey white girl who works for big law who also took one RJ class. \n\nBut noooooooooooo Stacy from an unranked law school in a rural state with an average GPA is going to be making 300k right out of school by litigating on behalf of threatened frogs or homeless kids. I know duality and magical thinking are universally human but fuckin come on\n\nI don't get bothered by people flexing so much but I see red when that kind of duality is expressed ignorantly. Like if you wanted to help the homeless you can do that as a job (I did), why aren't you just honest with yourself about the fact you want more money... I can respect honesty but I detest greed cloaked in altruism.\n\nThe culture of law school though is the most toxic bullshit I've ever seen. This feeling is compounded by the fact that my school is circling the drain, it just dropped off the USA ranking. It's the only law school in our state and their insistence on doubling down on specialty areas of law only brings out-of-state people who turn around and practice in DC. No general practice programs, no criminal law focus, just some nonsense restorative justice classes that are less rigorous than undergrad classes. The state is suffering from a shortage of rural lawyers and the school can't be bothered all they want to do is be an NCO lawyer mill. \n\nThanks for coming to my tedtalk-rant. ILY all and wish you only the best but please if you're just becoming a lawyer to make money or swing dick... idk go sell real estate or sommin you'll make more for less work",
    "title": "Love the law - Hate law school",
    "subreddit": "LawSchool",
    "timestamp": 1630699565,
    "score": 4,
    "keyword": "man lawyer"
  },
  {
    "text": "What path i should choose I just graduate from law school and still wandering around to find my destination. So i wondering, what kind of lawyer should i be?\n\nI dont wthether i should enroll in corperate or get in civil \n\nI just want to enjoy life and be rich\n\nSo any kind man or woman can enlighten me",
    "title": "What path i should choose",
    "subreddit": "LawSchool",
    "timestamp": 1637077967,
    "score": 0,
    "keyword": "man lawyer"
  },
  {
    "text": "Pushing Hands (1991): A movie contrasting Confucian tradition with Western Life &#x200B;\n\n[ Sihung Lung as Mr. Chu  and  Deb Snyder as Martha Chu, his daughter-in-law](https://preview.redd.it/y9s3brwjheq61.jpg?width=338&format=pjpg&auto=webp&s=1169587db08c2da3e0924d70663722bd4675816c)\n\nI watched this movie last night on Amazon Prime. The movie starts with Mr. Chu practicing Taiji Quan in the living room while Martha is sitting rigidly at a computer. After the elderly man finished his routines, he set about making lunch for himself. Since there was no plastic wrap, he covered a bowl in aluminum foil and stuck it in the microwave. The first words that are spoken between them are from the woman who hears the crackling discharge as the foil sparked in reaction to being microwaved.\n\nAfter racing to the kitchen, she pulled the bowl out of the microwave, ripped off the foil, and held it up to Mr. Chu. \"NO METAL\" she snapped. \"NO METAL.\"\n\nThere was no reply. \n\nDuring lunch, Mr. Chu ate from the bowl with chopsticks. The woman ate a completely different meal of vegetables with bread. The meal was eaten in complete silence. \n\nIt took me a while to figure out that Mr. Chu was a retired Taiji Quan Master whose son Alex, had saved money for years in order to bring him to the United States. Martha was Alex's wife. The couple had a son, Jeremy who was played by Haan Lee. \n\n[Mr. Chu smokes outdoors while Martha tries to ignore him by reading a book.](https://preview.redd.it/bma6ybkymeq61.jpg?width=1280&format=pjpg&auto=webp&s=815d9969732d76cf00d2b68278457a5c4e26cce1)\n\nThis film is about the clash between eastern and western cultural values. Mr. Chu believes in traditional Confucian virtues. He does not speak English and has no interest in learning. Martha is an American novelist who is suffering from writer's block because she finds her father-in-law's presence in their \"cramped home\" distracting. She wants to move into a larger home which would have an in-law suite that would then allow her some degree of privacy while she writes. Although she has picked up a few words of Chinese, she does not speak enough to communicate with her father-in-law. \n\nAs Chinese Americans Alex and and Jeremy straddle both cultures. As a first generation ABC (American born Chinese), Jeremey attends a Chinese language school in an effort by the parents to keep him in touch with his culture. Alex disagrees with his wife about their \"cramped home\" and tells her that in China 4 families could live in a home of this size. He refuses to move because moving would mean that he would have to accept financial assistance from his mother-in-law. \n\nMr. Chu does not think much of American parenting skills. When  Jeremey asks to be excused from dinner, his mother tells him that he may leave after he finishes his milk. The father-in-law observed to his son that American parents think that all interactions with their children are business transactions that have to be negotiated. When Jeremey turns on the TV to watch cartoons, the old man deplores the senseless violence that his grandson is being exposed to. The translated conversation appears as English subtitles. \n\nWhen Martha asked her husband what the father-in-law had said, Alex tactfully mentioned the cartoons but left out any mention of his father's thoughts about American parenting. \n\nWithout saying more, I will simply observe that the characters have been introduced and the tone of the movie has been set. Will the four of these people be able to coexist in their home? If they are not able to live together, what will happen? \n\n[Mr. Chu uses his Taiji Quan skills to teach at the community center. ](https://preview.redd.it/9ll4polmneq61.jpg?width=688&format=pjpg&auto=webp&s=6327aaf8b15f6a8897b2469e86b477e94536e0b4)\n\nIt was somewhat painful to watch this movie. I'm a sixty year old 3rd generation American and a 1st generation ABC. Watching this movie brought back some bitter sweet memories of visiting my paternal grandparents in California. It also made me think about my relationship with my father. \n\nAlthough my father was the eldest son of his generation, when the time came for someone to take care of his aging parents, he declined to do this. He was employed by the U.S. Public Health Service as a tropical disease specialist and at the time this conversation first came up, he was on TDY (tour of duty) in Bangkok, Thailand. Taking care of his parents would have meant returning stateside to California and possibly ending his career. The responsibility for taking care of the parents fell to his younger brother who was a doctor with the California Public Health Service. \n\nAs with the Chu family in the film, my cousins were raised in a multi-generational home. Since my Uncle's wife was also ethnic Chinese, they were not raised in a biracial home as Jeremey was in the movie. \n\nWhile my grandfather did not practice Taiji Quan, he did meditate. He would sit on the floor in his Tang suit with his limbs cross legged under him and would remain absolutely still with his eyes closed in complete silence. \n\nUnlike Mr. Chu in the movie, my grandfather was a Presbyterian who had been converted to Christianity by American missionaries. My father tells me that when my grandfather caught his wife offering rice to a Buddhist monk,  he seized the monk by his robe and booted him out on the street while yelling in Chinese, \"HALLELUAH, I'M A CHRISTIAN!\" \n\nMy cousins all spoke some Chinese and attended a Chinese language school. They also attended a Chinese American church which offered bilingual sermons. I didn't speak Chinese at all and since my parents wanted me to assimilate into the American culture, they had made the conscious decision to not teach me any Cantonese.\n\nWhile my cousins grew up using chopsticks while eating Chinese food prepared by my grandmother and aunt, I grew up using a fork and a knife to eat American food that my mother made using recipes from a Betty Crocker cookbook. While they ate sticky rice, congee, and bao, I grew up eating spaghetti and meatballs, meatloaf with mashed potatoes, brown gravy, and peas, and pot roast with potatoes, onions, cabbage, and carrots. \n\nMy father has long since deplored the decision to raise me as an American because he thinks that I am much too independent.\n\nIf I were a dutiful son, I would have followed his advice to become a lawyer instead of becoming a teacher. I would have met a woman, married, and given him grandchildren. After he retired, I would have quit my job to move back to California to act as an adult caretaker for my aging parents. I've always wondered about the hypocrisy of this last expectation because my father declined the same request when the time came for him to take care of his parents.",
    "title": "Pushing Hands (1991): A movie contrasting Confucian tradition with Western Life",
    "subreddit": "asianamerican",
    "timestamp": 1617217919,
    "score": 7,
    "keyword": "man lawyer"
  },
  {
    "text": "\"men\" are not taking away womens abortion rights I keep seeing comments that men are taking away abortion rights, men are controlling womens bodies, abortion would be legal if men could get pregnant, etc.\n\nThis is largely ignorance and misandry.\n\n\n**In Alabama not only are the majority of pro-life voters women, but also the legislator that wrote the bill severely restricting abortions and the governor that signed the law that didn't have a vetoproof majority.** All I saw in the press was how \"old white men\" were restricting women's abortion rights. The voters, bill sponsor, and governor bore no responsibility. The blame was put entirely on the male legislators that voted for the bill based on their constituents wishes, but  is that honest?\n\n\nI can't find a direct link to PEWs results anymore, but PEW indicated that in **2014 58% of Alabama adults wanted abortion illegal in all or most cases - 49% of them were men and 51% of them were women**. Plenty of articles still around on the web that cited them. For example...\n\nhttps://eppc.org/publications/democratic-politicians-ignore-pro-life-women/\n\nVoting against what the people want doesn't work in a democracy. It ends your political career. Voting for what the people want gets you personally branded a sexist. Lose lose for the legislators.\n\nThe Texas house bill was also  sponsored by a woman legislator in the house\n\n\"Once that heartbeat is detected, that life is protected,\" said Rep. Shelby Slawson, the House sponsor of the measure said before the bill passed 81-63. \"For far too long, abortion has meant the end of a beating heart.\"\n\nhttps://www.nbcdfw.com/news/politics/texas-politics/bill-to-ban-abortion-after-6-weeks-given-preliminary-approval-by-texas-house/2624812/\n\n**Abortion is not men vs women.  In the US it is rural religious Republicans vs abortion.**\n\nHere are the numbers for people who support abortion in most circumstances for recent years. It is pretty equal with the split being only a few percent on either side. (Note: Men are the green line which is usually showing more support.)\n\nhttps://content.gallup.com/origin/gallupinc/GallupSpaces/Production/Cms/POLL/epzl_ukea0ghgz14q5fsxa.png\n\nVox did a breakdown by gender by country with similar results - \n\nhttps://www.vox.com/2019/5/20/18629644/abortion-gender-gap-public-opinion\n\nPEW says in 2019 60% of women and 61% of men say abortion should be legal in most cases. In 2021, women are slightly higher (61%) than men (56%).  It is always pretty close.\n\nhttps://www.pewforum.org/fact-sheet/public-opinion-on-abortion/\n\nThis is not a new trend.\n\nhttps://www.lifenews.com/2013/11/04/polling-data-consistently-shows-women-are-pro-life-on-abortion/\n\n\n\nLet's look at the reproductive rights \"the patriarchy\" that is \"controlling womens bodies\" has given men.\n\nAfter [Hermesmann v Seyer] (https://en.wikipedia.org/wiki/Hermesmann_v._Seyer) set the precedent, courts around the country have decided that male victims of women owe the perpetrators child support for decades, while other precedents (Roe v Wade) and laws (safe haven laws) generally allow female victims many options to get rid of the product of their rapes.\n\n> Hermesmann successfully argued that a woman is entitled to sue the father of her child for child support even if conception occurred as a result of a criminal act committed by the woman.\n\nE.g.\n\nAlabama man - https://law.justia.com/cases/alabama/court-of-appeals-civil/1996/2950025-0.html\n\nArizona boy - https://www.usatoday.com/story/news/nation/2014/09/02/statutory-rape-victim-child-support/14953965/\n\nCalifornia boy - https://www.chicagotribune.com/news/ct-xpm-1996-12-22-9612220045-story.html\n\nOthers in this paper \"Victims with responsibilities\" -https://lawpublications.barry.edu/cgi/viewcontent.cgi?article=1017&context=cflj\n\nThere are many others out there. I do not believe there has yet been a single case where a boy or man has gotten out of paying child support to an adult woman that statutory raped, raped, sperm jacked, etc.\n\nThe good news is that in recent years feminist lobbiests have pushed for laws to prevent rapists from getting child custody. Without custody the child wouldn't be raised by a rapist and the victim wouldn't owe child support. So the day that a male doesn't owe his perpetrator may be coming soon. The less good news is that just over half the states that passed these laws passed them as the feminist lobbiests proposed them - only preventing rapist **fathers** from getting custody. (https://www.ncsl.org/research/human-services/parental-rights-and-sexual-assault.aspx)\n\nTerrell v Torres recently set a precedent and invalidated a signed contract to let a woman use embryos created with her ex and have him owe child support. \n\nhttps://www.azcentral.com/story/news/local/arizona/2019/03/18/arizona-court-ruling-use-preserved-embryos-without-ex-husbands-consent-ruby-torres/3205867002/\n\nCourts have ruled the same way in Illinois and the US supreme court agreed.\n\nhttp://www.fathers4equality-australia.org/fathers-rights/woman-wins-custody-of-embryos-after-separation/\n\nCourts have ruled the same way in a very similar situation in Italy.\n\nhttps://www.ansa.it/canale_saluteebenessere/notizie/lei_lui/vita_di_coppia/2021/02/25/si-allimpianto-dellembrione-dellex-marito-anche-se-lui-dice-no_05230156-95ea-406a-aa7e-4e90cf2d7c93.html\n\nCourts ruled the same way in yet another similar case in Israel.\n\nhttps://he.m.wikipedia.org/wiki/%D7%A4%D7%A8%D7%A9%D7%AA_%D7%A0%D7%97%D7%9E%D7%A0%D7%99\n\nIn several other cases women who forged her ex's signature to implant have been awarded child support from the unwilling father. E.G. https://www.dailymail.co.uk/news/article-5687477/Ex-husband-ordered-pay-child-support-former-wife-forged-signature-undergo-IVF.html\n\n\nReproductive coersion of men is also an issue that would be drastically reduced with financial abortion.\n\n> approximately 10.4% (or an estimated 11.7 million) of men in the United States reported ever having an intimate partner who tried to get pregnant when they did not want to or tried to stop them from using birth control\n\nhttps://en.wikipedia.org/wiki/Reproductive_coercion\n\nAmerican talk shows for women encourage women to stop birth control without telling their partner with the applause of their audiences.\n\nhttps://youtube.com/watch?v=5CNHwhHWPoQ\n\nWhat about IVF with sperm taken from a condom without the man's consent?\n\nhttps://www.mommyish.com/woman-steals-ex-boyfriends-sperm-has-twins-sues-for-child-support-836/\n\nHow about when they only engage in oral sex which should have no pregnancy risk?\n\nhttps://rollingout.com/2014/02/04/woman-uses-sperm-oral-sex-get-pregnant-force-man-pay-child-support/\n\nHow about court orders mandating men give their wife sperm so they can impregnate themselves during divorce proceedings?\n\nhttps://theprint.in/judiciary/court-orders-man-to-donate-sperm-to-estranged-wife-who-says-no-time-for-2nd-marriage/255215/\n\nFinancial abortion would solve all the financial issues for victimized males and remove financial incentives for women to do these things, **but** many pro-choice folks immediately start making pro-life talking points that if he didn't want a kid he should have used a condom or kept it in his pants.  \n\n**Financial abortion is about bodily autonomy.** No out for child support forces a man to spend years of his life working to pay for a child he does not want. If he loses his job and is unable to pay, he will be locked in a cage.\n\n1 in 8 men in South Carolina jails are there for failure to pay child support. They are not given court appointed lawyers until they are $10k behind and most are arrested and lose their job way before that limit making it extremely difficult to pay.\n\nSrc: https://www.nytimes.com/2015/04/20/us/skip-child-support-go-to-jail-lose-job-repeat.html\n\nIn the US,\n\n> 66 percent of all child support not paid by fathers is due to an inability to come up with the money\n\nSrc: https://www.huffpost.com/entry/the-myth-of-the-deadbeat-_b_4745118\n\nMothers owing child support are more likely to not pay fathers than visa versa, but women are rarely jailed for it.\n\n> we found that 32 percent of custodial fathers didn't receive any of the child support that had been awarded to them compared to 25 percent of custodial moms\n\nSrc: https://www.npr.org/2015/03/01/389945311/who-fails-to-pay-child-support-moms-at-a-higher-rate-than-dads\n\n\n\n\nWhat choices do raped men and boys have in the US?\n\n- pay your rapist child support for 18-21 years - probably more than 5 years income that you can't use to better your own life\n\n- spend your adult life in and out of jail for contempt of court meaning you can't hold a meaningful high paying job\n\n- leave the US forever and never enter a country thst enforces international child support or extradition for contempt of court\n\n- ending their lives on their own terms\n\n\nThe Texas thing sucks, but there are still morning after pills, abortion pills, surgical abortion before six weeks in Texas, surgical abortion after six weeks outside Texas, and Texas was the first place in the world to get Safe Haven laws so a woman can abandon their baby and responsibilities at most hospitals and fire stations. Raped men don't have any of those much better options.\n\nSo when you read that these laws are discrimination against women and men have it better, or that pro-life is all about men controlling women's bodies, please speak up. Let the truth be known.",
    "title": "\"men\" are not taking away womens abortion rights",
    "subreddit": "MensRights",
    "timestamp": 1630708506,
    "score": 1236,
    "keyword": "man lawyer"
  },
  {
    "text": "\"Free Willy\" another article taking glee and glamourising the sick and barbaric act of women sexually attacking men and castrating them in acts of 'revenge'. https://web.archive.org/web/20210814103831/https://www.thesun.co.uk/news/15223029/women-who-chopped-off-penises-more-than-once/\n\nWe don't even need to think about what the reaction to a headline like this would be if it were a list of men cutting off their female partners' sexual organs. It would be written a thousand times worse even if it were just about men slapping their partners even if it were 'justified' by claims of infidelity.\n\nYet here we have a group of women who are often heroised for doing one of the worst things you can do to a human being and it is in the name of 'revenge' for things like cheating on them.\n\nFirstly, I strongly suspect a large number of them are lying about their partners cheating to give them an excuse for being psychopaths and the lawyers will be encouraging this. But imagine if men were all cheering in support of a man who beat his wife, let alone cut off her clitoris, destroyed her ovaries and stopped her from ever having sex again, because she cheated on him. Whilst the news story showed pictures of bloody women laying on the floor or in hospital with cheeky puns as a title. \"Ovaryaction as men ensures their partner will 'clit'erally\" never have sex again\".\n\nYou get the point. It's depraved, disgusting and makes me sick and depressed to my stomach.",
    "title": "\"Free Willy\" another article taking glee and glamourising the sick and barbaric act of women sexually attacking men and castrating them in acts of 'revenge'.",
    "subreddit": "MensRights",
    "timestamp": 1633862845,
    "score": 263,
    "keyword": "man lawyer"
  },
  {
    "text": "Update to my comment i made about my sexual assult at my job. So the other day i read how women use crying to get out of certain situations.  I commented how this girl i worked with grabbed my ass and smacked it as well like it was a normal thing to do. (Never knew her outside of work)   well she cried when i loudly told her to stop doing it and managment talked to me and tried to write me up.   I contacted a lawyer after i told my job i wanted to talk to our district manager.  (Corprate)   i filed a complaint against her with him and human resourses.   \n\nFast forward and my lawyer meets up with him and a couple of other big wigs.   (He had them pull the footage dating back 2 months prior to that meeting)   and as you guessed, it showed her doing it about 12 different times.   He laid it all out for them and how bad this could actually get and corprate met my demands and then some.   I got a nice raise, 3 weeks paid vacation, she got fired on the spot, and my general manager got 3 weeks suspension without pay for the way he handled the whole situation.   I also got a apology from said general manager and a promise to handle male sexual assult claims as serious as they handle womens. They also paid my lawyers fees.  It wasnt much since the lawsuit wasnt filed yet.   It was drawn up though ready to be filed.     (Justice!).  \n\nI have worked with this company for 5 years and havent had any other issues other then this one and man was it a big issue.  Took only a couple of days to get it resovled once my lawyer took over.   So all in all im satisfied even though i just wanted her fired.   Literally all i asked since i knew there was cameras that caught it.\n\nEdit to fix spelling and also to add: my lawyer is a pit bull.   He was outraged when he documented my statement with how they tried to write me up.  Its like it was personal to him.   Thats what made the difference.\n\nEdit #2:    i shouldnt have to explain this but im going to anyways for more context.   When i was underage i was raped 2 times.  Once when i was 8 by my babysitter and moms best friend.  She was charged with sexual misconduct, and the 2nd time i just turned 17 and went to reno with a fake id and was drugged by a 45 yr old women.  I didnt press charges for that one.    This is just to explain how im not cool with people of any gender just putting there hands on me like that.   (I had to explain that to my feneral managee because he thinks it was her just being \"flirty\" and me making a mountian out of a ant hill)",
    "title": "Update to my comment i made about my sexual assult at my job.",
    "subreddit": "MensRights",
    "timestamp": 1612971711,
    "score": 256,
    "keyword": "man lawyer"
  },
  {
    "text": "Welcome to Brazil, where sexist laws are passed I'm going to say something funny in Brazil. The entity responsible for statistics on domestic violence requires that only cases of violence against children, the elderly, and women be reported by the police stations. This makes it appear that women are the main victims of domestic violence. Now it gets thicker, men are in the lead with a lot of space ahead of women in terms of general violence. So statistically they are the ones who suffer the most from domestic violence, but here we will never really know, as the person responsible for this information creates a \"favorable\" environment for women. \n\nAnd how can not stop there. Here, due to sexist laws, a man who ends up in the ICU is less serious than a woman who is slapped. Here the penalty for a crime committed by a woman is lesser just for being a woman, and a crime committed against a woman has aggravations.\n\nAnd as if all this is not enough, in 2021 a law that opens a huge loophole for anything to become a crime against women was approved. In direct translation: \nLaw 14188 of 2021 also includes in the Penal Code the crime of psychological violence against women, to be attributed to those who cause emotional harm \"that harms and disturbs their full development or that seeks to degrade or control their actions, behaviors, beliefs and decisions ”.\nA fews days after this law, news came out of lawyers wanting to use this law because the boyfriend broke up with the girl. And as all this is not enough. \n\nNow they are trying to pass a new law, in which it decriminalizes false accusations of rape, something that has happened a lot here in the last few years, and in 99% of cases when the farce is found the woman is not penalized.",
    "title": "Welcome to Brazil, where sexist laws are passed",
    "subreddit": "MensRights",
    "timestamp": 1631872547,
    "score": 209,
    "keyword": "man lawyer"
  },
  {
    "text": "Falsely Accused - My Story Hey Everyone\n\nThis is a throwaway account because I do not want any of this in any way shape or form coming back to me, its a horrible nightmare I want to forget but I feel its important to share. \n\nI like to think that I am a good person and never in a million years could I ever see myself going through something like this. I am in my early thirties and run a small successful company consisting of roughly 20 employees. I started it myself and I always go out of my way to make sure that everyone working for me is happy, and they all are! I have worked for so many assholes and douchebags so I made sure that everyone who works for me is respected and feels heard. The place is relaxed, fun and most of all, stress free! I have male and female employees and everyone gets along. This all began when we were hiring for a new entry level position and had a current employee (I'm gonna make a fake name and call her Ashley) recommend a friend of hers. Normally I would not hire someone based on a friendship but I went against my better judgement and told her to have her friend come in for an interview. \n\nThis girl came in for the Interview (For the sake of this story, we are going to call her SCUM), Late, No resume, and reeking of pot! I smoke more weed than anyone I fucking know, but I wouldn't show up to a job interview smelling like I showered in bong water! She had a resume that was longer then the lord of the rings trilogy and everything about me said red flag with this train wreck. I do not want to go into more detail, I could, But I won't. Ashley asked me how it had gone and I told her pretty much what I just wrote above. I could tell from the look on her face that she was not surprised, but she then proceeded to \\*Pretty much beg me\\* to give her friend the job. She explained how she had a really rough childhood, and just got out of a messy relationship, and that no one gives her a chance, and on and on and on. I would have said no to any other person, But this woman had worked for me since I began the company, she had done a lot of work for me and handled things in my absence tons of times when I was away or off sick, she was someone I trusted! The position we were hiring for was on its best day a glorified receptionist, all the person had to do was answer phones and reply to emails, so I agreed. That was the BIGGEST mistake I had ever made!\n\nAfter just a week, EVERYONE HATED SCUM! She was rude, Ignorant, Abrasive, Confrontational, The entire mood of the work space was different having her there, it was like everyone was walking on eggshells. I had half the team ask me to get rid of her and I wanted her gone to, But I held out because Ashley asked me to give her at least one more week. It was the longest week of my life, I can not explain to you how much I HATED SCUM! When the time came to let her go, I did it with a calm and professional demeanor. When Scum arrived I asked her into the meeting room where Myself and another employee spoke with her. We let her know politely that it was not a good fit, and we were probably just going to leave the position vacant as we were not that busy, (a lie but we wanted to let her down easily). I have NEVER in all my life seen a more ugly exit! She began to cry and scream so loud that her words were not even comprehensible. She was screaming about men, and the patriarchy, and how people needed to die. She began throwing things from peoples work spaces, running around like a madwoman! No one put their hands on her but we had to corner her to force her out of the office, like a wild animal, and on the way out she kicked in and smashed our front door and a big glass window! It was crazy! The police were called and we all gave reports on what had happened. That day I let everyone off early and we all went out to go get drinks on me! (this was a bit over three years ago and pre-the virus)\n\nThat night, we all drank, Joked around, and laughed about how CRAZY Scum was. That was when we named her too! Ashley was coincidentally not here on the day of her firing! It all should have been over right then and there... But it was not.\n\nLife went on as normal for the next few weeks until one night, around 7pm, I got a knock at my front door. I opened to two police offers, a man and a woman. I am not a bad person and have NEVER broken a crime in my life! I have no police record! So having two police show up at my door randomly was quite the shock. I asked how I could help them and they asked If I was ... .... and I said yes, that's me. The male police officer took a step forward and told me i was under arrest for sexual assault. I was absolutely shocked, dumbfounded. The female police officer could see the look on my face and she actually said to me, and I quote \"I'm very sorry\"\n\nI was in absolute panic! I explained to them that I had NEVER done such a thing and it had to be a mistake, but they told me they couldn't speak to me or give me details until we got to the police station, I wanted to scream! I started to have a bit of a panic attack and I think the officers could tell, I asked if they could just let me get in the car and not be handcuffed but they explained that wasn't an option, and again, they both apologized, they were very good police officers and quite understanding. The female officer convinced her partner for them to handcuff me with my hands in my front, and they let me put a jacket over my hands so that too my neighbors and such it would look like I was carrying some stuff and just going with them for a ride. \n\nI felt like I was going to throw up, The entire ride I kept telling myself, they had to have the wrong person, this had to be some sort of mistake. When I arrived at the police station I found out it was not a joke. They informed me that Scum was charging me with three counts of forced sexual assault. Scum was claiming that I forcibly drugged her and entered her on three different occasions and also, just for fun on top of all that, Threatened her with death if she ever told anyone, Fun right? I was IN SHOCK! My first reaction was to begin laughing hysterically which to the police officers view probably looked like I was insane! They began asking me questions but I am a smart man and had more than enough movies and t.v shows to know that to do in this situation. \n\n\"I'd like to speak to a lawyer\" I said before hanging my head, this was a NIGHTMARE!\n\nLike I said earlier, I am a good person, I have never broken any serious laws and never been in trouble with the police. I run a company but we are small, we don't have lawyers. The police connected me with some public council at 3am and the conversation was short. He told me. SAY NOTHING! NOTHING AT ALL, EVEN IF YOUR INNOCENT! NOTHING! I thanked him and then he probably went back to bed. \n\nWhere I live, In Canada, this was my first experience with the courts, and it was a shit show! Scum had ZERO EVIDENCE, Just her word against mine! and the courts took that and ran with it, They were trying to put me in prison for 35 years! For the next few days I did not eat or sleep, I felt sick and I wanted to die! I wanted to go find Scum and strangle her and then end myself because I did not see a way out of this! \n\nI connected with a Lawyer who I did not have enough money to pay, I had to take out a loan just to get a consultation. I run my own company but I put everything I make back into it to help it grow, You need to make sacrifices and I keep just enough to live and barely enjoy myself. I explained to him that I was a good person, That I had 20 EMPLOYEES WHO COULD BACK ME UP, They could give character references, I explained how the times she said I was doing these things I was not even at the office! I was at home! I told him how I have had TONS OF GIRLFRIENDS, And I even spoke to a few exs about the situation and they said they would come to court and speak on my behalf saying this was ridiculous and not in my character! My lawyer just shook his head, he could see how desperate I was but he explained that the courts and odds were against me on this. He explained to me how, The victims now, do not need anything even remotely close to evidence. They only need a good story. He told he that everything I had mentioned are not things that can hold up in court, and that they have to go off her story, that's it. \n\nThe lawyer I worked with was also great just like the cops who had originally picked me up. He explained to me that this was not a game we play in court, calling in surprise witnesses and shit like that, my expectations were way off lol. He explained that it is more like a formula, we follow it and plug in the proper things in the right places and hopefully, the truth will prevail. He told me to go home, go back to work, Live my life like normal and that he would take care of everything. It was hard, going back to normal when I was thinking about my life ending, going to prison, spending all my time in a cell, worst of all for a crime I did not even commit. One thing I am thankful for is that NO ONE in the office believe the accusations Scum had made, Not a single person. Ashley cried apologizing and I was angry but I made sure not to show it, It was my fault for hiring the trainwreck and I couldn't blame her for a mistake I made. \n\nThis went on for THREE YEARS! Because of the Virus my lawyer was able to keep delaying things but the courts were aggressively trying to get me in so they could convict and put me away. Three years of court date adjustments, three years of meetings with my lawyer, Three years of hell. The only reason I am not in prison right now is because my Lawyer was able to get ahold of Scums police record and it was just as long as her resume! Not only has she had run ins with the police every other week, But she has accused more then 10 other men of this same crime! I do not know any of these other men, but I can only assume they wronged her in some way and she did this to get revenge, Like she did to me for firing her! My lawyer had a meeting at the court house and then let me know the charges had all been dropped. \n\nThree years, $30,000 in lawyer bills, and an indescribable amount of stress, but I am free. \n\nDuring these three years, I found the MGTOW community and the RP. I had my eyes opened. The amount of suffering, Stress, and pain I went through is hard to even describe. I had to fight for my life. And Scum... She gets to live her life, No punishment for making a false accusation, She gets to go on and more than likely do this to more men. Yet women everywhere complain how we live in a culture of rape, and to believe all women, These things make me wanna scream! I feel like I am taking crazy pills! \\*Insert Mugatu Gif here\\* The way men are shit on now is honestly a joke, and the saddest part is that the larger majority of women after hearing my story would probably still think I'm guilty! \n\nThe one thing I can count as a win, is that during these three years, My company took off. I began making over 20k a month, and easily paid off all my lawyer bills. My life changed during this time and for the better, Because now I have the RP and I am much more aware to what's going on around me. I try to introduce all my male friends to what I have learned but so many men are so deeply ingrained into the feminist agenda that they can't or are not willing to let go! It's this sort of male submissiveness that let people like Scum continue to hurt more people! But what is there we can do? The politicians are against us, The media is against us, Schools are against us, Hell even other men are against us. Men are truly an endangered species! \n\nI am going to stop here because If I keep going I am going to begin ranting and rambling. If you are currently going through a False Accusation. Here are my tips.\n\n1 - DO NOT TALK TO POLICE! Be polite, But your only words should be \"No Comment\"\n\n2 - GET A LAWYER! I am sure you are smart, I am smart, but guess what, WERE ALL FUCKING DUMB... Get a lawyer! You can't do this yourself. \n\n3 - Talk to your friends, you will find out who your real friends are REALLY QUICK lol!\n\nFeel free to message me on this account privately if you need advice, I will check it from time to time! I hope you are all doing well, And Good Luck Guys!",
    "title": "Falsely Accused - My Story",
    "subreddit": "MensRights",
    "timestamp": 1629860678,
    "score": 162,
    "keyword": "man lawyer"
  },
  {
    "text": "Men invited to job interview though job open only to women Anyone perusing my somewhat intermittent posting history will be able to tell that I was once part of a union, and that union began to implement policies which excluded white men from things solely on the basis of being white men, so I left.\n\nTwo members of that union, both white men, recently approached me for advice on a situation they'd encountered, because they knew I had been a committee member of some years experience. I immediately told them that I'd left, and why I'd left, and they explained to me that they knew all about it and that's why they'd approached me.\n\nThe situation is that we all work in the same industry where self-employed people are often interviewed for jobs of a few days' to a few months' duration. These men met when attending such an interview. Man 1 had been leaving while the other waited in the lobby, and as he passed, Man 1 said to Man 2 that he was wasting his time; the job was only open to women and that any men interviewed were invited only to avoid the appearance of a women-only hiring process. Man 2 went into the interview, asked whether any of this was true, and was told quite unashamedly by the interviewers that it was.\n\nIt had been their inclination to complain about this to the union, which would be a reasonable reaction to such a flagrant breach of employment law, not to mention wasting their time preparing for and attending the interview. However, they are both aware that the relevant union subcommittee is heavily influenced by hardline feminists, and  that the union has consistently tolerated flagrant breaches of the union's own rules as well as absolutely illegal behaviour.\n\nAs such these guys' concerns are unlikely to be meaningfully acted upon. Not only that, but they both independently raised the likelihood of deliberate attempts to smear their reputation in retaliation makes them cautious about even making the complaint. I couldn't give them much comfort; I suspect they're right.\n\nIn the end there are a lot of examples of this sort of thing and we can talk about it here on the internet until the end of time, but what can I actually *do* here? I'm not a lawyer nor can I afford to hire one. What concrete action can we take? We're just three guys.",
    "title": "Men invited to job interview though job open only to women",
    "subreddit": "MensRights",
    "timestamp": 1640464406,
    "score": 139,
    "keyword": "man lawyer"
  },
  {
    "text": "A UK/United Kingdom father reported that he only sees his son through a visitation center, after his son hugged him mom who was outside the room began shouting and then physically yanked her son out of visitation A UK/United Kingdom father reported that he only sees his son through a visitation center, after his son hugged him mom who was outside the room began shouting and then physically yanked her son out of visitation\n\nThe following is my response, reproduced here in the hope that it may help another father who is seeking justice and a positive relationship with his child or children:\n\nI am not a lawyer and this is not legal advice.\n\nI think you are alleging parental alienation and emotional abuse a form of domestic violence:\n\n> The new definition of domestic violence and abuse now states:\n> Any incident or pattern of incidents of controlling, coercive or threatening behaviour,  violence or abuse between those aged 16 or over who are or have been intimate partners or family members regardless of gender or sexuality. This can encompass but is not limited to the following types of abuse:\n\n> psychological\n> physical \n> sexual\n> financial\n> emotional\n\n> https://www.gov.uk/government/news/new-definition-of-domestic-violence\n\nYou may also believe a woman in your position would never be treated so poorly by the contact center as to have the father of her child rush in and snatch the child from her arms. This may be discriminatory:\n\n> Services provided by a public authority - taking legal action about discrimination\n\n> The law which says you mustn’t be discriminated against is called the Equality Act 2010. Discrimination which is against the Equality Act is unlawful.\n\n> If you’ve experienced unlawful discrimination by a public authority, like the police or local authority, you may be able to take legal action under the Equality Act.\n\n> https://www.citizensadvice.org.uk/consumer/discrimination-in-the-provision-of-goods-and-services/discrimination-in-the-provision-of-goods-and-services1/discrimination-in-services-provided-by-a-public-authority/services-provided-by-a-public-authority-taking-legal-action-about-discrimination/\n\nI would probably not file a complaint though, because you are able to see your child, but I might express my sadness at how my child is suffering  from witnessing mom's domestic violence in the contact center, and how I wish they would treat me and my child in the same manner as I know they would if I were a woman the other parent were a man.\n\nI would consider applying to modify child custody:\n\n> Apply for a court order\n> Follow these steps to apply for a court order.\n\n> Read guidance CB001 on making an application.\n\n> Fill in the C100 court form. You must show you’ve attended a meeting about mediation first - except in certain cases (there’s been domestic abuse, for example).\n\n> Send the original form and 3 copies of it to the nearest court that deals with cases involving children.\n\n> https://www.gov.uk/looking-after-children-divorce/apply-for-court-order\n\nEmergency complaint:\n\n> What evidence will I need to present at an emergency child custody hearing?\n> In order for an emergency custody order to be obtain one the parent making the application must present evidence and the need for emergency. A parent must typically show that the child faces “immediate harm.”  It is therefore important to note and write down the events that lead you to believe your child is in risk of harm. If you gathered this through a conversation with your child or the other parent then write this down, and collect any emails, notes or photographs which may be of assistance.\n\n> This evidence will be useful for both the emergency custody hearing as well as any subsequent hearings if you would like to apply for full custody.\n\n> https://www.kabirfamilylaw.co.uk/emergency-child-custody-orders/\n\nI would ask social workers when I could have my child away from my abuser and how long they intend to allow my child and myself to suffer as a consequence of her abusive behaviors.\n\nIf I am punished by being denied time with my child, I might consider a complaint due to the sexism of the contac center.\n\n> Please note, if your complaint is about a social worker you need to complete the online concern form instead. Raising a concern about a social worker means giving us information about something a social worker did, or information about the social worker themselves. \n\n> Raise a concern about a social worker\n\n> https://www.socialworkengland.org.uk/about/contact-us/feedback-and-complaints/\n\nIf I felt that reports to the court were factually inaccurate, I would consider filing a criminal complaint:\n\n> Perjury Act 1911\n\n> Perjury.\n> (1)If any person lawfully sworn as a witness or as an interpreter in a judicial proceeding wilfully makes a statement material in that proceeding, which he knows to be false or does not believe to be true, he shall be guilty of perjury\n\n> https://www.legislation.gov.uk/ukpga/Geo5/1-2/6",
    "title": "A UK/United Kingdom father reported that he only sees his son through a visitation center, after his son hugged him mom who was outside the room began shouting and then physically yanked her son out of visitation",
    "subreddit": "MensRights",
    "timestamp": 1634410667,
    "score": 99,
    "keyword": "man lawyer"
  },
  {
    "text": "Men’s mental health: why are we are trying to change masculinity rather than create male-friendly services? - British Holistic Medical Association [https://bhma.org/mens-mental-health-why-are-we-are-trying-to-change-masculinity-rather-than-create-male-friendly-services/](https://bhma.org/mens-mental-health-why-are-we-are-trying-to-change-masculinity-rather-than-create-male-friendly-services/)\n\nArticle above, but I recommend watch the video if you have time:\n\n[https://www.youtube.com/watch?v=vgHVkA2\\_hI8](https://www.youtube.com/watch?v=vgHVkA2_hI8)\n\n[https://www.youtube.com/watch?v=LHYRYKCIDxk](https://www.youtube.com/watch?v=LHYRYKCIDxk)\n\nBackground:\n\nFeminism had success worming its way into life via entering academia (and also via the domestic violence industry, that was another early area it got its money from and were feints gathered). People dont know that patriarchy theory in its modern form was basically invented in 1970 by Kate Millet and then intersectionality in 1990.... by setting up in gender studies deirptments, it created activists, journalists, bloggers, lawyers, judges etc..... from there all these feminise terms such as patriarchy and male privilege ended up in government policies\n\nThis is the start of MRA doing its own theories etc.\n\nThis is real MRA - \"construction\" not \"deconstruction\"\n\nGuys this is real MRA - construction. Talking about how bad things are e.g. misandry, negative options of men, falsely using toxic masculinity, to complaining about feminsim etc is \"DECONSTRUCTION\" and its just talking in an echo chamber to people who already agree with you. \"CONSTRUCT\" something instead. These guys above ARE CONSTRUCTING i.e. they are creating alternative research, ideas, theories to toxic masculinity \"man bad\" \"man patriarchy\" nonsense and menslib style bullshit. (read below what the amazing work they are doing) So SUPPORT THESE GUYS. Find them on social media, they have great accounts, share their work, buy their books, donate, send them emails of thanks. Do something useful for MRA, in terms of CONSTRUCTION. Deconstruction is being done by the anti-feminists. Don't mix up MRA with anti feminism at every turn when there is no point and it becomes a distraction. The main MRA reddit is becoming to look like Buzzfeed, there's like 100 anti feminist articles and 1 about improving mens issues.... im not saying dont post it, im saying post about mens issues, and just that too! For example post something useful about anti circ, not just rants about feminism and circucmsion.\n\nWho are these guys?\n\nMale Psychology Network - an amazing development in MRA, literally one of the biggest ones I think in the entire movement in recent times! Male Psychology Network actually produce proper male positive, non feminist publications, conferences, etc on men and masculinity. They are trying to get therapy to be tailored to men, and not this current anti male bullshit, toxic masculinity stuff... ([https://www.youtube.com/watch?v=fdQntHZSMWA](https://www.youtube.com/watch?v=fdQntHZSMWA)) They are very much pushing the agenda of stop male bashing and misandry in media, society, uni, academia. This is not of the menslib nonsense, and it is not idealogical. It is science based, and not agenda driven (ughhh man bad masculinity bad). The amazing thing is this is getting into universities. The book by the author (interview here: [https://www.youtube.com/watch?v=VB-Gpq7h9cs](https://www.youtube.com/watch?v=VB-Gpq7h9cs))\n\nhas been download over 5.5k (probably more now) times so is getting into universities. They set up UKs first male psychology module which is led by fantastic pro men non feminist professor.\n\nHere is interview with said professor at the International Mens Conference, which was online this year due to COVID:\n\n[https://www.youtube.com/watch?v=Lz9lfrJR2EM](https://www.youtube.com/watch?v=Lz9lfrJR2EM)\n\nThey are about to produce another book.... again this means actual proper mens psychology and gender issues that is not feminist, so something academic that can be used.\n\nAnother good development, you will be pleased to hear is there is a whole raft of psychologists and professors who are looking at male victims of DV in the UK... I've vetted these guys throughly, listened to dozens of hours of them speaking, this is the real deal, pro male approach none of this menslib style fake MRA stuff.... they get it, and they are flat out not feminists and go after feminism HARD for LYING about male DV. This is not some obscure stuff, its senior professors, heads of department etc. and they've even been published in anti male Guardian and can get mainstream attention. Look out next year as a lot of their research will be released next year. These guys are loud too, they will be all over social media, interviews, newspapers, doing conferences, podcasts, video etc. its not little obscure research papers that get forgotten about.\n\nHere is the blurb of the book:\n\n>Male Psychology is a new field. In August 2018, the membership of the BPS voted for a Male Psychology Section of the BPS. This means there are already around 2,800 BPS members who support what we are doing. However, there is, as yet, only one textbook on this topic (The Palgreave Handbook of Male Psychology & Mental Health, 2019) edited by Barry et al. This was released in March 2019 and has already had almost 5.5k chapter downloads from universities. As the interest in Male Psychology continues to grow, there will be an expanding need for further academic and practical knowledge on the subject. This new series, Perspectives in Male Psychology, will fill the gap that exists, and be the seminal book on this subject.",
    "title": "Men’s mental health: why are we are trying to change masculinity rather than create male-friendly services? - British Holistic Medical Association",
    "subreddit": "MensRights",
    "timestamp": 1610042417,
    "score": 100,
    "keyword": "man lawyer"
  },
  {
    "text": "JK Rowling helped me realize I was a woman and not just a transgender woman I'm a amab transgender woman. My whole life growing up in rural town I  had to fight the transphobia of society, my peers, and most of all myself. Some people say trans people make a choice when they transition. The choice for me was be miserable but safe, or be happy with danger. This isn't a choice anyone should ever have to make.\n\nAnyways after finally beginning my transition after years of denial I find myself drawn into a political war I want no part of. I am forced to fight for my own validation for being myself. Some want to use me to increase their influence, others want to exclude me scared of my own potential influence I may one day possess. \n\nAnyways the whole JK Rowling had been bothering me a lot lately.  I always liked the books when I was little, so I guess part of me  wants to be accepted by her. Yet another part of me felt something more important could be gleaned looking at it.\n\nWhy would a multimillionaire author against the advice of all her publishers, lawyers, advisors campaign so admentally claim that transwomen are not women? I don't know why she has such phobia to include fellow sisters whom are transgender into the category of 'women' but I could tell based on the massive twitter scuffle that occurred that this concept of 'woman' is extremely important to a lot of people. Before I had taken it for granted but since our concept of gender influences public policy which has real impact to people's lives I was forced to reassess my view on what being female meant to me.\n\nEven though I completely disagree with her I can atleast agree with her on the point that no one can tell another person what being a man or woman means to them. FYI Jo  that includes trans people too. If a trans person says their a certain gender you have to respect it in the same way you would expect others to respect your idea of gender. \n\nWhile I haven't accepted my female identity for very long this is what I have come up with so far as for what it means to me. For me being a woman has nothing to do with birth circumstances. To me being a woman is about having a loving heart. A heart that connects with all the people in her life, a heart that bleeds for other suffering whom are not in it. She loves her loved ones so much that sometimes she forgets to send a tiny bit of all that love she has to herself. She may be breathtakingly beautiful on the outside but her true beauty will always lie on the inside, her inner glow.\n\nThis is the aspect of being  woman for me that feels most defining. This the part of myself that I find most sacred now. Never again will I take this identity as female for granted. I want everyone to know that the only person who has to validate you is yourself. No matter what adjectives are used to describe a woman be it straight, lesbian, tall, short, young, old, cis, or trans. At the end of the day they are all women, and what that means to each of us is different for everyone. Know what this is for you and never let anyone convince its wrong because only you gets decide it.",
    "title": "JK Rowling helped me realize I was a woman and not just a transgender woman",
    "subreddit": "Feminism",
    "timestamp": 1621646156,
    "score": 7,
    "keyword": "man lawyer"
  }
]