[
  {
    "text": "Jobs Attainable with Bachelor's in Elementary Education that are NOT in Education? My brother, who is inching closer to 40, currently works for a charter school and the job is quite literally killing him. He is a successful educator with many years teaching as an ESL teacher in Korea and China (unfortunately experience gained overseas is worth pennies in the good old USA...) He is currently seeking work outside the field of Education and I would love to help him find something (I work in Human Resources and have helped friends find jobs on several occasions). He has a bachelor's in elementary education that he earned in the state of PA, and currently lives in NY (unfortunately he does not have his NYS teaching license, which limits his ability to apply for public school positions that would likely be much less stressful).\n\nWhat are some jobs that he may want to pursue that may accept his degree or his experience as a teacher so far? He must maintain a certain level of income, and part of his fear in leaving the field is a drop in salary - which is certainly reasonable. Even if we can identify certain positions worth aiming for while working on a budget to determine his true salary needs, anything at all would help.\n\nMy brother is a good man with a wife and child, but this job has forced him into a position in which he has begun taking medication and he is beginning to believe that he is a poor educator, which simply is not true. Any and all help is sincerely appreciated...",
    "title": "Jobs Attainable with Bachelor's in Elementary Education that are NOT in Education?",
    "subreddit": "jobs",
    "timestamp": 1569972143,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "I finally got my rapist arrested I am a male been lurking on the sub for a long time now and this seemed like about the right place to post this\n\nAbout a month ago I made a throwaway and posted my story on r/confessions \\- to keep it short and simple it was about how my sister's friend's dad pulled me into a room and, well... assaulted me. I was met with tons and tons of people telling me to go talk to someone, to talk to the police, etc, etc, but I was way too scared.\n\nYesterday my close friends (who i've told) began to encourage me more as they noticed I had been feeling more down lately and I guess they chalked it up to what happened. I finally realized that this man could also be a danger to not just myself, but to other people - like my sister, who like I said before is friends with this man's daughter so she does go over to his house a lot. Just thinking about it makes me shudder\n\nAt the end of the day i gave a very vague description to my socials teacher - something like \"I need to tell you something, a man did something sexually to me that I did not like\" along those lines and he took me to the office where I met with my vice-principal and counsellor and I told them the whole story. It was hard - I had to stop myself basically every sentence cause it was painful to have to remember it again.\n\nAfter that was done, they called the RCMP in - I was taken to the police station where they took my statement (which was basically everything I said at my school) and we had a chat with my mom. She then told me that she had grounds for arresting him tonight - which honestly surprised me, considering there was basically no evidence, and that he would be released 'on paper', which I don't know what it means but searching online it's something like he's going to be ordered to have no contact with me or something like that, I have no idea\n\nAnyway my friends have been congratulating me and giving me high-fives for what i've done, it seemed so scary at first but I realize now that it's such a huge relief that I don't have to keep this secret anymore\n\nPlease if you're in the same situation as me, tell someone - it'll only get better\n\nEdit: goddamn I just woke up and to see this massive outpouring of support... I have no words, I’m confident that this subreddit was the right place for this\n\nTo the people thinking that I made this up (for example one comment said that my writing had perfect fluidity and expression or whatever)... I could send you a picture of myself with a piece of paper or whatever??? I am a gifted student and one of the subjects my teachers say I excel in is English, so that does include a lot of writing, etc. I don’t understand how just because a lot of 14 year olds’ writing seems messy, the grammar is bad, etc since my post has better grammar I must be lying.\n\nAgain, thank you for the support 😄😄 made my day much better\n\nEdit 2: I’ve just been going through the school day reading all your comments and I feel like crying tears of joy... you all are so sweet and amazing, bless you all",
    "title": "I finally got my rapist arrested",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1559190420,
    "score": 13192,
    "keyword": "man teacher"
  },
  {
    "text": "I did it. I reported my sexual assault. This is exhausting. I just need to share my story.\n\nI was sexually assaulted by a coworker two weeks ago. It came from totally out of the blue. I sent him a message explaining how I felt, and his response made it clear that he did not take it seriously. I then decided to take action.\n\nI used the options available to me though my workplace. I decided not to involve the police, for a variety of reasons. As of today, his contract is being shortened to June (instead of two years beyond that). He is also on final alert; one toe out of line and he will immediately be fired. \n\nThis has all been so fucking draining. \n\nI really thought about just letting it go and avoiding him. But I am in the most supportive environment I've ever been in for this sort of issue. It was not a horrible assault, on the scale of severity; he was not violent, and I was legitimately not worried about him escalating to oral or vaginal forced sex at any point. I felt like I could handle re-living it, when many victims can't. I felt like I had a good opportunity to take action, and from that, an sense of duty to do so. For myself, for every woman who has been sexually assaulted, and especially for the women who can't bear to think about their assaults in order to get justice. \n\nMy boss (who I reported to) has been phenomenal throughout the whole process. He has been amazingly supportive.  We both are happy that the course of action was determined so efficiently, and I am pleased that there is a tangible result for what happened. \n\nI've been a shit teacher since it happened. I've missed a really important meeting. I've had a dream about being sexually assaulted by a man I trust. My eating is out of control. My sleep habits are shit. I've got piles of dishes in the sink. \n\nHe's not a dick. He sexually assaulted me, but I can see the other parts of his life. He is apparently a great teacher. He doesn't drink, do any other drugs, eat meat, or any other of a number of bad habits. He tries his best to be an honest, hard-working man. He's tall, dark, and handsome. He's well-traveled and well-educated. And based on his responses in the recorded interview, he 100% legitimately just doesn't understand how what he did is sexual assault. And I believe him. At no point have I ever thought he wanted to hurt me, or that he even thought what he was doing could be hurtful. It doesn't excuse what he did, but he is blindsided. \n\nI was really hoping that he would just be fired and then I wouldn't feel guilty. If he just went away, I could deal with it. I was mentally prepared for him to be arrested. But instead, I'm going to pass him in the hallways of the school until June. I might see his wife and young children from time to time. I haven't met them yet, and I dread seeing her for the first time. I already want to scream every time I hear someone casually mention his name, because 50% of the time, it's followed by some variation of \"the nicest guy ever!\" And he is nice, incredibly friendly and selfless, in every other interaction I have ever had with him or heard of him having with someone. He just doesn't respond appropriately to \"No.\" and physical resistance in dark places. \n\nWe both agreed to confidentiality. So, he can't slander me or the school for firing him without evidence. I can't spread word about him. I wanted it to stay quiet, and I welcome it, but it means that I can't talk to anyone other than the one fellow teacher/friend I told before reporting. We work at a boarding school a decent ways away from...anything, really. I have one person that I can talk to face to face about this, and this week, he isn't here. \n\nI've spent at least an hour, usually closer to two hours, every damn day since the assault actively doing something related to it. Meeting with my boss about options. Being interviewed for clarification questions. Gathering screenshots. Writing the most detailed account I possibly could about two hours of being assaulted. (Boy, that was a fun one.) Talking through everything with my teacher-friend who is in-the-know with some wine in hand. Listening to my attacker's version of events and his reasoning. Squeezing my pillow as hard as I could while repeatedly saying \"I said 'No!'\" as loud as I dared into it at 1am when I couldn't fall asleep. \n\nIt was so stereotypical it hurts. He told me he \"couldn't resist.\" He called me a \"tease.\" He said \"Please\" over and over as though that made everything okay. When interviewed, he claimed I never said \"No.\" He said I must have \"changed my mind\" afterwards. \n\nIn short? It's true. Reporting is so much fucking harder and worse than the event itself. And if this is how much it sucks for me, a relatively unemotional person whose assault wasn't severe by my own standards, I can only be horrified thinking about how much worse it could be.  My friends and boss have called me strong for doing this. I don't think I need to be all that strong. I will gladly deal with this if it is one step closer to more women not having to do this, and for women whose assaults were worse to not have to gather 10 times the amount of strength needed for what I'm dealing with.\n\nI don't think this is in the best order, by my thoughts aren't in a usual logical sequence. They keep jumping around.  I can think rationally about the chronological events and options for moving forward, but it's like my brain can't process the emotional response. I think that's what this post is for.\n\nTL;DR: Being sexually assaulted sucks. Reporting is way worse. My attacker genuinely isn't scum of the Earth. This feels like a #MeToo victory, but a painful, bittersweet one.\n\nEdit: Y'all, I eat meat, and I can still call it a bad habit. I listed it because HE, for religious reasons, considers it bad and therefore avoids it. \n\nEdit 2: For those confused and wanting details, I think this should cover the basics - It was a semi-public, dark space where he was between myself and the exit. \"No\" means no the first time, and the second and third and 15+ time. Men, when a lady says no to touching your dick, don't physically grab her hand and try to pull it to your crotch. Bonus points: Don't do it more than once. Don't take your dick out of your pants and try again in case that suddenly changes her mind. And in reverse, don't try shoving your hands at her crotch after physical blocks and \"No.\" Overall: \"No\" =/= playing hard to get (the part that he didn't seem to understand.)",
    "title": "I did it. I reported my sexual assault. This is exhausting.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548081972,
    "score": 11495,
    "keyword": "man teacher"
  },
  {
    "text": "I got pregnant in Saudi Arabia. I found out I was pregnant in a mall bathroom in Bahrain. I couldn't even buy the test in Saudi Arabia without fear of someone asking me for a marriage certificate. I'd been living there for 9 months and working at a University Preparatory Program with other ESL teachers. We all lived in a secluded compound and though we didn't have to abide by the rules of the Saudi women, my mind automatically turned to the prison we passed daily. An unmarried, unaccompanied woman. If I had been from any one of the countries with a less powerful strategic alliance I would have likely been jailed or worse if anyone found out. As an American, it was more likely that I would be deported. I told my boyfriend, of course, not that he was much help. He heavily pressured me to get an abortion before I even had time to process the position I was in I wasn't young; I could have done it. I even would have wanted to, if he had supported me.  As it was, he didn't and I didn't feel it was my right to force fatherhood on anyone. Not that anyone blamed him. \n\nI was stuck in a position where I was 5 weeks pregnant in a country where walking outside with a man who wasn't my husband was a crime. The stress was unimaginable. I contacted Women on  Waves and they promised to send a pill to a hotel in Bahrain. I requested an 'exit visa' for the weekend and gained permission from my employer for a weekend away. They didn't know why nor did they care. The bosses escaped every weekend to drink and sleep with prostitutes. They understood the need to get away.\n\nThe pill never came. We spent the weekend checking around at other hotels, seeing if a package had been sent to similar sounding guesthouses by mistake. My boyfriend got angry with me when I started crying, telling me it was just a clump of cells. I struggled with the decision I had to make, the frustration of being unable to have safe and easy access to an abortion, and the immense stress of worrying about what would happen if anyone found out.\n\nIn the end, I flew back home. I just needed to be with my family. My wonderful, amazing father picked me up from the airport and asked me what I wanted, which was the first time anyone had. I told him I didn't really know and asked him what he thought was best for me. He told me that he thought it would be better for me to wait until I was with someone who wanted to have children with me \"if I could live with it.\" It was so simple, but it was the first time I'd had anyone act like they understood that it was a hard choice, and that even if it was better for me, I still had to be able to accept it. That was the support I needed to go make the appointment. The only picketer was a sad looking older women who had a sign that said \"I regret my abortion.\" \n\nI don't. I'm glad I made the choice that I did, when I did, and now have a beautiful one year old daughter with a man that is a great father and husband. \n\nI'm thankful I don't live in the U.S. any longer. I've lived with the fear and uncertainty of being in a place where I had to hide my pregnancy and go away to try and have a chance at freedom of choice. I've lived with the stress of having so personal be governed. I may have had a hard time making up my mind as to what I wanted but at the end of the day I was able to make a choice. It hurts my heart what is happening in our country and that so many women will be left feeling scared and alone. I was in my mid 20s with a supportive family and financial resources and it was still one of the hardest experiences of my life. I can't imagine being a teenager, or lacking the financial resources to go to another state, or being in an abusive relationship and having to decide what to do. \n\nI am the one in four and I stand in solidarity with others.",
    "title": "I got pregnant in Saudi Arabia.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1558288159,
    "score": 6108,
    "keyword": "man teacher"
  },
  {
    "text": "to the woman at the pool This was 10+ years ago but I still think about you.\n\nI was 17 in my first semester of collage in an intermediate swim class. We were sharing a lane doing our laps when you stopped and put yourself as a barrier between me and this other man I honestly never noticed in our class.  You started yelling at him. I have no idea what you said. But you called a creep out for being creepy.  You brought the situation to the teacher who re arranged the lane assignments immediately putting creepy guy at the opposite end of the pool from all the female swimmers and me at the farthest end of the pool from him.\n\nYou didn’t stop there and neither did the teacher. You guys hatched a Scooby doo style plan.\n\nThe next class we kept our new swimming lane assignments you stayed by my side swimming in my lane between me and creepy guy.\n\nThe head of the swim department was there earlier than normal (I knew who she was since I had her as my lifeguard training coach, but I don’t think creepy guy knew who she was).\n\nBut today our teacher got in the pool to swim with the class (for relevance to this story was a hot young lifeguard fresh out of college) placing herself in the middle lane of the pool. \n\nClass went on as “normal” but creepy guy was still creepy guy and spent the class time diving under the water touching himself.  He was watching the teacher as she was swimming her laps as the department head watched him. \n\nShe saw enough. The guy was asked to get out of the pool, kicked out of class, and I am not so  sure what happened to him after that but my mom and I signed a paper after class and I never saw that creep again. \n\nThank you kind stranger for calling a creep a creep it left a strong impression in my young mind, Thank you amazing teacher for your quick action and for sacrificing yourself to expose the creep, thank you department head and thank you mom for your support.  Thank you ladies for looking out for little me who didn’t even fully grasp what went down.",
    "title": "to the woman at the pool",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1550010173,
    "score": 387,
    "keyword": "man teacher"
  },
  {
    "text": "Want to hear all those haunting stories... I want to hear everyone’s scary, haunting stories. I have two! One is mine and the other is my teachers.\n\nTonight, I’m in a residents room and I watched a CNA while I was across the hall helping another resident walk into one of my assigned rooms that had their call light on. It looked like a middle aged male with glasses, but maybe I saw it wrong. Anyways- I thought “Awesome! Thank you so much coworker for helping me out!!”\nActually, no. Not at all. Not my coworker and gave me the freights for the rest of the night!\nI am waiting for the light to flip indicating that someone was in the room, it isn’t turning on so I walk in to ask if I should take over- but no one is there. Okay? Maybe I saw something. Resident tells me his brother needs to go to the bathroom. I take it as a dream, but tell him I’ll help his brother to calm his nerves, and leave. \nHe pressed his call light again and the nurse and I walk in there this time. He’s telling us his brother won’t stop bothering him that he needs to pee, but says his brother dead. We talk about people visiting in the afterlife to deliver messages. But I’m assuming at this point that I saw his brother. \nThen, his light keeps going off every 2-5 minutes- but resident says he isn’t the one clicking it. Then, after turning off his call light one time, I start to hear a banging from behind the open door - so the door is against the wall. No one can fit behind it. Creepy.\n\nOther story is, from my teacher. It’s a more of a history lesson than a scary story, actually. But, the biggest metropolitan city near me had 32 man mounds (mounds with usually Native Americans burried in them with relics in the shape of animals or humans). Two gravel companies in the 1800’s dug them all up to make all the roads (kind of messed up to think the city is literally made on the bones of the native Americans; but it was only the 1990’s that we put the law in place to not disturb Indian burial grounds). One of these old man mound areas, I believe, became a Catholic cemetery - at least some of them made it there- somehow. They made a nicer, “prettier” cemetery on the other side of town about 30 years after this one. So, most of the family was still around to dig up their loved ones to move them to this new cemetery - because their mom’s deserved a prettier burial place. Well, not everyone made it over to the new cemetery [specifically three made it into a coffin together - a European, an American, and an ancient Native American (don’t quote me on the European, may have been another American), but who knows who didn’t make it]. There were kids playing baseball in it and using the headstones as bases, etc. Nothing was happening with this land with all these holes (since no one filled them in), and the growing town needed a hospital. So the Catholic church donated the land, and somehow this coffin with the mixed up bones of 3 people got put under a sidewalk next to the hospital. My anthropology teacher was on site when they went to expand the hospital and found the coffin.\nHis wife works for the other major hospital in town and that first hospital will send over their employees to the one she works at if they are short staffed. The nurses from the hospital built on the Catholic cemetery talk about how they see these ancient, 1800’s dressed woman float down the halls and apparitions all the time. \nThank you for attending my history lesson.",
    "title": "Want to hear all those haunting stories...",
    "subreddit": "nursing",
    "timestamp": 1550987473,
    "score": 12,
    "keyword": "man teacher"
  },
  {
    "text": "Positive phone calls really do matter I made 7 positive phone calls to parents for the students who made the highest scores on the test given today (it was a pretty difficult one), and most all of them were so excited. \n\nI had one student who had 9 documented calls from other teachers, and the notes were all terrible about the kid (he is kind of a stinker, but he really just needs to be pushed). When his dad answered, he said “Lord what did he do now,” and when I told him about how proud I was of his grade, the dad could NOT believe it! I’ve never heard a grown man giggle so much. It was incredible and so sweet. I’m excited for that kid when he gets home because of how happy his dad was. \n\nIf something good is going on with your students, call the parents. You may make a grown man giggle.",
    "title": "Positive phone calls really do matter",
    "subreddit": "Teachers",
    "timestamp": 1572914305,
    "score": 911,
    "keyword": "man teacher"
  },
  {
    "text": "How can I become a Bank Loan Officer? I have a bachelor's in History and am working as a substitute teacher currently. Having seen the movie \"Yes Man\" several times I have always wondered what it would be like to have a job like that. Where you meet clients and approve/reject their business loans. I'm sure there is more to the job. Is it a job that pays well? Is it one that is always hiring? Working as a sub I'm not sure if I have the patience to deal with 30 children everyday (I've been called horrible things by students, been kicked several times, etc.) and listening to other teachers I really want a job where I don't take my work home with me (literally or mentally).",
    "title": "How can I become a Bank Loan Officer?",
    "subreddit": "careerguidance",
    "timestamp": 1575301583,
    "score": 8,
    "keyword": "man teacher"
  },
  {
    "text": "Hello r/careerguidance, care to offer me some advice? Hello Redditors,\n\n&#x200B;\n\nThis is my first post in Reddit, and I'm writing to ask you all if you would share with me any advice (honestly, anything you can think of would be appreciated) regarding how I can proceed in gaining better employment. I am a 29 year old American living in the Los Angeles area. I graduated from college in 2012 with a BA in history, a subject that I love very much. Since graduating from university I have mostly worked in ESL teaching. I traveled to the Republic of Korea (South Korea) in late 2013, and worked there for a few years as an ESL tutor before returning to the states. I currently work in an ESL program at night and have a substitute teaching gig for a local school district. The night job is part time and I'm on call for the substitute gig. I'm aware that my pedigree at this point isn't impressive. I'm a somewhat cliche millenial specimen in that I went to college having no idea what I wanted to do for a career, and I was clueless about life in general. I'm floundering and I want to get out of this rut. At one point I had thought that I'd pursue a career as a credentialed high school teacher, but I've turned away from that. I took the LSAT in 2017, but cancelled my score (the logic games trounced me), and I'm skeptical about taking another swipe at it. \n\n&#x200B;\n\nAt this point I just want to be able to get into a job where I can use my brain and make a decent enough living to be able to set aside some dough at the end of the month. I've heard people tell me that I should apply to be a data analyst, but I have no background in metrics based stuff. I've thought about having a go at a sales job, or anything that a company would hire me for. I dread the idea of going back into food service, retail, or unskilled construction work (areas I worked in in the past), and if I can't find something decent I may just hop back in to the expatriate ESL game, even though that would be like taking a step back. So please feel free to impart any advice you wish to this Reddit newcomer. I appreciate any helpful input that you can offer. \n\n&#x200B;\n\nSincerely,\n\nA floundering young man",
    "title": "Hello r/careerguidance, care to offer me some advice?",
    "subreddit": "careerguidance",
    "timestamp": 1558037039,
    "score": 2,
    "keyword": "man teacher"
  },
  {
    "text": "What is a job and where can I get one? The title is a joke. As a matter of fact, I absolutely know what a job is.. I've spent hours, days, months looking for one. Job sites, apps, books, resumes, I used facebook and Twitter to look for advice- but never here. And I need some real help so it dawned on me that this might actually be useful. \n\nI am 34. I have spent the last 8 years as a stay at home mom. I have my degree in Secondary Education. I never really wanted to be a teacher. I wanted to do Crime Scene investigations, Psychology, or criminal psych. I was told I wouldnt find a job in any of those fields and because I had a kid that I should eba teacher like the rest of my family. I graduated in 2010. When my daughter turned 5, and started kindergarten I was going to teach but found out that my teaching certificate had lapsed. Upon finding this information, I reached out to the school I graduated from and the only way to reinstate was to take the classes they added to the curriculum since I graduated. Easy enough, except we moved further away from the school and are now 2.5 hours away. I looked into two other schools who say I would have to retake every class bc its almost been 10 years and because I already took those classes and I have over $24k worth of student loans- not that they would even give me more.\n\nDuring college, I flipped houses- which I loved. I would love to go back to doing that if my credit wasnt ruined. And I could convince my husband it's worth it. I was a bookkeeper/executive assistant, but I havent had a \"real job\" since 2011.  When my daughter started kindergarten I found out I was pregnant with our 2nd daughter.  So, again, I was forced to stay home with her since daycare is outrageous. She just started Pre-K.  It's time for me to go to work. \n\nLike i said, I'd like to flip houses. If I cant do that, I at least want to do something I will enjoy. Something I will love actually.  I have been looking for a list of all the jobs. Every job ever created or none to man. I have a certification. In EKGs, I am a certified professional organizer as well. But I need a J.O.B. \n\nIt is imperative. I have applied for 148 random jobs in the last month with no callbacks. I assume that employers see I havent worked in 8 years and assume I don't need to. That is not the case.. please help. I need a list.. to see if there is anything out there- anything out of the ordinary that might strike me. I wouldnt mind another certification, classes, more school even if I can find some way to get the money. \n\nT.I.A.",
    "title": "What is a job and where can I get one?",
    "subreddit": "careerguidance",
    "timestamp": 1566116585,
    "score": 2,
    "keyword": "man teacher"
  },
  {
    "text": "21m Broken soul, currently in trade school, but my passions lie elsewhere, care to read? Hi there ! I'm a twenty-one year old guy raised in a horrible toxic home, who has cut off nearly all ties with my family, my father hung himself a month before I graduated high school, and my mother has tortured me emotionally my entire life, and the awful mess of a divorce was the reason my dad ultimately ended his life. I can't even face my siblings because it would put me too close to her. My father was raped from ages 5-13 by his older brother, and because of that never had any peace in his life, drank and used Xanax constantly. A loving, attentive man, but his demons ultimately cost him everything, and the fact he married such a terrible woman and had kids with her destroyed him. \n\nI have worked two jobs since age sixteen and still managed to get good grades in all subjects, took advanced placement courses in all subjects, I was a first chair bassoon player and played tenor saxophone in the jazz band, I've taken piano lessons since age 6 and I taught myself the guitar in one summer, and was generally assumed to go on to university and do very well. I was even homecoming king my senior year. I wanted to be a philologist as I have been teaching myself Hebrew (had some liturgical Hebrew under my belt as my mother is Jewish) , ancient Greek and Latin since age 10, and my general interests are in the cultures and languages of the world. I spend hours a day researching languages and cultures, and my coworkers, teachers and professors were all amazed at the encyclopedic knowledge of the history of the middle East, and the cultures that exist there. \n\nThe only issue is that I am an addict just like my father, and spent two years following his suicide numbing myself with benzos, both prescribed and bought from the street, and I just continued working in two restaurants after i bombed a semester for attendance. I tried to kill myself three different times with drugs to no avail, and gave myself an acute kidney injury at one point. I still feel the same creeping pressure in my soul that I think that my dad felt. (Little family history: every male in my family, both grandfathers and their fathers, all killed themselves.) I don't want to end up like that.\n\nI'm sober now, and after paying the debt for one semester of school, I'm back learning welding with an emphasis in aerospace alloys and alluminum. It's great work and I really enjoy it, it's almost like learning a new instrument. \n\nThe thing is, I cant justify 30k-60k on a degree for things I have taught myself, and every millennial I have worked with is swimming in student debt with a degree they don't use. \n\nI want to work, I want to make money, but I feel like I'm cheating myself by not following my passions. I have always felt good that I am a self motivated learner, and devote large amounts of time to simply immersing myself in history and languages. It's a joy in my life that is second to none, and the fact that it can't be taken away from me, nor did I pay for it at all makes it even sweeter.\n\nBut I have no family support, have essentially been disowned, and the idea of taking out loans again is the most terrifying prospect I can imagine.\n\nSo how does someone like me, a motivated, shit eating, interested young man find a job in cultural studies? I would give anything to spend my life researching, but I simply cannot take on the debt for the SLIGHT CHANCE that my degree would help me land a job that probably doesn't exist. Then, for another thing I know for certain that I know significantly more than most of the peers I would have in college. I can anticipate there will probably be a lot of comments calling me a narcissist, but that's not the case. It's just a fact. I have studied for 10 years obsessively, and it's rare that I meet someone I can have a conversation about my interests, or even cares. I don't hold that against anyone, I dont expect anyone to care about the things I enjoy.\n\nI don't expect handouts, and I plan to make plenty of money when I leave school, but I will forever feel like I've cheated myself of what could be a truly intellectually fulfilling career. Does anyone in the field have any advice as to how they got started? I don't particularly want to be a teacher, as students generally aren't passionate about learning, nor do I feel would I enjoy coming in to see dead-eyed Gen-Z (I realize I am a total zed) idiots going through the motions like worms, plus the bureaucracy of it all makes me want to vomit. \n\nIf you read this, thank you.",
    "title": "21m Broken soul, currently in trade school, but my passions lie elsewhere, care to read?",
    "subreddit": "careerguidance",
    "timestamp": 1558666262,
    "score": 1,
    "keyword": "man teacher"
  },
  {
    "text": "Finding a mentor/guru for medium-long term relationship I've been working in industry for five years now as a .NET web developer (and a bit of Javascript) and whilst I have days where I think I've come a long way and am pretty competent, there are other days (usually when reading through a blog post or something) where I think man I suck I don't even know what \"X Y Z\" is, and \"I'm not a real programmer because I don't even know how to write multi-threaded applications\" e.t.c.\n\n\nI went self-employed a while ago to work from home so I could take care of a family member, and whilst I enjoy the more *free* lifestyle, it means I no longer work in a team of people I can go ask questions to, or have that person in the office who I decide to try and learn from.\n\nI miss learning (academically) because there was always a sense of structure, a syllabus you just follow and usually just following the prescribed course materials was good enough, and I am quite good at self-studying but honestly I am at a point in my life now where I would rather invest directly into myself and find a mentor / teacher who I could pay to effectively learn from, get guidance from, teach me things or tell me what I should be learning next.\n\nEffectively finding \"the top programmer in the office who would take me under their wing\" whilst flying solo.\n\nIs there anything (or to be honest, anyone here) that could help me find this type of relationship?\n\nThanks all",
    "title": "Finding a mentor/guru for medium-long term relationship",
    "subreddit": "cscareerquestions",
    "timestamp": 1562948150,
    "score": 0,
    "keyword": "man teacher"
  },
  {
    "text": "A story on why I chose to major in Accounting and why it is without a doubt the most challenging major in college business programs. Look, I did not mean to offend anybody who graduated college with a degree in Marketing. \n\nThese are just the facts:\n\nI graduated from a well known public university in the south, who’s business program was at the time ranked top 10 in the country (probably still is.) \n\nI knew I was going to do business, but it was not until I had the most unique teacher of my life for Intermediate Accounting when I decided I was going to major in it. This man was EXTREMELY intelligent. Most accounting professors are very smart, but the SEC would personally contact this man at an astronomical hourly rate if they felt his services were required. He thought this was hilarious, because the first time they called he made up an unreasonable rate to gauge his perceived value to them, only for them to quickly agree and add some on top. While very intelligent, he did have a funny sense of humor. This was a breath of fresh air because 99% of the rest of my professors were bookworms with zero personality. \n\nThe first day of class he said look to your left and then look to your right, one or both of those people will likely not be here in 3 weeks. He said this is not something to get bent out of shape about, some people simply do not have what it takes to major in Accounting. He admitted up front that this was a weed out class and he would make sure only the ones capable of handling the profession would pass the class. Then he said, if you are looking for multiple choice exams and a “hug me” major, Marketing is right down the hall. To me this was hilarious, because I personally knew plenty of people who walked into this class thinking they were going to be Accounting majors and ended up switching to Logistics or Finance. The professor made this career sound like only the top prospects of the business school could and would make it through to the end. I have always been one for challenges and I wanted to make sure if I spent all this money on a degree, that I chose one that provided the largest potential for a return on my investment. \n\nSure enough, after the first two exams and the last day to drop the class with a W instead of a WF or WP,  only 30% of the class remained. The other 70% were now conjuring up stories and excuses why they wanted to change their major or why they could not pass Intermediate Accounting. \n\nA few fun facts: I studied 100x as much as any other class for this class and BARELY made a final grade of a B. Now that I think of it, I studied 100x more for all of my accounting courses compared to my other classes. I legit would browse over my study materials for my marketing, logistics, and finance classes and get high B’s and A’s. I’m fairly certain I did not even study for my Marketing tests. \n\nNo disrespect to any other business major.",
    "title": "A story on why I chose to major in Accounting and why it is without a doubt the most challenging major in college business programs.",
    "subreddit": "Accounting",
    "timestamp": 1563839587,
    "score": 7,
    "keyword": "man teacher"
  },
  {
    "text": "Confession: I'm a Haitian girl and despite the fact that I love learning languages, I never liked the idea of conversing in Haitian-Creole with a white person or helping them learn the Haitian language. This may seem a bit prejudice, but let me explain. I'm an American girl of Haitian descent who is proud of my family heritage. Yesterday, when I was at work, during my lunch break I sat with two white co-workers (one was a Jewish man, the other a white woman) who were arguing about something. I greeted them but they ignored that and just continued to argue. I carried on with unwrapping my lunch, but once I asked what's up the guy explained to me that she was having trouble at her job when talking to customers because she didn't know how to speak Haitian-Creole.\n\nThe guy just turns to me and ask if I'm Haitian. I say \"Yes\" and then he's just like \"Teach her some Haitian-Creole\". That annoyed me because he was basically giving an order after not even greeting me, that fucker!\n\nThe woman explained to me her further problem to me while I was already uninterested in sharing any knowledge of the language with her despite us being friends (You could guess why). I speak at a good level but am not fluent, but plan to improve because I use it for my job almost every day as well and sometimes speak to family in it.\n\n\n After thinking about it for a second, since she needed help with her job I offered to help and teach her to say a couple of necessary phrases she needed to know and encourage her to learn. We're on good terms and friends at this point so I don't mind helping her. The guy, on the other hand, who claimed that he had learned 30 words so far of Haitian-Creole, I would definitely not help. He's kind of conceited and everyone else sees it but never says anything. So teaching him is off-limits.\n\nNow, the main reason, I usually don't like the idea of teaching white people our parent's maiden language is because most of us know how many white people operate, especially when it comes to non-white cultures especially black people. Lots of them have been learning our languages and opening up shops in Haiti, and taking advantage of some of the people. When I was a kid going to a private school, the nuns at our school who were all white always told us not to speak Haitian-Creole among ourselves, meanwhile they would gladly speak Canadian French among themselves. Growing up, I witnessed some actually racist white kids in our class try to learn the language and speak it back to us and some of the Haitian kids trying to teach them a couple of words. It always bothered me deep down, even though I never vocalized it.\nWhen I got to college, I was taking a medical course at Massasoit and witnessed this white man complaining and arguing with a Haitian immigrant studying with us in our class because he didn't like how we cook our meats at barbecues. Later when a person dropped in while we were practicing with medical equipment, he and the Haitian lady started speaking French and a white professor and that white guy were like \"Oh, they're talking about us, Guy\". Even if she said it as a joke it rubbed me the wrong way because I remember a teacher in 8th grade talking about how she thought it would be better if the kids spoke English and not Haitian because they worry about them plotting things against them in that language.\n\nFor me, as long as many of them continue to act so arrogant and exploit communities while benefiting from it or being remotely racist towards Haitian people, I will not be up for being some white person's Haitian-speaking teacher/learning buddy. Weirdly, I feel more comfortable helping a person of any other racial background but them. For me, it's like teaching them how to do bantu knots or cornrows and them watching them flaunt the look like it's always been theirs.",
    "title": "Confession: I'm a Haitian girl and despite the fact that I love learning languages, I never liked the idea of conversing in Haitian-Creole with a white person or helping them learn the Haitian language.",
    "subreddit": "blackladies",
    "timestamp": 1557617704,
    "score": 164,
    "keyword": "man teacher"
  },
  {
    "text": "My mom supports R.Kelly........ Tw: sexual abuse/statutory rape mentions \n\n\n\nThe title says it all. \n\nI love my dear mother, but I’ve overheard her on the phone with my stepdad last night talking about the R.Kelly documentary... \n\nMy mom has always been a big R.Kelly fan throughout my 22 years of life. Growing up, she would buy his albums, sing along to his songs in the car, and would always hype him up. I am her only child and her only daughter, and as a kid of the 2000’s, I didn’t really care about her love for R.Kelly. I mean I thought his songs were ‘catchy’, but you know I was child then and I was super unaware of the trials and stuff. I remember her mentioning it once, but I was really too young to understand what was going on with him.  \n\nFast forward to today, I couldn’t believe what my mom had said last night about the victims. My stepdad is a problematic xenophobic misogynistic pos anyway, so I already know how he feels about the documentary. So I ain’t gonna touch on it about him. But my mom though? I live with her currently and it’s just the two of us in this medium sized house. My stepdad doesn’t live with us. Anyways, I’ve only overheard some of their conversation about the documentary and my mom was saying things like “If they were being abused like that in such manner, why they just couldn’t leave? It’s not like he had a gun to their head? He is old and fat now, what they want with him anyway? Also, they just all in it for the money” \n\nWhen I’ve heard that coming from my own mother. The lady who gave birth to my black woman ass literally almost 23 years ago, I literally became triggered and started having PTSD flashbacks of my very first sexual encounter with a male. He was my 20 year old neighbor up the street and I was 13-14 years old at the time. I tend not to think or talk about that experience, but hearing about all the grooming and abuse that R.Kelly did to all these girls and women is making me have flashbacks of forgotten memories of sexual trauma. I’ve been through some very traumatic shit these last nine years and the earliest memory I have was when I was 13 years old in my 7th grade math class and my male classmate (who I was also crushing on at the time) was sitting behind me and touched my boob out of nowhere and without of my consent. It happened so fast, I didn’t know how to react nor how to feel and then he apologized and was like “Sorry, I just wanted to see if you had a bra on that’s all”. My teacher was too busy teaching and all my other classmates who were around us just thought it was funny (I was the most hated girl at my middle school and they all made fun of me at any chance they got). But yeah, I can go on and on all day about all the shit I’ve endured from men throughout various points of my life, but I rather just focus on my mother on this post, ya know. \n\n\nPoint is, this lady has a black daughter. I could’ve simply been one of those girls. Who gives a fuck if he’s “talented” or makes ‘catchy songs’? THE MAN IS A SICK DISTURBED SON OF A BITCH AND HE DESERVES TO BE PUT IN SOLITARY CONFINEMENT!!!! DEADASS, B!!!!!!!! Fuck R.Kelly, yo and fuck those who are supporting his nasty pedophile triflin ass! \n\nMy mom doesn’t have much knowledge nor any idea of the sexual trauma that I have been through from ages 13-21. Except for one experience that happened to me in middle school and she gaslighted me for it by not telling the teacher soon enough. That’s a whole another story for another day. After the documentary went off, she did try knocking on my door for my attention, but I told her to go away. She didn’t like it and took it as typical ‘back talk’. Y’all know how black parents are with that shit. My mom and I aren’t talking much right now and I can sense she’s tight with me. I got on the phone with my boyfriend afterwards and I was just screaming at him. Last night was indeed a mess and I’m not sure if I can bring this up to my mom? Not about my sexual trauma, but how she is wrong for supporting a man who literally has evidence against him of being a sick monster to little children!!!! I’m gonna definitely center myself in that conversation and be like “It could’ve been me. It simply could’ve been me.” \n\nI’m just trying to move tf out again for the third time! I’ve been back home for two months and memories from my far and recent past are coming back to haunt me. I don’t like being here. Especially around my parents when they spew problematic shit around me and they thinks it’s okay. NO TF IS NOT OKAY!!!!!\n\n\nY’all I’m so sorry with this long ass post, took me a lot to write this shit out. I’m so disturbed right now by being around her. How dare you say that about people who the took courage to go against this monster publicly?!?!!! My mom is just as sick if she’s going hard for this bastard. Smh.",
    "title": "My mom supports R.Kelly........",
    "subreddit": "blackladies",
    "timestamp": 1546797179,
    "score": 53,
    "keyword": "man teacher"
  },
  {
    "text": "Rant:Pissed off at my son's Grandma and Aunt. This be a man rhetoric.. Hey Raggedy Ann, how about we don't tell little boys to \" be a man\" as a parenting tool? Your daddy was bad and all your relationships have burnt down in flames. Maybe you should study one first. I believe toxic masculinity starts when people who have no freaking idea on what a \" man\" is decide they going to be someone's teacher. \n\n(I already limit the amount of time he spends with them, matter of fact he opts out being around them. )",
    "title": "Rant:Pissed off at my son's Grandma and Aunt. This be a man rhetoric..",
    "subreddit": "blackladies",
    "timestamp": 1549361498,
    "score": 40,
    "keyword": "man teacher"
  },
  {
    "text": "I am a feminist. At least I thought so. I'm sorry. I didn't really know about all of the issues men go through. I only had my own experiences as a woman to go on, which meant that, as pretty much all humans are wired to assume from their own experiences, I was probably worse off by being the gender I am. I want to thank this sub for existing, as most posts I've read have encouraged me to do more research and see how men have it worse, at least in many situations. Before I had been thinking about how, if I became a math teacher, I'd be leaving myself open to parents who thought their children shouldn't be taught something like math by a woman. Now I can think about how some parents react to their children being taught anything by a man. How that's just not right. I just wanted to apologize for my assumptions. I had even assumed that Men's Rights groups in general were toxic places, because I read one rant from a guy about how he wanted to kill all women for treating him like garbage throughout his life (though the only way he cited how was ignoring him). I'm sorry for ignoring a whole group for so long because of one extremist. I'm also sorry if this entire post is off topic and gets me banned, I don't entirely know how reddit works yet. I think I'm still a feminist, but only by my own definition, where I'm looking for equality, the same as you. And that obviously now means fighting more for men's rights. Thank you for showing me that.",
    "title": "I am a feminist. At least I thought so.",
    "subreddit": "MensRights",
    "timestamp": 1569816242,
    "score": 1142,
    "keyword": "man teacher"
  },
  {
    "text": "Toxic Feminity is... Toxic Femininity is when a woman tricks a man into raising a child that isn't his.\n\nToxic Femininity is when a woman lies about physical or emotional abuse in court to gain custody of the children.\n\nToxic Femininity is when a woman marries a man only for his money.\n\nToxic Femininity is when a mother says bad things to her child about the father behind his back.\n\nToxic Femininity is when a woman makes a false claim of sexual assault.\n\nToxic Femininity is when women use social media to cyberbully boys into believing their gender is inherently evil.\n\nToxic Femininity is when women expect a man to pay for everything.\n\nToxic Femininity is when a woman hits a man and expects to get away with it because she's a woman.\n\nToxic Femininity is when female teachers give better grades to female students, just because they are girls.\n\nToxic Femininity is when women shut down the conversation about male homelessness and suicide because it doesn't fit their narrative.\n\nToxic Femininity is when women say, \"the future is female\" right in the face of their sons.\n\nThis is what Toxic Femininity looks like.\n\n--\n\nDid that make you feel uncomfortable?  Did you feel like that was a little bit of an over-generalization?\n\nGood.  Now you know how most men felt when they saw that Gillette ad.",
    "title": "Toxic Feminity is...",
    "subreddit": "MensRights",
    "timestamp": 1547575378,
    "score": 976,
    "keyword": "man teacher"
  },
  {
    "text": "The real truth behind \"Believe Women\" that no one will ever acknowledge **\"Believe Women.\"**\n\nThis phrase is heard almost everywhere nowadays, from the workplace to schools to homes to online spaces. No conversation is safe from it. Whether mundane or obscure, social or legal, friendly or combative, any and all dialogue is subject to hearing this trite expression. Still, despite its popularity, I think most rational people simply dismiss the attempted mandate of \"Believe Women\" without giving it much thought, since they are wise enough to accept the reality that people are never always honest, and never always correct in their memories, and never fully familiar with the minutiae of laws to objectively apply them to personal situations, etc. However, when you stop and take a moment to actually consider the idea of \"Believe Women\", it is clear that this condescending directive has a much darker, more sinister mind-set that cannot be divorced from its seemingly positive message.\n\n**\"Don't Trust Men.\"**\n\nThere is no getting away from it; these two phrases are equivalent. One cannot see women – as a group – as being inherently honest, correct, and expert legal authorities, without the associated baggage of painting all men as dishonest predators along with many other pejorative consequences. In order to believe women, you have to view men as fundamentally untrustworthy.\n\nSo, given this implicit relationship, what are the characteristics of a society where campaigning for the systemic mistrust of men is considered a positive and worthwhile effort? In a world where \"Believe Women\" is so common, the pejorative perceptions of males will grow accordingly and that must have an impact after all. Well, as you'd expect, viewing men intrinsically as vile, depraved animals has many negative repercussions for males. While it used to be only [men teaching or caring for children who were held in such disdain](https://www.reddit.com/r/Teachers/comments/662j9c/is_there_really_a_fear_among_male_teachers_about/), in the last few years it has become any high-status male in any job who began fearing for their reputation and career, and that was immediately followed by all men in any workplace being placed under suspicion. Now it is simply a fear of men everywhere in every social interaction, whether from [just reading a book in the park](https://www.reddit.com/r/MensRights/comments/d9mjf8/had_the_cops_called_on_me_yesterday_for_sitting/) to [someone kindly trying to help a lost child](https://www.reddit.com/r/MensRights/comments/6jsa2o/a_man_helped_a_lost_toddler_find_her_parents/) to [a man just trying to do his job](https://www.reddit.com/r/MensRights/comments/1i6qc6/i_ask_2_girls_to_leave_private_property_i_end_up/).\n\nSo how does this feeling of being under constant suspicion and scrutiny affect men mentally? Well, as you might expect, it is overwhelming and very stressful for men on a daily basis. It may be useful at this point to consider the well-documented and somewhat less controversial stories of men working in the early education system. \"[I live life on the edge every day I step into the classroom](http://archive.is/MXJ53)\" is a quote from one such teacher of young children. Honestly, as I read through some of the other quotes in the linked article, like \"The fear[...]is always present in your mind\" and \"[...]very, very stressful. It really makes you think, 'Why bother!'\" and \"After the suspicion, I seriously reconsidered my career choice...\" I find myself nodding in understanding, despite never having worked in that field. I empathize because these are the same views that men are now bringing to dating and relationships, work, and social interactions in general, and this is likely what is driving a lot of the phenomenon of male social isolation that is becoming so widespread.\n\nAnd unfortunately, there is no good news to share about where this is heading.\n\nAgain, let's consider men's participation in early education and the trends there, and doing so we see that no country has done anything significant to combat the gender disparity in this female-dominated field, despite a fair amount of social pressure to do so starting in the early 2010's. [This blog post](https://workinprogress.oowsection.org/2012/09/22/early-childhood-education-no-place-for-men/) from 2012 is a perfect encapsulation of the initial attitudes and attempts, and it spells out for men nowadays just how stressful and unhealthy things are going to remain for the foreseeable future under \"Believe Women\". I say this because the person writing this blog post shows no compassion for the teacher named \"Adam\" who lost his career and has had his life destroyed. In fact, I find it likely that she is making him up completely, considering how dispassionately she relays the case of his railroading and dismissal, and then she turns around and spends entire paragraphs talking about the \"glass ceiling\" against women, the \"glass escalator\" favouring men, and how women suffer because they don't experience equality in other fields. Once again, only women as a group can be victims. And the comments on the blog show an interesting change that highlights current trends – in 2012 and shortly afterwards, many commentors are positive and attempt to honestly acknowledge the nature of the problem, but go to the bottom and the most recent set of comments in 2019 are from people openly admitting to not trusting any and all men with children.\n\nSuch a recent and brazen display of extreme prejudice against men is not just coincidence. It is a *direct* result of the current social atmosphere of fear and mistrust directed at us. As men, we walk around each day with a veritable \"Sword of Damocles\" hanging over our heads, and it is so exhausting and demoralizing to have to be constantly vigilant and protect ourselves against some \"unfortunate misunderstanding\", yet no one truly cares, because no one will acknowledge the fact that their own attitudes are a major part of the reason why everyone automatically thinks the worst of men.\n\n**\"Believe Women\"** is equivalent to saying **\"Don't Trust Men\"**, and don't let anyone ever try to claim otherwise.",
    "title": "The real truth behind \"Believe Women\" that no one will ever acknowledge",
    "subreddit": "MensRights",
    "timestamp": 1569614363,
    "score": 617,
    "keyword": "man teacher"
  },
  {
    "text": "Feminists say that there is no sexism against men, because men don't suffer institutional discrimination. In fact is males, rather than females, who suffer the vast majority of institutional discrimination. This post was originally submitted by u/Vwar. For new subscribers, here it is again. Indeed, the fact of institutional discrimination against men must be repeated again and again until it is realised by all.\n\n---\n\nI don't believe that males have ever been \\[privileged\\]([https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122](https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122)) in the way feminists claim.   But we are now at the point where the deck is stacked against males at every stage of their lives and in almost every major institution.   \n\nWhen a male is born he can have his genitals mutilated. Hundreds of baby boys die from this procedure every year.\n\nThen comes primary school, where boys are often punished and even drugged for displaying natural boyish behavior. Recent studies have also revealed that female teachers mark down boys by an average of 20 percent for the same work.\n\nHuge numbers of boys are now being raised without fathers (including about 99 percent of school shooters, funny how we never talk about that), and since pedo hysteria has chased male teachers out of primary school, boys often don't have any male role models until much later in life.\n\nBoys only clubs (eg the Boy Scouts) are being eliminated while girl only clubs remain.\n\nTeenage boys are being introduced to blatantly misandrist concepts like \"toxic masculinity,\" with narry a word about toxic femininity and nothing about the positive aspects of masculinity.\n\nNext it's off to University, where there are a range of female-specific scholarships and programs even though women make up the majority of college students and young women are now out-earning young men. They are also portrayed as rapists in waiting, and there are entire departments (gender studies) devoted to demonizing their sex. If a young man pisses off a young woman (eg dumps her after a one night stand) he faces the possibility of being subjected to a false accusation and a feminist Kangaroo court. Then it's bye bye academic career and social reputation.\n\nIf he wants to vote he will have to sign over his body to the state (selective service).\n\nIf he gets a woman pregnant he will not have the option of legal parental surrender. While a woman can just drop off the baby at a safe haven, the man is on the hook for 18 years of child support and will be locked up if he loses his job and can't pay.\n\nIn the workplace things are just as bad. Men perform almost all of the dirty and dangerous jobs and make up 95 percent of workplace injuries and deaths. If a white man wants to pursue a more respected career he faces racial and sexual discrimination in hiring due to corporate \"diversity\" measures and quotas. A recent study in...I think it was Australia found that \"blind hiring\" practices (where the employer doesn't know the race or sex of the applicant) result in more straight white males being hired; this means that it is straight white men who are now suffering discrimination in the workplace.\n\nWith MeToo, a man can be fired from his job simply for making a woman uncomfortable. There have even been cases of men being fired for telling a naughty joke.\n\nIf he gets married and the wife divorces him through no fault of his own he will likely be treated like shit by the family courts unless he can afford a high priced lawyer. There are countless stories of men effectively being turned into indentured servants by their ex-wives; they live in poverty and seldom see their kids while the wife gets a new \"baby daddy\" and lives high on the hog. NOW, the largest feminist organization in the world, continues to oppose shared parenting even though every single study shows it to be in the best interests of the children, the father and even the mother.\n\nHe will receive less social support, less health care spending, and be relentlessly demonized in the media. \n\nIf a male is sexually assaulted by a woman he will probably not receive justice; the perp will likely get a slap on the wrist even if the victim is a boy.  \n\nIf he commits a crime or is falsely accused of a crime he will be treated much, much more harshly by the criminal justice system.\n\nI could go on.\n\nIt is a myth that feminists think the sexes are equal. Their MO goes like this: if men are ahead in some area, that means women are being oppressed because the sexes are identical except for genitalia; however, if women are ahead in some area that's because women are superior. You can find this sentiment going back to the first wave. Elizabeth Cady Stanton claimed that women are \"infinitely superior\" to men.\n\nThe prison thing is perhaps the most glaring example of feminists not practicing what they preach. If they were serious about equality they would be demanding either that men be treated with more compassion/leniency or that women be treated more harshly (or some combination of the two). Instead, they want women to be treated even \\*more\\* leniently, and some are even advocating for the complete abolition of female prisons.\n\nMen are increasingly second class citizens not only in a social but legal sense. A study in the UK determined that if women were treated like men by the criminal justice system, fully half of all prisoners would be female. Women do NOT commit less crimes than men (though they do commit less homicides), they just don't get punished to anywhere near the same extent.\n\nIf feminism were an \"equality\" movement they would not be trying to privilege females in every single institution.    They would be looking with a keen eye at areas in which males are disadvantaged and/or subject to institutional discrimination.   They certainly wouldn't blame everything on some nebulous all-encompassing \"patriarchy\" that hasn't even been proven to exist.  \n\nAdvocates of gender equality must reject feminism, and support men's rights.",
    "title": "Feminists say that there is no sexism against men, because men don't suffer institutional discrimination. In fact is males, rather than females, who suffer the vast majority of institutional discrimination.",
    "subreddit": "MensRights",
    "timestamp": 1551253860,
    "score": 517,
    "keyword": "man teacher"
  },
  {
    "text": "A response to a post on r/Feminism Earlier today, I made a crosspost in r/MensRights linking to a post from r/Feminism which had the following text:\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\"  \n>  \n>First of all that's not true. Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men. Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness, and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men. Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim. According to toxic masculinity, sex is one of the most valuable thing to a man that a woman can give him, so rape is impossible, but rape is possible, and atleast 1 in 75 men will be raped in their lifetime. Due to this, male victims are often shamed, especially by sexist men (Donald Trump and Sean Hannity once did this to a 14 year old who had been raped by his teacher) So in short, toxic masculinity harms male victims.  \n>  \n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nI provided a thorough rebuttal, with links to sources, in the comments of my crosspost in r/MensRights that linked to the r/Feminism post, but that post was removed by the moderators of this sub I assume because a mod thought I was encouraging brigading (I have since deleted it, since no one else will see it anyway). So I'll provide my responses here, and I'll neglect to provide the link to the original post in r/Feminism like my original post here did.\n\nNow that that's out of the way, let's tear down this feminist's ideas.\n\n>Alot of the times when I see people talk about male rape or DV victims it's usually in the context of a woman talking about her experience with rape or DV, and it's usually like this: Commentor: \"Men FACE this kind of ABUSE everyday but SOCIETY only cares about WOMEN\" First of all that's not true.  \n>  \n>Despite the huge amounts of awareness, domestic violence against women is still a problem. Bisexual women are the group most likely to face domestic violence and women are more likely to experience abuse then men.\n\nBefore you go any further with this, the research has shown gender symmetry in domestic violence. Approximately half of domestic violence is reciprocal violence where both partners abuse each other, and women are more likely to initiate this kind of violence. And in cases of non-reciprocal violence where the violence is unilaterally perpetrated by one partner against the other, female violence towards men is actually more common than male violence against women.\n\nHere is the LARGEST set of meta analyses on domestic violence by The Partner Abuse State of Knowledge Project (PASK). Researchers were asked to conduct a formal search for published, peer-reviewed studies through standard, widely-used search programs, and then catalogue and summarize all known research studies relevant to each major topic and its sub-topics. Approximately 12,000 studies were considered and more than 1,700 were summarized and organized into tables.\n\nThe key findings were:\n\n* Among large population samples, 57.9% of IPV reported was bi-directional, 42% unidirectional; 13.8% of the unidirectional violence was male to female (MFPV), 28.3% was female to male (FMPV)\n* Among school and college samples, percentage of bidirectional violence was 51.9%; 16.2% was MFPV and 31.9% was FMPV\n\nAnd before you say that even though women initiate violence more than men do in relationships, that women are still more often the victims of partner violence because their reasons for hitting are different than men's - I direct you to these quotes from my source:\n\n* Male and female IPV perpetrated from similar motives – primarily to get back at a partner for emotionally hurting them, because of stress or jealousy, to express anger and other feelings that they could not put into words or communicate, and to get their partner’s attention.\n* Eight studies directly compared men and women in the power/control motive and subjected their findings to statistical analyses. Three reported no significant gender differences and one had mixed findings. One paper found that women were more motivated to perpetrate violence as a result of power/control than were men, and three found that men were more motivated; however, gender differences were weak\n\n[https://domesticviolenceresearch.org](https://domesticviolenceresearch.org/)\n\nOh, and before you say some shit like \"Okay, female-on-male violence may be just as common if not more common than male-on-female violence, but women are still FAR more likely to be seriously injured by DV\" yeah no. The gender gap regarding harm and injury isn't nearly as big as you seem to think it is. IIRC statistically for every 8 women seriously injured by DV (injured seriously enough to require emergency medical attention), 5 men are. That's not nearly as big a gap as most people assume.\n\nThere are also some studies which show that men are actually *more* often injured by DV. A 2001 study called \"Physical aggression in a community sample of at-risk young couples: gender comparisons for high frequency, injury, and fear.\" indicated that 9.4% of men and 13.2% of women perpetrated frequent physical aggression toward their partners. Contrary to expectations, 13% of men and 9% of women, indicated that they were physically injured at least once. The authors reported \"2% of the men and none of the women indicate that they had been hurt by their partners between five and nine times.\"\n\n[https://www.ncbi.nlm.nih.gov/pubmed/11584793](https://www.ncbi.nlm.nih.gov/pubmed/11584793)\n\nA study called \"Partner Violence and Mental Health Outcomes in a New Zealand Birth Cohort\" revealed that men and women reported similar rates of injury (3.9% for women vs. 3.3% for men). In the words of the authors: \"The consequences of domestic violence in terms of injury and psychological effects were similar for both men and women.\"\n\n[https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\n[https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x](https://sci-hub.shop/https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1741-3737.2005.00202.x)\n\nFurthermore, meta analyses have shown that the primary predictor of serious domestic violence injury in women is their own initiation of violence. Basically, you're more likely to be injured as a woman if the man is hitting you back. As said earlier, a huge amount (approximately half) of domestic violence is reciprocal, and it is more likely to be initiated by women. A large percentage of reciprocal violence involves the female partner assaulting and emotionally abusing the male partner until he snaps and reacts violently.\n\nMaybe if we want injury of women to come down, we should teach women not to initiate in the first place? Just a thought.\n\n[https://www.researchgate.net/publication/223225227\\_Intimate\\_partner\\_physical\\_abuse\\_perpetration\\_and\\_victimization\\_risk\\_factors\\_A\\_meta-analytic\\_review](https://www.researchgate.net/publication/223225227_Intimate_partner_physical_abuse_perpetration_and_victimization_risk_factors_A_meta-analytic_review)\n\n>Women are also more likely to be sexually abused, harassed, and even raped then men, so that is the primary reason female victims get more awareness\n\nAgain, go look at the data. Look at the CDC's NISVS. In the 2010 and 2011 reports just as many men reported having been subjected to nonconsensual sexual intercourse in the previous 12 months. In the 2012 report more men than women reported having been subjected to nonconsensual sexual intercourse in the previous 12 months.\n\nIt may not look immediately obvious, because they introduce their reports with findings such as these:\n\nNISVS 2010:\n\n\"Nearly 1 in 5 women (18.3%) and 1 in 71 men (1.4%) in the United States have been raped at some time in their lives, including completed forced penetration, attempted forced penetration, or alcohol/drug facilitated completed penetration.\"\n\nNISVS 2011:\n\n\"In the United States, an estimated 19.3% of women and 1.7% of men have been raped during their lifetimes; an estimated 1.6% of women reported that they were raped in the 12 months preceding the survey. The case count for men reporting rape in the preceding 12 months was too small to produce a statistically reliable prevalence estimate.\"\n\nHowever, the rape numbers in these studies do not cover all victims of nonconsensual sex, they only cover victims who were forcibly penetrated by a perpetrator. If a man was forced to penetrate a perpetrator, this would not be considered as rape and it would instead fall into a separate category \"made to penetrate\".\n\n[https://www.cdc.gov/violenceprevention/pdf/nisvs\\_report2010-a.pdf](https://www.cdc.gov/violenceprevention/pdf/nisvs_report2010-a.pdf)\n\n*Rape is defined as any completed or attempted unwanted vaginal (for women), oral, or anal penetration through the use of physical force (such as being pinned or held down, or by the use of violence) or threats to physically harm and includes times when the victim was drunk, high, drugged, or passed out and unable to consent.*\n\n*Rape is separated into three types, completed forced penetration, attempted forced penetration, and completed alcohol or drug facilitated penetration.*\n\n*Among women, rape includes vaginal, oral, or anal penetration by a male using his penis.It also includes vaginal or anal penetration by a male or female using their fingers or an object.*  \n\n*Among men, rape includes oral or anal penetration by a male using his penis. It also includes anal penetration by a male or female using their fingers or an object.*\n\n*Being made to penetrate someone else includes times when the victim was made to,or there was an attempt to make them, sexually penetrate someone without the victim’s consent because the victim was physically forced (such as being pinned or held down, or by the use of violence) or threatened with physical harm, or when the victim was drunk, high, drugged, or passed out and unable to consent.*  \n\n*Among women, this behavior reflects a female being made to orally penetrate another female’s vagina or anus.*\n\n*Among men, being made to penetrate someone else could have occurred in multiple ways: being made to vaginally penetrate a female using one’s own penis; orally penetrating a female’s vagina or anus; anally penetrating a male or female; or being made to receive oral sex from a male or female. It also includes female perpetrators attempting to force male victims to penetrate them, though it did not happen.*\n\nESSENTIALLY: under the NISVS' methodologies a woman drugging and riding a man would not be counted as rape. The numbers for men who have been raped only refer to men who were penetrated, for example men who have been forced into anal sex or made to perform oral sex on another man. And yes, situations like these are comparatively rare.\n\nMen being forced to penetrate a perpetrator, on the other hand, is much more common, but it is not included as rape and instead gets considered as \"made to penetrate\". Made to penetrate falls into the category \"other sexual violence\" with other vastly less severe forms of sexual violence and harassment such as \"non-contact unwanted sexual experiences\".\n\nHowever, since the CDC gathered the data for \"made to penetrate\", that allows us to make comparisons. One-year prevalence is considered to be more accurate than lifetime rates because they do not depend on recall of events long past, and therefore we will be using these numbers to analyse the 2010, 2011, and 2012 NISVS studies. In each of these years, when asked about experiences in the last 12 months, men reported being “made to penetrate” -either by physical force or due to intoxication - at virtually the same rates as women reported rape.\n\nNISVS 2010 showed that in the past 12 months, 1.1% of men (or an estimated 1,267,000 men) were made to penetrate and 1.1% of women (or an estimated 1,270,000 women) were raped.\n\nNISVS 2011 showed that in the past 12 months, 1.7% of men (or an estimated 1,921,000 men) were made to penetrate and 1.6% of women (or an estimated 1,929,000 women) were raped.\n\nNISVS 2012 showed that in the past 12 months, 1.7% of men (or an estimated 1,957,000 men) were made to penetrate and 1.0% of women (or an estimated 1,217,000 women) were raped.\n\nIn each of the years the case count for male rape victims and female victims of made-to-penetrate were too small to provide a statistically reliable prevalence estimate.\n\nHere is a table [(source)](https://recalculatingthegenderwar.tumblr.com/post/162336650896/new-cdc-data-again-finds-as-many-if-not-more) to easily demonstrate it.\n\nCDC NISVS Yearly Rape and Made-To-Penetrate Victimisation\n\n||Rape (women)|Rape (men)|Made to penetrate (women)|Made to penetrate (men)|\n|:-|:-|:-|:-|:-|\n|2010|1.1% (est 1,270,000)|\\*|\\*|1.1% (est 1,267,000)|\n|2011|1.6% (est 1,929,000)|\\*|\\*|1.7% (est 1,921,000)|\n|2012|1.0% (est 1,217,000)|\\*|\\*|1.7% (est 1,957,000)|\n\n^(\\*Zero or statistically insignificant amount according to NISVS)\n\nYou can see that the estimated numbers of male victims of made to penetrate each year look very similar to the estimated numbers of female victims of rape. So if made to penetrate happens about as often as rape each year then by most people's assumed definition of rape (nonconsensual sex) then men are approximately half of rape victims each year.\n\nIn 2010:\n\n1,267,000/2,537,000 = 49.9% of victims of nonconsensual sex in 2010 were men.\n\nIn 2011:\n\n1,921,000/3,850,000 = 49.9% of victims of nonconsensual sex in 2011 were men.\n\nIn 2012:\n\n1,957,000/3,174,000 = 61.7% of victims of nonconsensual sex in 2012 were men.\n\nSo if you're a normal human being who defines rape as simply non-consensual sex instead of solely \"forced penetration of the victim\" like the CDC does then men are half of rape victims. Hmmm.\n\n>and also some time ago people would even encourage men to beat their female partners to 'keep them in line', it is not common to hear someone say that a woman should abuse her male partner to 'keep them in line', so that is the primary reason women victims get more awareness then men.\n\nYou really have a skewed view of the past. Yes, in the past men were allowed to use \"mild correction\" on their wives under the law (as he was socially and legally responsible for the actions of his wife to the extent that he could even be held accountable for the crimes and offences she committed), but he could not beat her black and blue. Men had restrictions on what corporal punishment they could use on their wives.\n\nIn Colonial America, when men went beyond what was legally acceptable, they received punishment through the pillory. “The pillory was employed for treason, sedition, arson, blasphemy, witchcraft, perjury, wife beating, cheating, forgery, coin clipping, dice cogging, slandering, conjuring, fortune-telling, and drunkenness, among other offences. On several occasions, onlookers pelted the pilloried prisoner so enthusiastically with heavy missiles that death resulted.”\n\n[https://www.history.org/foundation/journal/spring03/branks.cfm](https://www.history.org/foundation/journal/spring03/branks.cfm)\n\nThe whipping post also was a favourite form of punishment for wife-beating. Many examples of vigilante justice, sometimes lethal, enacted against wifebeaters can be found in newspaper clippings from the 1800s and onward, with the full endorsement of society.\n\n[https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/](https://unapologeticallyantifeminist.video.blog/2019/05/21/correcting-notions-about-domestic-violence-in-history/)\n\nWe can assume that this was practiced in Europe as well. Likewise, Americans practiced shivaree and Europeans practiced charivari as a way to enable social censure of wife-beaters. Charivari was a historical folk custom expressing public disapproval of personal behaviour, where a mock parade was staged through a community accompanied by a discordant mock serenade. Sometimes the crowd would carry an effigy of the targeted man to a substitute punishment, e.g. burning. Sometimes the man who physically abused his wife would be abused by the community.\n\nThey would chant:\n\n*Old Abram Higback has been paying his good woman; But he neither paid her for what or for why, But he up with his fist and blacked her eye.*\n\n*Now all ye old women, and old women kind, Get together, and be in a mind; Collar him, and take him to the shit-house, And shove him over head.*\n\n*Now if that does not mend his manners, The skin of his arse must go to the tanners; And if that does not mend his manners, Take him and hang him on a nail in Hell.*\n\n*And if the nail happens to crack, Down with your flaps, and at him piss.*\n\nHowever, if a husband was beaten by his wife - the husband, in contrast, was also the subject of the charivari for essentially allowing it to happen. In France about 1400, husbands beaten by their wives were “paraded on an ass, face to tail.”  In England, a [mural in Montacute House](https://montacutehouse.blogspot.com/2012/04/skimmington-ride.html) (constructed about 1598) shows a wife beating her husband with a shoe and then a crowd parading the husband on a [cowlstaff](https://en.wiktionary.org/wiki/cowlstaff). \n\nSamuel Pepys recorded in his diary, 10 June 1667: “in the afternoon took boat and down to Greenwich, where I find the stairs full of people, there being a great riding there to-day for a man, the constable of the town, whose wife beat him.”\n\nA Frenchman who traveled in England reported in 1698: \"I have sometimes met in the streets of London a woman carrying a figure of straw representing a man, crown’d with very ample horns, preceded by a drum, and followed by a mob, making a most grating noise with tongs, grid-irons, frying-pans, and sauce-pans. I asked what was the meaning of all this; they told me that a woman had given her husband a sound beating, for accusing her of making him a cuckold, and that upon such occasions some kind neighbour of the poor innocent injur’d creature generally performed this ceremony.\"\n\n[https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/](https://www.purplemotes.net/2013/01/27/charivari-sex-inequality/)\n\nHmmm. So while a man could give his wife mild correction under the law, if he went too far with wife-beating the community would frown down upon him and punish him with the pillory, whippings and charivari. THERE WAS NO SUCH EXTREME SOCIAL OR LEGAL CENSURE FOR A WIFE WHO BEAT HER HUSBAND. IF SHE BEAT HIM, HE WAS THE ONE WHO WAS PUNISHED.\n\nThat doesn't sound at all like what you were saying, that wife-beating was considered \"100% okay and encouraged by the community\" whereas husband-beating was condemned.\n\n>Still, male victims do need help, shelter, and support, and also awareness. However, I think the biggest problem plaguing them is toxic masculinity. According to toxic masculinity, men are stronger and smarter then women so they can never be victims, but we know better. Men and women are equal, so in a hetero relationship a man can certainly be a victim.\n\n\"But we know better\" my ass. Feminists have been happy to capitalise on gendered viewpoints of men as strong and oppressive when it suits them, and women as weak, victimised, incapable of causing harm and in need of help and protection. In fact, all they've done is reinforce that viewpoint. Wouldn't you know it, it is not toxic men, but feminists, who have been very happy to paint domestic violence as an issue in which men are the sole perpetrators and women are the sole victims.\n\n**Feminist theories of domestic violence and the Duluth Model**\n\nFeminist theory characterises DV as a sexually directional problem (men abusing women) which is rooted in patriarchal norms of masculine dominance and female subordination. Basically, they theorise that the reason for this gender disparity is that men are socialised in a patriarchal society that makes them feel entitled to have power, dominance and control over women. The earliest batter intervention programs that emerged were based on this feminist theory, that a man needs to control a woman.\n\nLater on, in 1981, when the Duluth Model, a more structured approach to batterer treatment, was created, it was (surprise) also based on this very same feminist idea that domestic violence is a sexually directional problem caused by \"patriarchal terrorism\". In essence, the program attempts to halt men's violent behavior by focusing on the supposed reason they batter: to maintain individual and societal patriarchal dominance. The Duluth Model does not, however, address other possible reasons for violence, including substance abuse problems, psychological problems, violent backgrounds, or unhealthy relationship dynamics. Other common risk factors for violence, such as \"stress on the perpetrator, impulse control problems, trait anger, communication skill deficits, couples' negative interaction, or personality disturbance,\" are systematically excluded as excuses.\n\nAnd under this faulty model, women cannot, as a conceptual matter, perpetrate partner abuse. If they hit their male partners, it was in self defence. If they hit first, or are the only partner who hits, they are doing it within the context of \"violent resistance\" against presumed emotional or psychological abuse on his part. Any violence perpetrated by a woman is dismissed as either non-existent, self-defensive, or insignificant.\n\nThis model is now so widely accepted that it is the most commonly state-mandated model of intervention and is the sole model in the majority of US states and across the English speaking west, despite the statistical evidence contradicting this feminist narrative in a big way. It is the paradigm used to train police, social workers, counsellors, lawyers, judges, medical personnel, guardians ad litem and anyone else who may become involved in a domestic violence case.\n\n[https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/](https://honest-ribbon.org/mega-featured/duluth-model-buries-key-facts-on-domestic-violence/)\n\nPart of the reason why this idea has managed to get so much traction is because researchers, activists and reformers who support the idea of gender symmetry and contradict the feminist viewpoint of domestic violence as a sexually directional problem have been ostracised, shamed and silenced for going against the prevailing narrative.\n\nIn 1971, Erin Pizzey opened the world's first DV shelter. She soon realized that most of the women there were as violent as, or more violent than, the men they were fleeing. So she began talking about it, and feminists protested against her. She began to receive regular bomb and death threats. She eventually had to flee England with her children due to all the protests, threats, and violence, and she has said she is banned from the refuge she started.\n\nIn 1977, Suzanne Steinmetz published a book and articles which clearly showed about equal rates of perpetration by males and females. Anger over this resulted in a bomb threat at her daughters’ wedding and she was the object of a letter writing campaign to deny her promotion and tenure at the University of Delaware.\n\nIn 1979, Murray Straus, a family violence researcher was challenged by some colleagues to conduct unbiased research on DV. What he found was gender symmetry in perpetration and victimization. He published his findings, and was subjected to a campaign of threats, blacklisting, shunning, having his grad students' careers sabotaged, etc etc.\n\nThese types of harassment have caused there to be widespread self-censorship by people who fear that contradicting the feminist narrative will negatively affect their prospects.\n\n[https://www.researchgate.net/publication/228350210\\_Gender\\_symmetry\\_in\\_partner\\_violence\\_The\\_evidence\\_the\\_denial\\_and\\_the\\_implications\\_for\\_primary\\_prevention\\_and\\_treatment](https://www.researchgate.net/publication/228350210_Gender_symmetry_in_partner_violence_The_evidence_the_denial_and_the_implications_for_primary_prevention_and_treatment)\n\n**Violence Against Women Act**\n\nSo. Radical feminists have fought against acknowledgement of male victims and female perpetrators. They have pushed a faulty model which characterises domestic violence as a primarily or even uniquely male-on-female crime and have described it as patriarchal violence. Even worse, they have attacked and attempted to silence people who have dared to demonstrate gender symmetry in DV - even engaging in acts of terrorism to do so.\n\nAnd they have used this faulty conceptualisation of DV to justify gender-discriminatory legislation. The National Organisation for Women lobbied to replace the gender neutral federal Family Violence Prevention and Services Act of 1984 with the obscenely gendered Violence Against Women Act of 1994. The passing of that law cut male victims out of support services and legal assistance in more than 60 passages, just because they were male. It was only through a procedural technicality regarding funding and different levels of government taxation that the old law was halted midway through reauthorization, and a new, gender neutral one was introduced. Women's groups, such as the National Organization for Women, fought hard to keep the language in the Act gendered, despite entreaties from LGBTQ groups to reconsider how the language of female victims and male perpetrators failed to serve their community.\n\nAnd even with the gender-neutral version of VAWA that exists now, the Department of Justice’s Office on Violence Against Women (the principal federal agency that administers VAWA funds) has issued many directives and established funding mechanisms that are openly discriminatory in nature.\n\n[https://www.reddit.com/r/MensRights/comments/695m34/karen\\_straughans\\_response\\_to\\_those\\_arent\\_real/?utm\\_medium=android\\_app&utm\\_source=share](https://www.reddit.com/r/MensRights/comments/695m34/karen_straughans_response_to_those_arent_real/?utm_medium=android_app&utm_source=share)\n\n[http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf](http://www.saveservices.org/pdf/SAVE-VAWA-Discriminates-Against-Males.pdf)\n\n**Predominant Aggressor Policies**\n\nIn the 1980s, there was a call for a vigorous law enforcement response to address the issue of DV, with mandatory arrest laws being instituted in several states. When, however, it was apparent that these same laws led to a large number of dual arrests, and a proportionately greater increase in arrests of women compared to men, feminists started calling for primary aggressor or dominant aggressor laws that told police that instead of arresting both parties, they should just arrest the \"primary aggressor in the relationship\". In determining who the primary aggressor was, they prioritised relative height, weight, strength, AND patriarchal/feminist models of domestic violence (Duluth again), over inconvenient matters such as \"who is the abusive party?\"\n\nThey essentially adjusted policy to make outcomes conform to their theory, rather than adjusting their theory to conform to reality. And the gender ratio in arrests returned to normal - 85% male, at least 1/3 of which would've been victims. How nice.\n\n[https://www.researchgate.net/publication/233694571\\_In\\_Dubious\\_Battle\\_The\\_Politics\\_of\\_Mandatory\\_Arrest\\_and\\_Dominant\\_Aggressor\\_Laws](https://www.researchgate.net/publication/233694571_In_Dubious_Battle_The_Politics_of_Mandatory_Arrest_and_Dominant_Aggressor_Laws)\n\n**The resulting injustice against male victims of abuse**\n\nThese feminist reforms have created a lot of social injustice for male victims of domestic violence. There are many qualitative studies of male helpseekers who reveal that they are turned away, doubted, ridiculed by the formal systems in place that are supposed to prevent DV. Across multiple studies a huge amount of male victims reported being referred to batterers' programs when they called domestic violence hotlines, or arrested by the police who made the false presumption that the man was the primary aggressor. Within the judicial system, some men who sustained DV reported experiencing gender-stereotyped treatment. Even with apparent corroborating evidence that their female partners were violent and that the helpseekers were not, they reportedly lost custody of their children, were blocked from seeing their children, and were falsely accused by their partners of DV and abusing their children.\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3175099/)\n\nSo it's feminists that have repeatedly, consistently minimised female-on-male abuse, said that it's SUPER rare and doesn't happen nearly enough for people to care about it (and if it does happen, he was asking for it), shamed and silenced researchers who dared to demonstrate gender symmetry in domestic violence, and used their fucked up worldview to push for law and policy that discriminates against male victims.\n\n>But what saddens me is that many people, anti feminists and MRAs especially who dont give a shit about male victims will try to use them as a weapon against feminism, or just women in general. It's sickening, we can help victims of both genders, and non-binary victims as well, without 'competing' to see who is more oppressed.\n\nYou just, uh, did that in your post. You just competed to see who was more oppressed. You justified the greater awareness and concern for female victims and relative lack of it for male victims by saying \"Women are more likely to be victims of rape and domestic violence than men\" when the statistical evidence actually says otherwise.\n\nAnti-feminists and MRAs that say \"Uh actually, men are very likely to be abused or raped as well\" aren't competing to see who is more oppressed, and they aren't playing Oppression Olympics. We're objecting to YOU feminists playing Oppression Olympics and spreading lies about how women have it so much worse and have always had it so much worse than men to justify unequal treatment when they really don't. Even if you want to help men, you and feminists like you are still lying to us about the nature of the problem, about the nature of society--both pre and post-feminism--and about the nature of men.\n\nAnd as girlwriteswhat says in [this](http://owningyourshit.blogspot.com/2011/09/time-to-set-down-tools.html) blog post: \"while many would insist that any help--even wrongheaded help--is better than none, that if a feminist believes men are \"the minority\" of victims of severe DV still deserve support then we should bring that feminist on board...it just leaves a sour taste in my mouth.\"\n\n\"Because that is not alliance--it's *conditional assistance*, and it is conditional upon them being allowed to go on believing the same lies as before, and spreading them, and feeding the problem even as they're supposedly trying to solve it. And someone who cannot or will not see truth, who is lying even when he believes he's telling the truth, isn't someone you can trust as far as you can throw him.\"\n\nThanks for playing, though.\n\nedit: wording",
    "title": "A response to a post on r/Feminism",
    "subreddit": "MensRights",
    "timestamp": 1576388434,
    "score": 507,
    "keyword": "man teacher"
  },
  {
    "text": "It is now males, rather than females, who suffer the vast majority of institutional discrimination This post was originally submitted by u/Vwar. For new subscribers, here it is again.\n\n---\n\nI don't believe that males have ever been [privileged](https://www.amazon.ca/Privileged-Sex-Martin-van-Creveld/dp/1484983122) in the way feminists claim.   But we are now at the point where the deck is stacked against males at every stage of their lives and in almost every major institution.   \n\nWhen a male is born he can have his genitals mutilated. Hundreds of baby boys die from this procedure every year.\n\nThen comes primary school, where boys are often punished and even drugged for displaying natural boyish behavior. Recent studies have also revealed that female teachers mark down boys by an average of 20 percent for the same work.\n\nHuge numbers of boys are now being raised without fathers (including about 99 percent of school shooters, funny how we never talk about that), and since pedo hysteria has chased male teachers out of primary school, boys often don't have any male role models until much later in life.\n\nBoys only clubs (eg the Boy Scouts) are being eliminated while girl only clubs remain.\n\nTeenage boys are being introduced to blatantly misandrist concepts like \"toxic masculinity,\" with narry a word about toxic femininity and nothing about the positive aspects of masculinity.\n\nNext it's off to University, where there are a range of female-specific scholarships and programs even though women make up the majority of college students and young women are now out-earning young men. They are also portrayed as rapists in waiting, and there are entire departments (gender studies) devoted to demonizing their sex. If a young man pisses off a young woman (eg dumps her after a one night stand) he faces the possibility of being subjected to a false accusation and a feminist Kangaroo court. Then it's bye bye academic career and social reputation.\n\nIf he wants to vote he will have to sign over his body to the state (selective service).\n\nIf he gets a woman pregnant he will not have the option of legal parental surrender. While a woman can just drop off the baby at a safe haven, the man is on the hook for 18 years of child support and will be locked up if he loses his job and can't pay.\n\nIn the workplace things are just as bad. Men perform almost all of the dirty and dangerous jobs and make up 95 percent of workplace injuries and deaths. If a white man wants to pursue a more respected career he faces racial and sexual discrimination in hiring due to corporate \"diversity\" measures and quotas. A recent study in...I think it was Australia found that \"blind hiring\" practices (where the employer doesn't know the race or sex of the applicant) result in more straight white males being hired; this means that it is straight white men who are now suffering discrimination in the workplace.\n\nWith MeToo, a man can be fired from his job simply for making a woman uncomfortable. There have even been cases of men being fired for telling a naughty joke.\n\nIf he gets married and the wife divorces him through no fault of his own he will likely be treated like shit by the family courts unless he can afford a high priced lawyer. There are countless stories of men effectively being turned into indentured servants by their ex-wives; they live in poverty and seldom see their kids while the wife gets a new \"baby daddy\" and lives high on the hog. NOW, the largest feminist organization in the world, continues to oppose shared parenting even though every single study shows it to be in the best interests of the children, the father and even the mother.\n\nHe will receive less social support, less health care spending, and be relentlessly demonized in the media. \n\nIf a male is sexually assaulted by a woman he will probably not receive justice; the perp will likely get a slap on the wrist even if the victim is a boy.  \n\nIf he commits a crime or is falsely accused of a crime he will be treated much, much more harshly by the criminal justice system.\n\nI could go on.\n\nIt is a myth that feminists think the sexes are equal. Their MO goes like this: if men are ahead in some area, that means women are being oppressed because the sexes are identical except for genitalia; however, if women are ahead in some area that's because women are superior. You can find this sentiment going back to the first wave. Elizabeth Cady Stanton claimed that women are \"infinitely superior\" to men.\n\nThe prison thing is perhaps the most glaring example of feminists not practicing what they preach. If they were serious about equality they would be demanding either that men be treated with more compassion/leniency or that women be treated more harshly (or some combination of the two). Instead, they want women to be treated even *more* leniently, and some are even advocating for the complete abolition of female prisons.\n\nMen are increasingly second class citizens not only in a social but legal sense. A study in the UK determined that if women were treated like men by the criminal justice system, fully half of all prisoners would be female. Women do NOT commit less crimes than men (though they do commit less homicides), they just don't get punished to anywhere near the same extent.\n\nIf feminism were an \"equality\" movement they would not be trying to privilege females in every single institution.    They would be looking with a keen eye at areas in which males are disadvantaged and/or subject to institutional discrimination.   They certainly wouldn't blame everything on some nebulous all-encompassing \"patriarchy\" that hasn't even been proven to exist.  \n\nAdvocates of gender equality must reject feminism, and support men's rights.",
    "title": "It is now males, rather than females, who suffer the vast majority of institutional discrimination",
    "subreddit": "MensRights",
    "timestamp": 1548320409,
    "score": 289,
    "keyword": "man teacher"
  },
  {
    "text": "I have put together a list of disadvantages men face Feel free to use these in an argument, or in your own comments/posts\n\n \n\n* Women are not paid less than men, if you want me to go in depth with an explanation of that, I will be more than happy\n* Women shame other women for what they wear and even their character more than men do\n* 80% of women have period pains. This is a natural occurence, so it's not really an argument\n* The 1 in 6 women will be raped stat is actually false\n* Many women don't report rapes due to shame. Actually, the rate of unreported rapes is higher in men, since they are shamed and asked if \"they enjoyed it\"\n* Despite 75% of homeless people being male, almost every single homeless shelter in the world is for women only\n* Despite men being the victim of domestic violence in 53% of cases, most funding goes to women safe spaces, and less than 1% of shelters are for men\n* Many countries do not even recognize female on male rape. It can maximally only amount to “sexual assault” that's sexism. \n* Women can ruin a man's life with a single false accusation\n* When it comes to domestic violence and rape accusations, men are guilty until innocent\n* As soon as a men's safe space is opened up, feminists destroy it and replace it with either a women's safe space or gender neutral safe space\n* Men pay 97% of Alimony\n* Men lose custody of their kids 84% of the time after a divorce\n* 80% of all suicide victims are men\n* 97% of combat deaths have been men\n* Men are over twice as victimised by strangers as women\n* Men are 165% more likely to be convicted of a crime than women\n* Men get 63% more prison time than women\n* Court bias against men is 6 times greater than racial bias\n* Boys face vastly more corporal punishment than girls\n* Women's Cancers receive 15 times more funding than men's\n* At least 10% of fathers are victims of paternity fraud\n* One third of all fathers in the USA have lost custody of children, most are expected to pay for this\n* Male fatality rates are vastly higher than women's\n* Men earn 61.5% of all income but only account for 25% of domestic spending. Men only spend 40% of what they earn after tax. In contrast women make up 38.5% of all income but control 75% of domestic spending, women on average spend 90% **MORE** MONEY THAN THEY EARN. Men are exploited as cash machines and even with spending on children accounted for women still spend more money on themselves than the combined spending for men and children. This can even be observed in the floor space allocated to women's products in most shopping centres\n* Men pay over 70% of income tax but the vast majority of public spending is on services for women. There is more money spent on breast cancer than lung cancer and prostate cancer combined, despite the fact that lung cancer alone has 3-4 times more fatalities than breast cancer. A man's chance of getting cancer is 44% and 23% of men will die from cancer, 38% of women get cancer and 19% die. Yet there is vastly more money spent on cancer for women, this is lethal discrimination. Women pay 60% less tax despite spending 300% more in domestic spending than men. Women also consume two third of public spending, there are 3 times the amount of gender specific health services for women than men despite the fact that for equal increases in health spending a man's life expectancy rate increases nearly twice as much as a woman's.\n* There are hundreds of surveys which shows women are as violent if not more violent than men in domestic violence cases. Men get arrested in 85% of all arrests but its estimated that Women are the perpetrators in most Domestic Violence cases. Most reciprocal violence is started by women and 70% of non reciprocal violence is perpetrated by women. Women however only get arrested in 15% of all DV arrests. This example of 572 different studies covering 371,600 people demonstrate that women are as physically aggressive, or more aggressive, than men in their relationships with their spouses or male partners. [http://www.csulb.edu/\\~mfiebert/assault.htm](http://www.csulb.edu/~mfiebert/assault.htm)\n* Men have no say in whether their partner gets an abortion, even though they created the kid\n* Men can get drafted; women can't\n* A young boy raped by a woman can be forced to pay child support to his rapist if she gets pregnant, that's sexism\n* In the army, police, fire service or any other position women have to meet much lower physical standards than men.\n* Most divorce laws are skewed against men, men can lose half his property, money and children to a woman who decides to leave him\n* Men are mocked for being raped and told to \"man up\" and asked if \"they at least enjoyed it\". If I said that to a female rape victim I would be mobbed\n* Men’s lives are given less value in any emergency situation\n* Young boys are given less care and attention by parents than girls and beaten over twice as often as girls by parents\n* Male children are often given harsher punishments by teachers for the same level of mischief as girls\n* Men enrolled in are often given tougher, more dangerous tasks to perform than women in the same post (in a job)\n* Men are expected to ask women out, pay for dates, decide on the venue – if she rejects him he is often labelled creepy or needy\n* If a man slaps a woman, he is an abuser and a monster, If a woman slaps a man, “he must have done something to annoy her”\n* When a man breaks up with a woman, he is called a “jerk”. When a woman dumps a man, “he must have failed her somehow”\n* In modern movies and TV violence against men is glorified but violence against women is regarded as especially horrific.\n* Many news reports will read the number of people killed and then highlight women and children as more tragic than male death. eg \"37 people were killed in a bus crash including 17 women\"\n* 61% of child abuse is commited by females\n* 70% of UK women would instantly change their minds about leaving a boring man if he won a lottery jackpot.\n* 78% of US women said a partner with a steady job was the most important trait in a future spouse\n* 75% said they’d have a problem with dating someone without a job. Only 4% would go out with an unemployed man\n*",
    "title": "I have put together a list of disadvantages men face",
    "subreddit": "MensRights",
    "timestamp": 1571779339,
    "score": 134,
    "keyword": "man teacher"
  },
  {
    "text": "Feminism: Enabling Female Psychopaths Men and women, and gender fluid, nonbinary, persons of colour, LGBTIQ+ persons, (and definitely not privileged white men), we got a lot right in the Western world since World War 2. Two things amaze me about the organization of Western society. One, society has so effectively removed the opportunities for the psychopathic individuals to thrive with one exception. Two, that one exception is feminist psychopathy directed to men.\n\n&#x200B;\n\nTeachers can't smack, gropers get caught on camera and imprisoned, there's enough prosperity that generally people have an option other than staying when their romantic partner is abusive, workplace bullying no longer flies like it used to, by and large violence between men is far less tolerated, child abuse is not kept silent about but every effort is expended in its prevention.\n\n&#x200B;\n\nIn other words, the many 'hunting grounds' the psychopath might have previously used to express his or her disregard for the rights of others have been closed off or at least curtailed severely. However, all is not lost for the psychopath, because a new hunting ground has been opened with a numerous prey, and all one needs to be given an open season ticket to hunt is a vagina. (No, sorry MTFs, I doubt a surgically constructed one would give you full hunting rights, but you could always try).\n\n&#x200B;\n\nThe major thing I have noticed in the course of my life is the manner in which feminism has given massive cover for antisocial and psychopathic women to harm men. It's the only context that I'm aware of in Western societies where this 'privilege' exists. Try treating blacks, Asians, Hispanics, spastics, the blind, homosexuals, Muslims or Parsis like this, and you'll lose your job quicker than you can say, 'our company doesn't stand for discrimination'. But treat a man this way, go right ahead! Because if you are a psychopathic woman mistreating a man YOU WILL NOT FACE SOCIETY'S USUAL CENSURE AND CONDEMNATION OF SUCH BEHAVIOUR.\n\n&#x200B;\n\nI have experienced this myself, from quite an early age in fact, although generally speaking I believe I have avoided the harsher edge of this reality. Employment is the obvious context this comes to mind - a female boss or even colleague can make hell for a male subordinate, she's got cover. If the guy were to do a tenth of that to a woman, he'd be up before HR with, 'do it again and you're out', warning at the very least. I don't know how it is in America, but in Australia my understanding is female managers are brought in directly so they can work on firing a sufficiently difficult female staff member - the male managers are scared of doing it, so will often be swapped out for the termination process. I've mostly had very good female bosses, but the behavior of some women colleagues I've dealt with (and yes, they were disproportionately lesbian) clearly indicated that they had cover AND THEY KNEW THEY HAD COVER.\n\n&#x200B;\n\nThis is the problem, women in Western society know they've got cover when they have a dispute or conflict with a man. This kind of imbalance is always a problem, it's destabilizing, but that's not what I'm talking about here, the everyday woman getting her way because she knows she can. I'm talking about the genuinely antisocial and psychopathic woman, the woman who has a genuine contempt for humanity. This is a very small subset of the human population, but they cause enormous havoc and harm. We cannot do anything, as a society, to stop a certain number of psychopaths growing to maturity every year, they are an indelible part of the tapestry of human existence.\n\n&#x200B;\n\nBut while in the past we've often allowed them to predate because of indifference - who cares about the poor? - or fear - I'd better not criticize Stalin. I cannot think of a time, before the current state of affairs emerged somewhere in the 1990s as far as I can tell, where we have without a violent change of government given them complete cover for their actions, and in fact supported them in the very process of their psychopathic abuse.\n\n&#x200B;\n\nWhen I was young in the early 1990s my older sibling, who was sometimes violent, poured boiling coffee on my back. I had to get burns treatment at the local hospital, and the young male doctor there asked me if my father had done it. No, I said, my sibling did it. He asked the question, while he treated me, about three additional times. A more suggestible kid could easily have given the answer he was so clearly fishing for. I remember years later, a fully fledge adult, I talked to a therapist. He wanted to know all about how abusive and violent my father was (somewhat abusive, virtually never violent). He sympathized, he understood. But he didn't want to hear me say anything negative about my mother, who I certainly believe had psychopathic tendencies and who has wrought mental destruction on my siblings, particularly my younger sister. At the time it didn't register, but later I started thinking.\n\n&#x200B;\n\nI was watching a YouTube video that discussed the fact that men's rights groups were banned as student clubs on Canadian campuses. [https://www.youtube.com/watch?v=5s4sZi8zjzY](https://www.youtube.com/watch?v=5s4sZi8zjzY) here's the link. A woman and man who appeared to be from ethnic minority backgrounds argued up hill and down dale why such groups were an evil fifth column that should be banned.\n\n&#x200B;\n\nThe woman, who appeared to be Indian Canadian, even suggested men's groups might be more acceptable if they talked about 'the real issues', such as the plight of 'men of color' and 'transgender men', and she intimated that her white fellow panelist, supportive of freedom of speech, should zip it, and, all class, she seemed to mock him being of an older generation. She and the other man who spoke in her support against men's rights - who also appeared to belong to an ethnic minority, but seemed to be motivated more by sureing up his liberal credentials for political reasons than psychopathy - hinted that 'straight white men' should put up and shut up.\n\n&#x200B;\n\nThen there are the news reports Canada will give 95% of its foreign aid for women and girls. Well, that's nice...if you're a psychopath, and somehow find boys dying of HIV in Africa okay while girls dying of HIV in Africa not okay. Anyone who has lived in a developing country knows this is what it means, it's not some theoretical institute that spouts hatred we're talking about, it's for the basics - and the Canadian government has literally said girls' lives matter, little boys' lives don't.\n\n&#x200B;\n\nI've heard female family court judges expressly say they love the job because they can use it to deny custody to fathers. It's not so much the fact women are helped when men aren't that disturbs me - sure, it's unfair that men don't get special teaching places reserved for them to balance the gender numbers, but women get engineering places because WE MUST have gender balanced numbers there. But what I'm talking about is seeing the malice of genuinely psychopathic women given extraordinary rein to harm and injure men, and inevitably, their girlfriends and wives and children. I have seen time and again so many feminists truly motivated more by a desire to hurt men than help women. Brett Kavanaugh, an innocent man with wife and daughters - fuck it, hurting him with disproven falsehoods is more important than considering the welfare impact of this on his wife and daughters. It is more important to hurt a man than help a woman, which would make sense to the psychopath, right, because the psychopath disregards everyone except themselves including women. It's just that the direct harm is allowed to be delivered to the man, and all well and good if the indirect harm then flows to the women in that man's life. What isn't allowed, under feminisms perverted rules, is for the harm to be directed DIRECTLY to another woman.\n\n&#x200B;\n\nIt reminded me of what Cassie Jaye said in an interview, if I'm paraphrasing right, feminism isn't about helping women, it's about helping feminism. I'd go a step further, feminism isn't about helping women, it's about hurting men directly even if this indirectly hurts the women connected to men.\n\n&#x200B;\n\nI will be blunt. The majority of the most extremely hateful behavior I've seen has been from women who either openly self-identify as, or who the inferential evidence indicates are, lesbian. I've seen it from both straight and lesbian women, but I would say most of the most extreme psychopathic and antisocial behavior I have seen by women against men has been from lesbian women. I am not saying lesbian women have a greater incidence of psychopathy, I do not know if there is - or whether there would even be allowed to take place - research into this. But this is what I have seen.\n\n&#x200B;\n\nBut I don't want to leave everyone on a negative note. So I'd just like to add that this problem has gotten consistently worse over the last 20 years I have observed it and every indication is it is going to continue to get worse. There appears to be no catalyst or force to change this, and so, I would expect, an increase in psychopathic and antisocial behavior in society by a small minority of women against a lot of men.",
    "title": "Feminism: Enabling Female Psychopaths",
    "subreddit": "MensRights",
    "timestamp": 1555849241,
    "score": 127,
    "keyword": "man teacher"
  },
  {
    "text": "The \"empathy gap\" - a possible explanation for the \"women not helping women\" phenomenon / \"Lean In\" nonsensical advice? Class privilege has often been invoked as an explanation for Sandberg's infuriating Lean In \"advice\". \n\nAnother phenomenon often noted is women not helping other women in the workplace.\n\nA material I am now reading on empathy might help some psychological underpinnings of this:\n\n***\n\nIt’s Harder\nto Empathize\nwith People If\nYou’ve Been in\nTheir Shoes\n\nBy Rachel Ruttan, Mary-Hunter McDonnell,\nand Loran Nordgren\n\n\nImagine that you have just become a new parent.\nOverwhelmed and exhausted, your performance\nat work is suffering. You desperately want to work\nfrom home part time to devote more attention to\nyour family. One of your supervisors has had children\nwhile climbing the corporate ladder, while the other\nhasn’t. Which supervisor is more likely to embrace\nyour request?\n\nMost people would recommend approaching the\nsupervisor who has children, drawing on the intuition\nthat shared experience breeds empathy. After\nall, she has “been there” and thus would seem best\nplaced to understand your situation.\n\nOur recent research suggests that this instinct is\nvery often wrong.1\n\n[1. R. L. Ruttan et al., “Having ‘Been There’ Doesn’t Mean I\nCare: When Prior Experience Reduces Compassion for\nEmotional Distress,” Journal of Personality and Social\nPsychology 108, no. 4 (April 2015): 610–622.]\n\nIn a series of recent experiments, we found that\npeople who have endured challenges in the past (like\ndivorce or being skipped over for a promotion) were\nless likely to show compassion for someone facing the\nsame struggle, compared with people with no experience\nin that particular situation.\n\nIn the fi rst experiment, we surveyed people participating\nin a “polar plunge”: a jump into a very icy\nLake Michigan in March. All participants read a story\nabout a man named Pat who intended to complete\nthe plunge but chickened out and withdrew from\nthe event at the last minute. Critically, participants\nread about Pat either before they had completed the\nplunge themselves or one week after. We found that\npolar plungers who had successfully completed the\nplunge were less compassionate and more contemptuous\nof Pat than were those who had not yet completed\nthe plunge.\n\nIn another study, we looked at compassion toward\nan individual struggling with unemployment. More\nthan 200 people read a story about a man who—despite\nhis best efforts—is unable to fi nd a job. Struggling\nto make ends meet, the man ultimately stoops\nto selling drugs in order to earn money. We found\nthat people who had overcome a period of unemployment\nin the past were less compassionate and more\njudgmental of the man than people who were currently\nunemployed or had never been involuntarily\nunemployed.\n\nA third study examined compassion toward a bullied\nteenager. Participants were told either that the\nteen was successfully coping with the bullying or that\nhe failed to cope by lashing out violently. Compared\nwith participants who had no experience with bullying,\nparticipants who reported having been bullied\nin the past themselves were more compassionate toward\nthe teen who was appropriately coping with the\nexperience. But, as in our earlier studies, participants\nwho were bullied in the past were the least compassionate\ntoward the teen who failed to successfully\ncope with the bullying.\n\nTaken together, these results suggest that people\nwho have endured a diffi cult experience are particularly\nlikely to penalize those who struggle to cope\nwith a similar ordeal.\n\nBut why does this occur? We suggest that this phenomenon\nis rooted in two psychological truths.\n\nFirst, people generally have diffi culty accurately\nrecalling just how diffi cult a past aversive experience\nwas. Though we may remember that a past experience\nwas painful, stressful, or emotionally trying, we\ntend to underestimate just how painful that experience\nfelt in the moment. This phenomenon is called\nan “empathy gap.”2\n\n[2. L. F. Nordgren et al., “Visceral Drives in Retrospect:\nExplanations About the Inaccessible Past,” Psychological\nScience 17, no. 7 (July 2006): 635–640.]\n\nSecond, people who have previously overcome an\naversive experience know that they were able to successfully\novercome it, which makes them feel especially\nconfi dent about their understanding of just how\ndiffi cult the situation is. The combined experience of\n“I can’t recall how diffi cult it was” and “I know that I\ngot through it myself ” creates the perception that the\nevent can be readily conquered, reducing empathy\ntoward others struggling with the event.\n\nThis fi nding seems to run counter to our intuitions.\nWhen we asked participants to predict who\nwould show the most compassion for the bullied\nteenager, for instance—a teacher who’d endured bullying\nhimself or one who never had—an overwhelming\n99 out of the 112 people chose the teacher who\nhad been bullied. This means that many people may\nbe instinctively seeking compassion from the very\npeople who are least likely to provide it.\nThis clearly has implications for peer-to-peer offi\nce communication (choose the person you vent to\ncarefully). And mentorship programs, which often\npair people from similar backgrounds or experiences,\nmay need to be reexamined. But there are also important\nlessons for leaders. When approached by\nemployees in distress, leaders may believe that their\nown emotional reaction to the issue should guide\ntheir response. ***For example, an executive who broke\nthe glass ceiling may focus on her own success when\nconsidering an employee’s concerns about discrimination.***\n\n***\n\nThoughts on this?",
    "title": "The \"empathy gap\" - a possible explanation for the \"women not helping women\" phenomenon / \"Lean In\" nonsensical advice?",
    "subreddit": "Feminism",
    "timestamp": 1556378325,
    "score": 73,
    "keyword": "man teacher"
  }
]