[
  {
    "text": "I'm frustrated as hell. How do people get/find ridiculously well-paying under-the-table jobs that require little work? (Example inside) I'm frustrated folks.\n\nI won't go into the details about who I am just to save time because I have to head off to my $10-an-hour bust-my-balls job in about 45 minutes.\n\nMy girlfriend, who has had a lot of trouble looking for jobs in the past, got a job back around... October/November.\n\nShe INITIALLY went in to apply for a Starbucks position. The manager there just HAPPENED to be a rather entrepreneurial gentleman who had a whole bunch of little businesses up his sleeves.\n\nApparently, during the interview, he just flat out offered my girlfriend a job posting his sports related stuff on eBay for like... $25-$30 an hour (estimated but not fixed). According to her, it's never very hard work either. She's in front of a computer screen at the office all night. She has a lot of computer background (not technical background) because she ran a small Etsy store for her Perler bead creations for a very short time. She's a graduate massage therapist and nothing beyond that. In her words, she doesn't really have any significant outstanding skills aside from texture design (from her days of being an IMVU developer) and just being an artist in general. She's also never had any job experience beyond her self-employment and babysitting/dogsitting.\n\nFast forward to the week before Christmas, dude offers her a job doing tours at a local retirement home in order to get clients saying she could make potentially $5,000 a day in commission alone.\n\nHaven't heard much about the offer since, but that job aside, how to hell do you find these people that just want to give you a crap ton of money to do their lazy work?\n\nI put it that way because the way she describes her boss, he's tired. He's in his 50's, runs a lot of businesses, and just hires people to do the standard work; essentially, his employees are what automates his business.\n\nThe dude is just flat-out loaded (supposedly). Aside from the suspected $25-$30 an hour, he'll randomly just pay her like... $500 a night if he feels like she and the other employees did good work.\n\n(Just for the record, I've been up and down the gambit of 'the-creepy-old-man-who-simply-wanted-a-pretty-girl-working-for-him thing'. After months of skepticism, I'm convinced he's not up to anything skeevy.)\n\nI'm an A+ certified technician, with excellent Microsoft Office skills  (particularly Excel) just to name something and has a shit ton of computer experience outside of that, who has worked for the Post Office, Edible Arrangement, a small cafe, and currently a retail store. I'm gotten standard minimum wage for back-breaking work. (Back breaking because I'm a rather heavyset guy with quite a few medical issues). Everytime she tells me about her job, I can't help but get jealous.\n\nI've told her many times that it doesn't bother me if she ends up making more than me right nor or in the future, but I've always had a goal of wanting to be a supplier.\n\nI'm in a shitty situation at home where my family is somehow expecting me to move out on $150 a month (After bills and food) while being a full time student in Network Administration WHILE I have a Mom who refuses to look for work and insists on living off of social security. I desperately want to be on my own and move out with my girlfriend but $150 a month won't cut it and because I've had no financial basis to grow upon because my Mom refuses to look for work, I'm on my own here.\n\nI'm frustrated. I'm tired. I seemingly couldn't stumble upon a job if I had a Genie's Lamp.\n\nAside from my girlfriend, how in the bloody hell do people stumble onto jobs like these?\n\nI need a freaking break. The job my girlfriend has is like... my dream entry-level job. Doing something I love (anything computer related) for excellent pay with minimum hours so I can focus on school. (My girlfriend is no longer in school, BTW. She graduated years ago.)\n\nI apologize for the 'Dear Diary' like post. I'm frustrated.",
    "title": "I'm frustrated as hell. How do people get/find ridiculously well-paying under-the-table jobs that require little work? (Example inside)",
    "subreddit": "jobs",
    "timestamp": 1484235088,
    "score": 10,
    "keyword": "man artist"
  },
  {
    "text": "I was groomed and molested as a teenager I thought about a throwaway but screw it. \n\nFrom the ages of 12 to 16, I was groomed and molested by a family member. While he wasn't blood relation, I still consider it an act of incest because he married into my family when I was about 2 or 3 and watched me grow up. \n\nWhen I was 16, he was arrested. It's actually been about 7 years to the day and I feel like sharing in the wake of that girl being found alive in California after being kidnapped by an older man who groomed her. \n\nMy abuser believed we were in love. He believed that I had fallen for him and that I would marry him after I turned 18 and we would be together. He told his family he was no longer in love with the family member of mine he married and had met someone else. \n\nI lived every day in fear. I didn't sleep because I was afraid he would rape me if I was asleep. My food intake was monitored (one serving of dinner is a sign of a healthy girl; two is a sign of a fatty little piggy) and I was not allowed to date. Only certain friends could come over and I couldn't go to friends' houses if boys were there. \n\nHe once grounded me for two weeks because I wouldn't let him touch and kiss my breasts. I was 14. \n\nI couldn't wear makeup, because who am I trying to impress? No shorts in 100+ degree weather because obviously only whores wear shorts. No dresses. \n\nI had several pairs of underwear go missing in that time period. I did my own laundry and stuff I swore was in the dryer never showed up again. \n\nWhen I was being groomed, my abuser cherry picked the parts of my personality he wanted to keep. I was punished for teenage rebellion, punished for trying to explore my personality (am I a goth? am I punk? maybe I'm an artist!), but praises for being childlike and being a homebody. \n\nAlso, weirdly? Memes. My abuser loved that I loved memes. \n\nAfter he was sent away-- wait, real quick, when he called his parents while he was in jail, the court had a recording of his dad going \"you got that girl of yours into trouble, didn't you?\"\n\nBut after he was sent away, I was...free. I didn't have to be the girl he wanted (he had a special nickname for me and I wrote a lot of emo poetry about that girl being dead) and I could be the girl I wanted to be!!\n\nI kept parts of who I had to be. I'm a homebody. I still talk quiet on the phone for personal calls because I'm still used to the fear that the calls are being listened in on. I like memes, hence why I'm on Reddit. \n\nI filled the gaps in my personality with what I wanted. I'm sarcastic. I tell Dad Jokes. I can be melodramatic. I wear too much lipstick. I wear short shorts in the summer and all my underwear is accounted for. My body belongs to me now and forever. \n\nI showed up to his trial dressed in everything he hated. I wore a suit, trousers and a tie with a vest and a white button down with a blazer. It was the beginning of August and I thought heat stroke would get me but I had a point to prove. I pulled my hair back in the tightest bun I could, short of giving myself a face-lift-- I had to wear my hair long and down, or else he would accuse me of being a prude and laugh at me. Black eyeliner. Gold eyeshadow. (\"don't wear that eyeshadow anymore. it makes you look ugly.\") I wore so much red lipstick that I think it was on my teeth. \n\nI was hurt by somebody who believed he loved me. He wanted to marry me and have a family with me. He confessed to wanting to get me pregnant so I would have his children. He knew my bra size and that I slept without pants on. Because he said he loved me. And he told himself that I loved him. \n\nI had parts of myself deleted and overwritten by someone who said he loved me. I was hurt by someone who wanted to marry me. I was threatened with homelessness and had food withheld by someone who wanted to put a baby in me. \n\nBut I made it. My love life is shit, but I think that's for different reasons. I eat ice cream. I'm 30 pounds heavier than I was when he was around, which means I'm no longer 30 pounds underweight. \n\nI'm alive. And so are you all who've gone through the same or similar things.",
    "title": "I was groomed and molested as a teenager",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1492881479,
    "score": 147,
    "keyword": "man artist"
  },
  {
    "text": "I feel like the average redditor is sexist and sees women as pseudo-human. I've been feeling this way for a while, based on comments, posts, and jokes and how they were received and upvoted. \n\nI'm posting this today after seeing a painting in r/pics of a nature scene with the female artist posing next to her finished work. The comments focus largely on how the woman looks, and many of them are extremely objectifying. \n\nI get that a lot of people are fishing for upvotes and trying to be funny, but I couldn't stop picturing how the comments would be different if the artist had been a man. \n\nDo any women here ever have this same feeling? \n\nI usually don't disclose my gender on reddit because I know the responses I get will leave me extremely frustrated.",
    "title": "I feel like the average redditor is sexist and sees women as pseudo-human.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1503070167,
    "score": 65,
    "keyword": "man artist"
  },
  {
    "text": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear. Hi everyone. I don't really have anyone to bare my heart to right now. I want to send this out to the universe and see what comes back. I would love to hear your perspectives.. whatever corner of the world you're in.. whatever life path you've walked. I really appreciate all your voices and Reddit so so much. I'll try to keep it condensed and simple. \n\nI dated a narcissist for eight months. He was incredibly cruel and selfish but hooked me with rare very special moments of revealing a deeply hurt.. damaged.. wholesome.. helplessly pure childlike heart. He would verbally and emotionally abuse me but sometimes with time, he would realize how hurtful or selfish his actions were. With sincere tears in his eyes he would apologize and express that he's learning and wants to change.. express that his cruel actions and words are purely from ignorance because even his own mother never showed him any love, open-heartedness, gentleness, morals. \n\nIt doesn't come as a surprise.. he experienced a horribly abusive heartbreaking childhood. He used that excuse almost always. And being an empath.. my heart opened and poured for him, I wanted to love him more. Help him see all women aren't money hungry and out to lie and cheat. Show him it's okay to open and be vulnerable. My upbringing wasn't perfect either. I honestly felt we were both \"breaking\" our cycles of hurt from the abuse and neglect our parents created. (My family was very poor growing up and my father abandoned my mother, sister and I when I was 12.) He always said such amazing things about growing old together.. building character through experience.. being there for eachother.. building a life and family together that's strong and confident (him) but sensitive giving and loving (me). He would say I am the best person he's ever met with character he values most above anything. That I have changed his life forever in all aspects of his life.. work. And I was learning a lot about patience, understanding, and forgiveness. No relationship is flawless and flatlined. I appreciate and value rolling with the punches of life. Struggle is what makes you grow.. its what broadens and builds your mind and heart, I love that. And I love the idea of a life partner who is down to walk the sometimes mountainous path of life with you. I appreciate open-mindedness and the will to adapt. Effort is so beautiful. Anyway.. I honestly believed we could awaken together.. Live more and more with awareness.. and mindfulness.. and learn together. But I was wrong. He would do things like tell me his ex was exceptionally beautiful.. she was a professional model.. but I'm pretty. His other ex is very smart. But I'm definitely not smart. I'm talented and creative. But not smart because my brain is not wired to be a coder or engineer. This is one of the most painful parts. I stayed with a man who fought me and defended himself for the right to call me stupid.. many times. He would tell me my problems are trivial.. that he doesn't care about my pleasure.. several times he would fuck me and just roll over. I would silently cry in the dark and masturbate next to him as he snored. We fought so many times about our sex life. It was always selfish and only about him. There were times I would be very ill or very drunk and he would just go ahead and fuck me.. even when I'm barely conscious. I would just lie there in the fetal position. He said that was one of the great things about me.. \"I never left him wanting.\" He was so proud that he's slept with 120 women. He told me I was the first one he gave eye contact with when having sex. And he said he typically didn't kiss the girls he'd sleep with. That I have no idea how much he's changed. I brought this up so many times.. that I want to make love.. sex should be us sharing how we feel physically.. it's about both of us..and he just didn't care. He would say sometimes sex is just carnal and sometimes he needs to be a man and take it. It's just about him. I never once orgasmed in the 8 months we dated. He never tried. It was always for him. He went down on me maybe 3 times in 8 months. He blamed it on me. He said some women aren't confident or comfortable orgasming in front of people. He would say some girls orgasmed as soon as he put his dick in them. Typing this out I know it sounds fucking heartbreaking and pathetic. I know. If I heard all this from my sister or if my future daughter were telling me all this... I would be utterly mortified and devastated for them. Sometimes it's very hard to see unobstructed reality when you're struggling in the middle of everything. He would fall asleep after I drove 22 miles to talk about how he's hurt me as I am crying next to him in his bed. He once dropped me on the side of the road with all my luggage to take an uber home after a road trip when I said I wanted to go back to my apartment, not his. \n\nHe has a very unhealthy relationship with sex. He was once over 500 pounds but with sheer will.. starving and lifting he lost 230lbs. From age 30 to 35 he overcompensated by \"fucking and conquering as many women as possible doing whatever it takes to make them comfortable\" His greatest fantasy is rape. He would often tell me his greatest \"id\" fantasy is to kick down a door like a Viking and violently rape a wife as his defenseless smaller frightened husband is forced to watch in horror. (My ex is 6'5) He used to \"jokingly\" say rape victims often orgasm because in a subconscious level they loved it. He would joke and say 50 shades of grey is about him.. and there's a reason why that franchise is insanely popular. Women love and want to be raped on a cave man level. He absolutely lovess the new Westworld for how brutal and fetishized rape, pleasures, violence, dominance, and indulgence is. He would often say when he looks around and thinks about it.. his character and life is similar to most leaders. The greatest leaders he knows arent emotional, overly caring, sensitive, \"squishy\" or giving. Superstar singers.. athletes.. businessmen like Steve jobs.. world famous video game designers.. they all have one thing in common. They \"lick the earth\" as he would put it.. and they dont hold back their id-driven desires. That is the source of their greatness and inspiration, especially as an artist. Being a sensitive \"squishy\" ..That all seemed so empty to me. \n\nHis dream is to have a line of hundreds of women waiting their turn to be fucked.. he impregnates them and doesn't take care of the babies. \"Like a Viking king\" He often said sex is a need. If he doesn't have sex in two weeks everyone starts to look like meat. He doesn't care. Men and women alike. I tried to understand the root of this manifestation. It was horrifying to hear but in all these stories.. all I saw was this nerdy obese kid who was ignored all of his life... a guy who was so ignored that he lost his virginity to a prostitute... this poor 7 year old boy who would be locked in his room for days by his horrible stepfather. His cries ignored by his cold mother to ensure her loans are paid by this new man. It all screamed suffering and heartbreak. Especially because I personally know several women who have experienced rape and I have been volunteering with The Rape Foundation for several years. I really tried not to judge. How can you.. life is crazy and sometimes devastating and sometimes you dealt difficult cards.. like your parents. And humans are capable of such cruelty.. a lot of times they genuinely think they're doing the right thing. We also got into many painful fights about his views on having children and marriage. He said he would absolutely test the blood of his babies. That was a deal breaker. I would explain how hurtful that is. He would say its not about me. It's statistics. Women will lie and have men financially support children that are not theirs. (This is what his mother did to his stepfather. When his stepfather found out. He began to abuse my ex from a very young age.) He also said 80% of women initiate divorce for the payday. So if marriage was a deal breaker he would consider \"many types of arrangements\" with the help of his lawyers. \n\nAnyway.. 8 months we dated. He made me cry 1-3 times a week. But when things were good we were both adventurous.. incredibly playful.. tender.. driven.. and affectionate. We both love similar music and movies. He would sing to me.. we loved going on long drives and talking about life.. this existence.. our hopes and dreams. We are both class clowns. But one thing was rawly clear. We were cut from different cloths. He's a big tall trump loving white guy from Texas who always lived in a big house.. no student loans.. went to art school.. atheist.. first job was after college for a video game company.. etc. I'm a Korean American from the east coast who was raised by a struggling single immigrant mother.. have had at least one job since high school.. lived in my car in NYC.. put myself through college thus have student debt (this was a big issue for us.. he said for him to even consider marrying me.. I would have to get rid of my debt. I'm the first one in my family to go to college).. insatiably curious about spirituality.. religions.. philosophy, the human condition. I am such a sensitive giving tender hopeless romantic easily hurt squishy. And he's just a confident iron fist, force. His mother and the rest of his family believe vulnerability and feelings equal weakness. A few times he was very vulnurable and shared how when he get married and starts a family, he plans to stay away from his family because they are all a very certain way. \"poverty mentality\" is what he would call it. He would share how his mom never cared.. and still doesnt care about his problems when he tries to open up to her. One time when he dumped me he said.. his mother is so strong she has never cried ever in his life. And I cry all the time. He would resent her for her hard coldness but I don't think he's aware of how attached and proud he is of her. He'd laugh and say \"my mom is a tempest. Shes the boss of the house, what she says goes, she gets her way, she's dominant she's fierce. She's a force.\" He would express how the other girlfriends he introduced to his mom were shredded apart and would end in tears going up against such an intimidating woman. I see right thru all that. His mom holds a tremendous amount of guilt. He never once talked to her about how her abandoned him while his step father would abuse him and lock him up. For days he would sleep on a bare mattress.. starve..  and go to the bathroom in the room. He said he became obese because of this feeling of having absolutely no control and not knowing when he'll eat again. It's so heartbreaking. When he got older his step dad and mom sent him away to a military school for delinquent kids. He would be locked in his dorm for days as well. He would beat kids up and created a group of friends that he \"protected\". Multiple times he told me about a very feminine kid who would massage him in exchange for his protection. My ex would explain if they locked him up in his dorm for a few more weeks he would have absolutely fucked that feminine kid. My gut tells me he did a lot at that school that he'll probably never tell anyone. \n\nI see thru all this. He and his mom have taught eachother to pretend like nothing happened. This is their way of comforting eachother.. pretending like it went away. As a woman.. as a super sensitive aware woman.. I know she's holding a lot of guilt and sadness. She's created such a tough persona she can't get herself to let it out. People will live a lifetime running from feeling. \n\nMy ex is incredibly charismatic to his coworkers and he's loved and well known at work. Many shy guys at his video game company idolize him and his ability to sleep with many women. He's this fearless jokester who is \"untouchable\". He is very proud of the fact that he hit the \"jackpot\" being born a tall white confident man. He has absolutely no one he's responsible for except for himself. Im very close to my mother and sister and when my parents divorced I pretty much stepped up and felt responsible for keeping the three of us together. Since high school I started to help financially support our family. He couldn't understand that. He'd simply say it's very good of me. \n\nAnyway..\nWe are such opposites and we knew this from day one. I was WAY too giving. I paid for amazing vacations because he had never snowboarded.. snowboarding was my life from middle school to college. I always drove to his place in Santa Monica (22 miles away from my place and my work.) I always planned amazing adventures.. things he's never done in LA. He surprised me with a candle lit dinner once. The first three times we ever went out to dinner was my idea and I treated him. He used to say I am the balance and light that will melt the ice and softened the thorns around his heart. I remember one time he was just in awe. He didn't own any plates or cups so we went to target and I got him some essentials. He said he had never been treated or cared like this. In the beginning, he did hand draw me pictures of me which was really touching. He had flowers sent to my work. Once after we fought and once after I stayed with him while he got a gal stone removed. He used to say he had never spent money like this for anyone. He used to never even buy girls drinks before taking them home. So many times I told him. I don't care about the money spent. Pick a dandelion for me. Let's share a mcdonalds apple pie on the beach. It's the thought care and effort that is so special. He just never got it. \n\nHonestly as the days pass and I continue to practice Shambhala meditation, contemplation and mindfulness.. I see I was YEARNING for that strong eternal male energy love... the love of an unconditionally loving caring father that I never had. He broke my heart 1-3 times a week for 8 months, honestly my heart and gut knew it was very wrong. But my yearning to fall in love.. to GIVE the love I hope to receive.. and the yearning to settle down blinded me. I gave the love that I wish to receive. Even though my ex didn't deserve it. The biggest lesson I am walking away with is why did I stay for so long. That's where I am going to learn and grow from. That's where my self love needs to focus on. Believing in someone.. believing in hope.. believing in good and forgiveness are all wonderful things but there needs to be an unbreakable boundary where my self respect and self worth isn't brutalized. And I need to have self love and strength to walk away. For good. Even when they're crying, apologizing, explaining, or making the most beautiful promises. \n\nThe very last week we spoke. I texted him in the morning after fighting the night before. He bit my head off about bothering him at work. I went silent after that. After several hours he emailed me explaining he fucked up and when he gets emotionally overwhelmed he doesn't know how to deal. He said he loved me.. loved what we've built.. that I am a ray of sunshine he has been able to capture and he will never give up. He said he was going to come over that night to fix things. \n\nI was so exhausted and broken.. I couldn't get myself to respond. I just didn't get it. Me caring.. me reaching out being affectionate.. texting him to see if he's okay.. all of that to him was nothing but an annoyance and a horrible burden. If you have so many excuses against it.. and so much aggression and aversion against it... why be in it? How can I apologize and be sorry for burdening you with my affection? Poisoning your life with my love? \n\nAfter getting no response for 5 hours he texted me. \"Actually I'm not coming tonight. I'm seeing other people.\" That was it. After a few days. I emailed him a couple times that I deserve a proper phone call break up. He unblocked my number and finally called me. Immediately he just unloaded his anger. He blamed everything on me. He said I have a personality disorder and as my friend he was begging me to get help. That everything was in my head and that I cry for no reason. He said he knew from the first week of dating that I was the problem but he felt bad for me and was tired of hopping from one girl to another so he stayed with me for 8 months. He said he is tall.. confident and white.. he makes a shit ton of money and he loves his life. He said \"I simply have TOO MANY choices.. our connection wasn't special at all and I will love again\" He said he had already fucked someone new and she is \"very sweet\". He went on a date with someone and \"she is fucking awesome\". I stayed on the phone as he said every single thing a hurt desperate person would say to try to convince himself that's he's okay.. he's in control.. he's not hurt.. and he's right and strong. \n\nWe often talked about the five love languages. He always said he only needs physical touch. And I need all five which he thought was crazy. I stayed on the phone with him as he described all the reasons why this new stranger he slept with was better than me. How her only love language is touch as well. He emailed me on Monday saying he will never give up, and by Thursday he had slept with someone new. As I listened to all this.. it finally clicked in my heart. That was it. All the hope and forgiveness and empty promises broke in me. He finally cut the remaining karmic tie between us. This was never about me. I was never going to make this guy happy and we were never going to work. All this horrible cruelty he was yelling into the phone... was his internal dialogue convincing himself that he is right, he is okay, he not hurt, he is not responsible. Having no control.. or being accountable for selfish hurtful actions causes him to lash out. He has such a fear of feeling things.. of getting hurt.. or having no control that he rather live a surface level life and cushion himself with yes people and agreeable circumstances that make his life easy and unchallenging in anyway. Control everything.\n\nThat, believe it or not is the shortish summary of my last 10 months. There are so many other examples and details but I have a feeling you guys get the picture. \n\nSo here I am today. It's been an up and down road to healing. Today my close friend sent me articles on the toxic relationship between empaths and narcissists. I am SHOCKED how accurate and to the T these articles capture our relationship. Our relationship was EXACTLY like how these articles explain it. Honestly... I wish fate would send these articles to him.. I even contemplated having my fiend or my sister email them to him. Is it wrong of me to care about his happiness and growth? Care about him opening his eyes to the destruction he's creating? Is it wrong of me that I don't violently hate him? I feel sad FOR him. I feel no need for relief by cursing him and saying cruel things. I have no need to fill any voids by sleeping with people and saying \"OH I am SO over him. OH he was horrible and I can do better.\" Life is vast and life is crazy. How can I condemn and judge anyone? That's just not me. You can't control certain cards you're dealt... like your upbringing. But you DO have the choice in how you live on from these experiences. That is what I do choose to examine. I wish him bravery and strength.. I wish that for anybody and everybody. I wish that for myself too! I'm working on it everyday. Strength to see myself and life without any veils. See my actions without any self deception. (Deception like cushioning your ego.. focusing on blame which is so empty and pointless.) Fear from not knowing what's gonna happen.. fear of having no control.. it's instinct to protect yourself. Your ego will protect itself with all kinds of destructive momentary relief (empty sex, alcohol, saying mean things to people and putting others down, etc.) I wanna see things for what they truly are. Be brave enough and have the wisdom to walk away when you know it's wrong and not meant for you. \n\nIs it wrong of me to hope that he'll learn the true root of happiness? It's not money or sex with hundreds of beautiful women. Or telling yourself how confident and awesome you are. How many people know you. (From the years of isolation.. all he did is draw alone in his room. Now he is a somewhat well known video game artist and director at a major video game company in LA.)\n\nLiving a full life is about living awake.. how much you open yourself to the world. How much you give and share. Vulnerability is true bravery and strength. Not cushioning your life with ease and agreeableness. But I realized.. who am I to force a lesson on anyone. Who am I to \"make\" someone wake up or realize things. Even if he were to have a.. \"shit.. now I see\" moment.. it takes consistent drive and desire to be awake and mindful... it takes time to change your habits. I just wanted to know what you guys think. Thank you for reading. I may be hurt and heartbroken but I am SO thankful for this experience. I think these lessons have really opened my eyes and I'm coming out stronger and a lot wiser. You definitely can be too open... too giving.. and too forgiving. \n\nhttps://dailyoccupation.com/2017/03/14/toxic-attraction-empath-narcissist/\n\nhttps://www.psychologytoday.com/blog/sense-and-sensitivity/201201/the-highly-sensitive-person-and-the-narcissist?amp\n\nAs the time passes I rawly see how completely lost I became. I lost myself and completely forgot who I am and what I'm worth. I became a deeply desperate and sad person. Everyday I yearned for the small crumbs of kindness and affection he would strategically give me.. especially in the form of verbal affirmation: telling me I'm the love of his life and he will never give up. But then check me by ogling and comment on women's bodies while we're out.. and keep me down on myself and insecure. He is truly manipulative with his words which in this world can take you far. It's rewarded. He was always very proud that he could get what he wanted.. especially with women. I also rawly see that how you treat and speak to others is a true reflection of how you treat and speak to yourself internally. If someone is so easily and freely able to be sooo mean and cruel to another living breathing FEELING human.. how is their internal dialogue with themselves and their self worth? \n\nThank you so much for the wonderful comments and messages. I cannot express how moved I am. Its even more special because we are all anonymous strangers yet we are all so interconnected in how we feel and the hardships we face. I am so thankful. I choose to take this painful experience and life lesson and continue to explore myself.. love myself... open myself to others.. and love. \n\nHe texted and emailed me a few weeks ago. He wrote:\n\nText:\nIt's been hard without you. I hope you're okay.\n\nEmail: \nIt's been hard without you. I hope you're okay. Sorry for how things went down. \n\nI couldn't respond.",
    "title": "I'm healing from an abusive relationship with a narcissist that ended 2.5 months ago. I could use some advice.. or simply an ear.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1498231430,
    "score": 14,
    "keyword": "man artist"
  },
  {
    "text": "The Meaning of Feminine When I think of feminine, I first think of shape, of cinched waists and pencil skirts. Heels to elongate, show the tone of the calf and give a little perk to the ass. I think of silhouette and shadow, cleavage and rounded edges. Curve. Hourglass. Lithe muscles and long spine. Thin fingers. Thin everything.\n\nThen I think of long hair and long eyelashes. Red lips and big eyes. Painted nails, rosy cheeks, lined eyes, big smiles, ringed fingers, collar bones, shaved legs, small waists, and perfect brows. \n\nI think of aesthetics first. Always what we look like, how we please the eye. Or more, accurately, how we should please the eye.\n\n\"Short hair is breaking convention. She must be trying to make some kind of statement.\"\n\n\"Apple shapes are just unlucky, poor girl.\"\n\n\"Doesn't shave her legs? Clearly some kind of crazy hippie who doesn't like boys.\"\n\n\"Don't like wearing lipstick? Well, that's OK, it's not for everyone - but it would look really good on you, you should try it!\"\n\n\"If she just lost 20 pounds, she'd be so pretty.\"\n\nNext, I think of feminine in terms of sound. The pitch of the voice: high, asking. Not too loud. Giggles. The word \"like\" as a filler, transition, or replacement.\n\nA feminine woman is polite. Content. In control of herself but no one else. Demure. Pleasing. Proper. Excellent posture. She doesn't curse, drink beer or whiskey, get loud or passionate, burp, fart, or take a shit - giving the impression that her body works differently than a man's. \n\nIn my mind, being feminine is boring but respectful. Safe. Feminine is sweet, supportive, encouraging. Feminine is never being angered, or at least not letting it show. Feminine is all teeth and perfect skin. \n\nThese are the things that automatically come to mind when I force myself to really focus on the word and concept of feminine, usually during my long subway rides to work when I most often get lost in these types of thoughts. But then I’ll sit up in my subway seat, shoulders pressed up against the shoulders of my fellow commuters, and think to myself, “But why? Why do I think of these things when I focus on the word feminine? Where does that come from?” The answer comes easily, as it is usually the same answer whenever I ask myself why my subconscious is full of unsolicited information about social or gender norms. I believe society, essentially just living life, has taught me what feminine means.\n\nBut, I want to go deeper than that. Ask, where did all of this originate before it got to me, sneaking into my brain and influencing my perception of the world and others? What's the purpose of feminine, as a concept? Or, if not a purpose, then the product of what cause? I know it is human nature to categorize things but how has feminine come so far as a concept?!\nI have all of the questions. \n\nLet’s start simply. Why do we get our nails done? Do our hair? Dress nicely?\n\nWithout doing the research I probably should, my guess is that, at some point around the 1920s, culture shifted, allowing for a more materialistic and flashy lifestyle, particularly for those with money. Companies marketed to this new, consumerist society and women were allowed to adorn themselves, show a little skin, appeal to the opposite sex and show just how feminine they could be - show their worth, if you will. Going further back, women have been historically showcased for their aesthetic beauty - reclining on 16th century sofas for male artists who painted their naked form. Fancy men would pay top dollar to hang these on their wall to stare at, share with their other fancy friends, and objectify. Now, we hang these fancy paintings in fancy museums and stare at them with our loved ones, discussing their history and aesthetic appeal as if we don't still do the same thing on the cover of every fashion magazine.\n\nShall we venture even further back, to a time when women were gatherers and baby-makers, men hunters and warriors? Was feminine an important concept in this time? Maybe in a literal sense, women being female with womanly body parts that allowed for procreation. But that isn’t the very deep and complicated sense of feminine that we have now. It seems to have evolved over time and become something we know of but don’t really think about. Until now of course because I’m making you. Don’t fight it. It’ll be great.\n\nIn our modern times, women describe many reasons for adorning themselves with clothes and polish and highlights and makeup. Some say they do it to attract a man or to keep their man happy and committed. Others say they do it for other women, because only other women really appreciate the effort and effect. Some say they do it for themselves and no one else. Is this possibly true? No one else? I don't buy it. Feminine is too deeply ingrained into the concept of womanhood and we primarily do these things to fit in, because we understand the comfort and convenience of aligning with the crowd. (For those women out there who truly curate a look for themselves and no one else, I applaud you. I'm sure getting to that place was not easy, defying societal norms in that way. I am truly impressed and we should all be paying more attention.)\n\nOnce, when I was young, I was looking at my fingernails like this: (image of a hand, palm up, fingers curled in to show the nails)\n\nMy dad stopped me, told me that girls don't look at their fingernails like that, only boys do. Girls look at their fingernails like this: (image of the back of a flat hand, nails displayed)\n\nIt's more feminine, he said.\n\nHow did my dad know this? Why did he think this was important enough to teach me?\n\nI assume it is because seeing me check my nails the \"boys\" way seemed visually wrong to him and a parent's instinct is to correct. Parents guide and normalize their children so they will be socially appropriate and accepted. No one wants their child to be the one with their elbows on the table, chewing their food with their mouths open and a finger up their nose. But at what point do we realize that the line separating masculine and feminine is mostly arbitrary?\n\nThings that are innately female:\n-Getting your period\n-Giving birth (except for sea horses)\n-Going through menopause\n\nThings that are innately male:\n-Testerone - basically, the ability to put on quite a bit of muscle mass\n-Receding hair lines\n-Erections\n-Ejaculation\n-Beards\n\nAnd even some of those things exist across gender lines in some cases!\n\nI can't think of too many other things that are truly innate. My stance is that most things are imparted by society, slowly over the course of our brain development - from birth to roughly the age of 25.\n\nMen are not innate wood choppers, mathematicians, and decision-makers. They were taught to do these things well, told that they would be good at them. So, inevitably, many men did these things and did them well for a very long time. OK, so maybe men are good at chopping wood because of the whole muscle mass thing but you get my point. \n\nWomen are not innate nurturers (future post), decorators, and submissive followers. They were taught to do these things, told they would be good at them - or, at least, that this was their lot in life and it didn't really matter if they were good at much of anything. Women, in a very general sense, have nurtured, decorated (themselves and their homes), and submissively followed men very well for a very long time.\n\nBut things change.\n\nNow, some women stay late at the lab and some men pack their kid's lunches and pick them up from school. Some women don’t marry and focus on their passion while some men happily cook delicious family meals each evening. Some women don’t wear make-up and prefer pants to skirts and dresses while some men really hate getting dirty and love a spotless bathroom floor.\n\nAnd we get to decide to label these, call one feminine and the other masculine. We get to decide if we want these actions to have names associated with gender, or anything. We are society and we can choose to stop categorizing what people with penises do and look like and sound like vs. what people with vaginas do and look like and sound like.",
    "title": "The Meaning of Feminine",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1488897458,
    "score": 8,
    "keyword": "man artist"
  },
  {
    "text": "Should I become a Software Developer or a Tattoo Artist? I've recently turned 20 and realised that now is a great time to start moving my career forward. I've been working as a graphic designer at the same place for 3 years now and it's getting a bit stale with not much more potential. I've handed in my notice to leave in April. My plan was to go freelance offering graphic & web design. I was pretty confident about doing this until my dad told me that he doesn't think that it's a great idea and that I should get a real job...\n\n\nSo with my confidence a little knocked, I've looked at this as a good time to maybe have a change of career path. I've narrowed it down to a couple of options but I would appreciate any advice anyone has to offer as I'm having a really hard time deciding what is the right choice for me.\n\n\nOne of the career paths I have found interesting is programming. Which you probably get a lot of on this sub. I particularly like the app development side of it. I love the idea of a possibility of working in the game industry. I think there's a demand for software developers in London at the moment, which is reassuring. From what I've read I match the criteria for the kind of guy who would enjoy programming e.g. enjoy logical thinking, creative, enjoy solving problems. I've always been obsessed with technology and I think that programming is something that I would be good at. However, my worry with becoming a developer is that I might find it mundane and I feel like I might be so tempted to do it just for the potential to earn a huge paycheck. It would be nice to from someone who has any experience of this?\n\n\nThen my other option on a pretty different end of the scale is becoming a tattoo artist. I think this would suit my personality quite well, it's a lot more laid back, obviously a creative industry and has potential to make a good living. I understand that it's not an easy industry to succeed in, but I do know a couple of tattoo artists who I think could help me. I've always been naturally artistic and a fast learner, so I feel that this is also something that I would be good at. I feel that I would much prefer the lifestyle of this career path. With a typical day of 6 hours, it's fewer hours (kinda lazy I know but I would like to still have a life!) and the possibility to run my own business someday. \n\n\nOr I could just find another job in graphic & design. Or even not listen to my old man and go freelance! It's a tough one but I'm really struggling to find the right answer for me at the moment and I feel that this is the best place for me to hear some good advice. I appreciate any advice, would be great if I could get some advice from people in either industry. Kind of a long shot I know, but worth a try. Apologies for going on about myself for so long, I hope this hasn't been too boring of a post. Thanks for your time.",
    "title": "Should I become a Software Developer or a Tattoo Artist?",
    "subreddit": "careerguidance",
    "timestamp": 1486419175,
    "score": 3,
    "keyword": "man artist"
  },
  {
    "text": "Can you give me some ideas as of which possibilities I have with my current skills? I have finished a bachelor in arts and design, this included in the following: Fine arts, 3D design, filming, adobe photoshop, premiere pro, Illustrator and Dreamweaver. I have been the boss of a two man student enterprise which basically was carried by only me, even though forms and paperwork is my biggest weakness. I had character development and design, story design, design thinking, product design, professional practice as a comic artist, some caricature work, logo and banner designs.\n\nOther I have a one associate in teaching directed at arts and crafts, with some art history.\n\nCurrently I am having a course in webdesign, some extra 3D design and such.\n\nAs due to my studies taking a lot of time, I havent had much chance to do any part time jobs, though Ive learned I can do bartending pretty well, I know how to operate a cash register, and I can do some librarian duties.\n\nWith this in mind, what sorts of jobs, or further education would you recommend me? Im kinda tired of school, but I dont mind doing more if its more focused towards a certain career.\n\nI started late with my studies due to stuff happening in my early twenties, so I am not that young currently.\n\nAll I want is some thoughts and suggestions you can come up with based on what I have written, other than teacher or freelancer.\n\nPersonal hobbies and interests are gaming like Magic, D&D (DM'ing), youtube, cooking, helping others in their creative endavours with counselling or design ideas, thinking of new possibilities design vise for a product or project.\n\nMy weakness is that I have Adult Inattentive ADHD, which is both a strength and weakness, sometimes I finish a project in a day, while others I cant for the life of me concentrate on.\n\nRealistically, I want anything that plays on my ADHD strengths and doesnt care about my weaknesses, but that is a wild card most of the time.\n\nThank you for reading this long post, and thank you for your suggestions.",
    "title": "Can you give me some ideas as of which possibilities I have with my current skills?",
    "subreddit": "careerguidance",
    "timestamp": 1489331035,
    "score": 1,
    "keyword": "man artist"
  },
  {
    "text": "Sharing my personal story about a my career change from chef to web developer Hey there. I made a career change into web development in 2015, and before that, I worked as a chef. I often get asked how I did it, and if I have any advice for new and aspiring developers. \n\nI originally wrote this as an article on my website, but I wanted to post some of it here to give some possible insight and inspiration to anyone who doesn't want to go back to school, and would like to read someone's personal story about the actual steps they took to land their first job without a degree or experience. Basically:\n\n- A little about myself\n- How I fell into the wrong career for me\n- How I decided on the right one\n- Steps I took to land my first job in the field\n\nThroughout this story you will find the answers to some of the common questions I’ve received, such as \"how did you land your first job?\", \"what was the technical interview like?\", \"what technologies did you know starting out?\", \"how long did it take?\" and \"what was the hardest part?\".\n\nI'm 27, and it took 10 months to complete my journey.\n\n([Here is the original post.](https://www.taniarascia.com/how-i-made-a-career-change-into-web-development/))\n\n### About me\n\nI was born in ’89 and grew up a shy, eccentric girl in the suburbs of Chicago, where I spent most of my childhood playing Super Nintendo and drawing. I discovered the Internet in 1998 when my brother Nick took me to the public library, where they had computers running Netscape Navigator.\n\nI still vividly remember the first day I ever used the ‘Net (that’s what we called it back then) – that very day I learned the meaning of \"lol\", made my first E-Mail address, and discovered how easy it was to meet new people who share my interests. My brother taught me a few basic lines of HTML and I took it from there. Thanks to free hosting on GeoCities, I could make websites about anything I wanted – myself, Digimon, Animorphs, myself, clans and guilds for the silly games I played, obscure ’80s music, accordions, and more. I discovered I could even draw on MS Paint at home and transfer it to the Internet via floppy disk. And a new hobby was born.\n\nSo how did I learn to make those websites? I would just copy the source of other websites I liked, open up Notepad and randomly change things here and there until it started doing what I wanted. Complete trial and error. In the beginning, I couldn’t figure out how to copy and paste the source code, so I had to type everything out myself. I never once studied coding in any capacity in this time, and I couldn’t tell you a CSS class from an ID, what a variable is, or the definition of an HTML tag.\n\nMy life mostly continued along the same path until the end of high school.\n\n### Falling into the wrong career\n\nAt seventeen, right out of high school, I certainly didn’t have the slightest clue what I wanted to be when I \"grew up\". Making websites as a career wasn’t even a shadow of a thought in my head. I always assumed I would go into some sort of artistic or graphic design career, but what I wanted to do much more than that was travel and see the world. Since there was no official job that pays you to explore other cultures, I wasn’t content with any career path, and I didn’t research any options for myself.\n\nYet whether we put a great deal of thought into our future or not, life moves forward, and decisions are made. Since I had no plans, I took the first offer that came along, which was a \"free ride\" to a university’s Culinary Arts program based on some test scores I had. I didn’t really know anything about the culinary industry, but I enjoyed cooking a lot, and maybe I could even use it to travel, so why not?\n\nI did an accelerated Bachelor’s program, graduated and worked several jobs in the field from prep and line cook to banquet chef to culinary manager and chef. I won’t bother going into detail about working in the kitchen, but I will say it taught me an immense amount about hard work, managing stress, and being a leader.\n\nAfter eight years wearing many hats in the industry, I knew it was time to move on. There is quote that roughly goes, \"change happens when the pain of staying the same is greater than the pain of change\", and that’s the best way I can summarize my reasons for deciding to find a new career.\n\n### Deciding on the right career\n\nAlthough I had never been unemployed, the situation for me at my final chef job in 2014 was bad enough that I put in my two weeks notice without having another job lined up. I knew I wanted to do something different with my life, but I had no idea what. I very quickly realized I didn’t want to any of the jobs that a culinary career would aid me in.\n\nI bought the book What Color Is Your Parachute, a book about finding the right career for you through doing a lot of exercises and writing. I also found a book that had you take timed tests to find out your natural aptitudes and matches you to careers that fit well with those natural skills. I wanted to understand myself, and find a career I could be content with that would also sustain me.\n\nArmed with those books and a ukulele, I drove to a campsite a few hours away and spent the next week in seclusion, hiking around all day and going through some of the exercises in the career books.\n\nI will tell you right now – neither of those books told me what to do or gave me the magical answer. Soul searching is a lot of hard work and takes a lot of time, and it’s really difficult to focus and be honest with yourself about who you are, vs. who you want to be.\n\nHowever, the books gave me some guidance and helped me ask the right questions and learn some things about myself. I started coming to the same conclusions over and over again. Exercises would ask what you enjoy doing, what you’re good at, and what you can do for long periods of time without noticing it, and \"making websites\" was always among my answers. My greatest skill according to the timed tests is quickly scanning information, which made me realize I have a natural aptitude towards finding syntax errors in code, and fast problem solving.\n\nAll of that eventually helped me eventually land on \"some sort of graphic design, web design, or coding, as long as I don’t have to go back to school\".\n\n### Steps I took to land my first web job\n\nAt this point, I was newly unemployed, without a plan, and with a resume full of culinary work experience and schooling. While I was still figuring out a basic idea of what I wanted to do, I started applying to all sorts of jobs – data entry, temp jobs, manufacturing, warehouse work – literally anything that wasn’t a kitchen job or retail that I might be able to do without a related degree. Despite filling out dozens of online job applications, I didn’t get a single response to anything. Although this was madly frustrating at the time, I can look back on it now and be happy I didn’t settle for just any job.\n\nThey always say you should never burn any bridges, always maintain a good relationship with your employers and leave on good terms, and I’m glad I always did. My money was running out, and I had no job prospects, but I called one of my old companies up and they gave me a chef job right away. Although this was a full time, 60-hour-a-week job, I was determined to change careers eventually.\n\nI started going on Craigslist and looking for the cheapest logo design, graphic design, or web design work I could find. I had no portfolio and no experience, but I was persistent and eventually I found someone who would pay me to make some websites and do some odd jobs. I built a few one-page websites, for which I was paid $200/$300 dollars each. I also designed a logo, which made me $100, and did some little updates here and there for a small fee.\n\nI was doing this after work, between the hours of 9pm and 4am, before the next day’s 10 hour shift. In order to make a living and do something new, I had to sacrifice a lot of sleep and social activity. When I began all this, I had a very limited amount of outdated knowledge on HTML and CSS, and had simple Photoshop skills. During down time at work, I would browse Quora questions and answers about web development, and without even knowing it I was learning all about the industry.\n\nThe tipping point for me was meeting someone who had their own small business, and was willing to take on an unpaid intern. A guy who was at the time a weekend bartender at the restaurant I worked at, offered me the internship. I did something that was extremely difficult for me, and left my stable chef position to intern in the morning at his company and work a night job cooking at NAMCO’s Pac-Man themed restaurant.\n\nDuring that time, I learned about WordPress, Git, Sass, setting up local server environments, basic PHP and JavaScript, and using the command line – all things I had never experienced before. I began this blog during that time to document some of the things that I was learning. I continued applying to jobs online, still through Craigslist, and now I had a few websites and an internship to put on my resume. I applied for a junior web developer job, and after an interview, some personality tests, and a weekend coding test, I received my first job offer!\n\nFor my coding test, I had to make a responsive navigation from scratch. This was a huge challenge for me, because I was only vaguely aware of responsive design and had only ever used Bootstrap to create navigations. Instead of just creating one, I made three separate designs, going above and beyond what was expected of me and showing the company I was willing to learn quickly and put forth extra effort.\n\n### Summary\n\n**tl;dr**\n\n- I had a bit of an edge over somebody starting from scratch with web development, because I made websites for fun as a child.\n- I went to college for a career that wasn’t right for me, but I learned a lot about myself and life, as well as having a great appreciation for what I do now.\n- The hardest part of all was doing the necessary soul searching to try to figure out what would be the right career for me, both in natural aptitude and enjoyability.\n- While still working my original career, I found odd jobs through Craigslist in the web development industry to begin building up my resume and learning, while still making money.\n- I did a three month unpaid internship while working a night job when I became really serious about my career change.\n-  The biggest thing that helped me was creating my blog, a place where I documented all the things I learned.\n- I applied for jobs online while continuing to study, learn, and create, and eventually I was able to land a full-time junior web developer role.\n\nI would not necessarily recommend the way I learned to anyone else, and I’m sure a lot of self-taught developers would say the same.\n\nMy dream is to summarize everything I’ve learned into an effective web development course from scratch for beginners, so they don’t have to search through as many poor and outdated tutorials as I did. However, problem solving and putting yourself out there to build things will always be an essential part of becoming a web developer as well.\n\n**The biggest thing I can recommend is to create a blog to document everything you learn. If you can explain it, you can do it.**",
    "title": "Sharing my personal story about a my career change from chef to web developer",
    "subreddit": "cscareerquestions",
    "timestamp": 1499370195,
    "score": 83,
    "keyword": "man artist"
  },
  {
    "text": "I always hate it when a White person tries arguing that they have \"earned\" their award whenever a Black person brings up how unfair it is that our work is overlooked and not rewarded even when we've worked harder at something. I remember arguing a post about Eminem weeks ago with some fan about how  it doesn't seem right that White artists like Eminem win awards on BET when the network was created by and for Black people. Every time I mentioned some examples, and mentioned all the best Black rappers that we've listened to over the years, Tupac, Biggie, Common, Nas, any of them, these guys would argue that Eminem is better than all of them regardless or \"one of the best MCs\", and Tupac and Biggie are only heralded because they are dead. I beg to differ. There are plenty of dead rappers know of, but Tupac and Biggie are famous because their work spoke of real, relateable issues and are timeless. This guy argued that Eminem gets nominated and awarded at BET because he \"earned it\".\nLook, Eminem is a great rapper, sure, and yes, I know BET is not owned by a Black man anymore, hasn't been for years. But, I just hate the thought of people, especially White people thinking that they deserve to get noticed all the time for their merits over minorities because they \"earned it\". That's BS. I hate it when someone calls Eminem the \"King of Hip-Hop/Rap\" as if the Black artists that came before him aren't more deserving of that title. It's like how Elvis became known as the \"King of Rock n Roll\" when artists like Nat King Cole and Chuck Berry were doing rock n roll way before he did. Also Eminem is cool, I like him, but he's pretty overrated.\n\nAnd all they can say and do is try to dismiss the great Black rappers all the time, but praise the White ones as \"original\" and \"relateable\". Because they don't care; they just think that anything they do that mimics what other people have done for years automatically makes them the best at it or deserving of an award over other hard workers in that genre who know our issues and struggles more.",
    "title": "I always hate it when a White person tries arguing that they have \"earned\" their award whenever a Black person brings up how unfair it is that our work is overlooked and not rewarded even when we've worked harder at something.",
    "subreddit": "blackladies",
    "timestamp": 1511660782,
    "score": 92,
    "keyword": "man artist"
  },
  {
    "text": "Dealing with Microaggressions from Liberal, POC Friends. Hey everyone. First off, long time lurker, first time posting.\n\nI just got back from hanging out with some friends of mine and the entire ride home I just felt like I needed to vent to someone (or something) so I guess here it is.\n\nI am a speech and debate competitor, and for those unfamiliar, speech and debate is an incredibly liberal space. I feel like it's often on the forefront of liberal thought and artistic expression. The conversations that go on within speech and debate circles are often incredibly liberal and fight for marginalized groups, and I'd say a good 90% of speeches and performances out there are politically skewed. Example of this would be speeches about: BLM, LGBTQA+ issues, fighting for the rights of those who are not able-bodied, raising a light to lynchings that have been happening in 2016-17, etc etc.\n\nI was out with a group of friends from the speech community, and were trying to decide where to eat. I suggested Mexican food, but my friend wasn't trying to eat Mexican food tonight. All of a sudden, this friend, we'll call them \"K,\" said \"Fine, how about let's go eat at a Korean place then?\" And then K looked at me, followed by a silence in the group. Then K said \"Or a Japanese place. Or whatever.\" I hadn't seen K in a long time, so this was basically him trying to remember where I was from. Thankfully, another friend of mine said \"You can't just be coming for people like that,\" to which K responded with \"well no, don't get me wrong, I love rice.\" \n\nNow, K is an African man from Ghana, has been living here for years, and knows full well the brunt of racism. Not only that, but he fights on behalf of PoC and marginalized peoples in the speech and debate community. But here he is, openly disrespecting me and saying some pretty messed up stuff in front of all of us. \n\nI ended up brushing it off and didn't say anything. I think it was a mix of shock and my cultural instinct to preserve social harmony that kept me from going off on them for being so incredibly rude and racist. \n\nBut a huge part of it was also a part of me that still has not learned to call people out when they say something that's not okay. People have said things like this to me all of my life, and I was always told to lay low and not create a scene. But I'm absolutely tired of it. And I'm going to do my absolute best to call it out, no matter who is saying it. I can't only be capable of educating and telling off blatantly racist and ignorant people. I need to be able to have a conversation with even people who I perceive to be intelligent liberals, without a racist bone in their body. \n\nI felt that K wanted to apologize the rest of the night, but didn't know how to approach it. They took a breath to say something a couple of times, but didn't really end up saying anything. I hope that the next time I see them, I'll be able to have a conversation with them about it. Till then, I'm going to stay as strong as I can and understand that we all have learning to do.\n\nTL;DR: An African friend of mine said some borderline racist, microaggression-y stuff to me today. I didn't end up saying anything. I'm going to be better in the future.",
    "title": "Dealing with Microaggressions from Liberal, POC Friends.",
    "subreddit": "asianamerican",
    "timestamp": 1499848181,
    "score": 18,
    "keyword": "man artist"
  },
  {
    "text": "If you’re a man with a camera, you’re automatically branded a creep I used to work semi-professionally as a photographer.  What do I mean by that?  Essentially I was part time.  I had a great job as a software engineer that I liked and didn’t want to give up, but in my off hours I liked switching gears by earning extra dollars via photography.  I specialized in taking photos of the performing arts such as musical artists, plays, circuses, etc.  It was fun.  It was a very different challenge from writing code.  \n\nSo this 16 year-old girl found my web site and liked what I saw.  She needed some quality photos for her school’s yearbook and approached me to take them.  She asked me to take photos appropriate to the yearbook.  Not once did she ever request any nudity or anything else inappropriate.  She had an after school job and enough money to pay my rates.  Everything seemed completely legit.  Of course, I was well aware of the stereotypes that would brand me some kind of sick perv if I photographed a teenage girl.  I therefore turned to other photographers for advice on putting together a contract that would protect me legally.  She wanted a photos of her together with her horse.  There would be photos of her riding it, grooming it, and just standing beside it.  Nothing wrong with that, of course.  I still wanted a contract to protect me legally so that I would not end up falsely accused of any wrongdoing.  A protective instinct kicked in because I knew how hyper-negative people get toward men, especially a man with a camera.  \n\nI asked other photographers on a photography forum online if there were some kind of standard protective contract I could use.  Some photographers responded with good advice on where I could get such a thing.  Some also said I should require at least one parent present at the shoot.  Good advice.  However, others went berserk, accusing me of being some kind of perv out to rape that girl.  One asshole claimed that if it were his daughter he would immediately contact the police and the courts and get a restraining order against me.  He acted like I had proposed to make kiddie porn.  We’re talking about a photo shoot of a fully clothed girl in normal pictures with her horse – feeding it, riding it, normal stuff.  These were photos that were appropriate to a high school yearbook.  \n\nThese male-bashing bigots totally ignored my explanation of the content of the shoot and just assumed I would ask her to take her clothes off and do pervy things and that it would end with me raping her.  No amount of setting the record straight did any good.  It was unreal the hateful assumptions people made.  Some photographers came to my defense, appalled as I was at the overreaction.  Some correctly said that photographers photograph all ages.  Duh.  It totally depends on the content of the photos as to whether it’s appropriate.  It’s unreal how some people heard “fully clothed girl riding a horse” and translated that to “perv raping a teenager.”  \n\nI ended up doing the shoot, no thanks to the male-bashing bigots.  It went great.  I had a liability contract and I had her father present at the shoot.  Great guy, and great girl.  They were awesome people.  Neither of them made any of the absurd assumptions some idiots had made.  This was a case of a young woman who had earned her own money at a job and had chosen to spend it on some high quality photos.  Nothing more.  It’s unreal how some people will twist something like that into something sick.  \n\nOther photographers have told me about similar situations where they’re assumed to be some kind of perv because they have a camera with a telephoto lens.  If you’re a man and you take a high-end camera to a beach, you risk getting pestered and even arrested by police.  That’s a reason why I won’t even do beach photography.  Nowadays, I won’t even photograph someone who’s underage unless I know the people really well.  I was lucky at this shoot that they turned out to be terrific people, but if I had gotten the witch hunt idiots, it could have been dangerous for me.  I’m 100 percent certain if I were a woman, the whole overreaction and branding me as some kind of creep or perv would never have gone down.  “Girl with her horse” – he must be a sicko.  It’s unreal.",
    "title": "If you’re a man with a camera, you’re automatically branded a creep",
    "subreddit": "MensRights",
    "timestamp": 1487540346,
    "score": 66,
    "keyword": "man artist"
  },
  {
    "text": "Isn't it illegal to refuse service based on gender? (my experience with waxing salons) I'll try to keep this brief:\n\n  I'm an artist and have been subsidizing my income by working as an art model for a few years.  Because of this, I have to take extra steps to be fully groomed.  This involves waxing and shaving.  Because there are certain areas that one can not easily reach on ones body, I decided at one point that I would pay a professional to do certain things for me.\n\nI got turned down by about a dozen (no exaggeration;  It might have been more in fact) salons that refused to provide the service for men.  One woman actually said to me, \"No, we don't do Man-zilians (Brazilians for men).\"  I was basically given the boot by tons of places that said \"women only.\"  Turns out most of these salons don't like to serve men because they think we're all a bunch of perverts coming in for the wrong reasons.  It was near impossible, but I had to get it done.  I spent almost a week and a half looking for a place, and it was getting incredibly embarrassing for me (this was what discrimination actually feels like).  I finally found someone who would provide the service to me. \n\n*side note: She was nice, but what I found ironic was that while she was performing the waxing [we had a lengthy discussion about news], the topic of Rachel Dolezal came up and she said something about how women already have it much harder than men.  I didn't know how to react, given the circumstances*",
    "title": "Isn't it illegal to refuse service based on gender? (my experience with waxing salons)",
    "subreddit": "MensRights",
    "timestamp": 1484823258,
    "score": 59,
    "keyword": "man artist"
  },
  {
    "text": "Feminist Terrorist Attack Masterpost * [The Bolivian anarcha-feminist collective known as Mujeres Creando gained worldwide fame in 2001 when they \\(armed with dynamite and Molotov Cocktails\\) attacked The Bolivian Banking Supervisory Agency demanding that all debt owed by any woman in the country be removed. When riot police arrived feminist protesters fought against them by throwing Molotov cocktails at police cruisers.](https://en.wikipedia.org/wiki/Mujeres_Creando)\n\n* [In 1982 in Canada a feminist terrorist sect known as The “Wimmin’s Fire Brigade” firebombed a chain of pornographic video rental stores as part of a plan to intimate the Canadian government into changing the laws to outlaw pornography.](https://en.wikipedia.org/wiki/Squamish_Five#Red_Hot_Video_firebombing) \n\n* [The National Encounter of Women is a yearly feminist conference that occurs in South America where close to 20,000 feminists meet for workshops and think tank discussions. The conference is usually marked as well with widespread violence being committed by the feminists who attend. In 2007 the anti-catholic sentiment \\(due to the catholic church being against abortion\\) held by a large number of women there boiled over and the mob of feminists started targeting catholic feminist women at the convention going into to a workshop to physically and sexually assault many of them and force them out of the conference. After the feminists announced their plans to attack a local cathedral police sent riot police to protect the area and the feminist groups instead just attacked and looted several local businesses instead.](http://www.catholicnewsagency.com/news/catholic_women_in_argentina_target_of_attacks_at_national_encounter_of_women/)\n\n* [In 2013 Catholics in San Juan who knew the history of the The National Encounter of Women decided to go to the local cathedral and protect it from being attacked by feminists when the convention was being held their. The 1500 Catholics stood outside the cathedral hands locked in non violence to try and help protect it from the feminists who planned to storm and destroy the church. The 7000 \\(many topless\\) feminist protesters attacked the group of Catholics. Spraying cans of spray paint in their eyes, throwing glass bottles at them, attempting to molest at least several of the men guarding the cathedral along with them committing other practices of violence. Despite this the pacifist Catholics did not fight back even to protect themselves in self defense.](https://www.lifesitenews.com/news/horror-mob-of-topless-pro-abort-feminists-attacks-rosary-praying-men-defend)\n\n* [The Zapatista Army of National Liberation is a Pro-Feminist Paramilitary guerrilla rebel group which has been in a war with Mexico since 1994. The group is so focused on feminist ideas that the first declaration of demands the terrorist group sent to the Mexican government was a document entitled The Women’s Revolutionary Law which was a list of “rights” they demanded all women get, these rights included the right to having preferential health services when they go to clinics and the right to participate in the violent overthrow of the government.\n](https://en.wikipedia.org/wiki/Zapatista_Army_of_National_Liberation)\n\n* [Swedish politician Göran Hägglund despite being a strong supporter of women’s and gay rights was attacked by a member of an LGBT queer anarcho-feminist group due to him “discouraging LGBT rights\". It’s still unclear what exactly Hägglund has done to discourage those rights due to him staunchly supporting the gay community.](https://en.wikipedia.org/wiki/G%C3%B6ran_H%C3%A4gglund#cite_note-2)\n\n* [American Radical Feminist Jane Alpert was responsible over the course of five years for bombing 8 corporate and federal buildings. Whose ranks include Chase Manhattan, The Offices or General Motors and The New York City Police Headquarters. In Alpert’s surrender statement she claimed achieving work in the feminist movement was her major goal for committing these acts of terrorism. And in her Manifesto “Mother Right” she called for others to do the same in order to defeat the patriarchy.](https://en.wikipedia.org/wiki/Jane_Alpert)\n\n* [Feminists sent death threats to Erin Pizzey, the British woman who founded the world’s first Domestic Violence shelter. Because, she said women can be as cruel and violent as men, and then feminists ended up mutilating her pet dog to send a warning to her after she refuses to leave the country.\nBefore this incident Erin Pizzey had previously been involved with the British Women’s Liberation Movement but left the group after overhearing plans for them to commit a terrorist attack on the upscale London women’s fashion store, “Biba.” The group later was responsible for a protest of The Miss World competition where the group attempted to shut down the event by attacking the models with smoke bombs.](https://en.wikipedia.org/wiki/Erin_Pizzey#Overview)\n\n* [University of Delaware professor Suzanne Steinmetz published a study showing evidence that in cases of domestic violence women are just as likely to abuse their husbands as husbands would be to abuse their wives. Feminists responded to this by sending death threats to Steinmetz and her children threatening organizers of speaking engagements that invited her to speak and sending a bomb threat to shut down a speaking engagement she had, forcing her to lose her job.](http://www.ifeminists.net/introduction/editorials/2005/0525roberts.html)\n\n* [After Richard Gelles and Murray Straus of the American Sociological Association simply published a survey showing the rate of male domestic violence victims feminists started a campaign of harassment contacting and threatening anyone they could find even slightly related to either of two and calling in bomb threats to conference centers and buildings where they were scheduled to present.](http://breakingthescience.org/RichardGelles_MissingPersonsOfDV.php)\n\n* [In 2015 Feminist forced the Society of Professional Journalists \\(the oldest journalistic ethics association in the United States\\) annual conference to be evacuated after calling in bomb threats to the police as retaliation against the conference having a panel on Gamergate.](http://www.polygon.com/2015/8/16/9161311/bomb-threat-shuts-down-spj-panel-discussing-gamergate)\n\n* [During the August Revolution in Burkina Faso. The Burkinabe Women’s Liberation Movement along with other Marxist groups helped stage a coup to overthrow the French Colonial Government and then instated Marxist Rebel Thomas Sankara as the country’s new leader. Sankara on behalf of the Burkinabe feminists passed laws making female circumcision illegal along with the passing these women’s rights laws his administration was famous for ushering a new era of human rights abuses in which many of the political opponents of the The Burkinabe Women’s Liberation Movement were either arrested without cause, tortured or executed in illegal extrusions killings.](https://en.wikipedia.org/wiki/Thomas_Sankara_and_the_Burkinabe_Women%27s_Liberation_Movement#Women.E2.80.99s_Liberation_Movement)\n\n* [The Radical Eco-Feminist group Deep Green Resistance which was founded in 2011 and is currently active in 7 countries, The group was founded by a self described feminist warrior and preaches for lone wolf terrorists to attack every part of civilian, from bombing airports to open firing on farmers on country fairs even going as far as to call for rape and assassinations against figures who are opposed to them. The group’s goal is for the destruction of industrial civilization and the return of a matriarchal hunter gatherer lifestyle. Though to give feminists credit several magazines and feminist groups have condoned their actions, not because they preaching for genocide and indiscriminate killings but due to the fact that they do not allow trans women to go to their terrorist training camps.](https://en.wikipedia.org/wiki/Deep_Green_Resistance)\n\n* [A group known as The Women’s Brigade of Weather Underground, whose motto is literally,  \"Build a militant women’s movement that commits itself to the destruction of Amerikkkan imperialism and exploit the man’s chauvinism as a strategic weakness.“ was an ultra-extremist feminist terrorist sect whom was responsible for bombing the Center for International Affairs at Harvard University and The Offices of The Department of Health and Human Services in San Francisco as part of a celebration for National Woman’s Day.](https://en.wikipedia.org/wiki/Women%27s_Brigade_of_Weather_Underground)\n\n* [The violent Feminist power group M.E.K also known as People’s Mujahedin of Iran has been labeled as a terrorist organization by both the United Nations and NATO they are believed to be responsible for several terrorist attacks around Iran which has left dozens dead. The group was founded in 1965 with the stated goal of overthrowing the Iranian Shah but after the Shahs regime ending the group changed significantly going through a point in which they assassinated the President and Prime Minister of Iran in 1981. Eventually in 1985 radical feminist Maryam Rajavi took control of the group and ushered in another wave of terror attacks and shifted the focus of the group to being permanently about pushing feminist agendas, under her rule Rajivi ordered the assassination of several high level government officials in various countries and organized a bombing campaign targeting civilians.  In 2005, Human Rights Watch issued a report describing prison camps within run by the M.E.K in which people kidnapped by the terrorist group were held captive tortured and raped. Maryam Rajavi still leads the group today and has been praised by the international feminist community for her work on behalf of women being honored by both the Feminist Peace Network and globally recognized Feminist Professor Donna M. Hughes and even being invited to give a speech as the keynote speaker for the International Woman’s Day celebration in France. In 2015 M.E.K was also believed to be responsible for a string of murders targeting Iranian scientists and educators.](https://en.wikipedia.org/wiki/People%27s_Mujahedin_of_Iran)\n\n* [Cumann na mBan was an all female feminist paramilitary organisation, that during the Easter Rising sent 200 armed women across Dublin to help Irish-Nationalists seize major locations around the city. During the armed rebellion one of these women Constance Markievicz a British Suffragist famously took over a post office along with several other female fighters and used the building to set up a sniper nest where they carried out sniper attacks on British troops and succeeded in murdering at least 3 police officers and several more soldiers. Within 5 days the feminist group along with their allies in the IRA had succeeded in killing 132 British soldiers and local police officers along with killing at least 254 other civilians. Dozens of Irish rebel forces groups were part of the attack during the Easter Rising but historians agree Cumann na mBan was the most violent and influential of these groups with the women in it making up a fifth of the Irish rebels at the time.](https://en.wikipedia.org/wiki/Cumann_na_mBan)\n\n\n* [The Women’s Social and Political Union was one of the most famous and influential feminist groups in the history of the United Kingdom. Along with this they happened to be one of the most militant and violent committing almost nightly arson attacks on random churches, businesses and private homes regardless of the owners view on feminism. The group also attempted to burn down Chancellor David Lloyd George’s home, cut public telephone wires, sent letter bombs to various politicians and businesses, destroyed the Kew Garden greenhouses which held the world’s single largest collection of living plants and is now a United Nations World Heritage site. Tried to rush the house of commons. And attempted to assassinate British Prime Minister Herbert Henry Asquith. On top of this the majority of the violence perpetrated by the group wasn’t even at people who were against feminism.](https://en.wikipedia.org/wiki/Women%27s_Social_and_Political_Union) \n\n* [Rote Zora was a militant feminist group from Germany who used guerrilla warfare tactics to terrorize west Germany by bombing over 45 buildings from 1977 to 1995. The group targeted people, businesses and groups whom they thought exploited women such as sex shops, makeup companies and The Federal Constitutional Court of Germany.](https://en.wikipedia.org/wiki/Rote_Zora)\n\n* [Mary Richardson a Canadian feminist \\(who would later lead women’s section of the Nazi Sympathizer group known as The British Union of Fascists\\) entered the National Gallery in London and used a meat clever to slash The Rokeby Venus a 450 year old painting created by Diego Velázquez who is one of the most famous Spanish artists in history. She was quoted as giving the reason for her doing this as a protest of the government trying to prosecute the feminist terrorist Emmeline Pankhurst for her crimes against the public. Along with this famous attack Mary Richardson also committed numerous other acts of arson and vandalism along with bombing a railway station in the name of feminism.](https://en.wikipedia.org/wiki/Mary_Richardson)\n\n* [In 2015 in the city of Odessa a large group of Ukrainian citizens worried about the growing Totalitarian state of their country organized a protest against Fascism to show their opposition for the way their country was changing. In response to this protest a large group of Maidan Fascists and Neo-Nazis planned to meet the anti-protesters and silence them. Among these Neo-Nazis and openly Fascist supporting extremists was Femen leader Levgeniia Kraizman who took pictures of herself wearing a FEMEN tee shirt and marching with the Neo-Nazis as she posed in front of burning cars in which the Fascists had overturned to intimidate the protesters. After the anti-fascists refused to leave the Neo-Nazis and Fascists along with Kraizman and other feminists and Femen members invited to the pro-fascist Nazi rally began attacking the anti-fascist protesters. Police were unable to stop the violence. The Neo-Nazis and Fascist who were much better armed took no time to begin killing the anti-fascist protesters, open firing and beating as many to death as they could find along with burning alive anyone they could catch. Further clashes in Ukraine between the groups outside of this one incident in the later weeks left 48 dead, 247 injured \\(27 shot, 31 stabbed\\) and 99 hospitalized and 123 arrested.](https://www.indybay.org/newsitems/2014/05/19/18755970.php?show_comments=1)",
    "title": "Feminist Terrorist Attack Masterpost",
    "subreddit": "MensRights",
    "timestamp": 1489004208,
    "score": 12,
    "keyword": "man artist"
  },
  {
    "text": "Woman Excerpt from *All Things Considered* by G.K. Chesterton, Chapter 12:\n\n>\"Would not our women be spared the drudgery of cooking and all its attendant worries, leaving them free for higher culture?\" The first thing that occurs to me to say about this is very simple, and is, I imagine, a part of all our experience. If my correspondent can find any way of preventing women from worrying, he will indeed be a remarkable man. I think the matter is a much deeper one. First of all, my correspondent overlooks a distinction which is elementary in our human nature. Theoretically, I suppose, every one would like to be freed from worries. But nobody in the world would always like to be freed from worrying occupations. I should very much like (as far as my feelings at the moment go) to be free from the consuming nuisance of writing this article. But it does not follow that I should like to be free from the consuming nuisance of being a journalist. **Because we are worried about a thing, it does not follow that we are not interested in it. The truth is the other way. If we are not interested, why on earth should we be worried? Women are worried about housekeeping, but those that are most interested are the most worried.** Women are still more worried about their husbands and their children. And I suppose if we strangled the children and poleaxed the husbands it would leave women free for higher culture. That is, it would leave them free to begin to worry about that. For women would worry about higher culture as much as they worry about everything else.\n>\n>I believe this way of talking about women and their higher culture is almost entirely a growth of the classes which (unlike the journalistic class to which I belong) have always a reasonable amount of money. One odd thing I specially notice. Those who write like this seem entirely to forget the existence of the working and wage-earning classes. **They say eternally, like my correspondent, that the ordinary woman is always a drudge. And what, in the name of the Nine Gods, is the ordinary man? These people seem to think that the ordinary man is a Cabinet Minister. They are always talking about man going forth to wield power, to carve his own way, to stamp his individuality on the world, to command and to be obeyed. This may be true of a certain class. Dukes, perhaps, are not drudges; but, then, neither are Duchesses.** The Ladies and Gentlemen of the Smart Set are quite free for the higher culture, which consists chiefly of motoring and Bridge. But the ordinary man who typifies and constitutes the millions that make up our civilisation is no more free for the higher culture than his wife is.\n>\n>Indeed, he is not so free. **Of the two sexes the woman is in the more powerful position. For the average woman is at the head of something with which she can do as she likes; the average man has to obey orders and do nothing else.** He has to put one dull brick on another dull brick, and do nothing else; he has to add one dull figure to another dull figure, and do nothing else. The woman's world is a small one, perhaps, but she can alter it. **The woman can tell the tradesman with whom she deals some realistic things about himself. The clerk who does this to the manager generally gets the sack, or shall we say (to avoid the vulgarism), finds himself free for higher culture.** Above all, as I said in my previous article, the woman does work which is in some small degree creative and individual. She can put the flowers or the furniture in fancy arrangements of her own. I fear the bricklayer cannot put the bricks in fancy arrangements of his own, without disaster to himself and others. If the woman is only putting a patch into a carpet, she can choose the thing with regard to colour. I fear it would not do for the office boy dispatching a parcel to choose his stamps with a view to colour; to prefer the tender mauve of the sixpenny to the crude scarlet of the penny stamp. A woman cooking may not always cook artistically; still she can cook artistically. She can introduce a personal and imperceptible alteration into the composition of a soup. The clerk is not encouraged to introduce a personal and imperceptible alteration into the figures in a ledger.\n\n--------------------------------------------------\n\nNote that I have my disagreements with Chesterton (he was talking about me in *The Song of the Strange Ascetic*); he was fundamentally conservative while I am fundamentally liberal, but he was forthright about his views, held them honestly, and changed them when he felt it necessary.\n\nI would much rather be friends with someone like that with whom I disagree with than someone who agrees with me perfectly, but is dishonest, manipulative and closed-minded.\n\nYou don't have to agree with me, just don't try to bullshit me :)",
    "title": "Woman",
    "subreddit": "MensRights",
    "timestamp": 1512315306,
    "score": 4,
    "keyword": "man artist"
  },
  {
    "text": "Men denied a legacy. Is there a consequence? Young men are concerned with their future. Old men are concerned with their legacy... And unless you're an artist, inventor or captain of industry, for most men their legacy is their children.\n\nYoung men obey laws and live up to society's expectations mostly because they have hope for a future. Old men obey laws and live up to society's expectations because they hope to preserve their legacy, the family's honour, their *children's* future.\n\nBut what if old men have to face the knowledge that they shall have no legacy? No kids... Either because they got taken away or because they were afraid to have them in the first place, given a society rife with anti-father sentiment?\n\nWhat then?\n\nIf denied a legacy, then what do old men have to lose? An old man with no legacy sees no percieved downside to expressing his rage - perhaps violently... And with no consequence to an inexistant family, there's no consequence to himself (if his death is inevitable and imminent anyways). \n\nWe might want to consider this when we read about the Vegas shooting. \n\n**I am not apologizing for this asshole.** [But he was childless, and divorced in 1990](http://archive.is/B8agR). I'm simply trying to understand the conditions of his environment, so we as a society can hopefully reduce the likelihood of future violence from the growing demographic of men with nothing to lose.",
    "title": "Men denied a legacy. Is there a consequence?",
    "subreddit": "MensRights",
    "timestamp": 1507073461,
    "score": 4,
    "keyword": "man artist"
  },
  {
    "text": "The disposability of men: \"Long Black Veil\", the ultimate White Knight anthem **\"She stood in the crowd and shed not a tear\"**\n\nI'm a working musician and the band leader is going to do Long Black Veil so I need to learn it. It's covered by every male roots artist at some point in their career. [Johnny Cash](https://www.youtube.com/watch?v=5pYA46dyKh4), [Mick Jagger](https://www.youtube.com/watch?v=4F-4rY4g4Do), [The Black Crowes](https://www.youtube.com/watch?v=IvwlMoeqURk) ... you get the idea.\n\nIt's an homage to male disposability. The core idea: a woman's honor is worth dying for. Literally, a man's life is equal in value to a woman's reputation.\n\n**Lyrics**\n\n    Ten years ago, on a cold dark night\n    Someone was killed, 'neath the town hall light\n    There were few at the scene, but they all agreed\n    That the man who ran, looked a lot like me\n    \n    The judge said son, what is your alibi\n    If you were somewhere else, then you won't have to die\n    I spoke not a word, thou it meant my life\n    For I'd been in the arms of my best friend's wife\n    \n    She walks these hills in a long black veil\n    She visits my grave when the night winds wail\n    Nobody knows, nobody sees\n    Nobody knows but me\n    \n    Oh, the scaffold is high and eternity's near\n    She stood in the crowd and shed not a tear\n    But late at night, when the north wind blows\n    In a long black veil, she cries ov're my bones\n\n    She walks these hills in a long black veil\n    She visits my grave when the night winds wail\n    Nobody knows, nobody sees\n    Nobody knows but me\n\nhttps://en.wikipedia.org/wiki/Long_Black_Veil",
    "title": "The disposability of men: \"Long Black Veil\", the ultimate White Knight anthem",
    "subreddit": "MensRights",
    "timestamp": 1498856967,
    "score": 4,
    "keyword": "man artist"
  }
]