[
  {
    "text": "Quitting job management begging me to stay Hello I work as a cna for this “high end” nursing facility for 3 months. When I first started I already had weird vibes but thought maybe I just need to get use to it. Well I had enough. These residents are paying thousands of dollars each month to be treated like crap. My first day there I had an elderly man cry to me because he said since his stay there I been the only one who’s been nice to him. The nurses are lazy. Other aides are lazy and just rude to residents. Rounds aren’t being done ect...this is supposed to be a fancy high end place.  I put in my 2 weeks and management is begging me to stay even offered me a 3$ raise. You can keep offering me money but Im not going to stay. I just cant be around that kind of environment. So my question to you reddit they want to know why I’m leaving. Should I be truthfully honest and tell them they’re garbage?",
    "title": "Quitting job management begging me to stay",
    "subreddit": "jobs",
    "timestamp": 1550185116,
    "score": 5,
    "keyword": "man nurse"
  },
  {
    "text": "Incredibly frustrated with Job search. Let me start off my saying that I'm in a bad mood, angry frustrated, sad, depressed and many things. All of that is going to affect my post and my way of expressing myself. I apologize in advance if I come across as an asshole. \n\n\nFor last 7 days I've been applying online, using Indeed app and websites, to EVERYTHING that I can find that I'm qualified for. Apart from doing Hospital work as a student for 1 year, I have zero experience in the work force. \n\nI'm angry at the world. My mom and dad always tell me of the jobs they had when they were younger, and sometimes I feel resented. Not at them, but at life in general. They way they speak about their experiences sound so easy ... They honestly were lucky\n\n\nI can't find SHIT. Nobody fucking calls me, man. I have applied and applied and applied and applied and nothing. Not even Janitorial Services call me. I'm 24. I know I should've gotten a job sooner but I didn't. But I'm looking now. I'm finally taking medication for my stupid depression and my stupid useless anxiety. I wish I could go back and started working at 18. I had offers but never followed them because I have terrible social anxiety. I fucking hate that feeling. Social anxiety is the worst. I hate the way that I am. My first job interview I was so nervous, and at 24 I'm probably gonna bomb the interview again because I still have social anxiety\n\n\nBut fuck all of that. I just want to work. I'm tired of being home all day. Since graduating from college (a degree- nursing- that I don't want anymore) I've done NOTHING with my life. 2 years and I've done nothing. I feel so bad about it. Why can't employers give me a chance? I just feel like giving up honestly. I hate the economy and I hate people, especially the fake ones.\n\nMaybe it's in my head, but I hate the way people look at me. Idk if I'm schizophrenic but I swear people look at me with contempt. I feel inferior to everyone. \n\n\nI just want to get a steady job and move to the middle of nowhere and be left alone. I'm not compatible with anyone. I can't connect with anyone, only with some people online. All my friends have moved on. They have jobs, girlfriends, careers, I have nothing.\n\n\n\nSorry this turned into an Incompressible rant. Sorry if you read all of that.",
    "title": "Incredibly frustrated with Job search.",
    "subreddit": "jobs",
    "timestamp": 1560373485,
    "score": 0,
    "keyword": "man nurse"
  },
  {
    "text": "Albert Einstein's last words are unknown as they were spoken in German to an American nurse. What would you like to believe are this mans last words?",
    "title": "Albert Einstein's last words are unknown as they were spoken in German to an American nurse. What would you like to believe are this mans last words?",
    "subreddit": "AskReddit",
    "timestamp": 1546618245,
    "score": 8,
    "keyword": "man nurse"
  },
  {
    "text": "I was not able to afford an abortion. I gave birth to my first son while I was homeless, in an abandoned apartment. I should have never been a mother in the first place. Since I see others doing this I guess I will too. I’m not a political person really and normally I don’t really care about shit like this but lately I have been reading stuff and I figure if my story could raise awareness for why it’s important for women to have abortions then I’m okay with that.\n\nGrowing up I was in foster care. Before I turned 18, my foster mom let me know that I would have to move out as soon as I was legal age. I didn’t have a great relationship with them and really, I had no relationship with anybody. I had no friends and I had also dropped out of school because I was bored. That’s not exactly the recipe for success when you’re about to be out on your own. So I became homeless. It was better than staying at my foster home since sometimes they beat on me.\n\nI adapted well and honestly I didn’t mind living that way. I’d sleep anywhere or with anybody... I just had fun. Then I got pregnant. From a guy I met off here actually. He messaged me and we met up and started having sex. I liked him but it wasn’t serious. When I found out later, I was dumb enough to think that we would be a family. He’d have to take care of me right? I was carrying our baby that he had helped make. I was completely wrong. This nice, sweet guy who had messaged me online and who was a fun hook up, immediately turned into a jerk. One of the last things he said was, “I don’t care if both you and your kid starve to death.” When I asked if he’d help me pay for an abortion, he said I was a liar and a slut and that it wasn’t his kid and I was trying to use him for some cash. Once again, I had no one and nobody. I wanted an abortion but I didn’t have any money or support. I was homeless with no job. I felt like I had no options.\n\nI was too scared to go to a hospital because at the time I was convinced they would take my baby away. I grew up with social services so I knew how that worked. Looking back I was misinformed. But when I was 20 years old, I ended up going into labor behind a dumpster. I gave birth to him in an abandoned squatter apartment. I wrapped him in a towel I had found. That’s how my son was born.\n\nI was never meant to have a kid. I wasn’t prepared to have a baby. I slept with guys to get food because I had to eat to be able to nurse my son. When I couldn’t feed myself, I would just steal formula from the store. Some nights I would hook up with guys just to have a place to bring my kid that was warm. That’s the reality. I was not prepared to raise a child.\n\nI wasn’t prepared to get pregnant again either. But I did. I had another baby, my second son. After that, I realized that I couldn’t raise two kids on the street. I have a job now with a place to live. I can feed my kids but that still doesn’t make me a great parent. I’m not a good mom. But I do okay. And although both my kids don’t have a dad around, I don’t really think they notice (not yet at least lol). One thing I never could have done was give them up for adoption. I was in the system and I know what it did to me. I could never abandon my kids.\n\nBut I honestly wish I could have had an abortion. I had access to clinics but couldnt afford one. I had no information. I didn’t know what to do. The point is that if I had a rough time getting one, girls in other places like Alabama where it’s going to get banned are going to have it even worse. We are not all meant to have babies. We are not all meant to be mothers. Some think if you have the baby and keep it that it will come “naturally” to the woman and she will love her baby and oh yay! A life is saved. But when you think about an unborn baby you aren’t thinking about the woman who has to care for that baby. We all have to start thinking about that.\n\nUpdate: thank you for all the stories and comments. I am still reading. I wasn’t even going to post my story bc I honestly didn’t think anyone would care or believe me or would judge the fuck out of me. Some did and that’s ok but most of these comments were really sweet :) Thank you.\n\nEditing again: I find it very telling that most of the rude comments are from men, asking me why I didn’t keep my legs shut, why I didn’t use a condom, and why I’m a crappy mom. I keep checking the posting history and it’s always a man telling me these things. It’s also these same men that are messaging me and asking me for nudes or asking if they can teach me a lesson for being such a whore. Interesting.\n\nJust something to think about.",
    "title": "I was not able to afford an abortion. I gave birth to my first son while I was homeless, in an abandoned apartment. I should have never been a mother in the first place.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1558537336,
    "score": 13819,
    "keyword": "man nurse"
  },
  {
    "text": "I (F28) finally believe that my vagina is not dirty. I was molested as a child. The memories are bits and pieces of blacked out questions of what really happened, but it happened several times, and I'll never forget his face. Therapy and a lovingly supportive significant other, who makes me feel safe and sexy, have helped a lot. I have a normal and happy sex life. But even with this support I had long accepted that my insides are innately... dirty. That most likely my sex parts are diseased, rotting away ever since my childhood trauma. That I most likely will not be able to have children, even though I want to.\n\nI've held onto these beliefs so strongly that I avoided going to the gyno, to the extent that I've only been twice in my 28 years of life. Both experiences were awful. They were with women nurses and doctors who both happened to be in rushes. The pap smear was forceful and both ended up leaving me sore down there for days. They also brushed aside my concerns. I have short irregular periods where I get multiple clots every day I menstruate. My last exam was in 2016.\n\nWith the new turn of the year, I decided to face my fears. One of them being the gyno. So a few weeks ago I booked my appointment. As I was about to hang up, the receptionist told me the doctor's first name - Robert. A man. I paused. A strange man looking down there? Are you kidding me? No one other than my significant other has been down there... not since... that time. So I asked the receptionist to book me an appointment with a woman - but all the women were fully booked out for the next 3 months. I kept the appointment, and spoke to a few girlfriends on their experiences and was surprised to find out that some actually prefer male gynecologists - supposedly they're more gentile and professional. I figured well, let's do this, I want to face my fears then let's fucking do it. Let's try. And if I change my mind last minute then I'll call and cancel and set a new appointment. I kept the appointment with Dr. Robert.\n\nToday was the day. I went into the doctor's office and was greeted by the warmest receptionist. I was taken in back by a friendly technician who not only listened to my concerns, but she wrote them down and let me know the doctor would most likely be interested in doing a bit more testing. Handed me the gown and let me change. By the time I changed, I felt much more at ease with my decision.\n\nThe doctor came in, and to my surprise my friend was right - very professional, no rushing, he took his time and listened. When I told him about my irregular short periods and clots, he offered to do a vaginal ultrasound to make sure there were no growths. The ultrasound... was normal. Everything inside looked perfect. Nothing was irregular shaped, there were no dark splotches all over my uterus like I had imagined, it was perfectly shaped. And my ovaries! I got to see them in the process of actively making eggs. I'm making eggs. I'm normal, healthy, and most likely fertile.\n\nI'm normal inside.\n\nI went home smiling, and then sobbing. For the first time in 28 years... I know that I'm not dirty inside.\n\nWhat happened to me as a child was awful, but it in no way defines me. I can finally know that it has not broken me inside the way I thought it had.\n\n&#x200B;\n\nTLDR: molested, thought I was dirty inside and couldn't possibly have healthy sex organs. Doctor did an internal vaginal ultrasound and showed me that it all looks healthy and normal. My insides are good to go. Then I ugly cried in the car, out of joy.\n\n&#x200B;\n\n\\~edit\\~\n\nJust wanted to say I'm overwhelmed by the amount of encouragement and support I'm receiving from both men and women here. Ugh. I can't. Hope you all get your parts checked by doctors who respectfully listen to your concerns, and that you have happy sex.\n\nAlso wanted to add that I in actuality am not actively making eggs - they're already there as pointed out by u/kelserah hahah. Many thanks for the correction. I'm now just a little bit less proud of my ovaries.\n\n&#x200B;\n\n\\~\\~edit 2\\~\\~\n\nI received some gold for my perfectly normal vag and ovaries, in honor of the incredible people who treated me like a human-being.\n\nMy lady bits are worth gold. haha - thanks [/u/thatpaulbloke](https://www.reddit.com/u/thatpaulbloke) :) I think your bits are worth gold too.\n\n&#x200B;\n\nAlso... I'm really proud of the people who have read this, the people who have opened up... the people who have encouraged me and the people who are encouraged by this. I didn't realize how... not alone... I was in experiencing this.",
    "title": "I (F28) finally believe that my vagina is not dirty.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1548968255,
    "score": 994,
    "keyword": "man nurse"
  },
  {
    "text": "The Isle of Man becomes the first place in the British Isles to decriminalise abortion 🙌🏼 The Isle of Man finally has legalised abortion.  When the U.K. made abortion available in 1967, the Isle of Man didn’t follow suit; we are a crown dependency with our own government and set our own laws.  \n\nThis meant local women had no access to abortion, except under very restricted circumstances - only in cases of rape or incest, but requiring a sworn affidavits and sign off from a consultant, which is almost impossible to obtain before 12 weeks due to waiting lists; or in cases of fatal foetal anomalies. \n\nThis meant Manx women wishing to have an abortion have had to travel across to mainland Britain and pay privately. The ferry crossing to England is a four hour boat journey each way, in often very rough seas, finding money for a very expensive flight in short notice, both options usually requiring an overnight stay in a hotel. In practice, it’s meant finding at least £1,000, and more if you want to bring someone for moral support. It meant sitting around for hours, bleeding and in pain. It meant talking days off work. It meant women risking prosecution by buying illegal abortion medication online, which could be confiscated by the post office, could potentially be fake and/or dangerous substitutes, or be scammed out of the money. It meant women in vulnerable situations, or without money to pay for it just couldn’t have abortions they needed. \n\nWith this legislation, Isle of Man has leapt ahead of England, Scotland and Wales (Northern Ireland still has no access sadly). Women will be able to request an abortion up to 14 weeks without having to give a reason.  No need to see  see two doctors as in the U.K., no need to have them say it’s for mental health reasons.  It will be free, and local. Nurses, midwives and pharmacists will be able to dispense abortion medication, for women to take in their own homes.  We have also legislated for buffer zones, to ensure women’s safety. The legislation even includes wording to cover transgender and non-binary pregnant people, so they don’t have to misgender themselves to access the services. \n\nSometimes the Isle of Man has lagged shamefully behind the times, and in other ways we have often led the way in social change. We were the first country in the world to give women the vote in 1881. In 2006 we reduced the voting age to 16. We legalised opposite sex civil partnership in 2016 at the same time we legalised same sec marriage. \n\nNow, finally, women can have a choice over their own bodies, without having to endure a lengthy and expensive journey,  I’ve never been more proud of my little country ❤️\n\n[telegraph article ](https://www.telegraph.co.uk/women/politics/isle-man-becomes-first-place-british-isles-decriminalise-abortion/)\n\n\n(*edited for typos)",
    "title": "The Isle of Man becomes the first place in the British Isles to decriminalise abortion 🙌🏼",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1547665627,
    "score": 614,
    "keyword": "man nurse"
  },
  {
    "text": "OB/GYN jokes + a first year med student = one hell of a pap smear So this happened about a month ago during an appointment to qualify me for a medical study. This required general questions about my health, and a pap smear... tldr at the bottom\n\nI was leaned back on the table, about to get my pap, legs spread, in the stirrups, y'know the deal. There are 3 other people in the room: the doctor (a very small, older, sweet, Asian man), his med student (young, probably 23ish IF that old Indian girl), and the research nurse (white, late 20s, and I kind of knew her from my very small college; different major so we saw each other in passing but never in classes). The doctor was looking for a smaller speculum and was explaining to his student the difference. He holds up the larger speculum and said \"we would only use a speculum this large on a vagina this small if we dont want her to come back.\" and laughs hysterically for about 15 seconds. Awkward laughter from all parties... it was a good joke but my lady bits are starting to feel the chill of the air and I came in for a pap, not a comedy show. \n\nThen he does the pap, explaining what he was doing the whole time for his med student. He then asked me if I would mind if his student did a digital exam on me so she can get some practice. I said sure before realizing that a digital exam=when they stick their DIGITS AS IN FINGERS in ya and feel your uterus. I still didn't mind but wasn't considering the awkwardness of this when I said yes. \n\nThis poor girl was SO nervous. She managed to stammer out that this would be her first time and she asked him to walk her through it. So he performed the exam first, then she did. While she is doing the exam she's poking around, trying to feel the uterus and y'know when you're trying to listen closely to something or you're trying to grab something that fell between the couch and the wall and you kinda blankly stare in front of you? So she had that look on her face but staring into my eyes. The doctor meanwhile is asking her and I if we feel it and what she thinks the positioning of my uterus is, and some other medical jargon but she just continues staring into my soul. I didn't know if I should break the gaze or if it would make her realize that she was eye fucking me and finger blasting me at the same time, so I just kept awkwardly staring at her. \n\nAfterwards she was really grateful and thanked me a lot and apologized for taking so long. I'm pretty sure I was the first vagina she ever entered. \n\nTL;DR: had a pap where the doctor made speculum jokes and the med student finger fucked me for 7 minutes trying to find my uterus while locking eyes with me.\n\nEdit: these comments are giving me life, please keep telling me all of your awkward pap stories!!\n\nEdit edit: THANK YOU SO MUCH KIND STRANGER FOR THE SILVER!! I'm so glad you all have enjoyed my story!!",
    "title": "OB/GYN jokes + a first year med student = one hell of a pap smear",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1549332544,
    "score": 516,
    "keyword": "man nurse"
  },
  {
    "text": "[TRIGGER WARNING] I just had a medical abortion I just had a medical abortion. (Written on mobile, apologies for any formatting.)\n\nThe night my fiance (35M) and I (33F) got engaged, we got a little drunk and had very romantic unprotected sex. We were on holiday in another country and I didn't use the morning after pill. Fast forward a couple of weeks and I'm late for my period. Supermarket wee test confirms the obvious. \n\nI never thought I wanted to be a mum, so I kind of always assumed at some point I would require an abortion. I know that sounds crass, and I've always been careful, but I also always thought that there are enough unloved children in the world, I don't need to contribute to that by having a baby at a time I couldn't care for it. I've always struggled with depression, and post-partum depression genuinely terrifies me. If I become a mother, I want to give my baby (and myself) the best chance possible for a healthy happy life.\n\nFiance and I have talked about kids and together came to the slow realization that yes, we actually would love to be parents together. But on our terms. I'm 33, I still have a few years left to get my shit together and get pregnant for real, right? When I told him I was pregnant, he froze. I told him I didn't want it and he breathed a huge sigh of relief and held me and said it was my choice and he would support me either way, but that he was glad I had come to that decision easily. He said, \"at least we know we're fertile!\" I love him so much.\n\nBy this point, my boobs were getting sore, too sore even for hugs, and getting really noticeably big. I booked myself in at a clinic and opted for a medical termination. I didn't know much about the process, except that I wanted to do this privately, in my own home. Between making the appointment and the day itself, the morning sickness started. I was feeling faint and dizzy every morning and discretely puked at work a couple of times. \n\nI'm lucky enough to live in a country where abortion is not deeply frowned upon and services are easily accessible. The women at the clinic were amazing. I asked one nurse if it would be safe for me to smoke marijuana to help with my symptoms and she said - and I quote - \"look, weed can help with nausea, stress, cramping and pain relief, so it's probably the best thing for you. Better than booze certainly! Smoke up!\" What a legend.\n\nI took the mifepristone Saturday and tucked misoprostol in my cheeks on Sunday. \n\nAbout an hour after swallowing the misoprostol the cramps began. I have never been in so much pain in my life. Wave after wave intense pain. It felt like my uterus was trying to twist out of my body. Everything from my naval to my asshole was in agony. In trying to do uterine massage, I could literally feel the precise shape of my uterus with every spasm. I couldn't tell if I needed to shit or vomit or give birth to a thousand demons. Vomit I did, including the pain and anti-spasm medication I was trying desperately to hold down. \n\nMy fiance was amazing. He was there the whole time, reminding me to breathe, re-warming my heat pack, placing cool cloths on my face and neck, rearranging the bathroom so I could sit and puke at the same time, and bringing in furniture so I could lean on something and prop my feet up while sitting on the toilet. He put on meditation music and held me between the waves of pain, and gave me space while I was thrashing around in agony. Going through all of that alone would have been hell. I am such a lucky woman to have such a beautiful man in my life.\n\nAfter what felt like hours (but was really around 90 minutes), I was in my established toilet position when the spasm to end all spasms rocked me. I felt an incredibly sharp pain in my cervix, followed by a tingling rush through my whole body and an enormous sense of release. The pain abated immediately. Honestly, it was almost like an orgasm. Like a negative orgasm. A negasm. Fiance was by the door and said colour dramatically washed through me and I was suddenly able to focus my eyes on him, something I hadn't done since the pain started.\n\nA clot the size of a ping-pong ball slid out of my vagina and plopped into the toilet. I had passed my baby. It would have been due in May.\n\nExcept that it was never really a baby to me. Not like my 5y/o niece or 3y/o nephew, or the baby boy my sister is carrying (due in November), or like my fiance's 6m/o nephew, or any of the cousins I watched grow from infancy to childhood to adolescence to young adulthood. It was never a baby with a name and little fingernails and eyelashes and potential and a future. It was a pea-sized cluster of cells, a parasite - an unintentional invasion of my body that would have destroyed life as I know it if I hadn't put myself through this past weekend's pain. My family doesn't know, nor do my friends. This was something I felt I had to deal with alone, with just my fiance. It concerns me first, him second and nobody else third. I have no regrets about my decision to terminate, except that I would never do it medically again. Hopefully I never have to. Hopefully I do fall pregnant again, but at a time when I'm mentally and physically strong and healthy, when we're settled and I'm ready to be the best mamma ever.\n\nBut I had to talk about it with somebody. So thank you, ladies of reddit, for reading my long ass story. I'm still bleeding (and will be for the next couple of weeks), still passing small clots, still a bit tender and nauseous, but nothing like yesterday. Anybody going through a similar thing, please feel free to DM me. I feel better, and if I can help you feel better too, I'm happy to do so.",
    "title": "[TRIGGER WARNING] I just had a medical abortion",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1570414155,
    "score": 467,
    "keyword": "man nurse"
  },
  {
    "text": "I ugly cried in the middle of sex because I was so happy I got an IUD placed on Tuesday. It was the worst experience of my life. As I learned from my doctor during the procedure, my uterus is at an unusual angle which made the insertion more difficult. Like, it took half an hour and he kept asking his nurse for a bigger dilator and complaining that the catheter was too flexible difficult. I'm visibly shaking and sweating and hyperventilating and crying out from the pain and he just compliments me on being brave and patient and saying I \"wouldn't be allowing it\" if I hadn't taken the over the counter ibuprofen. I wasn't capable of asking for it in the moment but he also didn't offer any further pain management and I am so upset about how it all went.\n\nThe whole ordeal left me anxious about my body. Would the extraction be equally painful? What does a tilted uterus mean for the rest of my health? Would I be able to have a normal sex life again? My fiance had gotten sick the day before my procedure so I ended up going by myself, even though he planned to go with for support. I was afraid to explain my experience to him because I knew it would upset him to hear about it so I put it off until Saturday. At that point we both wanted to have sex again but I'd already had a few small panic attacks just imagining what it would be like. \n\nHe was amazing about the whole thing. He was of course upset to hear about how I was hurt but he comforted me and assured me that everything will be ok and we could put off sex as long as I needed. I decided I didn't want to keep myself from trying to feel like normal any more, so we decided to go for it Sunday, when we had all day free from chores/obligations. He offered to make me a stiff drink to help me relax and I accepted. He gently got me going with all the foreplay he knows I like and kept pausing to make sure I wasn't in any pain. When we finally got into our normal rhythm, I just couldn't hold back the tears of relief. Almost a week of tension and worry was just gone from me and my brain finally accepted that my body was ok. He held me close and let me release all the pent-up feelings in the form of tears and snot all over my face and his chest. He's the most amazing man in the world and I'm so happy that he's mine. I hope everyone can find the kind of love and support that I have in him.",
    "title": "I ugly cried in the middle of sex because I was so happy",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1551090414,
    "score": 457,
    "keyword": "man nurse"
  },
  {
    "text": "Dear Outpatient Physicians: Can You Please Stop Frightening Your Patients with Asymptomatic Hypertension? I need to speak out to the community in order to get something off my chest.\n\nI've seen too many patients sent to the ED for treatment of their asymptomatic hypertension.  I don't mind seeing your patients on an urgent basis, assuming that you are truly concerned that may have an emergency condition or if you believe they need inpatient treatment.  However, I don't like it when you force patients to come to the ED with scare tactics.\n\nRecently, I've been presented with many patients sent to the ED simply for an elevated blood pressure reading in the absence of any worrisome symptoms or signs.  To make matters worse, these patients have been told a variety of alarmist proclamations, such as: \"you're going to have a stroke,\" \"that's heart attack level blood pressure,\" or \"you're going to have an aneurysm.\"  One such patient was actually told that she was having a stroke, based on her blood pressure reading alone in the absence of any focal neurological deficit.  One such patient was actually \"stroke alerted\" by my triage nurse (despite not having any true neurological complaints), which caused a tremendous waste of time and resources, not to mention the potential for harm to the patient.\n\nNaturally, these patients are terrified.  They trust their outpatient physician and are skeptical when I tell them that hypertension is just a number.  It takes a lot of time and effort to talk these patients down and help them recognize the actual importance of long term control of their blood pressure.  Many are slow to understand the idea that a rapid drop in their blood pressure is more likely to cause an actual stroke and that a high blood pressure alone is not going to cause a stroke in the short term.\n\nIf you are actually concerned that your patient is suffering from a \"hypertensive emergency\", please send them directly to the ED.  (There is no such entity as \"hypertensive urgency.\")  That's why we exist.  However, please don't use the ED as an \"easy button\" to avoid actual assessment of your patient or to avoid a conversation with your patient.  It's easy enough to find out if the patient is suffering from any symptoms that might be attributable to a hypertensive emergency; if they are not, and there are no focal neurological deficits, then it is safe for you to refer that patient to their primary care physician for sane and rational treatment of their essential hypertension.  If you are a primary care physician yourself, it's pretty simple to ascertain whether or not it is safe to manage that patient's hypertension in clinic with a few minutes of interview on the phone.  Hypertensive emergencies are not subtle; their manifestations are dramatic.\n\nIf you are in doubt, feel free to send these patients to the ED for evaluation.  However, please do not dramatize the risks.  No one is going to have a stroke because they delayed treatment of their hypertension by a few days, weeks, or months.  No one will have a heart attack if they delay starting HCTZ by a fortnight.  Your patient is not going to have a brain aneurysm in the next hour, even if their systolic is 200.  (Coincidentally, most of the asymptomatic hypertension patients I see are sent to the ED because their systolic is greater than 200 or their diastolic is greater than 100; funny how 190 seems so much less threatening than 202.)  When you terrify your patient, you make my job much harder because I have to talk them back down from the cliff while also trying to encourage them into taking their chronic asymptomatic hypertension seriously.\n\nIn case you're thinking it--no, a headache is not a sign of \"end-organ damage.\"  A headache with focal neurological deficits or decreased level of consciousness may be, but a simple tension or migraine headache is not.  Please dig a little deeper in the history before you tell a patient that they are going to die from their headache and that they need immediate emergency department care.  \n\nPatients ought to be sent to the ED based on their symptoms, not isolated numbers.  Someone with a BP of 88/40 who is afebrile, alert, oriented, and well appearing is probably not in shock but rather has a small upper arm.  An otherwise asymptomatic and healthy adult with cold fingers and an SpO2 of 88% is probably not dying.  An athlete with a resting pulse of 40 BPM is not in symptomatic bradycardia.  The otherwise healthy young man with a partial RBBB observed on his ECG is not in heart failure.  The patient who was incidentally found to have a 13K WBC on routine labs is not in sepsis.  The guy with an oral temperature of 94.4F that was obtained after drinking cold water does not have hypothermia.  In each case, we keep the clinical scenario in mind when interpreting the data.  Blood pressure is no different.\n\nI understand when a patient themselves freaks out at a high blood pressure reading or when a \"nurse line\" instructs a patient to come to the ED for their asymptomatic hypertension.  In those cases, no one who knows better is present to weigh the evidence and offer medical advice.  However, when I see a patient referred by an actual physician for asymptomatic hypertension, it disheartens me.  As doctors, regardless of our specialty, we should know better and we should take the time to actually assess our patients.  This is something that everyone who went to medical school ought to know, regardless of your specialty.  You don't need to keep up to date on the latest in blood pressure management or other primary care topics, but you ought to understand the difference between a true \"hypertensive emergency\" and asymptomatic hypertension.  \n\nIn conclusion, please take the time to actually assess your patients and be honest with them.  A few minutes of additional history, even over the phone, can save countless hours of a patient's otherwise wasted time, the efforts of emergency department staff, thousands of wasted dollars in resources, and, most importantly, your patient's mental anguish.  If you just want me to start your patient on HCTZ for their essential hypertension because your clinic is booked out three months in advance, go ahead and send them to me, but please don't terrify your patient with the idea that they are going to stroke out unless they are treated immediately.  (I want to add that the worst offenders are not primary care doctors, but rather specialists and proceduralists who don't know what to do with hypertensive patients.) \n Don't do this for me or my nurses--do it for the sake of your patients and their trust in you (you're going to look silly after they learn from me that their brain isn't going to explode due to their asymptomatic hypertension, regardless of the number).  \n\nThank you for humoring my long winded rant.\n\n(As an aside, I hate the term \"hypertensive emergency\" just as much as \"hypertensive urgency.\"  It makes it seem like the blood pressure is the primary problem, when it is not.  \"Hypertensive emergency\" just means a medical condition in which blood pressure management is an important consideration.  You cannot have an \"hypertensive emergency\" without the underlying emergency condition, such as an aortic dissection, aneurysmal SAH, acute heart failure, renal failure, eclampsia, brain herniation, or stroke.  The disease that gets closest to an actual \"hypertensive emergency\" is malignant hypertension, which is a rare presentation seemingly driven by the elevation in blood pressure.  In all others, the hypertension is driven by the underlying pathology.)",
    "title": "Dear Outpatient Physicians: Can You Please Stop Frightening Your Patients with Asymptomatic Hypertension?",
    "subreddit": "medicine",
    "timestamp": 1549381397,
    "score": 544,
    "keyword": "man nurse"
  },
  {
    "text": "Second Surfer’s Myelopathy case? Strange to me as a nurse case manager to have a second diagnosed “surfer’s myelopathy” case to manage in rehab. First one very typical young man visiting Hawaii and a surfing class, but this guy is obese and fell asleep on his stomach in bed? Same spine hyperextension, but very different case. Are you seeing this diagnosis more extensively used? Functionally, from a rehab perspective, we treat him as a SCI, of course. Can’t reveal much more without running into HIPAA, give the rarity of his dx.",
    "title": "Second Surfer’s Myelopathy case?",
    "subreddit": "medicine",
    "timestamp": 1557285406,
    "score": 12,
    "keyword": "man nurse"
  },
  {
    "text": "3 codes, an infant death, and a psych pt I’m a chaplain at a large lvl 1 trauma hospital. My shift last night was crazy. \n\nFrom three separate unsuccessful codes, where I had to sit with wives and husbands and kids who had lost so much. To the death of an infant, who we baptized and stayed with the parents, to the psych patient I spent a lot of time with. \n\nI saw nurses and doctors do literally everything they could. They gave of themselves for the sake of others. \n\nI know it can be a hard job. I know it can be terribly sad, and confusing. You see so many “bad” people get all the luck. And so many “good” people get none. \n\nIf you haven’t heard it today, thank you. I made a point to buy snacks and spend time with my nurses and med staff last night. Because they deal with some shit.\n\nAnd you do too.\n\nSo thanks. From someone who is trying to understand your world. As I was standing in blood, as the nurse beside me was doing chest compressions and I was holding the hand of a man passing from this world.\n\nFrom someone who cried with an L/D nurse as her pt was grieving the loss of her child. And walked with her back into that room of silence. Where no words can penetrate the loss.\n\nFrom someone who stood with you as the psych pt tried to escape the room, threatening to cut our heads off. (Which, was funny in retrospect because He was tiny)\n\nThank you. You do so much for people. The big things, and the small things. Like a smile, or a joke, or grabbing another pillow. You meet people in the darkest moments of their lives. And that’s not an easy job. So give yourself some grace.\n\nYou’re going to make mistakes. The success of a shift isn’t always “was I perfect”, but “Did I learn?” And can I be better next shift?\n\nDon’t let the weight of one mistake out weight the 300 good things you did.\n\nYou are a gift to the people who see you. Get some rest, cry if you need, talk to someone. And I’ll see you for tomorrow’s shift.\n\n- A humbled chaplain.",
    "title": "3 codes, an infant death, and a psych pt",
    "subreddit": "nursing",
    "timestamp": 1552347374,
    "score": 1255,
    "keyword": "man nurse"
  },
  {
    "text": "I patient died and I need to talk about it. Today my patient died. \n\nI came onto the floor and night shift was frantic. Phones ringing, call lights alarming, papers all over the place. Not a good sign. I get report for three patients from one nurse, then find another nurse for the other 2 reports. Let’s call her Jen.\n\nJen gave me report on one patient- he’s fine, stable, peacefully asleep. But the second patient... this poor man. Jen gives me report on Jerry (fake names of course), informing me that he has come in on hospice and is suffering from a severe cancer diagnosis. My eyes flicker over to Jerry in the bed, he is tachypneic and pale, his eyes rolling in the back of his head as he moaned in pain. Jen tells me that he’s only been here for about an hour and a half. No family is here yet. No admit can be done as he is unable to communicate. He is alone and suffering. \n\nJen proceeds to inform me that although the doctor has seen him and it is clear that Jerry is on comfort care, no orders are in the computer. No pain meds, no palliative consult, and no code status. With an undetermined code status, the patient will be treated as a full code and will be resuscitated if he arrests. Jen shrugs, tells me good luck, and leaves for the day. \n\nThe first thing I do is call the doctor. He answers after a few rings and manages to groan out, “This is doctor Smith.” Clearly I have interrupted his sleep. “Hi Dr. Smith,” I say politely. “It’s aaaaasowenyaaa from med-surg. I have your patient in room nine that was admitted from the ER this morning, and we don’t have a code status on him. Can you please put in that order along with the comfort care procedures as well?”  The doctor sighs loudly and says, “Why can’t you just put it in yourself? He is a DNR.” I take a deep breath. This is a doctor that won’t do anything for himself if he doesn’t have to. I close my eyes and say, “Look, only doctors are qualified to put in a code status so I really need you to do that. I can do the comfort care if you really need -“ but Dr. Smith interrupts me and says, “I’m busy right now I’ll do it later.” Now I’m upset. This is not the first time I’ve had to confront him like this. “Dr. Smith, if this patient dies and you wait to put in that order then I am required to do CPR. I have to do CPR on a frail old man who is about the take his last breath, whose body is riddled by cancer. Please. Put in the order.” He finally agrees. \n\nSo I sit and click refresh on my computer a hundred times waiting for that DNR to pop up, but it doesn’t. At this point my patient is getting worse, he is breathing less and just looks like he’s in agony. I tell my supervisor and she immediately calls Dr. Smith. Another 10 minutes passes. Finally! The order pops up.\n\nI draw up 4mg of morphine (that’s all I can give so far) and practically run into the room. Now I feel it’s safe to give this narcotic without fear of my patient dying. But he is still. Alive, but still. A woman sits at his bedside now, her eyes red and puffy. “What the hell is happening to my husband?” she manages to choke out. I get a lump in my throat but swallow it down. “You must be Sara. I am so sorry to meet you under these circumstances.” She scoffs as a flood of tears roll down her face. “Let me explain what’s going on,” I begin, but she interrupts me. “He shouldn’t be in this much pain! How could you let this happen? I want to speak to the director of the hospital. I’ve worked in hospice for years and I know he should never be in this much pain. He was fine yesterday! What’s going on?” I take another deep breath. At this point it’s only 8:30, I’ve been on shift for a hour and already I feel the yearn to run home, to leave this place. But I stay. I explain that without the DNR order, if I pushed IV morphine and Jerry’s respiration’s stopped, that I would have to resuscitate him. She relaxes a bit, shakes her head but agrees that Jerry would not have wanted that. I tell her I am so sorry, that I will do everything I can now to make him comfortable, that I am so incredibly sorry for the delay in pain meds. \n\nI step out of the room after settling Jerry and stare at the wall. My heart aches for Sara. This is not the first spouse she has lost and I did not make it any easier for her. Why can’t doctors just put in their fucking orders?\n\nI take some time to round on two of my patients before the call light goes off in room nine. I knock quietly and enter, and immediately I know. Jerry is gone. Sara glances at him then back at me, her eyes desperate for hope, for a little more time. I step out and grab another nurse to assess with me. We both listen for one minute, but there is nothing. No vital signs, no heartbeat. He is gone. I force my eyes to meet Sara’s. Shake my head and say, “I’m sorry. He’s dead.” \n\nThe lump rises back into my throat as his wife gently kisses his head. “You are my best friend,” she whispers. She cradles his head softly and begins to sob, begging him to come back. I stay for a minute with my hand on her shoulder, but its clear she just wants to be alone with her husband. I politely show myself out and tell her that I will call the chaplain and that if she needs anything to just ask. I walk into the bathroom and lose it.\n\nThat patient died a prolonged and painful death. He suffered when he shouldn’t have. His care was delayed because a doctor was too lazy to do his fucking job and put in a simple yet critical order. His last moments with his wife were in agony and that could have been prevented. I work in med-surg, I don’t see comfort care  often, but I know enough to say that Jerry died an unjust death. \n\nThe lump in my throat still won’t go away.\n\nEdit: wow, thank you all so so much for the support and encouragement. i’m trying to keep up with replying but there’s so many of you! i was not expecting all the love. thank you reddit.\n\nEdit 2: the title was supposed to be “my patient died”, guess i was still frazzled when writing it",
    "title": "I patient died and I need to talk about it.",
    "subreddit": "nursing",
    "timestamp": 1556064282,
    "score": 1128,
    "keyword": "man nurse"
  },
  {
    "text": "Trans Patient Tips from a trans nurse: I've seen some uncertainty in the nurses around me on the floor when it comes to day-to-day management of trans patients. Figured I'd throw my two cents into the ring, since I'm trans and all:\n\n\\-Use the preferred pronouns, or gender-neutral language. Misgendering(using the wrong pronouns) does not lend itself to a therapeutic relationship. If you are unsure, ask what their pronouns are.\n\n\\-Hormone use and surgeries belong in the medical history. If you have questions about individual patient anatomy, refer to this. If you don't see anything there, you are allowed to ask the patient if they've had any surgeries related to their trans status/if they are taking hormone replacement therapy. This is not offensive. What can be offensive is asking what they \"have.\" Avoid being vague; be matter of fact about what you need to know.\n\n\\-(Also, ask the patient directly about their medical history. Don't wait until a visitor is alone and then ask them, that happened to me and it sucked.)\n\n\\-Your coworkers probably don't need to know if they're trans. Use your best judgement on this, but trans status should only be disclosed to members of the healthcare team if at all possible. It should be mentioned in report, and your charge nurse should know.\n\n\\-If you need to talk about reproductive organs, use their anatomical names and be matter of fact about it.\n\n\\-A trans woman is going male to female, or MtF. A trans man is going female to male, or FtM. A nonbinary person can be coming from either place, and generally considers themselves \"neither,\" though your mileage may vary. Cis means \"not trans.\"\n\n\\-Nonbinary people can have a specific identity. If you haven't heard of it, you can ask what it means to them. Many nonbinary people are okay with singular they, but some nonbinary people use unusual pronouns, it is not offensive to ask how to use them.\n\n\\-You don't have to understand trans people to be supportive and respectful. If you say something ignorant or get a pronoun wrong, apologize quickly and sincerely, and move on. Don't make a long drawn out apology-you don't have time for that and trans people aren't super interested in hearing it.\n\n\\-Trans people are regular people. Talk to them about non-trans things, too, same as you would with anyone else.We are more than our meat suit.\n\n\\-Last one: try to remember that you may have trans coworkers. A little respect for trans people goes a long way to us. We appreciate it.\n\nComment if you have questions!\n\nEdit: Thanks for the gold, kind strangers!",
    "title": "Trans Patient Tips from a trans nurse:",
    "subreddit": "nursing",
    "timestamp": 1550280237,
    "score": 1098,
    "keyword": "man nurse"
  },
  {
    "text": "I have a kid who does a weird thing... Ok, so I know we all have kids in our classes that have odd quirks.  I've been teaching 10 years and God knows I've run into quite a few weird quirks, but this one just blew my mind.\n\nSo I let my kids drink in my classroom as long as we're not doing a lab, and the drink can be closed.  I noticed one of my kids had a yellow \"sauce\" packet that he kept in his mouth.  I live in the south, so Sweet Tea is a big thing everywhere.  I saw the yellow packet and assumed he was \"sipping\" on lemon juice the whole time in class.  That's weird in and of itself, but WHATEVER.  I even thought maybe he had an issue where he needed vitamin C so he was doing something the doctor recommended and was nursing a tiny packet of lemon juice to meet his requirements.  \n\nSo the other day I noticed he had a big stack of the packets empty on his desk.  (The kid obeys the rules and doesn't throw his stuff away until the bell rings and he heads out to his next class.)  I saw the big pile while he was doing work and just walked up next to him and motioned for him to throw his stuff away.  I asked him, jokingly, \"so do you have scurvy or something, man?\"  I was just joking, and I honestly didn't think he'd understand what scurvy was, so he looked up and said, \"huh?\"  At this time I finally look closely at the little yellow packets.  Turns out, this whole time, he is sitting there eating pure mustard.  NOTHING ELSE.  My rational human brain saw yellow packets and just assumed he was sucking on lemon juice the whole time.  That's what I get for trying to rationalize a teenager's behavior.  The kid goes into the lunchroom during breakfast and gets like 10 of the mustard packets and sits there chowing down.\n\nI was just so flabbergasted, I just couldn't say anything that I knew would hurt his feelings.  The kid is kinda odd anyway, but nothing really to worry about.  (And I know this isn't something to worry about either.)  That being said.  WTF?!  This kid comes in, almost every day and sits and eats 5-10 mustard packets.  I've met the mother; I don't think there's an issue where he's not getting fed at home.  \n\nI just... I had to tell someone this, and I felt like you guys might get a laugh out of a kid constantly eating pure mustard.  Do any of ya'll have some students' odd quirks?  I'd love to hear them!",
    "title": "I have a kid who does a weird thing...",
    "subreddit": "Teachers",
    "timestamp": 1573163232,
    "score": 89,
    "keyword": "man nurse"
  },
  {
    "text": "I’m leaving my job. I’m heartbroken.’ Long story short: \n\nI love my school but I don’t have many friends or family in my town, I’ve developed a  health problem and am out right now and we don’t know when I could even return, plus I cant live healthily with just two good friends in the whole city, one of whom is moving in January. The kids need stability more than they need me, and he school needs to be able to post a full-time position. I’m out, effectively immediately. My heart is broken. \n\nLong story long: \n\nI went to a college pretty far from my hometown, I did my student teaching at a high school there and got offered a job there right out of school. So I stayed. I never meant to stay in that twin for a long time, I always wanted to move back to Chicago. But I loved that school and I wasn’t married yet, no kids of my own, and it was easier than searching for a new job and apartment! And I loved my students. \n\n\nMy first year was great. Hard, but great, and man, did those kids learn. I teach foreign languahe, so I’d get those kids again, and I couldn’t wait to expand on the foundations I’d built. Plus, my school is amazing and the kids are so talented. I was so excited to stay. \n\n\nSecond year I had a traumatic event re-hash itself that sent me into a depressive episode. I’ve been on antidepressants since I was 15 and they’re very well managed,  i but this was horrible. I missed about a month, first being depressed and then in treatment. We got my head sorted out eventually, still on antidepressants. Second semester I was better mentally and emotionally but I got a reoccurring UTI in about March that spread into a kidney and bladder infection that plagued me March to May. It hurt. It hurt so bad and I got terrible terrible headaches with it. I missed so much work and some days I couldn’t form sub plans. I told my kids what to do when I was gone but somehow it slipped through thre cracks. I made it through the year but I knew I could do better.\n\n\nI debated coming back home after my second year, this summer. Two full years out of college and I had few friends left in that town. But I wanted to be there for my kids, most of whom really liked me, some of whom  explicitly told me they only signed up for my subject because of me. I decided it’d be my last year, 2019-2020. I was gonna do the best and last year, go out with a bang. I prepped and revised this summer. Also, I got a staph infection, most likely from Disney World or the airplane to Disney World. That infection came back twice over he summer but went away by school starting. Also, we found out that my roommate/friend got a fellowship (a really good one!! In her field!! Doing wildlife rehab!! In a beach town!! PAID!!) and would be moving out in January. I tried and failed to find a new roommate and was getting used to the idea that I’d live alone. \n\n\nSwcghol started. I had some former students and new students. I was so excited! We started reviewing and I was blown away but what one second-year student had managed to remember. It was gonna be a good year. \n\n\nMy fuckin staph infection came back the night of the fourth day of school. I got on a strong, string, strong antibiotic  but I couldn’t go in— you can’t set foot in a school with several-antibiotic-resistant staph on your arms. I missed three days. I’d be okay. The infection cleared but I was gonna finish my course of antibiotics. I was still, of course, on my antidepressant. \n\n\nTwo days later, I was teaching third hour and I suddenly couldn’t feel my legs. I felt dizzy. then my stomach felt numb— like I’d been shot up with Novacane, but everywhere, or like my foot had gone numb, but not pins and needles, just got feeling it, but everywhere. I could feel the numbness rising twward my chest. I emailed the principal, nurse, and two other people while trying to stay calm. I started getting shaky on my feet. \n\n\nThe nurse brought in a wheelchair. We decided to get an ambulance because I couldn’t feel sensation touch with my eyes closed and it was spreading, rapidly. I tried to text my family and roommate but it was gibberish. I had the nurse text my family. I got put on a gurney and loaded in the ambulance. My classroom was right in front of the school, with windows. He last thing I saw was my kids crowded by the window, one girl crying; some with phones.\n\n\nI went to the ER. Got admitted to the hospital eventually. They thought I had something called Serotonin Syndrome, or too much Serotonin, probably from a medication reaction with my string antibiotics or just how weakened my body was by the infection. Full-body numbness, dizziness and motion sickness, difficulty speaking, difficulty with fine motor skills. They needed to take me off my antidepressant and flush Serotonin out of my system. They did. The symptoms got better. \n\n\nThen the anxiety hit me. I spent a full week off of something I’d been on since I was 15 years old. I felt physically nauseous. I shook all the time. I got overwhelmed by the idea of eating an apple— a whole apple that’s a lot of commitmmmet! And whet if I don’t finish the whole thing?? So guilty. I forget stuff constantly. I’m also having issues finding my correct words and doing Adult Daily Living Tasks like cooking or putting food together, remembering the order of stuff to do in the shower, putting food away in the wrong places (a head of lettuce in the pantry.) Writing by hand is hard. Typing is hard. This has taken me about 2 hours, and yes, I can see some of the typos, and I hate them too. And emotionally I’m back to age 15– crying all the time, thoughts of hopelessness, apathy, fear of everything. And I’m not allowed to drive or use cooking utensils unsupervised. \n\n\nI’m staying with my parents now, and I’m in a recovery program and they’re introducing me back on my antidepressants. But it’s gonna be a while. Maybe a month, maybe more. And even if I come back in a month, it’s simply not safe for me to go back in January and live alone (roommate is moving out for her awesome program). \n\nI spoke with my parents. I spoke with my doctor, I spoke with a therapist. I spoke with my principal. \nThe students need stability, a teacher who’s there and will keep being there. I need to be with people who can watch me and in a program to help me get back to normal. This was gonna be my last year. My family and my boyfriend and most of my close friends live in a different city. \n\n\nSo I resigned. Or quit. Or gave notice or whatever. It’s the best decision for me and the school. I am heartbroken, I can’t think of what to say to my colleagues or my kids. I know that my brain is very depressed right now, but even so, this is a damn tough decision. I love that job. I love that school. I love my third hour kid who hand-drew a meme if the day every day last year. I love my students who make up dances to all our weird grammar songs. I love the kids who tell me any and every connection they have to our language, whether that’s a family member, a hair braider they met, or writing on their shampoo bottle. I love making fun of cheesy textbook soap opera videos, and also cheesin’ our whole teaching grammar because it makes kids laugh and when they laugh, they remember \n\n\n. I can’t even think about getting my books out of that classroom. The kids deserve books. I love especially don’t have any idea about what other colleagues will say, or parents. Oh, shitty absent teacher who didn’t give homework and let the students play with Play-Doh, she finally got “sick,” and quit? Good. We hated her anyway. \n\n\nI know this job is tough, but it can be so good. Take a moment today to appreciate all the good things you have. I’ll be going to program and therapy and making plans on how to pack up my old apartment before the month ends so I can break my lease. \n\n\nThanks for reading, if you did. Go do great.",
    "title": "I’m leaving my job. I’m heartbroken.’",
    "subreddit": "Teachers",
    "timestamp": 1568289649,
    "score": 48,
    "keyword": "man nurse"
  },
  {
    "text": "Anxiety at work, saving up for a Career change. How do I manage this situation? Hi, this is a long post so thanks if you read it all and respond!\n\nIm 27 m and work in pharmacy. Last year after burnout and mental illness, I moved to another country and spent seven months working and living in customer service and teaching English. I had a great time, and I didn't want to come back-finances and losing my apartment meant I had to, which I guess was a blessing in disguise, because I had to tackle some bills and obligations back home.\n\nIn October, I came back, renewed my licence and took a part time job where I wasn't happy. I just didn't take to the owner of the business, he was a nice man but ever present, and I didn't really feel comfortable. I left to do locum work, which is kind of like free-lancing, but the work was sporadic and the travel was a lot.  \n\nAt this point (last November) I decided that I just didn't want to work in pharmacy. I don't like it: its too high pressure, I don't have the mentality to hit corporate's bullshit targets or to deal with idiot customers, plus with depression and anxiety, this job just exacerbates my problem.\n\nI decided that I want to change my career to software development/web design and to relocate back to Spain (where I spent much of last year) and get my life back on track. I'm tired of being a depressed, lonely, loser and I need to make changes before it's too late and i'm too old to do so. So to further this, i'm saving up to relocate and go to a coding bootcamp over there. That's my dream and it's possible; all i'm doing this year is to reach. that. goal.\n\nSo, in January, I took a full time position for a chain of pharmacies, I applied for a floating role in my city, but they changed it to a store based role in a town 90 minutes away from me after the interview. Stupid me took it. The store is understaffed, there is so much work I genuinely cannot believe it. I don't get on with my co-workers, and i'm so stressed out and anxious I really cannot function. This is after ONE month! I keep on making mistakes, which on reflection is obviously my fault but also due to the ridiculous demands i'm under. This weekend, I've been having a 3 day long panic attack, minimal sleep, won't go out or turn my phone in due to fear of calls from work, it's nuts.\n\nNow my ray of light in all this, is that 2 weeks after joining this hell hole, I decided to go to an interview for a totally different pharmacy role in a nursing home (no scripts to fill, no customers, less money, less stress). They basically gave me the job in the interview, although (due to security) it could take up to 3 months, and that I should expect communication from them shortly.\n\nMy problem is I need another job now. Just thinking about going into work tomorrow is making my head spin and my guts churn, last Thursday I was almost ran over and wished the guy didn't slow down. Mentally speaking, i'm all over the place.\n\n I'm living with my mother at the minute who is also a pharmacist, she says that i'm bouncing around too much and that I need to be stable, endure this for a while and all will be OK. She said that she's worried that eventually I'll turn out to be the kind of person that doesn't want to work, and that everyone suffers and that I have to just deal with the pressure that i'm under.\n\nPersonally, I understand where she's coming from, because i'm earning good money here; it allows me to save up and yeah its the easy thing to do. But: 1. This job is really affecting my mental health, and 2. I'm only waiting for this other job to come through so I can bounce anyway.\n\nSo how do I proceed? Do I stick it out until maybe april/may where I am? Do I go back with my tail between my legs to my old boss and ask him for my old job back? Do I ask my prospective job to hurry the fuck up so I can start working there ASAP? Should I just take a call centre job and just accept a decrease in my earnings for this year until I can go back and retrain?\n\nLet me know what you think, i'm sorry if that was a rambling mess, my head is all over the place at the minute.\n\nTLDR: My job is causing me unbearable stress and anxiety, I need another job ASAP, but also need money and to stay employed, what should I do?\n\n&#x200B;\n\n&#x200B;\n\n&#x200B;",
    "title": "Anxiety at work, saving up for a Career change. How do I manage this situation?",
    "subreddit": "careerguidance",
    "timestamp": 1551687612,
    "score": 46,
    "keyword": "man nurse"
  },
  {
    "text": "25 year old jack of all trades Thinking about getting another degree to get off the factory floor should I do it, and if so what else besides healthcare is worth getting into? So I'm a 25 year old male and I have done just about everything started out as a blacksmith,owned my own produce business before  selling it,moved to the big city to go to school, got a degree In psychology and then dropped out of med school, became an elevator mechanic, a car sales man, manager of a large logistics company in the city I live, and now I work as an operator at a large paint factory for a very well known company that could \"cover the earth\". I dont mind my current job but I call it an exploding cancer factory for a reason and I can already feel it taking a toll on my health. I'm looking for a way to find guidance I guess into a career that's going to be enjoyable. Honestly at this point I'd take tolerable. I'm getting married soon and we want to settle and have a few kids. I've looked at going back into healthcare as my fiance is a nurse and makes a decent living and enjoys the work. I'd love to go back and get another degree but I just dont know what would be worth it in the end. Any advice or suggestions for the indecisive fool that I am?",
    "title": "25 year old jack of all trades Thinking about getting another degree to get off the factory floor should I do it, and if so what else besides healthcare is worth getting into?",
    "subreddit": "careerguidance",
    "timestamp": 1565268415,
    "score": 1,
    "keyword": "man nurse"
  },
  {
    "text": "I'm a nurse who has Asperger's and really shitty people skills. Do I stand a chance in hell of becoming a data analyst? I feel like I'm a square peg being pounded into a round hole. I had to give a suppository today to a grown ass man who made me say 'please' first.\n\nAlthough I'm a good ICU nurse I hate it. While the work I do is cool I can't read an EKG wave or EEG wave worth for shit and my boss wants me to. I've heard data analysis is where it's at right now. I'm good with numbers and I like finding patterns and predicting the outcomes of things.\n\n&#x200B;\n\nAnd while ICU nursing typically limits me to 1-2 patients, the farther you go down the acuity food chain the more is expected of you. I'm used to pushing adenosine while a central line is being inserted, I'm not going to sit around and answer five different call lights.\n\n&#x200B;\n\nIs any of this making sense? Would I actually be good at CS especially with my Asperger's and shitty bedside manner?",
    "title": "I'm a nurse who has Asperger's and really shitty people skills. Do I stand a chance in hell of becoming a data analyst?",
    "subreddit": "cscareerquestions",
    "timestamp": 1558651676,
    "score": 5,
    "keyword": "man nurse"
  },
  {
    "text": "Follow up; After (self confessed slutty) feminist sexually forced herself on me, today I went to hospital for standard anti Aids drugs-Nurse assumed had to have been MAN who forced me, all caring-stopped being concerned when realised was woman, said no medication then. goodbye...",
    "title": "Follow up; After (self confessed slutty) feminist sexually forced herself on me, today I went to hospital for standard anti Aids drugs-Nurse assumed had to have been MAN who forced me, all caring-stopped being concerned when realised was woman, said no medication then. goodbye...",
    "subreddit": "MensRights",
    "timestamp": 1576705938,
    "score": 546,
    "keyword": "man nurse"
  },
  {
    "text": "An Excerpt from 'Confessions of a Male Nurse' demonstrating male disposabilty and sexism in the work place. In 'Confessions of a Male Nurse' Michael Alexander shares his experiences as a male nurse. This passage is about the sexism he faced.\n\n*Four Police officers have just brought an aggressive psychiatric patient(Mr. Brown) to the clinic...*\n\n...\n\n‘Watch him, boys,’ the officer in charge warned. \n\n‘He’s just waiting for his hands to be free.’ He was brought down to the ground, face first. In this position he wouldn’t be able to use his arms to hit us as the handcuffs were removed.\n\n&#x200B;\n\nThere was nothing more we could do until the psychiatrist arrived, which we had been told would be in about 15 minutes. It was time to leave. I instructed the officers holding the legs to go first, then next the officers holding the hands, followed very quickly by me. The secret to a safe exit is simple: move as fast as you bloody well can, slam the door and lock the bolts.\n\n&#x200B;\n\nAs the bolts were thrown home, Mr Brown charged for the door pounding on it with fists and feet for several minutes, before giving up and sitting back down on the mattress, staring at the door. \n\n**‘I think he needs a male to look after him,’ said the charge nurse, kindly volunteering my services.**\n\n&#x200B;\n\nThe police left and I was given the job of sitting outside the seclusion room door and peering in through the tiny reinforced window every five minutes. An urgent call had gone out for the psychiatrist to come as soon as possible. Mr Brown needed some serious sedation; his mind and body needed to rest.\n\n&#x200B;\n\nAs we waited, Mr Brown came to stand by the door, inches from where I sat, and tried to plead with me to let him go.\n\n‘I’ll be good now. You can trust me. I’ll do as you say. You can even open the door and I’ll just sit here. Just open the door, that’s all.’\n\nI ignored him. It wasn’t long before he changed tactics.\n\n‘Let me out, or I’ll fucking kill you. You’ll be the first. I’ll make it hurt. Let me out now and you’ll live. Do you want to die? You’re gonna die, with my hands around your throat.’\n\n&#x200B;\n\nHe began to kick the door, the old wood taking a hell of a battering. I checked all three locks, to make sure they were all bolted securely. I endured several minutes of some very graphic abuse, before he tried the pleading tactic again. In total I suffered 20 minutes of this barrage of begging and threatening, before the psychiatrist arrived.\n\n&#x200B;\n\nDr King took one look in through the window and ordered a very strong dose of tranquilliser.\n\n‘He does appear to be in a very bad way, wouldn’t you say?’ he asked casually. I wasn’t sure if he expected an answer or not.\n\n&#x200B;\n\n‘You sort out Mr Brown and I’ll draw up the injection,’ Dr King ordered. He didn’t appear to be the least bit worried by the situation. Of course, at the age of 59, he would have no hand in the upcoming restraint.\n\n&#x200B;\n\nT*he problem now was how to get in there and administer the injection. Since the police had left, I had to ask the staff to assist me and I was sure that help would not be forthcoming. For a start, I was the only male on that shift and, second, the average age of the women was at least 40.*\n\n&#x200B;\n\n**‘Um, I’ve got a bad back; hurt it during my last restraint,’ said Jane, the only nurse my age.**\n\n&#x200B;\n\n***The other women didn’t even bother with an excuse; they said flat out that they did not have a death wish. I had no option but to call in the police.***\n\n&#x200B;\n\nBefore long, the same four officers who had brought Mr Brown in were beside me, peering at the patient who had by now realised we were coming. If there had ever been any notion that Mr Brown was going to make things easy for us, and that he might have calmed down a bit, his shadow boxing performance soon put an end to it. It seemed as if madness had lent strength to Mr Brown.\n\n&#x200B;\n\nI motioned for the officers to lead the way.\n\nThe officer in charge, Sergeant Perkins, looked at me and said, ‘He’s your bloody patient; you go first.’ It had been worth a try.\n\n&#x200B;\n\nThere is a strategy we use when taking down a violent patient, it involves each person being designated a specific body part, that is, right arm, left arm, right leg, left leg or head. If you are responsible for a body part then that is all you aim for. This strategy requires feeling confident that your partners do their job and concentrate on their body parts. If I was to grab Mr Brown’s right arm but my partner was to fail to take the left arm I would end up with a very swift hook to the side of the head. It’s all about trust.\n\n&#x200B;\n\nIt’s also about speed; we needed to try to overwhelm Mr Brown with speed and organisation. The door was opened quickly (which was actually rather hard since it had three locks) and I led the charge, my head down and my eyes glued to Mr Brown’s right arm. I caught a couple of glancing blows to the shoulder and head, but luckily nothing connected properly and soon we had his arms and legs pinned. The last officer came in and supported the patient’s head and we slowly lowered him to the ground. We had done a good job; we had our man immobilised and no one was hurt – not even the patient.\n\n&#x200B;\n\nAs we lay there, the doctor calmly waltzed in and complimented us on such a nice takedown. He jabbed a very big injection into Mr Brown’s buttocks, then calmly removed himself from the room. It was now time for us to make our exit.\n\n&#x200B;\n\nAt least this time I wasn’t the last out. The two lads restraining the legs exited first, and then Sergeant Perkins and I left, as we had the arms, followed very closely by the last officer who had held the head. The door slammed shut and the bolts were thrown across. Mr Brown didn’t bother to get up; he just lay there staring at the wall.\n\n&#x200B;\n\nIt’s pretty hard to forget some of the more colourful characters and even harder to forget some of the more violent ones. It is an unfortunate fact that violence is not uncommon in a psychiatric ward, whether it is to oneself or to others. Some days it seemed as if the unit was a big cauldron, brimming with pent-up anger and excitement. Such strong emotions, such raw energy, are not easily diffused in a closed environment; they have nowhere to go.\n\n&#x200B;\n\nAs I resumed my vigil outside Mr Brown’s room, **I thought** ***about how having another male or two in this place would help.*** **Thankfully the unit eventually hired a full-time muscle man, a giant of a guy that even a crazed patient would think twice about crossing.** ***Some nurses felt this was not needed and sexist; I just thought it common sense.***\n\n...",
    "title": "An Excerpt from 'Confessions of a Male Nurse' demonstrating male disposabilty and sexism in the work place.",
    "subreddit": "MensRights",
    "timestamp": 1552552288,
    "score": 206,
    "keyword": "man nurse"
  },
  {
    "text": "One brave young man takes on gender inequality at USC  \n\nMisandry—the hatred of men—has been a staple of my polemical writing  for more than fifteen years. I felt a special obligation to hammer away  at gender myths such as intimate partner violence (women are about [as likely as men](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4062022/) to initiate violence against their partners as men), false sexual allegations (a [disturbing percentage](https://medium.com/t/@jimpreston_36730/how-many-rape-accusations-are-false-f52e4c675f2a) of such allegations) and demonstrable [bias against fathers](https://theccf.ca/ideology-and-dysfunction-in-family-law/)  in family court, because male journalists who dared to write  sympathetically about men and/or critically about women put their  careers in jeopardy (no exaggeration), and most had learned to keep *shtumm* in this domain.\n\nThat  situation has been changing slowly but steadily. Some men have decided  they aren’t going to spend their lives in rhetorical purdah on the  subject of their own cultural dhimmitude, and have been stepping up to  the plate, whatever the personal cost. The university campus is home to  the feminist commissariat—and it’s a brave man who dares to stick his  head above that formidable parapet. Because the cost of doing so can be  high.\n\nThis is the story of one such activist who paid a price,  which only fueled his resistance efforts, and which in turn inspired  others, in reversing a decades-long erosion of men’s rights on campus.\n\nIn  a meeting held in June, 2017, Kursat Christoff Pekgoz was pressured by  his academic director at the University of Southern California into  terminating his PhD degree in English Literature on what Pekgoz  considered spurious and unprecedented grounds, accompanied by “many  threats and irrational exaggerations” (the meeting was recorded).  His  contract was not renewed and his funding was cut off. This is extremely  uncommon. In fact, Pekgoz is unaware of any other PhD student being  denied a doctoral degree in English Literature \\[at USC\\].\n\nThe real  reason for his PhD termination, Pekgoz alleges, is his history of gender  activism via a series of Title IX complaints against a number of  universities, such as Rutgers, [Northeastern](http://ncfm.org/wp-content/uploads/2018/08/NCFM-Title-IX-complaint-Northeastern-University.pdf) and Georgetown, to which he added [one against USC](https://docs.wixstatic.com/ugd/ea7b71_0c223159779e4beaaea809873f2504a7.pdf) at the end of May. As he [told a PJ Media reporter](https://pjmedia.com/trending/ph-d-student-files-federal-complaint-says-usc-retaliated-against-his-pro-men-title-ix-activism/), “They all know that I am a Title IX activist for men, with strong libertarian/conservative views.” \n\nTitle  IX’s language is very plain. It prohibits any institution from funding,  sponsoring, or listing gender-discriminatory programs and initiatives,  so for example, even listing a woman-only scholarship or placing an  employment ad specifying only women need apply runs counter to Title IX,  though such breaches happen all the time. Title IX also prohibits  discrimination in terms of counselling or health benefits. That should  mean that both men and women are treated with equal objectivity and  respect when, say, sexual-assault allegations come up for assessment.  But universities have [not covered themselves in glory](https://helpsaveoursons.com/category/fighting-back/), to say the least, on that front. \n\nIndeed,  motivation for Pekgoz’s robust activism arose in part from a Title IX  complaint against him for sexual harassment. In response, he went on  offence with a forceful and persuasive [counter-charge](https://docs.wixstatic.com/ugd/ea7b71_16c1692eab8844218afdb2b419622827.pdf)  that his accuser had in fact sexually assaulted him (it’s worth  reading, because it offers a formidable sample of the kind of meticulous  research and annotation Pekgoz applies to every single thing he says  and writes. It does not seem to leave much wriggle room for his accuser,  and I think any objective reader would come away from it with,  minimally, doubts as to the accuser’s credibility.) \n\nIn 2018  Pekgoz complained to the Department of Education’s Office of Civil  Rights (OCR) about both USC and Yale University, prompting an  investigation into both schools’ women-only scholarships and programs,  such as a USC Women in Science and engineering group that excludes  males.\n\nLast January, Pekgoz and two former lawyers (not affiliated with Harvard University) filed a Title IX [complaint with the OCR against Harvard](https://docs.wixstatic.com/ugd/ea7b71_85533d99ee0748ac813ca937735a4f94.pdf),  in which they rebut the received wisdom of female victimhood with an  abundance of impeccably-sourced evidence demonstrating the various ways  in which men are discriminated against in society and on campus.  Notably, “the overwhelming majority of all persons sanctioned under  Title IX theory are male. However, there is good evidence that men and  women experience sexual victimization at equal rates and the majority of  male victims [report female perpetrators](https://www.sciencedirect.com/science/article/abs/pii/S1752928X11001569). The majority of Title IX administrators are women.”\n\nAlso in the Harvard complaint is a reference to Supreme Court prohibitions against male-gender discrimination. In [*Mississippi University for Women v. Hogan*,](https://www.britannica.com/topic/Mississippi-University-for-Women-v-Hogan)  for example, the Supreme Court held that denying male admission to  nursing courses was impermissible under the Equal Protection Clause of  the Fourteenth Amendment. They wrote that a sex classification must be  “…determined through reasoned analysis rather than through the  mechanical application of traditional, often inaccurate, assumptions  about the proper roles of men and women. … Thus, if the statutory  objective is to exclude or ‘protect’ members of one gender because they  are presumed to suffer from an inherent handicap or to be innately  inferior, the objective itself is illegitimate.” This statement would  seem to undermine the reflexive argument adduced by feminists that  affirmative action for women is still necessary because of historic  disadvantage or because there are more *Fortune 500* male CEOs than women.\n\nThe  most interesting complaint to the OCR, because it reveals the distance  the men’s rights movement has come from its first tentative and atomized  beginnings two decades ago, is the one led by Pekgoz [against Cornell University](https://www.scribd.com/document/399202262/Coalition-Complaint#from_embed) in February, which Pekgoz described in an  [interview with *Campus Reform*](https://www.campusreform.org/?ID=11853) as “one of the worst in the nation” for anti-male bias. \n\nThe  document contains a “list of exclusionary programs” at Cornell, such as  the lack of a Men’s Resource Center to balance the women’s Center, or a  Men’s Health Center to balance the Iris Cantor Women’s Health Center.  Likewise – even though “men are twice as likely to have heart attacks  through life than women” – there is a women’s Heart Program, but none  for men.\n\nBut the list itself, while interesting, is not what is  most significant about the Cornell complaint. Rather it is the public  support for the complaint amongst Pekgoz’s colleagues and from many  respected public intellectuals, such as American Enterprise Institute  scholar and feminist critic [Christina Hoff Summers](https://www.aei.org/author/christina-hoff-sommers/),  that lend unusual moral weight to its claims. More than 185 professors,  scholars and activists signed on to it, including Canada’s own Jordan  B. Peterson, arguably the most recognizable and inspirational spokesman  for gender equality in the world today. Peterson referenced Title IX’s  long association with women’s rights succinctly: “what’s sauce for the  goose is sauce for the gander.”\n\nPeter Wood, president of the National Association of Scholars, told *Campus Reform*  that he had signed the complaint because it “addresses a fundamental  unfairness in contemporary America, centred in our colleges and  universities” and because “it shows that exclusionary practices create a  hostile environment” for men, some caused by an “animus against males  perpetrated by feminist ideology.” Lawrence Alexander, a law professor  at the University of San Diego, told *Campus Reform* that he signed because “its allegations are true and even understated.”\n\nSuch  public affirmation on men’s behalf by high-status academics in  prestigious institutions represents something like a tipping point in  the gender wars, it seems to me. Margaret C. Valois, a Virginia-based  Title IX attorney who specializes in defending accused male students  filed a similar Title IX complaint against Tulane University and [obtained a win](http://www.aei.org/publication/successful-title-ix-complaint-forces-tulane-university-to-end-gender-discrimination/)  recently. Valois, Pekgoz and another aggressive veteran in the battle  for gender equality, Professor Mark Perry of the University of  Michigan-Flint, are profiled by anti-feminist Canadian vlogger Janice  Fiamengo, a signatory to the Cornell complaint, in [Episode 94 of her popular Fiamengo File](https://inclip.top/studiobrule/aLDRY3qCkmjIuoI/will-2019-be-the-year-of-mra-lawsuits-tff-episode-94.html) series, titled “Will 2019 Be the Year of MRA Lawsuits?”\n\nWill  it? It does seem that we are at a pivotal moment—that there is a  powerful current of social unease, running just below the still  hegemonically feminist surface, with the unfettered misandry that  pervades our culture. In Pekgoz’s Harvard complaint, for example, he  notes that whenever the Department of education investigates an  institution for anti-male discrimination, public attitudes on the issue  are on the side of men: “\\[A\\]ccording to a recent poll conducted by  YouGov, 69% of all Americans believe that men face discrimination to  some extent. 74% of men believe that such discrimination occurs, while  63% of women agree that men face some degree of discrimination.”\n\nFiamengo points to what she ([and I](http://www.barbarakay.ca/articles/view/1297)) consider radical feminism’s shark-jumping moment, the publication in the *Washington Post* of Northeastern University academic Suzanna Danuta Walters’s odiously misandric June, 2018 article, “[Why can’t we hate men](https://www.washingtonpost.com/opinions/why-cant-we-hate-men/2018/06/08/f1a3a8e0-6451-11e8-a69c-b944de66d9e7_story.html)?” which earned her a [Title IX complaint](https://www.campusreform.org/?ID=11249) filed by the National Coalition for Men [(NCFM).](https://ncfm.org/)  Walters doubtless expected her screed would find the passive acceptance  such anti-male rants often have done in the past, but was clearly  startled by the fierce blowback she received.\n\nA final word about  Kursat Christoff Pekgoz. I don’t know him personally, but from his  history, I would say that the USC Literature department picked the wrong  guy to tangle with when they forced him out of his PhD program. This is  a young man, now 30-something, who comes from Turkey, a land where they  play political hardball, and backing the wrong horse can earn you  something worse than a Twitter mobbing. He learned about activism in  what we might call an “unsafe space.”\n\nPekgoz’s [*curriculum vitae*](https://www.kursatchristoffpekgoz.com/)  informs us that In Turkey Pekgoz went out on potentially dangerous  political limbs. He took part in the Republic protests of 2007 against  fundamentalist Islam, as well as a protest against Islamist hate speech  targeting Armenian and Jewish minorities in 2009, amongst other forays.  He advocated against electoral fraud by the Islamist regime. He taught *pro bono* for an anti-Islamist organization that seeks to eliminate illiteracy among young women in Ankara (real feminism in action). \n\nAll  this speaks to character. For relentless discipline and determination  in achieving goals, add this salient fact: As a long-distance swimmer,  Pekgoz has covered 11,000 m in the open sea, with the best speed of  5,000 m in 130 minutes. This is in seawater with a temperature of 17C.  Don’t look to such a man to truckle to latte-sipping ideologues  trafficking in gender injustice. Ever.\n\nAccording to his bio,  Pekgoz has “perfect pitch.” He means musically, of course. But it may be  the case that he has perfect cultural pitch as well.\n\n&#x200B;\n\n[https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/](https://www.thepostmillennial.com/one-brave-young-man-takes-on-gender-inequality-at-usc/)",
    "title": "One brave young man takes on gender inequality at USC",
    "subreddit": "MensRights",
    "timestamp": 1569207365,
    "score": 186,
    "keyword": "man nurse"
  },
  {
    "text": "The day the feminist establishment takes the financial provider gap seriously, I'll take the wage gap seriously. Equality of responsibility? Why is it that in the west, in e.g. large cities, there's a glut of single, educated, professional women.. Living singleton lives. Homelessness/rough sleeping is 90 % male, and on the rise. All those homeless guys, we just accept (along with a related type of suicide that comes with loss of income/status when nearly homeless). And all those bachelorette women. And we make no connection. Why is it not the other way round? What would society make of it, if it was the other way round? Why has it never been the other way round? What happens when we prioritise male education, as we used to, rather than female, as we currently do?\n\nOf course, back when men's access to higher education and some well paid professions was prioritised there were some abuses of women, in a system that constrained some women's choices, and limited some women's abilities with a \"glass ceiling\" in these professions. But even when men were given priority for education, and for certain higher status careers, we forget about the abuses of some men in a system that (still does) constrain men's choices, and limits their abilities with a \"padlock\" on the homemaking path, (and sometimes fatherhood path), or the continued lack of social acceptance for men working in female dominate professions e.g. nursing, or attending/having any influence on certain university courses e.g. \"gender (men are bad) studies\".  And men, now more than ever, have nothing like women's well funded glass floor that keeps people above a certain level, that stops almost all women becoming destitute, but without fail looks the other way when men drop out of society. Men have Swiss cheese rather than a glass floor, and always have.\n\nWhy was it that when men had almost all the responsibility to be the guarantors of financial provision - *and* an education system that recognised this responsibility by prioritising male education, to enable them to meet the expectation women would put on them when seeking a relationship to earn for her and any family she might want - this get's rewritten to the solely grievance-based feminist viewpoint of being simply \"male privilege\" - when there was in fact an equally large responsibility, failures and all, and a massive number of men living up to that responsibility, and giving large amounts of wealth to women, families, and society.. Except.. we still have most of that, and men still only have the career option, while their education is being taken for granted by an overwhelming majority of female, and feminist, teachers, who have made it their mission to only ever increase female achievement, and take offence at the fact that men are the ones left behind, and deliberately sabotage any efforts people try to make to give boys an adequate education.\n\nWhy is it that there are, still, massively more women that are provided for financially by their male partners (by men who still *only* have the socially acceptable path of financial provider) - by men who didn't mind how much their partner was capable of earning.\n\nWe should make more of the fact the men - don't mind how much women earn, they have no problem at all being generous, and are accepting of any level of income from a partner, in general. \"Why can't women be as accepting of being a financial provider as men are??!!\"\n\nIf they're going to be gender Marxists on broad sweeping views of career outcomes, and education outcomes (and moving from Marxist into gender supremacists on the education point.. i.e. gender fascists?) then how can they also pay almost no attention at all to the *financial support gap*. AKA gender sustenance gap. Men giving money to women for their livelihoods. Men giving money to raise the family a woman has always wanted. Men giving money to feminist establishments in their taxes. Many men and political parties voting for feminist causes to be funded by their taxes, but many women usually siding with feminists when they almost universally stamp out even recognition of men's issues, let alone beginning to fund them, or allow them to begin to be studied in universities. Men funding universities that simultaneously call them toxic, and use the few men that do succeed at the only thing society vales them for - despite slogging through our gynocentric education system - and becoming high earners for their families and society... and then using this *against* men.\n\nTo be clear - I'm not a gender Marxist. I don't think we should blindly seek equality of outcome. It is OK for men and women to have different roles and outcomes which form because of:\n\n* The-set-of-all-men-and-all-women's relationship choices - like women being less likely to date someone who's at risk of homelessness (to avoid herself/future family becoming homeless), or men being less likely to date someone who's promiscuous (to avoid being deceived about the paternity of any future children). - these choices mean men and women will always have different relationship options, despite society viewing men and women with \"equal value\"/being agnostic to their relationship potential.\n* Men and women's ability eccentricities (like chance of being a good nurturer & risk averse, or a good pioneering inventor & risk taking). Like having more nurses that are female, or having more plumbers that are male. Or having more prisoners that are male, and more pole dancers that are female.\n\nWe cannot mandate outcome while people have free choice, and the set of all men's and women's choices and abilities *average* to be *different,* giving men and women different relationship options and outcomes, *and* different career options and outcomes. Yet, we appear to have the \"courage\" to be gender Marxists for education, earning and career options, with 40 years of activism to mandate equal outcome - maybe we should start to point out the other side of the coin, the relationship responsibility side and financial provider side, which was always there, with men holding up their side of the bargain all along, despite us giving women all possible right to choice, mitigating any responsibilities, all of the beneficial outcomes, but none of the negative outcomes. This was about removing women's tendency treated as sex objects - which was entirely legitimate to want to do - yet men are still treated as success objects.\n\nSo, if I did take a page out of the gender-Marxist book, from a page that actually addressed both sides of their gender \"equality\" manifesto, it would say that men should push for equal relationship outcomes for gaining financial support, which would mandate as many home-dads as housewives, and no more shaming of men that live by a woman's income as \"scroungers/deadbeat dads\" - to stop men being homeless/committing suicide/turning to crime to give them some other path if they are not successful at a profession. And billions in government funding, to \"meninist\" establishments, education establishments all changed from the ground up to accommodate almost exclusively male higher education, etc.. But I'm not saying that.\n\nClearly though, given society's expectations on men and only men, that they *must* be successful at a profession, we could at least point out that education is, still, *more* vital for men, just as it always has been and always will be - men's education and professional competency is vital for men, women, families and society, in a way it will never be for women, as long as so many women want no part of this vital responsibility to people other than themselves. And the current misbalance, in the opposite direction, should be tackled even harder than it was when it was other way around. Tackle the misbalance that destroyed a masculine-centric education system to replace it with a gynocentric education system, which - especially for underprivileged/working class men - ruins their life chances, and is probably a very significant factor that's turning so many men to suicide/homelessness/addiction/prison, in addition to a failure to provide for families & society.\n\nAnd in addition, as long as women have both paths - earner, and homemaker - and men have earner or bust, and always have had only earner or bust - lets stop being so surprised if men as a group do better at being earners. Lets just recognise that men's education must not be taken for granted as it currently is, for everyone's sake. Males are the only sex for whom education is vital, the only sex you can (still) be much more sure will *have* to use that education to support a partner that might not be able to earn, or might just chose to have the man take up the economic slack at any given time out of convenience. The sex that is still more likely to use it to support a family financially while the mother happily tones down her career to become a good homemaker, to give her family the best future. Sure, men that are born into privilege, into a good education, money, work ethic, connections, have privilege, and an \"easy time\" of it, but this is kind of privilege that by definition comes just as often to women - and they still have double the initial choices any privileged man has - they still can chose earner or homemaker, and with just as much initial privilege - except actually more so.\n\n&#x200B;\n\nWhat I'm not saying.. in \"meninist\" language  -\n\n\"Why do women see men just as banks? Men are accepting of a woman no matter how much she earns - often the less the better! But you ask a woman what man she'd accept - oh, he has to be successful/wealthy! Women are just gold digging whores, that want to bleed men dry of their wealth!! Such a double standard! End condemning men to being homeless/committing suicide!!\"\n\nThough, for actual equal of treatment of men's and women's issues currently (if we both got to be gender-Marxists), maybe men should be saying that.. Sounds far-fetched? ...\n\n\"Why are men allowed to sleep around.. often the more the merrier!! But you ask a man what woman he'd accept - oh she has to be a saint! Men just toxic bastards that want to conquer all the women they can, and put another notch on the bedpost!!! Such an unfair double standard! End slut shaming!!\"\n\n&#x200B;\n\nIndividual people are allowed preferences, which will cause apparent \"hypocrisies and injustices\" when looking at group outcomes of men and women as feminism and \"meninism\" does. But we can at least make reasonable effort to mitigate some of the pitfalls caused by the differences in opportunities, as civil rights did for women - mitigating women being treated as sex objects - which we should now do for men by mitigating them treated as success objects, by seeking equality of opportunity to e.g. reliability of income (including from a partner, or more robust access to education), housing, quality of life, or domestic abuse shelters, etc.\n\nSeeking equality of outcome is unjust, we are different. Seeking equality of responsibility? I'm not sure.. It might seem unjust, as we have different abilities and preferences, but we used to have it, broadly. I guess it depends what we think civilisation is for. Equality of responsibility does not seem too much to ask though, given that feminism is all about \"equality\", women not being weak etc. And, well, if they're earning their newfound \"privilege\", maybe it's time they got back to roughly equal responsibility, either by reducing men's responsibility, or increasing women's.\n\nIt's also unfortunate, but not surprising how how society cares about trans suicide rates with respect to trans issues, but no hint of caring about men's suicide rate and so caring about men's issues. I can't help but think suicide actually is a pretty good meter of how a group is doing. In China the rate is 1:1 M/F. For all China's issues, men and women seem to actually have about equal responsibility.",
    "title": "The day the feminist establishment takes the financial provider gap seriously, I'll take the wage gap seriously. Equality of responsibility?",
    "subreddit": "MensRights",
    "timestamp": 1575436275,
    "score": 121,
    "keyword": "man nurse"
  },
  {
    "text": "Formerly abused elderly man suffers forced exposure by nurses as part of hazing ritual https://web.archive.org/web/20190619094525/https://www.king5.com/mobile/article/news/investigations/disturbing-staff-behavior-investigated-at-providence-clinic-in-olympia/281-e2333b8a-bcd3-4e28-ab00-043a01f684c9\n\n---\n\n**Here are guidelines on how to report medical practitioners you believe are behaving in an unsafe or inappropriate manner (U.S.-centric, not sure about rules for other countries):**\n\nHow to report nurses according to the National Council of State Boards of Nursing: https://www.ncsbn.org/A_Health_Care_Consumers_Guide.pdf\n\nHow to report doctors according to the Federation of State Medical Boards: http://www.docinfo.org/report-a-doctor/\n\nIt would also be a good idea to contact the police if you believe the person who treated you was engaging in illegal behavior.",
    "title": "Formerly abused elderly man suffers forced exposure by nurses as part of hazing ritual",
    "subreddit": "MensRights",
    "timestamp": 1560939446,
    "score": 95,
    "keyword": "man nurse"
  },
  {
    "text": "Woman broke into my home assaulted me and I was arrested..help (escuse my grammer im disabled)\n\n I was sleeping and my female neighbor who lives behind me who i was friends with. Came into my home while i was sleeping and woke me up by punching me in the head and neck and shoulder. I woke up and said hey lets go outside and talk, hoping she would follow me outside to get her to leave. She kept hitting me stopping and repeat over and over and over but i made my way out of my bedroom and into my hall and then woke up on the ground. At that point all i remember was my temple hurting and she knew im disabled and i said please stop im on blood thinners. Because i don't know how hard you have to be hit in the head to have a brain bleed. I stood up and woke up back on the floor. At that point i stood up and said get the fuck out now went from verbally asking politely to demanding..kept hitting me. So i grabbed a unloaded .22 handgun that i keep on my counter in the kitchen that was within reach after getting off the floor. \n\n(As a safety mechanism it cannot be loaded shot or anything not even pull the trigger without the magazine wich was in the other room in a safe and was in a soft padded waistband holster)\n\nI pointed it down to the ground with my bad arm and kept pointing at my door get out get out get out. Nothing still hitting me. Continued to make my way to the front door with her in front of me hitting me repeatedly as i never touched her or shoved her or pointed it at her or anything aside from the ground in the holster and finally made my way to the door. She tried kicking it open and i finally shut her out.\n\nI placed thr gun back down in the kitchen and called 911 and explained what happened. As im on the phone sherriff kicks down my door and jumps in with a Glock pointed at my head. I comply. I was arrested after he refused but another officer let me go to the hospital to get a MRI done. Was in infirmary at the jail for 2ish weeks with no phone call and none of my medicine only my blood thinners that took me 5 days to argue that they were blood thinners and not beta blockers with the nurse..and was forced to starve due to withholding my stomach medication for my post gallbladder removal that helps me eat and keep it down. Lost over 20lbs in 2 weeks from not being able to eat and withdrew fr my nerve medications i take for my disability because im immune to opiates. And they weren't even narcotics at that. After 2.5 weeks was kicked out of my solitary hell into general population and forced to sleep on the top bunk and further injury myself because in disabled from my upper extremities. I couldn't even sleep on the floor because they were already being sued for over crowding..i was arrested for misdemeanor battery, felony battery with a deadly weapon and felony intimidation. AND a violent or sexual felon with a firearm.. yeah.. apparently they thought i had a felony from a neighboring state for burglary but i didn't..and apparently here if you commit a burglary your automatically a violent or sexual felon..but i didn't..so bond set st 25k no 10%. Once i was able to make a phone call i called my mother to go to my home and get my money to hire an attorney after wasting my life saving on 5k for a retainer was able to have my lawyer prove i didn't have a felony and dismissed the most serious charge. And he was able to reduce the bond to 10k 10% and i was free the next day after spending 30 days in jail and almost dying and further injuring myself for something I didn't do slash had the right to do according to Indiana's castle doctrine. She claimed she was just standing at the foot of my bed i got up grabbed a gun jammed it into her ribs and forced her out...yeah definitely not. But im a man she's a short but apparently violently strong woman. And im disabled..yes i have a long criminal history but mainly as a kid made stupid decisions but nothing this serious o havent even had a speeding ticket in years but as a kid i stole and was an idiot sure but she has 2 felonies one for bad checks and one for stabbing one of her ex husband's with a fork in the shoulder.. and i was arrested. Also i think what happened initially is dispatch ran my name and said i was a violent felon with a handgun is my guess and it tainted everything but ironically a few days prior they did a \"recovery\" where they return and verify that a gun is yours and give it back to you one of my guns was stolen and returned days prior by the same sheriff department. But now im poorer than poor and feel like something isn't right she came into my home without my permission while i was asleep regardless of assaulting me and almost killing me..and i think its even more serious since im disabled but im not for sure. But idk what to do my attorney just wanted to drag it out and i don't comprehend why she was arrested or why i was arrested for what i thought was my right to do. I mean what the hell..if i as a man did that to a her a woman ide be arrested...im so confused and im afraid that since im so poor i cant afford to properly prove my innocence..its unjust. I cant even afford to buy a car to go to my 5 plus Drs appointments every month let alone get justice. I wish i could afford a real attorney from Indianapolis because i feel like something isn't right between my lawyer and the court here..this should have been dropped and she should have been arrested.. yet here i am living in hell..  \n\nOnce again im really sorry for the Grammer and everything) also this is hypothetical for legal reasons not saying i did that or didn't.. idk what to do..im afraid my lifes still in jeopardy because it seems like something isn't right with all of this she should be in jail and i shouldn't be worried everyday.. idk i doubt i get anyone to read this but if you do thank you i don't have slot of friends or family to talk to about this and if i ask my attorney anything he always bitches at me and tells me to let him do his job.. something isn't right about this.. and im too poor to do anything about it idk what to do anymore",
    "title": "Woman broke into my home assaulted me and I was arrested..help",
    "subreddit": "MensRights",
    "timestamp": 1569595642,
    "score": 92,
    "keyword": "man nurse"
  },
  {
    "text": "International Women are Good Men Are Bad Day Hi ladies and  gents, if you live in the northern hemisphere you're probably still 'enjoying' the celebrations for International Women's Day. Now if this day was a celebration of women, motherhood, women's achievements, et cetera, I'd be enjoying it too, and have a glass of sparkling grape juice and a piece of cake.\n\n&#x200B;\n\nBut as a bigger, older school bully might say to you when you explain to her you need your lunch money, 'that's not how it works!'.\n\n&#x200B;\n\nIt's easy for men to celebrate women's achievements, and vice-versa, and at a superficial level that's not a zero sum game. However, when the tire hits the road, and we get into the real stuff like who gets the kids, who gets the university place, who gets the good job, and who gets a long prison sentence because their ex wants to say, 'yes, we did it like bunny rabbits for 5 years, but the last time was just horrible, I didn't want to and he should have known!', IT IS A ZERO SUM GAME To me, and my 'unconsciously biased' and 'white privileged' and 'arsehole and the cause of all human problems' eyes, feminism is not about equality, it is about increasingly advantaging group A (women) at the detriment of group B (men). And not a bit, crazy much. Don't get me wrong, most of this - except the kids bit - won't affect elite men and women, the top 5% can build their own businesses and make themselves the boss, feminism can't and won't attempt to influence this sort of thing. Their exes, who are likely also elites, will have too much to lose by making false claims and grueling through the justice process out for years, so they're unlikely to make them.\n\n&#x200B;\n\nSo selfish men in the top 5% of the income bracket, please stop reading now, enjoy your life, and forget about the enormous lifelong harms and disruptions injustly happening to other men.\n\n&#x200B;\n\nNow back to the point, IT IS A ZERO SUM GAME. It doesn't have to be - anyone who's had a good relationship with the opposite sex knows that. But as time goes on, I'm beginning to think the feminists who came after the Bolshevik revolution (so not the Suffragettes), were probably girls with pretty bad form sheets (several men, none who lasted) who always intended to create a zero sum game where women 'win' and men lose. Now of course, feminism clearly accepts the inevitable side effect of creating a zero sum game involving sex and/or marriage with the rules totally tilted against one player - the marriages don't last so well anymore. This is also not an accident, destabilizing marriage where monogamous, lifelong male female marriage becomes an exception rather than a norm was a primary goal of post Bolshevik feminism very early. You can see it in the Philippines - which is such an odd country as divorce is still illegal there - who is out there arguing for legalization of divorce? You got it, the women's rights movement. Philippines' divorce law is odd, as no other real country prohibits divorce, and I'm not actually defending the law - it seems outrageous to apply a Catholic standard of divorce for example to atheists, Muslims, or Episcopalians) - my point is, who's agitating for divorce? Feminists. Philippines is a valuable example because what we see is the progressive nature of feminism.\n\n&#x200B;\n\nFirst it's divorce, fine, that's gender neutral. Then it's no-fault divorce, well, fine, still gender neutral, although it causes massive spike in the divorce rate. But now the zero-sum part comes in - courts award custody of children to mothers, hey not so gender neutral, more zero-sum. Then, we've suddenly got a significant percentage of the population being divorced women with kids - hey the state needs to look after them. So there's welfare for single parents, again zero-sum with women 'winning' as they are the single parents. Now divorce is a cost-free option, because the state will carry the tab. Then UNMARRIED single mothers say, 'hey, what about me!', so now anyone who has a baby gets looked after by the state.\n\n&#x200B;\n\nI was once on a motorbike in Thailand. And a sad-looking, young-looking, not-pretty-looking Dutch woman came after me like a Cheetah wanting to mate with a Dachshund. All over me, wanting to come to my room. I must have friended her on Facebook or something, but did not go with her suggestion she come and stay in my room. A few years later I look on Facebook, sure enough a little white baby boy is born in Holland, sans-father. I don't blame this woman for having a baby, she was lonely and wanted one, and the Dutch state took care of the tab.\n\n&#x200B;\n\nSo that's one zero-sum game. But let's get now to couples, people who marry or are de-factos. If you live in any western country here's how it goes: You'd better forgive her for her occasional adulterous 'indiscretions' or 'you'll get what's coming to you'. If you've got kids, she'll get them - if you fight hard enough you'll get to see them, sometimes. She'll decide where they go to school, what they eat, wear, what out of school activities they do, what religion or no religion they follow, and how many boyfriends she brings back to meet them. If you have daughters, they will have the fortune of seeing and having modelled that women can have a 'healthy sexuality' as the wife leaves her husband and brings back a series of male lovers over a period of years.\n\n&#x200B;\n\nOh and of course, the money. Elites are a little bit different. But for the majority of the population, she'll get most of the assets - even if it was paid for by the husband's earnings. She'll also get a regular cut of your income - after all husbands should pay for the care of children they're denied to see, that's perfectly fair, isn't it?\n\n&#x200B;\n\nThen there's jobs. Got a profession like nursing or teaching predominantly female - that's fine. I went to a bank the other today and out of the 10 staff in the bank, 1 was male, the rest including manager and all seniors female. The lady Asian teller, who I'm normally very friendly with, got quite angry when I suggested it didn't look like the best bank branch for male job applicants. All deans of all faculties female (like RMIT University in Melbourne was), fine, most paediatric doctors female, fine. Too many senior board executives male - OH NO WE MUST FIX IT. Jobs predominantly male must have female quotas, jobs predominantly female should be left alone - ZERO SUM GAME people. Boy Scouts must allow girls, Girl Guides need not allow boys. I saw in the newspaper in Melbourne today that Geelong Grammar can discriminate and give scholarships only to girls. Does anyone reading this believe that any mixed private school in Melbourne would be given dispension to give scholarships only to boys?\n\n&#x200B;\n\nSo it's zero-sum game across the board: children, relationships, marriage, school, jobs...but let's get to the really good one, 'crimes against women and children'. So all this stuff I've mentioned above would still not keep down an entrepreneurial man who runs his own business. If he is his own boss, well, it's easy for him to hide income so his ex gets less - which would tend to press her to the negotiating table re: the kids - and he won't pass himself over for promotion because he is a man in his own business, so his own talent is his only limit. Now such a man might get uppity, and think he was equal with women, and go around doing a lot offensive male things like being assertive, picky about a women's sexual background and divorce history, and just being self-confident and living without fear.\n\n&#x200B;\n\nCan this really be tolerated? The feminists came up with the solution to that one too, let's change the law whenever a guy is charged with a crime against a woman - ie. the ex girlfriend who cries rape. Let's reveal his identity in the newspaper, but make hers protected upon penalty of contempt of court. Let's make him testify in open court, but let's let her testify remotely via video. Oh and if there's a hung jury, because some sexist jury member goes, 'oh wait, she was banging him the Tuesday before, and sexting, but how come she's saying rape on the Thursday?', guess what - she doesn't have to testify again, the court can just reply her recorded testimony. Oh yeah, and we can't ask her about her sexual history, or say that the fact, you know, she had sex with her boyfriend for years might mean it wasn't rape. I'm not making this stuff up - it differs from jurisdiction to jurisdiction, but there are a complete raft of these laws trying to engineer convictions. It often works, but not always. I spoke to a female former teacher of mine from University years ago, and she told me about a rape trial she was a jury member on. Finally the jury didn't convict because the 'victim' about an hour after her rape went and had sex with her boyfriend - the sexist jury didn't believe that a woman who was raped by her friend (not a cheating girlfriend, how dare you!) would go and then have sex with her boyfriend an hour later.\n\n&#x200B;\n\nThank God I've never had to deal with false charges brought against me - and let's face it, the system would grind to a halt if it started getting out of hand - but just the fear of false claim again is used to oppress and strike fear into the hearts of men. I'm not that worried by it, but mostly because I don't want to have flings with tarty looking girls with bad histories, and I think every man in his right mind would be aware of this and have some sort of risk management plan for it - this, itself, is fear.\n\n&#x200B;\n\nLook, I've gone on and on, and I could go on and on even further. But I won't. I would celebrate Women's Day if it wasn't for the fact that it's really, 'help women, harm men' day. It doesn't have to be like this, but it likely will continue to be so for the rest of our lives. In summation I have one point:\n\n&#x200B;\n\nFeminists realise their objective is a ZERO SUM GAME where there is a definite winner (women) and loser (men). Men and women who are not feminists need to realise the same thing, and the sooner the better.",
    "title": "International Women are Good Men Are Bad Day",
    "subreddit": "MensRights",
    "timestamp": 1552081689,
    "score": 67,
    "keyword": "man nurse"
  },
  {
    "text": "Cyntoia Brown has been released after 15 years for first degree murder. \nCyntoia Brown has just been released from prison. 15 years ago she was sentenced to life in prison for [first degree murder](https://www.usatoday.com/story/news/nation/2019/08/07/cyntoia-brown-released-nashville-prison-after-serving-15-years/1941329001/)\n\nHer release has been campaigned for by social justice activists for any years. She claims to have killed in self defense, however, the facts don't match up to this. Take a look at [the case](https://en.wikipedia.org/wiki/Cyntoia_Brown)\n\n> Based on the position in which Allen's body was discovered, investigators believed that Allen may have been asleep when he was shot. Forensics noted that, postmortem, Allen was laying with his hands underneath his head\n\n>According to court documents, Brown threatened a jail nurse prior to her trial, stating \"I shot that man in the back of the head one time, bitch, I’m gonna shoot you in the back of the head three times. I’d love to hear your blood splatter on the wall.” A recording of a phone call she made to her adopted mother while in jail was also presented as further evidence against Brown, in the conversation she stated of the victim \"I executed him\". Further still, a fellow inmate testified that Brown had confessed to killing Allen \"just to see how it felt to kill somebody.\"\n\nThe activists fighting for her release know this (at least the main organizers, the celebrity endorsers probably don), and ywet they campaigned anyway. \n\nThis is female privilege. A man who murdered a woman would never be released early, and there would never be campaigns for him. To me this is very scary- this is an early step in what amounts to a quasi-legalization of one gender murdering another. Even though the evidence is very clearly in one direction, campaigners right and win for her to be released. A man would never be released after murdering a woman.",
    "title": "Cyntoia Brown has been released after 15 years for first degree murder.",
    "subreddit": "MensRights",
    "timestamp": 1565247131,
    "score": 29,
    "keyword": "man nurse"
  },
  {
    "text": "Help: Counter Responses Needed to examples of \"Male Privilege\" A few months ago, I came across a list of 160+ examples of \"male privilege\" from a site, Everyday Feminism. After reading it, it quickly became apparent that a lot of it was a bunch of nonsense, either deliberately cherry-picking or using narrow data (as if they were living in a bubble) such as \"men are less likely to be murdered by a partner\" but according to the data given by the United Nations Office on Drugs and Crime, worldwide, 78.7% of homicide victims are men.  So as a man, I am far more likely to be murdered over all, yet somehow I'm the \"privileged\" one and women are the oppressed ones??? How many Feminists would like to trade that \"privilege\" with men? I bet not a single one would.\n\nThe list was so full of nonsense I was compelled to start making responses to counter every single on of them, which turned out to be unbelievably easy and I've already refuted over 100 of them.\n\nHowever, there were a handful of pointers that I have trouble responding to. It's with these last ones I need help putting together counter responses to. **Any help would be much appreciated. Please stick to responding specifically to the points given below instead of going off road, like asking \"was X on the list\" or arguing \"women have more # of privileges overall than men.\"** (I'm not saying that they don't, I just want to stick on point and finish countering this 160+ list. But if a specific female privilege can over-rule or even-out an example given below, feel free to include it and argue why)\n\nHere's the list:\n\n1. Perceptions of how much your gender is represented[ skew in your favor](http://www.dailydot.com/opinion/all-female-ghostbusters-backlash-male-tears/). When a group is comprised of 17% women, men think it’s 50-50, and at 33%, men believe women are the majority.\n2. You can forgo regular grooming during travel, like growing a[ “backpacker’s beard,”](http://matadornetwork.com/life/6-things-traveling-women-deal-traveling-men-dont/) without people judging you for not keeping up with your gender’s expectations, like women shaving their legs.\n3. You can get praise for ordinary parental duties or for being a single father, while mothers are simply expected to do the same and even[ criticized for single motherhood](http://everydayfeminism.com/2014/08/single-parent-double-standard/).\n4. You’re not said to be going against your gender’s “natural instinct” or your role in society by not having children.\n5. If you’re in a relationship with someone of another gender, you’re not expected to[ do more emotional labor](http://www.slate.com/articles/double_x/doublex/2015/12/the_year_we_wondered_if_emotional_labor_should_come_with_a_price.html) in the relationship.\n6. For diseases that affect your gender more, you don’t have to[ face skepticism](http://www.scientificamerican.com/article/fibromyalgia-maligned-misunderstood-and-finally-treatable/?&wt.mc_id=sa_hlth_20140528) about whether or not it’s a “real disease,” like women with conditions like fibromyalgia and chronic fatigue do.\n7. You’re less likely to have[ mental health issues dismissed](http://www.ncbi.nlm.nih.gov/pmc/articles/pmc3480686/) as being “hysterical” or “oversensitive.”\n8. Fiction can depict the everyday, mundane lives of people of your gender without being labeled as “men’s fiction” and taken less seriously than so-called “real” literature – like[ “women’s fiction” and “chick lit.”](http://www.theguardian.com/books/booksblog/2014/may/16/women-fiction-sign-sexist-book-industry)\n9. People of your gender in the media can age[ naturally without scrutiny](http://mic.com/articles/135131/gillian-anderson-just-tore-apart-the-tabloid-that-age-shamed-her#.BRcpxgyvW), even being said to get “finer with age.” Women in industries like modeling, acting, and TV journalism are more likely to be pushed out of their careers as they age.\n10. Your gender is[ more represented in the documentary industry](http://variety.com/2016/film/news/gender-bias-documentary-industry-1201708404/), with people more likely to trust men with documentaries and give them funding, resources, and recognition for their projects.\n11. A political candidate of your gender won’t be penalized by the idea that they can’t balance both family life and public office.\n12. You can make choices to have both career and family without people[ assuming it’s a challenge](http://www.huffingtonpost.com/2015/06/11/kirsten-gillibrand-women-debate_n_7561684.html) or an unusual achievement for you to “have it all.”\n13. If you choose to have children, you’re not questioned about how having a family would hurt your ability to do your job.\n14. You’re not stereotyped at work as not belonging in higher paid roles, like being mistaken for the nurse if you’re the doctor, or for a secretary when you’re a lawyer.\n15. You’re[ not stuck between](http://everydayfeminism.com/2015/09/judging-dependent-women/) the stereotype of your gender being dependent on a partner and the shame directed at women who choose to be or have to be.\n16. You’re more likely to have[ your work cited](http://host.madison.com/ct/news/local/education/university/womenalsoknowstuff-is-a-handy-list-of-experts-including-several-from/article_14614c91-576a-5be5-b3af-161da1ad614a.html) in journalism and political science. Women experts are cited so rarely that some political scientists created[ Women Also Know Stuff](https://womenalsoknowstuff.wordpress.com/) to encourage people to also include the expertise of women.\n17. You’re less likely to have people justify not hiring people of your gender with the belief that there are simply[ “no qualified candidates”](http://www.huffingtonpost.com/entry/qualified-women-board-members-survey_us_56c35030e4b08ffac1268df5) of your gender in the field.\n18. You’re less likely to have clients and colleagues ask someone of another gender a question that should’ve been directed to you.[ In one survey,](http://motto.time.com/4226297/silicon-valley-gender-discrimination-data-elephant-in-the-vallet/) 88% of senior-level women in Silicon Valley reported this happening.\n19. People give you toys that are[ more likely to be educational](http://everydayfeminism.com/2015/04/girls-vs-boys-toys/), to develop a range of skills, and to let you imagine a range of career possibilities – while toys considered “girls’ toys” are often limited to beauty,[ housework and childcare](http://everydayfeminism.com/2015/04/girls-vs-boys-toys/).\n20. [School dress codes](http://everydayfeminism.com/2014/12/school-dress-code-myths/) don’t suggest that your body is inherently shameful or unprofessional, unlike girls who are told that it’s up to them to cover up.\n21. Your grades don’t depend on your appearance –[ studies show](http://www.npr.org/sections/ed/2016/01/14/462135458/pretty-girls-make-higher-grades) that girls are given higher grades based on physical attractiveness, reinforcing that their value is in their looks, not their brains.\n22. You get more[ “esteem building” rewards](https://www.narst.org/publications/research/gender.cfm) in school, like being called on first even when you’re not raising your hand.\n23. Your energetic behavior and creative energy is encouraged or dismissed with phrases like “boys will be boys.” Girls are taught to be[ “lady-like,”](http://everydayfeminism.com/2014/09/4-reasons-never-to-tell-your-daughters-to-be-ladylike/) which includes being more reserved and less outspoken.\n24. Academic resources are[ more likely to cite](https://www.washingtonpost.com/news/monkey-cage/wp/2016/02/11/heres-a-list-of-smart-women-political-scientists-they-know-stuff-too/) the work of people of your gender.\n25. If you’re in college, you’re more likely to be[ judged as knowledgeable](http://feministing.com/2016/02/17/study-finds-male-undergrads-assume-other-men-are-the-most-knowledgeable-in-class/) by your peers.\n26. If you’re in college, you’re more likely to have[ professors respond to your inquiries](https://www.insidehighered.com/news/2014/04/24/study-finds-faculty-members-are-more-likely-respond-white-males-others), especially if you’re white.\n27. At school, you can learn about your gender’s contributions to the world without needing extra electives or men’s studies departments to be included in the curriculum.\n\nThat's all.",
    "title": "Help: Counter Responses Needed to examples of \"Male Privilege\"",
    "subreddit": "MensRights",
    "timestamp": 1572811114,
    "score": 18,
    "keyword": "man nurse"
  }
]