[
  {
    "text": "Too old to learn? [Discussion] So I'll cut to the chase. I'm 26 and have been applying for apprenticeships in Mechanical Engineering.\n\nAnd it's going terribly. \n\nI called a seriously promising lead that I was qualified for and the first question was \"How old are you?\". Thinking I still have around 40 years of working life left, I was honest. It got left with them whilst she contacted the Engineering manager.\n\nA week passes and she calls back this morning. \"Wouldn't fit the dynamic of the team due to age\".\n\nAt 26.\n\nShe then goes on to tell me that the government has funded 16-21 year old apprenticeships quite signigicantly at the moment, so even if I was 22 I'd still be a crochety old man stuck doing things 'the old way' in their eyes. Essentially, the likelihood of me getting an apprenticeship is pretty much nil at this point.\n\nSo aside from my ranting, has anyone else experienced a similar sort of hurdle whilst job hunting?",
    "title": "Too old to learn? [Discussion]",
    "subreddit": "jobs",
    "timestamp": 1510049881,
    "score": 11,
    "keyword": "man engineer"
  },
  {
    "text": "Sharing a simple job search strategy that I think the vast majority of job searchers would benefit from Job searching is one of the most miserable activities known to man. I believe this strategy is more effective and less painful for a few reasons, notably that: it makes excellent use of your personal network and generates warm introductions; it allows you to hone and practice your sales/pitch/interview skills constantly; and it provides frequent opportunities for encouragement and self-affirming interactions. These are all rare perks in most job searches.\n \nI am not a career consultant or interview coach or recruiter. I am sharing as someone that has conducted several successful job searches on my own behalf, as someone who has hired and fired people, and as a former executive coach that has had a front row seat in many, many searches. In the last year I’ve also had a front row seat to the job searches of several very close friends as well as my spouse. \n \nI am not suggesting this is the best or only job search strategy, but if I had to bet all my marbles, personally, this is the way I would go. I am writing it down here in case you find it helpful. You can decide for yourself if it makes sense and you want to try it.\n \nAt a high level, this strategy is based off a technique from venture fundraising (I am CEO of a company that has raised capital from investors). In venture fundraising we say, “Ask for money and you'll get advice. Ask for advice and you'll get money.”\n \n> You can think of this strategy as the analog: *“Ask for a job and you'll get advice. Ask for advice and you'll get a job.*\n \nThe strategy goes like this:\n \n1. Make a list of contacts. These are people who have relevant skills, experience or network for your search and who like you enough to help.\n \n2. Email your contacts to ask for a 20-minute call or coffee date to get their advice and feedback. \n \n3. Meet them, describe your value proposition to employers, your skill set and your job search strategy. Let them react, and ask for advice and feedback.\n \n4. Before you finish the conversation, ask for at least one introduction for the purpose of further advice, feedback and brainstorming. (Do NOT if they know of job opportunities.)\n \n5. Repeat steps 2-4, continuously expanding your web.\n\n6. Follow up every 1-2 weeks with each contact on your list, to stay top of mind.\n \n7. You will get warm introductions as opportunities come across your network’s radar, moving you to the top of the pile immediately as jobs become available.\n \nAs you execute these steps, you're building an ever-expanding network of people who are now enlisted in helping with your job search. \n \nAs part of the conversation (step no. 3), you are actively pitching each person on your value, but you’re sneakily doing it under the pretense of getting feedback. People’s walls will come down and you’ll activate their desire to help. (I recently learned that this is one of the 8 core needs in Maslow’s hierarchy -- no joke.)\n \nEventually you will get introduced to someone who hires you.\n \nI know that the devil is in the details so if you want more details, keep reading. I’ve broken down the steps using a hypothetical example and provide some example emails and exact wordings you can use. However, remember that copying other people’s language is a good way to sound like a robot, so make sure to make these your own.\n \n****************\n\n**Step 1: Make a list of contacts**\n \nThe heart of your strategy is to build a network of people who are thinking about you and your job search, so you'll need a way to keep track of all these people.\n \nInclude column headings for:\n \n> Name - Jane McDougal\n \n> Organization - High Flying Avionics\n \n> Email - jane.mcdougal@hfavionics.com\n \n> Phone number - 212-867-5309\n \n> Who introduced you - [blank if she is your contact]\n \n> Action required - Yes\n \n> Next action - initial email\n \n> Notes - [none yet]\n \n**Step 2: Write an email requesting a phone call or coffee**\n \nHere's a template you can use:\n \n> Subject: Advice?\n \n> Hi Jane,\n \n> I hope all is well!\n \n> [As you know] I’m exploring new career opportunities [in avionics industry] and was wondering if you'd be up for a call [or coffee] in the next week or two. I would love some advice on my strategy and positioning, and, if you don't mind, maybe some ideas on people to connect with.\n \n> Thanks so much. If workable for you, I'm available [time block 1] or [time block 2].\n \n> Best,\n> [YOU]\n \nYou can change this template as you like, but keep in mind the principles at work here:\n* Concise: gets to the point quickly\n* Request is clear -- they know exactly what they're signing up for\n* Focuses on your desire for advice while getting their wheels turning on other contacts for you\n* Let's them know the type of advice you want so that they feel confident they can provide it (and not waste either of your time)\n* Provides scheduling options to reduce back and forth\n \nYou might also notice that the request is passive: there is no question mark. (\"Can we talk?\" vs \"I was wondering if we could talk.\") This is intentional. The passive request doesn't make the other person feel put on the spot for a reply and therefore makes them feel a greater sense of choice and autonomy in offering support.\n \n**Step 3: Conduct the meeting**\n \nI suggest approaching the meeting as follows:\n \n* Get connected. Depending on your relationship with Jane and your cultural context, this could take 30 seconds or 30 minutes. The point is, be human.\n \n* Get down to business. After you get connected, make a decisive and clear pivot to talk business. Don't let the conversation wander or avoid the topic. Jane signed up to help and it's your job to honor that contract. You can segue by saying, \"OK, so let me tell you about what's going on.\" Jane may do this for you by saying, \"OK, so tell me what's going on.\"\n \n* Set the agenda. Explain: \"Let me tell you about what I'm looking for and how I'm going about that. I'd love your input on both my approach as well as how I'm positioning myself.\"\n \n* Share your value proposition. Talk about what you're great at and what kind of value you believe you can provide. (You're doing this in the context of getting feedback, but notice how you've created an opportunity to pitch yourself!) IMPORTANT: Be prepared with a clear and compelling pitch. Ideally, Jane walks away with an unforgettable snapshot of the value you can provide, so that as soon as she learns of a good opportunity she will think of you. When you're done sharing, ask for input: \"What are your thoughts? How can I improve my pitch?\"\n \n* Share your job search strategy. Explain how you're focusing on warm introductions and meeting great people in the field, because you never know who is hiring. Ask: \"What do you think? Does that make sense?\" Most of the time Jane will affirm your approach.\nGet new contacts - Jane may offer you an introduction or two without being asked. If not, and if it feels appropriate, you can go ahead and say, \"Would you mind thinking of one or two people in your network who might also have advice and ideas for me?\" Notice how you're not asking Jane who is hiring (she probably won't be able to think of anyone) -- you're just asking for people with advice and ideas (which everyone has). This makes it much, MUCH easier for Jane, who provides a few names: Lamar Garvey and Samantha Marshall.\n \n* Write down the names, say thanks and let them know you'll follow up. Tell Jane that you'll send her an email that she can forward to Lamar and Samantha.\n \n*Let me expand a little on the idea of sharing your value proposition.*\n \nInside your head, it might be very clear what you do, what you’re good at, what you’re looking for, and so on. But other people are not. They need a “handle” of sorts, an extremely simple and memorable way to think of you vis-a-vis job search.\n \nTo that end, I suggest coming up with a few assets:\n \n* A pithy job search headline. E.g. “Embedded systems engineer passionate about avionics.” You should use this early and often, modifying it slightly so you sound human. \n \n* Three to five key selling messages with stories. You need a little meat on the bone for these conversations, but you don’t want to wing it. You want to make sure you hit the most important messages, and stories is the best way to do so. \n \n(What do I mean by a story? When I talk about my passion for great workplaces, I talk about the time I was 23 and bought some hip new shoes but wasn’t sure I could wear them on casual Fridays because they had white soles. I never forgot because I was so excited to show them off but was stressed enough that I didn’t wear them. This story brings home the idea that I’m passionate about people feeling safe at work in a few sentences. That’s what you want -- to reinforce your key points with a quick story or non-hypothetical example.)\n \n**Step 4: Follow up to facilitate the introductions**\n \nIntroductions are sensitive territory. If the introduction breaks down at any point it reflects badly on everyone. For that reason you need to pro-actively manage this part of the process.\n \nHere's an email template you can use:\n \n> Subject: [Your name] intro to Lamar O’Donnell\n \n> Hi Jane,\n \n> Per our discussion I’d love to connect with Lamar O’Donnell to get his advice. [Add a human and non-transactional reason why, e.g. “Based on your description it sounds like we’d hit it off, and given his sales experience I thought he might have some pointers on how I describe my value, too.”]\n \n> As context (feel free to forward this to Marty directly if helpful), I’m a lifelong software engineer with a passion for all things flying and avionics. I have 20 years experience in embedded systems (Motorola, Intel) and a burgeoning web development skill set. My LinkedIn, if helpful, is http://linkedin.com/yourname.\n \n> Thanks!\n> YOU\n \nThis makes it easy for Jane to forward the email, add a short note, and wait for Lamar and Samantha to reply. Then she can just copy you in on the thread and be finished.\n \nNow, you should add Lamar and Samantha to your list, and keep the ball rolling.\n \n****************\n\n**A few thoughts on why this approach works**\n \nIt’s a big deal to commit whole hog to a new job search strategy (you can only do so much, I understand). So, these are some of the reasons why the strategy works, and why you might consider giving it a try.\n \n**1. People want to help**\n \nPeople can relate to the sucky-ness of a job search. Saying that you're looking will activate the \"helper\" gene that lives inside so many people. If you're not asking your network for help, you're snubbing a whole bunch of people who could feel good because they helped.\n \nAlso, according to Abraham Maslow’s research, one of our 8 core needs is called Transcendence, the need to help others achieve their potential. You are tapping into a universal need here -- pretty neat.\n \n**2. Your request for advice is flattering**\n \nWhen you send out your initial email requesting some time and advice, your ask is flattering: you want their advice. People like to give advice because it suggests that who they are is valuable.\n \nBy the way, people may offer connections for the same reason: their network reflects well on them, so they will want to impress you with who they know by offering those contacts to you.\n \n**3. Your ask is small and clear**\n \nPeople are also much more likely to say \"yes\" to a request when they feel that the boundaries of their \"yes\" are clear. There is no slippery slope. Your request is for time and advice, and possible ideas on further connections. That is a clear boundary so easy to say yes to.\n \n**4. You get to pitch your value to everyone you meet**\n \nYou're pitching yourself at every meeting, except normally being pitched makes people resist. In your case, they're just listening to as to provide feedback, which has the opposite effect: they're listening more closely.\n \nThe process of providing the feedback will help them internalize and remember your pitch, as they will begin to get their fingerprints on it and take ownership of it. Now they can more easily think of you and advocate for you to others.\n \n**5. Making requests in person is 34 times more effective**\n \nMost people think an email request is about as effective as one made in person, but requests made in person are 34 times more effective (!!!). This strategy gets you face to face before you ask for introductions, dramatically improving your odds of getting access to valuable new contacts.\n \nHere’s a Harvard Business Review about this. \nhttps://hbr.org/2017/04/a-face-to-face-request-is-34-times-more-successful-than-an-email\n \n**6. Every opportunity has a warm introduction**\n \nUsing this strategy, everyone you meet is through a warm introduction. You can bet that everyone who ever posted a job online would rather meet a candidate through a warm introduction than an online portal.\n \n**7. Going through your network will improve culture/values fit**\n \nPeople you get along with are more likely to know other people you'll get along with. By meeting people through your network, you increase the chances that the hiring manager at the end of the chain is someone you'll also get along with.\n \n**Bonus: Get positive affirmation and build momentum as you go**\n \nThis human-to-human approach will provide numerous opportunities to be acknowledged for your value. As you solicit feedback on your pitch, each of your contacts will help you dig for the gold in your experience and continuously reframe yourself in an ever-more positive light. Each introduction becomes an opportunity for acknowledgement, as your contact seek to enlist their own contacts in spending time with you.\n \nGetting positive affirmation is NOT superficial -- it is an important and necessary part of building and sustaining momentum during your job search. Embrace and enjoy it.\n \n****************\n\n**To sum up, here’s what you need to execute this strategy**\n \n* Tracking spreadsheet (I like Google sheets or Airtable)\n* Initial outreach email template\n* Followup email template\n* A pithy headline for your job search\n* 3-5 key selling messages, each one with a story to illustrate\n \nAgain I am not an expert but if you have questions on this technique I’m glad to discuss in the thread.",
    "title": "Sharing a simple job search strategy that I think the vast majority of job searchers would benefit from",
    "subreddit": "jobs",
    "timestamp": 1495736627,
    "score": 8,
    "keyword": "man engineer"
  },
  {
    "text": "Victory Screech I'm Happily Unemployed Again! I knew I was going to leave, because it was simply a summer internship but man am I glad I'm finally done. \n\nI worked as an environmental engineering intern at a small engineering company near where I've grown up my whole life. I changed my major back in march away from engineering and more towards design and sustainability. However, I didn't need any type of engineering experience for this job. \n\nI became a construction worker this summer (nothing against the field, I'm just a small weak fragile girl) and it changed me as a person. I cried so many times on a particularly mess of a job site. I hated the job and spent my time testing concrete, soil testing (my favorite part of the job) or typing reports. \n\nMy last report before I could leave had been a three week long process. A document of 1300 pages on an old ammunition plant to be turned into a business park. Three weeks of assembly and typing and having to hunt down files from the 40s and up. \n\nI learned a lot of things from this job. Don't chose your career over your family. My boss makes millions a year and never left his office until 8pm everyday. His family never saw him. Went on vacations without him. I never want to be that person. \n\nI also learned how to drive a truck. (I got it stuck in a few holes but got pulled out by construction workers) I drive a small 2015 Kia Forte and have been scared of large trucks like ford 250s because of their size and crushing power. Now I can drive a 250 through downtown traffic, around construction sites even once through 2 feet tall grass. \n\nNow to figure out if I have time for an on campus job when I return to school in 3 weeks.",
    "title": "Victory Screech I'm Happily Unemployed Again!",
    "subreddit": "jobs",
    "timestamp": 1500734529,
    "score": 6,
    "keyword": "man engineer"
  },
  {
    "text": "What to wear? I have an interview tomorrow with a large EPC (engineering procurement and contruction) company. I haven't had many interviews as I've always know the person directly hiring me or have taken a job through a union.\n\nI didn't apply for the job I am interviewing for. A former boss of mine now works at this company and passed my resume / name to the projector director recommending me for the position.\n\nI've never met the man that will be interviewing me, and I don't want to \"over due\" it. I work and will work in field construction. Is my everyday flame resistant clothing (jeans/shirt/steel toe boots) appropriate? Nothing is tattered or torn. My FRC clothing is in great condition in addition to being starch/pressed.\n\nOr should I opt for a sport coat / tie with nice jeans? Or slacks?\n\nEither way I won't need to buy anything. I simply don't want to over dress. I haven't spent much time in a corporate setting or office (location of interview) and not too sure what to expect.",
    "title": "What to wear?",
    "subreddit": "jobs",
    "timestamp": 1494331829,
    "score": 6,
    "keyword": "man engineer"
  },
  {
    "text": "Payed internships in Sydney as a Software Developer? Hi there, \n\nI'm a german man, 24 years old and a software developer. at the start of September I'm going for 1 year to Australia/Sydney.\nI've a bachelor degree in software engineering and 2 years of work experience in .NET, C++ and Java. My side projects are mostly based on Android.\n\nMy goal is to work for ~ 6 month as a Software developer in Sydney. I'm currently looking for a job but it's hard to find one, because of the short time range. So my idea was to do a paid internship. I have already applied to google for the summer internship. But they have not replied yet.\n\nSo my question are: \n\nAre there any other companies in Sydney which offer paid internships? \n\nOr do you have some other alternatives/ideas?\n\nThanks for your help :).",
    "title": "Payed internships in Sydney as a Software Developer?",
    "subreddit": "jobs",
    "timestamp": 1497789333,
    "score": 7,
    "keyword": "man engineer"
  },
  {
    "text": "Stay in excellent job or go back to live in my own country? I am in a very big dilemma right now. I have to choose between staying in my current job in Netherlands and become a wealthy man or going back to my own country and stay with my family(and not be so wealthy).\n\n**Background:**\n\nA bit of a background, I come from a south asian (pakistan,india,bangladesh) country where I lived with my family. I live with my mom, brother and little sister. I am 28 years old and not married. I am responsible for the finances of my house. So i pay for everything, including the college fee of my brother and sister and daily expenses such as food, electricity, rent etc. The college fee is done now as they are both in their last semester. Although, I will still be responsible for our daily expenses.\n\nI recently went to the Netherlands and studied there for two years. I got a degree and even found a really nice job.\n\nI have two options to choose from:\n\n**Option 1: Stay at my current Job in Netherlands**\n\nI have a really nice job in the Netherlands. There is such a big difference in the working conditions that I don't think I can work as a software engineer when I come back home.\n\nMy one month's salary in Netherlands is equal to my 3-4 months salary in my own country. In fact the difference in salary is so big that I dont think I can work as a software engineer when I go back home. It will just feel wrong to me to do the same type of work for 1/4th of the money.\n\nAlmost all companies treat you like a human in the Netherlands. They have really nice laws about employment law. I don't have to work overtime and even if I do work overtime, I will be paid for the overtime. This is not the case in my own country. In my country they expect you to work overtime and think you are not motivated if you refuse. And they will never pay you for overtime.\n\nIn the Netherlands you can be on sick leave for a maximum of two years and still get paid salary. Though it is not so common to be sick for so long but it is really comforting to know. In my country they start deducting your holidays when you are sick. And when all of your holidays are gone then they start deducting your salary. And if you dont show up after two months then there is a big chance you will be let go.\n\nBesides my job, I have other benefits in the Netherlands. I have been on so many dates in the Netherlands which was not so easy in my country. Online dating is still non-existent in my country. I currently have a girlfriend in the Netherlands. I feel really free and independent in terms of dating. I can go to anyone's house and invite any girl in my own house \nI also have nice public transport, online shopping for almost all video games, books, clothes etc. \nI have a really nice gym. The only career i can think of having when I go back is do my own business.\n\n**Option 2: Go back to my home country and live with my family**\n\nI mentioned a lot of really nice things in the first option but I really miss my family and my country's food. My mom is always very sad when my holidays are up and I have to go back. She is always crying when I leave. She said that I can stay in the Netherlands for as long as I want but she is happy when I am around. My little sister also misses me. She told me that I should come back next year. She is going to be married in a few years then I wont be able to see her so often. When I am in the Netherlands I have to do everything by myself. But when I am in my own country then my mom takes care of the cooking. We have a maid for cleaning. My brother takes care of all of the groceries. I can go out and buy my country's snacks, street food everyday. I can eat my own food everyday.  \n\nRegarding finances, i will have around 20k of savings by next year. What is your opinion?",
    "title": "Stay in excellent job or go back to live in my own country?",
    "subreddit": "jobs",
    "timestamp": 1492273810,
    "score": 5,
    "keyword": "man engineer"
  },
  {
    "text": "Please help me help my brother. Hes had a rough 6 years and is struggling with depression. My(24M) brother(25M) has been in and out of jobs since he dropped out of college 6 years ago. Hes been looking for jobs by applying and giving resumes to places and that got him nowhere, so he went to a place called Man-can(?) to get help about 2 years ago. They were able to get him a job after a year at a concrete pouring place, and with the money he made, he was able to move out from my parents house. But now hes laid off from that place and he doesn't know what to do. I worry about him because he struggles with depression and he tells me things like hes not even happy playing video games anymore. \n\nI have talked to him several times about staying positive and trying different places, and other options, but he just gets frustrated when I talk to him. I don't want to sound pretentious, but I think he doesnt like to listen to me because I have a job as an engineer right now, and he hates that Im doing well while he is suffering. \n\nI need some advice about what I should do to help him. Should I still be giving him advice that he may or may not listen to? Or should I be finding people to talk to him like a career counselor or something?\n\nTL;DR: Depressed brother cant get a job, wont listen to me. What should I do?",
    "title": "Please help me help my brother. Hes had a rough 6 years and is struggling with depression.",
    "subreddit": "jobs",
    "timestamp": 1484114961,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "As a soon to be 27 year old male, who has a Bachelors degree in Political Science, and soon to have an Associates in Homeland Security, how do I acquire a job? Dont really know what Im doing. Edit: Sorry again for the giant rant blog post. I dont even know if this was the right subreddit to even post this too, or even if I should've posted this at all. Just kinda spontaneously happened\n\nHonestly, I dont think posting this question will really do me any good and all, mainly because of my own incompetence, but I figured I have all the free time in the world so I dont think it could hurt to try.\n\nIm 26 soon to be 27 year old male who has lived with my parents all my life. I graduated with a Bachelors in Political Science at the age of 22, so I figured I was on track and on time to living a normal life like everybody else. I dont actually care for the subject I majored in. It was just my parents always told me that having a college degree is better than not having a degree, so I went off to college and became the first one in my family to get a degree, or at least a Bachelors I think. I figured I was never going to have the intelligence/will/skill/enthusiasm to be something like a Doctor/Engineer/Businessman, but I also figured Political Science wasn't on the bottom tier like Underwater Basketweaving or something like that. Figured I had chosen a decent middle of the road major. \n\nI wasnt an honor roll student during the time at the 4 year college I went to, but I think I am at the community college Im currently going to to obtain my Associates in Homeland Security, though I dont think that really counts since I take a low amount of classes each semester, though I will be having the Associates by the end of this December I think.\n\nAnyways after I got the Bachelors, my father would look online for Jobs for me, since I have not even the slightest clue on how to look for jobs. I figured it would make more sense for my parents to look since they have all the life experience and are responsible adults who've already done this. Couldnt really find anything for 6 months. \n\nThen my only real life friend who I still have in close proximity told me to come work with him at Giant Grocery Store. My parents told me its better to have SOMETHING on my resume, to show that Im willing to work, even if it is just at a grocery store. To show that Im not sitting on my ass all the time. So I work their for 1.5 years, simply as a Salad Bar Clerk. Had no problems with the job at all, I liked the people there, figured it could always be much worse. I had perfect attendance there, while everybody else in my Department would call out sick every other week. I was hired part time, but they eventually pushed my hours beyond 40, even though I still wasnt considered full time. I didnt really want more hours, all I wanted was to just have something on my resume saying that I didnt sit on my ass all the time. Figured it was kinda an interesting *problem* since every other worker in the store would complain about a lack of hours, while they kept increasing mine. Whenever my managers would ask me to stay later for whatever reason, I never declined, even if I didnt want to, because I figured I got nothing better to do, and Im a complete beta male who can't really say no.\n\n Heck, I remember we hired this 1 foreign chick who couldnt really speak or understand english, yet was supposed to close the Salad Bar on her first day of work, which I knew there was no way in hell I could successfully teach her verbally and I would get off work earlier than her, so she will inevitably screw up and then make us be behind the next day, so I decided to come in on my own time off the clock and stay with her for 2-3 hours closing the salad bar with her just to have an on the job first hand understanding on what to do. Luckily my manager saw this and thanked me. \n\nSo anyways I eventually put in my 2 weeks, because I wasnt sure if working there was actually helping me find a government job or not. I figured if this wasnt helping, maybe I needed more schooling? Maybe I majored in something bottom tier and I was just too stupid to know better? My managers seemed to try really hard to make me not quit, since they knew they could rely on me to consistently do what I've been doing. Which by the way, I wasn't even remotely close to the best in the Salad Bar. My superior was this lady who was like 10 times more productive than me, but I still felt appreciated even when I clearly wasnt the best. They even gave me a cake when I left. (Though I have no idea if thats standard operating procedure and Im just reading too much into it and hyping myself up because of my ignorance)\n\nAnyways, I put in an application for the TSA. I passed all their tests and then got invited for an interview. I failed the interview for some reason. They dont tell you why. Which really bummed me out. I figured if I never know what I did wrong I could never improve myself. So I was really starting to get sad. \n\nI think I graduated from Salisbury in Maryland in 2013. Then late 2013 started to work at Giant for 1.5 years and then left during 2015.\n\nEver since 2015, I havent worked anywhere. My parents have tried putting applications in whatever they could find, though an overwhelming amount of them require much more education than I currently have, and something required me to have been an honor roll student, or various other things. By the way, this is just what my parents have told me, I have never actually looked for a job myself, because I cannot even begin to formulate a thought on how to start. My logic is my parents would know better than me. \n\nI think this is where I should say my parents are the greatest parents in the world, I dont even need to know any of you or anybody else to make such a declaration. I dont think my parents are rich, but I think they are definitely above middle class I think. Im not sure really. Dad said he might close to 6 figures and Mom made much less than that, but for a family of 3 that seems pretty good to me, my apologies if I really have no clue to what the answer is, I think I've lived a sheltered life, well, at least since highschool and beyond, no idea how to make friends anymore, since all the ones I had in Elementary school and Middle school have moved to other states and such. So much easier as a kid, so I basically stay inside my room all the time. I mean I've pretty much never had to do chores around the house! Like ever! I've barely ever taken out the trash, wash dishes or clothes, vacuum, etc etc the entire course of my life so far. They dont even complain about me! I ask them all the time if it was better if I just went somewhere else to not be a parasite on them anymore but they always tell me its okay dont worry about it. My Dad always tells me its not my fault, its just the bad economy or something, though I personally dont believe that. I think its clearly something wrong with me. I just wish I had a \"How to figure out Life\" guide or something\n\nHell as Im typing this I cant help but think how damn lucky I am to have parents like this. I make sure to not act like a brat, and whenever they tell me to do something for them, Ill certainly do it. But anyways, I think I've been getting off track and sadly this seems more like a blog post or something so now I think Im starting to regret even typing this out because now it might seem cringey as fuck or something, which it probably is. Im basically admitting Im just a giant man child\n\nSo ever since leaving Giant, I havent found a job. I dont know if I should just give up on even thinking about getting a gov job. Maybe I should go back to working at Giant? Or somewhere else? I have no idea. I know my Dad would say maybe working at Giant is not so bad since maybe you could work your way up and do some security stuff, i dont know. \n\nIn reflection, I really dont think I have any skills worth a damn. I know Im somebody who will never miss a day of work. Hell I had perfect attendance in middle school and got an award for it which made me feel special. But when I look on Facebook at all the buddies I used to know, people who never had opportunity like me, who never had amazing parents like I had, who never even went to college like me somehow have their life in order. People who from what I assume to be self sufficient individuals who have figured out their formula for life. I just get some damn jealous. \n\nWell, thats all I can think of at the moment. Im sure theres some more important information I could've listed. But frankly Im already embarrassed as hell that I somehow made some ridiculous blog post. But at this point. I think Ill take some hits to my ego just for some advice. It doesnt have to be good or anything, Im sure there are plenty of people worse off than me or something, but if you dont mind, Id like to know what I should do. Should I just find some random private sector job and start working immediately? Just to continue building the resume? Surely its better than me not doing anything at all for the past 2 years",
    "title": "As a soon to be 27 year old male, who has a Bachelors degree in Political Science, and soon to have an Associates in Homeland Security, how do I acquire a job? Dont really know what Im doing.",
    "subreddit": "jobs",
    "timestamp": 1504210530,
    "score": 4,
    "keyword": "man engineer"
  },
  {
    "text": "Find job in Frankfurt in English/Portuguese Language. I am a 20 years old man, and I will move to Frankfurt for a year in the beginning of  July 2017, during that time I will have already bachelor in mechanical engineer.\n\nMy native language is Portuguese, i am fluent in English and I speak Spanish quite well.\n\nI am searching for a job where I don't need to use German language and that would provide me with enough money to survive (house and food).\n\nI want to know if there is any possibility to find something and what's the best way to find It?\nIt can be washing dishes... I just want something for beginning then I can search with morw time when I will be already there.\nThanks",
    "title": "Find job in Frankfurt in English/Portuguese Language.",
    "subreddit": "jobs",
    "timestamp": 1488976897,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "This is hitting me hard... guys, currently a 26 year old man, graduated with much engineering degree in May 2016, no internship or experience other than 1 year of working as sales associate in retail. I've had major depression throughout life causing low GPA and I have no intention of going for engineering jobs.\n\n Right now I'm self-studying to be a mobile developer but really need a better job on the side due to low pay and mentally draining job at retail. I didn't want to be too stressed out after work so that I could focus on programming afterwards so I've applied to basic office jobs like admin assistant, office assistant...etc. ive applied mostly using indeed but was really unlucky with bunch of scams or no response coupled with rejection letter.\n\n1. Is it because I'm lacking experience? \nCan you guys recommend any other jobs like them?\n\n2. When applying using indeed, it asks you for number of years of experience you have. If you put 0, does your resume automatically get taken out?",
    "title": "This is hitting me hard...",
    "subreddit": "jobs",
    "timestamp": 1514031653,
    "score": 2,
    "keyword": "man engineer"
  },
  {
    "text": "What would companies value more an MBA or a more specialized degree? Current back ground\n- 25yrs old\n\n- Associates in Social behavior and self development\n\n- Scheduled to complete my BSBA Human Resources and Organizational management in 2019\n\n- Currently Active duty enlisted in the army with job title has Human Resource specialist scheduled to complete my contract by late 2019 or early 2020\n\n- Prior to joining in the army, I did contracting work and had my own ebusiness.\n\nBy 2020 I will be a free man again with the GI Bill to pay for 36months of my education. Should I pursue an MBA or a specialized field? I am very interested in technology and science, that I would love to work for Google, Amazon, SpaceX, and etc. (to work in technological/scientific company, ie HR manager for a Google department/office)\n\nShould I get a Master in Psychology and try to get a minor/certificate in Cognitive Science? or another Associates in something like Engineering/Nuclear Technology?",
    "title": "What would companies value more an MBA or a more specialized degree?",
    "subreddit": "jobs",
    "timestamp": 1493387401,
    "score": 2,
    "keyword": "man engineer"
  },
  {
    "text": "If we wanted to change society and go back to the time when an average man could afford to have a house, with a family, and stay at home mom, with just a decent middle class job, what changes would society have to make/engineer in order to make this happen?",
    "title": "If we wanted to change society and go back to the time when an average man could afford to have a house, with a family, and stay at home mom, with just a decent middle class job, what changes would society have to make/engineer in order to make this happen?",
    "subreddit": "AskReddit",
    "timestamp": 1487785285,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "As a child of rape, I would understand if my mother aborted. This is for anyone who is debating having an abortion or not. I want you to know, no choice is the wrong choice. \n\nGrowing up I didn't know my donor (aka my father, but I refuse to call him by such a worthy name). The only thing I knew about him was that if my mother saw him while we were out, she would grab us and run as fast as she could in her car and race off. I had no idea what was going on. She seemed frightened. I never understood why...\n\nWhen I was 14 I met extended family from my donor's side, I finally had a chance to meet the man I had been dreaming about. The man that would make me whole and explain who I truly am. \n\nI met him and it was great. We got a long really well. I went to seem him and my family as much as possible. One day he asked to speak with my mom. I asked her and she said no. I asked why? She contained to tell me no. \n\nOne day she dropped me off at his house and he came outside and hello to her, she looked stiff and afraid and was very cold. I didn't understand. I asked her what was wrong but she ignored me and said go ahead. \n\nAfter a year of being around this man, our new found relationship started to sour. He would ask for money and use it to purchase drugs. One day I had enough. I was raised by my grandfather and he never EVER resorted to such despicable levels. Luckily I had enough common sense to know this was not right and called him to tell him I never wanted to speak to him again. He agreed and that was the end.\n\nI went to my mother and explained what happened. She said \"let's talk.\" We sat down on my bed and proceeded. \"You were born out of rape.\" I never wanted to have a child by this man.\" The day it happened he was high and beat her with my sister in the other room. She was on birth control but it failed and she found out she was pregnant a few months later. \n\nShe continued to explain that even though she called the cops, he would always come back and beat down her door and she was almost to the point of being evicted so she would let him in. She told me she didn't believe in abortion and it wasn't my fault so she decided to keep me and she does not regret it. \n\nMy heart sank. I flashed back to all the times she ran away in terror and all of the times I asked her to talk to the man who brutally beat and raped her. \n\nI asked her to continue the story and tell me everything. She continued to explain that after I was born, she tried to involve him in my life, but he continued the beating. \n\nSide story: My sister once told me how he was babysitting us while my mom worked and he was smoking crack, she smelled the smoke and pulled me into the closet to protect me. She was only 5 years old. It didn't make complete sense until now. I cry every time of think of this, my sister protecting me. That was the last time. \n\nThe final straw, after the cops had failed to keep this man from beating down her door, was the final time he visited the house high. This time he threatened my life. He picked me up in front of my mother and held a knife to my throat and threatened to kill me. I wasn't even a year old. My mother screamed and finally let him beat her bloody. \n\nShe grabbed us and drove as quickly as she could to our grandparents house. She proceeded to buy a gun and wrote his name on the bullet. \n\nLuckily she never used it. The gun went missing, we found it years later in my grandfathers room.\n\nAfter this she met my little brothers dad, he in a way helped save her. He helped save her because when this man would come around ignoring the restraining order, my brothers dad would be there and made sure my donor didn't come anywhere near us. I am eternally grateful for that. \n\nAfter I found out all of this, I broke down in tears. My mother, who over everything else was always 100% honest and so strong. Didn't tell me this sooner because she wanted me to find out who he truly was and make that decision on my own. She spoke to him in fear and waited. It still kills me to this day.\n\nI want to tell you. If I was her, I would abort. I told her I wouldn't have blamed her if she did. She had to look at me every day of my life as a constant reminder of what she went through. \n\nShe said that it wasn't my fault. \n\nI work hard everyday and have become very success and I feel she deserves everything for keeping me. I will give her what this man took. I will be buying her a house as soon so she can live comfortably out the rest of her days.\n\nI am the product of my mother. I am her strength, and her will. I have become successful because of her influence. I help others and she does. She never makes me feel anything but love. I wish I could be half the woman she is!\n\nThis man has no claim to the person I am and the person I have become. I have seen him in passing in my hometown but he does not exist in my world. No anger or hatred, just existence. \n\nSo as the child of a situation like this or any situation where you feel you need to abort the child. If they were alive, they would understand. I'm alive and I understand. \n\nIf you decide to keep them and struggle through it all. Know they will love you with everything. \n\nI would love my mother either way. So make the decision that is right for you.  \n\nI want everyone to know that she has met the love of her life now and he treats her like the queen she deserves to be and has restored her faith. \n\nIn Summary: I was the child of rape, my mother chose to keep me instead. I told her I would have understood if she did abort because if I was in that situation I would have aborted my child. I told her I would love her even if she did. No woman should have to go through what she went through.  \n\nEdit: Wow. I just woke up and saw this. Your stories brought me to tears. Thank you very much for your kind words! My mother is my pillar of strength. I'm glad she trusted me to make the right choice. After I was born he left her life, she went to school and became an engineer. She didn't finish high school so it became a turning point to be independent of men as she says. She has raised my sister and I to be very strong. We know how to fix our own cars from oil changes to tire changes, use power tools, and take care on our own. Happy Mother's day to all of the mother's out there who kept us through the pain and healing!",
    "title": "As a child of rape, I would understand if my mother aborted.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1494702528,
    "score": 6969,
    "keyword": "man engineer"
  },
  {
    "text": "Benign chats with co-worker have resulted in me being threatened by his girlfriend. I'm a female, married, engineer for a wood mill. It's a 25:1 male to female ratio. We use chats to communicate between departments. \n\nI've been chatting with a male co-worker, of whom I have a LOT in common with. He's the kind of guy I'd probably be excellent platonic friends with. But we keep it absolutely pro at all times. I knew he had a girlfriend and respected her enough to not flirt or imply anything that could be misconstrued as inappropriate work talk. \n\nI mentioned that my hubby and i built a kickass DIY hot tub over the weekend, big enough to fit four adults. He responded that he wishes he had a hot tub. I said maybe in the future, I could invite him over for a BBQ & soak with us. He joked that his girlfriend probably wouldn't be ok with that (Cause she's inherently jealous and insecure around other women)\n\nCut to 2am last night... I'm woken up from a dead sleep with chats from 'him' blowing up my phone. This wakes my husband and I up. Buzz... Buzz... Buzz...\n\n\"I read what you said to my man. Hes right, I dont and wud never approve of you. Be a rel woman and find a man who's not taken. You're a fucking horrible woman. I'll keep an eye out for you.\"\n\nThese kind of poor grammar and awfully assuming messages continue for an hour. I turned my phone on silent.\n\nThis morning I found out she stole his phone & car in the middle of the night while he was sleeping. Cruised around with her friend while basically messaging the two women he chatted with that she thought was a sexual threat (namely me and one other woman at the mill)... My co-worker was just written up for it (Cause the messages were awfully harassing of us women and all from HIS work profile)\n\nNow, I'm looking over my shoulder to make sure she's not stalking the mill. She now knows my full name, what vehicle I drive, my cell number, and work email. He told me she doesn't work at all, and is apparently affiliated with a local gang, and one of get last messages to me says if she felt threatened again she'd 'hire someone'...\n\nAll this is petty and incredibly immature drama, I'm positive nothing is going to develop from this after today, but I needed to vent... I've NEVER experienced someone so scared or angry at other women. Not in school. Not in slutty friend/fr-enemy circles... Never.\n\n- I've told my co-worker I cannot chat with him about anything other than work from now on. And told him that if she does this kind of shit in the middle of the night again (or anytime for that matter) that I'll call the cops on HER for ongoing harassment and intent for criminal mischief. He told me \"don't do that\" he didn't want the cops called cause \"she'd be arrested again\"\n\nFACE PALM.",
    "title": "Benign chats with co-worker have resulted in me being threatened by his girlfriend.",
    "subreddit": "TwoXChromosomes",
    "timestamp": 1491333928,
    "score": 200,
    "keyword": "man engineer"
  },
  {
    "text": "Changing careers from tech, considering nursing Hey y'all, hope this is the right SR for this.\n\nA little background: I've been working as a software engineer for the past 6 or 7 years, and I'm totally burned out and looking to do something more dynamic.\n\nI *don't* have a bachelors degree. I'm also a man, which I understand is uncommon in nursing. I live near Boston (Somerville), which seems to be the mecca of hospitals for some reason. I see nurses everywhere, so I assume the job market is good, but I don't *really* know. I have some money saved up, enough to support myself for a few years and pay for a cheap school.\n\nI reached out to an old friend of mine who is studying nursing and they were able to answer some of my questions w.r.t. schooling. From what I understand, so long as you pass the licensing exam, whether you get an associates in nursing or a bachelors, once you get a job you're pretty much in the same position. I was thinking I'd knock out the pre-reqs at a community college, then get an associates and take the licensing exam.\n\nNow, the questions:\n\n* Does what I've said so far seem generally reasonable? Anything I'm overlooking? Is an ASN the right way to go?\n* What is your job like, day to day? I understand this varies depending on whether you're in a practice or a hospital or w/e, but any info is helpful.\n* Any advice about schools?\n* If I got an associates, would I be able to study to become a NP after working a while, or would I need to complete a bachelors to enter an NP program?\n* Job market in and around Boston?\n* Any good resources about nursing schools etc..",
    "title": "Changing careers from tech, considering nursing",
    "subreddit": "nursing",
    "timestamp": 1501956487,
    "score": 3,
    "keyword": "man engineer"
  },
  {
    "text": "Oregon man sues state licensing board for violating first amendment through overzealous enforcement of restrictions on the title of \"engineer\"",
    "title": "Oregon man sues state licensing board for violating first amendment through overzealous enforcement of restrictions on the title of \"engineer\"",
    "subreddit": "engineering",
    "timestamp": 1493144869,
    "score": 373,
    "keyword": "man engineer"
  },
  {
    "text": "Man Fined $500 for \"Practicing Engineering Without Being Registered\" in Oregon after writing that he was an \"electronics engineer\" and the statement \"I'm an engineer\" in an email.",
    "title": "Man Fined $500 for \"Practicing Engineering Without Being Registered\" in Oregon after writing that he was an \"electronics engineer\" and the statement \"I'm an engineer\" in an email.",
    "subreddit": "engineering",
    "timestamp": 1493403587,
    "score": 356,
    "keyword": "man engineer"
  },
  {
    "text": "This may not belong here, idk. But I found this, among many other tools while going through boxes of my grandpas stuff. He was an aeronautics engineer. Worked for Boeing, Lockheed, and many others. He was an amazing man.",
    "title": "This may not belong here, idk. But I found this, among many other tools while going through boxes of my grandpas stuff. He was an aeronautics engineer. Worked for Boeing, Lockheed, and many others. He was an amazing man.",
    "subreddit": "engineering",
    "timestamp": 1491520013,
    "score": 285,
    "keyword": "man engineer"
  },
  {
    "text": "Oregon Man Fined for Writing 'I Am an Engineer' Temporarily Wins the Right to Call Himself an 'Engineer'",
    "title": "Oregon Man Fined for Writing 'I Am an Engineer' Temporarily Wins the Right to Call Himself an 'Engineer'",
    "subreddit": "engineering",
    "timestamp": 1496274119,
    "score": 42,
    "keyword": "man engineer"
  },
  {
    "text": "could you help me with my transcript of a biomechanical engineer expert? (terminology) Hi everyone,\n\nI am a court reporter who is working on a transcript and there's a few things I'm unsure of/can't find online by Googling. I'm not very familiar with engineering terms because it's not my usual area. The case is about a hunting tree stand where a man climbs up and falls and became paralyzed. There's a few spots I'm having a lot of trouble with. I put in capitals the word I cannot understand/find online. If more context is needed, please let me know :)\n\n1. \"So you can tie those -- I think they're called \"shoestring ties,\" whatever they were called -- and you can apply tension to those, but the -- you know, obviously if the buckling is trying to move the ladder toward the tree, then that shoestring really isn't going to matter, right?  What's going to matter is the NEURO/AL (?) knob that maintains the length of the stabilizer bar.\"  \nI know this obviously isn't neural or neuro but that's what it sounds like to me.\n\n2. \"the ladder stand's designed is that when a user beginning climbing the ladder stand based on the design, the EQUALLER is pushed towards the tree.  So in other words, the ladder stand's pushed in towards the tree, the top portion?\n\n3. \"That would be highly unlikely because if you -- it's basically an area of quasi-stable equilibrium, so it's like balancing a chair on one leg.  That's quasi-stable equilibrium.  You can do it, but any small PROVERVATION is going to cause it to move to one way or the other, such as either it's going fall over or it's going to fall on to the legs.  Similar situation here exists.\"\n\n4. \"Do these propose or suppose that the friction is eliminated or reduced to the point where the ladder stand can begin to bend because it's no longer in contact with the tree or in sufficient contact with the tree?  \nA. Well, the friction force is up there on Page 24 that's  F SET F. (is this a math term?)\nSo it can have any value; it can have negative value; it can have 0.  So what I'm showing is just literally the free body diagram.  \n\n\nThank you in advance for everyone's help!",
    "title": "could you help me with my transcript of a biomechanical engineer expert? (terminology)",
    "subreddit": "engineering",
    "timestamp": 1503935382,
    "score": 22,
    "keyword": "man engineer"
  },
  {
    "text": "Trying to find a great lost story A few years ago somebody directed me to a website where an engineer detailed his journey building a house in the woods. It was a personal website like a blog, with an old \"web 1.0\" look (think 2002). I remember it had a light green background and walls of text broken by occasional pictures.\n\nIt was an inspirational and fascinating read. The man cleared the spot for the house, dug his own water supply and drainage, and I think he made his electricity by a hydro power generator he built himself. As I recall, he did everything himself, with a little help from his son when digging the water supply/drainage ditch. I think the house itself was pentagonal, or maybe it was octagonal. And I seem to recall it being built on platforms.\n\nDoes anybody recall seeing this website? Do you have a link? I'd love to read through it again.\n\n**EDIT:** Many thanks to /u/Emeja for finding it! http://ludens.cl/paradise/paradise.html  I think it's a great story for engineers, self-starters, and DIY-types alike to read. Especially the microhydro plant. http://ludens.cl/paradise/turbine/turbine.html",
    "title": "Trying to find a great lost story",
    "subreddit": "engineering",
    "timestamp": 1492086163,
    "score": 23,
    "keyword": "man engineer"
  },
  {
    "text": "French drain redone - not sure the job is good Hello,\n\nI'm posting here seeking advice and help. I've engage a contrator to repair my french drain. I had bad water infiltration in my house (1960s original drain). Here is the story of everything. This will be a photo story using my album at: https://goo.gl/photos/rdXYiFdbUd1nXhuk6. Also, sorry for my english, it isn't my main language. It's also very long.\n\nEverything start with water infiltration in the basement. The first pictures shows the water infiltration at various state. This is right under the outside back door. Many person came to my house checking it and they all said it's water infiltration because of defective french drain. I decided to look for a contractor that would do that and, at the same time, change my sanitary exit one because it has roots cloging it every years.\n\nThe next picture is the beginning of the work. The guy with a blue jacket is the man I talk to and sign contract with. The big orange excavator is a man he engage himself to do the digging because his team were busy somewhere else. Needless to say, this guy is an expert with his excavator, precise and no damage anywhere. The other guy in the blue shirt and a shovel is the plumber I contracted to do the work. As far as the sanitary replacement goes, everything is a success.\n\nAs you can see in the photos already, the earth that are excavated is deposed directly on good unprotected ground. This will do damage and we'll see that later.\n\nContinuing on, the engage man with the orange excavator continue to dig around the house since he was contracted for 6 hours of work. Everything he did was perfectly executed, no damage to anything except the fact that no ground was protected of the excavation (not his fault, he did ask the guy I contracted).\n\nContinuing on, we can see at some point, before the picture showing my backyard with the pool, that some walls already have some fondation tape seal (soprema). Probably the old owner made some repairs himself at some point. While we are at the backyard, we can see the paving stone. I ask my contractor to remove them because they are broken, uneven and only cause trouble. He said no problem. While removing them, we found a surprise, there is 4 slab of cement in the ground! The old owner probably laid down cement as a base for his paving stone. He removed 2 of the 4 slabe, leaving 2 of them in the ground. As we can see, everything is again layed down on an unprotected ground.\n\nThe following picture show more of the plumber doing his work. Nothing special to see here.\n\nAfter that, we can see a small excavator. This is the small one my contractor own. While using it, it broke down where it is right now. They dug the remaining (that the other guy with the big excavator didn't dug) with this one and a medium one. But, with both excavator, they were pure amateur. They scratch the house fondation, bump hard on it, it even left some mark on it. I'm unsure if I have picture of that though, we'll see on the way.\n\nNext is a picture of one side of my house after the small excavator tried to dig. Was too small so he left it like that. We can see some styrofoam on the wall and the ground, plus the same fondation tape sceal and the fondation slab.\n\nAfter is a picture of the isolofoam HD I made him bought to install. It was recommanded by the compagny selling those thing and said it was made to go underground.\n\nThe pictures after that show an underground tube where a power cable goes from my house to my garage. I had already said many time to my contractor that such a cable existed somewhere so he dug by hand to find it. But then, once they find it, the guy with the excavator did such a good job that he broke the piping and, as we can see on the wall, the protecting case of the main power cable on the house.\n\nAfter that, we can see more of the excaved walls with some protection and styrofoam on it, then pile of dirt all around my house, on unprotected good ground. As we can see in the pictures, there's an old patch under my door in the backyard, right where water enter. There's also a lot of water reaching the footing. They also taped temporary the stuff they broke to prevent dirt and water entering. By the way, the underground piping going to my garage goes straight into my basement wall right next to my electric panel.\n\nThe next pictures are various view of the excaved ground. We can see sometime the old french drain (orange piping, in ceramic). We can also see it goes under my chimney. Then more picture of them, excaving the remaining where my parking his. As you can see, they freely roll the excavator on my neiboor grass without any protection. Needless to say, they scrap his perfect grass.\n\nOn the next picture, we see a man in a hole with a grey and black wall. He his currently putting some fondation seal. I took some picture of the stuff, it's the green and black bucket \"resisto seal\". The preparation before putting this? They brushed the wall with a big brush. Nothing was shoot on the wall to clean it, no pressure washing, drying, just removed the rough with the brush. Also, as you can see, they didn't pump out the water, thus everytime they walked there, splash came on the wall and on the footing. We can clearly see the end of the footing unproteted. Also, they didn't check if the old patch on the fondation at that place was ok, they just cut the extra that wasn't sticking on the wall.\n\nMoving on, we reach the chimney with the resisto seal. I you recall on other picture, they was an old fondation tape seal on the wall that wasn't sticking properly. Instead of cleaning the hole wall by removing it, they simply cut loose part and sprayed it over. Again, without cleaning anything. You can clearly see it on other picture where there's resisto seal on the left of the chimney and the old soprema patch still there.\n\nAfter is some picture of the isolofoam I had to take for tax credit.\n\nLater, we see a \"completed\" wall. We see the resisto seal, then the isolofoam and the delta-ms covering. As you can see, the delta-ms isn't thigh on the installation as it should. It's also dripping in water all around the house (mostly). Nothing was dried out, they just put it there. Looking at the picture were we see the basement windows and door, we can see 4 nail to hold the delta-ms and one directly in the corner. Needless to say, that's not how it suppose to be done if we check on the delta website. Also, we see clearly all the water going under the delta-ms at the bottom and the bottom of the delta-ms roughly cut at many place, both horizontaly and verticaly.\n\nThe following picture are more photo of the installation on the back, right side and a bit of the front.\n\nNext up is picture from the left side (parking) with 2 window and an orange BMW GTR RC in the window We can see how dirty the wall is and the remaining of the old fondation tape seal still on (the corner is right next to the backyard window). There's also a second chimney there for an old oil furnace. Other picture showing the said corner. The other 2 picture with the silofoam is the front and right side. We can see on both how dirty the wall is just in front of the resisto seal. On the front one, we can clearly see even the fondation isn't cleared and how undeep the ground is around the footing.\n\nAfter it's more picture of everything installed, then how dirty everything is around my house. At one time, we can see that the grass of my neighboor was protected (after damage). I put that there myself to try to minimize the remaining of the damage.\n\nAfter, we can see a part of the installation. I had to go out for 3 hours, I asked for them to not fill anything while I was gone, but they didn't listen. When I came back, I found out they already had fill the hole with 3/4 rocks, the drain and fill it up. As we can see on the forst picture showing the right side of the house partially filled, the drain sit on top of the delta MS way above the footing. In fact, it's sitting on the footing (on it's side with some rocks between him and the delta-ms). The next picture show the same installation on the left side of the house (with the water exit on the wall). We can clearly see how high the drain is compared to the footing on the bottom left. We can also see two other thing: There is nearly no rock on the side and top of the drain but also, where is the geotextile wrapping that's suppose to be there (and on contract)? They told me there is one under the rock and on the wall near the dirt, but not on top (even if that was on contract). They told me they forgot it, will credit me and put it on the remaining of the drain. I also ask them about the drain installation since, by my research on the RBQ website and NRC-CNRC (construction code for canada), that's not how it's suppose to be installed. They told me they always do it like that without any problem. I argue, told them by any logic, there's no way this will protect any water infiltration since, first, the water coming from under will rise, attack the footing first then, after sometime, reach the drain, while the drain is suppose to be reached first. And second, since the footing is wrapped with delta-ms and the drain sit on top of the delta-ms, the water coming from under the house and on the side will reach the delta-ms, be pushed inside to the footing and never reach the drain, making it more useless. But they refused to listen.\n\nAs for the chimney, instead of removing the old drain under it, they left it there and wrap the drain around the chimney (that is higher then the footing). They told me they won't go under risking to collapse the chimney. This mean the portion of the footing under the chimney is not protected.\n\nThe next picture show how well they prep the wall for the seal and the isolofoam installation, removing nearly nothing of the old tape seal, spreading the seal on a wet and dirty wall.\n\nAfter, we see the Delta-MS around my fireplace chimey. They didn't knew how to do it so they wrapped some sheet on the corner, clearly against maker recommandation. We after see the left corner in my backyard with a ripped delta-ms sheet on top and on ground. We also see at this place that the delta-ms was cut to high thus not reaching properly the footing (and it's also ripped at the footing).\n\nLittle birdy feeding her children...\n\nThe next picture show them trying to fix the broken piping. At first, they wanted to just put a new one with a cut side close shut with electric tape. I strongly refused, electric tape isn't water seal and not made to be burried underground. I told them the juice is off and we just have to fish the cable out. They did that and badly installed the new piping. The curbed near the house is too tigh, putting a lot of pressure on the joint. We'll see the result of that later. While wee see that, we can see on the wall without the isolofoam the old fondation tape seal around the corner going under the isolofoam. We also see it's not very sticky, full of dirt and the wall is so clean....\n\nIn the same photo, we can see the bottom of the hole is now full of rocks, there's no more water and we can't see the footing anymore. The drain isn't installed yet. Also, the rock is installed, but not the delta-MS, meaning the remaining here won't have any covering from the delta-MS.\n\nNext picture, we see he was out of Delta-MS so he installed something else, without asking me. Even if it's equivalent, I paid for Delta-MS and it's my contract. It suppose to be the samething all the way. The picture also show how he fixed both covering. He filled the gap between them with tar. We can clearly see that it doesn't hold in place.\n\nAfter, we can see the drain installed on the last remaining side. It's cleary way up and not covered with either rocks or geotextile, only dirt.\n\nThe remaning picture show how he filled the hole he dug. As you can see, he filled the hole with everything he dug and found, which mean: dirt, rocks, paved stone, old ceramic drain, old ceramic plastic drain (don't know where's it's coming from), styrofoam... He didn't removed the ther 2 slab of cement in the ground (while I did ask for it). He removed a lot of big stone (and make me paid for the removing of them because he dumped them at a place for that he said).\n\nNext stop is the installation of the window edge. At first, he was installing the drain for the edge directly connected to the fondation drain. I showed to him it's not a good installation and per code, he isn't suppose to do that. That's why he finally installed me two other piping for inspection (he said normally he use the edge for that). There are the two left most on the left window (yeah, installed at the same place). Even this, at first, he was installing them in reverse. Instead of making a U connection at the botton, it was goung opposite side. We can also see that the Delta-MS isn't properly fixed on the wall, there's a lot of place where's it's not tight on the wall.\n\nThe other two picture are a light he broke and the fence he broke. He did replace the light and repaired the fence.\n\nNext picture show the parking and the side of my neighboor. The grass was partially replaced with new one.\n\nAfter we see the filling. The filling is flush with the house, meaning that once it has collapse, it's not leveled at all. He told me because he removed. The ground was partially leveled, but the ground is filled with old ceramic drain piping, extra materials, metal materials, paving stone, styrofoam, etc. This is all around the filled hole and on the ground. They also make me a small place with rocks so it's easier to get to my pool.\n\nAfter we see the edge installed and the inspection chimney.\n\nThe next 3 picture show the water infiltration starting the next day after a rain.\n\nI decided to make a test. I started pooring water over the ground so water would go to the drain and check if it's working. After about an hour, I found out my basement was full of water (see next 2 pictures). The water was coming from somewhere else so I panic (nothing from where there was water infiltration before). I found out the water was coming from the underground piping. On my wall (forgot to take picture...) there was water, mud and insect coming from the ground through my wall. I called my contractor to told them it was broken.\n\nThe next picture show a bit of the floor that fall because of the water. It was expected. They told me that when that happened, it broke the piping. They came back, excaved the ground around the piping to find it broken. They recap it the same way while I was telling them it will broke again is not made properly. They told me to wait a day, then fill a bit, water it down, then fill (etc.) to remove the change of big wait break everything. The next picture show the ground after they filled it back after repairing the broken pipe. At the sametime, they also put some cement at the joint of the fondation and the footing, telling me it would solved the problem. The owner of the compagny keep telling me the problem was the chimney, not the drain. They wanted to ciment a footing on the chimney. The chimney is kind of far though. When digging the whole to do all of that, they didn't protect anything (why protect something they scrapped) and they filled without leveling. Now, all of the 3/4 rock I had between my house and pool is gone underground.\n\nI had holded the last payment because I was saying the job was badly done and nothing was fixed. After this day, they told me I would get sued over so I decided to pay. While talking with one of the guy, he told me that if I want the job done like i want (correctly), I would have to pay another 5000-6000$ for the time. I refused, arguing it's stupid since it's job is badly done. I paid the last part of the job. The owner of the shop told me he give me a 25 years warranty for the job. A week after, I got another water infiltration and he told me the problem is the chimney and that i'll cost me to repair it, refusing to say the problem is the drain installation.\n\nWe had after that about 1 month without any rain. After that, we had some shitty weather with lots of heavy rain falling without any water infiltration. I asked him if the problem was with water infiltration from the chimney up or under, never had any information. For me, since we are in summer, water under the house have lowered and the rain isn't enough to raise above the footing, thus why I'm not getting anything inside. For me, the problem come when the water under the house rise, and the next time I'll be able to check that is next spring.\n\nWe can also see that the \"Delta-MS\" (black stuff on the wall) is hold in place with a resisto-seal tape. This, didn't hold. They did that everywhere there was a joint or a crack on the delta-ms. Nothing hold.\n\nThe next pictures show how they made the joint. They installed the molding strip that came with the Delta-MS (I think) and put some tar on top of it. But, as the picture show, the wall wasn't cleaned before applying the tar. Because of that, the tar cracked and didn't hold at vaious place. They came many time to fix this, as some other picture show with some strip of tar applied with a gun in the crack showed, but it never hold.\n\nThe remaining picture are photo I took about 2 months after showing the ground. We can see on these pictures all the stuff they left on the ground (and in if we don't count what we don't see). Orange stuff are ceramic piping from old drain, black stuff are flexible black drain, plastic drain tubbing, nails, geotextile remainings...\n\nAfter we can see the corner of the chimey. As you can see, the corner is ripped and a resisto seal tape was used to \"fix\" it. They finally put nail in the molding on top of the delta-ms, as we can see on the next tw picture. But still, the molding and the delta-ms isn't tight to the wall and the tar doesn't hold.\n\nThe next picture show another big patch of resisto seal tape used to cover a ripped delta-ms.\n\nNext pictures show other place here the tar doesn't hold or were they patched with resisto seal tape delta-ms again.\n\nRemaining picture show stuff I found in the grass, like metal rod that was holding old antenna (that they removed), wood, ceramic (Etc.). The front of the house, like the back, is full of rocks too and not flatted/leveled like it should (the level was nearly just ok the first time but when they got back to repair the back, they didn't level anything). Because of that, no way I can cut the weeds (no more grass everywhere), that's why it's looking like that.\n\nThere's another picture in there showing the edge on the fron Window. We can clearly see that the edge is not close to the wall and have rocks stuck between it and the wall. Also, this specific edge doesn't even have nail on the bottom.\n\nThe last picture show how the terrain look like right now. It doesn't seems that bad because of the weed, but it's very hazardous. I denied my kid to go there and in the backyard because one of them already hurt himself walking on a ceramic piping. Nothing serious, but still, I don't take any chance.\n\nAs for the pile of woodscrap in the front, the city cut the tree in front and didn't clean the place. They are suppose to come finish the job.\n\nI sent them a formal notice requesting them to either reimburse me or pay the bill for the remaking of the installation and cleaning of the ground. They told me I was making false accusation and they'll do the drain again.\n\nI've replied saying that if they wan't to redo the job, while I'm not very open to the idea, they have to respect a list of criteria and stuff to do. This inclued to redo the whole resisto seal (liquid one) with a proper cleaning and removal of old seal tape, installing new isolofoam (can use the same if undamaged or unsoak), installing properly while using recommendation from maker of the dela-ms covering while replacing teared sheet, installing properly the drain on the side of the footing, under the level of it so it drain the water before reaching the footing, installing the missing geotextile, putting the 18\" of 3/4 rocks properly on top and bottom, cleaning excaved ground so the filling doesn't contain any bad stuff like ceramic tubbing, styrofoam (etc.), cleaning the ground where they didn't excaved and didn't protect so it's on clear black top soil and grass with everything leveled. I'm 5 days out of 10 in the countdown, I'm pretty sure he won't accept.\n\nNow, this hole big post is about: Am I right that this installion, when checking these picutre, is a big mess badly done? I'm probably going to court against the contractor and I'd like some input on that job. He says everything is right done by the code and laws, but that's not what I read. Right now I wanted to have an engineer to come to my house and verify, but they quote me about 2000$ and I'm running short on cash. Before wasting money on an engineer, would be great to be sure.\n\nThank you",
    "title": "French drain redone - not sure the job is good",
    "subreddit": "engineering",
    "timestamp": 1504196199,
    "score": 17,
    "keyword": "man engineer"
  },
  {
    "text": "ASME Div 2 cycle count analysis on a 1986 vessel My local legislative body (canada) has requested that I review our operational history on a Div 2 vessels to ensure the cycle stress meets the usage factor.  I am updating a report done in 2005 and am stuck with interpreting the results.\n\n* initial 1986 work determined usage cycles would occur below 1000 therefore no fatigue analysis required.\n\n* operationally, it was found that we exceed the 20% MAWP threshold quite regularly (~800 occurances in 2005 and 1000 currently)\n\n* 2005 analysis states a usage factor, U of 0.30 using \"next level assessment methodology\" and that the vessel is acceptable.\n\n* 2005 analysis appears to contradict itself as the stated cycles would suggest usage, U=800/1000 + ##/1000 + ##/1000 = ~0.80.\n\nI believe as I am over the 1000 screening condition, I am obliged to perform a fatigue analysis but if there is a factor for the type (b), 20% mapw condition, then I can scale this raw number and will end up with a usage factor of ~40%.\n\nCan anyone provide guidance whether the 2005 analysis was flawed or the formula for usage factor using the 4 screening conditions?\n\nAppreciate the discussion!\n\nNote:  I am a process / chemical engineer so go easy on me! :)\n\nEdit - man alive - Im not stamping anything I don't fully understand or am qualified for!  Just trying to understand without going straight to a consultant.  I am not sure how you got through university if the only answer to every question was \"go pay someone\"...",
    "title": "ASME Div 2 cycle count analysis on a 1986 vessel",
    "subreddit": "engineering",
    "timestamp": 1483642379,
    "score": 6,
    "keyword": "man engineer"
  },
  {
    "text": "Brainstorming https://youtu.be/DWkYRh6OXy8\n\nhttps://youtu.be/FNwIc_RNOHs\n\nSo basically between those two products you have tons of applications. And my favorite part of engineering is brainstorming.\n\n* Military\n* Construction\n* Iron Man suit...\n* Vehicles\n\nI'd like to hear what kind of brainstorming other engineers can do that utilizes sorbothane and/or line-x.",
    "title": "Brainstorming",
    "subreddit": "engineering",
    "timestamp": 1491657254,
    "score": 6,
    "keyword": "man engineer"
  },
  {
    "text": "Software development for niche areas as Business One man company interested in developing and selling software applications, or plug-ins, (particularly under Windows) in areas where there is a demand and not much competition. My background is in Mechanical Engineering, over ten years experience developing software for large and small companies, if that helps narrow down the scope. What would be a topic in high demand, how can I identify potential customers, or where would I find more information on this?",
    "title": "Software development for niche areas as Business",
    "subreddit": "engineering",
    "timestamp": 1490697031,
    "score": 5,
    "keyword": "man engineer"
  },
  {
    "text": "Viability of working reduced hours (advice request) Hey all, \n\nI'm a graduate working in a small consultancy - we've got a small but great team of around 20 people, including the CEO. \n\nMy issue is that we work 8-5, and that extra hour in the morning seems to really take a lot out of the day. I'll complete my first year with the company soon, and instead of asking for a raise, I'm considering asking instead to work 9-5. \n\nI don't know if I'm just being a whiny youngster, but it feels like having that extra time would allow me to be happier outside of work (more time with friends in evenings or more time in the mornings to work on side projects), and as a result, be more focused in work. I genuinely think I'd get more done if things were like this. \n\nThere's also a lot of data to back up how much more efficient less working hours can be (with some contries placing maximum weekly hours laws of 30/35). \n\nIts worth noting that my boss is very old school, and got to where he is by putting in insane amounts of work throughout his lifetime - so on quite the opposite end of the spectrum. \n\nJust wanted to know if anyone has ever done this within engineering companies, and if it worked out for you. Would also appreciate a second opinion in terms of confirming whether this is just a case of \"just man up and work the hours\". \n\nThanks in advance.",
    "title": "Viability of working reduced hours (advice request)",
    "subreddit": "engineering",
    "timestamp": 1483954175,
    "score": 4,
    "keyword": "man engineer"
  },
  {
    "text": "Entertainment that sparks your Engineering Ingenuity Hi,\nI was writing an article on entertainment (movies or TV programs) that lights up an engineer's mind. In this regard I need some responses. What is the movie/TV program that has inspired the engineer in you?  Your comments would be greatly appreciated. Thanks guys\n\nThe responses I got so far was:\n1. Iron Man (Tony Stark Building Suit)\n2. McGuyver ( A guy who invents his way out of tricky situations)\n3. A -Team\n4. Scrap-Heap Challenge",
    "title": "Entertainment that sparks your Engineering Ingenuity",
    "subreddit": "engineering",
    "timestamp": 1485336684,
    "score": 2,
    "keyword": "man engineer"
  },
  {
    "text": "Is getting a college degree useful if I already have a stable job in the field that the degree is in? I have a job as an electronics technician. Right now I am low man on the totem pole.\n\nThe lead tech has an associates degree in the field. He makes more than twice as much as me.\n\nI was wondering if getting an associates degree would be a good move for me. My local college teaches engineering technology with an emphasis in electronics as a 2 year degree. I think it would be directly applicable to what I'm doing and would help with promotions.\n\nSomeone told me practical experience is way more important than a degree. My thoughts are that I'm going to have a much higher ceiling if I get a degree.",
    "title": "Is getting a college degree useful if I already have a stable job in the field that the degree is in?",
    "subreddit": "careerguidance",
    "timestamp": 1488946915,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "15M Are there any emerging finance related careers? Lately, I have been watching videos on youtube in relation to finance, stocks and entrepreneurs. Although I already have around $2000 in shares, with the guidance and assistance of my dad, I don't have much knowledge on the topic of finance and investing.\nI previously was told that 'Robotic Engineering' would be a promising career in the future. Although I knew nothing about the topic, I reinforced the idea of that being my future career.\nI have noticed that I have a liking for finance and investing, by watching various videos on YouTube, and would highly consider going down the path of finance as a career.\nBy watching videos on entrepreneurs and their career experiences , I have noticed a common trait of being weary of the negative aspects that an employee working a conventional 9-5 job faces, in the sense of doing a job that you don't enjoy.\nHowever, when I think of jobs in the field of finance, I think of a middle aged man, who works an unenjoyable 9-5 job, who is morbidly obese and is shouting on the phone.\nDoes anyone know any finance related careers, as a starter job, that don't just work in an office?\nSorry if I appear unknowledgeable, I know barely nothing about careers.\nThanks, btw, I have ordered 4 books on finance, 3 of which are by Robert Kiyosaki",
    "title": "15M Are there any emerging finance related careers?",
    "subreddit": "careerguidance",
    "timestamp": 1512474040,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "Should I stay or should I go? Hello,\nLast year, i was considering leaving \"ABC\", for company \"XYZ\". My hourly position at ABC involved 50% travel, and i knocked the wife up with twins. I told them i could not travel anymore, and after discussing position options, ABC management said i would have to take a pay cut of 15K, because i would not travel anymore.\nI immediately looked for another job in the same field, due to the pay cut, and found a position at XYZ. It is in the same field as ABC, and around the same size. It is also 35 minutes closer to my home than ABC (an hour away).\n\nI negotiated very well with XYZ, and was ready to start in 3 weeks. When i submitted a resignation letter to ABC, with a 3 week notice, ABC management made a VERY enticing counter offer which led me to stay their. I negotiated one day a one day a week work from home with ABC, a 70k salary position, bonus, and a yearly bonus. I love the team members and culture at ABC, and have many out of work friends. I've worked at ABC for 3.5 years.\n\nFor the last year i have been working (full time) partial positions at ABC as \"Customer Service\". This includes automation quality control inspections and qualification, new order machinery scope documentation (Applications), customer run off of automation, The tracking of ALL production timelines, initial customer new order support, coordinating all the shipping of machinery, and formalizing project timelines for customer review. The VP at ABC keeps telling me different ideas for the position i will settle down in, but ultimately I've been doing odd positions. The VP at ABC changes his thoughts on this every week, and i am building uncertainty with my future (maybe just paranoia). He speaks highly of me, so i am flattered to even be considered for positions I have little to no experience in. He has told me that he trusts me, and divulges a lot of sensitive business issues with me for my opinions / brainstorming. With a family and mortgage, the uncertainty has me worried.\n\nXYZ company called me last week (After over a year) and told me of a director level position they want me for. I guess I had left an impression on XYZ ownership to consider me for this, especially after backing out from a position before. I had lunch with the XYZ again today to understand the scope of the position.\n\nI know i can do the director position at XYZ, and a trust in the owner of the company and what he says. The director position is opening up because the owner is currently doing the position, and will step up to fill the shoes of the VP that is retiring. He is in need of someone to improve the service department which is need of reform, so it will be a difficult position. I feel my entire career at ABC has built up the skill set to do the job at XYZ.\n\nMy biggest hang ups for leaving ABC are my co-workers and culture. It is a small company that is very family oriented. They treat customers wonderfully, and demonstrate alot of integrity on their behalf. If i were to stay, i think eventually I would settle into a great position. I also have a great mentor in the VP at ABC, who is teaching me about business and its problems. The health benefits are also second to none in the area.\n\nI am considering leaving ABC because I've had to fight for salary promises before, and I've received 1.5 -2.5% raises on Excellent performance reviews. I know haters are always out their, but I've encountered dialogue of some engineering peers not calling position legitimate, and that is a gut shot. Also, I am one of the rare instances of not having any formal degrees, yet having a great job, so if a huge opportunity comes my way I give it thought.\n\nI am trying to consider a good salary to justify the move. I am going to request 110k, 10k signing bonus, and 5 years seniority. The position nationally averages 87k a year, but if they really want me, they will have to pay. I would haggle to 100k, 10k signing bonus if they had push back. If anyone has input on how to approach the negotiations, i would love it. I've always been hourly up to last year, and upper management negotiations are new to me.\n\nI think that long term, having director on my resume would be help me immensely. I never had a problem switching positions either.\n\nTL:DR Considering moving from a \"renaissance man\" style position applications engineer with prospects, to service director position in a new company.",
    "title": "Should I stay or should I go?",
    "subreddit": "careerguidance",
    "timestamp": 1505421834,
    "score": 5,
    "keyword": "man engineer"
  },
  {
    "text": "Best chances of success: put all cards on the table or incremental negotiation? I wish to negotiate a change in my employment status from Full-time telecommute worker to Part-time telecommute contractor. The purpose of changing work agreements is so I can travel whist working and work for other businesses. There are about 5 critical things I would like to negotiate (see list below). \n   \n&nbsp;   \n- **Negotiation Goal 1:** Change work agreement from full-time to part-time employee or contractor.    \n- **Negotiation Goal 2:** Work a minimum of 20 hours a week (sometimes more but never less). I want this to be stated in my contract.  \n- **Negotiation Goal 3:** The worker cannot be dismissed without written notice. Must be given at least 2 weeks notice. Can be dismissed for any reason.  \n- **Negotiation Goal 4:** The worker can work for other businesses. But not competitors.    \n- **Negotiation Goal 5:** Work European timezone hours. I plan to move to Europe (from Australia where I am employed).  \n   \n&nbsp;   \n\n**Should I state all my negotiation goals in the first meeting** - put all my cards on the table. Or should I select 2/3 main goals and incrementally ask for the others in successive talks?  \n\n---\n   \n&nbsp;   \n**Context:**  \nI am a Systems Engineer in Australia and the company is a small 'start-up' (<10 people) with an even smaller IT department (2 people).\n   \n&nbsp;   \n**Incentives I can offer:**  \n- The employer does not pay super annuation (SA) for the worker. In Australia SA is similar to a 401k - the employer pays 9% of your income directly into your retirement fund. This is quite expensive for employers and a hastle.  \n- The worker works remotely and provides *most equipment to perform their job (laptop, internet) themself.  \n- Payment given hourly, weekly, monthly or salary (dont care).  \n   \n&nbsp;   \n**'Leverage':**  \nWhilst I dont feel quite comfortable thinking in this transactional nature, I do believe that my business value allows me to negotiate from a position of strength.   \n- It takes a while to find another employee with my skillset   \n- If I leave it would affect the ability of the business to meet project deadlines already in progress.  \n- My employment role has deviated significantly from what was verbally stated (contractually it a gray area). Ie, I was told multiple times I would be the GM's 'right hand man' for software development but this changed literally the first week I started with the company. My point is, due to the breaking of the GM's word I believe I have no moral or ethical obligation to consider the possible negative impact of my departure on the business.  \n- I am prepared to resign if I am unable to negotiate a favourable change. \n   \n&nbsp;   \n*Software required to code a project the company should purchase. For eg, SAAS licences.",
    "title": "Best chances of success: put all cards on the table or incremental negotiation?",
    "subreddit": "careerguidance",
    "timestamp": 1497354021,
    "score": 2,
    "keyword": "man engineer"
  },
  {
    "text": "I was fired from my first programming position, went through unemployment, now I work at a Big N. Some advice for people who are \"worried\" Bio Plug: Graduated with non CS engineering degree from a high ranking school. Hated the field once I worked in it. Visited a friend who was working at a growing SAAS company, now works at Amazon. Loved the environment. Younger people, happy, always new stuff talked about. Studied programming on my own. Passed an interview test, they realized they needed someone more experienced two weeks after I started and fired me after I spent my savings relocating. I was devastated.  \nI've also gone through working at a start-up who VC's pulled out from, working at a contractor that started firing veteran employees because management lost a 7 figure contract and now I work at a Big N.  \nHere's my advice for the people going through the following stressful situations/tragedies -  \n**TLDR Advice -  \nFor job hunters:  \n1. Send out as many applications as you can, even to positions you don't qualify for and the ones you match the most, pay more attention to.  \n2. Try to divide your time between accomplishable studying goals and applying.  \n3. Be willing to relocate even if you have family, close friends, SO.  \n4. Relax and don't blame yourself.  \nFor those working that are worried or wondering if there's problems:  \n1. Got a bad feeling in your gut? Listen to it.  \n2. There's nothing wrong with putting a value on loyalty.  \n3. Communicate with your boss when you're unhappy, albeit professionally.**  \nDetailed -  \n**For those trying to get a first job, that seem to never see the end of rejections**:  \n1. Send out as many applications as you can, even to positions you don't qualify for and the ones you match the most, pay more attention to.  \nI sent out *hundreds* of applications. And when I found a position I really matched, I made the application as personal as I can, often naming the engineering manager in my email, pointing out my knowledge about tech they use and discussing their portfolio directly and relating it to my knowledge.  \nIt sucks when you make an application personal and they don't acknowledge you, but it's worthwhile experience learning to talk about the tech for future interviews and it *also* sucks for them, to turn down someone who made things so personable.  \n2. Try to divide your time between accomplishable studying goals and applying. Pick an MOOC, and ONE only, and spend half your time applying to jobs and the other half on conquering that MOOC. Don't even LOOK at other classes on Coursera until that MOOC is finished and you've completed the final project.  \nI did a complete book on a platform I know, and I even did an iTunes University course on DS&algorithms. I never moved on until I finished one.  \nBy the time I started my first real job after being fired, I had finished 5 courses and knew the in's and out's of my platform enough to talk about it in regular conversation.  \n3. Be willing to relocate. Some of you have family, or a girlfriend, or a close group of friends. I'm sorry to tell you this, but you are more of a burden to them than help if you're unemployed especially in the US. The US is harsh and brutal to people unemployed. More so nowadays than before.  \nIf you relocate, get a job in a low COL, you can save money for plane tickets, fly your SO to come see you, learn more about the world outside of what you know and get experience to come back later.  \nI really wanted to work in my college city, so badly that I was willing to take a 20% cut in pay under market rate to do it. That would've been a massive mistake.  \nNow, I get job offers for my college city 20 to 30% above what I earn now because I've earned experience and I'm in demand.  \nI've lived in three different cities after I graduated because I kept going where the work is.  \nYou would be surprised what a company will do for you if you're the best person for the job that they can afford. Early termination lease fees, rental truck, plane ticket, crate for your dog, groceries and beer money for two weeks? Done.  \nIt's true that my first job fired me, I'll talk about that soon. But the next three companies? Hired me, helped me move, took care of my expenses.  \n4. Relax and don't blame yourself. No, you're not a shitty programmer. No, you're not \"worthless\" compared to your friend who got hired by Facebook pre-graduation.  \nThere are literally *thousands* of alumni and bootcamp graduates just like you having trouble getting placed. A lot of companies want Gilfoyle at McDonald's employee prices and it's showing. Companies think that if they hold out enough, they can get some guy who passes all their HackerRank tests who will be okay with $50,000 a year and be grateful because the economy sucks.  \nIn reality, they're just going to sit around with a job posting for programmers and complain that engineers ask for too much money. Forget about those places, you wouldn't want to work there anyway.  \nFocus on the companies that can afford you and deserve you.  \nBut take time after a busy day of applying and studying to just relax. Go to a friend's house, watch some movies, do yoga, play your favorite game and turn off messages and emails for an hour while you do it. This job is stressful and if you build in this sense of urgency and panic and engrain it too much, you will have trouble relaxing in the future and put yourself at risk for very serious heart conditions.  \n**For those who have a job and are unsure about going for something else, how safe their office is or worried about getting fired**:  \n1. Got a bad feeling in your gut? Listen to it.  \nIs there a guy/girl that works with you that acts like you should never complain about management, work is work and management never does anything wrong?  \nYeah, fuck that guy. That guy is an idiot and in a year or two, you'll be twilights and galaxies ahead of him/her in your career because they would sit around on the titanic playing the violin while you're clawing your way into a life raft.  \nThere's *NOTHING* wrong with listening to your gut. It doesn't mean you're going to quit if you start asking serious questions and start wondering what's going on with the weather forecast.  \nMy first company was a start-up. At a certain point, I noticed the founders would go into meeting rooms and not invite any of us. I got a little worried so I started asking my PM for meetings and asking my mentor if I should be worried.  \nMy coworker on another platform kept saying, \"Dont' worry about it we just need to do our job\". Total company man.  \nI decided it's better to be safe than sorry and it's better to have job offers I can turn down than be in the middle of the woods with explosive diarrhea and not a tissue in sight.  \nSo I started putting out feelers with recruiters, I took on five interviews and I had four hard offers for local companies, all at a minimum of $5,000 over my current salary.  \nAt the end of that month, founders dragged us all into a meeting room and told us they lost funding and half of us were gonna be fired and they wanted the engineers to work pro-bono for a few weeks on like a \"salary IOU\" while they try to package up our platform and sell it.  \nCompany man next to me? He had the same look on his face that my friends had when we walked out of a hard calculus 3 final that they bombed and I talked through all my solutions in confidence because the questions were exactly like the ones I got in TA hours, that they skipped because of how much smarter than me they were.  \nLuckily for that asshole, who treated me like shit because I wanted to cover my ass, I actually gave his information \"anonymously\" to the same recruiter who placed me and told her, \"Hit him up and be persistent, he's a good coder he just doesn't see the writing on the walls\". My recruiter landed him a position and to this day he doesn't know how the recruiter found him.  \n2. There's nothing wrong with putting a value on loyalty.  \n[This is what I have to say about loyalty, per Dwight Schrute](https://www.youtube.com/watch?v=8QWsTBvXx_g). Care about you and you only.  \nLike your boss? Like your office? Say things like, \"I don't want another job because unlike you guys, I commit to the place I work\". Let me ask you this, will your boss come to your house and carry you to the bathroom when you're retired? Will your boss drive you to pick up groceries when your car breaks down?  \nYour company, in the US, only cares about you as much as your value proceeds the worth of your compensation and training. Once those values do not align, *the clock is ticking and you will likely be fucked over soon*. That's the advantage \"at will\" employment gives them.  \nThey can fire you and unless they tell you publicly, \"I'm firing you because of the color of your skin\", you likely have very little recourse to correct it.  \nAnd they can literally fire you with less than 24 hours notice.  \nYour lifestyle? Dependent on your salary? Unemployment insurance is likely a fraction of that amount, so firing you can literally put your life and livelihood in danger.  \nAlways have a back up plan even if you don't feel like your company is in danger.  \nSpeak to recruiters, build relationships with other companies in your cities. Always have someone or some company who thinks, \"Man, it'd be nice to have code_4_you here working with us, let's see how he/she is doing\". Those connections are your natural parachutes and help you to not have to relocate again.  \n3. Communicate with your boss when you're unhappy, albeit professionally.  \nThere is nothing wrong with not being sure about what you're doing. Sometimes your boss won't even know there's something wrong. A lot of managers, albeit this is a mistake and any managers reading should pay attention to this and not do it, don't tell their engineers the small combination of words that will make over 40% of them feel happy and STOP looking for new jobs -  \n\"You're doing great, we're really glad to have you here, this is some of the stuff we have planned next year for you.\"  \nThat's it. Literally 8 seconds of English words and your engineers will feel safe, secure and stop hitting up your competitors for back-up plans.  \nThat's what my boss said to me two months ago, and now I'm working the longest streak at one company of my career.  \nIf you don't feel that way, tell your boss, because this paper trail gives you the defense you need to show that you DID try to communicate your dissatisfaction. And it's possible they will try to remedy it by changing your project, putting you under a new senior or offering you some extra PTO to sort things out.  \nMy story:  \nAdapt is the theme of my experience. I was fired, I adapted. I got a job and had a bad feeling about the VC's/founders, I adapted. I got hired by a contractor and had a feeling there was toxicity in upper level management, finally felt ready to work for a Big N, I adapted.  \nNow I love what I do and I'm highly valuable.  \nGood luck out there!  \nOh and if anyone tries to convince you that we don't deserve these six figure salaries or earning more money than most of their clerical staff/management and tries to say, \"This market isn't sustainable, software engineers are asking too much and companies bleed trying to hire them\", tell them to fuck off.  \nThat's not how economics work.  \nWe are in such demand that literally other countries are trying to fly us out of the country and offering us crazy immigration and visa conditions to get us to go there.  \nThis is a software driven world and it's only going to get better. Self driving cars, smart underwear, more powerful phones... All this shit needs engineering. If you don't want to pay for a good engineer, buy a Safari Books subscription or build a fucking Wordpress site.  \nI'm sick of these red pill, economics/management science graduates trying to sneak into /r/CSCareerQuestions and trying to neg us down because they failed to hit their hiring quota for their \"IT\" department, because a UCLA CS graduate didn't want to accept their \"excellent\" offer of $55,000 a year to build their Enterprise Tinder clone or whatever shit idea they think they know more about than us.",
    "title": "I was fired from my first programming position, went through unemployment, now I work at a Big N. Some advice for people who are \"worried\"",
    "subreddit": "cscareerquestions",
    "timestamp": 1511147620,
    "score": 812,
    "keyword": "man engineer"
  },
  {
    "text": "Junior SWE in crisis I don't really know if this level of intensity is appropriate for this subreddit, but I thought I'd give it a shot.\n\nJust some background: I'm mid 20's, have an undergrad computer science/software engineering degree from a mid-tier university and have been an SWE at a small company (<20 employees) for a little over a year. I am by far the youngest and least experienced employee at the company.\n\nFor the most part, I have enjoyed my job. Without going into specifics, I have been fortunate enough to work on a wide range of components of a couple of projects within a small team. However, over the past two months I have struggled with feelings of self doubt and incompetence which have led to me questioning my career choice.\n\nI am familiar with impostor syndrome, but I'm not sure if it applies here. While I believe I'm quite competent with some aspects of the role, I struggle to understand others and feel completely useless and stupid in technical discussions and can't really hold my own. Perhaps I should ask more questions, but I feel like such questions would be stupid and laughable given how elementary they would be with respect to the discussion.\n\nIn addition to this, the lead of the project is (in my opinion) a horrible developer. I know it sounds a little ridiculous to express my own feelings of incompetence and then call someone else out for the same thing, but hear me out. He seems to have an excellent, in-depth knowledge of many concepts involved in the project and is regarded as a great engineer (particularly hardware), but his actual code is an absolute nightmare to deal with.\n\nIt's not scalable or portable in any way, he seems to have no concept of software architecture and he doesn't conform to any sort of coding conventions. It's all incredibly messy and inconsistent. Functions are far too long and call on code from low/no layers of abstraction or libraries that they shouldn't. Chunks of code are commented out all over the place. Indentation is inconsistent (sometimes spaces, sometimes tabs, no regards for alignment). Header files are a mess and some files may as well just #include \"everything.h\". Obviously compilation is slow, and there are warnings all over the place. I saw a line of code the other day that read \"if (foo == someEnumEqualToZero) foo = 0;\" - still trying to work this one out.\n\nFurthermore, his form of source code management involves creating an archive, uploading it to a shared directory and having me extract it and merge it with the main code base. I maintain the public repository  for the project and have a separate branch just for his code dumps to help me deal with this. I have tried to teach him how to use Git but he'll just always switch back to his old ways within a day.\n\nWhile you might suggest I just talk to him about these issues (and I have brushed on some of them in a very reasoning and diplomatic way), he is the most stubborn, intense man I have ever met and will be quick to assume it's due to my incompetence or lack of understanding of a concept. And while this is a valid issue as I explained earlier, 90% of the time my difficulties are the result of his code rather than the concepts they implement. It's not uncommon for him to set me a task which involves some code he wrote and then become irritated when I modify his code to be more portable/scalable (which I do simply because it wasn't going to work any other way). If this happens it's rare that my changes will still be present in his next code dump. I find it more and more difficult to speak up about these issues and have just adapted my workflow to deal with it. I get the feeling that he has never worked on a team software project before...\n\nI think this toxic environment is possibly a cause of my feelings of incompetence and lately has driven me as far as depression and anxiety. Lately I have spent hours staring at the screen just wondering how I'm possibly meant to complete a task with the mess that has been created with all things above considered, and it drives me absolutely insane. As a junior SWE it's certainly not ideal for my professional development. However, there aren't many opportunities for SWEs in my area, and leaving the job after only one year of experience would most likely be career suicide and a waste of 5+ years of my life (including study). In saying all this, if dealing with these issues is common among all engineers then I'm unsure if I'm even cut out for this career.\n\nI've organised a meeting with another engineer/manager and HR to discuss these issues, but if anyone has any advice or thoughts on this issue, it would be much appreciated.",
    "title": "Junior SWE in crisis",
    "subreddit": "cscareerquestions",
    "timestamp": 1486563308,
    "score": 29,
    "keyword": "man engineer"
  },
  {
    "text": "Am I in an objectively bad situation or am I being petty? tl;dr I really dislike the company I work for and the job I'm doing but I'm not sure if it's me or the company.\n\nFirst things first. Throwaway account and vague'ish content so that hopefully I won't be recognized and I won't break any NDA stuff. There are two reasons I'm posting this here. 1) I wanted to write this out because usually when I do that with my problems it helps me get a different perspective on the issue. Makes me really think about it. I can do that without reddit, though which brings me to the second reason. 2) I have no professional experience so I can't adequately judge whether or not I'm being petty. It's possible that this is standard for the industry and I'll have to just get over it.\n\nI'm hoping you lot can provide some insight. So, onto the situation.\n\n---\n**THE INTRODUCTION**\nI learned about this company during a career fair hosted by my college. I didn't even go up to talk to them, because I didn't know who they were. Their rep pulled me out of the crowd because they saw my nametag said Computer Science Senior. I talked to them for a brief period and afterwards gave them my resume just so that I could hit as many places as possible for a job (although I already knew I wasn't really interested in the job). After chatting, the rep wanted me to sign up for an on campus interview, which I did because again, I needed a job. \n\n**THE INTERVIEW**\nBefore I went to the interview, I still wasn't very enthused about the position. Partly because it would mean I'd be a consultant (I'd still be a software engineer, but the company would basically be a middle man between me and whatever company they end up hiring me out to), partly because I knew (via Glassdoor) that their starting pay was a fair bit less than I wanted, especially for the area, and partly because the job just didn't sound fun. Anyway, the interview was 15-20 minutes long and consisted of half HR-styled questions and half vocab questions. I did not get a single coding question. For a software engineering role. What? On top of that, I did horribly. Vocab-type knowledge has never been my strong suit. I thought for sure there was no chance they would call me back for another interview, which was fine. Lo and behold, about a month later they called me to say they were offering me the job. Not a follow up interview... a job.\n\n**THE OFFER**\nThe initial offer had me posted in the area I wanted to be in with a starting salary that was actually a grand or two less than what was posted on Glassdoor. Also the start date was a month post-graduation and they had a mandatory 6-month training program on the other side of the country. With the training program, the offer was an easy decline for me. I did not want to spend 6 months on the opposite coast away from every single person I know in this world. I didn't decline it at first, though. I just let it sit while I applied elsewhere. A week or two later they came back and said they changed the training plan down to 6 weeks instead of 6 months. It would've been 2 weeks opposite coast, 3 weeks back home, and 1 more week opposite coast. It was no longer an easy decline. It would still suck, but it'd be manageable. A couple days later, they contacted me again to say they'd increased my potential salary by about 6% and pushed my start date back by an additional month. I didn't ask for the raise, they just offered it. (This brought me up to just slightly over the Glassdoor price.) Deadline approaching, no other interviews, much less job offers, so I accepted. Then a week before I left for the training program, they emailed me to say the training program had been changed again so now it'd be 8 weeks, all of which would be on the opposite coast. It sucked and I hated it but I'd already accepted and I had no where else to go.\n\n**THE TRAINING**\nFor the 8 weeks, they put us (a group of like 20'ish CS, business, and other majors) in a hotel. They payed for the hotel costs, but food and any transportation was on us. (That's another thing they changed. Initially they were going to cover lunch 5 days a week and dinner 4 days a week, but in the last email they said they would only be covering hotel costs.) First two weeks were all HR related things. Benefits, harrassment stuff, company background, etc. During this portion, they were going over IP and NDA content and they said that anything we create, even if it's on our own time and using our own personal technology, will be owned by them. This killed any motivation I had to work on fun projects outside of work. The following 6 weeks were them \"teaching\" us the relevant technologies for the projects we'd be going to. It was not organized at all. We had no trainer onsite. We had to join a low quality, overseas call every morning to get lectured for about an hour or two. Post lecture we'd be given programs to work on to practice the technologies previously talked about. The programs they had us make to learn the technologies were all intro level programs. Maybe slightly harder than \"Hello World!\" but not by much. Because of this, my group and I spent like 90% of our days doing nothing or doing leetcode challenges while we waited for some new direction. I ended up leaving the training at the end of the 8 weeks feeling no more prepared for the job than when I went in.\n\n**THE JOB**\nI was posted to a high-tech company, which was rather exciting at first. Basically the only thing thus far that I was excited about. However, even though I explicitly said I didn't want to do test, I was put into a test role. Again, I had no other options so I figured I'd just do it. Maybe it'd turn out to be fun and if not, supposedly you're supposed to switch jobs semi-frequently when you initially start your career anyway. Turns out I hate it. It's been causing me a fair bit of stress. The last time I dreaded getting out of bed this much was back when I was being bullied in high school. Also, my company basically wants me to give my life completely to them. I usually work 9 hours days, with a couple 10 hour days here and there, which is mostly fine. However, now they want me to work Saturdays as well. It is too much for me, especially for the pay I'm at.\n\n---\nI've been employed by this company for a little over 3 months now, although I've only been working on a project for about a month. I hate it enough, though, that I'm considering starting to apply elsewhere already. What's stopping me, mostly, is that I don't really have any new experience as compared to when I graduated, and I don't want to apply to places only to get declined. Then I would be stuck here longer while I wait for the ambiguous grace period to end so I can apply to the same places again. One issue that's entirely on my end is I want to stay in the area I'm at. I'm sure I'd have more opportunities if I were to look elsewhere in the country but for personal reasons, I'm mildly rooted here. \n\nShould I apply anyway and take my chances? Or am I going to end up equally unhappy at the next place? Or should I try to wait a little while longer so I have more experience?\n\nEdit: I appreciate your responses thus far. I'm actually at work now so I won't really be able to respond. I've only logged in now to make sure you're aware that I haven't abandoned the post. When I get home tonight I'll try to address some points that have been brought up.\n\nEdit2: Thanks again for your comments. It seems the general consensus is that I'm in a bad spot and I should fix things on my end and then try to get out. My plan at this point is to spend the next month'ish doing leetcode/hackerrank questions in my evenings to reacquaint myself with interview questions. After that I'll start applying and trying to get out of my company.",
    "title": "Am I in an objectively bad situation or am I being petty?",
    "subreddit": "cscareerquestions",
    "timestamp": 1498226369,
    "score": 16,
    "keyword": "man engineer"
  },
  {
    "text": "Software Engineer Title Legality I saw a thread on the frontpage discussing how a man was fined for proclaiming he was an \"Engineer\". Is it legal for us to put \"Software Engineer\" on our resumes? Should we change it to \"engineer\" or \"Developer\"?\n\nEdit: I'm assuming no one here has a PE license",
    "title": "Software Engineer Title Legality",
    "subreddit": "cscareerquestions",
    "timestamp": 1493567184,
    "score": 18,
    "keyword": "man engineer"
  },
  {
    "text": "Not learning web development => In big trouble? **TL;DR:** Upcoming Spring 2018 CS grad, know nothing about web development, have shallow exposure to Machine Learning, perhaps internship is deemed by employers as \"irrelevant\", struggling to get *any* interview for a general SDE job for entry level bachelors graduate\n\n**NOTE:**  Wanted to post resume, but concerned about privacy (even anonymizing it) and it *did* get me two internship offers so it can't be *that* terrible, right?\n\nHello, rising senior here who's struggling to even get an interview.  I have one internship whose official title is \"Biometrics Engineering Intern.\"  I did work in computer vision using MATLAB and C++.  Is this not considered relevant experience for entry level SDE roles?  Should I alter the internship title to \"Biometrics *Software* Engineering Intern\" although that is not quite the official name (though in terms of content of the internship, I have zero guilt in doing this because I was indeed writing code from scratch)?\n\nOr am I in trouble because employers for general entry level SDE jobs really want to see web development skills and it's obvious that I know nothing about web development (Languages I have listed are:  Java, Python, C/C++, MATLAB, R)?  My only projects are a DB course project from school using Oracle and some predictive analytics projects involving machine learning.  For the latter, yes I am leaning on libraries like sklearn and do not expect to get anything close to a real data science job with them, but they are finished products and should IMO be better than nothing (esp. for a fresh grad), no?\n\nBasically, the free time I spent on ML MOOC's and Kaggle-like projects appears to have been a complete waste of my time because it's obviously not anywhere near good enough to sniff data science jobs without experience with higher math and BIG/messy data sets (not to mention probably need a Master's) and I should have instead used all that free time learning web development instead.  So it appears I am caught in no man's land without any kind of competency desired by employers.  Any advice for my situation?  Thanks in advance!\n\nEDIT:  I did get a return offer from my internship, but was looking to expand my options because not sure I want to stick with \"Biometrics Engineering.\"",
    "title": "Not learning web development => In big trouble?",
    "subreddit": "cscareerquestions",
    "timestamp": 1504451713,
    "score": 13,
    "keyword": "man engineer"
  },
  {
    "text": "Starting School In January 2018, Am I Making The Right Choice? I'm 32 and tired of my dead end career.  I've finally decided to man up and pursue my passion of computers.  My job hours change every couple of weeks so online is the best way for me to accomplish getting a degree.\n\nAfter looking around for months I decided to pursue my degree at Regis University (http://www.regis.edu/CCIS/Academics/Degrees-Programs/Undergraduate-Programs/BS-Computer-Science.aspx).\n\nAm I making the right choice with this school?  Anyone have any experience?  How does the curriculum look?  Ultimately I want to become a software engineer.  I know very little programming but I'm eager and willing to learn.  Any advice from those who have been there, done that?",
    "title": "Starting School In January 2018, Am I Making The Right Choice?",
    "subreddit": "cscareerquestions",
    "timestamp": 1513424715,
    "score": 9,
    "keyword": "man engineer"
  },
  {
    "text": "Building out our startup's COO level planning, process and people architecture (process mapping, inventory of my people, pillar by pillar metrics, etc.) Hey y'all. \n\n**Quibbl is an early stage startup.** We are trying to make a big dent in the news aggregation space by borrowing from fantasy sports adn markets to create user-sourced aggregation system that uses a competitive game like dynamic where users compete to earn credibility by correctly predicting the outcomes to news events and trends, allowing us to use credibility as the basis for crowd sourcing. \n\nCheck it out. Quibbl.me - go make your bets on Game of Thrones, ACHA & sports stuff\n\n\n**Fair enough**\n\nWe were Y Combinator finalists this year, and though we have a long ways to go, we have been making great strides building out a top-notch tech team, going to our users and collecting massive product feedback & building out a media & content team that is beggining to produce some really cool stuff.\n\nThere's just one problem. We are growing too fast and our organizational infrastructure is a mess.\n\n**Personally, i would feel like we were in a good place if we had the following locked down:**\n\nVision:\nTeam formation & team context:\nProcesses / playbooks\nProcedures \nWorkflow management\nKnowledge library / file storage\nTalent library (who are our people, contact info, expectations, legal docs, individual expectations, training, key meetings they need to attend, etc. - also what our our current talent gaps, where are the bottlenecks and what roles do we have unfilled, etc.)\n\n**However this is the current state\"**\n\n\n**Vision:** we have a pretty clear verbal roadmap, some basic power points that convey it. I think for onboarding the team and keeping people in sync at the org levle, we are pretty okay. HOWEVER, for places where the devil is in the details (the specific tradeoffs we want to make for user acquisition strategy, detailed requirements for our analytics engine and detailed product feedback requirements, those exist in various documents, are subject to interpretation and the subject of a lot of unnecessary friciton and guessing. In won't come over night, but i'd like to have a clearer book of \"standards\" (could basically function as a 10 page appendix of 1 page memos covering our \"vision standards\" to a level of granularity that reflects what's needed to make our typical business decisions and ensure good integration across teams\n\n**Team formation & team context:** as we onboard new teammembers, we have a pretty good oral process, that gives a good overview of the teams, their book of work, how they fit together etc. But it's inefficient (relies on me to tell each person what's going on in the company, and subject to me being on and their recall). Starting to flesh out the core onboarding document to give a 2-3 page overview of each team's responsibilities, current context and book of work. Meantime, trying to develop a more granular and standard questionnaire so every month i meet with a team we use it as a forcing mechanism to get everyone in sync on what we are doing and how pieces fit together.\n\n**Processes / playbooks:**  one of the biggest problems with onboarding new people is people run into walls and don't know what to do. I am the key man / only one who knows how to do a ton of things in the company, from working analytical prototypes to how to manage our social media accounts. I don't have capacity or mental energy to hand these off in a good way, and i feel like if we just had a list of the top 10 most painful processes, and an organized dashboard to start storing them down, batch by batch, we could get out of the mess. \n\n**Procedures** - see above \n\n**Workflow management** - we are putting work into the workflow system asana and that seems to help. But things get put in a non-standardized way, assignments are often incomplete or misentered. If we could get the book of procedures tight, we could that automate the workflow for most types of deliverables, which would massively reduce confusion, bottlenecking and the overhead of having to retrain people because their is no standard body of knowledge \n \n**Knowledge library / file storage** - our files are totally fucked up. So much good work, spread over so many different files, some of which have brilliant gems, but across a chaois of brainstorming that represented the last year. We scrap our document library we lose a ton of good work and criticial thinking that was done to shape our product to date (prototypes that haven't landed in our core code), procedures that are mixed in with people's personal notebooks, etc. But i lack the bandwith to go organize it all myself. If i could get an nice clean inventory of all the documents, i could start tagging, sorting them and identifying like documents taht could be sorted, organized and archived, but i need the right tool / inventory design and that takes thinking.\n  \n**Talent library** (who are our people, contact info, expectations, legal docs, individual expectations, training, key meetings they need to attend, etc. - also what our our current talent gaps, where are the bottlenecks and what roles do we have unfilled, etc.) \n\nIf i could have a top down scan of my peoople, have quick and dirty weeekly metrics (who has their individual charters / responsibiilities setup, when was the last time their documents were audieted and kept to standard, are they in the right meetings, etc?) that would go such along way to get us from bad to good.\n\n**current focus:** buidling out some k level versions of these tools and populating them by end of week. That said, i can't help but think i'm not the first person to have to go build an organization from scratch. are their any good tools out there that are designed to prompt this work, capture it in an organized way, etc. etc.\n\nsome sort of template or tool that already exists in excel would be great. i know the answers, i just need a good enough tool that will put it all together and i don't want to reinvent the wheel on tired eyes\n\n\n**Any suggestions for easy templates / existing spreadsheets to build out my startup's COO level architecture (process mapping, inventory of my people, pillar by pillar metrics, etc.)**\n\nWe have about 3 core teams, about 2-3 groups of people per team, and about 25 project contributors. This seems too complex to manage via weekly memo, without the right structure underneath it. Or at least, i'm finding i need some more structure.\n\n**Any other ideas? How would you go about solving this wonderful mess?**",
    "title": "Building out our startup's COO level planning, process and people architecture (process mapping, inventory of my people, pillar by pillar metrics, etc.)",
    "subreddit": "consulting",
    "timestamp": 1499820404,
    "score": 1,
    "keyword": "man engineer"
  },
  {
    "text": "Garmin engineer shot and killed in Kansas by man who allegedly yelled ‘get out of my country’",
    "title": "Garmin engineer shot and killed in Kansas by man who allegedly yelled ‘get out of my country’",
    "subreddit": "asianamerican",
    "timestamp": 1487945114,
    "score": 197,
    "keyword": "man engineer"
  },
  {
    "text": "MeToo is a game changer -- but not in the way feminists think Feminists have never been very good at predicting the future.  \n\nThey assumed feminism would increase female happiness.   Female happiness has been declining since the 70's.   \n\nThey assumed that trying to eliminate the female gender role would create rough parity in previously male dominated occupations.   In fact, in countries where women have the highest degree of choice, women are *least* likely to become engineers; conversely, countries like Iran and China lead all nations in female engineering.  \n\nThey assumed that destroying the \"patriarchal\" family would eliminate child abuse and allow children to grow up healthy and happy.   In fact, children from single mother households fare worse on all quality of life indicators.   \n\nThey assumed that domestic violence was a patriarchal conspiracy.   In fact, hundreds of studies reveal that women are more likely to engage in unilateral violence against their partners, and lesbians have the highest rates of DV.   \n\nThey assumed that women in power would be more peaceful.  In fact, studies have now revealed that Queens were more likely to initiate wars than kings.  Female leaders ranging from Margaret Thatcher to Hillary Clinton were positively eager to engage in military violence.  \n\nI could go on indefinitely.   The point is that feminists have gotten *almost everything wrong.*   It is nothing short of remarkable that they continue to dominate academic discourse on gender given their near-100 percent failure rate.   Any theory worth its salt should be somewhat predictive; feminist theory is *counter-predictive*.  In no other discipline (save perhaps economics) do we see such a disconnect from reality.   \n\nI can only conclude that the wild success of feminism owes almost entirely to what they call \"benevolent sexism.\"   Men and women in academia have been exceedingly reluctant to debunk their arguments because patriarchy theory is, in fact, horseshit: men want to support women, not oppress them.   And they will support women even when they are clearly wrong.   \n\nThat brings us to MeToo.   Collectively it is Time magazine's \"person of the year.\"   The once charming and beautiful -- now wretched -- Ashley Judd even posed for the cover photo.   \n\nFeminists have been content to see their ideology run wild.   They have wielded female power (which they bizarrely deny even exists) to brutalize men and boys.   They were fine with denying children access to their fathers, turning fathers into indentured servants,  ignoring the role that women play in domestic/sexual violence, shutting down talks on male suicide, disadvantaging boys in \"education\", discriminating against men in hiring practices, allowing false accusations to run rampant, and so on and so forth. \n\nHowever, in the last week or so, I've noticed a change in tune.   Feminists are extremely worried that \"MeToo\" may end up creating a \"blowback\" effect on women.   We're talking about bourgeois women mind you -- because that's what feminists are.  Spoiled, rich, women.    I've noticed contradictory statements in \"MeToo\" articles within single paragraphs -- NO, men shouldn't flirt with women in the workplace, but YES, men should flirt with women in the workplace (the right *kind* of man, you see).   The unspoken subtext is that women should still be permitted to use their sexual power where they see fit.   Cake and eat it too.  \n\nThere is a growing recognition that a pandora's box has been opened.   What if men start to view women as threats?   If an \"alpha\" male can be taken down over a mere accusation with no proof, what about your average man?   What about my son!?  \n\nIn fact, wouldn't it be the *responsible* thing for a man with a wife and kids to make sure there is always a chaperone present so he doesn't put his family at risk?  \n\nAll of a sudden those stodgy old Victorian rules are starting to look mighty sensible.   Maybe the sexes *should* be segregated.   Otherwise, how is a man to protect himself?  Nevermind the woman's honor, what about the man's honor?  Hell, maybe that's why such rules were created in the first place!  \n\nFeminists are incapable of thinking too far ahead -- let's just say they're not exactly grand master chess players -- but the alarm bells are already going off in their heads.   \n\nWhat if men decide not to privilege me in the workplace?  What if I can't use my sexual power over men to get ahead?  What if I have to work for a living?   \n\nI'm sympathetic toward working class women.   They didn't ask for this neo-Victorian sexual panic.   They suffer actual hardships in life -- rather than a pat on the ass.  \n\nBe that as it may, MeTOO is a game changer.   Despite what some feminists think, men do not desire to be punching bags; they will try to protect themselves.   And that means no more special goodies and privileges for women in the workplace.  Women will have to pull their weight.   That also means no more drinks, lunches, and sincere efforts by older men to give young women a leg up.  \n\nIn fact -- and I hate to sound too MGTOW about all this -- but I think MeTOO will eventually bring us back to [sex segregation](https://www.youtube.com/watch?v=ZGjidOQgGDE) -- precisely the thing the original feminists fought against.    You abused your power ladies, and now it's time to reap the whirlwind.  \n\nFeminists are now saying, \"It's time to take a step back.\"  Too late.  You made your bed.  Now sleep in it.",
    "title": "MeToo is a game changer -- but not in the way feminists think",
    "subreddit": "MensRights",
    "timestamp": 1513665672,
    "score": 160,
    "keyword": "man engineer"
  },
  {
    "text": "If you’re a man with a camera, you’re automatically branded a creep I used to work semi-professionally as a photographer.  What do I mean by that?  Essentially I was part time.  I had a great job as a software engineer that I liked and didn’t want to give up, but in my off hours I liked switching gears by earning extra dollars via photography.  I specialized in taking photos of the performing arts such as musical artists, plays, circuses, etc.  It was fun.  It was a very different challenge from writing code.  \n\nSo this 16 year-old girl found my web site and liked what I saw.  She needed some quality photos for her school’s yearbook and approached me to take them.  She asked me to take photos appropriate to the yearbook.  Not once did she ever request any nudity or anything else inappropriate.  She had an after school job and enough money to pay my rates.  Everything seemed completely legit.  Of course, I was well aware of the stereotypes that would brand me some kind of sick perv if I photographed a teenage girl.  I therefore turned to other photographers for advice on putting together a contract that would protect me legally.  She wanted a photos of her together with her horse.  There would be photos of her riding it, grooming it, and just standing beside it.  Nothing wrong with that, of course.  I still wanted a contract to protect me legally so that I would not end up falsely accused of any wrongdoing.  A protective instinct kicked in because I knew how hyper-negative people get toward men, especially a man with a camera.  \n\nI asked other photographers on a photography forum online if there were some kind of standard protective contract I could use.  Some photographers responded with good advice on where I could get such a thing.  Some also said I should require at least one parent present at the shoot.  Good advice.  However, others went berserk, accusing me of being some kind of perv out to rape that girl.  One asshole claimed that if it were his daughter he would immediately contact the police and the courts and get a restraining order against me.  He acted like I had proposed to make kiddie porn.  We’re talking about a photo shoot of a fully clothed girl in normal pictures with her horse – feeding it, riding it, normal stuff.  These were photos that were appropriate to a high school yearbook.  \n\nThese male-bashing bigots totally ignored my explanation of the content of the shoot and just assumed I would ask her to take her clothes off and do pervy things and that it would end with me raping her.  No amount of setting the record straight did any good.  It was unreal the hateful assumptions people made.  Some photographers came to my defense, appalled as I was at the overreaction.  Some correctly said that photographers photograph all ages.  Duh.  It totally depends on the content of the photos as to whether it’s appropriate.  It’s unreal how some people heard “fully clothed girl riding a horse” and translated that to “perv raping a teenager.”  \n\nI ended up doing the shoot, no thanks to the male-bashing bigots.  It went great.  I had a liability contract and I had her father present at the shoot.  Great guy, and great girl.  They were awesome people.  Neither of them made any of the absurd assumptions some idiots had made.  This was a case of a young woman who had earned her own money at a job and had chosen to spend it on some high quality photos.  Nothing more.  It’s unreal how some people will twist something like that into something sick.  \n\nOther photographers have told me about similar situations where they’re assumed to be some kind of perv because they have a camera with a telephoto lens.  If you’re a man and you take a high-end camera to a beach, you risk getting pestered and even arrested by police.  That’s a reason why I won’t even do beach photography.  Nowadays, I won’t even photograph someone who’s underage unless I know the people really well.  I was lucky at this shoot that they turned out to be terrific people, but if I had gotten the witch hunt idiots, it could have been dangerous for me.  I’m 100 percent certain if I were a woman, the whole overreaction and branding me as some kind of creep or perv would never have gone down.  “Girl with her horse” – he must be a sicko.  It’s unreal.",
    "title": "If you’re a man with a camera, you’re automatically branded a creep",
    "subreddit": "MensRights",
    "timestamp": 1487540346,
    "score": 71,
    "keyword": "man engineer"
  },
  {
    "text": "My response to a friends re-post of a feminist editorial regarding female students and their 'plight'; or, How Feminism is Hurting Education for Everyone The original link: [Shareably](http://shareably.net/male-engineering-student-explains-why-female-classmates-arent-his-equals-v1/?utm_source=earth&utm_medium=facebook&utm_campaign=inspiring)\n_________________________________________\nMy friend re-posted this link with \"Beautiful.\"   I'd like to share my response because I spent a fairly significant amount of time constructing it, and would hate for it to go wasted in the unseen corners of facebook.  My hope is that you all can glean bits and pieces to use for your own arguments in the future, and better prepare yourselves to disabuse people of the pervasive feminist ideology that surrounds education.\n_________________________________________\nThis is beautiful, like a pile of shit sculpted into an image of the Virgin Mary is beautiful. Yea, the sentiment is nice, but the content is still a smelly pile of shit.\n\nWhat he said may have been true for your generation, but his generation is facing a wave of feminist ideology and policy that puts women as frontrunners in any and all STEM categories. Beginning in grade school, where common core math was developed around the mind of girls, so that it may be more accessible and easier to learn for them. Basically taking traditional math and re-interpreting it through a verbal mindset. \n\nBefore I get into the education aspect, let me briefly refute his \"women suffer for being women\" bulk. \n\n\"I was not bombarded by images and slogans telling me that my true worth was in how I look\"\n\nReally? \n\n[Men are idiots](http://www.sheknows.com/entertainment/articles/1075515/commercials-sexist-towards-men)\n\n[Unrealistic male body standards](http://www.huffingtonpost.com/jessica-lovejoy/body-image-issues-are-not-just-for-women_b_5034285.html)\n\nThe same issues exist for men and boys. We just don't talk about it. In the second article, where a boy posted a picture saying \"It's just as hard to be Ken as Barbie,\" the response was \"suck it up, white boy.\"\n\nWhen it comes to women, there is boundless empathy for women to be who they are and define themselves. When it comes to men and boys, it's \"sit down and shut up, because your feelings don't matter.\" \n\nNot only that, but women perpetuate the unrealistic expectations of male appearance. Men are willing to date down, and to date a variety of body types. Curvy? Sure! Slim, that's hot! Big booty? Sign me up! \n\nWomen? Not so much. Studies show women typically will not \"date down.\" So if a woman makes more than a man, chances are she will not date him. Even if he is more attractive. He has to be both attractive and successful. And attraction is more narrowly defined. Under 5'10\"? Move along, shorty. Chubby? Please. If you don't have chiseled abs and broad shoulders, you need not apply. Male pattern baldness? HAHAHAHA\nAnd I don't want no scrub.\n\n\"I was not overlooked by teachers who assumed that I did not understand a tough math or science concept was, after all, because of my gender\"\n\nIt's obvious from this statement that he's white knighting for attention, not speaking from experience. Because women make up 70% of teachers, and girls actually get better grades for the exact [same work as boys](http://www.returnofkings.com/75159/study-shows-girls-get-better-grades-for-the-same-work-as-boys). There is inherent gender bias in schools, but it's not against girls. \n\n\"Jared is autistic and he suffers from Lupus and avascular necrosis in both his hips.\" He wrote this editorial because he's a social outcast, and this is likely the only attention from women he's ever gotten. I know that's harsh. But he's whiteknighting for attention, looking for a pat on the cheek because he can't get a kiss, and his perpetuation of false bias against girls in education is harmful.\n\n[Common core for girls](https://www.americanprogress.org/issues/education/reports/2014/10/28/99435/for-women-and-girls-the-common-core-is-a-step-toward-greater-equity/)\n\nThe feminist agenda is based on lies and misrepresentation, with the the core ideology that women are perpetual victims. This is why women who truly believe in equality and the capability of women reject it. Frankly, it's insulting. It's an ideology that, at it's core, removes the agency of women, by both making them into permanent victims and diminishing the value of their choices. \n\nLet's look at that article. \n\n\"In particular, girls of color and girls from low-income backgrounds underperform academically compared with their white, higher-income peers.\"\n\nFirst, it perverts a race and socio-economic issue into a gender-based one. It co-opts the struggles of minorities and poor people into a gender-based narrative, and by doing so, removes the focus from those disenfranchised groups. Instead of focusing on black and poor people in education, we focus on women. And so instead of developing a plan around providing those subgroups with equal opportunities to quality education, we developed common core. \n\nMisleading society to believe that women are suffering from \"the patriarchy\" by changing the narrative is not only morally reprehensible, it has a real negative effect on those groups who are truly suffering. By framing the education gap in racial and economic backgrounds as a gender issue, feminism has prevented those groups from receiving the redress they need and deserve. \n\nBy it's own damn source, linked as a PDF in the article, you can see that white girls (39% SCI/44% MAT) perform better than both all boys (35% / 36%) and girls (28% / 35%), in both science and math (using the National 8th Grade Assessment proficiency levels). Were it not for the extremely low outliers of black (9%) and hispanic (13%) girls, girls as a whole would likely perform just as well as boys in science. And they already perform just as well as boys in math (35% vs. 36%). \n\nAnalyzing the data correctly, the question isn't, \"why are girls performing worse in science and math?\" but \"why is there such a large disparity between minority girls and their boy counterparts, in science proficiency?\"\n\nBut instead of focusing on the real issue, that minority girls aren't connecting with their science education, and that minorities, as a whole, are receiving a poorer education than their white counterparts, this article talks about how girls the nation over \"also often lack access to high-quality, rigorous courses, particularly in science, technology, engineering, and math, or STEM.\" Which is total and utter bullshit. That access is based on socio-economic background, not gender. It should be overtly obvious that there is no barrier to entry girls face in the same school as boys, but feminism wants to paint a picture of female repression. So it goes on to selectively discuss lower rates of AP test takers in specific STEM fields. If girls are taking AP STEM classes at lower rates than boys, it MUST be because they simply don't have access to those classes, there must be something preventing them from enrolling, whether that be patriarchal gender norms, or a systemic failure to prepare them, right?\n\n\"Girls and students of color take the Advanced Placement, or AP, exam for computer science at lower rates and pass less frequently than boys and white students. About 30,000 students took the most recent AP exam for computer science...Less than 25 percent of test-takers were girls...Girls are underrepresented among AP test-takers in nearly all STEM fields. In 2013, for each female student that took the Physics C exam, more than 2.5 male students took the same test. Boys took the the Physics B exam at a rate of nearly 2-to-1 compared to girls and took the Calculus BC exam at a rate of nearly 1.5-to-1 in the same year.\"\n\nBeing an informed individual, I could smell the bullshit on this immediately, so I decided to go straight to the source, and found the [AP program summary report.](https://secure-media.collegeboard.org/digitalServices/pdf/research/2016/Program-Summary-Report-2016.pdf)\n\nThey use 2013 numbers, but this is a 2016 report, so I expect some variance, but if the problem is systemic gender bias, the patterns should hold. Let's see.\n\nOut of 37 tests, women test takers outnumber men in 25 categories. Of the remaining 12, many were so close as to be negligible (4 categories separated by less than a 1% margin). So of 37 tests, female students were approximately equal to or above the number of male test takers in 29 of 37 tests. \n\nOh, but we're discussing STEM. It's a safe assumption that every test not used as an example in the article was dominated by female students, or at least had equal representation, because their selective citation bullshit is key to painting their narrative of female repression. Again, let's see.\n\nIn biology, female students accounted for over 50% more test takers than males. In calc AB, the variance was in favor of males by less than 2%. In chemistry, less than a single percentage point. In psychology, about a 90% gap above men. In statistics, almost 4% in favor of girls. \n\nSo literally the only variances that favored men were listed in the article. Notice how it tried to present those examples as a representation of the gender gap problem, not as the comprehensive list of every credible disparity in favor of males?\n\nIt's so bias it's almost laughable, except for the fact that people buy into this shit and boys are suffering for it the nation over. So because males represent 75% of computer science students, there's obviously a barrier to entry for women. Clearly girls don't have access to equal STEM education. The fact that girls represent almost 70% of all psychology test takers, or 65% of biology test takers, just means that feminism is working, and girls are taking their rightful place above men, though, right? \n\nThe fact of the matter is, girls don't like computer science. It's really simple. And is that such a big problem? Is it not enough that girls already match or dominate in 78% of AP classes? Are boys not allowed to have ONE educational field that they dominate without reproach, for simply being drawn to it? \n\n\"Girls are underrepresented among AP test-takers in nearly all STEM fields\" I've shown that that was a blatant, boldfaced, flat-out lie. Not only that, they are indeed overrepresented in advanced high school education. Girls were 56% of AP students in 2016.\n\nSo when do we decide we've reached equality? When girls are the majority and outperform boys in every category? Because the current statistics show that girls have every opportunity as boys do, if not more. Of course, the article ends with the all-time favorite feminist myth \"wage gap.\" Which, no matter how many times has been proven to be unequivocally false, a misrepresentation of statistics that doesn't take into account career field, tenure, etc., it still gets repeated ad nauseam. Similarly, we still propagate this \"girls are struggling\" bullshit, and focus our attention and resources on fixing that nonexistent issue.\n\nThe result is a lower quality education for both girls and boys. In grade school, he may not have been told that Legos were not for his gender, but god forbid the author of your editorial wanted to pick up a baby doll. The treatment amongst girls and boys for crossing the gender barrier is exponentially less forgiving to boys than girls. In fact, most little boys will accept the tom-boy girl once she proves herself to them. Boys will at first reject, and protect the group, but once you're in the group, you're in. A girl that proves she can hang with the boys is accepted. On the other hand, little boys who want to play with dolls or dress effeminately will face backlash from all sides of their peers. Adult society has come to accept them, and even welcomes them, as it falls in line with the pervasive feminist agenda. \n\nBut little girls want nothing to do with effeminate little boys, because they're still boys - they can't ever be part of the club. And other little boys will mercilessly torment them for going against the status quo. They will never find popular acceptance, and their isolation and abuse will only grow in time. There's a reason \"that's gay\" became synonymous with \"that's stupid\" in the 90's; without their knowledge, children were perpetuating homophobic attitudes that they absorbed from their parents and society, and it expressed itself through cognitive linguistics. Now, despite widespread support of the LGBT community, my generation struggles to overcome internalized homophobia that it wasn't even aware of, because it's been incorporated into their thought processes since before they even knew that \"gay\" meant anything other than \"stupid.\" \n\nThat doesn't take into account the hostile environment school is for boys, in general, now. It's no wonder boys are dropping out and performing worse at alarmingly high rates when \"no tolerance\" policies are the norm - when typical boy behavior, like roughhousing/mock fighting and fascination with guns and violence is outlawed. When you get detention for playing tag, when you can't wrestle with your friends like you do at home in your backyard, when you get suspended for drawing a picture of a gun, when GI joes are the devil's playthings, why would you like school? They've criminalized all the ways a young boy is naturally inclined to enjoy himself during his free time, and then have literally redesigned the entire education system and process to focus on girls - on the way they think and what they're interested in. Then boys grow up, begin looking at colleges, and are told that they've had all the opportunities and help, that no one wants them because they aren't a \"special group,\" and that they have to be twice as qualified as the next kid to make it anywhere. You're a white boy applying for a scholarship? Can't you just pay in privilege? Please, scholarships are for the disadvantaged women. You know, the one's who outnumbered you in your AP biology and psychology classes. And 20 others. Because they're underrepresented. Can't you just join the military and die for us instead?\n\nBut really, at the university level, there is absolutely no shortage of scholarships available to women to enter STEM fields. In fact, some universities went so far as to demand equal enrollment of women as men, creating an artificial equality that actively denied men the right to an education, all for the appearance of equality. The results were universally disastrous, with many programs being forced to shut down because they couldn't meet minimum enrollment requirements, with women as the limiting factors. There are universities that went a year without a chemistry department because enrollment fell when women decided they truly didn't want to be a part of the STEM program they were pushed into, and transferred to majors that were more suited to their actual desires. The fact is, most women don't see an appeal in classic STEM fields, but we've decided that equality doesn't mean equal opportunity, but equal outcomes. So it isn't enough for women to have more and easier access to STEM programs, they must also choose to enter those programs, even when it makes them unhappy. We're fighting for equality that no one actually wants; we're telling women to choose STEM, even when they don't want to, and in doing so are actually regressing equality by limiting women's choices, in admonishing any decisions they make that don't align with the narrative. We're telling women that their choice to enter social work isn't as valid as entering hard sciences. This is despite the fact that women provably prefer fields of study that involve social interaction and the study of people - fields where their feelings are considered important and pivotal, rather than dismissed in totality, like the hard sciences. This is why when women choose a hard science, they often choose psychology, or else in the medical field, pediatrics or general medicine. But despite the fact that psychology is an overwhelmingly female dominated field of study and profession, there is no call for a 50% outcome. Feminist ideology has conflated the belief that equal access, which is important, should result in equal outcomes, which is not important: outcomes are the result of personal choices, people making decisions that make them happiest. And by demanding equal outcomes, feminists are diminishing those choices of women to pursue the paths they feel a natural inclination for. \n\nEquality is recognizing that men and women both face unique struggles that may limit them from pursuing their hearts' desire, and trying to alleviate those disadvantages; feminism is the belief that there is no core difference between men and women, and therefore any difference in gender representation is a result of patriarchal repression, albeit systematically directly or systemically indirectly (eg. discrimination in admittance/hiring versus constructed gender roles and societal pressure/judgement). The result is that women feel diminished for following their dreams and face undue scrutiny for being gifted opportunities they didn't earn, but didn't ask for. The author addresses this scrutiny in his last paragraph, but fails to question where that scrutiny stems from. Feminism is creating the problems it seeks to address. And men are suffering as well. Besides the arbitrary rejection from the pursuit of their desired education and careers, the barriers to entry and exclusion from the education process has resulted in worse performance by men and boys at literally every level of education, from grade school through college. Not just worse than previously, but worse than women as well. It's not that men have it better but are seeing a decrease in their disparate well-being, but men are already worse off and are seeing steady decline.",
    "title": "My response to a friends re-post of a feminist editorial regarding female students and their 'plight'; or, How Feminism is Hurting Education for Everyone",
    "subreddit": "MensRights",
    "timestamp": 1493398368,
    "score": 54,
    "keyword": "man engineer"
  },
  {
    "text": "Dutch man creates underwear specifically designed for circumcised men. Dutch architectural engineer Rinke Feenstra has founded Ynside Underwear – a new range of underwear that uses organic material and is designed to help soften and restore the skin of the exposed glans of a guy’s circumcised penis.\n\n\nWe caught up with Feenstra to talk circumcision, and how his underwear could be a game-changer for men around the world.\nRinke Feenstra, founder of Ynside Underwear.\n\nAt what age were you circumcised?\nI was three years old. It was done for medical reasons – I was diagnosed with Phimosis, a condition where the foreskin is too tight to be pulled back over the head of the penis.\n\n\nIs it common in the Netherlands for boys to be circumcised?\nI grew up in the rural north of Holland, where circumcision is rare. Around the cities it’s a bit more common because of different cultures.\nI was the only one who was circumcised on my soccer team, which made me aware of the fact that I was a little bit different.\n\n\nWhen did you start to think that your circumcised penis might have a different sensitivity to an uncircumcised penis?\nAs a teenager and as a student, I read things online that made me realise that my sensitivity might have been impacted by my circumcision.\nAt that point I was mad that procedure had been done to me, and I talked about it with my parents.\nThere was a lot of information available online and I realised that I was part of a much larger community of circumcised men.\n\n\nWhat was the process that led you to start thinking about creating underwear specifically for circumcised men?\nI was doing a lot of cycling, and experiencing friction on my penis. I started to focus on my condition as a problem to be fixed, but in doing so I grew more frustrated.\nThe whole experience brought me to a turning point, I decided that it’s better to focus on the positive and make the best of it.\nI was educated as an architectural engineer, developing a critical view of things I see in my surroundings. As a child I also grew up with very health-conscious parents. I think that this combination led me to think about finding a natural, nourishing, and protective solution.\nBack then I didn’t know that I was going to create a brand. That thought grew during the years after because I wanted to give men the opportunity to use my designs and feel the difference.\n\n\nHow long was the design and testing process until you found a product that you were happy with?\nI started making concepts in 2007, and began distributing some test designs in 2014. The first production run took place at the end of 2015.\nMy prices are higher than your average underwear because they’re made from silk. We researched and tested the most skin-friendly fabrics and silk gave us the best results. But it’s not just your regular silk, but an animal friendly, certified organic, and top-quality silk that’s treated carefully throughout the entire process.\nOn average, the genital skin is about 90% more absorbent than other skin areas, leaving it extremely vulnerable to toxins and other irritants. Silk is a protein fibre, and the protection it gives helps to repair and nourish your intimate skin.\nWhen rethinking the design of underwear, we integrated the most important comfort and health aspects, including the extra space pouch, and special protective elements.\nOur products are manufactured in Europe, and our designs have been sold across 12 countries on five continents.\nWhat’s really pleasing is that preliminary scientific tests conducted in the US have proved an increased sensitivity and a better skin structure as a result of wearing our designs, so we’re really motivated to do more research on this next year.\n\n\nWhat’s the response been like, from circumcised men who have tried your underwear?\nGreat, we have a lot of repeat customers.\nIt’s still quite a challenge to get men interested in the products. Circumcision is a taboo, and here in Europe many man don’t see the point of my focus.\nAlso men aren’t used to being open about personal things or feelings. There’s still a lot of ego hidden in a man’s pants.\n\n\nWould this style of underwear potentially also have benefits for men who are not circumcised?\nYes, totally. Silk boosts a man’s comfort and sensitivity naturally. In general, our organic, animal-friendly silk is a nourishing, soft fabric that prevents irritations. For example, if you’re a guy who shaves or trims your pubic hair, then you’ll benefit from the softness of our underwear.\nSilk is also a very good temperature-regulating fibre, combined with the extra space pouch which supports a man’s reproductive health too.\n\nThe underwear is available for pre-order, if someone places a pre-order with you, how long until you expect to be able to deliver the underwear?\nBecause we’re a young company, the crowdfunding campaign we’re running now helps us to pre-finance the next stage. We’re ready to send our improved collection into production.\nDelivery will be made in late February 2018, but we’ve got gift cards available so they’re the perfect Christmas gift.\n\nhttps://www.gaystarnews.com/article/ynside-underwear-circumcision/#gs.LtMe5pY",
    "title": "Dutch man creates underwear specifically designed for circumcised men.",
    "subreddit": "MensRights",
    "timestamp": 1512237731,
    "score": 33,
    "keyword": "man engineer"
  },
  {
    "text": "Some thoughs on prostitution and exploitation, courtesy of the Askreddit thread on secrets So this will be an awkward feature in my post history...\n\nIf you scroll through the [current askreddit thread about deep, dark secrets](http://np.reddit.com/r/AskReddit/comments/68l83g/serious_what_secret_could_ruin_your_life), you might be surprised by how many women have occasionally done a little light prostitution. And also by how many other women find the idea intriguing or appealing. Before anyone accuses me of slut shaming or anything: I think there's no shame in sex work and no shame in employing sex workers' services. And neither am I extrapolating the statements from the women in the thread to all women.\n\nThe main thing that struck me about it was the contrast to the narrative in recent years about how prostitution equals human trafficking. I've seen sex-negative feminists in various places on the internet and other media decry prostitution as being all but equivalent to human trafficking. There seems to be a concerted effort to A) shape the narrative of sex work to one of exploited and victimized women, and B) vilify and shame any man who has sought a prostitute, because he's automatically an enabler of a horrendous human rights violation. \n\nHowever, I think reality seems more in line with what's being reported in the Askreddit thread. Unless you're picking up someone who's actually hooking on the street, you're probably getting an independent operator who has made the voluntary choice to earn a little easy cash. The prostitutes themselves don't seem to be experiencing much exploitation, but the peanut gallery is seeing it everywhere. I can anecdotally add that I've personally known and even dated a few women who have sometimes traded sex for money, and there were no pimps or other boogeymen involved there, either.\n\nI guess my point is this: if you've been taken in by the idea that prostitution is necessarily evil because it exploits women and is a human trafficking boogeyman, you might want to give the comments in that thread a look. [edit: I've linked to three of the top level replies in my own comment [below](https://www.reddit.com/r/MensRights/comments/68pn2o/some_thoughs_on_prostitution_and_exploitation/dh0oyhg/)]\n\nSomeone will invariably wonder what this has to do with men's rights. Since time immemorial, there have been men willing to trade extra resources for sex, and there have been women willing to trade sex for extra resources. So prostitution is a men's rights and a women's rights issue and will continue to be for the foreseeable future. Also, sex-negative feminism pretty much always impinges on men's rights (not to mention women's) in some way or anther. And while some people complain that /mensrights focuses too little on rights and too much on anti-feminism, I would argue that this is an example where a large segment of feminists are attempting to engineer social attitudes and curtail the range of acceptable male behavior (both legally and through social sanctions).",
    "title": "Some thoughs on prostitution and exploitation, courtesy of the Askreddit thread on secrets",
    "subreddit": "MensRights",
    "timestamp": 1493682175,
    "score": 20,
    "keyword": "man engineer"
  },
  {
    "text": "Arkansas Dad - Need advice Maybe this isn't the correct place to post.\n\nI live in Arkansas.  I'm 32, and I feel hopeless.\n\nI made the mistake 2 years ago of getting the girlfriend pregnant (we did this intentionally).  At the time she had 4 kids from 2 fathers.  3 from the first batch when she was 18ish, and 1 from her most recent man.  The batch of 3 are all now 18+ and seem well adjusted, but they spent most of their lives without their father.  The youngest was maybe 1, and I was helping raise him.  I was basically there from 3months old on.\n\nWe decided to have another so that the youngest would have a sibling.  I loved him very much, and I wanted my own kid, and it just seemed to make sense at the time.\n\nNow, she has 5 kids from 3 fathers, and basically none of them have been raised by the father in any meaningful way.\n\nWe split up around last August.  She got her own place, but I tried like hell to keep things together until she had me arrested at her house after a fight for Criminal Trespassing.  I was sleeping in her bed (admittedly drunk, so was she) after a fight.  I woke up to the cops telling me to put my clothes on.  I had been living there for more than 30 days even though I still kept my own place incase things went south again. I wasn't on the lease so to jail I went.\n\nRight now I've seen my daughter for about 6 hours in the last 6 months.  I'm missing all the milestones, I just recently missed the first steps and now she's walking like a pro.\n\nI've been paying child support in accordance with the chart the state provides since we split up.  Initially $100/week and then up to $140/week when I got a substantial raise at the beginning of the year.  I made the mistake of paying her in cash until a few months ago, when I setup auto-payment of checks mailed to her.\n\nWe have never been to court.  I'm not on the birth certificate, and there has been no DNA test.\n\nI've talked to a few lawyers and have told me that in Arkansas the best I can hope for is visitation rights and no actual custody.\n\nShe keeps threatening to move to TX where she is from.\n\nHere is the kicker.  I'm all math, no empathy and I get internally distracted for long periods of time.  First child I ever touched was 2 years ago, and they still terrify me.  Simply put, I'm not capable of handling an infant for long periods of time.  I want an agreement that says that I will get visitation a few times a week until she is maybe 4 or 5 at which point I would want 50/50 custody.  The lawyers tell me this looks really bad to the courts and they won't go for it.\n\nI just want to see my daughter and be part of her life as best I am capable.  I'm depressed as shit right now.  Any advice would be helpful.  I live in NWA if that makes any difference.\n\nEdit: it's also probably worth noting that I've got a MSBA and am currently employed as a engineer making 70K/year and she doesn't have a high school diploma and works at a daycare making minimum wage...",
    "title": "Arkansas Dad - Need advice",
    "subreddit": "MensRights",
    "timestamp": 1502636816,
    "score": 11,
    "keyword": "man engineer"
  },
  {
    "text": "Reading this practically broke my brain - not just what was written, but *where* - Rebecca Solnit (author of 'Men Explain Things To Me') - in the London Review of Books No joke - this is the *first* sentence of a 3,500+ word jeremiad ('essay' is clearly not applicable in this case):\n\n> Women told me they had flashbacks to hideous episodes in their past after the second presidential debate on 9 October, or couldn’t sleep, or had nightmares.\n\nLet me be clear - I think Trump is a buffoon. I stated this publicly long, long before his election. Just before his election, after the day of his election, and nothing he has done since has persuaded me from this opinion (it has in fact entrenched it).\n\nBut despite that, the way Solnit chooses to describe him in this essay - even to me, someone who is **not** a fan of Trump - is just beyond fucking absurd:\n\n> Trump roamed, loomed, glowered, snarled and appeared to copulate with his podium, grasping it with both hands and swaying his hips, seeming briefly lost in reverie. The menace was so dramatic, so Hitchcockian, that the Hollywood composer Danny Elfman wrote a soundtrack for a video edit playing up all the most ominous moments. \n\nReally? WTF???\n\nAnd yet still people find it hard to believe Clinton's campaign lost her the **actual** election (let's leave aside the popular vote issue for the moment - and perhaps longer than a moment, but that's a discussion for another day).\n\nMy italics in all quotes that follow:\n\n> ‘Watching Trump lurching behind Hillary during the debate felt a bit like a zombie movie,’ Elfman said. ‘Like at any moment he was going to attack her, rip off her head, and eat her brains.’ *Friends told me they thought he might assault her; I thought it possible myself as I watched him roam and rage.*\n\nIt's often said these days that 'hysteria' is a gendered slur on the grounds that the etymology of the word is, according to the OED,: \"via Latin from Greek *husterikos* ‘of the womb’, from *hustera* ‘womb’ (hysteria being thought to be specific to women and associated with the womb).\"\n\nBut ... almost no one who uses the word actually *knows* that this is its origin and on that basis it is a point of near total irrelevance to raise it at all - for its primary modern meaning (from the same dictionary) is \"a wildly emotional and exaggerated reaction\".\n\nTrying to claim that people *actually* and *genuinely* believed that they thought Trump \"might assault\" Clinton - on live television to tens of millions of Americans and that Solnit \"thought it possible\" herself is - *surely* - the very definition of hysterical, no?\n\nBelieve it or not, Solnit has made these points in just 253 words out of over 3,500! \n\nShe continues:\n\n> Like many men throughout the election, [Trump] appeared to be outraged that she was in it. The election, that is. And her space.\n\nAnd continues:\n\n> Earlier in the campaign he’d urged his supporters to shoot her. \n\nThis is so obviously false that it literally breaks my brain that the editors of the *London Review of Books* (LRB) allowed it to be published. Now don't let's be mistaken - the LRB is a Left, even far Left, organ and unashamedly so - and fair enough, right? Everyone is entitled to his or  her point of view, right? (Excuse the TYT Cenk-like 'right?', 'right'? verbal tic there). \n\nYet the calibre of its usual contributors includes the likes of Professor of the History of the Church at the University of Oxford, [Diarmaid MacCulloch](https://en.wikipedia.org/wiki/Diarmaid_MacCulloch),  Professor of Classics at the University of Cambridge, [Mary Beard](https://en.wikipedia.org/wiki/Mary_Beard_(classicist)), Professor of History at Columbia University, [Adam Tooze](https://en.wikipedia.org/wiki/Adam_Tooze), and Professor of Early Modern History at Queen Mary University of London. [Miri Rubin](https://en.wikipedia.org/wiki/Miri_Rubin).\n\nMy point being that even if you disagree with the beliefs and politics of such people as those I just mentioned, at least you can concede that they are not complete imbeciles that produce utterly baseless trash such as Trump had \"urged his supporters to shoot\" Clinton.\n\nIf that were **actually** the case, then Trump would be incarcerated right now. But not only is he **not** in prison, but he is in fact the President (elect).\n\nBut, perversely, that is yet just more grist to Solnit's mill - on the particular version of Bizarro world that she must surely inhabit, the very fact that Trump has not been incarcerated on the grounds of that frankly ludicrous allegation is - the reader is left to infer - the very proof that the United States is a society that - in the memorable words of of Chloe Angyal - [\"hates women. Just ... hates us.\"](https://www.youtube.com/watch?v=wbfKzXa6pjg) (Angyal was, notoriously, saying this to [Sabrina Rubin Erdeley](https://www.theguardian.com/media/2016/oct/20/rolling-stone-reporter-admits-mistakes-in-jackie-article) following the publication of *that* *Rolling Stone* story ... you know ... the one that was [total and utter bullshit](http://www.nydailynews.com/news/national/rolling-stone-writer-uva-rape-story-nightmare-article-1.2698465)).\n\nSpeaking of which, Solnit is at this point just getting into her stride ...\n\n> Trump is patriarchy ...\n\nShe's dropped the 'P'-bomb already ... still barely past the beginning of this text by the way.\n\n> Trump is patriarchy unbuttoned, paunchy, in a baggy suit, with his hair oozing and his lips flapping and his face squinching into clownish expressions of mockery and rage and self-congratulation. \n\nWell, he is a 70-year-old man after all. \n\nI mean, Heaven fucking Forefend that [media commentators should see any reason whatsoever for shying away from making personal comments on the physical appearance of old people in the public eye ...](https://www.nytimes.com/2016/04/17/fashion/mary-beard-against-internet-trolling.html?_r=0)\n\n> He picked as a running mate buttoned-up patriarchy, the lean, crop-haired, perpetually tense Mike Pence, who actually has experience in government, signing eight anti-abortion bills in his four years as governor of Indiana, and going after Planned Parenthood the way Trump went after hapless beauty queens. \n\nIn other words, she suggests that Pence is 'grabbing women by the pussy' in his own way - by taking a stance against abortion. Just for the record, I personally do not oppose abortion - but that's not really the point.\n\nWhat *is* the point is how on Earth is Solnit going to square this narrative with the election results that show that, actually, a surprising number of women voted Trump, not Clinton (why this is just automatically assumed to be 'surprising' is a fascinating question in itself).\n\nAnd it is on this question that Solnit jumps the shark ... or she would jump the shark if that shark was atop the Empire State Building ... smoking a cigar and wearing a monocle ... while playing the base guitar on its fins ... (my italics)\n\n> The Republican platform was, as usual, *keen to gut* reproductive rights and *pretty much any rights that appertained to people who weren’t straight, or male, or white.*\n\nUh-oh, here we go ...\n\n> Misogyny was everywhere. \n\n> Trump’s surrogates and key supporters constituted a sort of misogyny army ... The army included Steve Bannon, who as head of the alt-right site Breitbart News *hired Milo Yiannopoulos and helped merge the misogynistic fury of the men’s-rights movement with white supremacy and anti-Semitism to form a new cabal of far-right fury*.\n\nActually, I agree that Bannon is an asshole, but that hardly justifies the wild and paranoid accusation that \"Milo Yiannopoulos ... helped merge the misogynistic fury of the men’s-rights movement with white supremacy and anti-Semitism to form a new cabal of far-right fury\"\n\n> It seems telling that the rise of the far right and the fall of truthful news were to a meaningful extent engineered by a television network that was also a miserable one-man brothel. *But that old right-wing men are misogynists is about as surprising as that alligators bite.*\n\nWell, that isn't racist or bigoted at all. / s\n\n> ‘No advanced step taken by women has been so bitterly contested as that of speaking in public,’ Susan B. Anthony said ... \n\nSusan B. Anthony you say? Is that the same Susan B. Anthony who said:\n\n> “You have put the ballot in the hands of your black men, thus making them political superiors of white women. Never before in the history of the world have men made former slaves the political masters of their former mistresses!”\n\nI'm not sure, but [I believe so](http://intersectionalism.tumblr.com/post/130662354761/elizabeth-cady-stanton-1815-1902-social), yes.\n\n> No advanced step taken by women has been so bitterly contested as that of speaking in public,’ Susan B. Anthony said in 1900. ‘For nothing which they have attempted, not even to secure the suffrage, have they been so abused, condemned and antagonised.’ Or as Mary Beard put it last year, ‘We have never escaped a certain male cultural desire for women’s silence.’\n\nSolnit has yet more:\n\n> One got the impression that any power a woman had was too much, and that a lot of men found women very scary [...] Trump’s slogan ‘make America great again’ seemed to invoke a return to a never-never land of white male supremacy where coal was an awesome fuel, blue-collar manufacturing jobs were what they had been in 1956, women belonged in the home, and the needs of white men were paramount.\n\n> One might argue she lost because of ... years of negative media coverage; or because of foreign intervention designed to sabotage her chances; or because of misogyny. \n\nMedia coverage like the time they showed that when she said she remembered flying into the former Yugoslavia under sniper fire ... she hadn't?\n\n> *I’ve always had the impression –from TV, movies, newspapers, sport, books, my education, my personal life, and my knowledge of who owns most things and holds government office at every level in my country – that white men get a lot of attention already.*\n\nI see.\n\n> To be a feminist you have to believe in your equality and rights, which can make your life unpleasant and dangerous if you live in a marriage, a family, a community, a church, a state that does not agree with you about this. For many women it’s safer not to have those thoughts in this country where a woman is beaten every eleven seconds or so and women’s partners are the leading cause of injury to them. And those thoughts are not so available in a country where feminism is forever being demonised and distorted. \n\nSpeaking of \"demonised and distorted\" I'm having trouble digesting quite what Solnit means by the following point:\n\n> It seems it’s also worse to vote for a racist if you’re a woman, because while white women were excoriated, white men were let off the hook (across every racial category, more men than women voted for Trump; overall 54 per cent of women supported Clinton; 53 per cent of men voted for Trump).\n\nWhat?\n\n> ... one could argue that Trump had said, incessantly, aggressively, I’m a white man, vote for me, and even that Sanders implicitly conveyed that message. \n\nCould one?!?\n\n> Many supporters fell silent or took to supporting [Clinton] in secret ...\n\nEh? What?\n\n> ‘I’ve come to believe,’ Sady Doyle wrote, ‘that, in some ways, saying nice things about Hillary Clinton is a subversive act.’\n\nWhat? Eh?\n\n> Mentioning that [Cinton had] won the popular vote *upset many of the men I am in contact with* ...\n\nNone of the women then?\n\n> ‘With their deep belief in their own special monopoly on objectivity, slightly too many men assure me that there is no misogyny in their subjective assessments or even no subjectivity and no emotion driving them, and there are no grounds for other opinions since theirs is not an opinion.’\n\nSolnit *really* fucking hates white men.\n\n> A lot of people, *particularly white men*, could not bear her, and that is as good a reason as any for Trump’s victory. ... They did not blame themselves or the electorate or the system for failing to stop Trump.\n\n**TL;DR** What's above is actually the TL;DR believe it or not - you can read the thing in its entirety [here](http://www.lrb.co.uk/v39/n02/rebecca-solnit/from-lying-to-leering)",
    "title": "Reading this practically broke my brain - not just what was written, but *where* - Rebecca Solnit (author of 'Men Explain Things To Me') - in the London Review of Books",
    "subreddit": "MensRights",
    "timestamp": 1484426104,
    "score": 9,
    "keyword": "man engineer"
  }
]